{
  "article_id": "91048df2ed86",
  "url": "https://www.myjoyonline.com/manchester-city-hysterical-and-hated-at-times-pep-guardiola-is-already-the-greatest/",
  "title": "Manchester City :  Hysterical and  hated at time - Pep Guardiola is already the greatest",
  "date": "20230609T131500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nPep Guardiola will become the first manager in history to win the Treble twice if his Manchester City side beat Inter Milan to lift the Champions League trophy on Saturday.\nHaving already achieved the holy grail of league title, domestic cup and European glory with Barcelona in 2009, Guardiola and his City players are one win away from becoming the 10th team to ever achieve the feat.\nBut, win or lose in Istanbul on Saturday, Guardiola is already the greatest coach football has ever known.\nNot because he wins things - 16 major trophies and counting - but because he has changed football.\nI recently met up with one of Europe's most coveted young coaches and the conversation turned to what made the 52-year-old Spaniard special.\n\"Pep gave an instruction to Joao Cancelo,\" the coach told me. \"I heard it and all I could think was: 'I know what you are about to do and I can't defend against it.'\"\nThe coach said what made Guardiola so special is his search for perfection is relentless, even though it doesn't need to be. His team are good enough to win anyway. But he still pushes for 100%.\n'Light years ahead of the rest'\nFormer France, Arsenal and Barcelona striker Thierry Henry recently told Guardiola he is \"the greatest manager of all time\". Others have a similar view.\nManchester City midfielder Fernandinho says he can convince you that what he tells you is what is going to happen in a match. Then gives you all the information you need to deal with the situation.\n\"The way I see football now… I'd never, ever seen it like that before I met him,\" he said.\nRecalling the team talk before Barcelona's 2011 Champions League final success against Manchester United, midfielder Javier Mascherano said that as Guardiola spoke, it was as if he was referring to a game that they were playing there and then.\nHe said: \"You shut your eyes and you were out there in the middle of the action. During the match I was thinking: 'I've seen this already. Pep has already told me about it.'\n\"Everything that he said would happen, happened as he said it would.\"\nManchester City's Ilkay Gundogan describes him as a \"genius who reads the game and covers every situation imaginable\".\nAccording to the late Johan Cruyff, from the moment Guardiola took charge at Barcelona in 2008, all he wanted to do was, \"make football better, take his team to another level\". Former Argentina boss Jorge Sampaoli has called him \"the coach with the most imagination in football\".\nHe has an ability to get the very last drop out of his team and a ruthless, dispassionate willingness to discard players unable to give him total commitment.\nThose qualities, matched by the standard of his players, put him light years ahead of the rest.\n'I thought he was crazy' - where it all started\nAn anecdote that encapsulates Guardiola's philosophy occurred just after he had taken over at Barcelona in 2008.\nHis goalkeeper Victor Valdes explained: \"I remember my first conversation with Guardiola. It was in his office at the Nou Camp. He had a tactics board with two small magnets either side of the goal just outside the box. He said: 'Do you know which players these two are?'\n\"He said: 'These are your centre-backs.' I had no idea what he was talking about and he said: 'When you've got the ball. this is where I want them to be.' I thought he was crazy.\n\"Then he said: 'You'll pass to them. And it's from here we'll build the play.' I still thought he was completely mad. But given I'm a bit crazy myself, I felt in tune with him. So I replied: 'The defenders would have to be brave and want the ball.' Pep said: 'Don't worry, that's my job. I'll make sure they want it.' And that's how it all started\".\nThe door was opened to a new world.\nFrom then on, his job has been to convince players through his training sessions to do what he needs them to do. That is something that goes against the grain for most footballers.\nLet's remember for a moment how football has evolved; it comes from the streets, from each player and his own individual initiative.\nBut gradually it becomes a more organised collective process. While Guardiola has said in the past that \"the player is the one who deserves all the credit\", you sense that he knows that the player without instructions is nothing.\nThis Manchester City side are an optimum version of him. Eleven players all working towards a single idea. A coach's dream.\nThat is no less than he demands. In the past - at Bayern Munich and Barcelona - when he felt he no longer had that, he packed his bags.\n'A schoolteacher you hated at the time'\nGuardiola has pushed football into new directions.\nIn 2008, the prevailing football concept was about solid, organised defensive structures, from which quick transitions were played. Guardiola was the pioneer in constructing a team built not to use the defence as a means of closing the game up, but rather as the starting point of attack.\n\"He is the first coach to start working on what is theoretically called 'the construction phases of the attacking game,'\" explained Pep Segura, a former sports director of Barcelona, and perhaps the person who has studied most the influence and legacy of Guardiola.\n\"He starts by working the exit phase [the building from the back] and then the construction phase, what happens when the ball gets to midfield. He developed those two and started working on the third, preparation phase of the last pass.\"\nHis demands are based on simple principles. Keep possession, play it simple and play it fast.\nAnd sometimes it can come at a price.\nBernardo Silva has admitted in the past to some Portugal team-mates that he has frequently become tired at Manchester City because of the constant repetition and exhausting demands, although it is these measures that have taken him to the level that he is today.\nGuardiola is like the schoolteacher that you only appreciated in later years but hated at the time because he demanded so much more of you.\nNot all players grow under his intensive training demands. Those that progress will do so because they learn a better reading and knowledge of the game, better positioning, and better support for team-mates.\nThere is an enormous psychological pressure on the player to do what he must for the team. In that, we see one of Guardiola's greatest attributes: his ability to change the mentality and thinking of those players that have no desire to be changed.\nSince leaving Barcelona, he has coached Thomas Muller, Franck Ribery, Silva, Kevin de Bruyne, and Jack Grealish, all of whom - despite their forceful personalities - have bought into his philosophy.\nDani Alves once said of Guardiola at Barcelona: \"If Pep had told me to jump off the third tier of the Nou Camp, then I'd jump because I'd think there must be a good reason for it.\"\nGuardiola is constantly on top of every situation, always correcting, always demanding more. Sometimes, his players can get frustrated. It happened with De Bruyne during the emphatic Champions League semi-final win over Real Madrid in May. At one point, the Belgian lost possession, and Guardiola expressed his disapproval. Exasperated, De Bruyne shouted: \"Shut up, I'm fed up with hearing your voice.\"\nThat voice continues to cajole teams towards success. Each each club he has managed, Guardiola has moulded his ideas to fit, without ever giving up on his essence. The basic philosophy doesn't change. Neither do the demands on his players.\nHe spends most of his waking hours planning ways to be one step ahead ahead of his opponents. His sleeping pattern is unconventional, with messages sent to his coaching staff at early hours in the morning. He often relies on long siestas during the day to recharge his batteries.\nHe spends most of the time indoors and his family have developed a routine. His wife Cristina continues running her shop in Barcelona and lives there with son Marius and daughter Valentina. Their other daughter Maria, an Instagram influencer, lives in London. The family get together with the use of a private jet.\n'He can be hysterical'\nNot many in the boardrooms at Guardiola's clubs have understood fully his processes. But they know they work.\nKhaldoon Al Mubarak, Manchester City's chairman, knows he has a leader with an extraordinary capacity for work and sometimes he has to make allowances for some of his insecurities.\nGuardiola prepares everything to win. If he does not get the right results, he becomes \"hysterical\", as a close friend said with humour.\nKhaldoon witnessed that after the first draw of Guardiola's second season. \"It is impossible, I will never be able to do what I want to do, impossible,\" he kept shouting in his private room after the game.\nThe chairman's role is to calm him down and remind him of the club's total support. Guardiola needs the insecurity, the drama to feed himself. If necessary, he even makes drama when there is none. It is a mixture of obsession, the need to control everything. He has to feel that everything matters. It is his way to check if his passion is still there.\nHe has been known to demand a better presentation of the food. He wants the perfect behaviour from security personnel. He likes to see those in reception smile. He wants players to feel the standards are the highest they have ever experienced.\nHe has four short meetings per game. Every season, he has between six and 10 meetings with everyone - from waiters and medical staff to physios and receptionists - in a room at the training centre. Everyone is squeezed like sardines in a can. He reminds them they have to keep pushing.\nIf a Guardiola team wins, outsiders say he is a genius. If he loses, they say he overthinks, the laziest word ever to be used about Guardiola's work. They are missing the point.\nThe standard of excellence does depend on having the very best players, a stick sometimes used to beat him with without understanding the trail he is blazing for new coaches and players.\nThere is more to come. His friends and those closest to him believe that City will be his last club before he takes charge of a national side.\nThe search for perfection continues\nGuardiola is the most advanced coach in the game. His ideas work on the four phases of attack and developing them.\nThe first - the build-up - is the one Valdes has explained. From that opening phase, much depends of having one more player than your opponents in a particular area of the pitch.\nThe second phase - constructing the play - is based on numerical superiority attained by moving players into different positions and lines of attack. Who else would have thought of achieving this by converting John Stones, a centre-back, into one of City's most effective midfielders?\nThe third stage is all about creating the final pass, the assist. This is the one Guardiola believes is still a work in progress.\nThat phase is one he has worked harder on in the last couple of years - the movements of full-backs, centre midfielders and forwards before the last pass. He uses the last 10 minutes of training to do that, instead of letting players do shooting or crossing.\nHe knows, despite City's success, he is not yet there with that third stage, nor with the establishing of the fourth stage, the 'finalising' - the technical coaching term for finishing.\nThere is a sense there that football culture is not yet ready for what he wants to do. Players want to have the freedom to dribble when they want, and shoot when they want - and not when they are told to.\nBut it will happen. It is part of his continuous search to refine the way of thinking about and playing the game.\nMany are watching on and learning. His new football culture is here to stay.\nIn the Premier League alone, there are at least five managers who have been inspired by him - Thomas Frank, Marco Silva, Mikel Arteta, Erik ten Hag and Roberto de Zerbi, soon to be joined by a fifth, Vincent Kompany.\nThe influence is not all one way. Guardiola has taken on board things he has learned from Brighton's De Zerbi.\nBut the world game has felt the impact of Manchester City's manager. Seven of Spain's starting line-up in the 2010 World Cup final came from his Barcelona side. Five of Germany's 2014 winning first 11 came from his team at Bayern. There are the titles, domestic and European, that he has won.\nUltimately, though, his most notable achievement can be found everywhere from the grassroots to the top of the game.\nWhen people thought there was nothing new to invent in terms of how to play football, he proved them wrong. Guardiola has built a reputation for seeing things others don't.\nFresh challenges lie ahead. In two years' time, when his contract expires, he will leave Manchester City. He has been surrounded by people who prepared the ground for his arrival, and who have given him the tools to take the game to a new place. After City, he will receive offers from national teams, where that kind of work will not be possible.\nWhatever happens, though, we should enjoy Guardiola's football - the product of an amazing brain.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n14 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n39 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n41 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 2508,
  "scraped_at": "2026-02-14T01:53:41.889305",
  "_text_extracted": true
}