{
  "article_id": "91096183a26f",
  "url": "https://www.westmeathexaminer.ie/2024/04/19/erling-haaland-a-doubt-for-fa-cup-semi-final/",
  "title": "Erling Haaland a doubt for FA Cup semi - final | Westmeath Examiner",
  "date": "20240419T221500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erling Haaland a doubt for FA Cup semi-final\nBy Andy Hampson, PA\nErling Haaland is a doubt for Manchester City’s FA Cup semi-final against Chelsea on Saturday.\nThe Norwegian striker was surprisingly substituted prior to extra time of the Champions League quarter-final loss to Real Madrid on Wednesday.\nManager Pep Guardiola revealed after the game the 23-year-old asked to be withdrawn but did not give a reason why.\nSpeaking on Friday, Guardiola confirmed the forward had suffered an injury but still gave little indication as to how serious.\nGuardiola said at a press conference: “We will see. It was a tough game, a lot of action, high intensity for both sides.\n“Erling felt something, a muscular issue. That’s why he told me he could not continue.\n“The (doctor) said he had a little bit of niggles, a little problem, we will see how his evolution is in the next hours.”\nIn a more positive update, Guardiola confirmed playmaker Kevin De Bruyne “feels well” having been taken off during extra time against Real for nothing more serious than exhaustion.\nGuardiola feels, given the schedule, it is understandable that players would be tired at this stage of the season.\nHe said: “It’s normal with the amount of games we are playing this season and the previous seasons and not much recovery, and extra time and high intensity.\n“We put a lot of pressure in our game and that’s why the fatigue is there. They are human beings. They are not a machine. We are used to it.”\nThe agonising penalty shoot-out defeat by Real ended City’s hopes of winning the treble for a second season in succession.\nYet they remain on course to repeat the domestic double and Guardiola is determined to bounce back from the midweek heartache.\nHe said: “We don’t have another option. I don’t want us to feel sorry for ourselves.\n“In football, you lose games. We performed at our best and we were not able to win. You have to accept it.\n“We did everything. We know it, they know it, all the world know it, but it was not enough. When it’s not enough, it’s bad night.\n“So congratulations (to Real) and, tomorrow, FA Cup.”",
  "word_count": 368,
  "scraped_at": "2026-02-14T02:07:51.325418",
  "_text_extracted": true
}