{
  "article_id": "910fb4f27509",
  "url": "https://theathletic.com/4561539/2023/05/30/real-madrid-ferland-mendy-luka-modric-karim-benzema/",
  "title": "Real Madrid squad audit : Who will be part of the transition to a new generation ? ",
  "date": "20230530T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid’s Champions League elimination by Manchester City earlier this month confirmed a disappointing season for a team that had started as defending Spanish and European champions.\nCarlo Ancelotti’s team were well beaten to the title in La Liga by arch-rivals Barcelona and thrashed in the semi-finals of Europe’s premier club competition. They won their first Copa del Rey since 2014 while also claiming the UEFA Super Cup and the Club World Cup. But will that be enough for a club that prides itself on lofty standards?\nAdvertisement\nPlanning for next season has already begun. Senior Real Madrid sources, who like the others cited in this article asked to remain anonymous to protect their position, assured The Athletic that Ancelotti would be in charge next season after the defeat to City. But the coaching staff are waiting for official confirmation of this, with meetings scheduled for this week.\nMadrid have already made their first signing of the window — left-back Fran Garcia will rejoin from Rayo Vallecano, which Ancelotti confirmed following his side’s 2-1 win against Rayo last week. But there are likely to be more changes to the squad over the summer.\nSo which players will stay and which will go? The Athletic explains…\nGoalkeepers\nThibaut Courtois (contract expires in 2026)\nOne of the few positives for the club this season. The Belgium international is a big part of the reason Real won the Copa del Rey and made it so far in the Champions League once again. The 31-year-old will continue to be one of the team’s pillars next season.\nAndriy Lunin (contract expires in 2024)\nMadrid’s reserve keeper has never threatened to take Courtois’ place. Lunin failed to impress at the Club World Cup despite playing instead of the injured Belgian and the coaching staff have significant doubts over the Ukrainian — particularly when it comes to his understanding of the tempo of the game and playing out from the back.\nLunin has told others at the club on several occasions that he is determined to stay at Madrid, but he is now set to make a final decision and a meeting with the club is expected to take place soon. Lunin and his father, who is also his agent, met with several agencies in January to discuss the 24-year-old’s options, but any possibility of leaving was extinguished due to his father’s high sporting demands.\nAdvertisement\nFull-backs\nDani Carvajal (contract expires in 2025)\nCarvajal has been a mainstay at right-back since rejoining from Bayer Leverkusen in 2013 and that does not look like changing anytime soon after he renewed his contract two years ago.\nThe 31-year-old Spain international has helped Madrid to five Champions League titles and would have made considerably more than 374 appearances were it not for injuries. He was one of Real’s best performers in the Copa del Rey final against Osasuna — proof he always performs in the decisive moments for his side.\nFerland Mendy (contract expires in 2025)\nMendy was first-choice left-back until a series of injuries interrupted his progress. The 27-year-old Frenchman is highly rated within the club, but his repeated absences this season have led to rumours he might leave.\nMendy wants to stay and he continues to be important under Ancelotti, while officially the club say they are only concerned about his injuries. But the reality is Madrid are keeping an eye on the market and are looking for potential reinforcements at left-back beyond the incoming Garcia.\nLucas Vazquez (contract expires 2024)\nDespite reports Vazquez might be set for an exit this summer, within the club there are no signs he will leave. His solid performances and attitude on the pitch have earned Ancelotti’s trust. Vazquez wants to play more, but he is not looking for an exit at this point.\nAlvaro Odriozola (contract expires in 2024)\nOdriozola has barely featured since he signed from Real Sociedad in 2018, going out on loan twice to Bayern Munich and Fiorentina in search of game time.\nSources at the club say the 27-year-old has been told the best thing to do is to leave, although they expect him to stay regardless. He has played just 92 minutes in all competitions. Those from his entourage say he is now more open to a potential exit.\nAdvertisement\nFran Garcia (new signing)\nGarcia returns to the club that formed him this summer after two successful years in La Liga at Rayo Vallecano, with sources from the player’s entourage saying he will join on a four-year contract. The 23-year-old will start as a reserve left-back behind Mendy in the pecking order.\nGarcia has played a key role for Rayo this season, scoring two goals and providing three assists in 36 La Liga appearances. Bayer Leverkusen were prepared to pay his €10million ($10.7m; £8.7m) release clause in January, but Real exercised their 50 per cent sell-on clause to sign him for just €5m.\nCentre-backs\nEder Militao (contract expires in 2028)\nMilitao started the season in inspired form. Some were debating whether he was the best centre-back in world football, but his performances have taken a turn for the worse since Qatar 2022. Ancelotti summed up that downward trend when he went from describing him as the best in his position to telling the 25-year-old Brazil international to “wake up” following serious mistakes against Girona and Real Sociedad.\nAntonio Rudiger (contract expires in 2026)\nRudiger’s first year at the club has been one of adaptation after signing from Chelsea on a free transfer last summer. The 30-year-old German international started well, experienced a slump lasting a few months and has finished at his very best.\nThat was shown by his performance against City striker Erling Haaland in the first leg of the Champions League semi-final. Rudiger was disappointed not to start the return leg at the Etihad Stadium and, at Madrid’s Valdebebas training ground, everyone highlights his personality, dedication and his constant jokes.\nDavid Alaba (contract expires in 2026)\nAlaba’s case is one of the rare ones in which a world-class player arrives on a free transfer. The 30-year-old Austria international was initially a target in midfield before the departures of Sergio Ramos and Raphael Varane, but since joining from Bayern Munich in 2021, he has carved out a space for himself at centre-back.\nAlaba has featured at left-back on a handful of occasions and has even played when injured — as was the case in Madrid’s 5-2 comeback win against Liverpool in the Champions League round of 16 first leg in February. Both Ancelotti and the club hold him in high esteem and he is seen as a crucial part of Real’s transition this summer.\nNacho Fernandez (contract expires in 2023)\nNacho is one of the few players in the squad whose future remains unclear. He is a one-club man who has made 316 appearances for Real, but he has been disappointed to see his playing time limited for big matches.\nAdvertisement\nThe 33-year-old is not one of Ancelotti’s key players, which means he could leave this summer, but he does have an offer to stay. As Spanish newspaper Marca reported, he has an offer from Inter Milan, while other clubs from Major League Soccer and European teams have enquired about him, too.\nGO DEEPER\nNacho: Could Real Madrid's latest one-club man be on his way out?\nJesus Vallejo (contract expires in 2025)\nVallejo is another player who has rarely been in Madrid’s plans since signing from Real Zaragoza in 2015. He has been loaned back to Zaragoza, Eintracht Frankfurt, Wolverhampton Wanderers and most recently Granada during his time at the club, but his priority is to complete 10 years at the Bernabeu. The 26-year-old still believes his time will come.\nMidfielders\nFederico Valverde (contract expires in 2027)\nValverde’s contract was renewed in 2021 as the club see him as an essential part of their midfield transition, with Luka Modric and Toni Kroos both in the final stretch of their careers.\nThe 24-year-old Uruguay international wants to play in midfield but has found it hard to establish himself there, often playing on the right wing instead. He was one of the team’s best performers before the World Cup but since then has declined. Valverde is also yet to hear about the outcome of his punch on Alex Baena following Madrid’s match against Villarreal last month — he faces a possible suspension of between four and 12 matches for that incident.\nAurelien Tchouameni (contract expires in 2028)\nTchouameni is one of Madrid’s great hopes for the future. Real fended off competition from Paris Saint-Germain and Liverpool when they signed the Frenchman for €80m plus €20m in variables last summer and he is Casemiro’s replacement — the Brazil midfielder left for Manchester United soon after the youngster signed.\nGO DEEPER\nLife after Casemiro: How Real Madrid are moving on with a midfield in transition\nTchouameni started well but has gradually lost momentum and prominence, especially since the World Cup, where he helped France reach the final. But the 23-year-old is guaranteed to stay at the Bernabeu, despite reports to the contrary.\nToni Kroos (contract expires in 2024)\nWhile Madrid have not made anything official, Kroos has signed a contract extension until 2024. The club were keen to renew the former Germany midfielder’s deal before the end of last season, but he always urged the board to make a decision in 2023.\nAdvertisement\nTalks began at the start of this year and proceeded quickly. Real were open to extending Kroos’ contract until 2025, but he opted for just one further year at the Bernabeu. The 33-year-old has made 416 appearances for Real since joining in 2014 and has lifted 23 trophies with them.\nEduardo Camavinga (contract expires in 2027)\nCamavinga is in negotiations over a new contract, which will take his release clause to €1billion — a sign of just how important he has become. The 20-year-old France international has been Madrid’s breakthrough star this season, making 58 appearances across all competitions.\nMendy’s injury problems mean Camavinga has played 18 games at left-back, earning widespread praise in that position. But he does not want to play there and president Florentino Perez does not see his future there either, as he has told Ancelotti himself. Everything seems to indicate he will return to midfield next season.\nLuka Modric (contract expires in 2023)\nModric has already agreed to renew his deal for another season. There were doubts over the Croatia midfielder’s future earlier this campaign, but that changed when he met with Perez before the second leg of the team’s Copa del Rey semi-final against Barcelona last month. Modric told Perez he only wanted to continue for Real and the president told him there would be no problem.\nThat will be music to the ears of Madrid fans, who have become used to the 37-year-old’s tireless performances. But there will be some disgruntlement within the club that Modric has chosen to play on for his country given the risk of injury and fatigue. He has made 487 appearances for Real since arriving in 2012 and has won 23 trophies in his time in the Spanish capital.\nGO DEEPER\nThe curious case of Luka Modric — football's Benjamin Button\nDani Ceballos (contract expires in 2023)\nCeballos has enjoyed a fine season, which has endeared him to Real’s coaching staff, fans and the board.\nThe 26-year-old Spain midfielder has been offered an extension on his deal, which is set to expire this summer, but has yet to accept it. He knows he could fall down the pecking order if Jude Bellingham were to arrive from Borussia Dortmund and he has no shortage of suitors — he rebuffed interest from Atletico Madrid during the last international break and his former club Real Betis are also circling.\nAdvertisement\nCeballos would like to return to his old side at some point, but they think he is more likely to end up in the Premier League or Serie A given he is a free agent. Although Ceballos is not keen on moving back to England as he does not hold fond memories from his loan spell at Arsenal from 2019-2021.\nAntonio Blanco (contract expires in 2024)\nReal youth product Blanco spent a disastrous first half of the season on loan at Cadiz and decided to try Deportivo Alaves instead in January. The 22-year-old defensive midfielder has flourished in Alaves’ promotion chase in Spain’s second division — they will face Eibar in the play-off semi-finals.\nBlanco’s future is unclear, but he still has one year left on his deal at Madrid. He is expected to meet with agent Manolo Garcia Quilon to discuss his options when his present deal with his agency ends.\nWide forwards/attacking midfielders\nVinicius Junior (contract expires in 2027)\nVinicius Jr has become Real’s star forward this season, with 23 goals and 21 assists in all competitions. Both the club and the coaching staff are delighted with him.\nHe is a brilliant talent and he is also taking a stand against the persistent racist abuse he has been facing at grounds across Spain. A global focus shifted to these efforts after last weekend’s fixture in Valencia, when he confronted fans in the stands and the match was interrupted.\nGO DEEPER\nRacism in Spanish football: Why is it so bad? Is there now hope for real change?\nThe situation temporarily led Vinicius Jr to reconsider his future in Spain — although this was not something Real ever contemplated.\nRodrygo (contract expires in 2028)\nThis has been the season in which Rodrygo has fully announced himself at Madrid. The 22-year-old Brazil international is Real’s third top scorer with 19 goals and second-highest assist-provider, with 10 this campaign. Ancelotti has called him an “undisputed starter”.\nAdvertisement\nThe Italian has used Rodrygo on the right wing, as a false nine and as a second striker, but he prefers to play as a No 10. He rewarded his manager’s faith with a starring performance in the Copa del Rey final against Osasuna when he scored a brace and put in a man-of-the-match display to lead Real to the title.\nMarco Asensio (contract expires in 2023)\nAsensio had an offer to renew his Madrid deal but is now set to leave when his contract expires this summer. The 27-year-old forward’s decision came as a disappointment to the coaching staff given his performances from the bench this season, but he wanted a greater role in the team. He has attracted interest from teams including Aston Villa along with other clubs in England and Italy, while multiple reports have linked him to Paris Saint-Germain.\nEden Hazard (contract expires in 2024)\nMadrid have been looking to move Hazard on since the summer of 2021 because of his poor performances and high salary — the former Belgium winger is the highest-paid player in the squad on around €15million per year.\nBut, as The Athletic first reported and the player has subsequently said, he wants to run out his contract at the Bernabeu as both he and his family are very happy in the city. Hazard’s relationship with Ancelotti is not the best, but dressing room sources have emphasised he does not cause any problems. He has made just 76 appearances and scored seven goals for Madrid since his move to the Spanish capital.\nGO DEEPER\nHazard was Real Madrid's record signing. Now he's an outsider who looks set to leave\nSergio Arribas (contract expires in 2025)\nArribas has barely featured for Ancelotti this season, with just four appearances for the senior team, but he is an undisputed star for Real Madrid Castilla, the club’s reserve team, but one that is full of youth players. However, his recent ankle injury is a big problem.\nIt is hard to see how the 21-year-old fits into Madrid’s plans next season, so it is likely they will look to loan or sell him while retaining a percentage of his rights and the option of first refusal. If Castilla are promoted to the second division — they face Barcelona Atletic, the Catalan club’s B team, in the play-offs — Madrid’s reserve side will push to retain him.\nBrahim Diaz (contract expires in 2025)\nOn loan at AC Milan since 2020, Diaz has helped the Italian side win their first Serie A title in 11 years and reach the Champions League semi-finals. The 23-year-old has scored 18 goals and provided 14 assists in 123 appearances for Milan in that time.\nAdvertisement\nThe Italians would love to sign Diaz permanently but he is in advanced talks to renew his deal with Madrid until 2027. A final decision has not been made, but there is every chance the one-time Spain international joins Ancelotti’s squad for next season.\nReinier Jesus (contract expires in 2026)\nReinier has shown signs of promise on loan at Girona this season, but injuries have slowed his progress. Both Madrid and the Brazilian know he will not be part of the squad next season, so they will consider other options.\nThat could mean extending Reinier’s loan at Girona for another season, but the 21-year-old will want a buy clause included in a deal if he goes elsewhere. He also wants to find his best position next season having played as an attacking midfielder, left-winger and right-winger.\nCentre-forwards\nKarim Benzema (contract expires in 2024)\nBenzema’s entourage and Madrid said the Frenchman was set to renew his deal in March but, last weekend, reports in Saudi Arabia said he could be the Kingdom’s latest big-money signing.\nA video posted on social media appeared to show the Al Ittihad vice-president saying “God willing” when asked about his potential arrival. Further reports in Spain have suggested the 35-year-old could now be reconsidering his future.\nBenzema is the captain and one of the most admired players at the club, even if he has endured a mixed season. Madrid see him playing an important role in the short term but are still exploring options to reinforce in attack, as The Athletic has previously reported.\nGO DEEPER\nReal Madrid know they need a striker and are looking at options — here's why\nMariano Diaz (contract expires in 2023)\nDiaz is set to leave Madrid this summer because of his poor attitude and performances. The club never considered offering him a contract renewal and his deal will expire in June. Real have done everything possible to offload him in previous transfer windows and it remains to be seen where the 29-year-old striker goes next.\nAdvertisement\nAlvaro Rodriguez (contract expires in 2027)\nLast summer, many saw Rodriguez as a substitute for Castilla behind the recently signed striker Iker Bravo. But under the guidance of Real legend and Castilla boss Raul, he has progressed to make his La Liga debut this season, scoring his first senior goal against Atletico. Ancelotti has said he will be part of next season’s squad, but it is unclear how he will be implemented.\n(Top photos: Getty Images)",
  "word_count": 3153,
  "scraped_at": "2026-02-14T02:00:19.989605",
  "_text_extracted": true
}