{
  "article_id": "911136fdb293",
  "url": "https://www.themag.co.uk/2026/01/no-limits-to-what-eddie-howe-and-newcastle-united-can-achieve/",
  "title": "No limits to what Eddie Howe and Newcastle United can achieve",
  "date": "20260110T110000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "No limits to what Eddie Howe and Newcastle United can achieve\nHi there, pop pickers! You might not be able to name Europe’s biggest-selling single of 1993 but unless you are fortunate enough to be the right side of 40 I’m almost certain the song will be annoyingly familiar.\nThe track reached No1 in 35 countries, spent five weeks at the top of the UK chart and was, in hindsight, a fitting anthem for the team Kevin Keegan was building at St James’ Park.\nNo Limits, by the Belgian-Dutch techno outfit 2 Unlimited, was low on profound lyrics but high on energy.\nReleased in January 33 years ago, it was rocking its world while Newcastle United were doing the same in theirs, storming to the Championship title.\nWe all know what happened over the next few seasons: the Entertainers went agonisingly close to breaking a trophy drought that had blighted the club since 1969. Two second-place finishes in the Premier League, two FA Cup finals . . . but still no meaningful silverware. Enough memories to last a lifetime, though ultimately the Keegan years were tinged with an undeniable sense of disappointment. What might have been if a game frequently named as the greatest in the history of the Premier League, the 4-3 at Anfield in April 1996, had brought the Mags a victory their play justified? What if Graham Fenton had not scored twice at Ewood Park to turn a Newcastle win into a defeat? Why did Ian Woan strike a blinder at the City Ground to deny us another two points?\nIn the final analysis, two defeats by the Salfords, one on a partly frozen Old Trafford pitch, the other a 1-0 that was as improbable as it was unbalanced, denied the Mags a title that had looked all-but secure in mid-December.\nThe team Kevin Keegan built was packed with fantastic players. Consider who started in that pivotal match against Liverpool: Albert, Asprilla, Batty, Beardsley, Beresford, Ferdinand, Ginola, Howey, Lee, Srnicek and Watson. I’ve listed them alphabetically partly because the formation was dazzlingly fluid, partly because the precise positions have slipped my memory. Clark, Gillespie and Peacock were on the bench.\nThe Entertainers could win with a barrage of goals, they could win 1-0, as they did twice in a few short days at Easter. That team did everything except become champions. They even reduced me to tears in front of my perplexed young son when they ground out those nerve-racking victories against Aston Villa and Southampton at St James’ Park just after the unforgettable classic at Anfield. Now in his 42nd year, I suspect he “gets it” at last.\nUntil Sir Bobby Robson replaced Mr Sexy Football (the least said about Kenny Dalglish, the better) Newcastle United were sliding towards mid-table mediocrity. Our local hero gradually and carefully assembled a squad capable of punching above their weight. After two unremarkable seasons, the glory days returned. More thrills, more brilliant memories, though still no trophy. He steered us to fourth place in the 2001-02 season, to third place 12 months later and to fifth in 2003-04, when they lost in the semi-final of the Uefa Cup.\nWhile Robson, like so many predecessors, was unable to match Joe Harvey by winning a big pot, he managed the remarkable feat of persuading moderate players to overachieve, week after week, month after month.\nHere’s the line-up for a match I watched from the Holte End in December 2002, surrounding by grumbling Brummies: Given, Griffin, Hughes, O’Brien, Bernard, Solano, Dyer, Jenas, Robert, Bellamy and Shearer.\nWho would suggest that team were as good as the Entertainers? On paper, no way. Football, however, is played on grass and the genius of Sir Bobby was a special alchemy that transformed individuals into a team that were more than the sum of their parts. The bench contained Harper, Caldwell, Acuna, LuaLua and Ameobi. None of them was needed, a late header by Big Al that seemed to fly in via his shoulder providing the only goal. Cue a mass exodus by Aston Villa’s legendary 12th man in the 82nd minute.\nMy favourite memory of Robson’s tenure was the 2-2 in Milan against Internazionale in March 2003. We played Inter off the San Siro in the first half but scored only once: Shearer. A mistake by Bramble allowed Vieri to equalise in the 46th minute, Shearer netted his second three minutes later but on the hour Cordoba levelled again. The late, great Gary Speed then missed with a header at the back post and, despite being the better team on the night, the one point was not enough for Newcastle to reach the knock-out stages.\nWould we have progressed if Woodgate, one of the most accomplished defenders seen in the black-and-white stripes, had been available? Unfortunately, he was cup-tied, having played for Leeds in the Uefa Cup earlier that season.\nApologies for the elongated trip down memory lane. The reason is to compare the achievements of Keegan and Robson with the man who broke the trophy jinx, a man who I believe is destined to bring further success to St James’ Park.\nEddie Howe has been in charge for just over four years and has already defied the odds by twice qualifying for the Champions League, twice reaching a Wembley final and, most importantly, by winning a bloody trophy.\nThis month Newcastle will play matches seven and eight in the Champions League, having amassed 10 points from their first six. A win at home to PSV Eindhoven on January 21 (I’ll be in the east stand with my daughter, having struck lucky in the members’ ballot) will guarantee a place in the play-offs for the round of 16. If we could also win in Paris a week later, we would be straight through. No extra hurdle to climb and a little respite for an injury-hit squad toiling manfully to survive an already crowded set of fixtures.\nWe have never reached the last 16 of Uefa’s premier club competition. This might be our year. Remember, PSG, the defending champions, started slowly last season and only after Christmas generated the unstoppable momentum that carried them past allcomers.\nBefore PSV, of course, there’s the small matter of an FA Cup third-round tie at home to Bournemouth. The Cherries have just flogged their best player to Manchester City, which is good news and bad. We will not face Semenyo today. He signed off on Wednesday night with a late goal that gave Bournemouth their first Premier League win in 12 attempts. The club Howe rescued from oblivion and took all the way to the top flight should not, though, be underestimated.\nThey won 4-1 in our own back yard last season and normally test us to the limit. While nine places below Newcastle in the table, that is only six points. The bookies make us odds-on to win, the visitors are a best-price 16/5 against. Let’s hope the old adage “you never see a poor bookie” is justified at 5pm. A win would keep the Mags in four competitions.\nNext up is the first leg of the League Cup semi-final. No Semenyo today but almost certainly Semenyo on Tuesday, even though he played half a game for Bournemouth in this competition against Brentford five months ago. A little-known rule allows a player to appear for two teams in the same tournament in the same season . . . if it is the League Cup.\nIn 2023, when there was no such loophole, Newcastle were forced to field a third-choice goalkeeper in the final because of a red card for Pope in a Premier League match and because Dubravka had played in the League Cup for Manchester United earlier that season. Without wishing to appear paranoid, I occasionally feel “someone’s got it in for us” (courtesy of Dylan’s epic whinge Idiot Wind, a classic from Blood On The Tracks).\nTalking of seminal records, this month holds the key to Newcastle’s season. Three consecutive wins in the Premier League have lifted us from the lower half of the table to the dizzy heights of sixth, one point behind Brentford and only three behind Liverpool. The importance of momentum cannot be overstated, as PSG proved last season.\nNewcastle are on a roll. We are unbeaten at home since 28 September 2025, when a stoppage-time goal gave the Woolwich victory. Yes, there have been a couple of draws since then but the victories include a 2-1 against Man City in late October. I doubt they will be looking forward to Tuesday night, especially because their defence is almost as depleted as ours.\nIn Greek myth, Cassandra was a Trojan priestess fated to utter true prophecies that were never believed. Homer described her as the fairest of all King Priam’s daughters. She looks a right cracker in an 1898 portrait by Evelyn De Morgan.\nForetelling the future is a fool’s game but, as somebody never afraid to look stupid, I predict this season will go down as one of the greatest in Newcastle United’s history.\nWe have the players, we have the manager and, as shown last Wednesday, we have a never-say-die spirit when cheered to the rafters by a fervent crowd. Onward and upward!\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1554,
  "scraped_at": "2026-02-14T02:09:43.014893",
  "_text_extracted": true
}