{
  "article_id": "9151e95f02dd",
  "url": "https://www.con-telegraph.ie/2023/10/10/a-closer-look-at-ireland-and-the-uks-host-venues-for-euro-2028/",
  "title": "A closer look at Ireland and the united kingdom host venues for Euro 2028",
  "date": "20231010T140000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A closer look at Ireland and the UK's host venues for Euro 2028\nBy Jamie Gardner, PA Chief Sports Reporter\nIreland and the UK's bid to host Euro 2028 has been approved by Uefa’s executive committee after Turkey pulled out of the running.\nHere, we look at the 10 stadia across five nations which will host the matches in just under five years’ time.\nEngland’s national stadium will host the final – and potentially both semi-finals – having also been the venue for the Euro 96 finale and the decisive England v Italy clash at Euro 2020. The Football Association will be working hard with the authorities to ensure there is no repeat of the chaotic scenes which surrounded that match. Wembley is celebrating its centenary this year, with the original stadium opening in 1923 for the British Empire Exhibition.\nWork is set to begin later this year on increasing the capacity of treble-winning Manchester City’s ground to almost 62,000 by 2025. The club left their former home ground Maine Road and moved into the stadium in 2003. It was built to host the 2002 Commonwealth Games and hosted the 2008 Uefa Cup final, while England’s football and rugby union sides have both staged fixtures there.\nSpurs’ home is the largest club stadium in London, with a capacity of over 62,000. Opened in April 2019, the stadium includes a retractable pitch with a synthetic NFL surface underneath. Its 17,500-seat, single-tier South Stand is the largest in the UK and features Europe’s longest bar – The Goal Line.\nThe Toffees’ new home at Bramley-Moore Dock is scheduled for completion late next year. Developers are working to a capacity of 52,888.\nSt James’ Park, home to Newcastle since the club was formed in 1892, also hosted matches at Euro 96. Newcastle are considering options to develop the stadium which might mean the capacity, currently 52,305, has increased by the time the championship begins in 2028.\nVilla Park hosted three World Cup matches in 1966 and four matches during Euro 96. A go-to ground for FA Cup semi-finals – hosting 55 – the stadium is set to be redeveloped to increase capacity to over 50,000 ahead of the tournament.\nThe Dublin venue, which holds over 51,000 people and officially opened in 2010, regularly hosts Republic of Ireland football matches and those of the rugby team. The stadium, built on the site of the former Lansdowne Road Stadium, which was demolished in 2007, had been part of the original multi-country plans to host Euro 2020 but could not ultimately provide Uefa with the necessary assurances over minimum spectator levels amid the Covid-19 pandemic.\nConstruction on the site in the Andersonstown area of Belfast is due to get under way next year with completion by 2026. The capacity of the stadium is set to be 34,500. It was opened in 1953 to stage Gaelic games and has since been home to the Antrim Gaelic Athletic Association.\nScotland’s national stadium did host matches at Euro 2020. The Scottish Football Association has also bid to stage the Champions League final in 2026 or 2027 at the stadium, which currently holds just over 50,000. However, developers have put forward proposals to upgrade the stadium and increase capacity to 65,000. A record British crowd of 149,415 saw Scotland beat England 3-1 at Hampden in 1937.\nThe Cardiff venue has hosted major European football events before, having staged the 2017 Champions League final. Set to be the second-largest venue in the tournament with a capacity of 74,500.",
  "word_count": 587,
  "scraped_at": "2026-02-14T02:07:14.741826",
  "_text_extracted": true
}