{
  "article_id": "91560ab62be1",
  "url": "https://www.thisdaylive.com:443/index.php/2023/12/13/osimhen-celebrates-caf-award-with-goal-qualifies-napoli-for-last-16",
  "title": "Osimhen Celebrates CAF Award with Goal , Qualifies Napoli for Last 16",
  "date": "20231213T023000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nOsimhen Celebrates CAF Award with Goal, Qualifies Napoli for Last 16\nBarely 24 hours after he was named 2023 African Player of the Year in Marrakesh, Morocco, Nigerian Victor Osimhen, scored Napoli’s second goal\nin the 2-0 defeat of Sporting Braga.\nThe victory advanced the Italian Serie A champions to the UEFA Champions League Round of 16 after they finished behind Real Madrid with 10 points from six games.\nOf course, Osimhen celebrated the goal with his Napoli teammates. It was a perfect start to Osimhen’s reign as King of African football.\nHe got his name on the scoreboard on 33 minutes, when he improvised from a pass by Brazilian defender Nathan to get the ball over the goal line. The first goal for Napoli was an own goal scrambled into the net by Braga’s Serdar Saatci in the 9th minute.\nThe striker, who netted 31 goals in all competitions last season, has now scored a total of seven goals this term following his six goals in Serie A.\nLast season, the Serie A champions achieved their best-ever record in the Champions League when they reached the quarterfinal.\nElsewhere on the night, Manchester United were beaten 0-1 by Bayern Munich at Old Trafford to finish bottom of their Champions League Group A after a bitterly disappointing campaign, picking just four points from a possible 18.\nUnited knew they had to beat Bayern, who were already through as Group A winners, for a chance of progressing.\nBayern’s Kingsley Coman scored the only goal in the 70th minute when he was played in by England captain Harry Kane.\nErik ten Hag’s side won just one of their six group games.\nDefeat means United also missed the chance to drop into the Europa League.\nRESULTS\nCopenhagen 1-0 Gala’ray\nMan Utd 0-1 B’Munich\nLens 2-1 Sevilla\nPSV 1-1 Arsenal\nNapoli 2-0 Braga\nU’Berlin 2-3 R’Madrid\nSalzburg 1-3 Benfica\nInter 0-0 Sociedad\nTODAY\nAtletico v Lazio\nCeltic v Feyenoord\nDortmund v PSG\nNewcastle v AC Milan\nC’Zvezda v Man City\nLeipzig v Young Boys\nPorto v Shakhtar\nR’Antwerp v Barcelona",
  "word_count": 347,
  "scraped_at": "2026-02-14T01:51:13.783842",
  "_text_extracted": true
}