{
  "article_id": "915be46f9117",
  "url": "https://www.barcablaugranes.com/2023/2/16/23603089/barcelona-manchester-united-europa-league-winners-and-losers",
  "title": "3 winners and 3 losers from Barcelona 2 - 2 Europa League draw against Manchester United",
  "date": "20230216T233000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona made their European debut in 2023 with a sensational 2-2 draw in the first leg of their Europa League Playoff tie against Manchester United after 90 thrilling minutes at Camp Nou. Both teams played very well and next week’s tie should be even better, but Barça will have to go to Old Trafford without the injured Pedri and Ousmane Dembélé and the suspended Gavi.\n3 winners and 3 losers from Barcelona’s 2-2 Europa League draw against Manchester United\nThe best and the worst from a thrilling night at Camp Nou\nHere are the winners and losers from Thursday’s action.\nNote: Applying the labels “winners” and “losers” is not intended to be a judgment on the talent or character of any of these players. It’s just a simple way to grade their performance in a single game. No disrespect is intended.\nWinners\nRaphinha: The Brazilian showed up in the biggest moment and delivered his best performance yet in a Barça shirt, with a goal and an assist and several other fantastic moments in attack. His hunger to press was evident, and he was always a threat with his dribbling and shooting from distance. He was visibly upset to be substituted at the end and deserved to play until the end, but he’s certainly earned even more minutes going forward with his showing in this one.\nAnsu Fati: In a game played at 300 miles an hour for the entire 90 minutes, Fati came off the bench determined to inject some calm and poise into the fray. He did a very nice job of keeping possession and sometimes passing the ball backwards to help the team get into a better shape and not be so open at the back in case of a turnover. He had three dangerous shots on goal and could have easily scored if not for David De Gea, and without Pedri and Gavi for next week Barça will be forced to go back to a three-man midfield which will certainly mean a start for Ansu. He has certainly earned it.\nFootball fans: We were all treated to one of the best games of the entire European season so far tonight, and it’s really a shame that this was an early Europa League knockout tie. Good luck to the Champions League teams having to follow this one next week.\nLosers\nXavi Hernández: Considering the quality of the opponent, this was without a doubt Barça’s best performance under Xavi in European play. The players gave everything to the cause and showed great resilience to come from behind to earn a draw, but their job was made harder by the coach’s decisions. Xavi inexplicably left Andreas Christensen and Alejando Balde on the bench, claiming they needed to be rested when the next game is on Sunday against a relegation candidate at home. Marcos Alonso scored but was exposed in both United goals, and it is not a coincidence that Marcus Rashford was no longer a threat once Christensen and Balde came on the pitch.\nErik Ten Hag outcoached Xavi by taking Rashford away from the left wing and avoiding the matchup with the dominant Ronald Araujo. Xavi never adjusted for that and made a truly baffling late substitution taking off Barça’s best player on the night, Raphinha, and bringing on Ferran Torres who is completely out of form and isn’t suited for the right wing. Like, why?\nXavi is among the biggest reasons why Barça have failed in Europe since he arrived. He had another rough night and this time was rescued by his players. It’s hard to understand why he can’t see the game as clearly and make the same good calls he does in La Liga matches on European nights. It’s the same sport, right?\nMaurizio Mariani and Massimiliano Irrati: The Italian referee and the Italian VAR missed a clear penalty by Fred that would have given Barça a chance to win the game late, and even from a more neutral perspective it was clear Mariani had a tough time managing the game all night. This is a Champions League-worthy knockout tie that was officiated by a mediocre Serie A referee. Well done, UEFA!",
  "word_count": 696,
  "scraped_at": "2026-02-14T02:16:35.954544",
  "_text_extracted": true
}