{
  "article_id": "916135b0a5de",
  "url": "https://www.caughtoffside.com/2024/08/29/aston-villa-champions-league-tickets-juventus-celtic-bayern-munich/",
  "title": "Get Aston Villa tickets for Champions League games now",
  "date": "20240829T190000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa fans watched the Champions League draw excitedly and they were NOT disappointed.\nVilla will host Bayern Munich, Juventus and Celtic at home.\nBologna will also come to Villa Park, while Unai Emery’s men will travel to RB Leipzig, Club Bruges, Young Boys and Monaco.\nAfter the draw, interest in Champions League tickets among Aston Villa fans went through the roof.\nIf you are interested in getting hold of tickets to watch Aston Villa in the Champions League then read on.\nHow to buy Aston Villa tickets for Champions League games\nTickets for all Aston Villa matches can be purchased via the club’s official ticketing page on their website, although they can often sell out quickly, while those only looking to buy through general sale will have little chance of landing Champions League tickets.\nAston Villa club membership starts at £30 per season for adults and can increase your chances of landing tickets to big matches, although there is still no guarantee.\nThe next best place for Aston Villa tickets, including for Champions League matches, is livefootballtickets. It is one of the most trusted resale platforms around, with a Trustpilot score of five stars, and it offers a much easier route to buying tickets than via club channels – especially for those only attending games now and then.\nTickets for Aston Villa’s Champions League games are already available via livefootballtickets.com, so what are you waiting for?\nNew Champions League format\nThis season, the Champions League has a new look. Instead of 32 teams split up into eight groups of four, there is now one 36-team table in what is known as a ‘league phase’.\nInstead of playing three teams twice, clubs will now compete against eight different opponents with four home games and four away games.\nClubs will be ranked into four seeding pots, with each team drawn to face two opponents per pot with one match at home and the other away.\nThe top eight teams from this league phase will advance directly to the last 16, while those placed ninth to 24th will compete in a two-legged knockout round for the right to join them.\nAnyone finishing 25th or below will exit European football entirely rather than dropping into the Europa League, with the rest of the Champions League knockout stages following the usual format.\nHave Aston Villa ever won the Champions League?\nAston Villa have been crowned European champions once back in 1982, when the Champions League was still known as the European Cup.\nVilla beat German giants Bayern Munich 1-0 in Rotterdam thanks to a 67th-minute goal from Peter Withe. They join Liverpool (6), Manchester United (3), Chelsea (2), Nottingham Forest (2) and Manchester City (1) as one of just six English sides to lift European club football’s biggest prize.\nAston Villa won the European Super Cup 3-1 on aggregate against Barcelona the following season, but their European Cup defence ended at the quarter-final stage, with Juventus beating them 5-2 on aggregate.\nEuropean nights at Villa Park\nVilla enjoyed some famous nights under the lights at Villa Park en route to winning the 1982 trophy, including victories against Anderlecht in the semi-finals and Dynamo Kyiv in the quarter-finals.\nMore recently, Unai Emery guided Villa to the semi-finals of the 2023/24 UEFA Conference League, winning all three of their group stage home matches against Zrinjski Mostar, AZ and Legia Warsaw by a single goal.\nJumping straight to the round-of-16, Villa then thrashed Dutch giants Ajax 4-0 on a memorable night at Villa Park, following up by beating Lille 2-1 en route to a penalty shootout victory after a 3-3 aggregate draw.\nVilla would then lose 4-2 at home to Olympiacos in the semi-finals, also going down 2-0 away from home as their journey ended against the eventual tournament winners.\nBut those Ajax and Lille encounters have offered fans a taste of what to expect this season.\nThree Aston Villa players to watch in the Champions League this season\nOllie Watkins\nOnly four players scored more than Ollie Watkins’ five Conference League goals last season, which was pretty indicative of his contribution overall in 2023/24. Of course, since then, Watkins has written himself into Three Lions folklore with his last-gasp winner from the bench in the Euro 2024 semi-final against the Netherlands. Can he use the Champions League to establish himself as a true Aston Villa legend?\nEmi Martinez\nDubbed by many as the best goalkeeper in the Premier League, Emi Martinez has been key to Aston Villa’s rise in recent years. The former Arsenal man has also set about winning everything he can with the Argentina national team, performing penalty heroics to deliver the 2022 World Cup, either side of back-to-back Copa America titles. How he’d love to take Villa far in the Champions League.\nIan Maatsen\nIan Maatsen is being eased into life at Villa Park but you get the impression he will play an important role for them on the continental stage. The Dutch full-back is one of the few players in Unai Emery’s squad with Champions League experience after helping Dortmund go all the way to last season’s final while on loan from Chelsea.",
  "word_count": 861,
  "scraped_at": "2026-02-14T02:08:01.863059",
  "_text_extracted": true
}