{
  "article_id": "91762a9f9ddb",
  "url": "https://metro.co.uk/2024/04/16/mikel-arteta-responds-fans-jeering-arsenal-star-aston-villa-defeat-20660494/",
  "title": "Mikel Arteta responds to fans jeering Arsenal star during Aston Villa defeat",
  "date": "20240416T203000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has heaped praise on Oleksandr Zinchenko after he was subjected to some jeers during Arsenal’s damaging Premier League defeat to Aston Villa.\nArsenal’s title hopes were dealt a major blow on Sunday as Unai Emery’s Villa clinched an impressive 2-0 win at the Emirates Stadium.\nThe frustration inside the Emirates was clear to see as thousands of fans left the stadium before the final whistle after Aston Villa’s quickfire double.\nZinchenko’s substitution after Villa doubled their lead was also met by some jeers and Arteta says he wants the fans to ‘stay with our players’.\nArsenal legend David Seaman singled out Zinchenko for criticism after the defeat and claimed the former Manchester City star ‘put everybody on edge’ during the game.\nAsked about Zinchenko’s influence at Arsenal and the jeers he received, Arteta said: ‘I love Oleks, he has given us so much. He gives us a lot.\n‘He is a player with different qualities and an unbelievable courage to play football in any circumstance. We want the fans to stay with our players because for sure they are going to perform better.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nArteta was speaking at his pre-match press conference ahead of Arsenal’s Champions League quarter-final second leg against Bayern Munich.\nThe tie is finely poised after a 2-2 draw in north London last week and Arteta says it would be ‘unbelievable’ to take Arsenal into the semi-finals for the first time in 15 years.\n‘If we make semi-final, we would be in a high emotional state, there is an opportunity,’ the Gunners boss said.\nMore Trending\n‘The opportunity is there to write our story differently. It is about putting in a strong performance to have the right to be in the semi-final.\n‘I want our team to be ourselves. Sometimes your opponent doesn’t allow you, but we are looking at the best way to win the game.\n‘Most of our players have not experienced this, they are super motivated and confident.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Glenn Hoddle predicts Champions League finalist ahead of Arsenal and Man City games\nMORE: Michael Owen names three Premier League players that would improve Arsenal\nMORE: Barcelona legend Carles Puyol backs Moises Caicedo to do ‘important things’ for Chelsea",
  "word_count": 440,
  "scraped_at": "2026-02-14T02:25:26.760424",
  "_text_extracted": true
}