{
  "article_id": "919d2827d7ce",
  "url": "https://www.westmeathindependent.ie/2026/01/10/mikel-arteta-arsenals-purpose-to-win-silverware-as-thats-what-im-judged-on/",
  "title": "Mikel Arteta : Arsenal  purpose  to win silverware as that what Im judged on",
  "date": "20260110T130000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta: Arsenal’s ‘purpose’ to win silverware as that’s what I’m judged on\nBy Philip Duncan, Press Association\nMikel Arteta said the “purpose” of Arsenal was to win silverware – and admitted his season would be judged by how many trophies the north London club could win.\nArsenal will begin their FA Cup campaign with a third-round tie at Portsmouth on Sunday still fighting on all four fronts.\nArteta’s side have a six-point Premier League lead and they are the only team in the Champions League to have won all six of their matches so far.\nFollowing their test at Fratton Park, Arsenal will then travel to Chelsea for the opening leg of their Carabao Cup semi-final on Wednesday.\nArteta’s sole silverware of his tenure arrived during the Covid-interrupted 2020 season – his first in charge of the Gunners – where Arsenal saw off Portsmouth in the fifth round before beating Chelsea at an empty Wembley.\n“We want that one for sure (the FA Cup) and all the big ones,” said Arteta. “And that’s what we are chasing and that’s the purpose of this team.\n“At the end, we get judged for what we do today. Last week is not important. We will get judged for what we are able to do at the end of the season.\n“One thing is the trophies for our football clubs and many other things that you have to do in a football club, especially in the situation we are in.\n“I don’t expect that. I’m really happy where I am with the people that I work with and hopefully at least they know that we will give our very best to try to win as much as possible.”\nArteta oversaw a 2-0 win at Portsmouth – which was Arsenal’s penultimate match before the country went into lockdown almost six years ago.\nIt was confirmed 11 days after their victory on the south coast that Arteta had contracted Covid.\nRecalling the match at Fratton Park, Arteta said: “I wasn’t feeling great, to be fair.\n“The moment that we scored the goal I was desperate to go home because I was shaking and not feeling great! But it was a long time ago.”\nArsenal have not lost a game against Portsmouth since 1958 and Arteta is likely to rotate his squad, for the club’s third of nine matches this month.\nKai Havertz, who has not played since the opening day of the season following knee surgery, is likely to feature against the Championship club.\nArteta added: “When a player has the chance to put our shirt on and compete for us, you know that the demands are excellence and that’s it and Kai is aware of that.\n“I think he’s going to be in the squad again. He is training well, he’s increased his load and he’s coping with that really well. And it will be great if we can have him back.”\nRiccardo Calafiori, Cristhian Mosquera and Max Dowman will all be unavailable, while Piero Hincapie is a doubt after he was substituted in Arsenal’s goalless draw against Liverpool on Thursday.",
  "word_count": 517,
  "scraped_at": "2026-02-14T02:09:43.014745",
  "_text_extracted": true
}