{
  "article_id": "91a321a91a50",
  "url": "https://arsenalnews.co.uk/arsenal-in-april-2022-next-six-premier-league-fixtures/",
  "title": "Arsenal in April 2022 : Next six Premier League fixtures – ArsenalNews . co . uk",
  "date": "20230320T220000Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are eight points clear at the top of the Premier League with just 10 matches remaining in the season. Nobody could have imagined the Gunners would be in this situation at the start of the campaign. However, they have defied expectations and are currently in a great position to end their title drought.\nAfter the 4-1 victory over Crystal Palace at the weekend, Mikel Arteta’s side are now set to be out of action for the next two weeks due to their players’ international commitments. However, the North Londoners will return to the pitch at the start of next month.\nBelow we look at their fixtures in April.\n1- Leeds United (H, April 1)\nArsenal won the Elland Road fixture by 1-0 in October, with Bukyao Saka scoring the decisive goal. However, it was a very tight game and the Whites looked unlucky to ultimately receive nothing for their brilliant second-half performance.\nLeeds recently moved out of the relegation zone following their superb 4-2 success over Wolverhampton Wanderers at the Molineux Stadium. They have made some improvement under Javi Gracia and Arsenal would be well-advised to not get complacent against the Whites.\n2- Liverpool (A, April 9)\nJurgen Klopp’s side are massively struggling this season, with the Reds in serious danger of missing a place in the top-four. They also went out of the Champions League after a humiliating 6-2 aggregate loss to Real Madrid in their last 16 tie.\nThe north Londoners registered a superb 3-2 win over Liverpool at the Emirates Stadium in October. They twice led the game only to get pegged back by the Reds before Bukayo Saka delivered the decisive goal from the penalty spot. However, Arsenal’s recent record at Anfield has been terrible, with Mikel Arteta losing all his league matches in Merseyside since his appointment in December 2019.\n3- West Ham (A, April 16)\nArsenal will travel to the London Stadium in the middle of April to play league strugglers West Ham United. The Hammers are shockingly battling relegation despite some heavy investment in the summer. David Moyes’ position in East London looks in danger with the Irons in 18th spot after collecting just 24 points.\nArsenal eased past West Ham 3-1 at the Emirates Stadium in December but the Hammers could prove to be difficult opponents for them this time as they have the huge motivation to stay in the Premier League, which has the distinction of being the richest football league.\n4- Southampton (H, April 21)\nSouthampton are one of the top candidates to get relegated this season. But their recent performances are very encouraging as they have defeated Leicester City and have also managed to take a point at Manchester United. And last weekend, they fought back from 3-1 down to earn a 3-3 draw with Tottenham Hotspur that sparked Antonio Conte to call his own player ‘selfish’.\nArsenal shouldn’t expect an easy home game against Ruben Selles’ side even though they are currently at the bottom of the Premier League table.\n5- Manchester City (A, April 26)\nBoth City and Arsenal are winning all their matches recently and so this match will be highly important for both teams. Pep Guardiola’ side are in a destructive form in recent weeks as they absolutely battered RB Leipzig and then Burnley in their last two matches. The Spanish boss will be highly motivated to win his first Champions League crown with the Citizens but at the same time, he will also want to lift the league title.\nArsenal lost 3-1 the last time they met City at the Emirates Stadium, and now they will face the same opponents at the Etihad Stadium towards the end of April.\n6- Chelsea (H, April 29)\nChelsea played out a disappointing 2-2 draw at home to Chelsea on Saturday in a big blow to their top-four hopes. However, they have seen a great improvement in their fortunes recently under manager Graham Potter. The Blues are currently on a four-game unbeaten run, which includes their victories over Borussia Dortmund, Leeds United and Leicester City. They will lock horns with Arsenal on April 29th at the Emirates Stadium.",
  "word_count": 691,
  "scraped_at": "2026-02-14T02:19:40.792073",
  "_text_extracted": true
}