{
  "article_id": "91b5ecb03357",
  "url": "https://www.fourfourtwo.com/news/liverpool-coach-in-talks-with-european-giants-over-manager-job-report",
  "title": "Liverpool coach in talks with European giants over manager job : report",
  "date": "20240228T161500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nLiverpool assistant manager Pep Lijnders reportedly has his next role in his sights as he prepares for his final three months at Anfield.\nLijnders will be leaving the Reds alongside Jurgen Klopp at the end of the season, bringing his second stint at the club to a close after assisting both Brendan Rodgers and Klopp since his initial arrival in 2014. During this time he has won each of English football’s major trophies, plus a Champions League and FIFA Club World Cup.\nBut while Klopp plans to take a break from the game, talkSPORT reports that Lijnders is in talks to become Ajax’s next manager.\nThe four-time European champions are currently enduring one of their worst-ever Eredivisie campaigns, sitting fifth in the table, 29 points behind leaders PSV. Manager Maurice Steign was sacked in October, with his interim replacement John van ’t Schip set to depart in the summer.\nShould Lijnders land the role at Ajax it will be his second taste of first-team management, having been in charge of NEC for six months in 2018. He would return to his role at Liverpool following his failure to guide the Nijmegen-based side to promotion.\nThe 41-year-old would be reunited with former Liverpool midfielder Jordan Henderson if he lands the Ajax job and would arrive with the endorsement of Klopp, who believes the time is right for Lijnders to step up.\n“Pep especially is ready – ready to manage a football team and he wants to do that as well, so that’s great, together with Vitor,” said the German.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“If you change, change properly. And they are ready for the future and I’m really happy about that. The most influential guy in the last years definitely in this club was Pep Lijnders. The job he did is absolutely exceptional. The inspiration he is for me is absolutely exceptional.\n“The relationship we grew is absolutely exceptional. Outstanding, everything. And I’m really looking forward to follow his way and to support if necessary. And if I can, I will definitely do.”\nMore Liverpool stories\nLiverpool are targeting 'the next Javier Mascherano' - who has already embarrassed Arsenal this season: report\nWhy do Liverpool fans boo the national anthem?\nLiverpool manager Jurgen Klopp reveals star set for huge new contract, following League Cup final performance\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.",
  "word_count": 612,
  "scraped_at": "2026-02-14T02:13:34.135512",
  "_text_extracted": true
}