{
  "article_id": "91e72de0bcb3",
  "url": "https://theathletic.com/4673818/2023/07/11/barcelona-uefa-negreira-scandal/",
  "title": "Barcelona and the Negreira scandal : Still in Europe but no resolution in sight",
  "date": "20230711T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "At the end of last month, Barcelona received a significant boost in relation to the Negreira scandal — which centres on payments of €7.3million (£6.4m; $7.8m) the club made to the former referee and vice-president of Spanish football’s refereeing committee, Jose Maria Enriquez Negreira.\nBarcelona were informed that UEFA has finished its investigation into the scandal and came to a conclusion: European football’s governing body recommends they should not be banned from the next edition of the Champions League.\nAdvertisement\nWhile the club are still waiting for a formal announcement from UEFA to confirm it, it means Barcelona will not face any punishment from UEFA for those payments to Enriquez Negreira.\nNot playing in the Champions League next season would have been a disaster for the La Liga champions. The income generated by European competitions represents an oxygen tank for the ailing Barca, who need any financial help they can get in their present situation.\nWhile UEFA’s report acknowledges the existence of Barcelona’s payments to Enriquez Negreira, its investigators believed there were not enough issues to formally punish the club.\nGO DEEPER\nBarcelona charged with corruption over payments to former referees chief\nIt does not mean Barcelona are in the clear, as there is still a legal case for them to undergo, but it does show they will not be condemned before a trial and the full legal process are complete.\nHad UEFA disqualified Barca from the Champions League without having been entirely certain about the outcome of the legal investigation, the Catalans would have been eligible to claim lucrative compensation in the future if the sentence had fallen in their favour.\nClub sources, who — like the others cited in this article — asked to remain anonymous to protect their positions, also feel they did a good job behind the scenes, with president Joan Laporta holding face-to-face talks with UEFA president Aleksandr Ceferin in April to get across Barcelona’s perspective on the case.\nSo how is the Negreira scandal progressing in the Spanish courts? And is there any resolution expected in the short term?\nHere, The Athletic explains what has happened since we last wrote about the case in March.\nWhat happened?\nIn March, Barcelona were charged with corruption over payments made to Enriquez Negreira, then vice-president of Spanish football’s refereeing committee, between 2001 and 2018.\nAdvertisement\nEnriquez Negreira, who held that role between 1994 and 2018, is also facing charges of corruption in a case brought by the Spanish public prosecutor’s office, as are Josep Maria Bartomeu, the Barcelona president from 2014-2020, and Sandro Rosell, president from 2010-2014.\nEnriquez Negreira denied ever favouring Barcelona in terms of refereeing decisions. Barcelona deny any wrongdoing and have explained they hired him as an “external consultant” who provided reports “related to professional refereeing”.\nProsecutors also charged Bartomeu and Rosell with false administration and falsifying a commercial document. Two other former officials from Bartomeu’s time as club president were charged, too: Oscar Grau and Albert Soler. All four have acknowledged payments but denied wrongdoing.\nThe Spanish law relating to this crime was established in 2010. Since 2015, it has included a specific section that targets corruption in sport when it is suspected an attempt has been made to “pre-determine or alter in a deliberate and fraudulent manner the result of a match or competition”.\nThis was the reason Laporta was not charged or accused as part of the investigation — while there are recorded payments from his first spell as president from 2003-2010, the statute of limitations for an investigation into that time has expired.\nAt the time, Enriquez Negreira’s son, Javier Enriquez, who has also denied any wrongdoing, was not charged either and prosecutors only referenced his name as a witness.\nJudge prevents Barcelona from joining the prosecution\nIn May, Barcelona’s lawyers requested the club be allowed to join the legal complaint as one of the prosecutors, despite being under investigation.\nGO DEEPER\nBarcelona, the leaked Negreira documents and what we've learned about the case\nThis came after they had studied the charges of false administration, which led Barcelona’s legal counsel to argue they were also a damaged party in this case.\nAdvertisement\nBarcelona sent the judge a legal document that said there were indications some of the advice provided by Enriquez Negreira had been “charged twice” and that several companies involved in the process were “receiving a commission fee”, which turned the club into an affected party.\nThe judge denied Barcelona’s request as it considered it to be “contradictory” after Laporta himself admitted in April that the payments to Enriquez Negreira had been correctly recorded in Barca’s accounts.\n“The advising services were effectively completed. They were recorded with detailed invoices with the appropriate concept and they were paid through bank transfers,” Laporta said.\nGO DEEPER\nHow Barcelona sees the Negreira scandal: Shame, disbelief and rallying cries\nEnriquez Negreira’s son is charged\nDespite being called as a witness in March, Javier Enriquez — the son of Enriquez Negreira — has been charged.\nEnriquez was the person in charge of the refereeing and scouting reports provided to the club. Bartomeu and Laporta both mentioned him as a point of contact with the club.\nEnriquez received money from Barcelona for those refereeing reports and for multiple coaching sessions with players from the club’s youth teams, but the money ended up in companies registered to his father, who was named as the owner.\nLast month, the judge ruled Enriquez had to be investigated and face charges of money laundering. That followed multiple requests from the different organisations who had joined the complaint, including La Liga.\nThe judge also decided to extend the period of time being investigated to 2001, the earliest time from which there is proof that payments from Barcelona to Enriquez Negreira allegedly started.\nWhen will there be a final ruling?\nThe short answer is: not anytime soon.\nThe Negreira case is still in its early stages, with the judge and the prosecution collecting information.\nSources with knowledge of the legal case suggest that, given the number of charges and witnesses involved, it will take years until the full investigation is completed.\n(Top photo: David Ramos/Getty Images)",
  "word_count": 1025,
  "scraped_at": "2026-02-14T01:48:22.653225",
  "_text_extracted": true
}