{
  "article_id": "91f4dac0c05c",
  "url": "https://www.teamtalk.com/manchester-united/ademola-lookman-manchester-united-talks-atalanta-price-tag",
  "title": "Man Utd transfers : Vivell plans DIRECT  talk with  truly extraordinary  Ballon dOr nominee",
  "date": "20250429T011500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd plan ‘talks’ with ‘truly extraordinary’ Ballon d’Or nominee\nManchester United are planning to hold talks with one of the best forwards in Serie A, with a report revealing the transfer fee that the Red Devils would need to pay for him.\nOne of the main reasons why Man Utd have been dire this season is that they have been toothless in front of goal. Ruben Amorim’s side have scored only 39 goals in 34 Premier League games, as the Red Devils sit in 14th place in the table.\nRasmus Hojlund has scored four goals in 20 Premier League starts this season, while Joshua Zirkzee has found the back of the net three times in 14 league starts.\nMan Utd’s director of recruitment, Christopher Vivell, is fully aware of the need to address this situation in the summer transfer window.\nOne of the forwards that the Red Devils have taken a shine to is Ademola Lookman.\nTEAMtalk’s Italian football correspondent, Rudy Galetti, reported on March 24 that Man Utd are among the clubs interested in a summer deal for Lookman.\nThere was speculation last week that Man Utd are ready to make an offer for Lookman, with a swap deal involving Hojlund also on the cards.\nCaughtOffSide has now revealed that Man Utd are planning to hold direct talks with Lookman, who was nominated for the prestigious 2024 Ballon d’Or after guiding Nigeria to the final of the 2023 Africa Cup of Nations and helping Atalanta win the 2023-24 Europa League.\nBarcelona have already contacted Lookman’s representatives over a summer deal, and Man Utd are said to be ‘planning to hold talks with the Nigerian soon’.\nThe report has revealed that Chelsea, Liverpool, Newcastle United and Arsenal also aim to speak to Lookman, who was described as “a truly extraordinary player” by Atalanta manager Gian Piero Gasperini in The Daily Post in December 2024.\nLookman has been deployed mainly as a second striker this season, with the 27-year-old scoring 18 goals and giving seven assists in 37 appearances.\nThe former Everton forward scored 17 goals and provided 10 assists in 45 matches in all competitions last season.\n🔴 READ NEXT 👇\nMan Utd tipped to ‘come knocking’ for £43m ‘monster’ centre-back who could leave\nCole Palmer transfer decision made amid Man Utd and Liverpool interest\nAtalanta demands for Ademola Lookman sale\nCaughtOffSide has revealed that Atalanta want €60m–65m (£51m,$68.5m – £55m,$74m) for Lookman.\nThat is too much for Juventus, although the Italian giants are reported to still hold an interest in the forward.\nIt remains to be seen if Man Utd would be willing to pay the asking price.\nThe Red Devils are trying to finalise a deal for Matheus Cunha.\nMan Utd will have to pay £62.5million for the Wolves forward as that is his release clause.\nAmorim wants to use Cunha as a number 10, and since Lookman is not a natural number nine, it will be interesting to see if Man Utd sign both the Wolves star and the Atalanta ace in the same window.\nLatest Man Utd news: Striker warned, Cunha doubts\nOne of the strikers that Man Utd have their eyes on has been told to avoid a “disgraceful” move to Old Trafford.\nPaul Scholes has shared his doubts on Matheus Cunha amid claims that Man Utd are in the final stages of talks.\nMeanwhile, Real Betis have revealed their plan about Antony, as the Brazilian winger flourishes at the Spanish club following his loan move from Man Utd.\nThe best of Lookman since he left the Premier League\nAugust 4, 2022: Joins Atalanta from RB Leipzig for a €15m fee after Leicester neglected their option to buy him.\nAugust 13, 2022: Scores on his Atalanta debut in a win over Sampdoria, being deployed as a supporting striker – a role he would soon make his own.\nJanuary 2023: Scores braces in three consecutive matches (two of which were in Serie A and one in the Coppa Italia).\nJuly 2023: Wins the Atalanta Player of the Season award after scoring 15 goals from 33 games in his debut campaign.\nJanuary-February 2024: Plays a crucial role in helping Nigeria to the Africa Cup of Nations final, being their only scorer in the round of 16 and quarter-final wins.\nMay 22, 2024: Scores a hat-trick in the Europa League final to earn Atalanta their first ever European trophy.\nJune 2024: Claims the Atalanta player of the season accolade for the second time in a row.\nSeptember 4, 2024: Becomes the first ever Atalanta player to be named on the Ballon d’Or shortlist (the following month, he would come 14th in the voting).\nOctober 26, 2024: Scores a brace and provides two assists in the same match in a 6-1 win over Hellas Verona.\nDecember 6, 2024: Scores the winner against AC Milan to put Atalanta top of Serie A.\nDecember 10, 2024: Scores against Real Madrid in the Champions League.\nJanuary 21, 2025: Gets his fourth goal of the Champions League’s league phase.\nFebruary 23, 2025: Bounces back from disparaging comments from Gian Piero Gasperini to score a brace against Empoli on his first appearance since the manager’s remarks.",
  "word_count": 869,
  "scraped_at": "2026-02-14T01:49:31.504917",
  "_text_extracted": true
}