{
  "article_id": "9208784d9c85",
  "url": "https://arsenalnews.co.uk/2025/04/08/real-madrid-starting-xi-for-arsenal-clash-leaks-hours-before-game/",
  "title": "Real Madrid starting XI for Arsenal clash leaks hours before game",
  "date": "20250409T024500Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal manager Mikel Arteta has been handed a boost ahead of the Champions League game against Real Madrid tonight as the starting XI of the visitors has been leaked, according to English journalist Sam C.\nThe journalist who works for The United Stand and Thats Football, and is followed by the likes of Dharmesh Sheth, Simon Collings, David Ornstein and Fabrizio Romano on X (formerly Twitter) claimed on Tiktok ahead of the first-leg of the quarter-finals between the Gunners and Los Blancos that Spanish media have released the starting line-up.\nThibaut Courtois returns to goal after missing the 2-1 loss to Valencia on Saturday, while Lucas Vazquez, Raul Asencio, Antonio Rudiger and David Alaba will play as the back-four.\nFederico Valverde, Eduardo Camavinga and Jude Bellingham will start in midfield, while Kylian Mbappe, Vinicius Junior and Rodrygo will start in attack as Madrid look to secure a good result against Arsenal at Emirates Stadium.\nHaving drawn 4-4 with Real Sociedad before losing to Valencia last weekend, Los Blancos have proven that they are not invincible despite the quality of their squad, and the Gunners have a chance of dumping them out of the elite European competition.\nArsenal have to win tonight if they want to progress to the semi-finals as getting a favourable result at the Santiago Bernabeu could be tricky, and Arteta has a chance to make necessary adjustments to his team ahead of the game.\nThey have not played in the semis of the competition since 2009 and will need to be on top of their game against one of the best teams on the planet to advance to the last-four.\nArsenal have been handed an injury boost with Bukayo Saka expected to start against Madrid, and the England international will be desperate to hurt the Spanish side home and away.",
  "word_count": 303,
  "scraped_at": "2026-02-14T02:02:35.585467",
  "_text_extracted": true
}