{
  "article_id": "9209edbea386",
  "url": "https://www.caughtoffside.com/2024/02/23/arsenal-to-compete-with-newcastle-for-25-year-old-la-liga-defender/",
  "title": "Arsenal Transfer News : Gunners to battle Newcastle for Jules Kounde",
  "date": "20240223T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona defender Jules Konde has been linked with a move away from the club at the end of the season.\nAccording to a report from HITC Football via Fichajes, Arsenal and Newcastle United are keen on the 25-year-old French international.\nKounde is versatile enough to operate as a central defender as well as a full-back. He could prove to be a quality long-term acquisition for the north London club.\nHowever, Arsenal are already well-stocked in the central defensive department and it remains to be seen how they accommodate the French international in their starting lineup.\nThe Gunners already have players like William Saliba, Ben White, Jurrien Timber, and Gabriel Magalhaes at their disposal. While there is no doubt that Kounde is a quality player with the potential to develop into a world-class defender, Arsenal have other priorities and they should look to improve the midfield and the attack first.\nIt will be interesting to see if the Gunners follow up on their interest with an official offer to sign the defender at the end of the season. Barcelona paid €50 million for the Frenchman when they signed him, and they could easily demand a substantial amount of money for his services.\nArsenal will face competition from Premier League rivals, Newcastle United. The Magpies have been quite vulnerable defensively and they need to bring in a quality central defender. Kounde could form a solid partnership alongside Sven Botman at the heart of the defence.\nA move to the Premier League would be an exciting opportunity for the French defender and it remains to be seen where he ends up. Newcastle are likely to miss out on Champions League qualification for the next season and therefore Arsenal could have an edge in the transfer race.\nA player of his ability will want to compete at the highest level and he will want to join a club with Champions League football.",
  "word_count": 318,
  "scraped_at": "2026-02-14T01:56:44.621098",
  "_text_extracted": true
}