{
  "article_id": "920a3a62cde7",
  "url": "https://www.the42.ie/linfield-shelbourne-champions-league-6763253-Jul2025/",
  "title": "Romance and reality collide in Shelbourne Champions League decider with Linfield",
  "date": "20250716T094500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THE QUALIFYING ROUNDS of the Champions League are a place where romance and reality co-exist in a tension-filled vacuum for clubs like Shelbourne and Linfield.\nThat much became clear during the first leg of their first-round tie at Tolka Park last week.\nPrior to kick-off, the nature of the All-Ireland derby added an element of intrigue that was only natural to be explored, but was barely entertained.\nNeither manager did anything to fan the flames at a time of year when bonfires begin to burn in the north.\nThe closest Joey O’Brien came to antagonising the visitors was to admit that, other than his preparation for facing Linfield, he did not know an awful lot about the Irish League.\nDavid Healy, meanwhile, spoke of how often he attends various League of Ireland games and that he couldn’t remember the last time he missed a trip to Dublin for the FAI Cup final.\nThe Northern Ireland legend also shifted focus on any political significance of the tie by simply speaking about the weekly pressure and expectation he has faced in close to 10 years in charge at Windsor Park.\nThat is the venue for tonight’s second leg in which Shels hold a 1-0 lead after Mipo Odubeko’s fine second-half goal in Dublin, and speaking yesterday the returning Chris Shields insisted Linfield weren’t being drawn into the “narrative” of north v south.\n“Qualification to the next round is much bigger than any other debate, for both clubs,” he said, the quote pointedly used by Linfield on their own social media feed.\nWhat it means to fans is impossible to quantify but for those running the clubs the value is easy to measure.\nAs Shels are a domestic champion, the minimum amount that any club eliminated at this stage of the competition can receive in prize money from Uefa is €960,000. It was only a couple of months ago that chief executive Tomás ‘Mossy’ Quinn spoke about how the current League of Ireland champions could not continue to rack up seven-figure losses on an annual basis.\nShelbourne accrued a loss of €1.1 million as per their accounts for 2024, with that figure totalling €3.5m for the last three seasons combined. For added context of the reality, should they progress tonight but then fall short in the second qualifying round against seasoned European operators Qarabağ, the champions’ path means that even successive defeats in the third qualifying round of the Europa League and Uefa Conference League play-off would provide €1.7m.\nFollowing in the same path of Shamrock Rovers into the league phase of the third-tier competition all of a sudden makes the financial picture look so much better, and would come close to wiping out the shortfall of the last three years. Teams who progress into the Uefa Conference League can, according to the governing body, “expect to receive a league phase\nallocation of €3.17m, split into a down-payment of €3.05m and a balance of €120k.”\n‘These are the games you want to be involved in’ – Joey O’Brien says the financial focus on their Champions League qualifier with Linfield comes from outside the camp pic.twitter.com/dzm7Qh6zQ9\n— RTÉ Sport (@RTEsport) July 15, 2025\nThere are also performance-related bonuses of €400,000 per win and €133,000 for a draw. Such figures are dangerous to consider when all you have is a one-goal lead heading into an away leg that, as of yesterday, had 6,000 tickets sold with Shels taking their full allocation of 1,300 up the M1.\nShields’ experience will be important for the hosts. He was suspended for the first leg, along with his former Dundalk teammate Sean Gannon who is now in red, and will return to the starting XI tonight hoping Linfield can overturn that deficit.\nPredominantly a midfielder, but who also filled in at centre back, Shields referenced in the pre-match press conference how “some of the best nights in my European career have come after a 1-0 away defeat in the first leg”. Dundalk fans won’t need reminding of that occasion.\nThe Lilywhites, then managed by Stephen Kenny, trailed Bate Borisov 1-0 in the third qualifying round of the Champions League. Tallaght Stadium was the venue for the second leg and, as the heavens opened, Dundalk reached for the stars with a thrilling 3-0 win that guaranteed Europa League group stage football.\nThat was the year that began to change the course of Kenny’s career, ultimately leading to the Dubliner becoming manager of the Republic of Ireland.\nThe numbers and finance involved cannot be ignored.\nDundalk’s success almost a decade ago was at a time when the Conference League did not exist, so if either of these sides were somehow able to reach the league phase of the Europa League then €4.31m would come their way.\nAnd if you really wanted to dream big the figure for making it among the elite of the Champions League is close to five times that figure – €18.62m.\n“The players believe there is an opportunity,” Linfield boss Healy said of this tie.\n“We’re going to try and get our foot on the ball more and have enough possession to go and hurt them. Our strengths weren’t shown last week. We have beaten a lot of good sides in Europe at Windsor Park, even in very recent years.”\nSome of the names on that list will be recognisable to a League of Ireland audience.\nBorac Banja Luka – who Rovers faced last year – were thumped 4-0 in 2021, and Stjarnan – who have played against Rovers and Bohemians in recent seasons – were put to the sword 2-0 last season. The 1-0 triumph in 2022 over one of last year’s Europa League semi-finalists, Bodo Glimt, also caught the eye, even if an 8-0 thrashing away from home told a different story.\nThe task for Shels is clear and if they are to keep on dreaming in Europe they must meet the reality of that challenge head on tonight.\nTonight – Linfield (0) v Shelbourne (1), BBC iPlayer, 7.45pm.",
  "word_count": 1004,
  "scraped_at": "2026-02-14T02:26:46.358772",
  "_text_extracted": true
}