{
  "article_id": "9214b34809d8",
  "url": "https://www.empireofthekop.com/2025/01/01/trent-alexander-arnold-real-madrid-move/",
  "title": "Trent Alexander Arnold transfer : Real Madrid move may be a formality",
  "date": "20250101T124500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool are understood to have rejected what Sky Sports termed an ‘approach’ from Spanish champions Real Madrid for Trent Alexander-Arnold.\nThe England international’s current contract remains set to expire in the summer of 2025 – along with that of Virgil van Dijk and Mo Salah.\nIt’s worth emphasising that the latter two players’ respective situations would appear more straightforward with regard to potential extensions, judging by the ongoing noise around the club.\nThe No.66, however, remains a somewhat more complicated case given Los Blancos’ clear interest in his services.\nReal Madrid move suggests transfer confidence\nThe lure of the Spanish capital and Europe’s premier outfit will be all too familiar to former Red Michael Owen who previously traded life at Anfield for the Bernabeu back in 2004.\nSpeaking on X on Tuesday evening, the Englishman remarked that an approach from Madrid suggested ‘it’s only a matter of time’ until a transfer is sealed.\nThe very fact that Real Madrid have now made their intentions clear towards signing Trent Alexander Arnold leads me to believe that it’s only a matter of time before he signs for them. If he was going to sign a contract extension, Madrid wouldn’t have officially made their move.…\n— Michael Owen (@themichaelowen) December 31, 2024\nWe’d humbly suggest that’s not necessarily the case, and we wouldn’t put it past Carlo Ancelotti’s outfit to look to unsettle the Premier League-toppers in a bid to push Alexander-Arnold to jump ship.\nWhen will we know for sure?\nThe Athletic’s David Ornstein has already provided some much-needed clarity here: “In the month of January, we should see some movement, a resolution of sorts, because he will want this to get sorted sooner rather than later.”\nOh, indeed.\nIt remains truly remarkable that we’ve managed to remain totally focused on our objective of lifting silverware this term despite the fact that three of the biggest contracts in Liverpool’s history remain yet to be sorted.\nWe strongly suspect the club will manage to conclude at least two of these talks in a positive fashion, as far as those of a red persuasion are concerned.\nNonethless, it would remain a great tragedy to see possibly the most competent passer of the ball in world football succumb to the allure of life with the 15-time Champions League winners.\nIt would be quite a shame to see Trent Alexander-Arnold throw away a guaranteed legacy at L4 in favour of the possibility of individual glory in Madrid.\nBut it’s his call to make.",
  "word_count": 417,
  "scraped_at": "2026-02-14T01:58:00.738543",
  "_text_extracted": true
}