{
  "article_id": "9248f23266ea",
  "url": "https://www.caughtoffside.com/2025/01/01/arsenal-transfer-news-matheus-cunha/",
  "title": "Arsenal transfer news : Matheus Cunha links make sense",
  "date": "20250101T073000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Matheus Cunha interest makes sense amid Bukayo Saka injury blow\nIt’s still early days for Arsenal obviously in terms of how they are going to deal without the injured Bukayo Saka.\nThey got themselves off to a winning start without that talismanic winger, albeit in pretty unconvincing fashion as they edged past Ipswich 1-0 at the Emirates. You would suggest, however, that the two very tricky looking away games at Brentford and Brighton will give us a clearer indication of how they will cope without the England international.\nWhatever happens though, I really do feel they have to do all they can in the January transfer window to bolster what now looks like a pretty threadbare attack.\nYes, January is a notoriously difficult window to do decent business in, but it’s not impossible and I would hope that Arsenal have been working very hard behind the scenes to try and identify a couple of opportunities that could give them the boost they need.\nI’m not necessarily talking about a big January move. Those sort of moves might have to wait until the summer. But there is certainly scope for the club to do something to fill the void that Saka’s absence will leave behind.\nArsenal interest in PL star CONFIRMED\nArsenal are always reluctant to do business in January and the message heading into this window through conversations I’ve had has always been that the club would be reactive, rather than proactive in the market.\nThat’s understandable, but this does feel like something that they have to react to. Losing Saka for around ten weeks is a hammer blow. It’s as simple as that.\nI don’t think anyone who comes in has to be a like-for-like replacement. They just need another option who can play in the frontline and can contribute goals and assists.\nI’m a big fan of Matheus Cunha and Arsenal’s interest in him does make a lot of sense. I do understand, however, it would be very difficult to lure him away from Wolves in the middle of the season when they are battling relegation.\nArda Guler on loan from Real Madrid would also be an interesting short term move. We’ve seen Arsenal have some success with a deal like that in the past. Just think of Martin Odegaard for example.\nGuler is young, but he has shown he can perform on the biggest stage and has the talent to make a difference in the final third.\nSo there could be options out there for Arsenal, it’s up to them to go out there and find them.\nIs Gabriel Martinelli ready to step up on that right-hand side?\nI thought Gabriel Martinelli did OK playing on the right against Ipswich. There were some good moments and I think it would be unfair to write him off as an option on that side after just one start.\nHe’s going to take some time to get used to playing in that role and his team-mates are going to have to take some time getting used to someone other than Saka occupying those positions.\nArsenal are going to be different without Saka. Mikel Arteta has already said that. They can’t just continue playing the same way with someone else playing in his role and expect things to be exactly the same.\nMartinelli had a few good moments against Ipswich. He whipped in a couple of good crosses, including one that played a part in the goal.\nI want to see him doing more of that. Just moving the ball onto his right foot and getting it into the danger area before the defence is set. The fact he can do that, rather than cutting inside on his stronger foot like he does over on the left should be a benefit for Arsenal.\nHe clearly needs to work on being more of a threat himself though. He didn’t have a shot against Ipswich and that’s not good enough. He must be a threat, like Saka always is.\nAs we wait for the window to open, I still think Martinelli is Arsenal’s best option on the right. Ethan Nwaneri is another and is a more of a like-for-like replacement given the way he plays and the way he likes to cut inside onto left.\nIt would be good to see him get a go over there at some point, but I feel you have to stick with Martinelli for now and give him a chance to get used to that role himself.\nPainful as it is to admit as an Arsenal fan, it’s hard to see anyone catching Liverpool\nIt’s tough to look at Liverpool right now and see them slipping up.\nThere is still such a long way to go and no-one knows better than Arsenal how difficult it is to keep up such an impressive pace for the length of an entire season.\nBut they just look so strong and are clearly playing with so much confidence right now. It’s very difficult to see where any prolonged slip up is coming from.\nIn Mo Salah they have the best player in the world at the moment and he is proving the difference week in, week out.\nThe numbers he is producing are incredible and when you have players like Cody Gakpo, Luiz Diaz and Jota backing him up it is just an embarrassment of riches for Arne Slot.\nMaybe the contract issues with Salah, Trent Alexander-Arnold and Virgil van Dijk will start to have a negative impact on Liverpool, but right now that does feel a bit like rival teams clutching at straws.\nJust look at the West Ham game. Before that everyone was talking about Trent and the rumours he had already told Liverpool he would be leaving for Madrid.\nDid that cause a distraction? No, he played, played well, Liverpool scored five and he bagged one of them himself.\nSo I don’t really see it making much of a difference. If Arsenal or anyone else are going to claw back Liverpool, they are going to have to do it by doing things right themselves, rather than relying on some sort of implosion amongst the squad at Anfield.\nWhy are people still surprised by Tottenham being, well, Tottenham?\nWhat has gone wrong at Tottenham? I mean, that’s a question that someone could spend years studying and still not come up with a suitable answer.\nTo be honest I’m not sure much has actually gone wrong with them this season. They are just Tottenham. This is what they do.\nI mean, is anyone really surprised by their struggles this season? I can’t imagine they are.\nThey have some good players, they play some good football and on their day they can beat anyone. They just look like a cup team to me under Ange Postecoglou.\nIt might finally win them a trophy. They are in the semi-final of the League Cup after all and you would think they should go far in the Europa League, but I can’t see them competing for the league unless Postecoglou changes his ways a bit.\nThey are just too open and are far too easy to pick off.\nThey have had lots of injuries this season and that does have to be taken into account, but it’s not like they are watertight when they have Cristian Romero and Micky van de Ven fit is it? They still concede far too many goals.\nIt will be interesting to see if Daniel Levy sticks with Postecoglou. You just never know what he is going to do.\nI suppose when people ask what is wrong with Spurs, then Levy has to come into the conversation.\nHow many managers has he hired who have failed? The one real success story was Mauricio Pochettino and Levy booted him out soon after he had taken the club to a Champions League final because he felt he could get better.\nThat didn’t pan out very well did it…",
  "word_count": 1327,
  "scraped_at": "2026-02-14T01:52:10.145844",
  "_text_extracted": true
}