{
  "article_id": "925b4a3e1c94",
  "url": "https://metro.co.uk/2025/10/20/jamie-carragher-tells-liverpool-stop-arsenal-winning-premier-league-24477195/",
  "title": "Jamie Carragher tells Liverpool how to stop Arsenal winning the Premier League",
  "date": "20251020T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher fears Liverpool’s losing streak will continue following the 2-1 defeat to Manchester United, with Arsenal now his Premier League title favourites.\nBut the Reds legend suggests Arne Slot’s side can still defend their crown even if they trail Mikel Arteta’s team toward the end of the season.\nFollowing a brilliant start to the campaign, four consecutive defeats in all competitions have exposed Liverpool’s weaknesses and highlighted the poor performances of their star players.\nSlot will need to turnaround their form and quick, with tricky games against Crystal Palace, Manchester City and Real Madrid on the horizon, but Carragher isn’t confident.\n‘I feared this happening,’ the former defender told The Gary Neville podcast. ‘It almost feels like once that invincibility is gone – a little bit like with Man City last season – every [rival] team feels like they’ve got a chance.\n‘I remember playing Arsenal, the invincible team, and beating them 2-1. I think they’d lost the game before at Old Trafford and that team, once they’d lost one, they just went on this run of losing games because everyone just got this belief they could go and beat them.\n‘It feels like Liverpool now have just lost that cloak of invincibility. Last season they went months without losing a game and once they’ve lost one, the chink in their armour is there and it just feels like every game they go into now, the opposition have got real belief they can score goals.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIt is only eight games into the season and leaders Arsenal are only three points clear of Manchester City, with Liverpool a point further behind.\nAnd while Carragher fears for his former side in the short-run, he says a shot at the title will still be on the cards, providing the gap to the Gunners is not too large.\n‘The worry for them is, I think they’re going to lose more points between now and the end of January, February. A lot more points,’ he added.\n‘And will Arsenal or Manchester City be too far away from them? I think Arsenal right now look the best equipped team to win the title.\nMore Trending\n‘But Arsenal will get nervous in March and April because they haven’t won a league for so long. And Liverpool and Manchester City need to make sure they’re not too far out in front where they can’t affect that.\n‘And that’s the thing with Liverpool now losing these silly points. I think they’ll lose more. They’ve got to keep Arsenal within arm’s length of them.’\nIn two of the last three seasons, Arsenal led the title race going into the run-in, only to suffer a late collapse, allowing Man City to lift the trophy instead.\nLiverpool’s first opportunity to get back to winning ways will be on Wednesday night when they take on Eintracht Frankfurt in the Champions League, before travelling to Brentford for their next top-flight clash.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd cult hero rushed to hospital after suffering three broken ribs and collapsed lung\nMORE: Alan Shearer tells Mikel Arteta he ‘paid too much’ for one Arsenal summer signing\nMORE: Liverpool legend Jurgen Klopp criticises Manchester United over two transfers",
  "word_count": 605,
  "scraped_at": "2026-02-14T01:59:14.389358",
  "_text_extracted": true
}