{
  "article_id": "925e5994f4dd",
  "url": "https://www.surinenglish.com/opinion/rob-palmer-commentator-espn-the-boy-from-birmingham-20251226124534-nt.html",
  "title": "The boy from Birmingham | Sur in English",
  "date": "20251226T121500Z",
  "domain": "surinenglish.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The boy from Birmingham\nJude Bellingham's all-action performance embodies exactly what the Real Madrid coach is looking for from the whole team, writes columnist Rob Palmer\nRob Palmer / ESPN commentator\nMalaga\nFriday, 26 December 2025, 12:45\n'Hey Jude\" ringing around the Bernabéu; MVP awarded; the goal that changed the game: Bellingham is back!\nSt Jude's halo had slipped and he faced the most challenging few months of his so-far illustrious career.\nHe'll be hoping England manager Thomas Tuchel was part of the global television audience that witnessed one of his best performances in a long, long time; Bellingham inspired Real Madrid to a vital victory in the final game of 2025 against Sevilla.\nIt hasn't been a great year for the former Birmingham City youngster. He played the opening months with a shoulder pad that wouldn't be out of place in the NFL. It was obvious that he needed an operation, but the club asked him to postpone surgery until the end of the summer's Club World Cup; in some ways, they were gambling with his wellbeing.\nInitially, it paid off as the team hit the ground running under the new coach Xabi Alonso. Real Madrid won every game in his absence and it allowed the West Midlands native to manage his comeback.\nWhen he was left out of the England squad in October, it made headlines back. It was easy to say he was dropped; the truth was that he merely hadn't been selected. At that point, he'd not managed 90 minutes and so wasn't worthy of a place in the team.\nIt was calculated by Tuchel as it allowed Bellingham vital recovery time, but also made a statement that he needs to earn his place as the English national set-up is blessed with talented midfielders. The England coach also wanted to curb the slight cockiness that Bellingham can occasionally display - Tuchel clearly wasn't a fan of his showboating tendency.\nThe boy from Birmingham has buckled down. He scored the winner in the Champions League against Juventus and this was followed up by the winner in El Clásico against Barcelona.\nHe's been a godsend to Xabi Alonso in his hours of need. At the lowest point, he scored the 87th minute equaliser against Elche. It's now four goals and three assists in the last nine Liga games.\nMost importantly, he's gone the full 90 minutes in those nine games. His performance against Sevilla was vintage - when Real Madrid were struggling for a goal, he came crashing through a congested penalty area to thunder home a classic header. Thereafter, he put in a cavalier performance.\nAlonso has struggled to get his high energy, high pressing game across to the whole team in his first season managing at the Bernabéu. What he can do now is show a video of Bellingham's all action performance as it embodied exactly what the coach is looking for.\nHe's also playing a different role to his early days when he was an attacking force. Now, he's operating from deeper, covering more ground, and arriving in support at just the right time.\nThe England fanbase may be ignorant to his resurrection with the lack of visibility of Spanish football back home, but Tuchel must surely be aware. \"The Lion\" is roaring once again.",
  "word_count": 550,
  "scraped_at": "2026-02-14T02:15:58.645500",
  "_text_extracted": true
}