{
  "article_id": "925f62992860",
  "url": "https://www.teamtalk.com/chelsea/double-deal-agreeing-midfielder-move-ornstein-reveals-accepted-transfer-fee-loftus-cheek-chelsea-milan",
  "title": "Chelsea tee up double deal by agreeing midfielder move as Ornstein reveals accepted transfer fee",
  "date": "20230627T134500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nChelsea tee up double deal by agreeing midfielder move as Ornstein reveals accepted transfer fee\nChelsea have accepted an offer from AC Milan for Ruben Loftus-Cheek, who has agreed personal terms with the Serie A side, according to various reports.\nLoftus-Cheek is one of many midfielders in line to leave Chelsea this summer. N’Golo Kante has gone to Al Ittihad in Saudi Arabia, while the Blues have also accepted a bid from fellow Premier League side Manchester City for Mateo Kovacic.\nMason Mount has also been attracting interest, particularly from Man Utd, while TEAMtalk understands that Carney Chukwuemeka will be available for loan next season.\nChukwuemeka has also been linked with Milan, funnily enough, but Loftus-Cheek is the player they have been making major progress on.\nOn Monday, an agreement between the two clubs was said to be ‘very close’. Sure enough, 24 hours later, the breakthrough has been reached.\nAccording to David Ornstein of The Athletic, Chelsea have agreed to sell Loftus-Cheek to Milan for an initial fee of around £15m, plus add-ons.\nDharmesh Sheth of Sky Sports News has explained, backing up original information from Gianluca Di Marzio, that the deal will come to around £18.5m all in.\nFrom Ornstein’s report, it can also be discerned that Loftus-Cheek has given his own green light to the move. Personal terms with Milan are in place for what will be a four-year contract.\nAt San Siro, he will be able to link up with Fikayo Tomori, another product of the Chelsea academy.\nLoftus-Cheek to be followed out of Chelsea by Pulisic\nEx-Chelsea striker Olivier Giroud is also in the Milan squad, while Stefano Pioli’s side are – as Sheth has reminded – working on a deal to take Christian Pulisic out of west London too.\nTherefore, Loftus-Cheek could be followed to the same destination by the American winger in a double raid by the Rossoneri on Chelsea.\nLike Loftus-Cheek, Pulisic has become eager for a new challenge after his opportunities to start matches regularly for Chelsea decreased.\nFurthermore, moving to Milan will enable the pair – neither of whom have played in Serie A before – to continue in the Champions League after Chelsea dropped out of European football altogether following their 12th-place finish at the end of a turbulent season.\nGetting rid of their fringe players will be important for Chelsea, whose bloated squad size was a factor in them underperforming under various coaching regimes in 2022-23.\nAfter how much money they spent in the past two transfer windows, Chelsea need to balance the books because of Financial Fair Play requirements.\nLoftus-Cheek and Pulisic could join Kante and Kalidou Koulibaly in making their exits official soon. Edouard Mendy, Hakim Ziyech and Kai Havertz are also close to confirming moves elsewhere.\nREAD MORE: Italian giants formulate cheeky deal for Chelsea star; Everton urged to make ambitious move",
  "word_count": 482,
  "scraped_at": "2026-02-14T01:56:02.414260",
  "_text_extracted": true
}