{
  "article_id": "926c1978a982",
  "url": "https://www.caughtoffside.com/2025/10/17/brendan-rodgers-premier-league-return-nottingham-forest/",
  "title": "Report : Brendan Rodgers linked with stunning Premier League return with surprise club",
  "date": "20251017T221500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Liverpool manager Brendan Rodgers has emerged as a leading contender for the Nottingham Forest job, as pressure mounts on Ange Postecoglou.\nNottingham Forest enjoyed a remarkable 2024/25 campaign under Nuno Espirito Santo, finishing seventh in the Premier League and securing Europa League qualification.\nHowever, their form has drastically declined this season, prompting owner Evangelos Marinakis to make a ruthless change in the dugout.\nPostecoglou was appointed as Nuno’s replacement after winning the Europa League with Tottenham, ending Spurs’ long trophy drought by beating Manchester United in the final.\nDespite that triumph, he was dismissed by Daniel Levy and replaced with Thomas Frank following a disappointing domestic campaign.\nAnge’s return to management at Forest has been far from ideal. He is yet to register a win in seven games across all competitions, drawing two and losing five. Reports now suggest that a defeat against Chelsea could lead to his dismissal, with Marinakis already exploring potential successors.\nBrendan Rodgers could make Premier League return\nSeveral managers have been identified as possible replacements if Ange is sacked, including former Liverpool manager Brendan Rodgers.\nAccording to Alex Crook of talkSPORT, Evangelos Marinakis is a ‘long-term admirer of Brendan Rodgers’.\nCrook adds that Rodgers is expected to leave Celtic in the summer, with a Premier League return looking increasingly likely.\nAs per the report, Crystal Palace boss Oliver Glasner, Fulham’s Marco Silva and Bournemouth’s Andoni Iraola are all managers in high demand ahead of the summer.\nGlasner has been linked with the Manchester United job recently while Iraola has also been backed for the Old Trafford job.\nSilva has also attracted interest from several Premier League clubs including West Ham, with Graham Potter struggling to make an impact.\nThe managerial changes across the clubs is expected to open more vacancies in case a move to Nottingham Forest does not materialise.\nBrendan Rodgers’ time in the Premier League\nBrendan Rodgers’ managerial career in the Premier League spans across three different clubs: Swansea City, Liverpool, and Leicester City.\nThe Northern Irishman first made his mark with Swansea City, guiding them to promotion in 2011 and establishing the Welsh club as a respected top-flight side.\nHis possession-based philosophy, often dubbed ‘Swanselona’, earned high praise, making Swansea one of the most watchable teams outside the traditional big clubs.\nThat success caught the attention of Liverpool, who appointed him in 2012 with hopes of restoring their identity and challenging for the title once again.\nRodgers’ spell at Liverpool was defined by the thrilling 2013/14 season, when the Reds came within touching distance of winning the Premier League title.\nUnder his management, Liverpool played some of the most electrifying attacking football in the club’s modern history, spearheaded by Luis Suarez, Daniel Sturridge, and Raheem Sterling.\nHowever, the subsequent seasons failed to replicate that success. Following a disappointing start to the 2015-2016 season, Rodgers was dismissed in October 2015.\nBrendan Rodgers’ managerial statistics in the Premier League across Swansea City, Liverpool, and Leicester City.\nRodgers returned to the Premier League with Leicester City in 2019, where he enjoyed a prolonged period of relative success.\nHe guided the Foxes to back-to-back fifth-place finishes in the 2019-2020 and 2020-2021 seasons, narrowly missing out on Champions League qualification on both occasions.\nHis time at the King Power Stadium was crowned by winning the FA Cup in 2021, a historic first for the club, and the Community Shield later that year.\nDespite the success, a poor start to the 2022/23 season led to an eventual dismissal.\nGiven his past success in the Premier League, his appointment will no doubt be one to watch.",
  "word_count": 598,
  "scraped_at": "2026-02-14T01:49:53.046671",
  "_text_extracted": true
}