{
  "article_id": "929be8d4a5f3",
  "url": "https://www.france24.com/en/live-news/20230228-klopp-urges-liverpool-to-capitalise-in-crucial-week",
  "title": "Klopp urges Liverpool to capitalise in crucial week",
  "date": "20230228T221500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Klopp urges Liverpool to capitalise in crucial week\nLondon (AFP) – Liverpool manager Jurgen Klopp said on Tuesday this was a crucial week if his side are to push towards the Premier League's top four and the Champions League places.\nIssued on:\nThe Reds face Wolves at Anfield on Wednesday after a dispiriting goalless draw against Crystal Palace at the weekend took the momentum out of a mini-revival in their Premier League form following a difficult first half of the season.\nOn Sunday they welcome Manchester United, fresh from winning the League Cup.\nVictories against Everton and Newcastle in February signalled a return to form for Liverpool but the 5-2 demolition by Real Madrid in the Champions League appeared to feed into the lethargic showing at Selhurst Park.\nWhen Liverpool crashed to a 3-0 defeat at Molineux this month, it appeared to sum up a team suffering from last season's charge after a quadruple that ended with the FA Cup and League Cup double.\nBut with Liverpool on 36 points and with two games in hand over Tottenham, the team in fourth position, Klopp is looking to maximise the return from their last 15 league matches.\n\"It's 45 points. It would be a really good moment (to achieve two wins). Yes, you can imagine, that's exactly what we want to do,\" he said.\n\"It's a super important week. We cannot ignore that. We have two home games. I would love to give the season a little push in this week.\n\"We have got seven points from these three games. The last one we drew and I know I said it's the same game like we played before but without scoring and people said 'But it's the most important stuff'. I know. You cannot change the other facts as well.\n\"We have to force it as well but we have to play, enjoy what we are doing - that's really important,\" Klopp said.\nDespite Liverpool's woes this season, there are parallels with the 2020-21 campaign when they won eight and drew two of their final 10 games to secure Champions League football.\n\"We have a lot of stories to tell where it went well in the last few years, with long winning streaks and going unbeaten at home and so on,\" Klopp said.\n\"History is not allowed to hinder you but you can't constantly rely on the fact we did it before so we can do it again. We have to make sure.\n\"I really think we are ready. If there is a club that can do it, I really think it is us. Honestly.\"\nDarwin Nunez was absent against Palace with a shoulder injury but the forward trained on Monday and is set to feature on Wednesday and centre-back Ibrahima Konate has returned to the squad after a month out with a hamstring injury.\nLiverpool made a pre-tax profit of £7.5million last season, with sharply increased off-field costs reducing the overall effect of a £107 million increase in revenue, the club said on Tuesday.\nRevenue rose to £594m but administrative expenses shot up by £69 million to £545 million due to the increase in the cost of salaries and matchday costs.\nLiverpool's owner John Henry last week denied the club were up for sale despite seeking fresh investment.\nHenry's Fenway Sports Group (FSG) said in November it would \"consider new shareholders if it was in the best interests of Liverpool as a club.\"\n© 2023 AFP",
  "word_count": 576,
  "scraped_at": "2026-02-14T01:59:41.695441",
  "_text_extracted": true
}