{
  "article_id": "92bc89d5ead6",
  "url": "https://balkaninsight.com/2023/08/09/greece-prosecutor-probe-on-the-death-of-the-aek-fan/",
  "title": "Greece Probes Death of Fan in Athens - Zagreb Football Violence",
  "date": "20230809T124500Z",
  "domain": "balkaninsight.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Greece Probes Death of Fan in Athens-Zagreb Football Violence\nProsecutors on Wednesday will interview football fans arrested after clashes in the Greek capital between supporters of AEK Athens and Croatian club Dinamo Zagreb that caused the death of a 29-year-old Greek man.\nA Greek police representative told BIRN that among the 104 people arrested during the violence in Athens on Monday evening, there were 94 Croats, six Greeks, one Albanian, one German, and one Austrian.\nPolice set up a blockade at the country’s borders to prevent anyone wanted for involvement in the violence from fleeing the country. Six Croats were arrested at Igoumenitsa port and one at the Greek-Albanian border.\nThe 29-year-old victim had a clean criminal record, according to police. So far, the nationality of the perpetrator has not been identified.\nFour Greeks who were hospitalised due to injuries sustained in the clashes have since been released.\nThe violence broke out before a UEFA Champions League qualifying match between AEK Athens and Dinamo Zagreb that was due to be played on Tuesday. UEFA postponed the match.\nThe Greek police said they had been informed about the movements of the Dinamo fans by the Croatian and Montenegrin police. Greek media reported that the Interpol office in Montenegro sent a list of the fans’ vehicle licence plates.\nThe Dinamo supporters involved in the violence are reported to belong to Bad Blue Boys, a hardcore Zagreb fan group. Some members of the Bad Blue Boys have far-right views and caused outrage by doing Nazi salutes in the streets of Milan before Dinamo played there last September.\nThe Greek police’s Sub-Directorate for Combating Sports Violence of the Greek Police had drawn up a special report on the activities of the Bad Blue Boys, who have links with the Greek team Panathinaikos.\nDespite this, the Greek police failed to prevent the clashes, Minister of Civil Protection Yiannis Oikonomou told the Alpha TV channel.\nThe opposition called for Economou’s resignation but he rejected the demand.\n“I would have no qualms about resigning – although I have only been in my position for ten days – if the issue had to do with political planning. The Minister of Citizen Protection is not a police officer, operational, to draw up plans to deal with hooligans,” he said.",
  "word_count": 380,
  "scraped_at": "2026-02-14T01:48:22.645962",
  "_text_extracted": true
}