{
  "article_id": "92bdf090555b",
  "url": "https://www.themag.co.uk/2024/11/aston-villa-we-gave-your-boys-one-hell-of-a-beating-vitoria-guimaraes-newcastle-united-fk-mlada-boleslav/",
  "title": "Aston Villa - We gave your boys one hell of a beating",
  "date": "20241109T214500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa – We gave your boys one hell of a beating\nAlthough Newcastle United exacted revenge for Chelsea’s narrow victory in the Premier League at Stamford Bridge, by knocking them out of the Carabao Cup a few days later, the millionaires of West London remain firmly in the European competition that they inadvertently tore from our grasp at the end of last season!\nWhen the recently departed (from Old Trafford, anyway) Erik ten Hag’s men unexpectedly beat their neighbours from Eastlands in the FA Cup final, it meant that they took Chelsea’s Europa League place and so they, in turn, turfed us out of the Conference League.\nMany supporters strangely saw this lack of a European diversion as a good thing.\nThey cited the injury woes we had suffered during our Champions League adventure the season before, as evidence that we weren’t ready in terms of squad depth, to campaign in both a domestic and foreign front at the same time.\nI don’t agree with that point of view.\nI see European football as a good thing for the club. It excites the fans and it gives the players and coaching staff a new challenge, broadening experience, and – in the case of the less exacting Conference League – providing opportunities for some of the fringe players to gain some valuable first team minutes (an approach that Chelsea have taken to the extreme!).\nFurthermore, not being “in Europe” is a major red flag for potential top level signings.\nWell, we didn’t make it in the end and I found myself wondering who I could take an interest in during those midweek spells of European activity – increased spells this season as UEFA shamelessly extended the chances of the “big boys” generating more money and progressing further in the competition by introducing a rather mysterious Swiss League format. A format which guarantees every team in the Conference League six matches, three at home and three away, whilst in the Champions League and Europa League it is four at home and four away (I wonder which teams that’s likely to benefit?).\nThe whole concept of the Swiss League format – and UEFA’s cynical motivation for introducing it – was explained in detail in a good, in-depth article on The Mag recently, in an article entitled “Champions League disgrace – UEFA believe they can fool all of the people all of the time” which you can read HERE. If you haven’t read it I strongly advise you to do so.\nThe first offering that I came across in perusing the teams in the early qualifying rounds of the Conference League was the gloriously named Bruno’s Magpies, a Gibraltarian side founded by a bunch of Newcastle fans based in Bruno’s Bar on “the Rock”. A true pub team! Unfortunately, they bit the dust before the first round proper, being comprehensively outplayed – but not disgraced – by Copenhagen FC.\nHence my hasty switch of loyalties, but as luck would have it, I was able to maintain a Bruno connection (and give myself the chance of maintaining interest into the latter stages) by latching on to the Portuguese top flight outfit Vitoria Guimaraes – aka the Brunos.\nThe Brunos, nicknamed Os Conquistadores (the Conquerors), sailed through the qualifying rounds without conceding a goal. They continued their winning ways once into the Swiss league stage and moved into match day week three of the competition “proper” with a 100% record – two wins out of two. They defeated the Slovenian team, Celje 3 – 1 in Round 1 – thus gaining revenge for the exit they suffered at the Slovenians’ hands, or more probably feet, last season. In round 2 they travelled to Stockholm, Sweden, where they put paid to Djurgarden IF of the Allsvenskan with a 2 – 1 victory.\nRound 3 saw “Os nossos rapazes” (our boys) back at home in the Estadio Dom Afonso Henriques. The visitors this time were Czech team FK Mlada Boleslav. Mlada Boleslav is a small town of around 46,000 in the central Bohemian region of the Czech Republic, about 40 miles NE of Prague.\nThe club was founded in 1904 as a student sporting club but the first development of interest from a British point of view occurred in 1919 when it was renamed Aston Villa Mladá Boleslav, due to local interest in the team that had been so dominant in English football towards the end of the 19th century. Someone influential obviously had a good memory and very poor taste!\nPost World War two up to the present day the club has been closely associated with the Skoda car company, with AŠ (Auto Škoda) being an important element of its name up until 1990 when it became simply FK Mladá Boleslav (Fotbalový klub Mladá Boleslav) which, despite a couple of minor tweaks in between, it remains to this day. I’m guessing the team bus is a top of the range Škoda complete with rear heated windows in case the lads have to get out and push it in winter!\nSince 2004, Mladá Boleslav have finished top six every other season on average and won two Czech Cups. They have enjoyed ten European campaigns with famous victories over Marseille and Palermo, and draws against Paris Saint-Germain and Rapid Bucharest. Quite a rise from Bohemian football obscurity to the international stage.\nObviously, in a town of 46,000, the club has fairly modest means. Their ground is the the Městský Stadion which is near the Škoda factory. It’s a small but modern all-seater stadium, with only three sides in use, which can hold 5,000 spectators – although average gates in recent years have been in the region of 3,300. No doubt the locals in Guimaraes will have been mercilessly chanting “What’s it like to see a crowd” at any Czechs who had optimistically made the 2,500 km trip.\nAlas, any brave Czechs who had made the effort were doomed to disappointment with “Os Branquinhos” (The little whites) taking firm control of the game with a goal either side of half time. After 39 minutes Kaio César drew a foul in the box and Tiago Silva subsequently converted the penalty with a right-footed shot to the top right corner. Then, on 59 minutes, Óscar Rivas’ left-footed shot from the left side of the six-yard box flew into the top left corner after an assist by Manu Silva. 2 – 0 to the Brunos.\nDespite a 72 minute consolation goal by Vasil Kusej for Mladá Boleslav – a right-footed shot from the centre of the box to the bottom left corner – which was followed by a few minutes of Boleslav pressure it, ended with “nil points” in Europe for the visitors. And the Brunos are once again marching on – into 5th place, only on goal difference, in the Conference League table.\nI have to say that I’m very happy with that result. Not only is it encouraging in terms of the likelihood of qualifying comfortably for the Round of 16 stage of the competition but It’s always good to see “our boys” give Aston Villa a good beating!\nAfter Match Day three this is what the Europa Conference League table is looking like:\nGood luck to our boys when they travel to play Astana later this month (28 November).\nAfter everybody has played their six league matches, the top eight automatically go through to the last 16, then those teams finishing 9th to 24th, have home and away play-offs to provide the other eight clubs for the last 16.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1274,
  "scraped_at": "2026-02-14T02:02:07.196709",
  "_text_extracted": true
}