{
  "article_id": "92c6b32a40ae",
  "url": "https://www.juneesoutherncross.com.au/story/8171235/western-utds-diamanti-calls-time-on-glittering-career/?cs=6417",
  "title": "Western Utd Diamanti calls time on glittering career",
  "date": "20230425T014500Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Western United's Italian superstar Alessandro Diamanti has one last chance to dazzle A-League Men fans and destroy Perth's hopes of sneaking into the play-offs.\nSubscribe now for unlimited access.\nor signup to continue reading\nDiamanti, who helped United to their inaugural ALM title last season, will hang up his boots at the end of this campaign.\nGlory need to down United at home on Saturday night and hope Wellington are beaten by Macarthur FC earlier in the day, with a three-goal swing, if they are to prolong their campaign.\nThe attacking midfielder will call time on a decorated career spanning four countries, 23 years and over 550 professional matches for club and country.\n\"I am a happy man. I have always tried to be a footballer of the people, for the people. I have always followed the true values of football,\" the 39-year-old Diamanti said.\n\"I haven't been a 100 trophy player, but I have been a player who felt loved, by my loved ones first and by all the thousands of people who have been following me for more than 20 years.\"\nDiamanti arrived in Australia in 2019, becoming Western United's inaugural captain.\nIn the club's first season he won the Johnny Warren Medal, the Alex Tobin Medal and Western United's player of the season awards.\nIn 81 games in the green and black, Diamanti scored 11 goals and registered 18 assists.\n\"For us as a football club, Dia has been the catalyst for so much of our growth both on and off the pitch and has contributed to each of our most special memories,\" Western United general manager of football Mal Impiombato said.\nDiamanti began his career at hometown club Prato.\nHe debuted in the Serie A with Livorno before also going on play for Bologna, Fiorentina, Atalanta and Palermo in Italy's top flight.\nHe featured in the Premier League for West Ham United in 2009-10 and spent the 2014 season in China with Guangzhou Evergrande, where he won a league title and gained his first exposure to Australian football as his side met both Melbourne Victory and Western Sydney in their Asian Champions League campaign.\nDiamanti became a regular for the Italian national team in the early 2010s, playing 17 times and scoring once against Uruguay at the 2013 Confederations Cup.\nAustralian Associated Press",
  "word_count": 387,
  "scraped_at": "2026-02-14T01:50:29.471762",
  "_text_extracted": true
}