{
  "article_id": "92c801ec8b05",
  "url": "https://www.arsenal.com/news/preview-arsenal-v-burnley",
  "title": "Preview : Arsenal v Burnley",
  "date": "20231110T171500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After taking a big step forward in our quest to qualify for the Champions League knockout stages, we're aiming to get our league campaign back on track when Burnley head to Emirates Stadium on Saturday.\nThe unbeaten start to the season ended after 11 games following our defeat at Newcastle, but a morale-boosting 2-0 success against Sevilla in midweek was just the tonic we needed as we aim to head into the international break on a high note.\nOur opponents arrive in north London on a poor run of form, losing six of their last seven matches, including the last four. However, all four of their points have been earned on the road so far, while they are unbeaten on each of their last two visits to Emirates Stadium and kept clean sheets in both.\nGoal-shy Clarets struggling\nVincent Kompany breathed fresh air into Burnley during his first season at the helm last term, as they cantered to the Championship title amassing 101 points along the way. Their attractive style of football led many to believe they would be competitive in the top-flight, but just one win has been yielded from their opening 11 games.\nA tough start saw them lose five of their first six, albeit against teams currently in the top eight. A first point was claimed at Nottingham Forest, and their only other result so far came courtesy of an 85th-minute winner from Jacob Bruun Larsson to beat Luton Town 2-1 at the start of October.\nThe benefits from that loss have since been wiped out, with successive defeats coming at the hands of Chelsea, Brentford, Bournemouth and Crystal Palace. A lack of goals is seriously hampering them, with a league-low eight netted so far.\nWhat the managers say\nArteta: \"Looking back on the games they have played and the results they’ve got, in some of them they merited much more than what they got. I don’t think it reflects actually what they deserved in games.\n\"But that is the difficulty of this league. Sometimes when you deserve more you don’t get it because the quality of the oppositions is so high. But the way they have transformed their way of playing, the club, and how they continue to play with the belief that they do, for me it’s remarkable.\" Read every word from Mikel's press conference here.\nKompany: \"I didn't sign up for the job to just win the league with 101 points. If you sign up as a manager, there are only very few people that win. It's usually the same guy and he's bald like me. You have to put things into perspective - very few managers win trophies.\n\"What [Arteta] has done at Arsenal is completely in line with his personality. He started with some tough challenges, but he managed to rally the club behind him, and they've built a team that is one of the best in the league. Nobody doubted that he would be a good manager.\"\nTeam news\nMartin Odegaard missed our matches with Newcastle United and Sevilla over the past week and it remains to be seen if he'll be fit to return, while Bukayo Saka limped off against the Spanish side but Mikel Arteta hopes he'll be OK.\nGabriel Jesus, Emile Smith Rowe and Thomas Partey will again miss out, as does Jurrien Timber following his ACL injury in our opening league game.\nThe Clarets’ top scorer Lyle Foster has missed their last three fixtures through illness and is expected to sit this one out too, while midfielders Aaron Ramsey and Manuel Benson are doubts with knocks. However, Josh Cullen returns after missing the Palace loss through suspension.\nHjalmar Ekdal is out with a knee issue, but Irish striker Michael Obafemi is continuing his recovery from hamstring surgery and recently returned to action for the club’s under-21s.\nTalking tactics\nAdrian Clarke, writing in the matchday programme: Kompany has tinkered with Burnley’s shape in recent weeks as he continues his search for a winning formula. The return of Cullen should see them revert to a 4-3-3, but with no set formation they could line up in a 4-2-3-1 or 4-4-2.\nFull-backs Charlie Taylor and Vitinho invert into central midfield during the build-up phase to help them progress through the thirds. The Clarets are prepared to take risks to fashion overloads that allow them to break the lines with their passing, but too often they have lost the ball inside their own half and been punished.\nThey have also been guilty of dropping off too deep when put under pressure, and have conceded eight goals from outside the box - more than any other Premier League side.\nOn the ball they are patient, but being direct is not off the menu. They make 54.7 ‘long passes’ per game, and just four Premier League sides average more. Most of their forays forward head towards the flanks where they rely on individual magic from their clutch of talented wingers, including Luca Koleosho [above].\nFacts and stats\nHaving won 10 of their first 11 Premier League games against Burnley, we have won just one of our last five.\nBurnley are on the brink of losing five consecutive top-flight matches in the same season for the first time since January 1976.\nThe Clarets have scored just eight goals in our 16 Premier League meetings, and never more than once in a match. No side has ever faced an opponent more without scoring 2+ goals in the competition.\nWe have kept back-to-back Premier League clean sheets at Emirates Stadium, as many as in our previous 15 home games. We last kept three shutouts on the bounce on home soil in December 2021\nWe’re unbeaten in their last 37 home league games against promoted sides.\nBurnley are winless in seven games in London in the competition since a 2-0 win at Fulham in May 2021.\nKompany's team have scored a league-high 38 per cent of their Premier League goals in the opening 15 minutes of games so far this season (3/8).\nIn the Premier League, Mikel Arteta has faced 24 different sides at Emirates Stadium, and the only one he’s failed to beat at least once or see his side score a single goal against is Burnley.\nEddie Nketiah’s first Premier League goal came against Burnley at Turf Moor on the final day of the 2018/19 season. 11 of his last 12 Premier League goals overall have been scored at Emirates Stadium, including each of his last seven.\nBukayo Saka has been directly involved in 21 goals across his 24 Premier League appearances at Emirates Stadium since the start of last season (13 goals, 8 assists).\nMatch officials\nFor the third time already this season, Michael Oliver will referee one of our games at Emirates Stadium, having been the man in the middle for our wins against Nottingham Forest and Manchester City.\nWe have won seven of the last eight matches he has presided over, and he was most recently in charge of Chelsea’s chaotic 4-1 win over Tottenham Hotspur on Monday that saw him award his third penalty of the season, as well as dish out his first two red cards.\n- Referee: Michael Oliver\n- Assistants: Stuart Burt, Dan Cook\n- Fourth official: Craig Pawson\n- VAR: Michael Salisbury\n- Assistant VAR: Ian Hussin\nRecent visits from Burnley\nBurnley are unbeaten in their last two trips to N5, having lost on nine consecutive visits in all competitions between 1975 and 2019.\nThe last time the Clarets visited our corner of north London was back in January 2022 when the teams played out a goalless draw, while the previous fixture saw Sean Dyche’s team claim a 1-0 success thanks to a Pierre-Emerick Aubameyang own goal.\nOur last home win was back in August 2019 when Alexandre Lacazette and Aubameyang were on target, with the Gabon striker bagging a brace in a 3-1 success in December 2018, having done the same back in May of that year in a 5-0 win on Arsene Wenger’s final home game in charge.\nTake a look back at that emotional encounter, plus four more classic victories against the Clarets\nHow to watch\nLog onto Arsenal.com and the official app to join Nick Bright and Adrian Clarke for all the best build-up to the game against the Clarets on Breakdown Live!\nThey'll be joined by former Gunners Alex Song and Brendon Batson, comedian Jacob Hawley and IBF international cruiserweight champion Chev Clarke, while there will be a special interview with Leandro Trossard whom Adrian discussed our tactics and style of play with ahead of the game.\nMembers of Arsenal America will also be on the show after their flight across the Atlantic, and the boys will look back at our midweek European success and evaluate Kompany's team, before handing over to Dan Roebuck and Gilly Flaherty for live commentary - so make sure you tune in!\nYou can also see which broadcasters are showing the game live wherever you are in the world\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1529,
  "scraped_at": "2026-02-14T01:54:16.878274",
  "_text_extracted": true
}