{
  "article_id": "92d4ae4b7f01",
  "url": "https://www.khaama.com/barcelona-clinches-32nd-copa-del-rey-title-with-3-2-extra-time-victory-over-real-madrid/",
  "title": "Barcelona clinches 32nd Copa del Rey title with 3 - 2 extra - time victory over Real Madrid",
  "date": "20250427T093000Z",
  "domain": "khaama.com",
  "source_country": "Afghanistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona secured their 32nd Copa del Rey title with a 3–2 extra-time victory over Real Madrid on April 26, 2025.\nIn a thrilling Copa del Rey final held on April 26, 2025, at Estadio La Cartuja in Seville, FC Barcelona emerged victorious over arch-rivals Real Madrid with a 3-2 win after extra time. This victory marked Barcelona’s 32nd Copa del Rey title, further solidifying their dominance in Spanish football.\nThe match began with Barcelona taking the lead in the 28th minute through a precise strike by Pedri, following a well-orchestrated play initiated by young talent Lamine Yamal. Real Madrid struggled to find their rhythm in the first half, failing to capitalize on their opportunities.\nThe second half saw a rejuvenated Real Madrid, especially after the introduction of Kylian Mbappé. Mbappé equalized in the 70th minute with a stunning free-kick, and shortly after, Aurélien Tchouaméni headed in a goal from a corner, putting Madrid ahead. However, Barcelona responded in the 84th minute when Ferran Torres capitalized on a defensive error to level the score, pushing the game into extra time.\nIn the 116th minute of extra time, Jules Koundé seized upon a misplaced pass from Luka Modrić, driving the ball past Thibaut Courtois to secure the win for Barcelona. The match was not without controversy; Real Madrid had three players sent off during and after the game, including Jude Bellingham, who was dismissed for showing aggressive behavior towards the referee.\nThis victory not only adds another trophy to Barcelona’s cabinet but also reinforces the successful tenure of coach Hansi Flick, who has now secured his second title of the season. The win keeps Barcelona on track for a potential treble, with upcoming fixtures in La Liga and the UEFA Champions League.\nThe final has been hailed as one of the most memorable El Clásicos in recent history, showcasing the intense rivalry and high-caliber football that defines matches between these two giants of Spanish football. The game’s dramatic twists, individual brilliance, and moments of controversy will be remembered by fans for years to come.\nLooking ahead, both teams will need to regroup quickly. Barcelona faces Inter Milan in the Champions League semi-finals, while Real Madrid must address internal challenges and disciplinary issues as they continue their domestic and European campaigns. The outcomes of these upcoming matches will be crucial in determining the success of their respective seasons.",
  "word_count": 395,
  "scraped_at": "2026-02-14T02:09:01.855570",
  "_text_extracted": true
}