{
  "article_id": "92fcd062770a",
  "url": "https://metro.co.uk/2025/10/22/joe-cole-calls-clumsy-chelsea-star-champions-league-win-ajax-24499824/",
  "title": "Joe Cole calls out  clumsy  Chelsea star in Champions League win over Ajax",
  "date": "20251022T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Joe Cole has called out Chelsea star Tosin Adarabioyo for his ‘clumsy’ error in the 5-1 Champions League win over 10-man Ajax on Wednesday.\nAdarabioyo gave away a penalty in the first half after a foul on Raul Moro inside the box, with Wout Weghorst scoring the resulting spot-kick.\nThe Chelsea defender was then taken off at half-time, with Enzo Maresca replacing the centre-back with Trevoh Chalobah at the break.\nFormer Chelsea stars Cole and Eidur Gudjohnsen watched the incident on punditry duties for TNT Sports and were critical of Adarabioyo’s mistake.\n‘It was clumsy,’ Cole said. ‘In modern football, you cannot dangle a leg. He dangles his leg.\n‘Any of these players now, they feel a little bit contact, they go down. The goalkeeper needs to do better there [too] because Weghorst doesn’t put it into the bottom corner.’\nGudjohnsen added: ‘When you’re a man up, you don’t want to concede and you don’t want to nibble at a striker running at you.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘You just want to stand your ground and stay on your feet. It was a silly challenge, really.’\nCole: Estevao Willian gives me Neymar vibes!\nMeanwhile, Cole was full of praise for Chelsea star Estevao Willian after he started and scored in the victory over Ajax.\n‘He’s such a good watch,’ Cole said. ‘Every time I watch him, he gives me Neymar vibes.\n‘He goes both ways. He’s got brilliant balance. He gets the crowd on their feet and he’s a player you love watching.’\nChelsea head coach Maresca compared Estevao to Cole Palmer in his post-match interview on TNT Sports.\n‘For me he is very similar to Cole Palmer, who I had at a very similar age at Man City,’ Maresca opined.\nMore Trending\n‘Cole started to play wide because he needed to build his physicality and now he is playing inside.\n‘With Estevao, they are quite similar. Now he is playing wide but in the future I think he is more of an inside player.\n‘It’s exciting to see him. The good thing about Estevao, sometimes with young players you are worried because after one game playing well and they think they are top.\n‘But Estevao is polite, humble and wants to learn. His family did a job there. We are happy in the way he performs but also because he is a nice boy, a good boy.’\nMORE: £27m Arsenal star hailed as ‘one of the best in the world’ after Atletico Madrid win\nMORE: Barcelona star Marcus Rashford sends message to Real Madrid ahead of El Clasico\nMORE: Ajax boss makes Chelsea claim after Champions League defeat",
  "word_count": 489,
  "scraped_at": "2026-02-14T01:52:49.018846",
  "_text_extracted": true
}