{
  "article_id": "9344b3eacb67",
  "url": "https://metro.co.uk/2023/11/06/marcel-sabitzer-reveals-man-utds-three-leaders-inside-the-dressing-room-19780772/",
  "title": "Marcel Sabitzer reveals Man Utd three  leader inside the dressing room",
  "date": "20231106T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marcel Sabitzer says he feels sorry for Manchester United’s current situation and believes the team’s struggles are partly due to the absences of Casemiro, Luke Shaw and Lisandro Martinez.\nThe Austria international spent the second half of last season on loan at United but his move was not made permanent as he ended up joining Borussia Dortmund in the summer transfer window.\nUnited, meanwhile, have already suffered five defeats in the Premier League last season, while their chances of reaching the Champions League knockout phase have taken a hit following losses to Bayern Munich and Galatasaray.\nErik ten Hag has come under fire after United’s shaky start to the campaign but Sabitzer believes performances ‘will change quickly’ once the squad is fully fit.\n‘I feel very positive about my time there and still talk to a couple of people,’ Sabitzer told The Athletic.\n‘You ask yourself, ‘what’s going on?’ There’s a lot of noise, results are not good, they’ve had defeats at home, which almost felt unthinkable last season. And there’s still the unresolved situation of the ownership. You can see what that does to a team.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I feel sorry for them because they’re all good guys, and extremely hungry for success.\n‘Casemiro, Luke Shaw and Lisandro Martinez – they are leaders that provide structure and stability to the team.\n‘Erik ten Hag comes with up very specific match plans and patterns of play. But if you have too many important players missing and too many changes as a result, things get lost between the tactics board and the pitch. The rhythm of players coming isn’t right, processes aren’t right.\n‘In the Premier League and Champions League, you need your best players available. Everything feels a little laboured and uncertain now. They need their big guys to show up and change the course of the season, but I believe things can change quickly once they get important players back.’\nSabitzer also praised Ten Hag’s man-management skills and insists the United manager is ‘very straight’ with his players.\n‘You can wake him up at 3am, he’d tell you his whole match plan by heart,’ Sabitzer said.\n‘He’s very knowledgeable about football and tactics, a very hard worker, a perfectionist.\nMore Trending\n‘And he’s very straight with you. When I had a bad game, he showed me some situations and told me how to do it better next time. I liked that. You knew where you stood with him. He never threw you under the bus. Instead, he told players to go out and do better in the next game.\n‘I learned a lot about football working under him. He’s a very good coach.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 517,
  "scraped_at": "2026-02-14T01:54:16.879615",
  "_text_extracted": true
}