{
  "article_id": "934f0753db6e",
  "url": "https://playingfor90.com/posts/pep-guardiola-s-options-in-the-transfer-market-to-replace-rodri-at-manchester-city-01j8rpsz8s2d",
  "title": "Pep Guardiola options in the transfer market to replace Rodri at Manchester City",
  "date": "20240927T041500Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City are in a fix. Rodri, a linchpin in Pep Guardiola's setup got a knee ligament injury during the draw against Arsenal, and this is a position the English club need to fill as quickly as possible. The absence of the Spanish midfielder, who tore his knee ligaments, could be until the end of the season. This then forces City to have to look towards the transfer market for a suitable replacement, and of course, they are not short of options.\nFollow Playing for 90 on X (Twitter).\nThe Spanish newspaper AS reports that Guardiola has four names in his notebook, with Brazilian Bruno Guimarães from Newcastle the favorite. Other reports suggest that Crystal Palace's Adam Wharton, Brighton's Mats Wieffer, and Torino's Samuele Ricci are all also in his sights. Each player brings something different, and whoever Guardiola chooses will determine whether Manchester City wins anything this season.\nBruno Guimarães: Guardiola's favorite?\nOf the players in this list, the 26-year-old midfielder Bruno Guimarães, brightening with Lyon before his arrival in the Premier League with Newcastle, has been in the sights of great European teams for a time. During the last transfer window, Manchester City had already tried to bring him into their team, but Newcastle didn't want to let the Brazilian go.\nBruno fits the bill for Guardiola because he can play a number of roles in midfield. His refined technical game is complemented by his strong defensive presence, not to mention excellent positioning and a sense for the game that any coach would want. Besides that, he has experience playing in the Premier League, and his versatile style of play means Bruno would more than likely fit into Guardiola's system with ease.\nHowever, there is one big factor that might complicate the negotiation: Bruno Guimarães had a release allowing his departure for £100 million, but it expired in June, and now full control belongs to Newcastle. It won't be very easy to convince the club to release their star midfielder.\nAdam Wharton, Mats Wieffer, and Samuele Ricci: young Bets\nWith the other options that Guardiola considered, it really does show that even the head coach is willing to bet on promising young talent. The likes of Adam Wharton from Crystal Palace, Mats Wieffer from Brighton, and Samuele Ricci from Torino are, while not as renowned yet as Bruno Guimarães, youngsters who have already demonstrated enough talent in their respective teams to raise the eyebrow of a giant such as Manchester City.\nWharton, for example, is seen as a star on the rise in English football. Yet still only 20, he has demonstrated maturity beyond his years. Strong in the tackle, with a good distribution game, he could develop under the tutelage of Guardiola into a key player in the future.\nAnother interesting option would be Mats Wieffer from Brighton. The 24-year-old has risen in the Premier League, where Brighton has surprised this season. On the other side, Samuele Ricci, aged 23, comes from the Italian school of midfielders, which means being tactically disciplined and intelligent. Currently with Torino, Ricci is a smart player who reads the game well and closes down the spaces.\nInternal solutions: Matheus Nunes and Kalvin Phillips\nWhile City studies the market, it is equally possible that Guardiola could find a solution within his current squad. In this regard, the Portuguese midfielder who recently joined the club, Matheus Nunes, could be tested in Rodri's position. However, despite being a talented one, Nunes is not your typical defensive midfielder. He's more about dynamism and has the ability to drive the ball upwards, which may expose him defensively.\nAnother internal alternative is Kalvin Phillips, now on loan at Ipswich Town. A bright, young spark at Elland Road, all has been quiet on the City front until now. Although a natural defensive midfielder who can fit into Rodri's position, it would be a lot to ask him to bear such an important responsibility amidst such a critical period of the season.\nReplacing Rodri\nWhoever it is, one thing is for sure: Rodri's replacement will not come easy. The Spanish midfielder has been at the heart of Manchester City's success, offering balance between defence and attack and acting as the \"brain\" behind the team's midfield. Without him, the whole dynamic of the team changes, and Guardiola knows whoever replaces him will have to put in top-level performances.\nThere is also the factor of timing: the transfer market will not reopen until January, meaning City have to find ways of managing without Rodri for the next few months using this squad.\nThe decision was always left to Pep Guardiola, a tactically obsessed coach who had an unbeatable eye for a player who would suit his style of play. Manchester City might have the financial power to go after any player, but a call would always be taken based on the profile of the player and how well he can fit into the positional play system of Guardiola.\nAnd naturally, he has big pressure to maintain Manchester City's excellence in a season in which the club wants to not only sustain its dominance in the Premier League but also make a strong run in the Champions League. This injury to Rodri is tough, but it's far from the end of the road. With interesting options in the market and a few internal bets, Guardiola has all the tools at his disposal to keep City competitive.\nNow, the question is, will Bruno Guimarães finally land in Manchester or will Guardiola make a bet for younger and moldable talent? Whatever the decision, for sure, Manchester City won't leave that midfield gap open for a long time.",
  "word_count": 943,
  "scraped_at": "2026-02-14T02:01:51.728607",
  "_text_extracted": true
}