{
  "article_id": "938eef94ad96",
  "url": "https://www.teamtalk.com/liverpool/liverpool-stunned-as-world-record-offered-prepared-to-take-virgil-van-dijk-away-from-anfield",
  "title": "Liverpool transfers : World record offered prepared to take Virgil van Dijk away from Anfield",
  "date": "20240614T090000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool stunned as world record offer prepared to take Virgil van Dijk away from Anfield\nA contract offer to take Virgil van Dijk away from Liverpool and become the world’s highest paid defender has been put on the table after news of a secret transfer meeting emerged, claims a report.\nDespite turning 33 next month, Van Dijk remains arguably the greatest centre-back playing the game right now. The dominant Dutchman has more than justified his lofty £75m transfer fee and without him, it’s debateable whether Liverpool would have won the Champions League in 2019 and Premier League in 2020.\nVan Dijk’s existing contract with Liverpool expires at the end of next season. Fellow superstars Trent Alexander-Arnold and Mohamed Salah will also see their deals conclude one year from now.\nToday’s update regards Van Dijk who according to Marca, has been offered the chance to become the best paid defender in world football.\nThey state Saudi Arabian side Al-Nassr are determined to sign the Dutchman who could form a high-powered centre-back pairing with Aymeric Laporte.\nAl-Nassr are the club who also boast Sadio Mane and Cristiano Ronaldo among their ranks. Nonetheless, they were blown away by Al-Hilal in the Saudi Pro League last season.\nTo bridge the gap and overhaul their rivals, Al-Nassr are casting their eye back to Europe.\nA move for Juventus goalkeeper Wojciech Szczesny is in the works and the latest on that deal – which only arose after Alisson Becker rejected the club – can be found here.\nBut of far greater relevance to Liverpool fans is Al-Nassr’s attempts to lure Van Dijk to the middle east.\nMarca state Al-Nassr have prepared a ‘market bomb’ having already met with Van Dijk’s representatives.\nThey state that it was during that meeting on Tuesday night that Van Dijk was offered ‘a contract that would make the Dutchman the highest-paid defender in the world.’\nREAD MORE: Liverpool transfers: Eight Euro 2024 stars enticing Arne Slot in transformative summer window\nWill Van Dijk stay or go?\nDespite Van Dijk’s contract ticking down, Liverpool have shown no willingness to part ways with their No 1 centre-half.\nWhat’s more, Liverpool are understood to be determined to retain both Van Dijk and Salah beyond their current deals despite their advancing ages.\nThe Reds have waved goodbye to plenty of experience over the past few seasons. Joel Matip and Thiago Alcantara are primed to join the likes of James Milner, Jordan Henderson, Fabinho, Sadio Mane and Roberto Firmino in leaving the club.\nAs such, the importance of holding on to their handful of remaining 30-plus veterans has increased.\nFurthermore, Van Dijk previously hinted he will have a big part to play for new manager Arne Slot.\nReferring to a conversation with Slot following his appointment, Van Dijk said: “I didn’t feel like this was a farewell conversation and I think he also sees me in Liverpool 2.0.\n“I got the feeling that he’s happy that I’m still there and will be there next season, so that I can help him where necessary. This allows us to achieve success on the field.”\nDON’T MISS: Liverpool make approach for dazzling Brazilian midfielder as Fabrizio Romano reveals top two Slot targets",
  "word_count": 538,
  "scraped_at": "2026-02-14T01:57:18.899332",
  "_text_extracted": true
}