{
  "article_id": "93939c74b9c7",
  "url": "https://www.teamtalk.com/arsenal/jamie-gittens-70m-price-tag-arsenal-transfer-race-borussia-dortmund",
  "title": "Arsenal transfers : Gunners in race for £70m left - winger who willing to move",
  "date": "20250224T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal explode into race for £70m left-winger and immediately learn he’s willing to move\nArsenal are keen on a deal for Jamie Gittens, with a report revealing how much the Gunners have to pay for the winger as competition for the Borussia Dortmund winger intensifies.\nGittens has been on the books of Dortmund since 2020 when he joined after leaving Manchester City and has established himself as one of the best young wingers in Europe. The England Under-21 international has been deployed as a left-winger this season and has done admirably well for the German club, scoring 11 goals and providing four assists in 35 matches in all competitions.\nArsenal are in desperate need of a new striker in the summer transfer window and are keen on Dusan Vlahovic and Alexander Isak among others, but it has now emerged that the Gunners have taken a shine to Gittens.\nAccording to TBR, Arsenal have been closely following Gittens over recent months and have been impressed with the English winger.\nArsenal manager Mikel Arteta is keen on signing a striker as well as a wide forward, and the north London club could now be about to firmly enter the race for England Under-21 international.\nThe report has claimed that Arsenal “could yet emerge as the strongest suitor”, and encouragingly for the north London club, the former Man City prospect himself is open to a return to England.\nHowever, Arsenal will face stiff competition if they become really serious about signing Gittens from Dortmund in the summer transfer window.\nIt has been reported that Tottenham, Chelsea, Manchester City and Aston Villa have all been following the winger and have been impressed with how he has done.\nREAD MORE ➡️ Free agents: The three best unattached players available in each position\nBorussia Dortmund stance on Jamie Gittens exit\nDortmund have a proud recent history of developing young English talent and then selling them at a hefty price.\nJadon Sancho emerged as one of the best young players in Europe and starred for Dortmund before he returned to England.\nJude Bellingham made his name at the German club and is now winning LaLiga and the Champions League with Real Madrid.\nGittens could be the latest English player in that trajectory, although, just like with Bellingham and Sancho, Dortmund are asking for a lot of money for him.\nAccording to TBR, the German club have told Gittens that he can leave this summer but for £70million.\nAlthough the player himself is not going to push for an exit, he accepts that he will have to leave because Dortmund need funds.\nLatest Arsenal news: Nypan blow, Vlahovic bargain fee\nArsenal wanted to sign Sverre Nypan in the January transfer window and remain keen on securing his services this summer, but the north London club are facing competition from Man City.\nIt has emerged that the defending Premier League champions have promised the Rosenborg midfielder first-team football in order to persuade him to snub a move to the Emirates Stadium and join Pep Guardiola’s side at the Etihad Stadium.\nTEAMtalk understands that Arsenal planned to make a late bid for Dusan Vlahovic in the January transfer window after their offer for Ollie Watkins was rejected by Aston Villa.\nAn Italian report has claimed that Vlahovic is still on the Gunners’ radar, with Manchester United and Atletico Madrid also interested in the striker.\nEncouragingly for Arsenal, Juventus are willing to sell Vlahovic this summer and that too for a bargain transfer fee of €35million (£29m / $36.6m).\nMeanwhile, it seems that Jorginho’s days at Arsenal are numbered.\nA report in the Brazilian media has stated that the midfielder has verbally agreed to join Flamengo in the summer transfer window.",
  "word_count": 625,
  "scraped_at": "2026-02-14T01:58:05.339125",
  "_text_extracted": true
}