{
  "article_id": "93b912190da0",
  "url": "https://www.caughtoffside.com/2024/04/28/sesko-transfer-chelsea-target-likely-to-leave/",
  "title": "Sesko transfer : Chelsea target likely to leave Leipzig",
  "date": "20240428T100000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "RB Leipzig striker Benjamin Sesko has been linked with Chelsea and other clubs in recent times, and Fabrizio Romano admits that interest in him remains very strong as a transfer away looks likely for this summer.\nThe exciting young Slovenia international looks like a player with a big future in the game, and it will be interesting to see where he ends up, with Chelsea surely just one of a number of top clubs who will be monitoring his situation.\nBild, as cited and translated by Sport Witness, recently claimed that Chelsea have asked about Sesko, and Fabrizio Romano has spoken exclusively to CaughtOffside for his Daily Briefing column to provide his latest information on the young forward’s future.\nSesko transfer: Chelsea target likely to be on the move this summer\nRomano made it clear just how much he expects Sesko to leave Leipzig this summer, saying that interest in him is very strong.\n“Benjamin Sesko – It was another superb performance from RB Leipzig’s strikers yesterday, with Benjamin Sesko one to watch for this summer, 100%,” Romano said.\n“At this point Sesko is more likely than Lois Openda to leave Leipzig, also because interest in Sesko is already very strong; let’s see if will become concrete in terms of proposals. But for sure both are doing great.”\nChelsea urgently need a striker this summer after some unconvincing form from young striker Nicolas Jackson this season, while it’s hard to imagine loaned-out duo Romelu Lukaku and Armando Broja have much of a future at Stamford Bridge.\nSesko looks like he’d be an important upgrade on Chelsea’s current attacking options, and fans of the west London giants will be glad to hear just how much Romano expects the 20-year-old to be on the move this summer, though it will be interesting to see if other big names join the race for his signature, who might be able to offer him Champions League football.",
  "word_count": 322,
  "scraped_at": "2026-02-14T01:56:51.541964",
  "_text_extracted": true
}