{
  "article_id": "93e851905953",
  "url": "https://www.90min.com/posts/the-proof-erik-ten-hag-proven-right-everything-at-man-utd",
  "title": "The proof that Erik ten Hag has been proven right about everything at Man Utd",
  "date": "20230225T153000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The proof that Erik ten Hag has been proven right about everything at Man Utd\nBy Sean Walsh\nErik ten Hag has the chance to win Manchester United their first trophy since 2017 when his side take on Newcastle in Sunday's Carabao Cup final.\nThe Dutchman has won over the Old Trafford faithful in his first season at the helm, instilling some much-needed discipline to go hand-in-hand with a stylish brand of football.\nBut the road to this point has not been a smooth one for Ten Hag. The Red Devils were beaten 2-1 at home by Brighton on the opening weekend of the season, before they were torn apart by Brentford a week later, conceding four first-half goals against the Bees.\nAfter that 4-0 drubbing, United propped up the Premier League table and there were already major question marks over his suitability to manage the club.\nTen Hag had to do some rather major firefighting in his post-match press conference, and in hindsight, his calm and collected answers have aged tremendously well.\nHere's what he said that day and how he's been proven right...\nOn this week's edition of TFP, Chelsea legend Joe Cole joins Harry Symeou, Grizz Khan, Scott Saunders and Hunter Godson to discuss all the UEFA Champions League action from midweek, as well as look ahead to this weekend's biggest fixtures. If you can't see this embed, clickhereto watch the video!\nMan Utd's woeful performance at Brentford & their new philosophy\nTen Hag's men were punished for trying to play from the back at all costs instead of opting to go long when necessary.\n\"I think we all have seen the game. I think Brentford were more hungry for one, and two, we conceded goals from individual mistakes. You can have a good plan, but then you put the plan in the bin.\n\"I think it was nothing to do with tactical [aspects]. The first two goals is about dealing the ball, that's one, and decisions.\n\"I think they follow my instructions, but yeah, they make bad decisions. This is football, it's a game of mistakes. We got punished.\n\"This is a conclusion [that United can't play Ten Hag's way]. I will not admit that. I think they can, they showed already in pre-season, this has nothing to do with that. This is about when you make mistakes we make tonight, every plan or strategy you can put in the bin.\n\"I don't want to play from the back when it's not possible. It's naive how we played today. It was more about playing direct. We attracted them, there was space high on the pitch, but you have to play that option. You have to choose that option, that's what we didn't do. But we will learn, we have to learn. But it's no good at this level, definitely not the standard that we want.\"\nSince this performance, United have rarely been caught out with such lapses in concentration. They quickly figured out when to go short and when to go long, beginning with a 2-1 win over rivals Liverpool the following week.\nCriticism of David de Gea's ball-playing\nDavid de Gea spilled Josh Dasilva's trickling shot into the net to give Brentford an early lead that afternoon. He was then punished for his inability to play from the back later in the day.\n\"I have the confidence that he can do it [play from the back]. Obviously the second goal, OK [he made an error], but I've seen already in training and the first games he can do that.\"\nDe Gea has by no means been flawless with his distribution this season, but he has at least looked more comfortable and competent in possession.\nQuestions over Lisandro Martinez's physicality\nLisandro Martinez was manhandled by Ben Mee for Brentford's third goal and he was hooked at half-time, leading to further questions over whether a 5'9 centre-back could be successful in England.\n\"I subbed three [at half-time] but I could have changed them all. We wanted to bring fresh energy int the game and not specific to the one we subbed because I don't think that's honest to them.\n\"They are my players and we are together. We are in a really difficult situation and we are clear, we have to stick together. We have to find the sources and we have to find solutions.\"\nAs it turns out, yes, Ten Hag could have changed them all and Martinez - one of the Premier League's best defenders this season - was not solely to blame.\nChristian Eriksen's role and alluding to Casemiro's arrival\nOn his return to Brentford, Christian Eriksen gifted a goal to countryman Mathias Jensen, looking out of his depth as a number six partnered with Fred.\nIt was put to Ten Hag that this was a role Eriksen had not played in England during spells with Tottenham and Brentford.\n\"Yes, but he didn't have to receive the ball there. We gave options, the players have to choose, but yeah, we said play long, invite them and play long.\"\nThis was largely a case of an individual error rather than a tactical one, but it was clear United needed a different option to link the defence and midfield. The boss was asked if this defeat would have put transfer targets off joining United.\n\"I don't think about that. I think about getting the best out of this team, these players, and we need to strengthen the squad but at this moment it's not my concern.\"\nCasemiro, who was not publicly linked to United until a few days later, would sign on later in the window and go on to become 'the cement between the stones' according to Ten Hag.\nIt's also been reported that Casemiro watched this match and informed United that he would be the player to help fix their issues.\nMan Utd's mentality\nTen Hag was told that fans were critical of the players' attitude, that they seemed like they didn't care.\n\"When the results are like this, I can imagine that feeling. It's no good that we showed that, clearly. We are to change that, we need more hunger on the pitch as individuals and as a team.\n\"We have to do it [turn things around]. It's clear [we need to] analyse and it's not possible that the opponent is more hungry than you are. In the second half I saw a comeback, but you have to start well. That's no good.\n\"That's our job [to improve self belief], we have to work on that and encourage them. They also have to get it by themselves because they know they are good players but they have to be a team and take responsibility.\"\nBrentford players ran eight miles more than their United counterparts during that game. The following day, Ten Hag joined his United players in making up that eight miles on the Carrington training pitches.\nThey have since gained a reputation as one of the Premier League's best and smartest pressers, a team trusting in their manager and his philosophy.",
  "word_count": 1179,
  "scraped_at": "2026-02-14T01:46:30.519760",
  "_text_extracted": true
}