{
  "article_id": "93f37ef808b4",
  "url": "https://www.fourfourtwo.com/news/pfa-says-players-ready-to-take-legal-action-over-congested-fixture-lists",
  "title": "PFA says players  ready to take legal action  over congested fixture lists",
  "date": "20231230T204500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PFA says players 'ready to take legal action' over congested fixture lists\nWith new FIFA Club World Cup recently announced, the Professional Footballers Association says players are ready to take a stand\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nFootballers are ready to \"take a strong stance\" – including legal action – over the demands of congested fixture lists, according to the players union.\nThe Professional Footballers’ Association’s comments come after FIFA’s announcement of the Club World Cup for summer 2025 and the expansion of the Champions League group stage by two games per team.\nAnalysis suggests male footballers could be expected to play 86 matches from next season, an unprecedented level of demand. FIFA are yet to grant a global union demand that players are guaranteed a 28-day break during the off-season, a request made near-impossible by the Club World Cup.\nPFA chief executive Maheta Molango told Sky News: \"I feel like we've reached a stage where people are ready to take legal action, where people are ready to take tangible action on the pitch to try to resolve it, because it's a sad state of affairs.\n\"I think it's a defeat for football when the players need to take the justice in their own hands because they don't feel protected.\n\"I think that the players are ready now to take a strong stance. I do think that the authorities who are supposed to protect the players and protect the games are not doing that. They are generating more competitions, generating more income to the detriment of the players.\"\nThe PFA is in the early stages of establishing the obligation for players to be available for certain competitions and how these are enforced under the current system.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nEarlier this year managers such as Vincent Kompany, Jürgen Klopp, Erik ten Hag and Pep Guardiola raised their concerns about fixture congestion, with the latter saying: \"We treat the players in not a good way. We are so irresponsible in how we treat the players.\"\nPremier League chief executive Richard Masters has also complained to FIFA about the Club World Cup, but FIFA maintain that the competition is about growing the game globally, and point to the competition allowing at least three days' rest between games as a step to protect player welfare.\nRead more\nFIFA confirm details of new Club World Cup, but tournament is set to create scheduling headaches for Chelsea & Manchester City and 80-game seasons for some players\nPremier League festive schedule to feature first Christmas Eve match in 28 years\nIs Christmas schedule unfair on Chelsea? What Mauricio Pochettino said about Blues' three games in six days",
  "word_count": 557,
  "scraped_at": "2026-02-14T02:10:33.588677",
  "_text_extracted": true
}