{
  "article_id": "9405beb3f462",
  "url": "https://metro.co.uk/2025/05/02/real-madrid-want-use-manchester-united-bridge-transfer-sign-51m-defender-23015789/",
  "title": "Real Madrid want to use Man Utd as  bridge transfer  to sign £51m defender",
  "date": "20250502T143000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid are looking to use Manchester United in their attempt to sign Benfica left-back Alvaro Carreras, according to reports in Spain.\nCarreras was signed by United on a free transfer from Madrid in 2020 and showed plenty of promise in his first two years at Old Trafford as he was named United’s Under-23 Player of the Year in 2022.\nHowever, Carreras was unable to make his first-team breakthrough and ended up being sent out on loan to Preston North End, Granada and then Benfica in the January transfer window last year.\nBenfica ended up signing Carreras on a permanent deal for €6 million (£5.1m) last summer and according to AS, Madrid are now looking to sign him following an impressive season in Portugal.\nThe report claims that Benfica now demanding that Madrid meet Carreras’ €50m (£42m) release clause and the Spanish club are looking for a cheaper deal.\nOne solution that Madrid are said to have considered is asking United to activate the €18m (£15.3m) buyout clause they negotiated with Benfica last year to sign Carreras, who will then be sold to the Champions League holders.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe report claims that Madrid believe they could then reach an agreement with United for the 22-year-old worth between €30m and €35m (£25m – £29.8m).\nUnited were heavily linked with re-signing Carreras in the January transfer window but Ruben Amorim’s side ended up securing a deal worth £25.2m plus £4.2m in add-ons for Patrick Dorgu.\nMore Trending\nWhen asked about a potential return to Madrid earlier this year, Carreras said: ‘In truth, we never know, but I have a long-term contract here at Benfica, I’m happy.\n‘They gave me the opportunity to grow and I owe them everything.’\nMadrid are in the market for a new left-back due to Ferland Mendy’s injury problems.\nThe 29-year-old was ruled out for the rest of the season earlier this week due to a thigh injury.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Jamie Carragher names dark horses who could rival Liverpool for the Premier League title next season\nMORE: David de Gea shocked by Man Utd flop after wonder goal against Fiorentina\nMORE: UEFA make decision on switching Europa League final venue if Man Utd and Tottenham qualify",
  "word_count": 441,
  "scraped_at": "2026-02-14T01:58:31.682668",
  "_text_extracted": true
}