{
  "article_id": "940b4f573b79",
  "url": "https://toffeeweb.com/season/24-25/comment/general/46596.html",
  "title": "Carabao Cup – Round 2",
  "date": "20250828T080000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Season › 2024-25 › General Forum\nReader Comments (101)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 26/08/2025 at 21:33:44\n2 Posted 26/08/2025 at 22:01:03\n3 Posted 26/08/2025 at 22:03:00\n4 Posted 26/08/2025 at 22:03:01\nDominic Calvert-Lewin's penalty!\nFucking hilarious.\n5 Posted 26/08/2025 at 22:03:04\n6 Posted 26/08/2025 at 22:04:07\n7 Posted 26/08/2025 at 22:05:47\n8 Posted 26/08/2025 at 22:06:18\n9 Posted 26/08/2025 at 22:07:04\nHis penalty is still rising, heading over the Pennines towards BMD!\n10 Posted 26/08/2025 at 22:08:06\nCeltic humbled in Kazakstan and out of Champs Lge.\n11 Posted 26/08/2025 at 22:08:13\n12 Posted 26/08/2025 at 22:08:53\nPriceless.\n13 Posted 26/08/2025 at 22:09:34\n14 Posted 26/08/2025 at 22:10:11\nLet's see how long Leeds put up with him for.\n15 Posted 26/08/2025 at 22:10:11\n16 Posted 26/08/2025 at 22:10:49\nHe just got more and more stale and injury prone. Got no particular animosity towards him, he was just very average.\n17 Posted 26/08/2025 at 22:11:27\nAs for Dom, well, he had 3 good chances in normal time...\n18 Posted 26/08/2025 at 22:12:02\nI guess the people taking joy in his performance this evening are the same types that abused him when an Everton player.\n19 Posted 26/08/2025 at 22:13:47\nHow the fuck did Leeds beat us last week?\n20 Posted 26/08/2025 at 22:15:49\nIt was a good time to part ways for both parties and I wish him well but not against us.\n21 Posted 26/08/2025 at 22:25:35\n22 Posted 26/08/2025 at 22:32:19\nEspecially at that.\nAnd what a brave effort by Wednesday's players as their club collapses around them. 9 starters under age 21 because they have nobody else left on salary, and they beat a Premier League club nobody predicted them to beat.\n23 Posted 26/08/2025 at 22:32:55\n24 Posted 26/08/2025 at 22:34:20\nHe shops in Zara (I can't imagine his partner being happy with this!)\nHe wears mascara, his frocks fucking massive.\nNot the best welcoming song I've ever heard, but it was quite funny watching grown men singing it.\n25 Posted 26/08/2025 at 22:34:39\nHe's done alright out of Everton.\n26 Posted 26/08/2025 at 22:38:45\nMike, agreed.\nTony, I saw that too.\n27 Posted 26/08/2025 at 22:40:39\nI work in Leeds and already had 5 messages since 10 pm about how 'fucking useless' DCL is.\n28 Posted 26/08/2025 at 22:42:23\n29 Posted 26/08/2025 at 22:50:14\nPetty pathetic, gloating.\n30 Posted 26/08/2025 at 22:54:22\nSome cope with pressure and others don't.\n31 Posted 26/08/2025 at 22:56:52\nJosh King, anyone?\n32 Posted 26/08/2025 at 23:00:36\n33 Posted 26/08/2025 at 23:01:55\nHe's barely played in months, so no surprise if he showed some rust. Think he'll do well for Leeds if fit. Definitely an upgrade on Piroe.\n34 Posted 26/08/2025 at 23:05:50\n35 Posted 26/08/2025 at 23:10:09\n36 Posted 26/08/2025 at 23:14:54\nCow's arse with a cello...\n37 Posted 26/08/2025 at 23:28:00\nLeeds must feel we really pulled their pants down with that free transfer.\nThe feeling of Everton not paying that guy £100k a week for the first time in five years is indescribable.\n38 Posted 26/08/2025 at 23:29:27\nEnds up at Leeds for the money, plays against a team of youngsters with hardly any home fans in, due to protest.\nMisses 2 sitters and skies his penalty. I'm with Mike, I was laughing my nuts off – we can do a lot better than Calvert-Lewin if we want to bring quality players in. And move forward.\n39 Posted 26/08/2025 at 23:43:58\n\"He went there for the money\". For fuck's sake, it's literally his job.\n40 Posted 27/08/2025 at 00:43:01\nA very big shout out for Barry Bannon who is an absolute legend (and still at pushing 40, a very handy player in this league).\nAs for DCL, he has made the mistake of over-estimating himself or allowing his agent (now sacked) to do so. Had he accepted quickly what The Barcodes were offering in January, he might be on the cusp of Champions League football given the Isak situation.\nInstead, he's going to spend a season or two scuffing around at Leeds as second or third striker, and likely getting abuse from their fans for the limited, injury-prone player he is.\n41 Posted 27/08/2025 at 01:03:46\nSome of us Yanks have a soft spot for the club because of John Harkes and his Goal of the Season against Shilton.\n42 Posted 27/08/2025 at 01:23:28\nHe had some fight in him.\n43 Posted 27/08/2025 at 01:37:33\nJust the one-handed two-finger clap these days?\n44 Posted 27/08/2025 at 01:59:20\nIdentikit stadium to Everton, blue and white, historic power, plus a Wednesday fan named Sandra I had a dalliance with in the south of France when I was a teen.\n45 Posted 27/08/2025 at 05:16:58\nHe gave us 9 years of his career, and wanted an ambitious move after 4 years of battling relegation. Hardly a hanging offence.\nWhatever his limitations, he always worked his arse off for the club and he played while injured. Which is more than can be said the likes of Schneiderlin, Williams, Maupay or the Nameless One.\n46 Posted 27/08/2025 at 05:53:14\nDCL gave us good service, as did Tom Davies, Jack Harrison, Ashley Young… blimey the list is enormous!\nWithout doubt some deserved the ridicule but not all... depends on your perspective and memory, I guess!\n47 Posted 27/08/2025 at 06:33:45\nHe was played out of position. Injured and, most of the time isolated, surrounded by two giant defenders. He was a model teammate who was well liked by players and staff alike.\nI simply don't understand the antagonism shown towards this lad. It got to the point where he came off the field obviously injured and still got booed and jeered at by some so-called fans.\nWas his fashion sense so despicable and hateful to deserve this kind of treatment?\n48 Posted 27/08/2025 at 07:24:02\n49 Posted 27/08/2025 at 07:33:05\nI remember many years ago when Everton played a struggling Southport away in the FA Cup. Everyone wanted a draw and replay but Joe Royle scored a late winner. The lad got very few congratulations from the team and the management were said to be furious with him after the game.\n50 Posted 27/08/2025 at 07:36:03\nI've never known a player cost so little, who scored so many goals for us and played a massive part in helping us avoid League One football, receive so much abuse.\nHe didn't want to be injured, he certainly didn't want to be isolated playing Dyche-ball, and you can't possibly blame him for getting the best possible salary.\nFor £1.5M, he was a great buy for us, seems like a nice lad, and played through injury more than once. He deserves at least some respect.\n(By the way, I said League One football because, if we'd gone down in 2022, then I have no doubt we would have gone the same way as Leeds and Sunderland.)\n51 Posted 27/08/2025 at 07:48:07\nIf Beto or Barry (I'll give him time) could hold the ball up as good as Dominic, they would be much better players.\nGood luck and good health, Dominic, with the rest of your career.\n52 Posted 27/08/2025 at 08:05:10\nYes, he should have scored more goals, but I do believe that, with the players that we have brought in this window – Grealish, Dibling, etc – he might have hugely contributed to goals as well as keeping the opposing centre-backs occupied for others to exploit.\nI wish him all the very best for his future. Yesterday was hopefully a temporary blip in his career with Leeds. Just don't score against us at Hill Dickinson Stadium!\n53 Posted 27/08/2025 at 08:30:54\nThis cup is a big opportunity for us. Let's beat Mansfield and take the competition very seriously.\n54 Posted 27/08/2025 at 08:31:38\nCould be superb with his heading, but unfortunately his shooting, particularly on 1:1s, let his game down.\nThe Carlo season, he was in and around the 6-yard box only.\n55 Posted 27/08/2025 at 08:48:07\nHis relentless and often unrewarded work rate and skillfull hold-up play was a credit to him and his desire to help the team during difficult times.\nYes, that's what he got paid for, but his was the first name I looked for on the team sheet every game. I for one wish him well in his time at Leeds and wherever he plays. I don't have heroes then dump them, I just gratefully remember them for being my heroes in their time in Blue.\n56 Posted 27/08/2025 at 08:55:43\nHe didn't keep us up with his goal against Palace — every player who stepped on the pitch also played their part.\nHe is supposed to work hard, you don't get extra kudos for working hard — it should be a given.\nHe scored against Liverpool, so what, he also missed plenty.\nI'm never one to really slag players off but boy am I glad that waste of space is no longer wearing an Everton shirt.\n57 Posted 27/08/2025 at 09:01:48\nSome courage to openly say that on here. I am with you.\n58 Posted 27/08/2025 at 09:07:02\nAnd you could duplicate all of the above for Duncan Ferguson too.\n59 Posted 27/08/2025 at 09:17:24\nMaybe a two-for-one deal: Moyes and DCL. Clearly a big market for them on here.\n60 Posted 27/08/2025 at 09:27:19\nEven DCL wouldnt wear that 🫣\n61 Posted 27/08/2025 at 09:30:00\nThey were also, almost exclusively, delivered by pissed up coke heads in the minority. A small selection of our away support is absolutely horrible.\n62 Posted 27/08/2025 at 09:30:36\nThere are some exceptions to this rule for me – Maupay, for example -– but that is due to the disrespect that they show the club. DCL does not deserve to be vilified.\nWould I have him back? No, but he should be given due respect, or at the very least, ignored, as he is no longer wearing Blue!\n63 Posted 27/08/2025 at 09:57:26\nDCL is our 3rd highest goalscorer in the 30+ seasons of the Calvert-Lewin and could possibly have scored many more if given the right service.\nDo you remember him staying on the pitch after the Palace game and after he gave his shirt to a fan and celebrated with our fans?\nHe may have missed plenty of chances but he wouldn't be alone in that category would he.\n64 Posted 27/08/2025 at 10:01:39\nLet's be honest, we have a large number of crap supporters, who have driven out good managers and some players from our great club.\nBut I suppose most clubs have them, attitudes have changed over the years and not always for the better.\n65 Posted 27/08/2025 at 10:09:32\nSlagging off is kids behavior, why delight in others misfortune?\nUnless they are a bastard, I don't really get it.\n66 Posted 27/08/2025 at 10:15:12\nMost people will be prepared to give up their privacy for efficiency, said that clever little deceitful war criminal, Tony Blair, but to get real efficiency, there will definitely be a lot of headaches along the way!\nNowhere near as many as there will be once the experiment has been done effectively.\n67 Posted 27/08/2025 at 11:42:01\nMy bad: I should have known Calvert-Lewin deliberately missed his penalty and that he should be warmly congratulated for this wonderous act of selfless altruism in the interests of massive local rival club Sheffield Wednesday, who will — thanks to this marvellous personage, now proceed to the next highly lucrative stage of this huge competition.\nNah, sorry… and it's still funny as fuck — like all his other hopeless misses last night — but I didn't want to trigger you hypersensitive DCL lovers by mentioning them.\n68 Posted 27/08/2025 at 12:16:33\nI'm with those who thank him for his tireless service and wish him the best for the rest of his career. His only disservice to our club was his ability to miss one-on-ones but hey, he was not alone and was probably down to sheer surprise he ever got such opportunities given he served during that horrendous Dyche period.\n69 Posted 27/08/2025 at 12:27:35\nI tell you what was fucking funny, though - your pathetic reaction when you first heard that Moyes was back. That was priceless!\n70 Posted 27/08/2025 at 12:54:43\nHad to laugh at that.\n71 Posted 27/08/2025 at 13:03:57\n72 Posted 27/08/2025 at 13:07:31\nBut what is it you feel for him that it makes you laugh hysterically when he misses a penalty? Is it hate?\nI genuinely don't get what makes it funny.\n73 Posted 27/08/2025 at 13:08:42\n74 Posted 27/08/2025 at 13:35:38\nThat didn't last long, did it?\n75 Posted 27/08/2025 at 13:40:38\n76 Posted 27/08/2025 at 13:42:28\nPS……it's James Trafford by the way! 😂😂😂😂\n77 Posted 27/08/2025 at 13:45:33\n78 Posted 27/08/2025 at 14:14:18\nIn fact, it is often the people making excuses for him that deflect any criticism of his footballing ability, on a football supporters forum, by insisting that criticism could only possibly be based on personal dislike.\nIt's the same with Moyes, who's name has predictably appeared above.\nRather than being funny, usual service being resumed in Leeds was inevitable. The self-righteous advocacy on his behalf, with formulaic prevarication, is quite amusing though.\n79 Posted 27/08/2025 at 14:33:47\nI also found it funny as fuck and will enjoy every weekend where he doesn't score. He's a knobhead and is stealing a living. The kid can't hit the side of a dinosaur.\n80 Posted 27/08/2025 at 14:33:56\nI must admit to having a wry smile when he missed his first sitter. But I felt a bit sorry for him after the penalty. I certainly hold no grudge. That bang average striker was the best of a mediocre bunch over a long period.\nI wish him well, hard though that is given he plays for Leeds.\n81 Posted 27/08/2025 at 14:43:23\nIf he actually did find himself in hysterics, it would probably be more to do with this than the actual penalty miss?\n82 Posted 27/08/2025 at 14:49:07\n83 Posted 27/08/2025 at 14:56:35\nThat transfer just highlights how out of control spending is in the league.\nWhilst the rest of the league have to be creative at best just to stay afloat the top teams are allowed to run riot.\nHow can the powers that be turn a blind eye, it's ruining the sport.\nIn the meantime our lovable neighbours poach a 15 year old from 200 miles away. How is that morally right? It's not just them all prem clubs are probably at it.\nAnyhow rant over.\nDcl has had bad representation and could have seen out his career with us but chose not to. Left on a free knowing the club is on its arse similar to Doucoure, Silva, mina, Bernard and Moyes but Keane signs a new 1 year deal and it's bad business for the team we are a strange bunch us football fans.\n84 Posted 27/08/2025 at 14:59:47\nThe club supported him through injury after injury and one barren run after another, he wouldn't sign a contract that probably fairly reflected that and, as I understand it, he refused to move to another club to Everton's detriment.\n\"He doesn't owe us anything\" is true but it cuts both ways.\nI don't like how he left the club and I do understand why some Everton fans might take some delight in seeing him fail, and being proved right that he isn't very good without it any longer being at Everton's cost. I wouldn't call them haters, childish, or crap supporters.\n85 Posted 27/08/2025 at 15:23:31\nBut I would have loved DLC to have scored a couple last night.\n86 Posted 27/08/2025 at 15:25:40\nIf you're half-watching something, and suddenly, something happens that strikes you as really funny, you laugh your arse off at it.\nBut someone else could watch the same thing and not be amused at all by it. It's part of being human. We have different reactions to the same stimulus.\nAnd then there's a third category, that takes it all very seriously, and espouses some nonsensical judgmental rubbish about agendas and biases and god knows what else they feel triggered by.\nThat also is unfortunately an aspect of modern humanity that we have to live more and more with. But thankfully, we don't actually have to do what they say, or think how they want us to think.\n87 Posted 27/08/2025 at 15:28:46\n88 Posted 27/08/2025 at 15:39:06\n89 Posted 27/08/2025 at 15:47:58\n90 Posted 27/08/2025 at 15:54:39\n91 Posted 27/08/2025 at 15:57:02\n92 Posted 27/08/2025 at 16:01:31\n93 Posted 27/08/2025 at 16:05:22\nHe played for us when we are mostly shite which wasn't his fault. But no matter which way you spin it, he's a bang average finisher and a dreadful footballer in many respects.\nI wish the bloke well but we won't miss him.\n94 Posted 27/08/2025 at 16:19:33\nSpanish outlet SPORT report that there is interest from the Premier League, as Everton and West Ham are willing to formalize a loan for the full-back, who has looked very impressive, which is no surprise coming from Barca’s academy.\nHéctor Fort will officially leave Barcelona after the match against Mallorca. The player has received several offers and has agreed with the club to make a final decision on his next destination no later than next week.\n95 Posted 27/08/2025 at 16:22:29\n96 Posted 27/08/2025 at 16:29:39\nWe’ve upgraded the whole forward line and moved on. And rightly so.\n97 Posted 27/08/2025 at 16:34:43\nColeman\nKeane\nO'brien\nAznou/McNeil\nArmstrong\nGarner\nAlcaraz\nNdiaye\nDibling\nBarry\n98 Posted 27/08/2025 at 16:40:41\n99 Posted 27/08/2025 at 16:45:06\n100 Posted 27/08/2025 at 22:20:10\n101 Posted 28/08/2025 at 20:54:36\n\"Where's the best place to go this time of year?\" asked the Manc.\n\"You can't beat Grimsby\" the travel agent replied.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 3059,
  "scraped_at": "2026-02-14T01:49:44.663651",
  "_text_extracted": true
}