{
  "article_id": "94111a618a7e",
  "url": "https://www.teamtalk.com/manchester-united/three-premier-league-sides-want-michael-carrick-if-man-utd-appoint-different-permanent-manager",
  "title": "Man Utd : Three Prem sides want Michael Carrick if United appoint different permanent manager",
  "date": "20260207T201500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nThree Prem sides want Michael Carrick if Man Utd appoint different permanent manager\nManchester United now face a new wrinkle in the conundrum over whether to appoint Michael Carrick as their permanent manager after a report named the three Premier League sides who’ll gladly hire the 44-year-old in the summer.\nCarrick agreed to become Man Utd’s interim manager for the remainder of the season, though unlike Ole Gunnar Solskjaer, he did NOT request any sort of guarantees he be hired outright.\nSky Sports previously revealed Solskjaer shot himself in the foot when insisting a clause be inserted that stipulated he get the job on a permanent basis if he guided Man Utd into next year’s Champions League.\nCarrick was much more tactful in his negotiations with the club, and since getting the nod, has incredibly won four from four so far, including victories over Arsenal and Manchester City.\nThe pressure to give Carrick the role is already intensifying, and will ramp up with each successive win. If and when the winning streak stops, the pressure will still be immense if Man Utd do qualify for the UCL. As it was last year, fifth spot is on course to be good enough for a place.\nAnd according to Football Insider’s Pete O’Rourke, Carrick’s winning streak is giving Man Utd a problem they probably wouldn’t have anticipated.\n“He’s obviously building a strong case to maybe have that interim spell turned into a permanent manager’s job come the summer with Manchester United. I don’t think United are rushing into anything just yet,” said O’Rourke.\n“But look, if there’s a Premier League club looking for a new manager there, and if Michael Carrack is available, he’s showing he knows how to get wins in the Premier League.\n“If he gets Man United back in the Champions League, he’s going to be a hot commodity for a lot of clubs.\n“He’s proved that he can do it in the Premier League as well and obviously managing a club like Manchester United shows that he can handle the pressure as well.\n“So I’m sure any Premier League club who’s looking for a new manager, if Michael Carrick is available, he’ll be on the list.”\nThe journalist then went on to name three Premier League sides who’ll be ‘watching Carrick’s progress closely’ – Crystal Palace, Fulham and Bournemouth.\nPalace are certain to be in the market for a new manager in the summer, with Oliver Glasner’s contract up and the Austrian refusing to pen fresh terms.\nIronically, Fulham’s Marco Silva and Andoni Iraola of Bournemouth have been linked with taking the Man Utd job. Both have been mentioned alongside Tottenham too in the event Thomas Frank is given his notice.\nOf course, neither Fulham or Bournemouth would dispense with their current managers to hire Carrick. But if Silva or Iraola are poached by bigger clubs, that’s when Carrick will enter the equation.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nLatest Man Utd news – Turkish loan bid rejected / Winger heading to Liverpool / Liam Delap opportunity\nIn other news, Man Utd rejected a late loan bid for one of their critical squad players from Besiktas, with the Turkish side also failing with a similar move involving Liverpool.\nElsewhere, there are three huge clues a winger at the very top of Man Utd’s transfer shortlist is heading to Anfield instead.\nFinally Man Utd may soon have the chance to sign Liam Delap who they had a deal 90 percent completed for last summer, and who they prioritised before landing back-up option, Benjamin Sesko.",
  "word_count": 620,
  "scraped_at": "2026-02-14T01:59:36.841246",
  "_text_extracted": true
}