{
  "article_id": "943c510f2ff2",
  "url": "https://www.caughtoffside.com/2024/08/03/club-director-claims-22-year-old-liverpool-player-would-really-like-to-join-them/",
  "title": "Mainz director confirms desire to sign Sepp van den Berg from Liverpool",
  "date": "20240803T130000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool defender Sepp van den Berg has been linked with a move away from the club this summer.\nThe 22-year-old central defender does not have a future at the Premier League club and he needs to move on in search of regular playing time.\nHe was on loan at Mainz last season and their director has now revealed that they are considering a move to sign the Dutch defender this summer. However, he has admitted that Mainz could be priced out of a move for the player if Liverpool do not lower their demands.\nLiverpool are holding out for a fee in excess of £20 million for the young defender. It will be interesting to see if they are willing to sell him for a more reasonable price.\nHe said via Florian Plettenberg: “We would like him to stay and Sepp would also really like to do it. But we also respect that Liverpool have not decided about it yet. We will not buy a player for over £20m, which is what Liverpool want. Our club cannot do that.”\nVan den Berg will want to play regularly at this stage of of his career and move away from Liverpool would be ideal for all parties.\nSepp van den Berg needs to leave\nLiverpool are already well stocked in the defensive unit, and they will not be able to provide him with ample first team action next season. It makes sense for them to sell the player now for a reasonable price.\nA move to Mainz would be ideal for him. He looked well settled at the club last season, and he could establish himself as a key player for them in the coming season. If he manages to impress with them on a consistent basis, he will have plenty of opportunities to join a big club in the near future. The 22-year-old defender is undoubtedly a talented player with a bright future. He needs to focus on his development now and joining the German club permanently would be ideal.",
  "word_count": 339,
  "scraped_at": "2026-02-14T02:10:58.960249",
  "_text_extracted": true
}