{
  "article_id": "943f9f7e12d8",
  "url": "https://www.caughtoffside.com/2023/06/23/chelsea-working-to-seal-21-year-olds-signing-after-rivals-pull-out-of-race/",
  "title": "Chelsea emerge as frontrunners to complete Moises Caicedo transfer",
  "date": "20230623T083000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are keen on signing Brighton and Hove Albion midfielder Moises Caicedo during the summer transfer window.\nAccording to Fabrizio Romano, Chelsea are currently working on the deal and personal terms with the player are almost agreed. Apparently, the 21-year-old’s priority is to join Chelsea next season.\nMeanwhile, a report from Football Insider claims that Arsenal have now pulled out of the race and Chelsea have been given the green light to secure the move. The transfer is likely to be worth over £80 million. An official bid from the Blues is expected to be submitted soon.\nChelsea are now looking to get rid of their fringe players and make way for incoming. Furthermore, they have spent significant sums of money in recent windows and they are looking to balance the books and stay within the FFP parameters by selling some players.\nChelsea are currently the only club in talks with Brighton regarding a move for the 21-year-old.\nCaicedo has established himself as one of the best defensive midfielders in the league and he could be the ideal long-term replacement for club legend N’Golo Kante.\nThe French international has decided to leave the club and he has joined the Saudi Arabian club Al Ittihad.\nCaicedo has the attributes to develop into a world-class midfielder in the near future and working under a top-class coach like Mauricio Pochettino will only help him develop further.\nChelsea will have to improve their squad in order to get back into the Champions League after a disappointing campaign where they finished 12th in the table.\nWith Enzo Fernandez already at their disposal, signing Caicedo would sort out their midfield unit for the foreseeable future.",
  "word_count": 279,
  "scraped_at": "2026-02-14T01:56:02.428914",
  "_text_extracted": true
}