{
  "article_id": "9440bba76bf0",
  "url": "https://www.rri.ro/en/news-and-current-affairs/newsflash/july-11-2025-id907877.html",
  "title": "July 11, 2025 - Radio Romania International",
  "date": "20250711T131500Z",
  "domain": "rri.ro",
  "source_country": "Romania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "July 11, 2025\nA roundup of local and world news\nNewsroom, 11.07.2025, 13:55\nANNIVERSARY Between 7 and 13 July, the Romanian Embassy in Washington organises for the 4th consecutive year events marking the anniversary of the Strategic Partnership between Romania and the United States, launched on 11 July, 1997. Today, the American think-tank Heritage Foundation hosts a roundtable discussion on the future of the Romania-US Strategic Partnership. The event will address topics related to a solid partnership in the field of security and defence, as well as the growing cooperation in the energy, trade and business sectors, with an emphasis on Romania’s role in the Black Sea region. The week will end with the 4th edition of the largest Romanian festival in the United States, “Romanian Weekend at The Wharf”, in which, between 11 and 13 July, American citizens and members of the Romanian-American community will be able to enjoy folk dance performances and live concerts, demonstrations of traditional crafts, interactive workshops, tourist presentations, exhibitions and food and wine tasting.\nECONOMY Romania’s budget deficit could reach 7.8% of GDP this year and 6.1% in 2026, if all 3 sets of measures announced by PM Ilie Bolojan are fully implemented, according to the latest report by the international rating agency Moody’s. However, the institution warns that any deviation from the plan could lead to a decrease in the country’s rating, which is currently still at a “stable outlook”. The first set of measures will come into force on 1 August and provides, among other things, for an increase in VAT rates and excise duties on fuel, alcohol and tobacco. The second set includes measures related to special pensions, curbing tax evasion, as well as a reform of state-owned companies and local and central administration. The fiscal measures, however, are causing discontent among trade unions, which are organising street protests almost daily, and against this backdrop, the opposition in Parliament has tabled a no-confidence motion against Ilie Bolojan’s Cabinet. The motion needs the votes of half plus 1 of the number of MPs in order to pass, but the ruling coalition has a comfortable majority in Parliament.\nBANKING Exim Banca Românească has joined the Ukraine Export Credit Guarantee Facility (InvestEU), a joint initiative of the European Commission and the European Investment Fund, the European Investment Bank announced. Under this facility, EU national export credit agencies provide guarantees to small and medium-sized enterprises and mid-caps exporting to Ukraine, supporting the country’s efforts to integrate into the European single market and become a member of the EU. The Ukraine Export Credit Guarantee Facility is expected to bring together over 550 EU exporters, including 25 exporters from Romania. Nine other EU countries also take part in the initiative: Denmark, Finland, France, Germany, Italy, Latvia, Slovakia, Slovenia and Spain.\nUKRAINE The United States will supply weapons and ammunition to Ukraine through NATO, the US president Donald Trump said, and added that the equipment would be purchased by the North Atlantic Alliance. Sources quoted by Reuters say that Donald Trump is expected to sign an executive order on the supply of weapons to Ukraine for the first time since taking office. The White House leader also said he will make a “major statement” concerning Russia. Donald Trump has recently expressed frustration with Russia’s president Vladimir Putin over the lack of progress in ending the war between Russia and Ukraine, Reuters reports. President Trump even warned that he could support a bill in the US Senate to tighten sanctions on Russia. Russia has intensified its attacks in recent weeks, frequently launching hundreds of drones and missiles on Ukrainian cities.\nFOOTBALL The winner of Romania’s football Cup, CFR Cluj, drew 0-0 away from home against the Hungarian team Paksi FC on Thursday in the first leg of Europa League’s first round. The second leg takes place on 17 July in Cluj-Napoca. On Wednesday, in Bucharest, in the Champions League, the most important continental competition, the Romanian football champions FCSB defeated Inter Club d’Escaldes, (Andorra), 3-1, in the first leg of the first qualifier round. The return match is also scheduled for next week. (AMP)",
  "word_count": 685,
  "scraped_at": "2026-02-14T01:49:44.681536",
  "_text_extracted": true
}