{
  "article_id": "944bf03e9426",
  "url": "https://www.teamtalk.com/arsenal/ruthlessly-put-one-of-their-best-players-up-for-sale-after-agonising-arteta-decision",
  "title": "Arsenal ruthlessly put one of their best players up for sale after agonising Arteta decision",
  "date": "20230429T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal ruthlessly put one of their best players up for sale after agonising Arteta decision\nArsenal have decided to consider offers for Granit Xhaka this summer despite him being one of their best players this season, according to a report.\nXhaka has divided opinion throughout his Arsenal career, but this season has arguably been his best. The midfielder has started 31 of their 33 Premier League matches so far. In all competitions, he has made 42 appearances, scoring seven goals and adding five assists.\nDespite Xhaka’s good form, an update from the Daily Mail has revealed that Arsenal will ‘listen to offers’ for him this summer.\nIt has become a priority for Arsenal to strengthen their midfield for the long term in the next transfer window. Xhaka is 30 years old and his usual midfield partner Thomas Partey will reach the same age before next season starts.\nJorginho is also the wrong side of 30, only ever appearing to be a short-term measure after joining from Chelsea in January.\nTherefore, Arsenal are targeting a new midfielder ahead of next season. But they will need to raise funds in order to pursue their ideal targets.\nA respected source recently suggested they will only be able to sign one of either West Ham’s Declan Rice or Brighton’s Moises Caicedo, while Chelsea’s Mason Mount also remains of interest.\nOnly under contract for another year unless Arsenal activate an option to extend his stay into 2025, Xhaka might have to make way.\nAs things stand, it is not yet clear who might be interested in offering him the next step. Xhaka has been with Arsenal since 2016 and has made 292 appearances for them after his arrival from Borussia Monchengladbach.\nFor a brief time, he even became club captain, although he was removed from the role in infamous circumstances. Xhaka has revived his career under Mikel Arteta, though, culminating in a Premier League title challenge this season.\nREAD MORE: Arteta plots to axe forgotten Arsenal man who has ‘little chance’ of playing for the Gunners again\nNevertheless, the Daily Mail claims Arteta is aiming to raise funds. The manager – who has only ever given more appearances to Bukayo Saka than the Switzerland international – will therefore weigh up selling Xhaka at what might be his last opportunity to do so for a decent fee.\nAlso at risk of being sold by Arsenal, per the report, are Kieran Tierney and Folarin Balogun. Tierney has lost his regular starting role at left-back to Oleksandr Zinchenko, while Balogun is impressing out on loan with Reims.\nSaturday’s Transfer Gossip column relayed that the latter has become a target for Paris Saint-Germain, for example. While his stock is high, he could generate a decent windfall.\nTime not ideal for Arsenal to lose Xhaka\nAs for Xhaka, there would be pros and cons to an Arsenal exit. Given his age and contract status, listening to offers for him might be an ordinary decision.\nHowever, Arsenal are preparing for a return to Champions League football next season. Xhaka has experience in the competition, unlike some of their younger talents, so his seniority might be useful.\nArsenal will need to retain good depth to compete on four fronts in 2023-24. Even if Xhaka is replaced as a regular starter, he might be a good option to retain as a backup.\nYet he will have to take a few factors into account from his own perspective. With that in mind, his future will remain uncertain for the time being.",
  "word_count": 592,
  "scraped_at": "2026-02-14T01:55:54.925245",
  "_text_extracted": true
}