{
  "article_id": "945db1271c5b",
  "url": "https://www.themag.co.uk/2023/10/eddie-howe-crystal-clear-defiant-message-this-is-where-we-want-to-be-newcastle-united/",
  "title": "Eddie Howe crystal clear defiant message - This is where we want to be",
  "date": "20231030T094500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe crystal clear defiant message – This is where we want to be\nEddie Howe and his squad are experiencing a very busy season.\nThe only midweeks when Newcastle United aren’t playing football, are during the international breaks.\nIt is a massive change from the days of Mike Ashley and an official club policy of getting out of the domestic cups as soon as possible AND viewing European football as just an unwanted inconvenience if the club accidentally qualified in 2012 for the Europa League.\nMike Ashley famously / infamously reacted by not allowing a single penny of net spending in that summer 2012 transfer window.\nEddie Howe though sending out a crystal clear message, the more matches the better.\nThe Newcastle United Head Coach declaring ‘This is the pinnacle and where we want to be’, in terms of competing in the Champions League and the domestic cups, as well as challenging towards the top end of the Premier League.\nEddie Howe asked after the draw at Wolves about the problems caused by so many matches:\n“This is the pinnacle and where we want to be [playing more games], you won’t find me moaning about the schedule.\n“It is certainly something we have to get used to this season.\n“This is what we want on a regular basis.\n“We are not moaning about it [busy schedule].\n“The only disappointment is that we have a lot of injuries to attacking players and it has limited my options.\n“Or [the ability to] freshen the players up who have fatigue.\n“Every player wants to play football.\n“So a lot of the lads will get a lot of football in these next few weeks.”\nStats via BBC Sport:\nWolves 2 Newcastle 2 – Saturday 28 October 5.30pm\nGoals:\nNewcastle United:\nWilson 22, 45+4 pen\nWolves:\nLemina 36, Hwang Hee-chan 71\nPossession was Wolves 43% Newcastle 57%\nTotal shots were Wolves 11 Newcastle 13\nShots on target were Wolves 6 Newcastle 5\nCorners Wolves 8 Newcastle 7\nReferee: Anthony Taylor\nAttendance: 31,584 (NUFC 3,000)\nNewcastle team v Wolves:\nPope, Trippier, Lascelles, Schar, Burn, Longstaff, Bruno, Joelinton, Almiron (Willock 72), Isak, Wilson, Gordon\nSUBS:\nDubravka, Gillespie, Dummett, Hall, Livramento, Ritchie, Krafth, Targett\n(Gary O’Neil blames match officials – Wolves 2 Newcastle 2 – Read HERE)\n(Wolves 2 Newcastle 2 – Match ratings and comments on all of the NUFC players – Read HERE)\n(Wolves 2 Newcastle 2 – Instant NUFC fan / writer reaction – Read HERE)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 426,
  "scraped_at": "2026-02-14T01:56:32.766944",
  "_text_extracted": true
}