{
  "article_id": "94796e4df1c3",
  "url": "https://www.nytimes.com/athletic/6736386/2025/10/22/hugo-ekitike-liverpool-promising-start/",
  "title": "Why Hugo Ekitike has been Liverpool bright spark : Extra gym work , adding pace , settled off the pitch",
  "date": "20251022T081500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The song dedicated to Hugo Ekitike was booming around Anfield long before he stepped onto the field.\nFlorian Wirtz and Curtis Jones were also waiting to come on just past the hour mark against Manchester United on Sunday, but it was the sight of Ekitike being readied that created a buzz.\nThe France striker could not prevent Liverpool from slumping to a fourth successive defeat, but again, he provided something they had been lacking with his positivity and directness.\nAdvertisement\nOut of Arne Slot’s new recruits, it is the £79million ($106m) summer signing from Eintracht Frankfurt who has found his feet quickest and established a close bond with the fanbase.\nIt has been an eventful three months for Ekitike. He is Liverpool’s top scorer, with five goals in all competitions, including the match-winner in the Merseyside derby triumph.\nHowever, he has not started a Premier League game since. He missed the defeat by Crystal Palace due to suspension following his senseless red card against Southampton in the Carabao Cup, which earned him a public rebuke from his manager.\nSince then, there has been frustration. He was forced off with cramp against Galatasaray in the Champions League and then relegated to bench duty, with Alexander Isak preferred to lead the line against both Chelsea and Manchester United.\nBut Ekitike’s claims to be restored to the starting line-up are compelling ahead of what promises to be an emotional night for him as he returns to Frankfurt’s Deutsche Bank Park tonight.\nHe has been one of the few positives during a bleak spell for Liverpool — showcasing both his talent and belief at a time when others have been struggling to adapt to new surroundings.\nThose in Ekitike’s camp believe feeling so settled off the field has helped. They also point out that, though he is only 23, England is the fourth country he has played in, so he has taken everything in his stride.\nEkitike quickly moved into a house in the Blundellsands area of Crosby, a coastal town eight miles north of Liverpool. The property was vacant after Luis Diaz and his family moved before the Colombian’s transfer to Bayern Munich this summer.\nIbrahima Konate, his friend and France team-mate, lives in the nearby town of Formby and has been a big source of support. Ekitike, who grew up idolising former Liverpool striker Fernando Torres, is a keen artist who spends his spare time either drawing, on his PlayStation, or watching films, with Whiplash and The Wolf of Wall Street among his favourites. When time off has allowed, he has flown home to Paris to spend time with his family.\nAdvertisement\nIt was late July when Liverpool agreed a fee of £69m potentially rising to £79m with Frankfurt for Ekitike. There was strong interest from Newcastle United and Manchester United, but the player always had his heart set on Anfield.\nLiverpool’s recruitment staff were unperturbed by Ekitike having previously been unable to make his mark at Paris Saint-Germain, ultimately joining Frankfurt on loan in January 2024 before the deal was made permanent a few months later. They see parallels with Philippe Coutinho, who did not make the grade at Inter but later flourished on Merseyside.\nThe club’s underlying data also pointed to Ekitike being ready to improve on scoring 22 goals in 48 games for Frankfurt in all competitions last season. Liverpool believe only Erling Haaland and Kylian Mbappe have shown better potential at a comparable age.\nAfter completing his medical in London and then boarding a flight to Hong Kong to link up with the squad on the pre-season tour of Asia, the sight of 25,000 fans attending an open training session at Kai Tak Stadium opened his eyes to the size of the club he had joined.\n“As you can see, we’ve brought in a new player,” Slot told the players after the introductions had taken place in the centre circle. “We’re hoping he’s the first Frenchman who can score goals for us,” Konate chuckled.\nEkitike has spent a lot more time in the gym than he did in Germany to handle the physicality of the Premier League. The goals flowed immediately.\nThe song the fans chant to the tune of Do The Conga by Black Lace means a great deal to him. “They have shown me a lot of love and I just want to give back to them,” he told Stan Sport Football last month.\nBut that desperation to deliver contributed to his glaring error of judgement against Southampton. Slot described the red card Ekitike was shown after getting a second booking for taking his shirt off after scoring the winner in front of the Kop as “needless” and “stupid”. Slot felt he should have shown more respect to his team-mates by rushing to embrace Federico Chiesa for the assist.\nAdvertisement\nThere was a swift public apology, with Ekitike admitting: “That was not smart. I punished myself a lot. It won’t happen again.” His team-mates have long since moved on, putting it down to over-exuberance, but there’s a sense that in recent weeks he’s been too keen at times to try to make amends, with decision-making letting him down, and that he needs to relax.\nPublicly, Ekitike has welcomed the challenge of competing for a starting spot with Isak, saying he can learn so much from the Sweden international. Slot has talked about the possibility of playing them together, but he abandoned that idea on Sunday by taking Isak off 10 minutes after bringing on Ekitike.\nWhat’s clear is that with Liverpool stuck in a rut, Slot needs to put his faith in those who look the most likely to deliver, and Ekitike is currently one of them.\nEkitike is playing with the freedom and confidence that a number of team-mates have lacked. From the moment he came on against United on Sunday, he increased the tempo of Liverpool’s play.\nShortly after his introduction, he carried the ball forward before shooting wildly over the bar. He could have made a better decision, but it injected an energy into his team-mates and the crowd that had been missing…\n… as did a similar situation five minutes later when he carried the ball into the box and fired a shot just past the post. It put United on the back foot.\nHis performance off the bench saw him show the qualities that have helped him hit the ground running at Anfield.\nThe 23-year-old’s speed when moving with or without the ball has been a standout attribute. He most notably used it against Everton when he scored Liverpool’s second goal. He timed his run in behind and finished Ryan Gravenberch’s through pass calmly.\nIt was a composed finish, as were his goals against Bournemouth and Newcastle at the start of the campaign. The latter was another good example of him showing his ball-carrying abilities, a quality only a few Liverpool players possess.\nIt is why using him on the left of the front three is a viable option because of his ability to take players on, as demonstrated in his assist for Mohamed Salah in the final pre-season friendly against Athletic Club.\nAdvertisement\nHe has missed a couple of close-range chances. The near-post flick against Galatasaray was unlucky, but the late miss against Atletico Madrid was poor. One of the improvements he can make is his heading. In competitive matches, he has missed decent headed chances against Bournemouth (twice), Burnley, Southampton, and Galatasaray.\nWhile goalscoring as the No 9 is the priority, it has been his hold-up and link-up play that has stood out, too. His goal against Bournemouth on the opening day of the season was the product of Ekitike exchanging passes with Virgil van Dijk and Alexis Mac Allister in the build-up to create the space for him to earn a shooting opportunity.\nIt is not just in the opponent’s half where he can be effective in starting Liverpool’s attacks, and strangely, it is often deeper where his technical quality shines the most.\nAgainst Chelsea, Ekitike was first to an Andy Robertson’s throw-in, which he deftly flicked into the path of Cody Gakpo. Ekitike used his speed to follow the move and it finished with him attempting a shot.\nThere was a clever flick over James Tarkowski’s head which again opened the play up…\n… and he was unfortunate not to be provided with a tap-in against Galatasaray as Jeremie Frimpong’s cross was cut out in a move started by Ekitike.\nThe passage of play above would have pleased Slot, as Ekitike was sharp in the initial challenge to win the ball back after a loose touch, and then showed anticipation to latch onto the loose ball midway through the move.\nThe striker has shown natural enthusiasm in and out of possession, trying to impact the game in possession and working hard to disrupt opponents out of possession.\nIt is why his exclusion from the starting XI in recent weeks — while somewhat understandable because he is competing with £125m Isak — has felt unfair.\nAdvertisement\nEkitike is guaranteed a hero’s reception when he walks out at Deutsche Bank Park. Some players damage their legacy by deciding to move, but there are no hard feelings. Frankfurt fans will show their appreciation for a player who scored 26 goals in 64 appearances for them.\nThe Bundesliga club’s model is signing players, improving them, and selling them on. It was clear last season that Ekitike was going to quickly outgrow Frankfurt and earn them a significant windfall.\nHe helped them qualify for the Champions League via their league position for the first time in their history — picking up much of the slack after Omar Marmoush was sold to Manchester City in January. Frankfurt’s back line is brittle, underlined by the 5-1 hammering at the hands of Atletico Madrid, but they have rebuilt their attack with the signings of Ritsu Doan and Jonathan Burkardt.\nWhen Ekitike left Frankfurt, he endeared himself to their supporters with a heartfelt Instagram post.\n“We never really leave those we love, even far from Deutsche Bank Park, I will fulfil my new role, being the first supporter of this club that I love,” he wrote.\n“Wish you guys to win this Champions League (unless you face me). Goodbyes are only for those who love with their eyes. For those who love with their heart and soul, there is never goodbyes. I spent the best year of my life with you, you are engraved in me. Forever an eagle.”\nOut of respect, his celebrations will be muted if he shows them what they’re missing, but Liverpool need Ekitike to help spearhead a resurgence.",
  "word_count": 1777,
  "scraped_at": "2026-02-14T01:52:49.020021",
  "_text_extracted": true
}