{
  "article_id": "948d15467ed5",
  "url": "https://www.meathchronicle.ie/2025/02/05/cristiano-ronaldos-pursuit-of-1000-goals-unlikely-to-slow-down-as-he-turns-40/",
  "title": "Cristiano Ronaldo pursuit of 1 , 000 goals unlikely to slow down as he turns 40",
  "date": "20250206T023000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo’s pursuit of 1,000 goals unlikely to slow down as he turns 40\nBy Phil Blanche, PA\nCristiano Ronaldo turns 40 on Wednesday but there is another number focusing the mind of the Portugal star on his milestone birthday.\nThe magic number is 77 – the amount of goals Ronaldo needs for 1,000 in a stellar career that began way back on August 14th, 2002.\nIf life does indeed begin at 40, then Ronaldo is ready to cherish the concept and unlock the gates of football history.\nIt was once acknowledged Brazil pair Pele and Romario scored over 1,000 goals during their careers, yet those figures were eventually rounded down to 757 and 772 respectively with friendlies and other fixtures taken into account.\nThe great Austria and Czechoslovakia striker Josef Bican reportedly scored close to 1,500 goals between 1931 and 1957, but only 805 of those were recognised by FIFA.\nSo amid this murky statistical world, Ronaldo stands top of the list on 923 – 73 ahead of great rival Lionel Messi – and within sight of possibly football’s greatest singular achievement.\nRonaldo’s records almost know no bounds: most international appearances (217) and international goals (135), most appearances (183) and most goals (140) in the Champions League, top scorer in European Championship history in both qualifying and tournaments.\nAppearing at five World Cups and six European Championships is testament to his remarkable longevity, as is the fact he scored 460 goals in his thirties compared to 440 in his twenties (23 as a teenager).\nThe five-time Ballon d’Or winner has always thrived under the most ferocious of spotlights, and rarely have his standards dipped.\nHis greatest glories came with Real Madrid between 2009 and 2018, becoming Los Blancos’ all-time top scorer with 450 goals in 438 appearances.\nRonaldo won four Champions Leagues, three FIFA Club World Cups and two LaLiga titles with the Spanish giants.\nYet his imprint went much wider. Despite the manner of his departure in November 2022, Ronaldo will never be forgotten at Manchester United, the club that catapulted him into the big time after signing him from Sporting Lisbon at the age of 18.\nIn a brilliant first stint at the club, from 2003 to 2009, Ronaldo won three Premier League titles and the Champions League under Sir Alex Ferguson, scoring 118 goals along the way in 292 appearances.\nThere was also another appearance in the Champions League final, in 2009, before he was sold to Real for a then world record £80million.\nIn Portugal, Ronaldo remains a national hero with his record goals tally and inspiring them to their first international title at Euro 2016, although injury limited him to just 25 minutes in the final against France.\nRonaldo rose from humble beginnings on the island of Madeira, shining on the football field before being picked up by Sporting.\nHe made his debut in a Champions League qualifier against Inter Milan in 2002 and, after bamboozling United players during a pre-season friendly in Lisbon the following year, Ferguson was urged to sign the precocious Portuguese by his squad.\nA £12m deal would seen as one of the bargains of the century.\nAfter Real, he ventured to Italy – scoring 101 goals in 131 appearances for Juventus and bringing them two Serie A titles among five trophies – and an ultimately unhappy second spell at United, despite another 27 goals, and on to Saudi Arabia.\nAl Nassr reportedly made Ronaldo the highest paid footballer in history on a salary said to be upwards of £160m per year.\nIt has proved a shrewd move. The pace has slowed but the goals have still flowed in a weaker league.\nThroughout his career Ronaldo has maintained the highest standards off the field in terms of fitness and motivation.\nTo many he has often come across as narcissistic and arrogant, yet he had the talent, confidence and dedication to back up any boasts.\nIt was this devotion looking after his body and honing his craft that has allowed him to prolong his glittering career into his fifth decade.\nDo not expect it to end until Ronaldo has 1,000 goals on that incredible CV.",
  "word_count": 694,
  "scraped_at": "2026-02-14T02:02:19.836398",
  "_text_extracted": true
}