{
  "article_id": "948f584ac017",
  "url": "https://www.thenationalnews.com/news/mena/2025/06/10/israeli-soldiers-brazenly-kill-palestinian-who-held-hands-in-air/",
  "title": "Israeli soldiers brazenly kill Palestinian who held hands in air",
  "date": "20250610T200000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Israeli soldiers shot dead a Palestinian man after he approached them with his hands in the air during a raid in the old quarter of Nablus in the occupied West Bank on Tuesday.\nThe man, who was not identified, was one of what the Israeli army said were two terrorists who were “eliminated” after attempting to snatch a weapon from a soldier.\nFootage and photos of the incident show a man wearing a white shirt, dark trousers and a red cap walking towards soldiers positioned at the entrance to a narrow passageway in one of the old city's lanes.\nOnce close, he appears to talk to them, arms still raised, before a series of shots ring out. Subsequent photos show the man lying on the ground, a red stain on his shirt, with another person also prone on the ground nearby, as soldiers stand over them.\nThe Israeli army said that “as a result of the attempt to steal the soldier’s weapon, several bullets were fired, moderately injuring one soldier, and lightly injuring three additional soldiers”.\nPalestinian authorities said Nidal Amireh, 40, and his brother, Khaled, 35, died of their injuries after being shot by Israeli troops, who were withholding their bodies.\nDozens wounded in Nablus raids\nIn addition to the two deaths, Palestinian medics reported dozens of people injured during the raid as a result of either beatings by Israeli soldiers, being hit by shrapnel and from inhaling tear gas.\nThe Palestinian Red Crescent said many of the injured had to be treated in the old city after its ambulances were blocked from entering.\nThe Israel army said it arrested six wanted people, and seized weapons during a search of “over 250 structures” during the operation.\nAFP reported that dozens of military vehicles entered the city shortly after midnight, after a curfew had been announced over loudspeakers the day before.\nThe raid was focused on the old city, a densely populated area bordering a large downtown square where young men and boys gathered to burn tyres and throw stones at the armoured vehicles. Israeli flags were raised over the roofs of buildings that had been turned into temporary bases for Israeli troops during the raid.\nNablus is in the northern West Bank, a Palestinian territory occupied by Israel since 1967.\nThe territory's north has been the target of a major Israeli military operation dubbed “Iron Wall” since January 21, two days after the start of a ceasefire in Gaza.\nViolence has surged in the West Bank since the start of the Gaza war, caused by the unprecedented October 7, 2023 attack by the Palestinian militants group Hamas on southern Israel.\nAt least 938 Palestinians, including fighters but also many civilians, have been killed in the West Bank by Israeli soldiers or settlers, according to data from the Palestinian Authority.\nDuring the same period, at least 35 Israelis, both civilians and soldiers, have been killed in Palestinian attacks or during Israeli military raids, according to official Israeli figures.",
  "word_count": 498,
  "scraped_at": "2026-02-14T01:49:39.537018",
  "_text_extracted": true
}