{
  "article_id": "9496e79948d7",
  "url": "https://www.caughtoffside.com/2023/06/26/stan-collymore-on-man-united-signing-mason-mount/",
  "title": "Pundit backs Man United to walk away from deal to sign Mason Mount",
  "date": "20230626T134500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United should not give in to Chelsea’s asking price for Mason Mount.\nThat is the view of former Aston Villa and Liverpool attacker Stan Collymore, who believes the Red Devils’ attempts to change their reputation as one of the world’s biggest overspenders is much-needed.\nHaving spent over a billion pounds on transfers since Sir Alex Ferguson left his role as manager in 2013, Man United are undoubtedly one of the sports’ highest-spending clubs, and while that approach may have worked for some sides, for United, it has yielded very little in terms of competitive results.\nLifting just four major trophies since the legendary Scot departed, none of which have been the Premier League or Champions League, the Red Devils’ trophy-winning days have not been seen for over a decade.\nHowever, now under the control of Erik Ten Hag, who lifted the Carabao Cup in his first season, there is a genuine sense that the 53-year-old could be the right man to guide the 20-time league winners back to the top, and Collymore believes one of the Dutchman’s biggest challenges is changing how the club are perceived in the transfer market.\nOn the pitch, Ten Hag has plans to add quality, as well as a high work rate, with the midfield and attacking third his two biggest priority areas. Consequently, the former Ajax boss has highlighted Chelsea’s Mason Mount as a top summer target.\nHowever, although the England international has just one year left on his contract and is eager to complete a transfer to Old Trafford, failure to budge on their sky-high £65m valuation has left Chelsea struggling to offload the wantaway 24-year-old.\nWhat has Stan Collymore said about Mason Mount to Man United?\nBelieved to have made several offers to their Premier League rivals, with their latest, according to Fabrizio Romano, worth £55m, United appear adamant they’re not going to overpay for a player they deem not worth his club’s valuation, and Collymore thinks this is the right approach to take.\n“We know that Man United want Mason Mount and we know that Mason Mount wants Man United, but there is definitely a sticking point with Chelsea over the eventual transfer fee,” Collymore said in an exclusive interview.\n“From United’s perspective, I totally understand why they’re being cautious. You can see the approach they’re trying to take and the perceptions they’re trying to change.\n“For too long United have overpaid for players. They’ve been taken advantage of by other clubs because they’re Man United. The club has now moved in a different direction and are trying to shake that reputation, so I completely back the idea of them setting a price, making an offer and then refusing to budge on it. If they cave to any crazy demand, which I think £65m for Mount is, they’ll continue to have the mickey taken out of them.”\nOut of the Premier League’s top 10 most expensive signings, Man United are responsible for five.\nAs per Football Transfers, the United deals that feature on the list are:\n- Jadon Sancho from Borussia Dortmund in 2021 for £73m (#9)\n- Romelu Lukaku from Everton in 2017 for £75m (#7)\n- Harry Maguire from Leicester City in 2019 for £80m (#6)\n- Antony from Ajax in 2022 for £82.2m (#5)\n- Paul Pogba from Juventus in 2016 for £89m (#4)",
  "word_count": 557,
  "scraped_at": "2026-02-14T01:56:02.419573",
  "_text_extracted": true
}