{
  "article_id": "94a7bb39e5e5",
  "url": "https://www.teamtalk.com/liverpool/jude-bellingham-transfer-latest-bundesliga-expert-reveals-how-liverpool-struggles-actually-affect-pursuit",
  "title": "Jude Bellingham transfer latest : Bundesliga expert reveals how Liverpool struggles actually affect pursuit",
  "date": "20230225T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nJude Bellingham transfer latest: Bundesliga expert reveals how Liverpool struggles actually affect pursuit\nAn update from a Bundesliga expert about Jude Bellingham has revealed why Liverpool are still in with a concrete chance of signing the England international.\nBellingham is one of Liverpool’s main midfield targets ahead of the summer transfer window. The position needs new energy at Anfield and the 19-year-old could well provide it. He has built up a strong reputation in Germany thanks to his form for Borussia Dortmund.\nHaving also made an impression on the international stage, the world is at Bellingham’s feet. If he is to return to English football at club level, Liverpool will want to be his takers.\nHowever, they are facing competition from some clubs who are higher up the table. Furthermore, there could also be the attractive option of going to Real Madrid for Bellingham.\nSince Liverpool are currently eighth in the Premier League table, they risk missing out on Champions League qualification. In theory, it could harm their chances of signing one of Europe’s most in-demand players.\nBut according to Bild head of football, Christian Falk – whose information corresponds somewhat with what TEAMtalk has recently learned too – Bellingham would still “love” to join Liverpool if he was given the chance to turn around their form.\nFalk wrote for Caught Offside: “I heard that Jude Bellingham is keeping a very close eye on what Liverpool are doing at the moment. I’ve been told nobody should think he’s a player that wouldn’t go to Liverpool because of the difficult situation they’re in.\n“It’s the other way around – he’s actually the kind of guy who would love to go to a club where he can change their fortunes.\n“At Liverpool, he sees that the club is in need of him and that he can build something there, so that’s why the side remains an interesting option for him.\n“As you see in the Premier League, they’re not massively far away from the Champions League places but it’s important to note that Champions League qualification isn’t a deal-breaker for Bellingham. Of course, it wouldn’t hurt Liverpool’s chances!”\nLiverpool still in with Jude Bellingham chance\nAfter 22 games of their season, Liverpool are currently seven points behind the top four. However, they do have two games in hand on Tottenham, the side currently in fourth place.\nHence, there is still plenty of time for Liverpool to cut the gap. They will need to find some consistency in order to get there, though.\nIn the long term, adding someone as effective as Bellingham could enable them to become a better unit again. However, for now, they will have to get by without him and try and show they are heading in the right direction.\nBellingham, meanwhile, must continue adding to his reputation in the Bundesliga. This season, he has played 29 times in all competitions for Borussia Dortmund. Along the way, he has scored 10 goals and supplied six assists.\nAfter 21 games of their season, the black and yellows are second in the German top-flight table. Bellingham has been one of their key players in the process.\nHis contract there is due to last until 2025. However, his club should be facing up to the prospect of selling their prize asset in the summer.\nIt seems Liverpool are still in contention to offer him the next step. Still, they will have to keep working hard to convince him they would be the best choice.\nREAD MORE: Fallen Liverpool star Klopp knows is finished tipped to be biggest casualty in eight-man clear-out",
  "word_count": 604,
  "scraped_at": "2026-02-14T01:55:49.887140",
  "_text_extracted": true
}