{
  "article_id": "94b960f9ec7b",
  "url": "https://theathletic.com/4832150/2023/09/05/inside-manchester-united-transfer-window-2023/",
  "title": "Inside Manchester United transfer window : Early progress , FFP constraints and a private jet to Florence",
  "date": "20230905T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Manchester United prepared to embark on a new Premier League season, their summer transfer window looked to have been relatively pain-free, notwithstanding a potential stress fracture in Rasmus Hojlund’s back.\nA delayed start for their new striker aside, the Old Trafford hierarchy would have been pleased with their work up to that point.\nAdvertisement\nThree positions earmarked as the highest priorities at the start of the summer — centre-forward, goalkeeper and central midfield — had been filled by three major signings for a combined initial fee of £163million ($206million), potentially rising to £180m in add-ons.\nMason Mount and Andre Onana were the primary targets for their positions, while Hojlund had emerged as the leading candidate up front once United decided against a move for Harry Kane in the spring.\nFurther additions were still required, though, and multiple sources — who, like others in this piece, spoke on the condition of anonymity to protect their positions — had made it clear since the start of the summer that, beyond those priority positions, United’s capacity to buy in the market would be influenced by their ability to sell.\nBut age-old difficulties in offloading fringe players — and by extension the club’s delicate compliance with financial fair play regulations — ultimately had an effect, culminating in a more frantic final week than most had expected.\nThere was a heavy dose of misfortune mixed in, with Luke Shaw’s injury the type of unforeseeable event that would influence any club’s late business.\nAt the very start of the window, left-back was one position in Erik ten Hag’s squad that was arguably oversubscribed. Shaw was the undisputed first choice, Tyrell Malacia was an adequate and dependable back-up and there was a backlog of alternatives behind them.\nAlex Telles had returned from Sevilla as a Europa League winner but was actively offered around the market, eventually landing at Al Nassr in a £4million deal.\nBrandon Williams had spent a year on the sidelines, occasionally being included in matchday squads and playing a handful of games for United’s under-21s. There was also Alvaro Fernandez, the 20-year-old left-back who was named Preston North End’s young player of the year after an impressive loan spell with the Championship club last season.\nAdvertisement\nThat stockpile of left-backs meant that United could absorb a lay-off for either of their leading pair, which was why there was no rush to find cover for Malacia when he was prevented from travelling on the club’s pre-season tour of the United States.\nThe subsequent departures of Telles and Williams left them exposed but even then, United can count themselves unlucky in how their dash for an emergency left-back came about. The club learned of Shaw’s injury only hours after Williams’ loan to Ipswich had been completed.\nFernandez had been close to finalising a loan move to La Liga outfit Granada before Shaw’s injury. That was suddenly put on hold.\nSome figures who have followed Fernandez’s development believed he would be worth trying given United’s circumstances but Ten Hag wanted a replacement with Premier League experience.\nIn a meeting with Ten Hag, Fernandez was told that he would be allowed to go out on loan if a deal for an emergency left-back could be arranged. If not, he would compete with Dalot for a place in the team until Malacia returned from injury.\nUnited were forced to devise a shortlist of several emergency options which included Nicolas Tagliafico (Lyon) and Marcos Alonso (Barcelona) but which was headed up by Chelsea defender Marc Cucurella — a player who Ten Hag has admired and who he believed would suit United’s style of play.\nChelsea were willing to entertain a loan move for Cucurella, as they had been with clubs across Europe all summer, with Atletico Madrid among those monitoring the 25-year-old. United’s interest was considered the most solid, however, and their status as a rival for a top-five finish and Champions League qualification was not considered an obstacle.\nThe two clubs held informal talks over that weekend, with Chelsea initially demanding a £7million fee to temporarily sign a player who had cost them £60m the previous year.\nAdvertisement\nUnited were unwilling to meet that figure but, after further talks, there was belief that a compromise could be struck before Chelsea’s Carabao Cup second-round tie against League Two side AFC Wimbledon on the Wednesday evening (August 30).\nOn the morning of that game, sources close to Cucurella still did not expect him to start against Wimbledon so long as an improved offer arrived from United before kick-off. No significant progress was made over the course of the day, however, so Cucurella started and played 90 minutes in a 2-1 victory for Chelsea.\nThat appearance complicated United’s pursuit of their priority target, not only making him cup-tied for future rounds of the Carabao Cup but also limiting him to playing for one other club this season.\nAccording to FIFA rules, players may be registered with a maximum of three clubs during one season but can only play official matches for two.\nCucurella’s appearance against AFC Wimbledon and United’s desire for a break clause meant that if he were to return to Chelsea in January, he would be unable to play for any other club during the 2023-24 season.\nThat complication influenced United’s decision the following day to switch their focus to signing Tottenham’s Sergio Reguilon — a deal that was viewed as both cheaper and easier to do.\nUnited will cover Reguilon’s £115,000-a-week wages in full but Spurs did not require a loan fee. The paperwork was finalised overnight, in time for Reguilon to train at Carrington on Friday morning before the official announcement that afternoon.\nA major benefit of switching focus from Cucurella to Reguilon was more flexibility in negotiations for Sofyan Amrabat.\nAs Ten Hag said after Sunday’s 3-1 defeat at Arsenal, another holding player had been on his wish list all summer long — though sources speaking to The Athletic suggested that United’s porous midfield displays in the opening games of the new season hastened the push for a new addition in the middle of the park.\nAdvertisement\nAmrabat only wanted to join United. Like Hojlund before him, the 27-year-old switched agents to be represented by SEG — Ten Hag’s agency — in order to help facilitate a move to Old Trafford.\nWhile negotiating with Amrabat was straightforward, talks with Fiorentina were heavily conditioned by United’s limited budget. As revealed by The Athletic, while the negotiations for the more expensive Cucurella loan were still ongoing, United submitted a loan bid for the Morocco international worth €2million.\nThe deal’s structure included a fixed fee payable in two €1million instalments and a break clause that would allow United to terminate the loan in January.\nHowever, the clause would be effective before the second instalment was due to be paid, meaning Fiorentina would be guaranteed just €1million. Unsurprisingly, United’s offer was rejected out of hand.\nFiorentina wanted a total package worth €35million — a €10million loan fee, €20million after his 15th appearance plus €5million in easily achieved add-ons. The Serie A club also insisted that an obligation to buy was included and were surprised by United’s desire for a break clause given Ten Hag’s admiration of the player.\nNegotiations were held over a €5million loan fee but, as late as Wednesday evening, United had offered just €3million. That too was rejected. Fiorentina’s patience was wearing thin and the Serie A club informed United’s director of football negotiations Matt Hargreaves that the deal was off.\nHargreaves has been a central figure in United’s transfer dealings since starting work this summer following his appointment in March, taking up responsibilities previously filled by previous chief negotiator Matt Judge and, on a temporary basis, lawyer Tom Keane.\nWith the Amrabat talks now close to falling through, Hargreaves persisted and told Fiorentina he wanted to conduct negotiations face to face. Fiorentina’s response was not to bother unless the €10million loan fee was guaranteed.\nAdvertisement\nUnited arranged for a private jet and a prospective medical in Pisa in case a breakthrough could be found. Discussions continued after Hargreaves flew out to Florence on Friday morning. Fulham had registered an interest in Amrabat but were told the player only had eyes for Old Trafford.\nUnited eventually struck a deal on Friday afternoon (deadline day) which largely aligned with Fiorentina’s initial demands of a €10million loan fee and an overall €35million package, although United’s negotiations team secured a €20million option to buy rather than an obligation to buy.\nAmrabat’s medical was completed, although not before United detected a minor back injury.\nThe 27-year-old struggled with his back during Morocco’s World Cup campaign, revealing to The Athletic earlier this year that he received pain-killing injections in order to play in the round of 16 defeat of Spain.\nGO DEEPER\nSofyan Amrabat exclusive: My 'perfect' tackle on Mbappe and 'learning so much' from Ten Hag\nBut as the current back issue was not thought to be serious, United pressed ahead with the deal on the agreed terms. Along with the loan signing of Reguilon, the arrival of backup goalkeeper Altay Bayindir in a £4.3million deal from Fenerbahce and the permanent signing of free agent — and former United player — Jonny Evans, the summer’s business was complete.\nIn the end, it was only once United had closed on Dean Henderson’s £15million move to Crystal Palace that progress could be made in the Amrabat talks.\nThat haggling until the final hours before the deadline could have been avoided had United managed to offload more players who find themselves on the fringes of Ten Hag’s first-team squad, the most notable example being Harry Maguire.\nIn Maguire’s case, United found an acceptable £30million offer from West Ham United but Maguire decided against the move. As selling their former captain would have involved signing another centre-back trusted to start games, United were always happy to leave the final decision down to Maguire.\nScott McTominay was similarly valued as a player who could contribute to Ten Hag’s squad but United were open to listening to substantial offers, north of £40million. Bayern Munich’s interest was genuine, with Thomas Tuchel known to be a fan of the player, although priorities ultimately shifted towards a move for Fulham’s Joao Palhinha.\nAdvertisement\nThe Portuguese midfielder also had admirers at Old Trafford. Ten Hag was impressed with Palhinha’s performances against United last season and the 28-year-old was keen on the idea of a move too.\nUnited moved ahead with a cheaper deal for a younger player in Amrabat, though United may have been able to make the deal work by selling McTominay to Bayern. Ultimately McTominay stayed, as has Donny van de Beek.\nThe Dutch international attracted late interest from Galatasaray and a deal could still be struck before Turkish football’s window closes on 15 September, despite United turning down a £1million loan bid from their Champions League group-stage opponents.\nThere is still time for United to add to the approximate £52million generated from player sales — the highest figure since the summer of 2019, when Romelu Lukaku’s £73m move to Inter Milan made up the vast majority of that year’s transfer income.\nStill, that £52million recouped is dwarfed by the amounts some of United’s rivals have made over the last three months.\nManchester City took approximately £77.5million in initial fees on four academy products with a total of three Premier League starts between them, not including the departures of Riyad Mahrez and Aymeric Laporte. Chelsea’s huge £400million outlay was at least partly offset by around £220million in sales, including the £55million received from United for Mount.\nUnited believe their struggle to sell is a consequence of handing out highly lucrative contracts that become difficult to offload, which was a factor in the likes of Maguire, Van de Beek and Eric Bailly staying beyond Friday’s deadline.\nTo avoid similar situations in the future, the club has now moved towards incentivising deals based upon success, number of appearances and other factors. It is also increasingly a consideration in the profile of players targeted.\nAdvertisement\nWhile some supporters have reacted sceptically to claims that United’s spending is limited by FFP restrictions, those concerns are real. In July, United were fined €300,000 by UEFA for a “minor break-even deficit” during the 2022-23 season.\nThat stemmed from United posting a pre-tax loss of approximately £150million during 2021-22, when substantial transfer spending and an exorbitant wage bill failed to secure a top-four finish and Champions League football.\nFortunately, United will not be assessed under UEFA’s new ‘football earnings’ rule this season. Every club competing in European competition is only required to submit their 2022-23 accounts this year.\nWhen UEFA’s break-even assessments resume from next season, they will only be based on 2022-23 and 2023-24, so United’s 2021-22 loss will not be part of the equation.\nBut United still needed to consider the Premier League’s Profitability and Sustainability regulations (P&S) — their own version of FFP, which limits clubs to losses of just £15million over a three-year monitoring period if not covered by ownership funding.\nGiven the Glazer family’s reluctance to put their own money into the coffers, that £15million limit applies. And as this season’s P&S monitoring period will still include the 2021-22 campaign and the £150m pre-tax loss, United knew they would need to spend carefully this summer.\nEarlier this year, The Athletic reported that United had budgeted for a net outlay of approximately £100million in the summer window. When the deadline finally passed at 11pm on Friday evening, the club’s net spend came in north of that mark — at around £129million on six players.\nUnited can be pleased with their incomings, having addressed the priority positions and completed their major business early, before finding room to make the further additions required, but the legacy of past mistakes made their summer more difficult than it needed to be.\nAdditional reporting by James Horncastle, Pol Ballus and Dan Sheldon\n(Header photos via Getty Images)",
  "word_count": 2330,
  "scraped_at": "2026-02-14T02:00:57.140020",
  "_text_extracted": true
}