{
  "article_id": "94f4fe59ce05",
  "url": "https://www.themag.co.uk/2025/01/south-coast-awaits-southampton-v-newcastle-preview-newcastle-united/",
  "title": "South coast awaits - Southampton v Newcastle preview",
  "date": "20250124T210000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "South coast awaits – Southampton v Newcastle preview\nWelcome to the Southampton v Newcastle preview.\nSaturday 25th January – 3pm\nNewcastle United travel to the South Coast this weekend, looking to get the defeat to Bournemouth out of their system and climb back into the top four.\nThe travelling Toon Army will be hoping the 688 mile round trip will be well worth both the time and effort. A journey home celebrating three points would go a long way to ensuring that’s the case.\nStanding in their way will be a Southampton side desperate for a win, having only achieved six points and just the one victory all season.\nForm\nDespite last week’s humbling defeat, Newcastle have won five of their past six league matches, racking up an impressive fifteen points. We’ve beaten Ipswich, Aston Villa, Man U, Tottenham and Wolves whilst suffering a crushing defeat to Bournemouth. The last six league matches have seen United score fifteen goals and concede five (although four of those came in the same game). We’ll end the weekend between fourth and eighth in the league table.\nSouthampton have lost their last five straight league matches and drew the one before that, meaning they’ve gained one point in the past six league games. A 0-0 draw with Fulham was followed by defeats to West Ham, Crystal Palace, Brentford, Man U and Nottingham Forest. They’ve scored four goals in this run and conceded fourteen. They’re currently marooned at the bottom of the league, eleven points from safety, in what is looking like an increasingly uphill battle to avoid relegation.\nLast time out\nThe less said about NUFC’s last match, the better! Behind early on to a goal scored by the son of former Toon flop Patrick Kluivert, a headed equaliser from Bruno raised hopes that United could continue their fine run of form. Unfortunately, the rest of the scoring was achieved by the Cherries who netted three more goals without reply to send their travelling fans into delirium. A Kluivert hat-trick at St James’ Park came twenty years too late for the majority of those in attendance and the Toon will be desperate to draw a line under this one as soon as possible.\nSouthampton went away to this season’s surprise package Nottingham Forest and looked in danger of a complete capitulation, 3-0 down at half-time. The Saints showed great spirit to pull two back in the second half and almost snatched an unlikely equaliser when having one cleared off the line in injury time.\nStat attack!\nNewcastle have won four of their past five visits to Southampton in all competitions.\nNUFC have lost just one of their past seven matches away to Southampton.\nSt Mary’s stadium has hosted this fixture on fourteen Premier League occasions, Newcastle winning four, drawing four and losing six.\nThe Toon have scored seven goals in the past three visits to St Mary’s, all of them coming in victories.\nMemorable match\nIn 2004, Graeme Souness took his Newcastle side away to Southampton hoping, for their first away league win against the Saints for thirty two years at what had become something of a cursed trip for the travelling Toon Army.\nA fairly tepid game was brought to life on the stroke of half-time when Shearer smashed the ball across the face of goal and against the unlucky David Prutton, who could only divert it into his own net from close range to give the Toon an interval lead.\nNewcastle were fairly used to throwing away leads in this fixture and it always felt that just the one goal wouldn’t be enough. Southampton started the second half like they meant business and it took just eight minutes for them to take advantage of poor United defending to level the scores.\nBefore fans of either side could draw breath, back came United who were able to regain their slender advantage just a few minutes later. Stephen Carr didn’t have many highlights during his time on Tyneside but his only goal for the club was an absolute belter. Picking the ball up outside the area, he rifled home an unstoppable effort to send the away fans into raptures! This was a goal good enough to win any game and thankfully, in the process, consigned thirty two years of misery to the history books. There was to be no further scoring and the long journey home had never felt better. Final score: Southampton 1-2 Newcastle\nPlayed for both\nKevin Keegan – where to start?! The England captain amazingly signed for second division Newcastle in 1982 and spent two years battling to ensure promotion back to the big time. This was a massive coup for the Toon and was front page news for all the right reasons. Once promotion was achieved in 1984, Keegan famously departed his testimonial in a helicopter from the centre circle of St James’ Park. He scored forty nine goals in just eighty five appearances in the famous black and white. If that was the end of this story then it would be impressive enough but this is just the first chapter of what became an intriguing relationship between one man and the entire club.\nKeegan would return to Newcastle United in 1992 with NUFC on the brink of dropping into the third tier of English football. He’d not only oversee survival, he’d also take us up as champions twelve months later and then embark upon a rollercoaster ride that saw us heartbreakingly close to being the champions of England for the first time since 1927. Anyone who wants to relive such a special time should get the club VHS ‘So Close’ and read the excellent Martin Hardy book ‘Touching Distance’ (these may be also be good for some of our younger readers who’d enjoy finding out about Keegan and his entertainers, as well as making me feel very old by learning what a VHS is!). Devastated at missing out on the 1995/96 title, King Kev walked in January 1997 claiming he’d taken the club as far as he could.\nHe made a sensational return as manager in January 2008 but lasted just six months before being constructively dismissed by Mike Ashley, starting a civil war between fans and owner that lasted thirteen poisonous years. His place is assured as the most influential man in our recent history. A true NUFC legend.\nAlan Shearer – Speaking of legends, Mr Shearer joined his boyhood club for a world record fee from Blackburn Rovers in July 1996. Fresh from winning a European Championship Golden boot, sights were set on winning the title with NUFC. Shearer played for the Toon for ten years and scored a club record two hundred and six goals for his hometown team. Unfortunately, the only medals he got his hands on were silver, as we finished runners up in both the 1998 and 1999 FA Cup finals, with Shearer blasting an effort against the post in ‘98 that would have levelled the final against Arsenal. So near yet so far.\nHe’d return for a very brief stint as manager in 2009, achieving one victory in eight games, as the Toon were disastrously demoted to the Championship after sixteen years of top flight football.\nJohn Beresford – Signed for the Toon by the aforementioned Kevin Keegan in 1992, ‘Bez’ has become something of an adopted Geordie due to his massively pro-Newcastle views in the media. Playing for United for six seasons, he had numerous highlights, including memorable braces against both Croatia Zagreb and Dynamo Kiev in the 97/98 Champions league. Signing for Southampton in 1998, he actually pretended to be fully fit for an away match at St James’ in 2000 when he was clearly injured, just to set foot on the hallowed turf for one last match and was rightly given a standing ovation from the Toon faithful.\nManagers\nEddie Howe after a 4-1 defeat at home to Bournemouth:\n“Firstly, I have to congratulate our opponent. I thought Bournemouth were better than us today. I thought they played very well and never allowed us to find our rhythm in the game. I am disappointed with our performance, that is not the level that we played at in the last group of games. I thought we were devoid of energy today. We had a real problem athletically. We seemed fatigued and we never really recovered from a poor start to the game and ultimately have a lot to reflect on”\nIvan Juric after a 3-2 defeat away to Nottingham Forest:\n“We are a competitive team but if we are down ten percent then we are not competitive. I hope a first half like today never happens again. They scored the first two goals, that is ridiculous. Second half we fought and scored twice. Aina saved another one. At Manchester United for eighty minutes, in the second half today, we were good. We are not ready for ninety minutes and that is a real pity.”\nCharity\nAs it is an away match, Newcastle United fans will not be collecting opposite the Gallowgate end, for the food bank. However, you can still help out and all online cash donations are very much appreciated. For further info and/or to donate to the food bank online go HERE.\nPrediction\nAnyone thinking this will be an easy three points for the Toon, clearly doesn’t remember the 07/08 season, when an absolutely awful Derby County took four points from NUFC despite only achieving eleven throughout their entire season. A desperate 1-0 defeat away from home was followed up by an equally disappointing 2-2 draw at St James’ Park, when a late Viduka goal salvaged an undeserved point for the Toon.\nPride comes before a fall and here’s hoping Eddie Howe has drummed the right attitude into his team, as we look to right the wrongs of last weekend. Southampton 0-2 Newcastle.\nNewcastle United upcoming matches:\nSaturday 25 January – Southampton v Newcastle (3pm)\nSaturday 1 February – Newcastle v Fulham (3pm)\nWednesday 5 February – Newcastle v Arsenal (8pm) Sky Sports (League Cup)\nSaturday 8 February – Birmingham v Newcastle (5.45pm) BBC1 and BBC iPlayer (FA Cup)\nSaturday 15 February – Man City v Newcastle (3pm)\nSunday 23 February – Newcastle v Forest (2pm) Sky Sports\nWednesday 26 February – Liverpool v Newcastle (8.15pm) TNT Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1734,
  "scraped_at": "2026-02-14T02:28:31.900180",
  "_text_extracted": true
}