{
  "article_id": "950593e3847f",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-15422433/Trent-Alexander-Arnold-girlfriend-Estelle-Behnke-Barbados.html",
  "title": "England footballer Trent Alexander - Arnold stunning model girlfriend Estelle Behnke steals the show in a thong bikini as they enjoy a winter break in Barbados",
  "date": "20251230T153000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England footballer Trent Alexander-Arnold's stunning model girlfriend Estelle Behnke steals the show in a thong bikini as they enjoy a winter break in Barbados\n- Have YOU got a story? Email tips@dailymail.co.uk\nTrent Alexander-Arnold's stunning girlfriend Estelle Behnke stole the show in a skimpy Goyard bikini during their romantic winter getaway in Barbados on Sunday.\nThe injured footballer, 27, is said to be out of action for two months after suffering a hamstring injury earlier this month.\nMaking the most of his rare downtime, the England player jetted to the stunning Caribbean island to ring in the new year.\nThe couple, who have been dating for over a year, first sparked dating rumours in November 2024.\nThe former Liverpool right-back flexed his six-pack as he strolled along the white beaches alongside the model.\nEstelle, who boasts 172,000 followers on Instagram, showcased her jaw-dropping physique as she rinsed off in the shower after a dip in the sea.\nTrent Alexander-Arnold's stunning girlfriend Estelle Behnke stole the show in a skimpy Goyard bikini during their romantic winter getaway in Barbados on Sunday\nEstelle, who boasts 172,000 followers on Instagram, showcased her jaw-dropping physique as she rinsed off in the shower after a dip in the sea\nThe footballer, who currently earns a huge £180,000 per week, began dating the model after his split from Jude Law's daughter, Iris, 25.\nTrent began liking Estelle's Instagram posts on October 17, only a month after his split from Iris who he dated for five months after meeting at a Guess jeans photoshoot.\nA friend said there's 'no bad blood' between Trent and Iris but added that 'being a WAG was never really going to be her bag'.\nJust weeks before reports of Trent's break-up with Iris, they were pictured enjoying a PDA-filled beach getaway in Barbados.\nA source told The Sun that despite having a 'really fun summer' and holidaying with Trent's family in July, the pair's busy work schedules clashed.\n'Life is about to get really busy for them both, with Trent's schedule packed with first-team football and Iris having jobs all over the world.\n'So even though they are not dating any more, Iris and Trent will definitely stay friends.'\nOver summer, Trent was supported by his doting girlfriend Estelle at his Real Madrid unveiling.\nThe injured footballer, 27, is said to be out of action for two months after suffering a muscle injury earlier this month\nMaking the most of his rare downtime, the England player jetted to the stunning Caribbean island with Estelle to ring in the new year\nThe couple, who have been dating for over a year, first sparked dating rumours in November 2024\nThe former Liverpool right-back flexed his six-pack as he strolled along the white beaches alongside the model\nOver the course of their romance, Trent has splashed the cash on lavish trips away with Estelle.\nIn February this year, Trent and Estelle stayed at the £1,500-a-night Aman hotel in Venice.\nHe has also whisked her off on a £600-a-night trip to the five-star Soho Farmhouse in the Cotswolds.\nTrent's slow start to life in the Spanish capital has suffered another roadblock, with Real Madrid confirming the problem that forced him off in a 3-0 win over Athletic Bilbao.\nA statement read: 'After the tests carried out today, Trent Alexander-Arnold has been diagnosed with a muscle injury in the rectus femoris of [his] left quadriceps. Awaiting further developments.'\nSpanish journalist Arancha Rodriguez reports that the footballer will be sidelined for 'two months' with the problem.\nThat would leave him just four months to stake his claim to both a permanent starting spot for Real and persuade Thomas Tuchel of his credentials for the England World Cup squad.\nA hamstring injury meant Trent missed seven games across LaLiga and the Champions League earlier in the season.",
  "word_count": 638,
  "scraped_at": "2026-02-14T02:03:26.503641",
  "_text_extracted": true
}