{
  "article_id": "951032dcc025",
  "url": "https://www.dailymail.co.uk/news/article-13521237/Tartan-Army-kilt-Scotland-fans-Munich-Euros-Germany.html",
  "title": "Legions of kilt - wearing Scotland fans jet off to Munich for their first Euro 2024 match against Germany",
  "date": "20240612T101500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tartan Army touch down in Munich! Legions of kilt-wearing Scotland fans arrive in Germany ahead of opening Euro 2024 clash\n- Steve Clarke's men face the hosts in the tournament's opening game this Friday\nClans of kilt-clad Scotland fans have touched down in Munich ahead of their country's Euro 2024 opening game against Germany this Friday.\nDozens of supporters were seen draped in Scottish flags and wearing traditional tartan as they sat in pubs and soaked up the atmosphere in sunny Germany ahead of the tournament's curtain-raiser at Bayern Munich's Allianz Arena.\nScotland are taking part in only their second major tournament since the 1998 World Cup in France, having previously competed in the Covid-delayed Euro 2020 finals.\nA bagpipe player provided a fanfare at Munich airport welcoming new arrivals from Scotland ahead the showpiece occasion.\nManager Steve Clarke's players hope to get through the opening round for the first time at a major tournament, as they take on Germany, Switzerland and Hungary.\nScotland fans have arrived in Germany ahead of the opening game of Euro 2024 on Friday night\nScotland fans dressed in kilts cheer next to giant trophy outside Munich Airport\nDressed in traditional Scottish kilts, the fans were seen soaking up the atmosphere in Munich\nFans were getting on the beers this afternoon as Scotland prepare to face Germany on Friday\nThe fans appeared to be in good spirits ahead of their crunch opening group game of the tournament\nA Scotland flag is being displayed next to a German flag to mark the occasion\nA Euro 2024 poster in Munich as Scotland fans arrived in force today\nMeanwhile, Gareth Southgate's England are in Group C - with an initial fixture against Serbia this Sunday evening.\nThey then take on Denmark on Thursday next week and Slovenia five days later.\nScotland fans sporting not only kilts bit also sporrans, bonnets and the team's dark blue jerseys have been flocking through Edinburgh airport en route to the Euros.\nThere were raised fists and confident opinions offered ahead of Friday's opener.\nRobert Mellon, 66, from the Glasgow district of Langside, said: 'I'm hoping for a 2-1 victory for Scotland on Friday.\n'There's a lot of pressure on Germany, with them being the hosts. We've got a fair few men down with injuries and it's annoying that we can't find a striker.\n'We've got plenty midfielders - John McGinn scores his fair share. I went to the '98 World Cup opening game against Brazil and Scotland gave them a run for their money.\n'The ref said at that game, 'May the best team win', and Graeme Souness responded with 'I hope not'. The same goes for Friday's game.\n'It's half chance. I am patriot and I'll back Scotland all the way.'\nScotland supporters have been flocking through Edinburgh airport en route to the Euros\nThe fans are heading to Germany for Scotland's opening game against the hosts this Friday\nScottish flags were brandished as supporters also headed out from Glasgow airport\nScotland fans are pictured at Edinburgh airport before taking off for Euro 2024 in Germany\nA kilt-clad bagpipe player provided a welcome at Munich airport in Germany\nWelcoming gifts were provided as Scotland's players landed in Munich earlier this week\nAmong those taking part is Heart of Midlothian and Scotland striker Lawrence Shankland\nScotland's captain is UEFA Champions League-winning left-back Andrew Robertson\nMeanwhile, another traveller Norrie Kelly, 66, said: 'We're just going for the first game. I'd be quite happy with a draw on Friday. I'd obviously be over the moon with a win, but I'll happily take a draw.\n'The Germans are not playing quite as well as they usually do. You know what it's like when we come up against the big guns, we're always better.'\nKilt-wearing Dominic Burns, 26, from Maryhill in north-west Glasgow, declared: 'I think Scotland will win 5-0.\n'We got our tickets for face value, so it was well worth it. Even if they don't win, we're getting a holiday out of it.'\nBut his friend Ben Garret, 27, from Aberdeen, admitted: 'To be quite honest, I think we'll lose.\n'I can see it being about 3-1 to Germany, but I'll be there cheering on the boys either way.'\nBut amid the excitement, a Euro 2024 ticket scandal will see thousands of Scotland fans miss out on Friday's opening game.\nDespite Scotland's enormous 100,000-plus travelling support, the Scottish FA has been allocated only 10,000 tickets for Germany clash at Munich's 66,000-capacity Allianz Arena.\nNew York Red Bulls winger Lewis Morgan is among Scotland's latest arrivals in Germany\nScotland hope to get through to the knock-out stages of a major tournament for the first time\nBut UEFA's hospitality guests and sponsors have pocketed a separate allocation of 11,880 tickets for the showpiece match.\nScotland fans' chiefs said their fans could have bought out the fat cats' allocation many times over, slamming UEFA for prioritising money with VIP £1,000-plus packages.\nScotland followers will get just 10,000 tickets for the other two group games also.\nUEFA has reserved 18 per cent of Euro 2024 stadium capacities for other uses apart from fans.\nSeven per cent has been given to sponsors and broadcasters, four per cent to hospitality, four per cent to German authorities, and three per cent for its own UEFA guests.\n18 per cent of the 66,000-seat Allianz Arena works out at 11,880 tickets.\nAssociation of Tartan Army Clubs spokesman Hamish Husband said: 'Friday's game is the biggest occasion for Scottish football since opening the 1998 World Cup against Brazil, so it's extremely frustrating for Scotland fans to find out so many tickets are being given to hospitality, sponsors and UEFA guests.\n'The Tartan Army's demand is so great we could have bought 100,000 tickets, never mind 10,000.\n'UEFA's ticket distribution is very disappointing. Many Scottish fans will not get tickets to the game.'\nScotland's opposition were also given 10,000 tickets per game, no matter how many fans they have in Germany. Stadiums' remaining seats were sold by a public ballot.\nUEFA has said: 'Following feedback received after previous Euros, UEFA optimised ticket allocations for Euro 2024 and reserved a fixed number of tickets for each national association.\n'More than 80 per cent of tickets are allocated to fans.'\nThe Scottish players' partners - dubbed the 'SWAGs' - include Jack Hendry's model girlfriend Robyn Keen, Greg Taylor's wife Laura, Scott McTominay 's girlfriend Cam Reading and Jade Kelly Mills, the girlfriend of goalkeeper Angus Gunn.\nScotland's last game before the Euros saw them concede a two-goal lead to draw 2-2 with Finland at Hampden Park in Glasgow last Friday.\nAt Euro 2020 they drew 0-0 with England at Wembley in between two Group D defeats - 2-0 to the Czech Republic and 3-1 at the hands of Croatia.\nThis summer's tournament is tipped to kick off a spending spree as consumers replace televisions and stock up on groceries to watch the tournament.\nAs England and Scotland prepare for their opening matches, six per cent of shoppers expect to buy a new TV or electronic device to watch and keep up with their team, according to a survey for the British Retail Consortium.\nThe Scotland team arrived at Munich airport, will follow-up flights bringing plenty of fans\nThe finals' German hosts put out a welcome mat at Munich airport\nThere were handshakes all round as the Scotland squad arrived - pictured left to right: Munich airport CEO Jost Lammers, Andrew Robertson, Steve Clarke and minister Florian Herrmann\nThis kilt-wearing Scotland supporter was among those setting off from Glasgow airport\nThe official team bus was ready to roll at Munich airport as the players touched down\nA suitable welcome was offered at Munich airport as the plane carrying the team arrived\nScotland team WAGs who have arrived in Germany include Jack Hendry's model girlfriend Robyn Keen, Greg Taylor's wife Laura, Scott McTominay's girlfriend Cam Reading and Jade Kelly Mills, the girlfriend of goalkeeper Angus Gunn\nRobyn Keen is the girlfriend of Scotland international and Al-Ettifaq centre-back Jack Hendry\nAnother four per cent plan to buy official merchandise and lmost one in 10 - nine per cent - will host or attend gatherings with family and friends to watch matches.\nSome 13 per cent of people intend to spend more on groceries, beer, wine and spirits and takeaways to enjoy while watching the Euros.\nHowever younger generations are the most likely to drive up spending, with 24 per cent of 18-to-24-year-olds planning to buy more groceries, compared with just 4 per cent of those aged 55 and above.\nSeparate figures from Adobe show a 14.4 per cent increase in spending on TVs compared with normal levels as armchair fans prepare to tune in at home.\nAnd online sales of England football shirts and other team merchandise increased by 115 per cent last month compared with normal levels.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- New video shows man with backpack similar to Guthrie kidnapper\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Moment driver veers to target e-bike riders before killing teen\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl",
  "word_count": 1607,
  "scraped_at": "2026-02-14T01:51:32.434416",
  "_text_extracted": true
}