{
  "article_id": "952e9d0dde58",
  "url": "https://www.90min.com/posts/youngest-starting-xi-premier-league-history",
  "title": "The youngest starting XIs in Premier League history",
  "date": "20231228T164500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "11 youngest starting XIs in Premier League history\n- Man Utd made club history with a youthful XI against Brentford in May 2025\n- Arsene Wenger's Arsenal are among the youngest ever seen in the division\n- Jose Mourinho uncharacteristically trusted youth during his spell at Man Utd\n\"You will never win anything without kids,\" Sir Alex Ferguson wrote in his lessons on leadership, Leading.\nThe 13-time Premier League-winning manager has first-hand knowledge of how much success can be earned through youthful exuberance, famously lifting the top-flight title in 1996 after Match of the Day pundit Alan Hansen began the season sniffing: \"You can't win anything with kids.\"\nFerguson is hardly the only Premier League manager to have had an unwavering faith in youth. In fact, numerous coaches have fielded teams laced with more kids than the Scot ever did.\nHere are the youngest starting XIs ever to have graced the Premier League.\nYoungest starting XIs in Premier League history\n11. Arsenal - 23 years & 47 days vs Derby (2008)\nNo team in the history of English top-flight football has ever scored fewer than the 20 goals Derby County could muster during the disastrous 2007/08 campaign.\nThe Rams scored 10% of their seasonal tally against Arsenal in April but Arsene Wenger's young Gunners roared to a 6-2 victory nonetheless. While this woeful iteration of Derby represented an opportune opponent, Wenger has never been afraid of youth.\n10. Arsenal - 23 years & 27 days vs Wigan (2009)\nThe average age of Arsenal's starting XI was more than four years younger than their hosts but it was Wigan Athletic manager Steve Bruce who chastised the naivety of his players.\n\"It would be difficult to say it was schoolboy stuff as that would be disrespectful to schoolboys,\" Bruce sighed after watching his error-strewn squad take the lead before slumping to a 4-1 loss.\n9. Chelsea - 23 years & 21 days vs Crystal Palace (2023)\nChristopher Nkunku was Chelsea's only starter older than 25 against Crystal Palace. The summer arrival was only 26.\nMauricio Pochettino turned to youth for the visit of a Palace side managed by Roy Hodgson, ironically the oldest manager in Premier League history. However, Pochettino's lack of faith in his kids was evident by the introduction of 39-year-old Thiago Silva before the hour mark.\n8. Everton - 23 years & 14 days vs Bolton (1997)\nIn a way, it was fitting that Howard Kendall, once the youngest player to ever appear in a Wembley final, should field the youngest Premier League team of the 20th century.\nHowever, Kendall was forced into this statistical milestone by circumstance. Just two days after travelling to Old Trafford on Boxing Day, Everton were due to host Bolton Wanderers. A youthful rotated side won 3-2, with 26-year-old Duncan Ferguson stealing the headlines from his junior colleagues by netting a hat-trick of headers.\n7. Man City - 22 years & 360 days vs Aston Villa (2008)\nManchester City had been under the ownership of the absurdly wealthy Sheikh Mansour for less than two weeks when the 2008/09 season began. Across the previous campaign, City boasted the youngest squad in the division and Mark Hughes duly deployed another youth-infused side for the curtain-raiser at Villa Park. City lost 4-2.\nThe Premier League's newest owners subsequently splashed out almost £90m. The first XI that Hughes named after the summer window closed had jumped from an average age of 22 to 25.\n6. Leeds - 22 years & 341 days vs Man Utd (2000)\nDavid O'Leary's Leeds United squad at the turn of the century was so youthful he called them \"my babies\". As an Arsenal debutant at 17 himself, O'Leary was perfectly placed to appreciate the importance and capabilities of young players.\nThe fleet of talented teenagers, including the likes of Jonathan Woodgate, Alan Smith and Paul Robinson, came through Leeds' famed academy. Set up by O'Leary's predecessor Howard Wilkinson, the dorms in Wetherby were opposite a young offenders' prison. At one point in time, it was a lot harder to get into the academy than the building over the road.\n5. Arsenal - 22 years & 315 days vs Sunderland (2008)\nArsenal had led the league with less than ten games to play but by the final day of the 2007/08 season, the Gunners were consigned to third place, giving Wenger licence to rotate for the trip to Sunderland.\nThe Frenchman is the only manager in Premier League history to have named two separate starting XIs with an average age of less than 23. A 19-year-old Theo Walcott scored the only goal at the Stadium of Light the first time Wenger dipped below this threshold.\n4. Man Utd - 22 years & 284 days vs Crystal Palace (2017)\nJose Mourinho dished out four top-flight debuts on the final day of the 2016/17 season. Josh Harrop enjoyed the best afternoon of Manchester United's newbies, rattling in an early opener in a 2-0 victory at home to Crystal Palace.\nWhile it was a memorable day for many on the pitch, including 16-year-old substitute Angel Gomes, Mourinho didn't linger on the dead rubber ahead of United's imminent Europa League final. The Portuguese boss lasted 20 seconds at the post-match press conference and was at pains to tell the club's in-house broadcaster: \"Don't ask me too many things because now I am in the final, let me go home.\"\n3. Man Utd - 22 years & 270 days vs Brentford (2025)\n\"We need to focus a lot on our young players,\" Ruben Amorim warned before his side took on Brentford at the end of a dire 2024/25 campaign. The youthful United boss lived up to his promise and named the youngest-ever Premier League XI in the club's history, spearheaded by Chido Obi, who at 17 years and 156 days young, became the most junior United player to ever start a match in the competition.\nWith 15 minutes remaining, United were trailing 4-1 to Brentford. A pair of late goals from Alejandro Garnacho and Amad Diallo reduced the deficit to 4-3, but the gulf in quality was evident throughout.\nHowever, the kids were hardly to blame. Amorim, Erik ten Hag and Ruud van Nistelrooy had named far more senior lineups throughout the season yet United were still heading towards the lowest points tally in their modern history.\n2. Arsenal - 22 years & 237 days vs Portsmouth (2009)\nWenger has not always been obsessed with embryos. When Arsenal won the club's first Premier League title in 1997/98, the Gunners had the oldest team in the division; the broccoli-based diet and tailored training sessions he introduced got the best out of the team's veterans.\nA decade on, Wenger's focus had well and truly shifted. Throughout the 2008/09 campaign, Arsenal's average age barely crept above 24 but Wenger really leaned on his youngsters against Portsmouth at the end of the season, making eight changes ahead of a Champions League semi-final against Manchester United.\nWenger explained his faith in the future: \"I have no doubts about the younger players because I see them every day and what we work on, you could see that on the pitch today.\"\n1. Middlesbrough - 20 years & 181 days vs Fulham (2006)\nSteve McClaren's combined XI from Middlesbrough's creche were only undone by Heidar Helguson's 84th-minute penalty. The Boro boss, who started seven teenagers ahead of the UEFA Cup final, described the 1-0 loss to Fulham as \"an injustice\". \"There were some heroic performances out there and the lads did Middlesbrough proud,\" McClaren beamed.\nEven Fulham manager Chris Coleman was impressed. \"I would have preferred to have been playing an older team,\" he said, hailing the late win as \"a relief\".",
  "word_count": 1286,
  "scraped_at": "2026-02-14T01:51:13.760172",
  "_text_extracted": true
}