{
  "article_id": "953813ddf7b4",
  "url": "https://www.caughtoffside.com/2023/06/18/manchester-united-keeping-tabs-on-15-goal-premier-league-star/",
  "title": "Manchester United keeping tabs on Ollie Watkins",
  "date": "20230618T120000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are reportedly keen on signing Ollie Watkins from Aston Villa during the summer transfer window.\nThe 27-year-old striker has scored 40 goals in his last three Premier League seasons and he has proven able to be a reliable striker in the top flight. Manchester United need to bring in a goal scorer during the summer window and he prove to be a solid acquisition.\nAccording to a report from the Athletic, Manchester United are keeping tabs on players like Harry Kane and Rasmus Hojlund as well. The Red Devils must look to sign a reliable finisher this summer. Watkins has 15 league goals this season.\nThey were overly dependent on Marcus Rashford this past season and the England international had to carry the attack all by himself. Rashford clearly needs more help and support from his teammates and Watkins would be a quality option to have.\nThe 27-year-old is more than just a goal scorer and he will add creativity and hold-up play to the side as well. Furthermore, he is well-settled in English football and he should be able to make an immediate impact.\nThe striker has two years left on his current contract with the West Midlands club, and it wouldn’t be surprising if his head turned because of interest from Manchester United.\nIt would be a major step up in the player’s career, and he will want to showcase his qualities at the highest level.\nManchester United could offer him the opportunity to test himself in the Champions League next season and that could prove to be hard to turn down.",
  "word_count": 266,
  "scraped_at": "2026-02-14T01:50:37.804377",
  "_text_extracted": true
}