{
  "article_id": "9546dc716fb5",
  "url": "https://www.the42.ie/5-problems-erik-ten-hag-needs-to-solve-6150543-Aug2023/",
  "title": "5 problems Erik ten Hag needs to solve",
  "date": "20230825T080000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "1. Harry Maguire and other out-of-favour stars\nShifting unwanted, underperforming players will always be somewhat of a problem for big clubs, but it has been a glaring issue for Man United in particular of late.\nPhil Jones finally left the club in the off-season after 12 years, having made a total of six Premier League appearances in the last four campaigns.\nThe defender became a symbol of the perils of rewarding players with long contracts given how inactive he has been for years — not once in his 12 campaigns did he make 30+ appearances and there were only four seasons in which he exceeded the 20-game barrier.\nThe 31-year-old ex-England international is now a free agent, yet there are still many others at United who badly need a fresh start.\nThe likes of Eric Bailly, Harry Maguire, Scott McTominay, Donny van de Beek, Brandon Williams and Dean Henderson are clearly surplus to requirements.\nMaguire is the most high-profile of this out-of-favour contingent, given that he joined the club for a reported fee of €93 million in the summer of 2019.\nThe England international is only 30 — the prime age for a defender — and so United potentially could still recoup a considerable portion of the money spent on him.\nHowever, with just a week to go before the transfer window closes (at 11pm on 1 September), it appears increasingly unlikely that the former Leicester star will leave.\nMan United recently accepted a €35 million offer for Maguire from West Ham, only for the defender to fail to agree personal terms.\nA €40 million deal for Nice defender Jean-Clair Todibo is understood to be close and is expected to be agreed upon even if Maguire stays put.\nYet if United are to invest further before the window closes, they will surely need to find a way to offload some of their stars for a decent sum.\nMartial, Van de Beek and McTominay are others that have been regularly linked with the exit door of late.\n2. The imbalanced midfield\nIt’s obvious from their first two games that Man United’s midfield is a problem.\nBoth Tottenham and Wolves cut through it far too easily in the opening Premier League fixtures.\nThe Red Devils had just 44% possession against Spurs and were lucky to escape with three points in their opening fixture, as Wolves were denied a clear penalty in the dying moments and wasted several good chances.\nIn both matches, they started with an attack-minded midfield trio of Casemiro, Mason Mount and Bruno Fernandes, looking far too open as a result.\nAfter a largely positive first season at Old Trafford, Casemiro has been poor in the opening two games amid fears age could be catching up with the Brazilian at 31.\nSky Sports pundit Jamie Carragher has been particularly critical, labelling him a “panic buy” in his Telegraph column last week.\nAt the very least, the ex-Real Madrid man needs help with a more defensively inclined player operating alongside him.\nMcTominay was introduced in the 88th minute against Wolves and was an unused sub at Spurs, suggesting that for all his defensive prowess, Ten Hag is reluctant to rely on the Scottish international this season ostensibly due to his technical limitations.\nHowever, there is a clear lack of balance in the midfield and if they aren’t going to use McTominay, they will surely need an upgrade rather than solely availing of the options at their disposal.\nSofyan Amrabat, the 27-year-old Fiorentina midfielder and one of the standout players for a Morocco side that finished fourth at last year’s World Cup, would appear to be the ideal candidate.\nHowever, whether the Red Devils can secure a deal looks doubtful.\nThe player was left out of the first leg of Fiorentina’s Europa Conference League play-off tie on Thursday evening, suggesting a move could be imminent.\nBut Liverpool have also been strongly linked with Amrabat, and Anfield looks the more attractive option from a footballing perspective currently.\nHowever, Amrabat knows Ten Hag well, having come through under him at Utrecht, while the fact that Jurgen Klopp’s men have already recruited Alexis Mac Allister, Dominik Szoboszlai and Wataru Endo to their midfield indicates he has a better chance of thriving amid the more thin options at Old Trafford.\n3. The lack of depth in attack\nWhen Man United badly needed a goal in the 85th minute against Spurs, the sight of Anthony Martial emerging from the bench will have been far from reassuring for fans.\nThe situation prompted a characteristically caustic response from club legend Roy Keane.\n“They are bringing on the likes of (Anthony) Martial, you might as well bring on Frank Stapleton and Norman Whiteside,” the Irishman quipped. “Martial is not going to get you out of trouble.”\nOthers share Keane’s frustration with the inconsistent French forward.\nThe 27-year-old is in his ninth season at Old Trafford, having joined for €42 million in 2015 — a then-record transfer fee for a teenager.\nYet nearly 10 years on, Martial has rarely looked like establishing himself as a clinical goalscorer.\nHe has only reached double figures in three of his seasons at the club and registered an underwhelming tally of six goals in 21 Premier League appearances last season.\nYet the Red Devils keep having to rely on him owing to a lack of alternative options.\nMarcus Rashford, meanwhile, has struggled to make an impact having been asked to play as the main striker in the club’s opening two Premier League games.\nThe England international is generally at his best in a wider attacking role and has looked ineffectual in this less familiar position.\nThe Red Devils have of course splashed out €75 million to prise Danish international Rasmus Højlund from Atalanta, joining the club on a five-year deal.\nUnfortunately, an injury has delayed Højlund’s debut, though he is expected to be available for selection against Nottingham Forest this weekend.\nNonetheless, it is a big ask for a 20-year-old to lead the line at one of the world’s most high-profile clubs.\nMoreover, while he clearly has the potential to become a top-class striker, Højlund is not there yet.\nHe registered nine goals from 32 appearances in Serie A last season, which indicates he is hardly prolific enough to be United’s main man at present.\n4. Supporter discontentment\nIt is now more than 10 years on from Alex Ferguson’s retirement and since then, Man United have patently lacked leadership off the field.\nIn that period, a series of poor decisions at boardroom level have meant that the club have gone from being the dominant side in England to perennial underachievers who frequently miss out on a top-four finish.\nThe latest example of this significant problem was the appalling manner in which they handled the Mason Greenwood saga.\nWhile the club eventually came to the right decision in announcing that the striker would not play for them again, it took a considerable backlash, with staff considering either resigning or going on strike, for the call to be made.\nEverything else surrounding the decision epitomised the lack of conviction behind the scenes that has hampered the club for a decade.\nAs highlighted thanks to some excellent reporting by The Athletic’s Adam Crafton, there was the cynical manner in which United were planning to re-integrate Greenwood, down to small details such as how he should be photographed in training, compiling a list of individuals that were expected to be “hostile” to the star’s return and going so far as CEO Richard Arnold filming a now-aborted video explaining the reasons behind the player’s controversial return.\nEven the official statement released this week by United was another missed opportunity to emerge from this sorry saga with some credit.\nIt erroneously stated Greenwood had been “cleared of all charges,” thereby completely undermining every other contentious claim they made in relation to the marginalised forward.\nThe dithering over Greenwood is just one of a number of ways the club have managed to alienate a considerable portion of their fanbase.\nThe circus over the ownership is another stark example.\nSince the Glazers executed a $1.5 billion leveraged buyout of the club in 2005, they have become increasingly unpopular.\nThe anger reached its zenith in May 2021 when around 200 fans broke into Old Trafford, injuring two police officers in the process and forcing the postponement of their Premier League match with Liverpool.\nThe club’s subsequent re-signing of Cristiano Ronaldo appeared to temporarily quell the anger while the progress made on the pitch under Ten Hag last season also seemed to alleviate some of the prevailing acrimony.\nHowever, the Greenwood saga and the disappointing start to the season, have helped bring the issue back to the fore and there have been fresh protests this month.\nMost frustrating of all, though, is the current takeover predicament.\nAs far back as last November, the Glazers announced they were willing to sell the club, with Sheik Jassim bin Hamad Al Thani of Qatar or British tycoon Sir Jim Ratcliffe emerging as the two most viable buyers.\nBut no resolution has been reached amid lengthy negotiations.\nA report in The Sun this week suggested Sheikh Jassim’s £6 billion offer for the club had been accepted, and that the takeover would be completed by mid-October.\nHowever, until an official announcement is made, Man United fans would be forgiven for remaining sceptical after years of mismanagement and broken promises from those behind the scenes.\n5. Managing the European commitments\nWhat constitutes a good season for United this year is not an easy question to answer.\nBased on the early evidence, mounting a serious Premier League title challenge looks beyond them.\nAt the very least, fans will want to see evidence of progress and signs that the Erik ten Hag project is going in the right direction.\nLast season was certainly a substantial step forward given the sorry state the Dutch coach found the club in when he took over.\nA League Cup triumph was the highlight, while a third-place finish in the top flight and runners-up medals in the FA Cup were encouraging signs.\nBuilding on this progress, however, will be an even greater challenge.\nThe prospect of reducing the 14-point gap that separated City and United last season will be what matters most to fans, with Pep Guardiola’s treble winners again looking like the team to beat having convincingly won their opening two games.\nAnd perhaps the biggest inconvenience for United will be navigating Champions League football alongside their domestic commitments.\nOf course, they competed in the Europa League last season, but that is a competition where most Premier League teams often tend to rest their best players in the early stages.\nBy contrast, fans will demand that Ten Hag regularly selects close to his strongest XI in Europe’s premier club competition, which they haven’t won since 2008.\nAnd competing in the Champions League can be a burden to teams who don’t possess as much squad depth as a club of the calibre of Man City.\nThe Etihad outfit aside, the three English clubs who competed in the Champions League last season finished fifth, eighth and 12th in the top flight.\nGranted, the season was further complicated by the World Cup-enforced mid-season break, leading to its unprecedented length as well as some rather freakish results.\nHowever, the Red Devils must avoid becoming overwhelmed by the schedule, like so many teams before them.\nAnd that is why the next few days could be crucial. The number of players Ten Hag brings in and sells will likely determine whether they are genuinely capable of competing on several fronts.\nTen Hag’s record in the transfer market has been mixed so far — Casemiro, Lisandro Martinez and Christian Eriksen all made a positive impression last season, though the likes of Antony, Tyrell Malacia, Marcel Sabitzer and Wout Weghorst failed to fully convince, with the club opting not to retain the latter two players after their loan deals expired.\nUnited will therefore surely need at least one or two game-changing signings in the coming days to avoid another long, hard campaign where they are once more eclipsed by their improving rivals.\nUpcoming Premier League fixtures (kick-off 3pm unless stated otherwise)\nFriday\nChelsea v Luton (20.00)\nSaturday\nBournemouth v Tottenham (12.30)\nArsenal v Fulham\nBrentford v Crystal Palace\nEverton v Wolves\nMan United v Nottingham Forest\nBrighton v West Ham (17.30)\nSunday\nBurnley v Aston Villa (14.00)\nSheffield United v Man City (14.00)\nNewcastle v Liverpool (16.30)",
  "word_count": 2082,
  "scraped_at": "2026-02-14T01:48:22.643711",
  "_text_extracted": true
}