{
  "article_id": "95ba925a677d",
  "url": "https://www.caughtoffside.com/2025/12/29/real-madrid-plan-b-sell-vinicius-junior/",
  "title": "Real Madrid to target PSG Vitinha if Vinicius Junior leaves",
  "date": "20251229T124500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid are continuing to plan meticulously for the future as negotiations over a new contract for Vinícius Júnior remain unresolved, prompting the club to quietly prepare alternative scenarios should talks fail to reach a conclusion.\nWhile there is no sense of panic inside the Santiago Bernabéu, senior figures at the club are well aware of the need to be ready for every possible outcome when it comes to one of world football’s most valuable players.\nPublicly and privately, Vinícius has repeatedly expressed his happiness at Real Madrid and his desire to continue his career in Madrid.\nThat message has been reinforced by those at the very top of the club.\nPresident Florentino Pérez is understood to be fully committed to keeping the Brazilian superstar at the Bernabéu, viewing him as a cornerstone of Madrid’s long-term sporting project alongside Kylian Mbappe Jude Bellingham and the next generation of Galácticos.\nReal Madrid are prioritising keeping Vinicius Junior\nMadrid are prepared to go to great lengths financially to secure his future and believe his importance on and off the pitch justifies elite-level terms.\nOnly a complete breakdown in negotiations, something Madrid still believe is unlikely, would force them to even consider a sale.\nAnd even in that scenario, any decision would be taken entirely on Madrid’s terms, with a fee reflecting his status as one of the most decisive attackers in world football.\nAccording to Cadena SER, Real Madrid have already identified a contingency plan should the worst-case scenario materialise.\nThat plan would involve a pivot toward Vitinha, the Paris Saint-Germain midfielder who has been admired by Madrid scouts for several seasons.\nPSG midfielder Vitinha has impressed Los Blancos\nVitinha’s profile is seen as an ideal fit for Madrid’s evolving midfield structure. Technically gifted, press-resistant, and tactically intelligent, the Portuguese international has developed into one of Paris Saint-Germain’s most reliable performers.\nHis ability to dictate tempo, progress the ball through tight spaces, and operate in high-pressure matches has not gone unnoticed at Valdebebas, where recruitment staff see him as a player capable of elevating Madrid’s control in midfield for years to come.\nImportantly, Madrid’s interest in Vitinha does not indicate an expectation that Vinícius will leave.\nRather, it reflects the club’s long-standing philosophy of future planning of their squad.\nReal Madrid have been scouting midfielder wanted by Chelsea & Man United",
  "word_count": 389,
  "scraped_at": "2026-02-14T02:15:58.643913",
  "_text_extracted": true
}