{
  "article_id": "95cc16eb3e50",
  "url": "https://metro.co.uk/2023/08/23/chelsea-moises-caicedo-romeo-lavia-should-have-joined-liverpool-emmanuel-petit-says-19384617/",
  "title": "Chelsea : Moises Caicedo & Romeo Lavia should have joined Liverpool , Emmanuel Petit says | Football",
  "date": "20230823T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Emmanuel Petit says if he were Moises Caicedo or Romeo Lavia he would have signed for Liverpool, implying they chose Chelsea just for the money.\nThe midfield duo were both heavily linked with Anfield over the summer, but ended up moving to Stamford Bridge, with Caicedo’s £115million switch from Brighton setting a new British transfer record.\nLiverpool’s interest was concrete, with Brighton actually accepting a £111m bid for the Ecuador star, only for the player to reject the Reds in order to seal his long-desired move to the Blues.\nThough both huge clubs, Chelsea are certainly the riskier side to join right now given that they are undergoing a huge transformation of their squad and have a new manager still adjusting to his surroundings in Mauricio Pochettino.\nFurthermore, the Blues cannot offer any European football, while Liverpool are at least playing in the Europa League and are arguably in a better position to achieve Champions League qualification.\nThe move seems even more bizarre for Lavia who would have likely walked straight into Jurgen Klopp’s starting XI, but must now compete for starts against Caicedo and Enzo Fernandez – two of the most expensive players of all-time.\nFormer Arsenal and Chelsea midfielder Petit believes that from a sporting point of view the players’ decisions make little sense, telling BettingSites.co.uk: ‘I’m not going to say anything stupid but we all know why they went to Chelsea.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Sportingly, the best decision right now would be to go to Liverpool. If I am Caicedo or Lavia, I’m going to Liverpool instead of Chelsea because I can’t see a clear plan for what is going on at Chelsea.\n‘They now have around thirty-five players, which is crazy! Thirty-five players? Come on.\n‘How many players do they need? It’s going to be a nightmare just like what happened last season.\n‘When you look at Liverpool there is one area in particular that needs to be upgraded and that is the midfield area even though they signed new players in [Dominik] Szoboszlai and [Alexis] Mac Allister.\n‘If I was Caicedo I would have signed for Liverpool because I would reunite with Mac Allister and I would play with less pressure because so many of their midfield players have left the club. For me the answer is very easy.\n‘If you ask somebody why Caicedo and Lavia decided to go to Chelsea, the answer is just money. Money talks for the clubs and for the players.’\nMore Trending\nCaicedo made his much-anticipated debut last weekend, though it quickly turned into a nightmare, losing 3-1 to 10-man West Ham, with the 21-year-old giving away an injury time penalty.\nHe’ll be looking for redemption on Friday night when Chelsea host Luton, a game in which Lavia will hope to make his debut for his new club.\nMORE: ‘Pathetic’ Bruno Fernandes is ‘disturbing his Manchester United teammates’, says Micah Richards\nMORE: Chelsea icon makes bold top-four prediction and rates Mauricio Pochettino’s ‘impressive’ start\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 567,
  "scraped_at": "2026-02-14T01:56:26.907423",
  "_text_extracted": true
}