{
  "article_id": "95fc1fd0d320",
  "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/110110/joao-cancelo-talks-hansi-flick-lamine-yamal-and-why-he-loves-barcelona-after-sealing-return",
  "title": "Joao Cancelo talks Hansi Flick , Lamine Yamal and why he loves Barcelona after sealing return",
  "date": "20260113T183000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Joao Cancelo is a Barcelona player again and has been officially presented at the club following his arrival on loan from Al-Hilal.\nJoao Cancelo talks Hansi Flick, Lamine Yamal and why he loves Barcelona after sealing return\nHe’s officially back and he couldn’t be happier.\nThe Portugal international has signed on until the end of the season and will wear the No. 2 shirt at the Camp Nou.\nHe’s also spoken at a press conference about his return. Here are the best bits.\nCancelo on Yamal\n“Yes, I spoke with Lamine. He’s had a fantastic evolution. If he’s not the best, he’s in the top three. He’s in the top. He’s doing very well and the pressure of the shirt doesn’t get to him. There are games he decides single-handedly. My connection with him? We’ll see on the pitch.”\nCancelo on Flick\n”I only spoke to the manager today. What I like is how the team plays. It’s an attacking, possession-based team. I’m more of an attacking player, and this suits me well. The lads are doing very well, playing good football. This is a very talented team. Some of the boys have grown into men. They’ve developed a lot. I’ve come to help this team and, if possible, win titles.”\nCancelo on which position he’ll play\n“I’m available for any position. I’m going to give my all. I feel comfortable as a right-back and as a left-back. I’ve come here to understand my role. I’m going to train to play. Jules, Balde, Gerard Martín, and Eric are doing very well. I like challenges.”\nCancelo on Al-Hilal\n“Physically I feel great. There’s a limit on foreign players in Saudi Arabia. I got injured in September and they took me off the list; they could only register me on January 1st. But I trained and I’m feeling great. Ready to play.”\nCancelo on if he will stay permanently\n“It’s difficult to say because I have a contract with Al-Hilal. I want to enjoy myself, perform well, and help the team improve if possible. I wasn’t lucky enough to win titles when I was here, and I want to win.”\nCancelo on why he loves Barca\n“Almost all my idols played for Barcelona, and that’s why I like this club so much. When I was in Benfica’s youth academy, I played against Barça teams, and they all try to play the same style of football from the youngest players to the older ones. I really identify with it. Today I came back and felt right at home. I can’t really explain why I feel this way about the club, maybe it’s because my idols played here.”",
  "word_count": 444,
  "scraped_at": "2026-02-14T02:27:10.762667",
  "_text_extracted": true
}