{
  "article_id": "95fffab303c6",
  "url": "https://punchng.com/modrics-croatia-aims-for-first-trophy-against-spain/",
  "title": "Modric Croatia aims for first trophy against Spain",
  "date": "20230617T081500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luka Modric has been Croatia’s driving force on the way to Sunday’s Nations League final, where they could earn their first-ever major trophy against a Spain team he knows inside out.\nQuestions surround the veteran midfielder, 37, over his future both in international football and at club level with Real Madrid, with his contract set to end this month.\nBefore resolving them, Croatia captain Modric is aiming to lead his country, with a population of only four million people, to glory in Rotterdam at De Kuip.\nThe Balkan nation has consistently over-performed on the world stage over the past 25 years, starting with their third-place finish at the 1998 World Cup.\nThey followed that up by reaching the 2018 World Cup final, where they were beaten by France, and again finished third in Qatar last year, eliminating favourites Brazil along the way.\n“We have once again become a powerhouse in football, showing that despite all our problems, we have quality and character,” said Croatia coach Zlatko Dalic.\n“Now we need to stay calm and smart, not rush anywhere, towards that gold. That’s my great wish … bronze, silver and gold.”\nModric, who made his international debut in 2006, earned his 165th international cap against the Netherlands on Thursday.\nHe converted a penalty to help fire Croatia into the Nations League final with a 4-2 extra-time triumph, one step closer towards that elusive “gold”.\nThe midfield maestro pulled the strings for his country, getting the better of Barcelona’s Frenkie de Jong, but Manchester City’s Rodri will provide an even sterner test.\nCity’s Champions League final hero is the key piece in Luis de la Fuente’s La Roja, who are still finding their footing.\nJoselu’s later winner to help them beat Italy in Enschede calmed the storm around Spain and they can end a trophy drought of over a decade, with their last triumph coming in Euro 2012.\nWith Luis Enrique at the helm, they lost in the 2021 Nations League final against France, a couple of months after they defeated Croatia in a thrilling 5-3 triumph to reach the Euro 2020 semi-finals.\n– ‘Never tired’ –\nDespite having a richer history on paper, thanks to their 2008 and 2012 Euros wins and lifting the 2010 World Cup, as well as having a greater player pool to draw from, Spain will not underestimate Croatia or Modric.\n“Luka Modric is another example of a sportsman, a player that at his age still has that hunger and ambition to win things, he’s never tired of it,” said Joselu.\n“He’s an example for all kids out there and another sign that age means nothing.”\nThere are some reports Modric may retire from international duty after the Nations League but the player said he would decide his future after the tournament.\n“I always enjoy playing for the national team, it’s not because it could be my last competition or my last match,” said Modric.\n“Every single match, every training session is a joy. As long as I feel I can help, there’s no reason for me not to be here.”\nNations League victory could provide a triumphant moment to bow out on or prove the springboard for an assault on Euro 2024 next summer.\nModric has proved relentlessly he still has the legs to compete at the top level, playing 119 minutes against the Netherlands in the semi-finals.\n“Luka is unique, unrepeatable in the whole world, he is an icon wherever he goes,” said Dalic.\n“When he was substituted he received an ovation from the whole stadium.”\nCroatia triumphed in extra time, just as they did against Brazil and Japan in Qatar, and England, Russia and Denmark in 2018.\nSpain have had plenty of 120-minute plus games themselves in recent years but avoided it on Thursday thanks to Joselu’s strike.\nDe la Fuente hoped his players would recover in time for Sunday’s final after having a day less rest than Croatia.\n“Extra time wears you down but with a win, you recover more easily,” said the Spain coach.\n“This group of players have played so many games, but I’m very optimistic.”\nItaly face hosts the Netherlands in the third-place play-off match on Sunday afternoon.\nAFP",
  "word_count": 699,
  "scraped_at": "2026-02-14T02:07:02.890968",
  "_text_extracted": true
}