{
  "article_id": "96003d0cb048",
  "url": "https://www.westmeathexaminer.ie/2025/10/30/arne-slot-stands-by-his-team-selection-following-liverpools-carabao-cup-exit/",
  "title": "Arne Slot stands by his team selection following Liverpool Carabao Cup exit",
  "date": "20251030T074500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot stands by his team selection following Liverpool’s Carabao Cup exit\nBy Simon Peach, PA Chief Football Writer\nArne Slot stood by his decision to make sweeping changes to protect players despite Crystal Palace condemning Liverpool to a sixth defeat in seven matches as they bowed out of the Carabao Cup.\nHaving won the Community Shield on penalties and last month’s Premier League meeting at Selhurst Park, Wednesday evening saw the Eagles get the better of the Reds for the third time this season.\nIsmaila Sarr’s first-half brace put Oliver Glasner’s Palace in control, with Yeremy Pino’s first goal for the club wrapping up a 3-0 fourth-round win after Liverpool substitute Amara Nallo was sent off.\nSlot’s decision to make 10 changes and leave star players out of the squad backfired at Anfield, but the Reds boss does not regret his choice to prioritise the upcoming run of fixtures.\n“It’s always a blow to lose a game of football, especially if it leads to going out of a competition,” the Reds boss said.\n“But it’s the same selection I did tonight as I did last season in rounds like this.\n“There are many reasons maybe why we’ve lost six out of seven. None of them are good enough to accept losing so many.\n“I can come up with arguments or reasons but none of them will be enough to go to that standard because at Liverpool losing five out of six, six out of seven is always too much.”\nSlot explained how he wanted to keep key players fresh, pointing to the drop in standards from the sole win in Liverpool’s run at Frankfurt in the Champions League on a Wednesday night before losing on the Saturday evening against Brentford.\nThey face the same turnaround as they prepare to host Aston Villa, with the manager also pointing to the impact of the previous round against Southampton.\n“In two days we play Villa,” Slot continued. “The last time I played a player that we thought was ready for that programme, it turned out maybe that he wasn’t. It was Alexander Isak when he went out with an injury.\n“Last time we played Southampton, Giovanni Leoni went out with an injury in a game like this, and we got the red card for Hugo Ekitike after two yellows.\n“To add to that, this club has always used this competition for their academy players as well, so for the non-starters and academy players this felt to me as the right decision.\n“And I haven’t changed my opinion about that after the result because with our starters we haven’t been able to win a lot from Palace as well.”\nFA Cup holders Palace will travel to Arsenal in the quarter-finals after Glasner oversaw a comprehensive win at Anfield.\n“I’m not pleased with the first 15 minutes,” the meticulous Eagles boss said. “I told the players they look like we are still in the hotel beds.\n“But then, yes, we did much better. We controlled the game, scored very nice goals in the first half.\n“But on the other side I think we could have decided the game earlier. We had many situations that looked threatening but then the last pass, finish or decision was not good enough.\n“But overall, of course, when you win 3-0 at Anfield it’s a very good night for us, a very positive night and qualifying for the quarter- final is of course what we wanted.”",
  "word_count": 577,
  "scraped_at": "2026-02-14T01:52:49.010038",
  "_text_extracted": true
}