{
  "article_id": "960754014f75",
  "url": "https://www.caughtoffside.com/2024/07/19/eddie-howe-newcastle-united-star-showing-edge-sandro-tonali-return/",
  "title": "Eddie Howe says Newcastle star is showing an  edge  ahead of long - awaited return",
  "date": "20240719T224500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe says Newcastle United star Sandro Tonali is showing an ‘edge’ as his long-awaited return to action creeps ever closer.\nThe Italy international has been banned from football since October 2023 due to betting offences, although he has been allowed to train with the Newcastle first team during that time.\nTonali’s ban expires at the end of August, making him eligible for Newcastle’s home clash against Tottenham Hotspur on the 31st. If he plays, it’ll be the 24-year-old’s first time out on the pitch since a 25-minute appearance against Borussia Dortmund during the Champions League group stage on October 25th, 2023.\nThe midfielder’s return will offer a huge boost for the Magpies as they look for an improved campaign after failing to qualify for Europe altogether last season.\nHowe reveals Sandro Tonali ‘edge’\nTonali is currently training alongside his Newcastle teammates at the club’s pre-season camp in Germany.\nSpeaking to BBC Radio Newcastle from the camp on Friday, Howe believes Tonali is stepping up the gears as the excitement around his return to action starts to build.\n“I think he’s in a good place. I think he’s come back fit,” Howe said of the former AC Milan man.\n“I see a slight difference in Sandy now because he knows he’s close [to returning], and for a player knowing they’re not going to be picked for 10 months, that is very tough mentally to have that edge to your game.\n“His edge is there now because he knows it is around the corner. He will miss the start [of the season] but he’s a massive player for us.”",
  "word_count": 268,
  "scraped_at": "2026-02-14T02:10:58.964746",
  "_text_extracted": true
}