{
  "article_id": "963282218a76",
  "url": "https://www.90min.com/features/chelsea-fountain-youth-spiked-same-old-problems",
  "title": "Chelsea fountain of youth spiked by same old problems",
  "date": "20240901T161500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea's fountain of youth spiked by same old problems\n- Chelsea held to 1-1 draw by Crystal Palace\n- Blues have taken four points from opening three Premier League games\n- Enzo Maresca's young team still searching for maturity\nBy Sean Walsh\nFROM STAMFORD BRIDGE - Chelsea head into the September international break on a low after only managing a 1-1 draw at home to Crystal Palace.\nThe Blues were dominant on Sunday afternoon, but were punished for giving the Eagles a sniff of blood and they never really recovered.\nEnzo Maresca is still searching for some consistency after one month of competitive action as head coach. That's not unexpected or a cause for concern, however.\nIn fact, it appears he has tried to maintain as much momentum as possible from Chelsea's fine end to the 2023/24 season. Mauricio Pochettino had managed to trim down his gigantic squad into a core group of players, who then embarked on a five-match winning streak to clinch a top-six finish when all seemed unlikely.\nPochettino's surprise successor has largely kept much of that main group together, leaning on the on-pitch relationships built between Cole Palmer, Nicolas Jackson and the reinvigorated Noni Madueke to spearhead his attack.\nAlas, Chelsea are still running into the problems that plagued Pochettino's era. When the heads drop, they droop. When they lose control, their only hope of wrestling it back is to turn the game into an end-to-end affair.\nIn terms of personnel, it was hard to point fingers and say any one player was the problem, though their captain for the day, Enzo Fernandez, did lose his calm on the ball when his teammates needed a cool head to bring maturity to their performance once Palace had puffed out their chest.\nIn isolation, all of this is fine. That's part of being a young team. If you're BlueCo, that's bound to happen at the start of a five/ten/fifty-year process.\nAgain though, the question is about why Chelsea are doing all of this. No one forced them to rip up a team that had won the UEFA Champions League and FIFA Club World Cup. No one proclaimed a brand new identity had to look like this.\nIn the 21st century, Chelsea have been about winning at all costs. During the 2000s, they were the closest thing English football had to Real Madrid's star-studded Galacticos. The game is about winning now, winning forever. That flow has since dried up.\nPochettino felt the brunt of criticism last year when Chelsea failed to turn chances into goals, though given his connections with rivals Tottenham Hotspur, he was always fighting an uphill battle. Maresca, at least, is a blank slate and for sure a relatively fresh face to the Blues faithful. The patience with him may be stronger, the patience with the club used to winning less so.\nOne draw to Palace isn't the end of the world. There shouldn't be panic or alarm at Chelsea Towers. With the transfer window mercifully shut, Maresca may be able to focus on uniting his team rather than adding to it, the off-field noise should quieten.\nThe early signs are promising, though at some point of the club project, everyone will need to do some growing up.",
  "word_count": 542,
  "scraped_at": "2026-02-14T01:57:35.649167",
  "_text_extracted": true
}