{
  "article_id": "964b69918aba",
  "url": "https://mufclatest.com/predicted-xi-4-2-3-1-mount-sancho-to-start-on-the-wings-eriksen-to-play-alongside-casemiro-rashford-hungry-for-first-goal/",
  "title": "Predicted XI : [ 4 - 2 - 3 - 1 ] Mount & Sancho to start on the wings ? Eriksen to play alongside Casemiro ? Rashford hungry for first goal ? ",
  "date": "20230818T030000Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United face Tottenham Hotspur in London on Saturday evening in the Premier League – the first away match of the season. United beat Wolverhampton Wanderers 1-0 at Old Trafford on Monday evening and will be seeking to earn their first points on the road.\nUnited were not all that convincing in their victory over Wolves on Monday night but Raphael Varane opened the scoring this season with a header from an Aaron Wan-Bissaka cross into the box. There was some controversy though with a late penalty decision to be made.\nNew goalkeeper Andre Onana was deemed to have fouled a Wolves player in the box but nothing was given by the officials, leading to Wolves losing their opening Premier League match of the season which caused the ABU media to drone on about it all week.\nUnited will need to find some good early form to get the better of Spurs in their own stadium. It is important that United win their opening two matches, which will put them in good form ahead of the important fixtures coming up, including the start of the UEFA Champions League next month.\nPredicted Manchester United Starting XI – 4-2-3-1\nOnana;\nWan-Bissaka, Varane, Martinez, Shaw;\nCasemiro, Eriksen;\nSancho, Fernandes, Mount;\nRashford\nGoalkeeper: Onana\nAndre Onana made his United debut in the Premier League at Old Trafford on Monday night as he faced Wolves. He kept a clean sheet as United won all three points in the match with a 1-0 victory. There was some controversy late in the game though with a penalty shout.\nNothing was given in the end but that did not stop the ABU media from posturing negativity regarding United, which is what these sad individuals seem to do best because they have no other hot topics to talk about – even though City won the treble.\nOnana is a completely different goalkeeper to David De Gea and actually comes off his line to cut out chances, which will make United’s defence even better once everyone is settled with the new goalkeeper. This season could be good for United.\nOnana will continue to get better as he settles at the club and that will bring so much more for United, especially when they return to Champions League football next month. But first, beating Spurs should be on the cards for United and another clean sheet would be good too.\nDefenders: Wan-Bissaka, Varane, Martinez, Shaw\nThe defence has made some improvement over the last two seasons. Gone are the days of relying on Harry Maguire and Victor Lindelof in the centre of the defence. Now United have Raphael Varane and Lisandro Martinez to put themselves on the line to keep clean sheets.\nAgainst Wolves, Varane and Martinez started in the centre of the back four but the Argentinian was withdrawn at half time after he was booked and was carrying a minor ankle injury. He could be in like to start again for United against Wolves, or remain on the sidelines.\nIn the fullback positions, Aaron Wan-Bissaka and Luke Shaw started against Wolves. That will most likely be the case agianst Spurs as United seek to get six points on the board in the opening two matches of the season. Wan-Bissaka got his first assist this season against Wolves.\nVarane got his first goal of the season in the same match as United rose to get three points on the board. The liked of Lindelof, Maguire and Diogo Dalot could be on the bench should United need to change things up in the defence in the second half of the match on Saturday.\nMidfield: Casemiro, Eriksen\nUnited’s midfield has some great players in it this season but United do need more depth to carry the squad through the remainder of the season. United really need to be active in the transfer market to bring in more depth so players do not get fatigue.\nCasemiro is the player that picks himself in the midfield and he will start the majority of the matches this season, especially in the Premier League and the UEFA Champions League. The Brazilian has been a fantastic player at United over the past season – he does so much.\nChristian Eriksen should start alongside the Brazilian in the cneyre of the midfield against Spurs – his former club. The Dane is a top player and should he be rested properly throughout the season, there is no reason that he cannot be the live wire in the midfield.\nOf course, there will be other players to put their hat in the ring to to find a starting place in the midfield. Scott McTominay will be one of those players following the departure of Fred from the club this summer. Donny van de Beek is another name, but his departure could come soon.\nAttacking Midfield: Sancho, Fernandes, Mount\nUnited have capable players in these positions but against Wolves,it did not work as well as it perhaps could have. I believe that against Spurs, Ten Hag will need to make some changes to get the best out of his team. It will also aid in getting players up to spec for the season.\nJadon Sancho came on late against Wolves and was an improvement. He has had a good pre-season and looks hungry this season – a season that could be his last chance at the club to shine. he achieved a lot at Borussia Dortmund but so far at United, he has declined.\nBruno Fernandes should keep his place in the centre of the three behind the striker but he too will need to put in a better performance that what he did against Wolves. The captain of the club will need to lead from the front, which is something he can do very well.\nAlejandro Garnacho and Anthony were not the best against Wolves, which was an off day for the duo. They could keep their places of be rotated, which would send the right messages. Mason Mount may benefit playing further forward, this time on the left-wing.\nForward: Rashford\nMarcus Rashford is not a striker but with United so short on attacking players at this time with injury, it is likely that he will continue to lead the line – despite the fact he does not look like scoring in the forward position anytime soon. It could change though – maybe!\nRashford got himself 30 goals last season and will need to continue to find numbers like that this season. Can he do it? Who knows! But I am sure that he will be seeking to make his mark in the Premier League and beyond again this season.\nAnthony Martial is a player that does do some good things when he is fit but last season showed that him being fit was a rarity that will need to change this season. Martial is a player who can lead the line for United on a good day but there have been plenty of bad days for him.\nUnited will be so much better when Hojlund is in the team, has found his feet and is banging the goals into the back of the net – which is what he has been brought to Old Trafford to do. United have needed a young and hungry striker like him for years now.\nSubstitutes: Henderson; Lindelof, Maguire, Dalot; Pellistri, McTominay; Martial, Antony, Garnacho\nUnited continue to have nine substitutes on the bench in the Premier League this season, which will help with player freshness and allowing fringe players to play important minutes in matches in the league. Dean Henderson looks set to keep his place on the bench at this time.\nIn the defence, Victor Lindelof, Harry Maguire and Diogo Dalot could all be contesting to make their mark against Spurs in this match – that is if Lisandro Martinez is fit enough to start the match, which is a 50/50 shout at this time – but could change ahead of the match.\nIn the midfield, Facundo Pellistri and Scott McTominay could have some involvement in this match. McTominay could start this match instead of Eriksen, but the Dane is the player I picked to start alongside Casemiro. It could be an interesting match to watch.\nIn the attacking places, United still wait to see their new striker, Rasmus Hojlund make his debut, which could happen in the next week or so after this match. In which case, Anthony Martial, Antony and Alejandro Garnacho should be on the bench to add some attacking impetus.\nWritten by John Walker\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 1443,
  "scraped_at": "2026-02-14T02:00:36.665313",
  "_text_extracted": true
}