{
  "article_id": "965600b6cde6",
  "url": "https://www.arsenal.com/news/odegaard-proud-saka-martinelli-and-recent-wins",
  "title": "Odegaard proud of Saka , Martinelli and recent wins",
  "date": "20250423T104500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Before every game at Emirates Stadium, Martin Odegaard lifts the lid on the mood in the camp via his captain’s notes published in the matchday programme.\nAhead of this evening's game against Crystal Palace, the skipper reflects on an incredible night at Real Madrid, Bukayo Saka bouncing back in that game, Gabriel Martinelli wrapping up the win, and our outstanding display at Ipswich Town. Here is a snippet:\nLast week at the Bernabeu was very special. We had the feeling after the first leg that we could go to Spain and win there as well, and that was basically the thought we had in our heads when we left the dressing room ahead of the game last week. We were so up for it and we felt completely ready to beat them again.\nBut if you go away to Real Madrid and want to win there, then you have to be properly on it. It’s a stadium that’s special in terms of history and they’ve had a lot of crazy games and results there – especially in the Champions League. So it was about staying focused, doing our own thing and making sure we win the game again.\nI was so pleased that we had the courage to play our own game in the Bernabeu. A lot of teams go there and end up not doing anything, but in the second half especially we used the ball more and you could see the space open up.\nBukayo scored our first goal, and that tells you everything about him and his personality after he had his penalty saved in the first half. It’s part of football – sometimes you miss and I just said to him to keep going. I looked at him and he was focused again straight away. I knew he would bounce back and he really did! That’s his character though, and he helped us win the game in the end. I’m so proud of him for how he managed that, and how he stayed completely calm.\nThe second goal, which was a really special moment. Real Madrid were obviously pushing to score so we knew we’d have chances on the counter and that there would be extra space at the end. But the way Gabi sprinted like that! At the end of a big, big game, to find the power and speed to do that is just unbelievable really. The pass from Mikel too was so good.\nThen we had a very different challenge a few days later at Ipswich Town, but we needed the same focus in both games. We found each other really well on the pitch and that’s how we want to play – mainly in the opposition half. We created a lot from the first whistle, that’s what we want and then I enjoy my game more too. It was good to be involved a lot and it’s my assist for the first goal on paper as well!\nLet’s keep that same level and focus for tonight’s game against Crystal Palace. We want that momentum now, and to keep doing our job in every game. Then we will see how it goes. Every game for the rest of the season is big, so let’s get the win today and take a good feeling into the semi-final next week.\nRead the rest of Martin's notes, as well as a host of other fantastic content, by buying the Arsenal v Crystal Palace programme either around the stadium or online.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 611,
  "scraped_at": "2026-02-14T02:09:01.864056",
  "_text_extracted": true
}