{
  "article_id": "9665d0553142",
  "url": "https://www.90min.com/posts/wilfried-zaha-true-feelings-unsuccessful-man-utd-spell",
  "title": "Wilfried Zaha reveals true feelings on unsuccessful Man Utd spell",
  "date": "20231003T181500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wilfried Zaha reveals true feelings on unsuccessful Man Utd spell\n- Zaha spent two unsuccessful years at Man Utd\n- The Ivory Coast international is now at Galatasaray after leaving Crystal Palace this summer\n- Galatasaray face off against Man Utd in the Champions League this week\nWilfried Zaha has insisted that he is 'not bothered' by his unsuccessful spell at Manchester United between 2013 and 2015.\nThe talented wide player was snapped up by Man Utd way back in January 2013, signing a five-and-a-half year deal at Old Trafford before being loaned back to Crystal Palace for the remainder of the 2012/13 season.\nHopes were high for Zaha when he joined up with the Red Devils, but the Ivory Coast international would go on to make just two Premier League appearances for the club before being loaned out to Cardiff City and then eventually sold back to Crystal Palace for just £6m.\nAfter nine hugely successful seasons at Palace, Zaha joined Galatasaray as a free agent during the summer with the hope of playing UEFA Champions League football for the first time in his career.\nHaving made his Champions League debut off the bench in the club's 2-2 draw with Kobenhavn, Zaha is now set to return to Old Trafford in gameweek two to face off against his former club Man Utd.\nSpeaking at a pre-match press conference, Zaha was asked whether or not his inability to break into Man Utd's first-team plans during his short stint at the club bothered him to this day.\n\"I'll be honest, when you look at my face do you think I am bothered at all? No. I went through a phase in my career, you either build from it or die. It built my character. I was determined not to let my career die out,\" he replied.\nZaha also discussed how he believes he's matured as a player since his spell at Old Trafford, and insisted that Galatasaray will be confident of 'dominating' his former club on Tuesday evening: \"You know that I have been at Manchester United before and played there a long time ago.\n\"This was 10 years ago. I am now 30 years old. I think I have matured as a player.\n“I don't know if you’ve watched Galatasaray matches before but we play in the loudest stadium in the world. When I talk to my friends, I don't talk about Manchester United but about what we can do as a team, how we can dominate them with our own game. This is what we want to do against Manchester United.\"",
  "word_count": 432,
  "scraped_at": "2026-02-14T01:56:32.782461",
  "_text_extracted": true
}