{
  "article_id": "9674d8b794f6",
  "url": "https://www.teamtalk.com/manchester-city/kalvin-phillips-spectacularly-linked-barcelona-atletico-madrid-man-city-exit-next-week",
  "title": "Kalvin Phillips spectacularly linked with LaLiga duo as Man City prepare to finalise exit  next week  ",
  "date": "20240118T130000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nKalvin Phillips spectacularly linked with LaLiga duo as Man City prepare to finalise exit ‘next week’\nThe race to take Kalvin Phillips away from Manchester City remains open ahead of its imminent conclusion after a report claimed Barcelona and Atletico Madrid are now among his admirers.\nPhillips is eager to escape the Etihad Stadium this month after failing to earn many starts under Pep Guardiola since his arrival at Man City from Leeds United back in the summer of 2022.\nEuro 2024 is coming up in the summer and Phillips will want to make it into the England squad with the rhythm of regular gametime at club level under his belt.\nLeaving Man City seems to be the only way he will be able to achieve that, although a loan departure seems more likely in January for a player who cost £45m and is under contract until 2028.\nPhillips should still have plenty of suitors in the Premier League. For example, Crystal Palace manager Roy Hodgson has spoken openly of his willingness to take him to Selhurst Park for six months.\nHowever, TEAMtalk understands that Phillips’ preferred destination would still be Newcastle United.\nThose two clubs, as well as West Ham United, are referred to as interested parties in a report by the Daily Telegraph about Phillips’ future.\nThe Telegraph claims Phillips’ future ‘will be decided next week’ and drops a surprise revelation about Atletico Madrid and Barcelona also being in the race for his signature.\nPhillips has spent his entire club career in English football, but may have the opportunity to move to La Liga.\nOn the topic of a move abroad for Phillips, there was recently speculation about him joining Juventus, until the Serie A side ruled themselves out of the equation.\nWould Phillips fit in at either of his LaLiga admirers?\nIf Barcelona or Atletico Madrid make a move for him, he would have to weigh up if he would just find himself in a similar situation to what he is experiencing at Man City.\nThey have squads of a similar calibre, which might mean there would be the same kind of competition for places that Phillips is currently struggling to win.\nThat said, the defensive midfield role is one Barcelona have been trying to address since Sergio Busquets left for Inter Miami in the summer.\nGiven their limited resources in the transfer market, Barcelona’s bargain solution was to bring back former academy product – and ex-Chelsea and Southampton man – Oriol Romeu from Girona.\nHowever, they might class Phillips as an upgrade, even if taking him on loan would just represent a different kind of short-term solution.\nAnd at Barcelona, Phillips could reunite with former Leeds teammate Raphinha and ex-Man City captain Ilkay Gundogan, plus another old colleague from his current spell, Joao Cancelo.\nAtleti, meanwhile, sold Geoffrey Kondogbia to Marseille in the summer but none of their new signings at the time were midfielders.\nBarcelona and Atleti, like defending champions Man City, remain active in the Champions League ahead of the knockout rounds.\nThe Spanish sides each have Italian opponents coming up in the round of 16: Inter await Atleti and Napoli will be up against Barcelona.\nInvolvement in European football may be enticing, but as stated, Phillips will want to ensure his gametime is regular enough.\nGiven the calibre of clubs chasing him, staying in the Premier League might be more suitable, while it would not harm his visibility to Gareth Southgate either.\nAs is his preference, Newcastle seem to have the ideal mix of what Phillips is looking for next, in terms of the stature of the club and space in the lineup (due to the absences of Sandro Tonali and Joelinton).\nREAD MORE: Man City forward to return to former club as disappointing four-year spell under Guardiola nears end",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:17:18.387299",
  "_text_extracted": true
}