{
  "article_id": "9689da422ff9",
  "url": "https://www.fourfourtwo.com/features/the-top-10-most-goals-scored-in-a-single-premier-league-season",
  "title": "Erling Haaland eyes next record : The most goals scored in a single Premier League season",
  "date": "20230426T223000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erling Haaland breaks ANOTHER record: These are the players with most goals scored in a single Premier League season\nManchester City's Erling Haaland now holds the record for most goals scored in a single Premier League season – but who did he have to beat to get there?\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Premier League first started in 1992, and since then strikers have been scoring goals for fun.\nBut just how many goals have the league's most elite forwards scored in a single campaign?\nManchester City's signing of Erling Haaland in the summer of 2022 set the pulses racing. The Norwegian marksman had been setting scoring records around Europe, but just how would he cope with the standard of the Premier League week in, week out.\nThe answer, it turns out, is pretty well.\nHaaland is now the holder of the record for most goals in a single Premier League season.\nSo we thought we'd take a look at which legends he's had to overcome to claim that crown.\nOf course, for the opening three seasons of the Premier League era – 1992/93, 1993/94 and 1994/95 – teams played 42 games in a campaign, giving their marksmen more opportunities to increase their totals.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAnd every goal counts, so here at FourFourTwo we've scrutinised each of the last 30-odd years to reveal who has scored the most Premier League goals in a single season.\n10. 25 goals – Matt Le Tissier, Chris Sutton, Robbie Fowler, Les Ferdinand, Alan Shearer, Ruud van Nistelrooy, Thierry Henry, Harry Kane, Romelu Lukaku\nNine players have scored 25 goals in a Premier League season since its inception in 1992, with players from across three decades all managing the total. The list includes expected names, such as Alan Shearer, Thierry Henry, Ruud van Nistelrooy and Harry Kane, but Matt Le Tissier and Chris Sutton, from Southampton and Norwich, respectively, both achieved their totals in 1993/94.\nLukaku also comes somewhat as a surprise, the Belgian forward blasting home 25 while at Everton in 2016/17. The total still remains the largest of his Premier League career, and earned him a move to Manchester United off the back of it.\n9. 26 – Wayne Rooney, Robin van Persie, Sergio Aguero\nNot a bad trio of players lumped together who have scored 26 goals in a single Premier League season, the eighth-highest amount since 1992. Rooney tucked away his 26 in 2009/10, where he also picked up the PFA Player of the Year award due to stunning performances throughout.\nMeanwhile, van Persie's were scored during his debut season at Manchester United, helping the Red Devils on the way to the Premier League title that they had so narrowly missed out on the year beforehand.\nAguero's 26 came in 2014/15, and is the highest total the Argentine managed while at Manchester City. He took the golden boot award as a result, though silverware evaded his side that year.\n8. 27 – Thierry Henry, Wayne Rooney\nIt's no surprise to see Thierry Henry and Wayne Rooney already feature multiple times on this list, and scoring 27 league goals from August to May certainly isn't something to be baulked at.\nHenry produced his tally during the 2005-06 season, during Arsenal's final season at Highbury. Sending the iconic ground out on a high, Henry bagged a hattrick against Wigan on the final time the Highbury pitch would witness a competitive game of football.\nRooney's tally of 27 didn't quite have the same importance as Henry's did, unfortunately. Scored in the 2011/12 season, a few more goals and Manchester Untied might not have lost the Premier League title to Manchester City on goal difference. Eh, Wayne?\n7. 28 – Robbie Fowler\nRobbie Fowler failed to win a Premier League golden boot in his career, a puzzling statistic when considering he bagged 28 goals in the 1995/96 season.\nStill, \"God\", as he is affectionately known by Liverpool fans, notched two hattricks across the year, as well as four league goals against eventual champions Manchester United as he took Liverpool to the FA Cup final and third in the league.\n6. 29 – Didier Drogba, Harry Kane\nDrogba peaked in the 2009/10 season, and his 29 goals makes it clear as to how Chelsea managed to win the league and FA Cup double that year, too. With Drogba's help, Chelsea also became the first side to score over 100 goals in a Premier League season, as they converted five or more goals in a game on no fewer than six occasions.\nHarry Kane maintains the record of the best goal-to-game ratio in a single season (among players who have appeared in a notable amount of fixtures), scoring 29 goals in just 30 games in the 2016/17 season for Tottenham. Technically the most prolific strike performance across one campaign, Kane also managed to pick up the second of the three golden boots he has achieved so far in his career.\n5. 30 – Kevin Phillips, Thierry Henry, Robin van Persie, Harry Kane\nIn the 1999/00 season, Sunderland finished seventh and scored 57 goals overall. Kevin Phillips got more than half of those, an astonishing feat for someone appearing in their debut Premier League season.\nJoining Phillips with 30 goals are Arsenal duo Thierry Henry and Robin van Persie. For Henry, 30 goals in a Premier League season is the most he ever managed to achieve, and doing so in the season when his team went invincible certainly adds extra gloss to an illustrious season.\nWhile Van Persie didn't enjoy quite as much success when he scored 30 goals in 2011-12, Arsenal finished third and without silverware, the Dutchman truly announced himself in the Premier League as an elite striker. That summer he earned move to Manchester United, where he went onto take another golden boot and the Premier League title.\nFinally, Harry Kane scored 30 goals - the most he has achieved in a single Premier League season of his career so far - in 2017-18. Remarkably, his total still wasn't enough for the golden boot...\n4. 31 – Alan Shearer, Cristiano Ronaldo, Luis Suarez\nLuis Suarez notched an incredible 31 goals in 33 games in the 2013/14 season for Liverpool, nearly taking them to the title in extraordinary circumstances. While it wasn't to be, the Uruguayan missed the opening games of the campaign due to suspension but still went on to manage a goal-to-game record of 0.94.\nRonaldo, meanwhile, managed 31 goals in 2007/08 and a goal-to-game ratio of 0.91, making him just one of four players, alongside Suarez and record holder Harry Kane, to achieve a ratio greater than 0.9. The other is Didier Drogba, whose aforementioned 29 goals provided him with a tally of 0.91, too.\nShearer may not be able to join that exclusive club, but he did manage to smash in 31 goals on two separate occasions, at Blackburn in the 1993/94 and 1995/96 seasons. Although, on the first occasion he reached that tally, he did so in a 42-game season.\n3. 32 – Mo Salah\nMo Salah's simply superb 2017/18 performances saw him score 32 goals, at that time a record for a player in a 38-game season. Remarkably, he only achieved the feat scoring one hat-trick, highlighting how he consistently scored in the vast majority of the games he played.\nThe Egyptian joined Liverpool from Roma in the summer of 2017 to much dereliction, having previously failed to impress at Chelsea a few years before. However, Salah answered his critics and then some throughout the season, comfortably walking away with the golden boot and helping Liverpool to reach the Champions League final.\nWhile he has picked up three golden boots in total since his time in England, he has yet to match the unrivalled form he displayed during his debut year with Liverpool. It's not been too bad since, though, has it?\n1. 34 - Andy Cole, Alan Shearer\nAlthough both Cole and Shearer achieved the most goals in a Premier League season in 1993-94 and 1994-95 respectively, when teams played 42 games, their total of 34 goals in a single league campaign is still astonishing and understandably hasn't been beaten since the number of teams competing dropped to 20.\nCole set the benchmark first in 1993-94, which Shearer matched the following season while at Blackburn as he took the Lancashire club to the Premier League title.\nIs Erling Haaland the most serious threat to Cole's and Shearer's record? The early signs suggest he is. The most goals scored in a single Premier League season could be about to be blown out of the water.\n1. 35 – Erling Haaland\nJust how many can he get? Manchester City's Erling Haaland made the record for most goals in a 38-game Premier League season his own after a late strike against title rivals Arsenal with seven games left to play.\nThen he netted in the next two games against Fulham and West Ham to make his debut year in England the most goal-some in Premier League history.\nThat's right: in one single year he has left legends of yesteryear like Alan Shearer, Andy Cole, Thierry Henry and Sergio Aguero in his wake. Haaland 2022/23 season is officially the best ever goal return in the Premier League.\nAnd it's not over yet...\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 1738,
  "scraped_at": "2026-02-14T01:50:29.467755",
  "_text_extracted": true
}