{
  "article_id": "968c7fc3cbf6",
  "url": "https://www.france24.com/en/live-news/20230701-ex-arsenal-barcelona-star-fabregas-hangs-up-boots",
  "title": "Ex - Arsenal , Barcelona star Fabregas hangs up boots",
  "date": "20230701T183000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ex-Arsenal, Barcelona star Fabregas hangs up boots\nMadrid (AFP) – Former Arsenal, Barcelona and Chelsea midfielder Cesc Fabregas announced his retirement from football at the age of 36 on Saturday, revealing his plans to immediately go into coaching.\nIssued on:\nFabregas won the 2010 World Cup and two European Championships with Spain, two Premier League titles with Chelsea and La Liga with Barcelona.\n\"It is with great sadness that the time has come for me to hang up my playing boots,\" Fabregas wrote on social media.\n\"It has been a journey that I'll never forget,\" he added.\n\"From my first days at Barca, Arsenal, Barca again, Chelsea, Monaco and Como, I will treasure them all.\n\"I lived experiences that I never thought in a million years I would even come close to.\"\nFabregas set up Andres Iniesta to score the winning goal against the Netherlands in the 2010 World Cup final in Johannesburg.\nHe began his career in the Barcelona academy before joining Arsenal as a 16-year-old in 2003. He won the 2005 FA Cup with the Gunners and started the 2-1 loss to Barcelona in the Champions League final the following season.\nHe returned to Barcelona in 2011 and spent three years at Camp Nou before signing for Chelsea.\nFabregas left for Monaco in 2019 and spent the past season with Como in Italy's second tier. He will stay at the club to work with the reserve and youth teams.\n\"(It's) a club and project I couldn't be more excited about,\" said Fabregas.\n\"This charming football team won my heart from the first minute and came to me at the perfect time in my career. I will grab it with both hands.\"\n© 2023 AFP",
  "word_count": 286,
  "scraped_at": "2026-02-14T02:12:52.284180",
  "_text_extracted": true
}