{
  "article_id": "9699e0c8218f",
  "url": "https://metro.co.uk/2025/10/29/john-obi-mikel-makes-champions-league-prediction-arsenal-24558796/",
  "title": "John Obi Mikel makes Champions League prediction for Arsenal",
  "date": "20251029T160000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Obi Mikel believes Arsenal are capable of winning both the Premier League and the Champions League this season and claims Mikel Arteta has the best squad in Europe at his disposal.\nArsenal currently sit four points clear at the top of the Premier League and already hold a seven-point advantage over reigning champions Liverpool.\nArteta’s side have also made an impressive start to their Champions League campaign as they have beaten Athletic Bilbao, Olympiacos and Atletico Madrid without conceding a goal.\nObi Mikel, who won two league titles during his career with Chelsea, feels Arsenal are the standout candidates to win the Premier League this season and says the options Arteta has in his squad are ‘frightening’.\n‘This season I think it’s Arsenal’s to lose,’ Obi Mikel said on The Obi One Podcast.\n‘If Arsenal and Mikel Arteta don’t win the Premier League… the squad, the depth they have, is frightening.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘They have the best squad not just in the Premier League, not just in England, in world football right now. I bet you there’s no better squad depth than Arsenal’s.\n‘Not just talking about the eleven who start, what you have on the bench who come in and win games, Arsenal, there’s no better.\n‘Sometimes it’s not the starting eleven that wins you games, it’s who you bring off the bench, we’ve seen Arsenal.. Martinelli coming off the bench to win them games, Eze, Merino, Havertz is injured.\n‘It’s frightening and Mikel Arteta knows that, this is Arsenal’s title to lose. Deep down they know it’s the truth, this is the season for Arsenal to win the Premier League. City are not there, Liverpool are struggling, we [Chelsea] don’t have the experience to go and win the Premier League.\n‘We’re talking about the Premier League, I think they can go on to win the Champions League, this is how good Arsenal are.\n‘It’s scary, I’m telling you, the squad they have, the players they have, the way they are playing, and I can see a little bit of a mental shift, I think right now they believe, there’s something there, I can feel it now, finally Arsenal are ready.’\nArsenal have faced criticism over their playing style having scored just five of their 16 Premier League goals from open play this season.\nBut Obi Mikel believes Arteta has enough attacking options to not only rely on set-pieces.\n‘It doesn’t matter how you score, it doesn’t matter how you win games, it doesn’t matter how you win the title, just win,’ Obi Mikel said.\nMore Trending\n‘But if you have all these creative players, you have Declan Rice, Zubimendi, Eze, Gyokeres, Saka, Martinelli, Madueke… you can’t keep scoring from set-pieces. Find a way of getting those players to create chances to win games.\n‘This has been going on from last season, over-reliance on set-pieces, throw-ins, corner kicks, Gabriel flicking, Saliba flicking, that’s how Arsenal have scored their goals.\n‘But I’m not sitting there criticising the way they’re winning games, they’re entitled to win games whichever way they want to win games. But if you spend more than £1 billion over six, seven years, you’ve got to find a way of winning games from open play.\n‘Fair play to them, they find a way of winning games, they’re doing what they’re doing.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Martin Odegaard provides fresh injury update ahead of Arsenal vs Brighton\nMORE: Vinicius Jr issues statement after Xabi Alonso bust-up during Real Madrid vs Barcelona\nMORE: Premier League star banned from driving after two speeding offences in three months",
  "word_count": 667,
  "scraped_at": "2026-02-14T01:59:14.378063",
  "_text_extracted": true
}