{
  "article_id": "96dc280e9454",
  "url": "https://www.caughtoffside.com/2024/04/15/ian-wright-martin-odegaard-arsenal/",
  "title": "Arsenal midfielder Martin Odegaard described as  magnificent  by Ian Wright during defeat to Aston Villa",
  "date": "20240415T213000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Premier League title race took another major twist at the weekend when Arsenal and Liverpool both fell to defeat, while Manchester City destroyed Luton Town.\nAfter Manchester City smashed five goals past Luton on Saturday, Liverpool and Arsenal both had opportunities at home to leapfrog City. However, the Reds and the Gunners failed to make home advantage count and suffered crucial losses meaning the Premier League title is now in the hands of last season’s treble-winners Man City.\nArsenal’s recent defeat to Aston Villa has raised questions about Mikel Arteta’s tactical decisions and the potential impact of injuries on the team’s performance. Despite fielding a strong lineup, which included Kai Havertz in midfield alongside Martin Odegaard and Declan Rice, Arsenal failed to beat Aston Villa.\nOne notable moment came in the 79th minute when Arteta substituted off his captain, leading to a shift in momentum that saw Villa scoring two goals, ultimately sealing their victory.\nOdegaard’s substitution, initially thought to be tactical, was later revealed to be due to the player feeling discomfort, raising concerns about his fitness for upcoming crucial matches.\nIan Wright on “magnificent” Martin Odegaard\nDuring his time on the pitch, Odegaard impressed pundits and fans alike with his exceptional playmaking abilities, as noted by Ian Wright, who described him as “magnificent.”\nWright highlighted Odegaard’s skill in beating the press and creating opportunities in tight areas, showcasing his importance to Arsenal’s attacking game.\nHe told Premier League Productions: “When you press, you have got to beat the press and you have someone like Kai (Havertz) who is ready to go. Unfortunately, he didn’t get his touch right. They have shown they can do it in the right areas. He can do it in tight areas.”\nThe defeat to Villa leaves Arsenal trailing behind Manchester City and Liverpool in the title race, with the upcoming match against Wolves presenting an opportunity for redemption.\nHowever, the focus now shifts to the daunting task of facing Bayern Munich in the Champions League quarter-final second leg.",
  "word_count": 336,
  "scraped_at": "2026-02-14T01:51:24.800982",
  "_text_extracted": true
}