{
  "article_id": "96e39176ed9b",
  "url": "https://metro.co.uk/2025/03/13/joe-cole-names-manager-most-difficult-job-premier-league-22724448/",
  "title": "Joe Cole names manager who has  most difficult job in Premier League  ",
  "date": "20250313T214500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Football pundit Joe Cole has named the top-flight manager who he feels has the ‘most difficult job in the Premier League’ this season.\nThere are a few top-flight bosses who may feel their task is harder than some of their fellow head coaches this term, such as Ange Postecoglou.\nThe Australian is under huge pressure at Tottenham to bring success to the club with Spurs having gone 17 years without a major trophy and his job has been made notably difficult this term with a significant injury crisis.\nCole, though, did not pick Postecoglou and he also did not name Arsenal’s Mikel Arteta, Manchester United’s Ruben Amorim or Liverpool’s Arne Slot.\nThe trio of managers may also feel they have the most difficult job with Arteta under pressure to deliver a Premier League title after two narrow runner-up finishes to Manchester City across the last two campaigns.\nLike Postecoglou, Amorim has been tasked to turn around the fortunes of a struggling ‘Big Six’ club with problems on and off the pitch while Slot had big shoes to fill, succeeding legendary ex-Liverpool manager Jurgen Klopp.\nBut Cole has named Chelsea head coach Enzo Maresca as the Premier League manager with the most difficult job in the top-flight this term.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I think Enzo Maresca has got the most difficult job in the Premier League, because the expectations of the club weren’t quite married with where they were at the time [when he arrived],’ Cole told TNT Sports.\n‘If you remember back he had 27, 28 players who expected to be part of the team, he had to filter through that.\n‘He had to embed a playing style, under that pressure. So I think he’s doing a great job, and I think for them to be sitting four in the league and doing what they are in this competition (the Conference League) – brilliant.’\nThe Blues massively impressed during the first half of the 2024-25 campaign, with some tipping them as Premier League title challengers.\nSince then, though, Chelsea’s fortunes have turned, with the west Londoners now firmly in a battle to finish in the top four under Maresca.\nChelsea legend John Terry explained why his former club had suffered a ‘drop off’ under Maresca in the second half of the season earlier this month.\nSpeaking to DR Sports, Terry said: ‘Champions League, still a possibility? Who knows.\nMore Trending\n‘We’ve showed signs this year of being a really young squad I think. And I say that in terms of performances where you see a really good spell, then we’ve come off of it lately.\n‘It was always going to be one of those seasons for me, even when we started well I thought we’d have a little bit of a drop off and we have done that.\n‘Listen, Champions League has to be the minimum every year for me. When you’re playing at a top club like Chelsea the mentality has to be Champions League football year after year.’\nThe average age of the Chelsea starting XI in the Premier League (23.5) is lower than any other side in the top-flight this season.\nMORE: Ruben Amorim explains why he picked Ayden Heaven ahead of Victor Lindelof\nMORE: How Premier League can land fifth Champions League spot tonight for next season\nMORE: Arsenal vs Chelsea: Latest team news, predicted lineups and injuries",
  "word_count": 613,
  "scraped_at": "2026-02-14T02:02:35.605925",
  "_text_extracted": true
}