{
  "article_id": "96f3fd19f5fe",
  "url": "https://www.bbc.com/sport/football/articles/cewndg799yro",
  "title": "Manchester United : Paul Scholes says  quality not there  in Ruben Amorim side",
  "date": "20250915T234500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Quality not there - Scholes criticises Man Utd policy\n- Published\nManchester United legend Paul Scholes believes the club messed up badly with their summer transfer strategy and lack the quality needed to fit manager Ruben Amorim's controversial 3-4-3 system.\nThe Old Trafford side have made their poorest start to a league season since 1992-93 with four points from the opening four games.\nUnited's internal analysis concluded they would get greater improvement for their investment if they targeted the forward positions over the summer.\nBut despite spending £200m on Matheus Cunha, Bryan Mbeumo and Benjamin Sesko, so far they have only scored four Premier League goals - two of which were own goals.\nDespite the growing external unease around Amorim, not helped by United's 3-0 derby defeat by Manchester City on Sunday, senior officials remain fully supportive of the Portuguese.\nAs was the case after last month's shock Carabao Cup exit at League Two Grimsby, they remain convinced Amorim is the right man to restore the club's fortunes and prefer to look at the long-term picture rather than be swayed by current results.\nBut Scholes fears the issues are deep rooted and will not be easily solved.\n\"I don't think the quality is there,\" he told BBC Radio 5 Live's Monday Night Club.\n\"Whatever two out of the four or five they have got in [midfield] - Casemiro, Bruno [Fernandes], [Kobbie] Mainoo - whatever combination he seems to try doesn't seem to work.\n\"That's a big issue. I thought all summer the absolute priority was a centre midfield player with legs, who can play and can control a game.\n\"Goalkeeper was [also] a major issue. Did they really need to get to the Grimsby game to realise [Andre] Onana is not good enough?\n\"If Manchester United were not in the market for Gianluigi Donnarumma when he became available, that is criminal offence.\n\"The recruitment side went to buy forwards. That did need addressing, but did it need three of them? I'm not sure it did.\"\nMan Utd have 'got worse' under Amorim - Rooney\n- Published15 September 2025\nFor a different philosophy, you have to change the man - Amorim\n- Published14 September 2025\nWhere the Manchester derby was won and lost - tactical analysis\n- Published15 September 2025\n'He cannot carry on playing this way'\nChelsea visit Old Trafford on Saturday. Then comes a trip to Brentford - where United have conceded four times on each of their past two visits - followed by encounters with Sunderland and then Liverpool at Anfield, making the chances of a significant upturn in fortunes in the short term unlikely.\nScholes is not alone in believing United have no chance of reversing their fortunes unless Amorim changes his style, with all-time leading scorer Wayne Rooney believing his old side have \"got worse\" under the Portuguese, who replaced the sacked Erik ten Hag last November.\n\"He cannot carry on playing this way, he just can't,\" said Scholes, who won 11 Premier League titles and the Champions League twice in a 20-year career with the club.\n\"At some point there has to be a moment where he thinks, 'I have to change something because what I am doing now is not working and I am not getting results'. The proof is there.\n\"I like Amorim, with everything he says, he seems to be a likeable man. But unfortunately results paint a picture.\n\"At this moment in time it isn't good enough. At this moment in time if results don't improve, performances don't really matter that much. He has to win some games or the pressure is going to come on him massively.\"\nFollowing last season's struggles, where United finished 15th in the league and lost the Europa League final to Tottenham, Amorim worked hard in the summer trying to create a harmonious dressing room culture.\nWhile there are some within the United squad who are thought to be uneasy about the 40-year-old's refusal to change his tactics, there is no sign of widespread discontent as yet.\nThe optimism around Amorim is not confined to the Old Trafford boardroom.\nJoao Noronha Lopes, favourite to win the Benfica presidential election on 25 October, is thought to be keen on bringing him back to the club where he made his name as a player, making 154 appearances across six seasons.\nLopes was at Etihad Stadium for Sunday's derby, where he was accompanied by Pedro Ferreira and Nuno Gomes, the former Portugal and Benfica forward, who is one of Amorim's closest friends.\nSpeaking to Portuguese media before the group left for Manchester, Gomes spoke about the prospect of hiring him.\n\"I can't answer that question,\" he said. \"Ruben Amorim is the coach of Manchester United.\n\"But one thing I do know, Ruben Amorim will be the coach of Benfica one day.\"",
  "word_count": 802,
  "scraped_at": "2026-02-14T01:55:21.391844",
  "_text_extracted": true
}