{
  "article_id": "96f507c46b0b",
  "url": "https://www.palatinate.org.uk/as-long-as-the-colour-of-your-skin-is-more-important-than-the-brightness-of-your-eyes-therell-be-war/",
  "title": "  As long as the colour of your skin is more important than the brightness of your eyes , therell be war  – Palatinate",
  "date": "20241107T123000Z",
  "domain": "palatinate.org.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘As long as the colour of your skin is more important than the brightness of your eyes, there’ll be war’\nBy Joseph Saunders\nSo said Vinicius Junior in response to Pedro Bravo’s comments on late night Spanish show ‘El Chiringuito’, over two years ago. The contributor had said ‘If you want to dance samba, you go to Sambadrome in Brazil. Here, what you have to do is respect your fellow professionals and stop acting like a monkey’, leading to the show distancing itself from Bravo.\nDuring his time in Spain, Vinicius has endured around twenty racist incidents; these were only the ones to reach mainstream news, of course. But in the wake of Rodri’s triumph at France Football’s Ballon D’Or ceremony, Vini Jr. has seemingly felt betrayed, invoking his quite literal trials and tribulations surrounding discrimination as a primary reason for his failure.\nThe strange thing is, is that this is no failure at all. At 24 years old, the Real Madrid winger has been named as the second best player in the world, following a season where his team won the Champions League and went the entire league season with one defeat.\nIf Vini’s personal contribution to these accolades is isolated, his effectiveness can be heavily scrutinised. In the league, the Brazilian scored fifteen goals and made six assists. In the top fifteen leagues in the world, that left him ranked 61st in goal involvements, sitting between Jean-Phillipe Mateta and Andrej Kramaric. That’s only one more than Kai Havertz and four more than Rodri. From this, it seems a miracle that Vini was even considered for such a prestigious award as the Ballon D’Or. And yet, it doesn’t tell the whole story.\nMany point to Vinicius’ Champions League exploits as to why he should have claimed the top prize. The deciding goal in the final was accompanied by both goals in the first leg of the semi-final against Bayern Munich. He ended the competition as equal third top scorer with six goals.\nRodri’s success with Spain at the European Championships did wonders for his chances. The Manchester City midfield man is the first Spaniard to lift the trophy since Luis Suarez (not that one) in 1960, the first defensive-minded player since Fabio Cannavaro in 2006, and the first Premier League player since Cristiano Ronaldo in 2008. The idea that he was favoured due to prior trends is fantastical.\nIn fact, Rodri’s triumph is an interesting lesson. By noting his absence from the Premier League’s eight-man Player of the Year shortlist, France Football voters are clearly swayed by international performances, perhaps due to their recency when submitting their ballot. Vinicius was ineffective during Brazil’s run to the Copa America final, and his total of five goals for Brazil is a huge disappointment on a largely elite CV in his young career.\nOne match that exemplifies the entire debate was the friendly between Spain and Brazil back in March. Organised to raise awareness of racism, the match itself was a blockbuster, finishing 3-3. And yet despite being at the centre of attention pre-match, at the intersection of the Spanish and Brazilian football federations, Vinicius was shown up on the international stage. Subbed off after little impact, the winger watched Rodri scored twice and made the headlines.\nBut I believe the ire that has led to such a public shunning of France Football’s decision from Real Madrid comes from a place of entitlement. Multiple reports suggested Vinicius would be the recipient of the award a month or so ago, and he will have bought into the decision too. Having the pinnacle of a football career ripped away from you is something none of the audience will be able to relate to. But racism still has a very significant role in this story.\nMany in Madrid’s first-team squad are young and black. Eduardo Camavinga and Aurelien Tchouameni were vocal in their support of Vinicius and his sentiment of betrayal, whilst Kylian Mbappe and Jude Bellingham, both of mixed race, complied with Madrid’s last-minute decision to boycott the award ceremony, despite the latter becoming the first Englishman in the top three since Frank Lampard and Steven Gerrard in 2005. Manager Carlo Ancelotti also left his Coach of the Year award sitting in a dusty Paris cupboard as he stayed in Spain.\nIf the award ceremony itself wasn’t racist, the fallout certainly has been. Groups of Valencia fans were concocting a racist chant to use against Vinicius Junior this weekend, though their game against Madrid is likely to be postponed due to deadly flash floods in the region. Thousands of comments and tweets on social media have ridiculed Vinicius for his tenacity in the face of such racist comments, demanding he ‘shows more respect’. Vinicius is one of the strongest characters in modern football. The commonly perpetuated ideal of subservient and obedient black players is extraordinarily yet covertly racist, and history has shown how lauded they are when they smile and drive a mini. The white elite in Spain don’t like black players who dare to publicly deconstruct their bigoted motives, then score three goals for the biggest club in the world the next weekend.\nMoreover, public outcry from both sides of the debate has been disproportional. Individual awards are subjective and no player deserves to be trolled for receiving any accolade – they can only compete for it. What really should be blamed is the reporting. False stories about the winner are either very poor journalism from usually elite reporters, or a deliberate ploy by France Football to throw the media off the scent of the winner and create a surprise. Hopefully they will see from the problems they have caused how damaging this has been to their integrity as an organisation.\nAnd as for Vinicius Junior, he has vowed to ‘do it ten times over if he has to. They’re not ready.’ I want to see the same fire in the belly that brought that dazzling footwork from Rio to Madrid and earn the Ballon D’Or inarguably; I want to see him continue his activism, following a successful trial to jail his abusers; I want to see him stick to his ethos:\n‘I’m not a victim of racism. I am a tormentor of racists’.\nImage: UNESCO Headquarters Paris via Flickr",
  "word_count": 1047,
  "scraped_at": "2026-02-14T02:08:26.322313",
  "_text_extracted": true
}