{
  "article_id": "96fae9719b77",
  "url": "https://impactnottingham.com/2025/01/fa-cup-third-round-preview/",
  "title": "FA CUP THIRD ROUND PREVIEW - Impact Magazine",
  "date": "20250103T163000Z",
  "domain": "impactnottingham.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kian Gadsby\nThe world’s oldest domestic cup competition is back this weekend, with this round marking the entry of the Premier League and Championship clubs. As usual, the FA Cup presents the exciting opportunity to see lower league sides compete with those at the top.\nThe draw this year has provided some memorable trips for some sides, creating opportunities for upsets.\nThe Big Ties\nThe FA Cup is all about the potential of a big side being shocked by a lower ranked team, with such results being etched permanently into folklore. Four of the so called “Big 6” have potential banana skin ties, and the other two play each other, ensuring that these matches could go down as cup classics.\nManchester City vs Salford City\nIn a Greater Manchester derby, Manchester City host Salford City. The League Two outfit are famously owned by members of Manchester United’s class of 92, and currently sit 4th, having won their last five.\nThe four-in-a row Premier League champions are still in a dreadful run of form, and with an injury crisis, this game represents an opportunity for Salford to spring a massive upset.\nTamworth vs Tottenham Hotspurs\nThe long throws of Tom Tonks will threaten the Tottenham defence\nTamworth, who featured in my two previous FA Cup round previews, host 8-time FA Cup winners Tottenham Hotspur. The National League outfit overcame League One sides Huddersfield Town and Burton Albion to reach the third round. The long throws of Tom Tonks will threaten the Tottenham defence, who have faced many injuries in recent weeks and have been conceding regularly, including suffering a 3-6 defeat against Liverpool.\nChelsea vs Morecambe\nChelsea have been resurgent this season following a disappointing recent history. They sit fourth in the Premier League and will hope to see their good season continue. Although they are also competing in the UEFA Conference League, the Blues have a deep squad and will expect to be challenging on multiple fronts at the end of the season.\nTheir opponents in this round are Morecambe. At the time of writing, Morecambe are second bottom of League Two, having recently fallen on financial hardships. This is the second time this decade that the Shrimps have visited Stamford Bridge in the Third Round of the FA Cup, with Chelsea emerging as 4-0 victors in 2021.\nLiverpool vs Accrington Stanley\nLiverpool topped the Premier League at Christmas, and they welcome Accrington Stanley to Anfield. The favourites are in ruthless form, currently in the League Cup semi-finals and perfect in the Champions League as well as top of the Premier League.\nThis fixture has never been played before but was famously referenced in a Milk Marketing Board advert encouraging children to drink milk. Stanley, who are just outside the relegation zone of League Two, will be hoping people are no longer asking, “Who are they?” after this match.\nArsenal vs Manchester United\nThe other two members of the “Big 6,” Arsenal and Manchester United, face each other at the Emirates. These two sides are the only two in FA Cup history to have won the competition more than 10 times, and both will be hoping to progress all the way once again.\nThe defending champions will hope they can pick up form\nArsenal have just suffered the serious blow of an injury to Bukayo Saka but seem to be finding their form again and are currently second in the Premier League. Manchester United keep suffering surprise defeats and are firmly in the bottom half of the table, with new manager Ruben Amorim claiming they are facing a relegation battle. The defending champions will hope they can pick up form, as a cup run may represent their best opportunity to qualify for European football.\nOther Stories\nWhilst the Big 6 take up most of the media attention, and this draw has given them exciting ties, there are many other FA Cup stories brewing. Many Premier League sides face lower league opponents, creating many opportunities for surprise results.\nEverton host Peterborough in what might well be their final FA Cup match at Goodison. The Posh are on a poor run of form in the league, but their exciting style of play will create an entertaining game against an Everton side who have shown weaknesses in defence.\nStockport County visit Selhurst Park hoping to knock out Crystal Palace. The reigning League Two champions were playing in the National League North less than 10 years ago, and the trip to the capital will be a tremendous day out for them. Palace are struggling this season, sitting only five points outside the relegation zone.\nIpswich Town host Bristol Rovers. This was a League One fixture as recently as 2023, where the Gas snatched a point which threatened to derail Ipswich’s promotion hopes.\nNewcastle are hoping to end their silverware drought this season and will eye the FA Cup as an opportunity to do so\nNewcastle United will take on Bromley. The visitors are playing in the third round of the FA Cup for the first time in their history, following their first ever promotion to the Football League. Newcastle are hoping to end their silverware drought this season and will eye the FA Cup as an opportunity to do so.\nMillwall will host Dagenham and Redbridge in a London derby. Dagenham had to get past League Two sides Crewe Alexandra and AFC Wimbledon to get here. The Den is known for its intimidating atmosphere, and newly appointed Millwall boss Alex Neil will hope to use this match as an opportunity to get the fans onside.\nReplays Scrapped\nAlthough this topic will require a longer form article, it should be noted that this year is the first time since their inception that the FA Cup third round won’t have a replay. As a supporter of the Football League, I believe that replays being scrapped is a tragic decision for football.\nWhilst this topic will likely be more prominent after the third-round matches have been played, the impact after the first two rounds has already been profound. Harborough, Kettering, Weston-Super-Mare, Guiseley and Maidenhead are all non-league sides who have been denied the opportunity to earn a replay with football league sides.\nClubs in the lower levels of the football pyramid need financial protection\nThis will result in major losses of revenue, due to reduced shares of gate receipts and the loss of television broadcasts. Clubs in the lower levels of the football pyramid need financial protection, as many are loss making and in desperate need of funds.\nRegardless of the arguments of top players playing too many games, denying the lower ranked sides the opportunity to earn this revenue will harm them financially in the long run.\nKian Gadsby\nFeatured image courtesy of Edoardo Busti via Unsplash. Image use license found here (Unsplash). No changes were made to this image.\nIn article image 1 courtesy of @tamworthfc via Instagram. No changes were made to this image.?\nIn article image 2 courtesy of @emiratesfacup via Instagram. No changes were made to this image.?\nFor more content including uni news, reviews, entertainment, lifestyle, features and so much more, follow us on Twitter and Instagram, and like our Facebook page for more articles and information on how to get involved.\nFor further sports content and ways to get involved, follow @ImpactSport on Twitter and Instagram, and like the Impact Sport Facebook page!",
  "word_count": 1233,
  "scraped_at": "2026-02-14T02:02:19.855577",
  "_text_extracted": true
}