{
  "article_id": "97092dfdd3b3",
  "url": "https://metro.co.uk/2026/01/26/premier-league-icon-slams-arrogant-ruben-amorim-manchester-united-failure-26532915/",
  "title": "Premier League icon slams  arrogant  Ruben Amorim for Man Utd failure",
  "date": "20260126T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Manchester United show great signs of life again since the dismissal of Ruben Amorim, the former Red Devils manager has been slammed for his ‘arrogance’ while in charge.\nAmorim was sacked earlier this month after a 1-1 draw with Leeds United, not because of the result, but after an outburst in a press conference which revealed a clash with the Manchester United hierarchy.\nResults didn’t immediately pick up, with caretaker boss Darren Fletcher drawing with Burnley in the top flight and losing to Brighton in the FA Cup.\nHowever, since Michael Carrick has arrived in an interim role for the rest of the season, things have changed spectacularly.\nA 2-0 win over Manchester City at Old Trafford was followed by a 3-2 victory over Arsenal at the Emirates on Sunday, with fans purring with excitement after two fine performances.\nThe Red Devils have climbed to fourth thanks to the back-to-back wins and a return to the Champions League looks a good possibility again.\nCarrick has switched from Amorim’s laboured 3-4-3 formation to a 4-2-3-1, which appears to have helped significantly, while he has also brought Kobbie Mainoo back into the starting XI after he dropped down the pecking order under the previous boss.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Premier League’s record goal-scorer, Alan Shearer, feels Amorim’s ‘arrogance’ let him down as he stuck to his preferred formation despite performances and results not improving.\n‘What on earth is Ruben Amorim sat doing, thinking, looking at those two performances? I mean honestly, I don’t know what he’ll be thinking,’ Shearer said on The Rest Is Football.\n‘It’s absolutely crazy [to not change his formation]. The arrogance to say, “No, I’m not doing any other thing. This is my way or the highway.”\n‘I mean, to not even shift or to accept that this is probably not working, “Maybe I should try something else.”\n‘He put all his eggs into that basket, and if that didn’t work, he was done. And it didn’t.’\nGary Neville feels the performances of two players over the last two games have been illustrative of the improvement since Amorim’s exit.\nSpeaking on his Sky Sports podcast after the win at Arsenal, Neville said Amorim had ‘conditioned’ people to think Mainoo could not play alongside Bruno Fernandes, but that is not the case.\n‘Kobbie Mainoo in midfield, to be fair, he’s not his absolute best today. But what you do see is a player,’ said the former Red Devils full-back.\n‘This idea, we were sort of conditioned to think that he couldn’t play with Bruno Fernandes in the team…. him or Fernandes. I mean, that’s wrong. That’s wrong.\n‘I think that Kobbie Mainoo is demonstrating that he can play the two in midfield, even with Casemiro, who is getting on a little bit now, but even he looks different in this last couple.\n‘They play nice little passes with each other. I’m absolutely delighted with the performances.’\nNeville also had praise for Patrick Dorgu, who he felt looked like ‘such an average wing-back’ under Amorim’s management, but has now scored two goals in two games playing further forward under Carrick.\n‘You can’t really say anything bad about him because he’s a willing runner, he always wanted the ball and worked hard under Ruben Amorim,’ said Neville.\n‘But you thought, what is he? And how is he going to get man United back to where they need to be?\nMore Trending\n‘The first time we saw a glimpse of what he could be was actually under Amorim when he played him as a wide right.\n‘I thought he could play a bit when he could play a bit higher up and had a player behind him, I thought he could be a good wide player and cause problems and get crosses in.\n‘Then Amorim put him back at wing-back and you thought, oh no. Looking at him now he’s obviously a winger, he’s obviously a winger.\n‘His goal was absolutely brilliant. Patrick Dorgu typifies what has happened at Manchester United in this last week.’\nMORE: Chelsea beat Manchester United to 17-year-old prospect from Championship strugglers\nMORE: Barcelona star sends message to Man Utd over £87m transfer\nMORE: Emmanuel Petit slams Arsenal fans for what they did after Manchester United defeat",
  "word_count": 761,
  "scraped_at": "2026-02-14T01:53:15.580402",
  "_text_extracted": true
}