{
  "article_id": "9712fefc0814",
  "url": "https://www.sounderatheart.com/2025/06/club-woparis-saint-germain-cwc-preview/",
  "title": "Club World Cup preview : Paris Saint - Germain",
  "date": "20250612T040000Z",
  "domain": "sounderatheart.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "First Europe, next the world. After recently winning the UEFA Champions League for the first time, Paris Saint-Germain could confirm their supremacy by going the distance in the Club World Cup.\nLuis Enrique’s team will face Atletico Madrid and Botafogo in Group B before meeting the Seattle Sounders on June 23. They will be one of the biggest attractions at this summer’s tournament.\nHow they qualified: Ranked as the second-best eligible team in UEFA’s four-year rankings.\nCoach: Luis Enrique\nDomestic league: Ligue 1 (France)\nHow they performed in 2024/25: Treble winners - UEFA Champions League, Ligue 1, Coupe de France\nTransfermarkt value: €1.05 billion\nGroup stage matches: vs. Atletico Madrid, June 15, noon; vs. Botafogo, June 9, 6 PM; vs. Sounders, June 23, noon\nKey players\nOusmane Dembele: Once maligned for his lack of consistency and work ethic, Ousmane Dembele has become the face of New PSG in 2025. The 28-year-old has been converted into a center forward, giving PSG the most fluid, interchangeable forward line in European soccer. Dembele is a legitimate Ballon d’Or candidate.\nVitinha: PSG’s midfield is a reflection of Lucho as a coach with Vitinha the pick of the bunch. The Portuguese international is a force of nature in and out of possession, giving the European champions cohesion across all areas of the pitch. One of the best midfielders in the world.\nAchraf Hakimi: Long considered one of the best attacking full-backs in the game, Lucho has instilled greater defensive nous in Achraf Hakimi. The Moroccan was a key figure for PSG as they won the Champions League for the first time, dominating the right wing in almost every match he played.\nDesire Doue: A star was born this season as Desire Doue broke through as one of the brightest young attackers anywhere in the world. The 19-year-old scored twice in the Champions League final and has been likened to Neymar. Get used to hearing his name. He’s a generational talent.\nGianluigi Donnarumma: While Gianluigi Donnarumma has been questioned at various points of his PSG career, the Italian goalkeeper was crucial in PSG’s run to Champions League glory. There aren’t many pure shot-stoppers on his level.\nRoster\nStyle of play\nPSG want the ball. And when they don’t have the ball, they want it back – quickly.\nThis is the way Luis Enrique sets up his team with the European champions most commonly in a 4-3-3 shape. In possession, PSG operate in a 2-3-5 with Dembele quick to drop deep in between the lines. This subsequently creates space for the likes of Doue and Khvicha Kvaratskhelia in the wide areas.\nThere’s fluidity across the forward line. Dembele, Doue and Kvaratskhelia all switch positions throughout the game, as do Vitinha, Joao Neves and Fabian Ruiz in midfield.\nHakimi and Nuno Mendes have the license to get forward from full back and even push into central areas when they can – see how Hakimi scored from inside the penalty box against Inter Milan in the Champions League final.\nOne fact to impress your friends\nTwo years after their founding in 1970, PSG split into two after the Paris city council demanded the club change its name to \"Paris FC.\" Paris FC was formed as a breakaway club while PSG were demoted to the French third division and stripped of their professional status. PSG would win two consecutive promotions and were back in Ligue 1 by the 1974-75 season and have now spent 51 consecutive seasons in the top flight.\nParis FC, meanwhile, were relegated two seasons after the split, and although they briefly worked their way back into Ligue 1, they spent most of the next 45 years in the French lower-divisions.\nIncidentally, Paris FC will be in Ligue 1 next season and have moved into a stadium directly across the street from the Parc des Princes. The siblings are now neighbors.\nHow likely are Sounders to get a result?\nNot very. It would be one of the biggest shocks in club football history if Seattle were able to stop the European champions from doing what they did to so many opposition teams in the Champions League this season.\nWhat are their chances of winning the whole thing?\nGood. Having lifted the Champions League trophy only a few weeks ago, PSG are arguably the favorites to get their hands on the Club World Cup as well. They’re the most complete team in Europe right now.\nWhat makes this team interesting?\nFor a long time, PSG were France’s Galacticos. They boasted a frontline of Lionel Messi, Kylian Mbappe and Neymar, yet became a cautionary tale of how not to build a roster. The biggest titles evaded them.\nNow that Messi, Mbappe and Neymar are gone, though, PSG have flourished. They still boast the highest salary budget in European soccer, but under Lucho the Parisians have an entirely different identity.\nPSG are young and hungry. They have also established a pathway between the youth ranks and the first team, as demonstrated by the likes of Ibrahim Mbaye and Senny Mayulu, the latter of whom scored in the Champions League final.\nParis is one of soccer’s most productive hotbeds and and PSG have finally planted their pipeline into the talent pool. This could be the start of an era of dominance.\nGraham Ruthven is a co-host on the Total Soccer Show. He has also written for the Guardian, New York Times, The Athletic and many others including his own newsletter, The Soccer Dispatch.",
  "word_count": 912,
  "scraped_at": "2026-02-14T02:11:36.668252",
  "_text_extracted": true
}