{
  "article_id": "9714dca0646b",
  "url": "https://www.geosuper.tv/latest/31662-erik-ten-hag-becomes-worst-modern-man-utd-manager-after-nottingham-forest-defeat",
  "title": "Erik Ten Hag becomes worst modern Man Utd manager after Nottingham Forest defeat",
  "date": "20231231T144500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nDecember 31, 2023\nManchester United suffered a 2-1 loss to Nottingham Forest in their 20th match of the Premier League (PL) on Saturday at the City Ground which has made things difficult for manager Erik Ten Hag.\nTen Hag has now had a worse start to a season than one of Man United’s worst managers this century, David Moyes, as the 20-time PL champions already witnessed their 14th loss of the season and there are still five months of club football left.\nThe Dutchman’s second season in charge has started to resemble Moyes’ time at the Manchester club, who was fired just 10 months after taking charge of the club after the legendary Sir Alex Ferguson called time on his managerial career.\nIn 2013/14, after 20 games in the league, United were seventh with 34 points, scoring 33 goals and conceding 24. Meanwhile, fast forward to 2023/24, after spending over £440 over two summers, Man Utd are also seventh, with 31 points and having scored just 22 goals and 27 conceded.\nTen Hag’s ongoing season is going much worse than Moyes’ first season with the club and the decision about his future with the club could be made by the new owners INEOS.\nINEOS’ sporting director Dave Brailsford was watching the match against Nottingham from the director’s box alongside Ferguson and the two didn’t look too pleased with the way the team played.\nMan United have also been knocked out of the UEFA Champions League (UCL) after finishing at the bottom of their group. Time is passing and Ten Hag will need to find answers before the club's management and fans decide to go behind his back and demand the Dutchman's sacking, like they did with their previous managers — Jose Mourinho and Ole Gunnar Solskjaer.\nDespite being one of the biggest clubs in the world, United last won a league title in 2013, which was the last season of the legendary Sir Alex Ferguson, while their last UCL win was in 2008, where they defeated Chelsea in the final.",
  "word_count": 343,
  "scraped_at": "2026-02-14T02:13:24.756401",
  "_text_extracted": true
}