{
  "article_id": "9731cfe6c9a9",
  "url": "https://www.bbc.co.uk/sport/football/67708087",
  "title": "West Ham 2 - 0 Freiburg : Mohammed Kudus and Edson Alvarez goals send Hammers into last 16",
  "date": "20231215T023000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "West Ham 2-0 Freiburg: Mohammed Kudus and Edson Alvarez goals send Hammers into last 16\n- Published\n- comments\nWest Ham sealed their place in the Europa League last 16 - avoiding a play-off against a side dropping down from the Champions League - with a confident win over Freiburg.\nKnowing a draw would be enough to clinch top spot in Group A, the Hammers led when Mohammed Kudus controlled Edson Alvarez's pinpoint pass on his chest before coolly slotting in.\nA solid start was further rewarded when Mexico midfielder Alvarez doubled the lead three minutes before half-time with a smart finish after a driving run.\nIt was his first West Ham goal since his summer move from Ajax.\nFrom that point on the Premier League side remained in total command and maintained their intensity in an assured performance.\nFreiburg, who are eighth in the German Bundesliga, offered little threat in response.\nThe visitors slightly improved in the final half hour, with Hammers keeper Lukasz Fabianski saving a curling shot from Ritsu Doan, but the defeat meant they finished second in the group behind the Hammers.\nWest Ham manager David Moyes said avoiding the play-off round was \"really massive\" for the club.\nWhy it was so important to avoid a play-off\nWhile West Ham and Freiburg were both already assured of playing European football in the New Year, the prospect of bypassing a play-off meant there was still a lot on the line at the London Stadium.\nFinishing top of the group meant the Europa League could be parked until early March and reduced the impact of two further games added to an already-packed fixture list.\nThe eight group winners go straight into the last-16 draw, which will be made on Monday.\nBut the eight runners-up must negotiate a two-legged tie against one of the sides who finished third in their Champions League group.\nSeven-time European champions AC Milan are a dangerous draw lurking in the pot, while Galatasaray, Benfica and Shakhtar Donetsk - all champions of their respective national leagues and well-versed in continental competition - would also be teams to avoid.\nOn the importance of swerving the two-legged play-off, Moyes told TNT Sports: \"It is really massive at the moment because of the amount of games we've got and the scheduling - it's so important for the players and the staff.\n\"We're going into a really busy period and our culture means we play a lot of games at Christmas.\n\"But it seems they are squeezing in other games where they can, which seems a bit ridiculous to be honest.\"\nAlvarez shows importance to the Hammers\nWest Ham knew a draw would be sufficient to finish top because it would give them a superior head-to-head record over Freiburg after a 2-1 away victory in October.\nNevertheless, Moyes had emphasised the \"magnitude of winning\" and his players responded with an energetic performance.\nThe Hammers were thumped 5-0 at Fulham in the Premier League on Sunday, having seen their preparations disrupted by a sickness bug ripping through the squad.\nAlvarez, 26, was one of the players who missed the defeat at Craven Cottage and returned to demonstrate his importance with a commanding display against Freiburg.\nSigned to fill the void left by talismanic midfielder Declan Rice's move to Arsenal, Alvarez showed his vision to incisively pick out Kudus' wonderfully-timed run for the 14th-minute opener.\nThe £35m signing further underlined his quality by driving at the Freiburg defence and exchanging neat passes with Jarrod Bowen before slotting past visiting keeper Noah Atubolu.\nAlvarez, who picked up a dead leg in the first half, was substituted after 54 minutes with Moyes having one eye on a hectic Christmas period for the Hammers.\nAsked about the impact of his summer signings including Alvarez and Kudus, Moyes added: \"It has started well and the longer we will be together it will work much better.\n\"We're still introducing players who are new to the league and new to playing with us. I think they've done well.\n\"We're not halfway through the season and they've made massive contributions.\"",
  "word_count": 682,
  "scraped_at": "2026-02-14T01:51:13.780267",
  "_text_extracted": true
}