{
  "article_id": "97343c9c8e0f",
  "url": "https://www.teamtalk.com/liverpool/josko-gvardiol-liverpool-jurgen-klopp-final-answer-rb-leipzig-chief",
  "title": "Liverpool transfer news : Jurgen Klopp gets final answer over pivotal signing as club chief reacts to interest",
  "date": "20230106T191500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool transfer news: Jurgen Klopp gets final answer over pivotal signing as Bundesliga chief reacts to interest\nRB Leipzig director Max Eberl has attempted to end the Josko Gvardiol transfer saga by saying the Liverpool and Tottenham target will not be going anywhere.\nGvardiol was the subject of a huge £77million bid from Chelsea in summer 2022. However, Leipzig view the centre-back as being integral to their plans and therefore rejected the proposal.\nThe decision has been justified by the fantastic campaign Gvardiol is having. He has been a rock at the back for the side as they hunt Bundesliga and Champions League glory.\nMarco Rose’s team sit third in the German top flight, six points behind reigning champions Bayern Munich. It will be tough for Leipzig to usurp the German giants. But there is still a chance of this happening if top players like Gvardiol continue to shine.\nLeipzig are also in the knockout rounds of the Champions League. Gvardiol managed one goal in four games as they finished second in Group F, behind Real Madrid. Leipzig will come up against Manchester City in the round of 16.\nGvardiol was a crucial part of the Croatia team at the World Cup. And his stock only rose at the tournament. He was one of the best defenders in Qatar as Croatia reached the semi-finals.\nThe only time the 20-year-old faltered was when he came up against Lionel Messi. The Argentine legend turned him inside out during one attack. It would be extremely harsh to judge Gvardiol on this though, given how good Messi was at the World Cup.\nGvardiol, who can also operate at left-back, will return to action when Leipzig resume their Bundesliga campaign with a huge clash against Bayern on January 20.\nTop player set for RB Leipzig stay\nAnd it is highly likely he will spend the rest of the season at Leipzig. Like in summer 2022, Eberl will not allow Gvardiol to go anywhere this month as he is so important to the team’s success.\nThe player has been linked with a move away from Leipzig for when the campaign ends, however.\nLiverpool, Tottenham, Manchester City and Manchester United are all keeping tabs on Gvardiol’s situation ahead of potentially massive bids for him.\nLiverpool in particular could probably do with signing the World Cup star. This is because Virgil van Dijk and Joel Matip are both 31, so Ibrahima Konate’s long-term centre-half partner needs to be found. Plus, Van Dijk is recovering from a hamstring injury and could be out for a longer period than initially anticipated.\nUnfortunately for Liverpool, as well as Gvardiol’s other suitors, it looks like he will not be going anywhere in 2023.\nMax Eberl says Leipzig ‘in control’ over Josko Gvardiol\nDuring a recent interview, Leipzig chief Eberl reacted to the transfer rumours by saying (via Fabrizio Romano): “Thanks to the contract extension with Josko, we are in control. The club has done an outstanding job.\n“Football has gone crazy, but our interest is zero that we want to sell Josko Gvardiol in the summer.”\nAs Eberl states, Leipzig are protected by Gvardiol’s new contract. It was signed in September and runs until 2027, putting Leipzig in an incredibly strong negotiating position.\nIt seems the likes of Liverpool and Spurs will have to identify other centre-back targets to improve their respective teams.\nOf course, there is still the possibility of Gvardiol moving to the Premier League in the future. He is on his way to becoming one of the best defenders in the world. Therefore, he will want to try himself out in England at some point.\nBut this probably won’t happen for a few years. It will be interesting to see if Liverpool or Spurs continue to monitor Gvardiol and pounce when he eventually decides to leave Leipzig.",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:16:35.985489",
  "_text_extracted": true
}