{
  "article_id": "974f9b2a53da",
  "url": "https://www.caughtoffside.com/2024/02/28/paul-merson-savages-chelsea-owners/",
  "title": "New Chelsea players are not good enough says Paul Merson",
  "date": "20240228T131500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Although Paul Merson can be something of an acquired taste for many, there are unlikely to be too many dissenting voices concerning his savage rant against Chelsea’s owners and an allegiance to London rivals, Arsenal, doesn’t even come into the equation.\nEver since Todd Boehly took over the club they have become a laughing stock.\nHow can you take a club seriously that sells a full XI of players during a summer window whilst simultaneously breaking the British transfer record and bringing in other players that don’t necessarily fit into the manager, Mauricio Pochettino’s way of doing things.\nNot to mention that there’s likely to be another fire sale of players this summer in order that the club can remain on the right side of Financial Fair Play.\nNo wonder Merson has really gone to town.\nPaul Merson hasn’t held back in Chelsea rant\n‘I said this months ago and I’ll say it again now, a lot of the players are not good enough to play for Chelsea Football Club, yet they are sitting on eight-year deals,’ he wrote in his regular Sky Sports column.\n‘It’s not long ago that Chelsea won the Champions League. People talk about the success of the club like it was 20 years ago. They won the Champions League three years ago, but the club are still asking for patience from the fans.\n‘It’s just not good enough.\n‘The main problem with Chelsea is that Pochettino has come into a club that has spent a lot of money to bring a lorry load of players in on eight-year contracts.\n‘The people that bought these players in: what were you thinking? We need to know but I’ve never heard any of them give an interview. All I hear is Mauricio Pochettino having to justify it, but he never bought these players in. He just got the manager’s job and has had to deal with the situation he finds himself in.\n‘But now they are stuck, and because of the mess they are in it looks like they will have to go and sell one of their best players in Conor Gallagher to get out of it. He’s come through the ranks, he’s a homegrown player and one of the club’s own, but he’ll make them a profit in terms of the Profit and Sustainability Rules. It’s shocking.’\nThe issue that Boehly may find in future is that he has to sell some of those players at a vastly reduced fee because other clubs just won’t be willing to match the salary/contract expectations of playing staff that are raking it in at the American’s expense at the moment.\nPochettino is likely to be the fall guy in all of this though the Argentinian can’t say he never saw it coming.",
  "word_count": 463,
  "scraped_at": "2026-02-14T01:56:44.616110",
  "_text_extracted": true
}