{
  "article_id": "97775674de99",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2023/10/1/23876477/chelsea-fcw-23-24-season-preview-fa-wsl-uwcl",
  "title": "Chelsea FCW 23 / 24 Season Preview : Who New ? Who Not ? And What to Expect This Season",
  "date": "20231001T204500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We are here once again at the start of another FA WSL season. Chelsea have claimed the previous four league titles, with another sizable haul of domestic trophies along the way. Though plenty of teams are improving, and did a lot of good business during the summer transfer window, so did Chelsea.\nChelsea FCW 2023-24 Season Preview\nTime is a flat circle, anyway here’s your 2023-24 Chelsea squad\nWhile late window deals put United, Brighton and Aston Villa on everyone’s mind when it came time to grades, Chelsea’s early window work still stands out. With a new season approaching (or underway, blame this writer’s expert level procrastination efforts), let’s look at your 2203-24 Chelsea FCW, line by line. (new players in bold)\nGKs - Ann-Katrin BERGER, Zećira MUŠOVIĆ, Hannah HAMPTON\nThis was the most curious position group of the summer for Chelsea, and perhaps the entire league. Chelsea not only signed Nicky Evrard (who is on loan at Brighton), but also Hannah Hampton, who’d been starting for Aston Villa, a team that finished 5th last season. Academy keeper Emily Orman, who was with the squad last season, is also on loan to play this season at Reading.\nIn the end, Chelsea ended up in a rational place, with three keepers, but tons of competition. Berger’s elite shot stopping and satisfactory distribution likely keeps her the presumptive starter. Muśović burst into super saiyan mode against the USWNT and became one of the stars of the World Cup, but some wobbly keeping in the more recent Nations League suggests she hasn’t quite taken the leap.\nHampton is the wild card. She’s just 22 but has enough quality to have been a regular starter in the WSL since she was a teenager, first with Birmingham, then Villa. Hampton’s primary attribute is her play with her feet. She has excellent passing range and can ping balls to either side of the pitch with consistent accuracy.\nHampton will need to improve in her positioning and shot stopping to grab substantial minutes at Chelsea, but her leaving Villa for Chelsea suggests she’s confident in her ability to make that happen.\nSTs - Sam KERR, Catarina MACARIO, Mia FISHEL\nThis is the portion of the program where your writer loses his damn mind. Look at that group, read the names then read them again. This is mad business from Emma Hayes, absurd, truly unreal and ridiculous, and I feel like Hayes did this for me, personally, and exclusively. You can’t prove otherwise therefore it’s true.\nOk now that I’ve recovered, let’s get into this. Macario’s inclusion here is only a reflection of Chelsea’s website, but I would be surprised if we ever saw her as a pure 9. Despite her squad number, she’s more likely to play the 10, or some version of a second striker.\nThe key thing with Macario is patience. She’s been out for over a year after tearing her ACL in June of 2022. Prior to that, she went straight from Stanford University to Lyon, started and led them in goals during her first full season, and was a key piece in downing Barcelona in the 2021-22 UWCL Final. Macario is one of the most talented footballers on the planet. Her reading of games and space is outrageous, her technique is excellent, her vision absurd.\nChelea lost Magdalena Eriksson and Pernille Harder to Bayern Munich, and as good as Harder is, Macario is one of the handful of replacements who’s better. Of course this is all contingent on full recovery from her ACL tear, which means we might not see her on the pitch for a month or two.\nMia Fishel is another intriguing signing. She’s just 22 but has already starred for Tigres in Liga MX Femenil, winning the golden boot and having a rather absurd goal per game ratio while in Mexico. Fishel’s game is most similar to Kerr’s, she’s great in the air, is comfortable dropping deep to hold the ball and contribute to buildup, and attacks space in the box well. Fishel had been overlooked by the USWNT’s old coach, but thankfully Hayes and Chelsea took note.\nAs much as Kerr would want to start every match and play 90, it’s not ideal during a long season, or for going deep into four competitions. Fishel will provide competition and a quality backup that will allow Hayes to not have to change her gameplan much.\nFWDs - Lauren JAMES, Guro REITEN, Fran KIRBY, Johanna RYTTING-KANERYD, Aggie BEEVER-JONES\nObviously I’m being a bit cheeky with bolding Fran Kirby’s name here, but we haven’t had a healthy Fran Kirby for a while so the judge decided it counts (it me, I am the judge).\nMolly Hudson of The Times recently released an interview with Kirby in which she detailed making the decision to miss the World Cup to opt for surgery to remove pieces of bone in her knee. It was not only a football decision, but a quality of life decision as well. The good news is, Kirby reports that it worked.\nWe know what Kirby can do when leading a team, she’s been crucial to Chelsea’s growth and is an elite talent whenever she steps on the pitch. A healthy Kirby with Lauren James and Guro Reiten is a quality, terrifying group. And academy product Aggie Beever-Jones is beginning to get more comfortable at this level after last season’s loan with Everton.\nMFs - Sophie INGLE, Melanie LEUPOLZ, Katerina SVITKOVA, Jessie FLEMING, Sjoeke NÜSKEN, Erin CUTHBERT, Jelena CANKOVIC\nChelsea have needed a dynamic defensive midfield presence for quite a few seasons. Obviously they’ve been able to make it work in the WSL, but for Hayes’s ambition to win the Champions League, a DM was needed. Unfortunately, Lena Oberdorf was impossible to pry away from Wolfsburg and Keira Walsh went to Barcelona.\nBut 22-year-old Sjoeke Nüsken certainly fits the mold. She plays with a calm confidence beyond her years, and is one of the brightest young stars at the position. She can also play center back, but in all the media around Nüsken’s unveiling, Hayes stated almost scoffingly that this was a midfield signing.\nA true defensive midfielder will allow Erin Cuthbert to be more maximum Erin Cuthbert, which should delight Chelsea fans and produce groans for opposition supporters. Nüsken can play in a double or single pivot, giving Hayes a ton of flexibility in how she uses the rest of her midfielders (plus Macario).\nGiven the cheat code that dominant defensive mids have become across modern football, securing one was likely going to be necessary to have a chance at the UWCL title. Nüsken is on a trajectory toward being that type of dominant, if she can get there in a Chelsea shirt, this team goes from being talented and entertaining, to an outright terror.\nFBs - Ashley LAWRENCE, Ève PÉRISSET, Niamh CHARLES, Jorja FOX, Cerys BROWN\nIn addition to a quality defensive midfielder, Chelsea have also needed to lock down both flanks. This repair began last summer with the recruitment of Ève Périsset, and ramped up even more with this summer’s signing of Ashley Lawrence.\nLawrence has been recognized as one of the best fullbacks in the world for years. She only turned 28 in June, and is still one of the absolute best in attacking and defending. The way she reads games is unreal, she’s rarely caught with space in behind, even though she is also adept at charging forward to supplement the attack.\nLawrence is predominantly right footed, but can play either flank. I don’t always love right footed players on the left unless the scheme calls for them to spend most of their time inverted, but Lawrence is an exception. She’s good enough with both feet to make it work, and her cutting inside will free up space for Reiten, who is deadly on her left foot with time and space. Expect Lawrence to slot in at LB while Périsset handles the right.\nCBs - Aniek NOUWEN, Millie BRIGHT, Kadeisha BUCHANAN, Jess CARTER, Maren MJELDE\nThere are no new signings to report among this group, even though captain Magdalena Eriksson is now with Bayern Munich. But Lawrence’s recruitment means that Jess Carter can spend more time at center back if need be. While this group provides a lot of flexibility to fill out a quality back three, expect a Bright-Buchanan pairing in a back four to be the most consistent.\nOn Loan\n- Maika Hamano (Hammarby, but returned to Chelsea after a shoulder injury)\n- Nicky EVRARD (GK, Brighton)\n- Emily ORMAN (GK, Reading)\n- Alsu ABDULLINA (LB, Paris FC)\n- Brooke ASPIN (ST, Bristol City)\n- Alejandra BERNABE (LB, Real Sociedad)\n- Charlotte WARDLAW (MF, Glasgow City)\n- Reanna BLADES (WINGER, Lewes)\n- Wieke KAPTEIN (MF, FC Twente)\n- Lexi POTTER (MF, Crystal Palace)\n- Lucy WATSON (MF, Crystal Palace)\nThe Loan Army isn’t just for the men’s team. Of the ones to watch here, Brooke Aspin is a talented, bullish young center back who’s only 18 but already an intriguing prospect. Alejandra Bernabe is an incredibly saucy left footed left back, who is excellent in attack but needs to make sure she can balance that with defensive awareness. Wieke Kaptein is not only a cool-ass name, she’s an 18-year-old star in the making.\nChelsea and Emma Hayes did brilliant business to address key part of the squad with pieces that can help immediately, and also well into the future. When/if fully fit, this will be the most talented squad Emma Hayes has ever coached. If they can get fit and remain healthy throughout the season and multiple competitions, there’s no limit to what they could accomplish. The only thing left to do now is watch, and marvel.\nMost games will be on Paramount+ in the U.S., with some likely being relegated to The FA Player.\nThis is a tremendously fun team, which should give us a tremendously fun season.",
  "word_count": 1655,
  "scraped_at": "2026-02-14T01:48:28.231608",
  "_text_extracted": true
}