{
  "article_id": "978d27afbc76",
  "url": "https://metro.co.uk/2024/02/22/arsenal-a-shadow-themselves-defeat-porto-says-rio-ferdinand-20325289/",
  "title": "Arsenal were a  shadow of themselve in defeat against Porto , says Rio Ferdinand",
  "date": "20240222T101500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United legend Rio Ferdinand says Arsenal were a ‘shadow’ of themselves against Porto and weren’t clinical in ‘any capacity’.\nThe Gunners conceded a 94th minute goal from Galeno that gives Porto a 1-0 aggregate lead going into the second leg at the Emirates.\nArsenal’s performance was below-par but a goalless draw would have been a fair result in northern Portugal.\nPorto limited Arsenal to few chances and the Gunners must win by two goals in London to go through to the quarter-finals.\nArsenal came into the game on the back of heavy wins against West Ham and Burnley, but they lacked belief in front of goal against Porto and Ferdinand says they were not themselves.\n‘I thought they played with an experience and they look hard to play against and it’s hard to beat, they made it hard in every department for Arsenal,’ Ferdinand told TNT Sports.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘In open play, Arsenal looked like a shadow themselves in the last couple of games. We’ve seen them in the Premier League. And it shows you that was against respectively West Ham and Burnley. This is Porto. This is the Champions League knockout stages, a very different setting altogether.\n‘But they tactically I thought they got it spot on, they were saying it’s up to Arsenal, you’re not gonna go through the middle of us, because it’s gonna be hard to get round the outside of us, and set pieces are gonna be your only route to go, and they weren’t clinical in any capacity today\n‘I thought they played with an experience and they look hard to play against and it’s hard to beat, they made it hard in every department for Arsenal.\nMore Trending\n‘But at this level, you’ve got to create chances, and you’ve got to get beyond teams and make them keepers work, and Arsenal never really got to that stage today.\n‘I think they would have been happy with 0-0 after the way the game panned out. But this is the level we’re at. When you get to knockout football Champions League, this is the top level.\n‘And you can come away to Porto and say they aren’t doing well domestically and people go, you know what, we get a two or three nil game, you have to approach this game, right?\n‘And you have to carry out the manager’s plans to a tee and if you make mistakes, if you give the ball way at this level, you get punished because the quality here is the highest of the highest.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsene Wenger makes bold claim over Arsenal star Bukayo Saka\nMORE: Paul Merson names the Arsenal star who ‘could have a field day’ against Newcastle\nMORE: Newcastle receive double injury boost as duo return to training ahead of Arsenal showdown",
  "word_count": 540,
  "scraped_at": "2026-02-14T02:17:18.384082",
  "_text_extracted": true
}