{
  "article_id": "97967fb454c4",
  "url": "https://www.nytimes.com/athletic/5830617/2024/10/19/modric-real-madrid-croatia-dinamo-tottenham-chelsea/",
  "title": "In appreciation of Luka Modric , the magician about to become Real Madrid oldest - ever player",
  "date": "20241019T053000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luka Modric was on the ball, scanning and planning, flowing through midfield. That liquid force, like rushing water.\nModric was only 21, yet in the midst of a crowded, tense Euro 2008 qualifier between Croatia and Russia, he was already supplying compelling evidence of the elegant muscularity that would carry him free over tackles and across midfields for two decades.\nAdvertisement\nIt was June 2007, in the smoky, atmospheric Maksimir stadium in Zagreb, the discarded shells of the sunflower seeds fans nibble in eastern European grounds all around. For some of us, it was our first sighting of Modric in the flesh.\nAnd he stood out; because he stands out.\nThis was thick-traffic football and Modric was part of the starting and stopping. But he was also apart from it — pausing, thinking, keeping the ball safe — like all the great players. He sees a different route. “Sophisticated geometry,” was how talismanic AC Milan and Croatia midfielder Zvonimir Boban described Modric’s vision and passing.\nWhile it may sound a lot to deduce from the stands of the Maksimir that warm evening, Slaven Bilic in the home dugout, Guus Hiddink presiding over the visitors’ one, even those 90 minutes of Modric told us he would see new horizons.\nAnd, of course, he has and he does.\nMore than 17 years on from that day and 21 years from his first loan spell from Dinamo Zagreb in Mostar, Modric will over the next week become the oldest player ever to kick a ball for Real Madrid since their founding, as Madrid Football Club, in 1902. It is a serious achievement.\nToday in Vigo in La Liga, against visitors Borussia Dortmund in the Champions League on Tuesday, or amid the steam of El Clasico in Madrid next Saturday, Modric will surpass the great Ferenc Puskas.\nIn May 1966, Puskas played in a Copa del Rey — then known as the Copa del Generalisimo — quarter-final away against Real Betis in Seville. He was 39 years and 37 days old. Modric had his 39th birthday early last month and will be 40 days beyond it in Vigo.\nHe has already become, in April, the oldest player ever to represent Madrid in European competition. In replacing Jude Bellingham against Bayern Munich in the first leg of a Champions League semi-final, Modric passed another Puskas record, that one set in 1965.\nAdvertisement\nModric bridges such dates and names. In that 2007 Croatia-Russia game, he had Robert Kovac behind him in central defence. Kovac was born in 1974. Against Barcelona next weekend, Modric may have Lamine Yamal facing him. Yamal was born a month after that qualifier in Zagreb.\nThe span of eras, the longevity, is a piece of the Modric attraction. It is also the standard at which he continues to operate. He is not, at 39, kicking around a lower league for the sake of a pay packet or his ego. Modric is still playing at the highest level. This is season 13 for him at the Bernabeu.\nHow he manages this, how he has managed this, is a lesson in dedication.\nAt 5ft 8in (172cm) and 10st 6lb (146lb/66.2kg), Modric is hardly equine, yet there are Cheltenham Festival racehorses with less stamina. Innate ability is twinned with astonishing reliability. In 19 completed seasons of senior club football — in Croatia, in the Premier League with Tottenham Hotspur and with Madrid — Modric has appeared 40 or more times in 15 of them.\nHe has only once dipped below 32 games, and that was to 25 in 2014-15 due to injury. He has 182 Croatia caps and has played in 12 internationals this year. Modric’s full 90 minutes on Tuesday night in Poland means he has now played in over 50 per cent of Croatia’s international matches since independence in 1994. “An almost mystical dependability,” as Boban said in the foreword to the midfielder’s autobiography.\nVlatko Vucetic, a professor of kinesiology (the study of human body movement) at the University of Zagreb who has worked with Modric individually for over a decade, attributes an element of his powers of endurance to genetics, but mainly it is attitudinal. Modric has a ferocious work ethic.\n“Many soccer players come here for diagnoses,” Vucetic tells The Athletic. “Over 25 years, I have seen taller players, faster players, more explosive players, and Luka is not exceptional in that way. But in his cognitive process, intelligence and character, he is.\n“We started 11 or 12 years ago. He wanted to play until 36. That was his aim then.\nAdvertisement\n“I gave him a programme and he did it almost every day — more than 350 times per year. Sometimes he does it at home, some he does at Real Madrid’s camp. He will do 45 minutes before training. My specialisation is working with resistance bands. He works every day with long elastic bands, good for leg muscles. Especially after 30, you lose muscle-mass rapidly. You have to work more to be the same as last year. It’s not easy to accept. You need dedication.\n“This summer, he did a lot of swimming, treadmill running. He wanted to be in great shape for the first day of Real’s training. We worked maybe more than ever this summer.”\nVucetic has eight parameters, ranging from daily habits to “morphological peculiarities” to specific training to psychology. He makes no claim to have influenced Modric’s natural football intelligence. “That’s not to do with me,” he laughs. “That’s Luka. He’s born like that. This is his brain.\n“Character is really important in soccer. Luka is really straight; emotional but always wants to win, really concentrated and competitive. He wants success, not to be at a party. He’s strong in his head and he’s a hard worker. It’s not so easy to have this mentality.”\nVucetic says Modric’s body age is around 35. Contracted to Madrid until next June, it leaves open the possibility of him appearing at the 2026 World Cup.\n“I talk with him six months by six months,” Vucetic says. “If Luka continues to do the preparation and prevention, he can go on. Just looking at his body, he can go on; but the body is only one part of it. It’s a mental question: can you do it every day, more and more? Mentally he’s happy, he enjoys playing and it is really important. My obligation is to prepare him so he can play like a kid. And he does. He jokes, plays like a kid on the beach. The longer he feels that, it’s good.”\nWhen asked about World Cup 2026 last month before a Nations League game against Portugal, Modric’s reply was: “That’s a long way off. At my age, I don’t want to make long-term plans. We’ll see. From this perspective, I’m not sure how realistic it is.”\nAdvertisement\nHe then added: “It doesn’t matter how much I doubted myself; what matters is that I’m here. I’m still as motivated as I was at the beginning, and I still have a great desire to play.”\nThe concept of Modric and self-doubt may sound strange, but his passage to the top has been neither serene nor guaranteed. Modric has faced issues, in football and in life, that could easily have halted him. As the hashtag his 36million followers on Instagram see, #TheBestThingsNeverComeEasy.\nBorn in 1985, when Croatia was part of the former Yugoslavia, Modric was five when the country was torn apart. He was 10 when the fighting ended with Croatia’s independence. But there was bloodshed, trauma and forced movement and the Modrics felt it all, tragically so.\nModric is named after his grandfather, Luka, who was a road maintenance worker. In December 1991, Luka senior was murdered in the escalating conflict. He was 66 years old.\nModric was six then, but the memory lives with him.\nIn a moment of supreme individual recognition, as he collected the award for being player of the tournament at the 2018 World Cup, where he led Croatia to the final, Modric said he thought of ‘Grandpa Luka’. That was the year Modric won the Ballon d’Or.\n“What kind of people can coldly take the life of an innocent old man?” he asked in his 2020 autobiography.\nThe family were displaced, living in a refugee camp, before moving to the coastal city of Zadar, where Modric grew up. He was rejected by his favourite team, Hajduk Split — “too small”. Despite some sharing similar sentiments about his size, Modric made it at Dinamo in the capital, was capped by Croatia, saw a move to Chelsea fall through and, after initial criticism at Tottenham, flourished into a player coveted by Madrid and Paris Saint-Germain (he visited Carlo Ancelotti, the PSG manager, at his home).\nAdvertisement\nBut first Chelsea returned, which is why, in summer 2011, a 26-year-old Modric was on a speedboat zooming towards their owner Roman Abramovic’s yacht moored off the south of France. In the background were Manchester United — “I made him my target in 2011,” wrote Sir Alex Ferguson, who, like Boban, supplied a foreword to the player’s autobiography.\nHow post-Ferguson United might have been shaped by Modric’s presence.\nBut Spurs would budge for neither English rival. The following summer, however, after title-bound Spain had eliminated Croatia at Euro 2012, Sergio Ramos approached Modric on the pitch in Gdansk and said, “See you in Madrid.”\nA lot of stop-start negotiating later, Spurs agreed a £30million ($39.2m at the current exchange rate) fee with Madrid and Modric joined a Jose Mourinho-managed squad. Mesut Ozil wore their No 10 shirt then, so Modric chose No 19 — 1+9. It was such a difficult first half to a trophyless season, though, that Modric was labelled “worst foreign signing” in a poll in Spanish sports newspaper Marca.\nIt could be called a premature assessment.\nMourinho was the first of the head coaches Modric has had at Real — Ancelotti (twice), Rafa Benitez, Zinedine Zidane (twice), Julen Lopetegui and Santi Solari have all been there and all, week in, week out, have picked him.\nBack home, there was the controversial Zdravko Mamic tax case that forced Modric into court and of which he said: “In the course of a single day, I became the most hated person in Croatia.” (Modric had signed for Mamic’s agency while he was at Dinamo.) He has, to put it mildly, since recovered his national reputation.\nSo his career has not always flowed, not even at Madrid, for whom he has played 546 times in official competition. But then, Puskas had his doubters, too. He made his debut at the Bernabeu in 1958 but was left out of the next game. In the days before substitutes, Puskas was also dropped for the 1959 European Cup final.\nAdvertisement\nBut in the case of each player, temporary criticism is heavily offset by sustained praise and by our genuine affection. Modric attracts it for his longevity, for the trajectory of his life and career and for his composure. And for something greater: aesthetics.\nThe Modric strike with the outside of his right boot is akin to a Cruyff turn, a signature move. That he can appear placid as he slices open an opponent with a knife of a pass is part of our wonder.\nThink of the cross against Chelsea in the Champions League quarter-final second leg in 2022 enabling Rodrygo to make the scoreline 4-4 on aggregate. Then there was the reverse pass with his left foot to initiate the move leading to Vinicius Junior’s winner in the final against Liverpool six weeks later. Modric made both seem natural, routine; they are not.\nThat the latter pass led to a goal which secured a trophy is no surprise. Modric has won if not it all, then nearly all.\nIt’s a catalogue: the Champions League six times with Madrid, plus four La Liga titles, two Copas del Rey and five Club World Cups. Then there’s that 2018 Ballon d’Or, the only interruption in the Lionel Messi–Cristiano Ronaldo 13-year duopoly. It was the year Modric led Croatia, a nation of less than four million people, to the World Cup final, then to third in 2022.\nWith Dinamo, he won three league titles and two Croatian Cups. He has been named Croatian Footballer of the Year in 2007, 2008, 2011, 2014, 2016, 2017, 2018, 2019, 2020, 2021, 2022 and 2023.\nHe could be a self-satisfied man and yet, having entered his 40th year at the start of September, Modric ended the month by captaining Real in the Derbi Madrileno at Atletico. He played 85 minutes and set the tone, pressing Marcos Llorente near the Atletico byline after 90 seconds.\nThree days on and Modric was brought from the bench in Lille in the Champions League. Three days after that he played 89 minutes of Real’s 2-0 home win over Villarreal. He is relentless.\nAdvertisement\nWhen Modric started at the Bernabeu, his fellow midfielders were Ozil, Xabi Alonso and Sami Khedira, all of whom have now retired. Subsequently, Modric’s most famed midfield partnership contained Casemiro and Toni Kroos. Today, it’s Bellingham and Fede Valverde.\nSo Ramos was correct: he did see him in Madrid.\nWe were fortunate reporters to be in the stands that day in Gdansk as Andres Iniesta was confirming himself to be the greatest midfielder on the planet. A long time before that, Bilic had pulled Modric aside to tell him that, one day, he could reach Iniesta’s level. They are two of the most consequential footballers of the 21st century and, at 40, Iniesta announced his retirement last week.\nIt makes us reflect.\nThat day in June 2007, Niko Kranjcar was beside Modric, Andrey Arshavin was playing against him. Nobody thought of 2024, just as nobody today is thinking of 2041. But 17 years later, Modric still plays, “creating where it’s the toughest, in those narrow ravines and rapids of the centre field,” as his hero Boban saluted.\nSoon it will be 2025, Luka Modric flows on, and for Real Madrid.\n(Top photo: Alvaro Medranda/Quality Sport Images/Getty Images)",
  "word_count": 2345,
  "scraped_at": "2026-02-14T01:51:57.645061",
  "_text_extracted": true
}