{
  "article_id": "97ae94682435",
  "url": "https://www.cbsnews.com/news/kylian-mbappe-nose-broken-euro-2024-france-may-wear-mask/",
  "title": "Broken nose to force France soccer star Kylian Mbappé to wear a mask if he carries on in UEFA championship",
  "date": "20240618T163000Z",
  "domain": "cbsnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Broken nose to force France's soccer star Kylian Mbappé to wear a mask if he carries on in UEFA championship\nDusseldorf, Germany — Kylian Mbappé suffered a broken nose during France's opening game at the European Championship and will have to wear a face mask if he plays on at the tournament. The French Football Federation said Tuesday it had received \"positive\" news about Mbappé's chances of continuing at Euro 2024 as he will not need immediate surgery. But it did not specify how long it would be before he is able to play again.\n\"The news is rather reassuring so far as there are no operations planned for the immediate future. As for his participation in the rest of the tournament, it's a bit too early to give a timetable,\" federation president Philippe Diallo said.\nMbappé was treated by team doctor Franck Le Gall and then went to Dusseldorf hospital following France's 1-0 win against Austria on Monday.\nThe federation said a mask would be made to allow Mbappé to \"consider resuming competition after a period devoted to treatment.\"\n\"They tried to reduce the aftermath of his fracture, for him to be able to stay in the tournament,\" Diallo said. \"We'll wait until the end of the day to see how things develop. But all in all, I'd say the information was pretty positive.\"\nMbappé stayed on the ground after his face collided with the shoulder Austria's Kevin Danso as he attempted a header during the Group D match at Dusseldorf Arena. His nose was badly swollen and blood poured from his face, turning parts of his white jersey red.\nAustria goalkeeper Patrick Pentz signaled for urgent medical assistance.\n\"We're worried to see Kylian leave the field like that,\" France midfielder N'Golo Kante said afterward.\nMbappé's injury is a big deal for France, as the country's captain, its best player and one of the biggest stars of the tournament. It's a concern for Real Madrid, too, after he left Paris Saint-Germain as a free agent to sign for the Spanish club in the offseason.\nMbappé is widely regarded as the heir to Lionel Messi and Cristiano Ronaldo as the best player in the world and led his country to the World Cup title in 2018 at the age of 19.\nHe became only the second player in history to score a hat trick in a World Cup final four years later in Qatar as France was runner-up to Messi's Argentina.\nChampions League winner Madrid ended its years-long pursuit of Mbappé earlier this month and he will join its roster of superstars, which included Vinicius Junior and Jude Bellingham.\nFrance's priority will be to get him back on the field and leading its bid to win a record-equalling third Euros. Madrid will want him in peak condition for the start of the season and Mbappé already indicated this week that his new club did not want him to take part in the Paris Olympics, where the men's final is Aug. 9.\nIf he is to play on at the Euros, he will need to wear the type of protective face mask worn by Son Heung-min and Josko Gvardiol at the World Cup in 2022.\nBut the speed of his return will depend on the level of discomfort he feels.\nA broken nose can take weeks to heal and the National Health Service in the U.K. says sport should be avoided for \"at least six weeks if there's a chance your face might be hit.\"\nMbappe returned to the team's training camp to join up with the rest of the squad and appeared to see the lighter side of his injury.\n\"Any ideas for masks?\" he posted on social media.",
  "word_count": 619,
  "scraped_at": "2026-02-14T02:01:16.437302",
  "_text_extracted": true
}