{
  "article_id": "97b11c3a3784",
  "url": "https://www.teamtalk.com/news/jurgen-klopp-eyes-double-raid-chelsea-liverpool-monitoring-star-england-international",
  "title": "Jurgen Klopp eyes destructive double raid on Chelsea with Liverpool  closely monitoring  star",
  "date": "20230227T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Klopp eyes destructive double raid on Chelsea with Liverpool ‘closely monitoring’ star alongside England international\nLiverpool could swoop in for two Chelsea players in the summer transfer window as they are keeping tabs on a senior Blues star alongside an England international, according to reports.\nLiverpool were held to a 0-0 draw by Crystal Palace at Selhurst Park on Saturday. While Klopp did not get the response he was looking for following the thrashing at the hands of Real Madrid, the draw moved Liverpool up to seventh place in the Premier League and up to 36 points.\nThey will have to go on a brilliant winning run in the next few months to qualify for next season’s Champions League, but that goal is just within reach.\nKlopp dragging Liverpool into the top four will improve the club’s chances of landing some of their top transfer targets this summer. The German needs a midfield rebuild, while he could also do with a couple of new defenders arriving at Anfield.\nBorussia Dortmund star Jude Bellingham is the main man being eyed to revamp the midfield. But he cannot transform the team on his own and therefore Liverpool need one or two more midfielders to join.\nTransfer insider Graeme Bailey recently told TEAMtalk that Chelsea ‘will sell’ Mason Mount if they cannot agree a new contract with the England international. And Liverpool ‘like him a lot’, setting up a potential raid on Chelsea by Klopp.\nAnd Mount is not the only Blues ace wanted by Liverpool. As per Football Insider, a devastating double swoop could occur which also involves N’Golo Kante.\nChelsea have been in contract talks with Kante for some time now. They are trying to extend his current deal as it expires in June.\nChelsea in ‘advanced’ contract talks, but Liverpool lurking\nThe report states that these discussions have now reached an ‘advanced’ stage. Todd Boehly, Chelsea’s chairman, is keen to keep Kante and is offering him a deal ‘incentivised with bonuses’. But that does not mean Kante is guaranteed to remain in west London.\nLiverpool are ‘closely monitoring’ the situation and will try to sign Kante if the Chelsea negotiations break down. Reds officials believe it to be a great opportunity to sign a top Premier League performer on a free transfer.\nOne of the reasons Kante is close to becoming a free agent is his recent injury struggles. He has been out of action since August after suffering a hamstring problem. He is hoping to return in March.\nWhile Kante’s lack of appearances is obviously a concern, he still possesses great pedigree at the top level. He was a crucial part of Leicester City’s shock league title win in 2016.\nSince joining Chelsea, Kante has played a big role in them winning the Prem title, Champions League and Europa League. And he is also a World Cup winner with France.\nOn his day, he is one of the best defensive midfielders in the world thanks to his incredible energy and awareness. So if Liverpool can land him and keep him fit, it could prove to be a masterful signing.\nMeanwhile, reports in Italy claim Liverpool are interested in one of the best attackers in Serie A.",
  "word_count": 537,
  "scraped_at": "2026-02-14T01:55:49.883431",
  "_text_extracted": true
}