{
  "article_id": "97e3eaf1fee3",
  "url": "https://www.northwalespioneer.co.uk/news/24966693.pioneering-referee-llandudno-announces-retirement/",
  "title": "Pioneering referee from Llandudno announces retirement",
  "date": "20250226T190000Z",
  "domain": "northwalespioneer.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHERYL Foster MBE has blown the final whistle on a refereeing career that has taken her to the pinnacle of the world game.\n“I think when you know, you know,” explained Foster, from Llandudno, when she sat down with the FAW.cymru to discuss her decision.\n“Obviously it’s something that I’ve thought about for a while and I’ve gone through a number of emotions in deciding what I’m going to do next.\n“But when it’s in your head and it’s in your heart that it’s the right decision, then I think it’s the right time.”\nFoster, now 44, took up refereeing at the end of her own successful playing career in 2013, and quickly established herself on the circuit as a talented match official.\nPromoted to the FIFA international list in December 2015, Foster took charge of matches at the finals of UEFA Women’s EURO 2022 and the 2023 FIFA Women’s World Cup – including the Third Place Match at the latter – in addition to her appointment as referee for the 2023 UEFA Women’s Champions League Final.\nDomestically, she was the first woman to referee in the JD Cymru Premier when she did so in 2018, while last year Foster was awarded a Member of the Order of the British Empire (MBE) for services to Welsh football.\n“The EURO finals were special,” she explained.\n“I say that because it was in England and you could really feel the support from people because we were so close to it. I genuinely didn’t think I was going to make the list, but I did and I did the semi-final.\nREAD MORE ABOUT CHERYL FOSTER:\nLlandudno referee honoured for contribution to women's football\n“There’s a picture of me picking the ball out of the little Jeep that drove the ball onto the pitch and I had the biggest smile. To describe those feelings of doing major tournaments and a big final was incredible. Lots of really amazing memories, with lots of amazing people too. They’ve all got me to be at the highest level and I’ll always be grateful.”\nAs a player, Foster represented the Wales national team as a striker and scored nine goals in 63 senior appearances between 1997 and 2011.\nShe spent almost a decade at Liverpool before bringing that first chapter of her impressive football career to a close after a brief spell with Doncaster Rovers Belles in 2013.\n“It’s a very tough decision,” she added. “My footballing career has spanned a long time, both as a player and as a referee, and it’s quite difficult to think that I won’t be doing either of them ever again.”\nIn fact, Foster’s new role means that she also calls time on her teaching career, and will take up a full-time position with The Football Association as Senior Manager of Refereeing Pathway, Progression and Development.\n“I’ve not retired, that’s a big word,” she emphasised. “The English FA have been really supportive in that they know how much Wales and the progression of referees in Wales means to me. So you will still see me around, supporting the JD Cymru Premier VAR project and on the sidelines watching and coaching. I’m really excited though and can’t wait to get started.”\nThe match between France and Norway in the UEFA Women’s Nations League in Toulouse last Friday was Foster’s final appointment and was no doubt an emotional occasion for someone who clearly has a genuine passion for the game.\nAs a former player herself, Foster was keen to promote the benefits and advantages that a playing career can bring to the refereeing world.\n“I’ve always said that having played really helped with my refereeing career,” she added.\n“I’ve also said give it a go, I just did the course just to see what it was like. The support within the refereeing community is incredible. It opens up so many doors and if you want to stay on the pitch, stay fit, stay active, stay part of the game, then why not just give it a go.\n“l will also say that being a teacher has helped me when you’re dealing with 22 players, whether that’s male or female, regardless of the abilities and ages, you’re still having to control a game, control players, control emotions and feelings. So the combination of the two I think really helped.”\nThere is no doubt that Foster’s impressive career achievements have inspired a number of men and women to follow her path and the legacy of her success will be in the progress and development of the next generation of Welsh match officials.\n“When I look back I’m really, really proud of what I’ve achieved in merely a short space of time,” she explained.\n“If that’s left a legacy then so be it. I look forward to watching TV and hearing about the next referee from Wales that we’ve developed and produced to go to a major tournament. If that’s because of what I did then I’m even prouder of what I’ve achieved.”",
  "word_count": 836,
  "scraped_at": "2026-02-14T02:08:52.948571",
  "_text_extracted": true
}