{
  "article_id": "97e7bcfa8457",
  "url": "https://www.themag.co.uk/2025/02/nuno-espirito-santo-newcastle-united-press-conference-speaking-ahead-of-sunday-nottingham-forest/",
  "title": "Nuno Espirito Santo Newcastle United press conference - Speaking ahead of Sunday",
  "date": "20250221T180000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nuno Espirito Santo Newcastle United press conference – Speaking ahead of Sunday\nThe Nuno Espirito Santo Newcastle United press conference has taken place.\nThe Nottingham Forest boss speaking to journalists ahead of Sunday’s game.\nForest currently sitting third in the table.\nHowever, they lost 2-1 at Fulham last weekend.\nPotentially a massive match in terms of chasing the Champions League places, as depending on this result at St James’ Park, the gap between the two clubs could be as high as nine points, or as low as three, after the weekend.\nThe Nuno Espirito Santo Newcastle United press conference – 21 February 2025:\n“There is no secret in football.\n“We face a good team and a good manager [Eddie Howe].\n“A manager who has good players that perform very well.\n“We have to fight and show our talent.”\nNuno on Alexander Isak:\n“A very good player, but like I said, the squad of Newcastle is very strong in all the positions.”\nNuno on midfielder Elliot Anderson as he faces his old team:\n“He is one of our midfielders who is versatile enough to change positions.\n“He is doing well but I hope he performs better on Sunday.\n“He has a long way to go.\n“He is very young and very talented but there are so many details to improve.\n“You can see that he is doing well.”\nNuno on bouncing back from losing to Fulham:\n“We have to compete better and that is what we will be trying to do.\n“We are reaching the moment of the season where everyone will be fighting for their own objectives.”\nNuno on the availability of Taiwo Awoniyi:\n“He is available but he will have to wear a mask.”\nNuno on Forest’s position in the league and facing the final 13 PL matches:\n“We are in a good position.\n“We are enjoying ourselves, realising every game is difficult.\n“This is where we are.\n“We are trying to compete until the end and do it well but always believing that we’re in a good position.\n“We have a healthy squad and we have solutions.\n“We have competed well [so far] and this is what we expect in the final stage of the season.\n“The games will be more difficult and we have to deal with everything…the expectations, our own beliefs and moments of the players.\n“I don’t change my approach.\n“We have to keep the same routine and approach it day by day.\n“Look at all the details which enable us to compete well.\n“That is what we are focused on.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 440,
  "scraped_at": "2026-02-14T02:26:28.923314",
  "_text_extracted": true
}