{
  "article_id": "97ecc552457f",
  "url": "https://weaintgotnohistory.sbnation.com/2023/6/8/23753568/keep-sell-loan-midfielders",
  "title": "Keep , Sell , Loan : Midfielders",
  "date": "20230608T090000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Midfield might be where the most activity happens this summer, both in terms of incoming and outgoing transfers.\nKeep, Sell, Loan: Midfielders\nSquad planning, position by position\nEnzo Fernández signed for a club-record £106m fee with minutes left of the January transfer window, but that should only be the start of the work that is done to revamp a position that has been neglected for a few years. The trio of Jorginho (now plying his trade at Arsenal), N’ Golo Kanté & Mateo Kovačić have carried the majority of the work since 2018, with only a couple of loan signings supplementing that over the years.\nWe have been crying out for a rebuild in this department for a couple of years now, and it’s very likely that is what will occur over the coming months.\nSTAYING: Enzo Fernández\nEnzo is who this team will be built around. He’s already made an impressive start to his Chelsea career, and with better-suited players around him, should excel even more next year.\nAmongst all midfielders in the Premier League this year, Enzo ranks in the 99th percentile for the following:\n- Progressive Passes\n- Passes Completed\n- Passes Attempted\n- Total Passing Distance\n- Progressive Passing Distance\n- Passes Completed (Medium)\n- Passes Completed (Long).\nEnzo has taken to football in England really well, and there should be even more to come from him is truly exciting.\nPROBABLY DEFINITELY LEAVING: N’Golo Kanté\nIt was just after Christmas when news broke of an imminent contract extension for Kanté, which would’ve extended his trophy-laden seven-year spell at Stamford Bridge. Weirdly enough, then it went all quiet on that front, and as of this week, he’s set to sign for Al Ittihad in the Saudi Pro League instead.\nAnd that’s most unfortunate as on his day, Kanté is still just absolutely phenomenal (just as he was in the 2021 Champions League run-in). His constant injuries had made it hard to built a team around him as a focal point, but as a supporting piece of the puzzle, he would’ve been great.\nAlas.\nDEFINITELY LEAVING: Denis Zakaria\nChelsea seem to be building a new tradition where we take an out-of-favour midfielder on loan for a year, and everyone is left wondering a couple of years later whether said player really did play for the club. Zakaria falls very much in that camp, although it could have been a different story if not for an injury against Fulham back in January.\nHaving not made an appearance until a dead-rubber final Champions League group stage win over Dinamo Zagreb at the start of November (almost three months after joining on loan from Juventus), Zakaria surprisingly started carving out a starting role in Graham Potter’s side. Zakaria actually scored the winning goal in the aforementioned Zagreb contest, and appeared at the World Cup for Switzerland before returning to appear in five consecutive club games (starting in four of them).\nDuring the 2-1 defeat to Fulham, Zakaria pulled up with an injury, didn’t start another fixture until a late-season defeat to Brighton — which would prove to be his final appearance and penultimate inclusion in a matchday squad.\nZakaria did have some bright moments when he got the opportunity to play, but with a host of incomings in January, players returning from injuries and a coaching change, he’d fallen out of the pecking order. There was talk of an option to buy of £25m at the end of the loan, but that was never in danger being activated.\nPOSSIBLY LEAVING: Ruben Loftus-Cheek\nRecent reports seem to point towards an AC Milan transfer for Loftus- Cheek, which isn’t a great surprise as he had one of his best performances against them back in October during Chelsea’s 3-0 Champions League group stage win. RLC has played a varied role the last couple of years, being deployed as a wing-back, holding midfielder, central midfielder and even as a centre back in an FA Cup win at Luton. It’s that versatility which makes him valuable, and appreciated by several different managers. He’s also a homegrown product, which might actually lead to Chelsea being more keen to sell him due to the “pure profit” he will represent on the books.\nI would actually keep Ruben, as I think he’s a perfect example of a squad player. Youth product, experienced, versatile and never kicks up a fuss. However, it’s hard to see a bid of £15-£20m being rejected for a 27-year-old who never quite made the big jump expected of him in his younger years. He’s also out of contract next year and with the new ownership keen to overhaul the wage structure at the club, this again points to a player likely to be on his way if enough concrete interest develops over the next few months.\nHowever, if he stays, I think Chelsea will be better off for it. He ranks in the following percentiles amongst his fellow PL midfielders for each of these stats (percentiles in brackets);\n- Successful Take-Ons Progressive Carries (92nd)\n- Progressive Carries (91st)\n- Pass Completion % (80th)\n- Progressive Passes Received (85th)\n- Touches Att Pen (77th)\n- Aerials Won (82nd)\nI think the last stat here is quite key, and again shows the limited but effective role that Loftus-Cheek can play. Chelsea have struggled from set-pieces this year, and when considering the potential squad height for next year, a 6ft 3in individual does seem appealing. Perhaps not the most important consideration for the recruitment team in charge of clearing out the squad, but something which might play a part in Loftus-Cheek sticking around for a bit longer.\nPOSSIBLY LEAVING: Mason Mount\nThere’s been plenty of speculation surrounding Mount’s future at the club he’s been with since he was seven years old. The Cobham product is out of contract next summer, and judging by recent reports, it’s looking as if the writing might well be on the wall here.\nMount, like most, if not all of the squad, has struggled this season, failing to replicate his previous performances. However, he did have some strong moments, most notably during October, when Chelsea had our best spell of the season as well. Mount starred in the two wins over Milan, grabbed two assists versus Wolves, and scored two goals in a win over Aston Villa all over a span of eleven days.\nMount leaving just as Pochettino comes in would be a bit of surprise as well, as he aligns quite well, as much as any player in the current squad, with the energetic work-rate and high-press philosophy that Pochettino is expected to espouse.\nMost of the criticism aimed at Mount is that he isn’t creative enough, but while this is a part of his game he can improve upon, it isn’t quite true. You only need to look at where he ranked compared to other PL attacking midfielders and wingers for the previous year (notoriously creative players) to see how effective he was.\nThe numbers compared to other key midfielders or creators for that year also point to a player that is certainly capable of performing consistently for a side pushing for a Champions League spot (at the very least).\nMount also gets stick that his set-piece-taking abilities “exaggerate” his creativity, which is another unfair criticism. It’s not often a player will get criticised for being skilled at an action which positively impacts upon his side, and with Chelsea struggling from set-pieces this year (fourth-bottom in Set Piece xG per Opta), his absence is certainly being felt on that side of the ball. It’s also worth noting that set-pieces account for a similar proportion for the majority of the players on the chart above, when it comes to their overall creative numbers.\nMount can improve his creative output, but if there’s a belief that the right system can enhance these numbers more so than anything lacking from the player’s side, then he must be kept around the squad. Last year, Mount ranked 4th amongst the selected players below for key passes per 90, but was second-bottom for progressive passes.\nIt’s worth noting most of those other player play in a deeper position, which makes it easier to score a higher number for progressive metrics, but it would be interesting to see what Mount’s numbers might look like in a similar position (he has reportedly wanted to be played more as a ‘No.8’ in his contract negotiations).\nMount’s position further upfield means a lesser role in progressing play. His short pass attempts are the lowest amongst the selected group above, while his medium attempts are well below the average of 23. His long pass attempts are expectedly low, almost on par with teammate Kovačić, perhaps a nod to the conservative playing style in possession at Chelsea last year.\nOne thing to note of concern is that the pass success percentage is quite low amongst his peers (although it is better than Fernandes & De Bruyne, with similar attempts in the short-pass success percentage metric). It’s in the medium and long pass success where Mount needs to improve upon as only De Bruyne ranked in a similar level in the former (with 10 more attempts), and latter (with double the attempts).\nThere’s a base for improvement for Mount, but more importantly there’s proof of success. Mount surely has plenty more to offer in the blue of Chelsea, and thus it would be a shame if he left at the age of 24.\nPOSSIBLY LEAVING: Conor Gallagher\nGallagher is another homegrown product who has been strongly linked with a move away this summer. There were reports that Chelsea had accepted a £40m bid from Everton in the January transfer window, but the player rejected the move, as he was keen to prove himself at Stamford Bridge. Gallagher has actually had a pretty solid season, especially considering this is his first at senior level for the club, and the massive upheaval around the team can’t have been a perfect situation for any debuting player to find themselves in.\nHis season stats reflect well on him, and although nothing immediately stands out, he has been a solid performer (arguably one of the best), albeit in a team that has fallen way…way below expectations.\nThe final three metrics refer to a keenness to “get stuck in”, and work hard for the team. These traits will please Pochettino, and much like Mount, it wouldn’t be a surprise if either of these players get another chance to stay at the club based off of Poch’s assessment alone.\nThere are improvements to be made with Gallagher, mostly in the in-possession stats:\nAlthough there are caveats here, wherein the team as a whole have struggled with creativity, and Gallagher has been used more as an off-ball weapon than an on-ball facilitator. In terms of the league-expectancy, Gallagher’s dispossessed numbers are in the 22nd percentile, which means others have performed worse (Luis Díaz leads att.midfielders/wingers with 3.54). He’s also in the 63rd percentile for miscontrols, led by Alejandro Garnacho (4.03), placing himself above average here. Sometimes “poor” stats are a cost of where a player plays, and the more attack-minded personnel tend to lead these categories.\nIt was due to Gallagher’s successful loan spell at Crystal Palace last year, where he was named Palace’s ‘Player of the Season’, that we were keen to bring him into the Chelsea fold and see how he might fare. Interestingly, he hasn’t had too different a season, despite being placed at a club who expect to dominate possession more so than his previous side.\nGallagher’s dispossession, shot-creating actions, goal-creating actions, and blocked passes may have swung negatively this year, but his touches per-90 also increased by 30% so it’s impressive to see a consistent level of performance. He also placed above average in the SCA (live passes) this year, despite placing in just the 13th percentile last year. Again, a reference point of a player who can improve with a newer role in a more possession-oriented side, if given the chance.\nI would like to keep Gallagher around for another year, if possible, as it would be interesting to see how Poch utilises him, as well as security for any injuries/rotation options. He’s on much lower wages than others who could fill this squad requirement (Loftus-Cheek, Kovačić) and is also younger.\nPOSSIBLY LEAVING: Mateo Kovačić\nMuch like Mount, Kovačić had a stellar year last season, and was a key reason for Chelsea winning two trophies in the UEFA Super Cup & FIFA Club World Cup, as well as only missing out on an FA Cup & League Cup by virtue of penalty-shootout losses to quadruple-chasing Liverpool. Playing such a key part in what, with a little bit of different luck, could have been a season for the ages, the expectations were high this year. Unfortunately, he’s been well below par, and a year-on-year comparison helps show what has gone wrong.\nKovačić blossomed into a more creative player under Thomas Tuchel last season, and his on-ball creativity numbers show a difference a year-on. Much like every other player who has suffered an unfathomable dip in form, it’s hard to know how much emphasis to place on this year’s numbers. The multiple changes on and off the pitch, coupled with being out of any and every competition by the middle of April, and zero chance of European football next season, it’s expected that a certain hunger leaves these professional footballers with so little at stake.\nOne of the main concerns surrounding Kovačić would be an apparent knee surgery that has been put on the shelf since last summer, according to Tuchel back in September. With the World Cup on the horizon in Qatar, it was unlikely the Croatian international would opt for surgery anytime before then, but given his contract status (expires next summer) and that he has recently turned 29-years-old, it’s unlikely Chelsea would stand in his way if a reasonable offer was made for his services.\nI do feel that a lack of Champions League football, and an unknown return date to Europe’s elite competition, means Kovačić might push for a move himself. He might have won the trophy with the big ears a whopping four times already, but it’s very likely he’d fancy playing in the tournament as much as his prime playing days allow him to. He’s been strongly linked with Manchester City, who could offer him the game time, the competitiveness, and all the challenge that a player in (or still near) his prime would want.\nPROBABLY STAYING: Carney Chukwuemeka\nChukwuemeka was a surprise signing last summer from Aston Villa for a fee that could eventually rise to £20m. He was one of the more highly-rated youngsters, but with only one league start this year, and only one substitute appearance for longer than 10 minutes since January, it seemed fair to assume Chukwuemeka would be going on loan next year. However, his recent outings against Manchester United and Newcastle have once again offered a glimpse of hope regarding his Chelsea future. With plenty of movement in this area over the next few months, having a player Carney in the squad, who is keen to learn and develop would be a welcome sight.\nVERDICT\nGiven the precarious FFP situation we might find ourselves in, and gametime being notoriously difficult to guarantee over the next year (no European competition), I’d expect the club will unfortunately look to recoup funds from one of Mase or Conor, with the other sticking around under Pochettino. It’s looking very likely it will be the former who heads out the door this summer, given his contract issues.\nKeep: Enzo Fernández, Mason Mount/Conor Gallagher, Carney Chukwuemeka, +New Signing\nSell: Ruben Loftus-Cheek, Denis Zakaria, N’Golo Kanté, Mateo Kovačić, Conor Gallagher/Mason Mount\nLoans: Andrey Santos, Cesare Casedei\n(All stats from FBRef unless otherwise stated)",
  "word_count": 2642,
  "scraped_at": "2026-02-14T02:00:19.982563",
  "_text_extracted": true
}