{
  "article_id": "980093241867",
  "url": "https://metro.co.uk/2024/05/02/bruno-fernandes-a-doubt-man-utds-clash-crystal-palace-20763019/",
  "title": "Bruno Fernandes a doubt for Man Utd clash with Crystal Palace | Football",
  "date": "20240502T144500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag has revealed that Manchester United skipper Bruno Fernandes is a doubt for the side’s Premier League clash away at Crystal Palace on Monday night.\nThe Red Devils dropped two points at the weekend in their 1-1 draw with Burnley, a result which ended their hopes of playing Champions League football next season and leaves them six points adrift of fifth-placed Tottenham in the race to qualify for the Europa League.\nDespite a disappointing campaign for the club, Fernandes has been a rare bright spark, notching 10 goals and laying on seven assists in the Premier League.\nBut he could miss just his second game of the season on Monday, with the 29-year-old having picked up a minor injury against Burnley which could rule him out of the trip to Selhurst Park.\n‘After the game [against Burnley] we had an issue with Bruno,’ revealed Ten Hag at his pre-match press conference on Thursday afternoon.\n‘He is a doubt for Monday, but we all know Bruno, never rule him out for any game. He will do his best to be available.’\nInterestingly, Fernandes tentatively opened the door to a potential departure from Old Trafford this week and said he might consider the possibility of ‘not continuing in the Premier League’ once the Euros are over.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIn better news for United, Scott McTominay has a chance of being involved against Palace while Jonny Evans and Anthony Martial have both taken part in training.\n‘Scott didn’t train so far this week but I expect him back in training on Saturday and we have to see if he’s 100% available or for a part of the game,’ continued Ten Hag.\n‘Jonny Evans returned today for team training. Tomorrow we are off and then two days until the game. Martial was partly in team training.’\nMore Trending\nMarcus Rashford, though, remains sidelined, with Ten Hag adding: ‘I can’t tell [if he’s close to a return]. So it was last week, after Coventry, his issue hasn’t healed so far.’\nUnited currently have a host of teams breathing down their neck in the battle to secure the final European spots, with Newcastle, West Ham, Chelsea and Bournemouth all within striking distance.\nAsked about the importance of nailing down Europa League qualification ahead of the summer window, Ten Hag replied: ‘Definitely it will have an impact on the budget but I’m sure Manchester United is a very attractive team and club to play for.\n‘Many players will be very happy to play for Manchester United, I’m sure.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Erik ten Hag responds to Jadon Sancho’s excellent Champions League performance for Borussia Dortmund\nMORE: Michail Antonio suggests West Ham can help Arsenal win Premier League\nMORE: Javier Zanetti hails £51m Arsenal transfer target as a ‘great champion’",
  "word_count": 535,
  "scraped_at": "2026-02-14T01:56:51.536371",
  "_text_extracted": true
}