{
  "article_id": "9813ae5c06e9",
  "url": "https://metro.co.uk/2025/11/24/frank-leboeuf-backs-three-chelsea-stars-kill-barcelona-champions-league-24790478/",
  "title": "Frank Leboeuf backs three Chelsea stars to  kill  Barcelona",
  "date": "20251124T191500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frank Leboeuf has backed Chelsea to take advantage of Barcelona’s ‘insane’ high line and clinch a huge victory in the Champions League.\nLa Liga champions Barca travel to Stamford Bridge on Tuesday night aiming to boost their hopes of automatic qualification to the knockout stages of the Champions League.\nBarcelona – currently second in La Liga, one point behind arch-rivals Real Madrid – are 11th in the Champions League group phase, level on points with 12th-placed Chelsea.\nWith the top-eight teams progressing automatically to the knockout stages and avoiding play-off games, both Barca and Chelsea will be keen to climb up the table with four group games remaining.\nHansi Flick’s side came agonisingly close to reaching the Champions League final last season, conceding two late goals in a dramatic semi-final defeat to eventual runners-up Inter Milan.\nBarcelona were one of the most exciting teams in Europe last season but Leboeuf believes the Spanish giants are more ‘fragile’ this term and questioned Flick’s bold tactics and ‘insane’ high line.\nChelsea were not even in the Champions League last season – winning the vastly inferior Conference League – but Leboeuf says their dynamic forwards can ‘kill’ Barcelona.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nEnzo Maresca’s side have won eight of their last ten games in all competitions to climb to second in the Premier League and boost their hopes of reaching the knockout stages of the Champions League.\nAsked for his prediction for the upcoming European showdown, Leboeuf told OLBG: ‘Being positive, 2-1 to Chelsea.\n‘I see Barcelona playing the high line and that’s insane. I mean, I don’t understand Hansi Flick and the way he plays.\n‘As a defender, I would refuse to play like that, put me on the bench, I don’t want to look like a fool.\n‘I saw the last goal they conceded over the weekend. And I say it’s impossible to play that high line when the players don’t even have sight.\n‘They’re on their own, the opponent, they’re on their own off of the pitch and they play the high line at the half of the pitch, that’s insane.\n‘With Alejandro Garnacho, with Pedro Neto, with Joao Pedro, they’re fast. It’s like Paris Saint-Germain, they kill them. Because you don’t play it like that, it’s impossible.\n‘So it worked last season, because they were effective at front, and they were scoring more goals than they conceded, but this season they’re fragile, so it’s possible.’\nChelsea won the Champions League in 2012 and Leboeuf is ‘confident’ his former club can enjoy a promising run in this year’s tournament.\n‘I’m confident because I know they can compete with any team,’ the France World Cup winner added.\nMore Trending\n‘Atalanta is not the Atalanta we have known like two years ago. The two other teams are going to be hard to beat but it’s possible.\n‘Let’s see if Chelsea go to the play-offs. I’m pretty sure they can go through.\n‘It’s a complicated way of seeing what’s going to happen because I think big clubs go through or they’re going to play the play-offs. So I’m not really concerned.\n‘The talent is there. The possibility of surprising any other team is there. So let’s say I’m confident.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Rio Ferdinand praises ‘ridiculous’ Arsenal star who has gone under the radar\nMORE: Cole Palmer injury update provides huge boost for Chelsea boss Enzo Maresca\nMORE: Chelsea legend John Terry says only two clubs can win the Premier League this season",
  "word_count": 649,
  "scraped_at": "2026-02-14T02:09:38.459936",
  "_text_extracted": true
}