{
  "article_id": "9815250a4a78",
  "url": "https://www.dailyexcelsior.com/mbappe-wins-record-5th-french-golden-boot-rennes-earns-europa-league-spot-auxerre-relegated/",
  "title": "Mbappe wins record 5th French golden boot , Rennes earns Europa League spot , Auxerre relegated",
  "date": "20230605T033000Z",
  "domain": "dailyexcelsior.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PARIS, JUN 4: Paris Saint-Germain striker Kylian Mbappe won a record fifth straight French golden boot while Rennes clinched a Europa League spot and Auxerre was relegated.\nMbappe’s goal in a 3-2 loss to Clermont finished his league tally on 29 and made him the top scorer for the fifth time, tied with French great Jean-Pierre Papin and retired Argentine strikers Carlos Bianchi and Delio Onnis.\nFrench champion PSG and second-placed Lens qualified for the group stage of the Champions League next season and third-placed Marseille earned a spot in the third qualifying round of the lucrative European competition.\nRennes edged Brest 2-1 with first-half goals from Benjamin Bourigeaud to leapfrog Lille into fourth place.\nLille booked a playoff spot for the Europa Conference League after drawing with Troyes 1-1. Bafode Diakite opened the scoring for Lille in the second half and Troyes winger Rony Lopes equalized.\nMonaco was third in the previous two seasons but missed out on European football after losing to Toulouse 2-1 to finish sixth. Toulouse substitute Rhys Healey scored the winner in stoppage time. After 34 rounds, Monaco had a five-point lead over Lille and was eight points clear of Rennes. But Monaco collapsed during the run-in with just one point from the last four games.\n“Everybody’s disappointed,” Monaco coach Philippe Clement told Canal Plus television. “In the last few weeks, the results and the level were not good enough. In the end, I know that everybody looks at the coach.”\nPSG finished only one point clear of Lens after the home loss to Clermont, which also marked Lionel Messi’s farewell match for the club. Messi was booed before kickoff.\nPSG led 2-0 after a header from the departing Sergio Ramos and a penalty from Mbappe. Mbappe celebrated by holding up a shirt with Sergio Rico’s name on it. Rico, the PSG backup goalkeeper, was seriously injured after getting hit by a loose horse in Spain last Sunday.\nClermont leveled before halftime with goals from Johan Gatien and Mehdi Zeffane. Grejohn Kyei scored the winner by converting a cross in the 63rd.\n“We really needed to pay a tribute to Sergio,” Mbappe told Canal Plus television. “I think we are all affected. It’s a situation which is extremely grave. That was on our mind the whole week. We will pray, we will send a maximum of positive vibes so that he can get out of that situation as quickly as possible.”\nCameroon forward Ignatius Ganago helped former powerhouse Nantes stay up by netting the lone goal in a 1-0 win over Angers.\nNantes snapped a 14-game winless streak in the league to leapfrog Auxerre into 16th place.\nAuxerre lost to Lens 3-1 and will be demoted to the second division alongside Angers, Ajaccio and Troyes. Four teams are relegated because the league will shrink from 20 clubs to 18 next season. Lens midfielder Alexis Claude-Maurice scored twice before Belgium international Lois Openda sealed the win.\nElsewhere, Clement Vidal scored in Ajaccio’s 1-0 win over Marseille.\nLyon striker Alexandre Lacazette failed to find the net in a 3-1 loss at Nice, finishing with 27 goals as the second best scorer.\n“It’s flattering to be not that far from Kylian,” Lacazette said. “I congratulate him for his season. And I’m happy because very few people thought that I was able of doing that on my return to Lyon.”\nMontpellier beat Reims 3-1. Reims striker Folarin Balogun scored a consolation to raise his tally to 21 in his breakthrough season. Born in New York, Balogun played for England at youth level but opted to play for the United States at senior level in May.\nAlso Lorient beat Strasbourg 2-1. (AP)",
  "word_count": 612,
  "scraped_at": "2026-02-14T02:09:58.137177",
  "_text_extracted": true
}