{
  "article_id": "98302eec1a76",
  "url": "https://www.nytimes.com/athletic/6391432/2025/05/31/champions-league-final-psg-inter-analysis/",
  "title": "Champions League final : PSG 5 Inter 0 – Desire Doue stars as Parisians end long wait to become European champions",
  "date": "20250531T220000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris Saint-Germain landed European football’s biggest prize on Saturday night, dismantling Inter 5-0 in Munich to win the 2024-25 Champions League, only the second French side to win the competition after Marseille in 1993.\nPSG have made a habit of starting quickly in the Champions League this season and the final was no different, Luis Enrique’s team finding themselves 2-0 up after 20 minutes thanks to goals from Achraf Hakimi and Desire Doue. In an era in which showpiece events can be sterile, cagey affairs, this was very much business as usual for the French champions.\nAdvertisement\nTo their credit, Inter improved after half-time but the game was sealed just after the hour mark when Doue scored his second of the evening after delightful work from Ousmane Dembele and Vitinha. Further goals from Khvicha Kvaratskhelia and Senny Mayulu were merely the icing on a highly impressive cake. Their winning margin of five goals is the biggest ever recorded in a Champions League final.\nThe Athletic’s writers break down the key moments from a memorable game.\nPSG are Champions League chokers no more\nCan you really have much European Cup heritage when your club is only 54-years-young, has spent only 40 of those years playing at this rarefied level, and just 12 of them at these late, defining stages of the competition?\nWell, yes you can, if you’re Paris Saint-Germain: you can have a heritage of failing and falling short, of calamity and collapse, of wasting talent and resources at an unprecedented scale.\nIn recent years, such a commanding first half performance — soaring into a 2-0 lead inside 20 minutes — might still have set us up for another night of schadenfreude across much of the rest of Europe.\nBut as everyone has been at pains to point out on the road to Munich and throughout PSG’s run to this final, those Benzema hat-tricks at the Bernabeu, late Rashford penalties and ‘remontadas’ now feel a thing of the past.\nEveryone expected Luis Enrique’s side to at least dominate possession. In the end, they dominated entirely. For all the talk of Inter’s threat on transition after their helter-skelter semi-final with Barcelona, the Serie A side were contained, controlled and totally overcome.\nThe Qatari state’s vision of a team of superstars lifting European football’s greatest prize has not come to pass, but it was perhaps inevitable — given the level of expense — that at some point, PSG would make history.\nAdvertisement\nAnd this young, hungry, brilliantly-talented team — such a departure from the PSG sides of the recent past — may well be the future, too.\nMark Critchley\nWhat to make of Inter’s season?\nInter were on course for a treble going into the end of April. Emulating the immortals of 2010 was an opportunity they cautiously believed in seizing.\nIn the end, Inter finished the season empty-handed — unless the Club World Cup figures as a goal.\nIt is hard to imagine an exhausted team being up for it. Much has been made of the average age of this Inter team and how the squad needs to undergo a rejuvenation over the summer.\nOverseeing that process will be president Beppe Marotta and sporting director Piero Ausilio who will meet head coach Simone Inzaghi this week to discuss his future.\nIn addition to new younger players, Inter might be in need of a new coach if Inzaghi decides he has taken this team as far as he can.\nMake no mistake, this has been a painful week for Inter.\nLosing the Scudetto on the final day was hard to take. But the pain would have been salved had they won the Champions League, the only trophy this group of players is missing.\nGetting over the disappointing denouement of this campaign will take a long time. It will live with these players for the rest of their careers.\nJames Horncastle\nDesire Doue announces himself on the biggest of stages\nDesire Doue has been enormous fun this season. PSG have such a glut of talent that standing out in their crowd would be a challenge for almost anyone, but Doue has often been a delight — and perhaps that’s because he has felt so new and novel during this Champions League run.\nMost people knew his name a year ago, when he became a gossip column staple ahead of his transfer from Rennes, but how many really appreciated his body of work or could speak descriptively on what made him so talented?\nIn material terms, Doue had an exceptional impact on this final. His drifting movement behind Inter’s defence created the first goal and he scored the second, running the length of the pitch to keep up with a counter attack and eventually receive Ousmane Dembele’s superb final pass.\nAdvertisement\nHis second goal was more than a moment; it was history. It put the game beyond doubt and put Inter away.\nBut Doue is in this rare territory in which, other than for those who watch him in Ligue 1 every week, he is doing something different in every Champions League round. A bit of skill. A type of finish. Some nous that he was presumed not to possess.\nFirst and foremost, his assist and goals have won his team the European Cup for the first time. That matters more than anything else. But his part in that historic achievement comes in a specific context — he has spent the year gently exploding into the mainstream, with this final crescendo in Munich, in the biggest club game of all.\n1+1 – Paris SG’s Désiré Doué is the sixth different player to both score and assist in a UEFA Champions League final, while at 19 years and 362 days, he’s the youngest to do so. Star. pic.twitter.com/6k8X0j3Fvj\n— OptaJoe (@OptaJoe) May 31, 2025\nSeb Stafford-Bloor\nA typically fast start from PSG\nExplosive starts accelerated PSG past Liverpool, Aston Villa and Arsenal in the knockouts, and their two early strikes tonight quickly put the game to bed. It might sound simple, but consistently striking early in the knockout stages has helped them to seize control and throw their opponents’ carefully laid game plans into disarray. Luis Enrique’s side has now scored nine goals within the opening 20 minutes across their Champions League matches.\nThe immediate start looked inauspicious, though, as PSG booted the ball straight into touch from kick-off. But this is how they often start games in the Champions League and the PSG machine clicked into gear almost instantly, suffocating Inter with their pressing and relentlessly pulling them out of shape with fluid rotations.\nLuis Enrique remarked that they “scored the goal early playing the way we play” after Dembele’s early strike in the semi-final against Arsenal. The opening goal in Munich similarly showcased their free-flowing attacking philosophy. Vitinha slipped a delicate pass to Doue on the left, who had drifted to the opposite flank, before squaring for right-back Achraf Hakimi, arriving in the box to tap home.\nAdvertisement\nBeyond the obvious advantage of taking the lead, PSG’s early goals provide the perfect platform to unleash their devastating counter-attacks — no side has scored more than their six on the break in this season’s competition.\nInzaghi’s side, unaccustomed to chasing games having trailed for only 16 minutes all tournament before the final, were forced to overcommit in search of an equaliser. That opened the door for PSG to launch a lightning-quick break just before the 20-minute mark, ending with Doue’s deflected finish.\nPSG have been quick out of the blocks throughout this Champions League campaign, and another blistering start tonight proved pivotal in sealing their first-ever title.\nConor O’Neill\nIn defence of Federico Dimarco\nAs pretty as PSG’s opening goal was, Federico Dimarco’s deep position clearly made it possible; Dimarco’s decision to drop behind his own defensive line was fatal, playing Doue onside and thereby opening up his own defence.\nThe habit of modern football is to damn players for any mistake. Especially when they are made in finals.\nBig reactions, big clicks, big social media currency; that’s the game. But it is worth remembering just how fast the game is at this level and how little time Dimarco had to make that decision. Surely he’s due some empathy?\nRemember this, too: making a cautious move in the opening minutes of a Champions League final, against a team loaded with attacking strength, who can move the ball quickly and with disguise is a very human thing to do — a natural act of self-preservation.\nAnd the deflection for the second: given the state of the handball law, players can be forgiven for taking that kind of stance when facing a shot, assuming a position that could survive even a split-second-by-split-second VAR replay.\nHe just got unlucky and, again, that’s something that can befall any player on any occasion.\nSeb Stafford-Bloor\nWhy didn’t Hakimi properly celebrate his goal?\nYou have to say it was pure class from Hakimi. The timing, the composure, the presence of mind, all on the grandest stage of all. No doubt about it. That was one of the all-time great non-celebration celebrations. The finish wasn’t bad either.\nAdvertisement\nCan you blame Hakimi? After all, whom among us can forget his 45 appearances for Inter during the 2020-21 season — some four years ago now — when he forged such an unshakeable bond with the Nerazzurri faithful as they sat watching behind-closed-doors game at home?\nIn all seriousness, it takes some real sangfroid to open the scoring just 12 minutes into a Champions League final and have the equanimity to not even look remotely happy about it, to hold your hands up in apology rather than start wildly windmilling.\nMaybe you would’ve preferred Hakimi to celebrate properly, but perhaps he knew the beating that was coming for his former side. And you imagine the Inter fans were thankful for it by full time. It was the only moment of the night that anyone in PSG shirt showed mercy.\nMark Critchley\nWould Barcelona have been better opponents?\nI wonder what a PSG vs Barcelona final would have looked like? That’s not to say that Inter did not deserve their place in Munich; they did, clearly.\nBut perhaps PSG-Barcelona would have taken on more of a basketball, back-and-forth feel, with each team trading stylish punches, in some sort of flair-off. Maybe.\nPSG still win that game, though. It would be a mistake to say that they just overwhelmed Inter with their attacking ability when they controlled the game, too, and nullified all of the Italians’ considerable threat. Where was Marcus Thuram? Where was Lautaro Martinez? Where were Nicolo Barella and Denzel Dumfries?\nAs Barcelona showed in the semi-final: they will always give their opposition a chance — either through naivety or imbalance. So, had they played PSG it might have been a more entertaining game, but such a street smart and talented team would surely have been too much for them, too.\nSeb Stafford-Bloor\nWhat did Luis Enrique say?\nThe PSG boss was delighted with how his side tackled both the game and the associated pressure of a major final. “There was so much tension coming into the game. I don’t know what to think about it. I don’t know if we can call it a masterpiece. We got off to a fantastic start, we found the right balance in terms of motivation. My team was exceptional.\nAdvertisement\n“There was so much pressure from Inter, it was very intense. Dembele was pressing Acerbi and the centre-backs, he was incredible. He didn’t give them room to breathe — their defenders couldn’t find their feet. And as soon as we had chances, we found the net. We were in cruise control. We had a great game.”\nEnrique was impressed at how hard his side worked for their historic victory. “I would give Dembele the Ballon d’Or for how he defended today! He worked hard, he was humble, so, without a shadow of a doubt he deserves that, not just for the goals that he scored but for the pressing. What a season from him. He was exceptional in this game.\n“On my first day at PSG, when my French was even worse than it is now, I said my ultimate goal was to fill the trophy cabinet. The only trophy that was missing was the Champions League, and here we are. We ticked that box, we were ambitious and we will continue to try to conquer the footballing world. It’s great when you can make people you don’t know happy. Our fans were 12th man on the pitch, the team reflects the supporters we have. I’m so happy, don’t know what else to say.”\nWhat did Simone Inzaghi say?\nThe Inter manager was realistic about his side’s performance in the final. “I think PSG deserved to win this match, absolutely. We are very disappointed, clearly, extremity disappointed, but we had a great campaign in the Champions League. I’m proud of our campaign. Clearly, we are not happy with tonight’s game. We didn’t play well and PSG outplayed us, a lot of pressing by them. They deserve credit.\n“We know defeats can make you stronger. Tonight’s defeat hurts a lot, like the loss we suffered in Istanbul. They were two very different matches. Tonights we were more tired than PSG. We weren’t fresh on the second ball. We contested our league until last Friday, they won it with two months to spare. They have great quality, a great team. Technically they are stronger than us, we knew that, so we had to be more clever. But we weren’t organised, and we deserved to lose. That’s the bottom line.”\nInzaghi was asked about whether he would remain as Inter’s coach for next season but was unwilling to discuss the matter. “It’s not the right time to talk about the future. We played 59 games this season, we got to this final, so it’s awkward to talk about my future now. These players deserve credit, they gave it their best shot. We’ve suffered a lot with injuries. I wouldn’t change these players for anyone else.\nWe’ve already signed two players for next year. We will have to sign more. The club supports us. The president was here, the board told me they are proud of what Inter achieved in these 59 matches.”\nWhat next for PSG?\nSunday, June 15: Atletico Madrid, Club World Cup group match (Pasadena Rose Bowl), 8pm UK, 3pm ET\nWhat next for Inter?\nTuesday, June 17: Monterrey, Club World Cup group match (Pasadena Rose Bowl), 2am Weds UK, 9pm ET\n(Top photo: Getty Images)",
  "word_count": 2439,
  "scraped_at": "2026-02-14T01:52:26.357219",
  "_text_extracted": true
}