{
  "article_id": "985c11f177ed",
  "url": "https://menafn.com/1105828253/Erling-Haaland-Withdraws-from-Norway-Squad-Due-to-Groin-Injury",
  "title": "Erling Haaland Withdraws from Norway Squad Due to Groin Inju ... ",
  "date": "20230321T141500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erling Haaland Withdraws from Norway Squad Due to Groin Injury\nHaaland picked up the groin injury while playing for Manchester City in an FA Cup match against Burnley on Saturday. Despite scoring a hat-trick in the 6-0 win, the injury has forced him to withdraw from the national team. The 22-year-old has been in exceptional form for Manchester City, producing 42 goals in 37 appearances so far this season. His outstanding performance in the club has made him one of the most sought-after footballers in the world, with many top clubs vying for his signature.\nHaaland's recent achievements in the Champions League have also been impressive. He netted five goals in Tuesday's 7-0 win over RB Leipzig, becoming the youngest player to reach 30 Champions League goals. His talent and skills have made him a key player for both his club and the national team, and his absence will be felt by Norway in their upcoming matches.\nHaaland previously played for Borussia Dortmund from 2020-2022, where he also made a name for himself with his exceptional performances. Despite his young age, Haaland has already established himself as one of the top footballers in the world, with his impressive goal-scoring record and remarkable skills on the field. His withdrawal from the national team due to injury is a setback for both Norway and his fans, but his fans will be hoping for a speedy recovery so he can return to the field and continue to dazzle audiences with his exceptional talent.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 306,
  "scraped_at": "2026-02-14T01:59:46.881127",
  "_text_extracted": true
}