{
  "article_id": "987c8104db68",
  "url": "https://www.dailyrecord.co.uk/news/scottish-news/kevin-bridges-buzzing-meets-man-31195143",
  "title": "Kevin Bridges buzzing as he meets Man United legend Peter Schmeichel after gig",
  "date": "20231015T173000Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kevin Bridges buzzing as he meets Man United legend Peter Schmeichel after gig\nThe Scots comedian posted the picture with the footballing icon after his show in Copenhagen.\nKevin Bridges was buzzing to meet a true footballing legend after a recent gig.\nThe funnyman met Man United icon Peter Schmeichel after his show in Copenhagen and uploaded a snap to Instagram.\nThe Scots comedian couldn't resist sharing his excitement to meet the football star.\nIn the adorable picture, Kevin stands on the stage of the DR Koncerthuset, pointing at Schmeichel with a beaming grin spread across his face.\nSharing the picture on Instagram, he wrote: \"The big man missing his son’s fitba to come see the bold me… appreciated! What a man, Peter Schmeichel.\" He added: \"Thank you Copenhagen and Bergen! Oslo tomorrow!\"\nTop UK & World stories today\nThe Glasgow-born funnyman will continue his sold-out European tour, The Overdue Catch-up, with dates in Belgium, Norway and the Netherlands before heading to New Zealand in early November.\nThere are also a number of Australian dates before he heads back to the UK at the end of November. You can find out more here.\nLegendary goalie Schmeichel was best known for his time at Old Trafford, and he captained the club to victory in the 1999 UEFA Champions League Final, helping Man United complete a historic Treble.\nHe also racked up over 100 caps for Denmark, and was key to his country's shock win at Euro 92 in Sweden.\nDon't miss the latest news from around Scotland and beyond - Sign up to our daily newsletter here.",
  "word_count": 266,
  "scraped_at": "2026-02-14T02:10:28.707701",
  "_text_extracted": true
}