{
  "article_id": "989d621b881c",
  "url": "https://www.theguardian.com/world/2023/mar/30/first-edition-home-office-asylum-seekers-cruise-ships",
  "title": "Thursday briefing : Why the Home Office latest idea to cut the asylum seeker backlog will run aground too | Immigration and asylum",
  "date": "20230330T061500Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning. You have probably been wondering, as an innately curious and sceptical consumer of the news, what sort of robust policy development work stands behind yesterday’s front-page grabbing government proposals to put asylum seekers on barges and cruise ships.\nIn lieu of an account from home secretary Suella Braverman, the Independent’s Lizzie Dearden has a timeline that may help answer the question:\nTuesday morning: Journalists are sent an embargoed watchdog report hammering the Home Office for its “highly inefficient” and “inadequate” spending on housing refugees.\nLater on Tuesday: The government starts briefing about its waterborne housing wheeze.\nTuesday midnight: The report is launched, but the headlines are about cruise ships and canal boats.\nWednesday lunchtime: The government announces its new accommodation plan, but the canal boat/cruise ship bit is mysteriously downgraded to a “possibility”.\nAnd that’s showbiz! Nonetheless, the immigration minister, Robert Jenrick, was pretty enthusiastic about what remained of the plan: scale back hotel accommodation in favour of the most basic possible conditions at disused military sites. Meanwhile, there are warnings that the UK’s stance could have a “domino effect” on other countries’ treatment of refugees.\nToday’s newsletter, with the Guardian’s Amelia Gentleman, is about what was promised, what actually happened, and why none of it is likely to make any difference. Here are the headlines.\nFive big stories\n-\nClimate crisis | The UK government will defy scientific doubts to place a massive bet on carbon capture and storage in undersea caverns, to enable an expansion of oil and gas in the North Sea. The “powering up Britain” strategy, to be unveiled today, will also include boosts for offshore wind and hydrogen but no new government spending.\n-\nSlavery | Experts from the UN have called for the British government and the royal family to scrutinise their historical links to transatlantic slavery and move towards restorative justice. The appeal comes after an apology from the Scott Trust for the role of the Guardian’s founders in slavery. Read more from the Cotton Capital series below.\n-\nFrance | A refuse workers’ strike in Paris was called off yesterday, leading to much of the 10,000 metric tonnes of festering rubbish that had accumulated on the streets being cleared. But union leaders said they would discuss resuming industrial action if Emmanuel Macron’s government does not revoke a new law raising the official retirement age to 64.\n-\nReligion | Ministers should be more aggressive in tackling oppression, violence and radicalisation in religious settings, a forthcoming review of the relationship between faith and the state will say. The recommendations are also likely to bolster calls for stricter oversight of Islamic groups, which have sparked anger among British Muslims in the past.\n-\nScience | Astronomers at Durham University have discovered an ultramassive black hole that is about 30bn times the mass of the sun, making it one of the biggest ever found. The scientists detected it using a new technique known as gravitational lensing. The team behind the findings described them as “extremely exciting”.\nIn depth: ‘This is not a problem of the country being overwhelmed – it’s Home Office incompetence’\nThe problem with the existing system\nNobody is a fan of the status quo, which sees more than 51,000 people seeking asylum accomodated in hotels at a cost of more than £6m a day – but that’s roughly where the consensus ends.\nTo the government, they are a cushy option, a “pull factor” luring refugees to Britain in search of some mythical luxury suite with 24-hour room service. If there is a crisis in the system, that is solely the fault of the refugees who are crossing the channel. Suella Braverman set the tone in her reaction to the recent problems at Manston detention centre: “It’s very clear who’s at fault, it’s the people who are breaking our rules, coming here illegally.”\nThose working in the sector – including, as Amelia Gentleman’s superb piece on Saturday about what happened at Manston makes clear, some of those at the Home Office – tend to see things differently. They point out that conditions in hotels are often unclean or unsafe, and residents get the princely sum of £9.50 a week to take care of themselves.\n“People you speak to in Calais are often not very well informed about the housing they will be in when they get here,” Amelia said. “But the idea they would be attracted by the idea of staying in a hotel – these are not cheerful places to live. I’ve spoken to Afghan refugees sharing a room with their children for 18 months, and becoming clinically depressed by the experience. What people want is to have their claims processed quickly, and to get on with their lives.”\nDiane Taylor has an excellent piece with more on this, and writes: “Asylum seekers hate being placed in hotels almost as much as the government hates putting them there.”\nMeanwhile, whatever the rhetoric about “illegal migrants”, 75% of initial decisions made in 2022 resulted in a grant of asylum. Instead, Amelia argues, the real cause of the crisis is the Home Office’s 161,000-strong asylum backlog, which has grown far faster than the number of asylum applications since 2017, while the number of decisions taken per caseworker has fallen hugely. In 2014, 87% of asylum applications were processed within six months; today, the figure is 10%.\n“What becomes really clear as you talk to people inside the Home Office is that it’s the complete impossibility of catching up with the backlog that is at the root of this,” Amelia said.\nSome 90% of those who came across the Channel in 2022 are still awaiting a decision on their claims. “A large proportion of the expense comes from the department’s inability to assess claims quickly enough, which means people are held at taxpayers’ expense for a crazy amount of time,” Amelia said.\nThe government’s plan to fix it\nThis is very far from the first time that the government has floated the idea of housing refugees in unconventional facilities like cruise ships – but there’s a reason it’s never come to fruition before.\nThe unfortunate preamble to Jenrick’s statement yesterday was a Bloomberg report (£) saying that a similar proposal was rejected last year because it turned out to be more expensive than hotels, as well as possibly illegal. The Times reported (£) that in 2020, a similar plan was “laughed off the table” by ministers and officials. (Here’s a handy thread describing the policy’s many lives and deaths – and Rajeev Syal runs through some of the pros and significant cons of cruise ships and some of the other options under theoretical consideration.)\nBy the time Jenrick spoke yesterday, the plan had softened to a commitment to “explore the possibility”. But he did have another idea: the use of disused military barracks.\nSome of his colleagues, who support the government’s policy so long as it isn’t carried out in their own constituencies, are not impressed. But Jenrick promised repurposed barrack blocks and Portakabins at three sites in Lincolnshire, East Sussex, and Essex. The maximum number to be accommodated across the three is 4,900. Again: 51,000 people in hotels.\nJenrick himself admitted that this would not fix the problem quickly, but promised more such sites to come. The trouble with that, said Amelia, is that it’s just very difficult to get a disused site rapidly set up for human habitation. “I spoke to a Home Office source who told me that these ideas come up over and over again – and they either get dismissed because they’re too desirable, or because they’re not appropriate for people to live in.”\nShe points to the fiasco over a planned reception centre at a former RAF base in the village of Linton-on-Ouse, which was eventually cancelled. “They spend months trying to get these things to work, but whether it’s planning reasons, or the local MP not liking it, or the difficulty of getting the correct sewage lines in place, they fall apart. You would need dozens of these sites to replace the hotel accommodation, and that isn’t going to happen.”\nWhat might work\nSort out the backlog, and the situation would look very different: instead of being stuck in hotels, asylum seekers would either be refused, or allowed to move on with their lives (and get a job). “It’s the only way to fix the problem, really,” Amelia said. “It has often felt like the sole focus has been stopping the boats, which is part of the politically useful drama of being seen to be tougher.”\nShe has detected some signs of grappling with the practical issues recently, like a recent decision to stop holding face-to-face interviews for asylum seekers from some countries and instead asking them to fill out a form – although that plan has issues of its own.\nBut the casework system has been beset with administrative problems and high staff turnover, as well as complaints about poor quality training. Fixing these problems is a lot less fun than banging on about canal boats, but if Rishi Sunak is to have any hope of reaching his target of clearing the backlog by the end of the year, they seem a lot more likely to be helpful. (Sunak, incidentally, has claimed that the backlog was twice as big under Labour; in fact, it was about an eighth of the size.)\n“That target looks completely unachievable at the moment,” Amelia said. “This is not a problem of the country being overwhelmed. It’s a problem of Home Office incompetence.”\nRead more from Cotton Capital\nA special series on how slavery changed the Guardian, Britain, and the world\n-\nLest we remember: how Britain buried its history of slavery | Gary Younge on how an undeniable fact was “buried under nostalgia for a more wholesome, moral, righteous past”\n-\nThe limits of liberalism in the kingdom of cotton | Michael Taylor on how the wealth of Manchester’s liberal establishment depended on the labour of enslaved Africans in the United States\n-\nHow the Guardian covered slavery | The paper supported abolition – but backed payment for enslavers, and criticised more radical campaigners, writes Jonathan Shainin\n-\nIf we can’t speak honestly about Britain’s links to slavery, we turn our backs on change | Today’s generation is not responsible for what happened two centuries ago – but it can be guilty of refusing to learn from it, writes Nesrine Malik\nWhat else we’ve been reading\n-\nRIP Paul O’Grady (above). Enjoy this life in pictures, these tributes from Russell T Davies, Suzy Eddie Izzard, and others, this reflection on his refusal to “sanitise” himself for mainstream acclaim – but getting it anyway, and this obituary, featuring a superb anecdote about how he dealt with a homophobic police raid on a club night. Archie\n-\nIn the New Yorker (£) Jeannie Suk Gersen revisited the high-profile case of Brock Turner, who in 2016 was convicted for three counts of felony sexual assault. In the end he was sentenced to just six months in jail, a decision which would trigger a successful campaign to remove the judge from his job. Suk Gersen unravels the unintended consequences of this recall election. Nimo\n-\nYou don’t have to travel far to enjoy feelings of enchantment and wonder, writes Katherine May. It is always available to us as “an artefact of our own attention rather than a force that emanates from magnificent things,” May writes, and it is important that we all tap into it. Nimo\n-\nIf you’ve followed the fiasco of Green Day (not the band), you will know it’s been rebranded as “energy security day”. Whatever you call it, writes George Monbiot, it’s turned into a bonanza for fossil fuel companies. Archie\n-\nMichael Cragg heads into a time machine, back to the early 2000s, and takes a look at some of the surprisingly experimental and edgy pop music that was knocking about. Nimo\nSport\nFootball | Two goals in seven minutes from Frida Maanum and Stina Blackstenius led Arsenal to a 2-0 second-leg victory against Bayern Munich in the Women’s Champions League quarter-final (above), meaning they prevail 2-1 on aggregate. The 20,000 tickets sold exceeded the previous record for a midweek match in the tournament in England by almost 8,000.\nFootball | A Guardian investigation has found that Roman Abramovich secretly funded the takeover of Vitesse Arnhem, a Dutch top division football club, and financed it for years during the same time that he owned Chelsea. The leaked documents seem to show €117m (£103m) in secret funding for the club originated from Abramovich, despite repeated denials.\nAthletics | The Olympic medallist Laura Muir and her GB teammate Jemma Reekie have flown home from South Africa after a shock falling out with their long-term coach Andy Young. Several informed sources now believe that the partnership is over – which would leave two of Britain’s best athletes without a coach just 15 months from the Paris Olympics.\nThe front pages\n“Government defies experts with huge gamble on carbon capture,” says the Guardian this morning. Our front-page picture memorialises Paul O’Grady, and other papers also pay tribute. “Thanks for all the joy, Paul” says the Metro, while the Sun has “Ta-ra Lily, ta-ra Paul”. “Smiling til the end” is the Mirror’s main headline.\nThe Daily Telegraph leads with “Households to face net zero penalty for gas use”. The Daily Express says “Fears of revolt halt pension age rise”. “MPs demand inquiry after Sunak gave budget boost to firm linked with his wife” – that’s the i, while the Daily Mail’s splash is “Children ‘put at risk’ by gender ideology in schools”. The Times’ take on that is “Parents kept in dark over gender”. The top story in the Financial Times is “Ermotti returns as UBS chief to steer $3.5bn Credit Suisse rescue mission”.\nToday in Focus\nWhy are British teenagers being locked up in ‘re-education camps’?\nSecretive centres that promise to change the behaviour of wayward western teenagers and young people have been springing up in Somalia. But what really goes on inside? Nimo Omer reports\nCartoon of the day | Steve Bell\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nWhen he was 19, Thomas Leeds was in a serious road accident and needed surgery to remove a blood clot from his brain. While he could still walk and talk afterwards, something crucial was missing: his memories. For years, he revisited places that he was told he had been to as a child to reboot his memories, but nothing worked. That was until the night before his 30th birthday, when he was parsing through a playlist of 80s music: “The Whole of the Moon by the Waterboys began to play and I was transported.”\nA series of memories began to wash over Leeds – a Christmas tree, a silver stereo, a young woman that he recognised as his mum. This short but magical moment was a turning point for him – he decided that he was going to realise his childhood dreams of becoming a writer. Ten years later, Leeds has written a novel, the first in a series about a boy who wakes up with no memories.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 2592,
  "scraped_at": "2026-02-14T01:48:06.473087",
  "_text_extracted": true
}