{
  "article_id": "98a993502e88",
  "url": "https://theathletic.com/4698943/2023/07/19/chelsea-chilwell-maatsen-hall-cucurella/",
  "title": "Pochettino to cast his eyes over the pretenders in the Chelsea left - back logjam",
  "date": "20230719T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea travelled to the United States on Monday with a squad that, due to a combination of injuries and sales, looks startlingly thin in some positions — but left-back is not one of them.\nMauricio Pochettino can count upon four players in his 29-man touring party who could credibly command minutes on the left of his back four in the Premier League next season: Ben Chilwell, Marc Cucurella, Ian Maatsen and Lewis Hall.\nAdvertisement\n“Yes, we have cover in the position, but there is nothing guaranteed,” said the head coach on Tuesday. “Ian and Lewis are younger, but Marc and Chilly are experienced players.\n“We will see what happens. Competition can only increase the performances.”\nChilwell will go into the season as the undisputed first choice, his status strengthened by his successful recovery from the ACL injury that curtailed his 2021-22 campaign and his decision to extend his Chelsea contract until June 2027 in April.\nBehind him the landscape is more fluid.\nMaatsen and Hall have no shortage of advocates inside and outside Chelsea after making big developmental strides last season, and their positive individual progress stands in stark contrast to Cucurella’s often painful struggles in his first year at Stamford Bridge following a transfer from Brighton worth up to £60million ($78.5m).\nMaatsen can credibly argue that he is ready to make the step up to being Chilwell’s understudy, having played a key role in Burnley’s dominant run to Championship promotion as league winners last season. Hall was the academy breakthrough story of the season at Chelsea in 2022-23, and appeared to leapfrog Cucurella in caretaker manager Frank Lampard’s left-back pecking order in the final weeks of a miserable campaign.\nCucurella, however, does not appear to be going anywhere this summer. His aim is to prove he is a better player than he showed last season, when his adaptation from Brighton was seriously impacted by a burglary at his new home shortly after joining.\n“For sure I want to stay at Chelsea,” he told a press conference in Chapel Hill, North Carolina, on Tuesday ahead of the friendly against Wrexham. “I am very happy here. Sometimes you need time to adapt, and it was not an easy (first) season. When you arrive at a big club you feel pressure and, when the results don’t arrive, you feel more pressure. One of the most important things in players in confidence. This is part of life — we learn to improve in the future. But we have a new season and a new coach.”\nAdvertisement\nThe broader instability at Chelsea in 2022-23 hardly helped either, but Cucurella still feels the confidence of the club’s hierarchy — now fronted at Cobham by co-sporting directors Laurence Stewart and Paul Winstanley — to get back to his best performance level and push Chilwell.\nIn any case, there is no market to buy the Spaniard for anything close to the price Chelsea paid Brighton to acquire him last summer; Newcastle made it clear early on that they would not be in the running while Atletico Madrid, another widely reported Cucurella suitor, have already moved to sign a much cheaper left-back option in Javi Galan from Celta Vigo.\n“If the competition is high it is better for the level of the team,” Cucurella added. “The manager will choose the best option and we need to be ready.”\nAs reported by The Athletic last month, Maatsen’s first preference is to fight for first-team minutes at Chelsea, and he believes he is ready to do so. But if Cucurella remains, it becomes very hard to see where those minutes would come from.\nLast season’s total of 50 matches across all competitions — down from a gruelling 63 in 2021-22 — included a run to the Champions League quarter-finals. With no European football of any kind at Stamford Bridge in 2022-23, Chelsea will need to progress deep into the latter stages of the Carabao Cup and FA Cup to get close to that number again.\nBurnley remain favourites to re-sign Maatsen on loan, having so far declined to meet Chelsea’s asking price of £20million to buy him. The 21-year-old does, however, have an enticing array of alternative options, with West Ham, Nottingham Forest, Benfica and Wolfsburg all having expressed interest in recent weeks.\nChelsea’s trip to the U.S. will also be an important moment for Hall to find out exactly where he stands with Pochettino. Despite earning the bulk of his senior minutes as a left-back or left wing-back in 2022-23, the academy player of the year was listed as a midfielder in the article announcing the tour squad on the club’s official website.\nThat is notable for two reasons.\nAdvertisement\nFirstly, midfield is still the area of the pitch where Hall feels most comfortable and where he sees his professional future. Secondly, there are so few true central midfielders at Pochettino’s disposal in the pre-season group that he may well get a real chance to impress in something closer to his natural role, thereby lessening the left-back logjam.\nHall is understandably keen to maintain the momentum of a breakthrough season that saw him make 11 first-team appearances across all competitions as an 18-year-old, eight of which were starts in the Premier League. Surpassing those numbers in 2022-23 may prove particularly hard given the more sparse nature of Chelsea’s schedule, unless he can also establish himself as a reliable squad option in central midfield.\nPochettino’s view of Hall’s primary position on the pitch and place in the squad should be clarified over the course of the pre-season fixtures. If necessary, finding a suitable loan for the Cobham graduate would not be difficult; he has admirers at clubs throughout the Premier League and, particularly, elsewhere in London.\nChelsea are in a relatively strong contractual position with Hall, having quietly triggered an option to extend his deal through to 2026 back in February. But, just as with Maatsen, there is a clear incentive to find the path that maximises his chances of maintaining his upward trajectory.\nPochettino will consider his current left-back glut a good problem to have, particularly relative to the more fraught situations he faces in other areas of the squad. The long-term loss of Wesley Fofana to a cruciate knee ligament injury has drawn the focus, understandably, towards the depth of quality he boasts at centre-half in his squad.\nBut, on the left, the new head coach has real talent to work with coupled with plenty of motivation to impress. Tracking the decisions he makes, starting against Wrexham on Wednesday, will be one of the more intriguing subplots of Chelsea’s adventure across the Atlantic.\nGO DEEPER\nPochettino makes immediate impression as reinvigorated Chelsea depart for the United States\nAdditional reporting: Andy Jones\n(Photos in top image: Catherine Ivill/Getty Images; Rob Newell – CameraSport via Getty Images; Darren Walsh/Chelsea FC via Getty Images)",
  "word_count": 1143,
  "scraped_at": "2026-02-14T02:00:36.696572",
  "_text_extracted": true
}