{
  "article_id": "98b79a698530",
  "url": "https://metro.co.uk/2025/08/12/man-utd-player-rejects-transfer-approach-told-will-never-play-a-big-club-again-23897497/",
  "title": "Man Utd player rejects transfer approach and told he will  never play for a big club  | Football",
  "date": "20250813T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jadon Sancho has rejected a transfer approach to leave Manchester United and been told he will ‘never play for a big club again’.\nThe former England winger was hoping to earn a permanent move to Chelsea after being sent on loan to Stamford Bright last season.\nChelsea had a £25m option to keep Sancho but instead decided to pay a £5m penalty to send him back to Old Trafford.\nRuben Amorim has no plans to reintegrate Sancho into a first-team squad which is preparing for Sunday’s Premier League opener against Arsenal.\nSancho has been in talks with a number of Serie A clubs but received another transfer option this week in the form of Besiktas.\nThe Turkish club’s president Serdal Adali said: ‘Just as much as the community wants him, I want him too. What matters is not only our desire, but also if the player wants to come to Turkey.\n‘We have a budget, and we will do our best to bring him here. Players like Jadon Sancho usually prefer clubs playing in the Champions League.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Whether it happens today or not, it is hard to say. If it is possible, we will get him. Besiktas fans can rest assured.’\nBut, according to transfer expert Fabrizio Romano, Sancho has rejected a reunion with former Manchester United boss Ole Gunnar Solskjaer in Turkey.\nThe 25-year-old is believed to be holding out for a move to Italy and has therefore rejected Besiktas’ advances, though his stance may change if he is still searching for a new club as the transfer deadline approaches.\nManchester United are hoping to sell Sancho for around £20m, which would represent a massive loss on a player they signed for £73m in 2021.\nSancho will ‘never play for a big club ever again’\nEx-Old Trafford striker Teddy Sheringham believes Sancho’s hopes of joining another ‘big club’ are slim following his recent struggles.\nThe best moments of Sancho’s career came across two spells at Borussia Dortmund but the Bundesliga club have ruled out another move this summer.\nSancho did help Chelsea qualify for the Champions League and win the Conference League last season but his individual performances were largely underwhelming.\n‘Jadon Sancho will definitely not play for a big club ever again,’ United hero Sheringham told Snabbare. ‘He will probably tell you that he can and he will but not for me.\n‘I see that he’s burned his bridges with the manager. He’s not even got a place in the changing room.\n‘Maybe if he’d be given another chance he could work for what Amorim wants but I know from experience once you’ve gone down that path of being unhappy and wanting out that it’s very hard to turn it around with the manager, with the supporters, with the other players.\n‘You’ve got to show an unbelievable mental desire to turn that around. It can be done, and I know he’s a talented lad, but I would be very, very surprised if that was the case now.’\nSancho is not the only member of Amorim’s ‘bomb squad’ this summer, with United also hoping to sell Alejandro Garnacho and Antony.\nRasmus Hojlund, meanwhile, is free to leave following the signing of Benjamin Sesko from RB Leipzig. AC Milan are interested in the Denmark international.\nHojlund has spent two underwhelming seasons at Old Trafford but Sheringham sympathises with the 22-year-old.\n‘I like his battling qualities, his endeavour and his desire,’ Sheringham added. ‘That’s what is needed when things are going tough.\nMore Trending\n‘But for me, he hasn’t had the service. If he was missing four chances a game, you’d look at him and go, how can he still carry on playing?\n‘But he’s not. He’s having one chance every three games and snatching at it and not scoring. You can’t feed off things like that as a striker.\n‘You need to be having those four chances and grabbing two of them then getting your confidence from there. I really feel for him. I think it’s harsh to criticise him given the way that Manchester United play.’\nIt remains to be seen whether Hojlund will still be a United player by the time Arsenal travel to Old Trafford for a mouth-watering Premier League opener on Sunday.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Wayne Rooney sends message to Liverpool over Alexander Isak transfer\nMORE: Chelsea hit stumbling block in bid to sign Alejandro Garnacho from Manchester United\nMORE: Manchester United match abandoned after horror injury as club give update",
  "word_count": 818,
  "scraped_at": "2026-02-14T01:52:36.777489",
  "_text_extracted": true
}