{
  "article_id": "98bcb26727d0",
  "url": "https://thepeoplesperson.com/2024/05/28/al-nassr-have-numerous-reservations-regarding-casemiro-deal-280879/",
  "title": "Al Nassr have numerous reservations regarding Casemiro deal - Man United News And Transfer News",
  "date": "20240528T133000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saudi Arabian side Al Nassr reportedly have reservations about signing Manchester United midfielder Casemiro.\nThe Brazilian is one of the most respected and decorated midfielders of his generation, possessing an outstanding five Champions League winners medals while at Real Madrid.\nWhilst hardly reaching the same level of importance, the trophies have continued to flow as he has won the Carabao cup and FA Cup during his two years in Manchester.\nHowever, on a personal level, this season has been nothing short of a disaster.\nHe has been frequently caught out of position in the midfield and has looked totally lost with the frenetic pace of the Premier League overwhelming him at times.\nWhat’s more, he has been a victim of Erik ten Hag’s peculiar decision to rip up last year’s playbook and opt for a more transition-based, chaotic type of football, that does the Brazilian no favours with his lack of mobility.\nA shift to centre back also hardly helped the situation with numerous pundits highlighting how badly he has struggled in the temporary role.\nThere was controversy as Casemiro was not part of the starting lineup in the final and reportedly told Ten Hag that he wanted to play no part in the crucial match against Manchester City.\nAll of the above, plus his huge wages, have resulted in United looking to offload the player this summer and the most frequent rumours link him with a move to Saudi Arabia, with the midfielder reportedly accepting that his future lies in the Middle-East.\nHowever, Cristiano Ronaldo’s side Al Nassr have reservations about a deal according to goal.com.\nThe website states that “the marriage between Casemiro and Manchester United appears to be heading towards an end.”\nIt has been reported that “Al Nassr would be one of those interested clubs”, however, the club do have concerns surrounding a deal.\nGoal claim that “there is some scepticism at Cristiano Ronaldo and Luis Castro’s club, both due to Casemiro’s recent form and the 32-year-old midfielder’s older age. United estimates that they could negotiate him for a value close to €35 million, but the amount would hardly be agreed with the Saudi club.”\nIt has been previously relayed here that Al Nassr would be prepared to bid €40 million for the midfield general but the latest reports seem to suggest United will not get so lucky.\n“Furthermore, Al Nassr understands that they already have Croatian Marcelo Brozović as their first option for the position and may consider directing spending to other areas of the field this window.”\nInterestingly, the report also claims that Casemiro’s future is not tied to Ten Hag’s and that he “is not part of the new management’s plans” whoever is in the hotseat next year.\nWhat is clear is that the future of the Brazilian must be sorted quickly, so United can use any money saved from his wages to go towards improving the numerous areas of the pitch that need bolstering so the fans can see the team they saw at Wembley on Saturday more consistently through next season.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 531,
  "scraped_at": "2026-02-14T01:48:52.520003",
  "_text_extracted": true
}