{
  "article_id": "98d9776c9f21",
  "url": "https://www.teamtalk.com/arsenal/major-star-ready-quit-arsenal-join-big-six-rival-shock-arteta-decision-backfires",
  "title": "Major star  ready to quit  Arsenal and join  big six  rival as shock Arteta decision backfires",
  "date": "20240224T183000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nMajor star ‘ready to quit’ Arsenal and join ‘big six’ rival as shock Arteta decision backfires\nA second report has doubled down on claims one of Mikel Arteta’s own high profile signings wants to quit Arsenal thanks to a shock transfer decision made last summer, while a move to a ‘top six’ rival has also been touted.\nThe Gunners have spent heavily in Arteta’s reign at the Emirates and by and large they’ve spent well. Arsenal have proven they weren’t one-season wonders and are once again entrenched in a genuine title race. Conceding a last-minute winner to FC Porto in the Champions League did sting, though Arsenal will fancy their chances of progressing when the final whistle blows in the Round of 16 second leg.\nThe goalkeeping position is one that has seen major change during Arteta’s spell. Aaron Ramsdale initially displaced Bernd Leno when plucked from Sheffield United for £30m.\nHowever, just two years later Arteta and Edu saw fit to sign an upgrade and duly moved for Brentford’s David Raya on loan.\nThe Spaniard is fully expected to sign with Arsenal outright at the conclusion of his loan spell. Raya already knows he’ll walk straight into the starting eleven once arriving outright given he’s been heavily favoured during his loan spell.\nArteta initially talked up the idea of rotating between Raya and Ramsdale depending on the opponent. However, it’s Raya who’s established himself as the undisputed No 1, thus relegating Ramsdale to the bench.\nA recent report from HITC claimed Ramsdale has taken a dim view of his demotion and would be receptive to leaving at season’s end.\nFurthermore, the report claimed London rivals Chelsea are interested in snapping up the England international.\nSanchez out, Ramsdale in at Chelsea?\nThe Blues have signed two new goalkeepers last summer when landing Robert Sanchez (£25m) from Brighton and Djorde Petrovic (£14m) from New England Revolution.\nSanchez had got the nod prior to sustaining a knee injury in December, though his displays left a lot to be desired.\nPetrovic hasn’t put a foot wrong when deputising, though per Football Insider, Chelsea want to sign a new No 1.\nTheir plan is reportedly to sell Sanchez, sign a new starter and revert Petrovic to a bench role.\nNow, according to a new update from HITC, Ramsdale could be the new No 1 Chelsea crave.\nRamsdale wants out of Arsenal\nThey state the 25-year-old can see the writing on the wall at the Emirates and is now ‘ready to quit Arsenal.’\nRamsdale simply seeks regular game-time and if Chelsea can make that guarantee, there appears no reason why a transfer can’t take shape.\nNewcastle also get a mention in the fresh report, though whether Ramsdale would supersede Nick Pope as undisputed No 1 at St. James’ Park remains to be seen.\nPrior reports have suggested Arsenal would command a fee in the £50m range before greenlighting Ramsdale’s exit.\nSuch a sum would generate a sizeable profit for the Gunners, though would deprive them of a proven performer thanks in large part to their surprise decision to sign Raya.",
  "word_count": 520,
  "scraped_at": "2026-02-14T01:56:44.619766",
  "_text_extracted": true
}