{
  "article_id": "98f1e0279f6e",
  "url": "https://theathletic.com/4173489/2023/02/11/jurgen-klopp-turned-doubters-into-believers-once-already-at-liverpool-now-he-must-do-it-again/",
  "title": "Jurgen Klopp turned doubters into believers once already at Liverpool . Now he must do it again",
  "date": "20230211T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Over the course of Jurgen Klopp’s unhappy final season in charge of Borussia Dortmund, his friend and lieutenant Peter Krawietz felt the old certainties being replaced by doubts.\n“Your head is full questions,” Krawietz, now Liverpool’s assistant manager, said in Raphael Honigstein’s Klopp biography Bring The Noise. “‘Is it your fault? Is it the team’s? What shall we do?’\nAdvertisement\n“It was an extremely shitty situation, more than anyone could really bear. You don’t wish that kind of spell on your worst enemy. It was unbelievably exhausting, unbelievably depressing.”\nBarely a year after reaching the Champions League final, Dortmund went on a run that saw them lose 11 of their first 19 games of the Bundesliga season. In early February they were bottom of the table, an astonishing fall from grace for Klopp and his team.\nEventually, they rallied to win five and draw two of their next seven games, moving away from the relegation zone and ending up in seventh position. But after seven years, two Bundesliga titles, a German Cup, two German Super Cups, one Champions League final and more magical moments than their fans could ever have dreamed when he arrived from Mainz in 2008, Klopp told the Dortmund hierarchy in early April 2015 that he, his players and the club needed a change.\nThere is no hint of that at Liverpool, where Klopp is suffering what seems like another case of the seven-year itch.\nHis beloved “mentality monsters”, who excelled over a remarkable four-year period by winning the Champions League, the Premier League, the Carabao Cup and the FA Cup, reaching another two European Cup finals and twice taking Pep Guardiola’s all-conquering — and, it is alleged, rule-breaking — Manchester City to the final day in the Premier League, have looked jaded and miserable almost from the moment this season began.\nSo too, frankly, has Klopp.\nFew managers seem to enjoy the highs as much as Klopp, grinning from ear to ear, bear-hugging his players, fist-pumping to the crowd, struggling to containing himself in post-match interviews (“Boom!”).\nAnd few managers seem to take the lows quite so personally. Klopp’s infectious energy gives way to something much colder and frostier. Among players, staff, supporter and media alike, the change is hard to ignore.\nThere are some undeniable parallels with the situation at Dortmund, not least the sense that a group of players, having pushed so hard over such a sustained period, has run out of steam. There are some notable differences too — Klopp said in October that the two situations were “completely different”, citing the difficulty at Dortmund of losing Mario Gotze and Robert Lewandowski to Bayern Munich — but certainly Liverpool’s campaign has called to mind the seventh-season “spiral” that Krawietz mentioned in Germany.\nAdvertisement\nKlopp has appeared as bewildered as anyone by Liverpool’s struggles: from a team defined by its resilience, energy, intensity and killer instinct to one that has played so insipidly so often this season. They are tenth in the Premier League, 21 points behind leaders Arsenal and 11 points adrift of the top four, having won just eight of their 20 matches. As poor as their results have been, performances have arguably been worse.\nWe have been writing about this all season, going round in circles, highlighting the dysfunction in midfield, the injury problems, the age profile of a squad that is now among the oldest in the Premier League, the alarming vulnerability to certain types of attack. As the malaise has spread, we have looked at the struggles of various individuals — Trent Alexander-Arnold, Fabinho, Mohamed Salah, Darwin Nunez — and how the defence has gone from imperious to uncertain, from susceptible to counter-attacks to conceding just about every type of goal imaginable, often in the opening minutes of a game.\nOver time it becomes harder to differentiate symptoms and cause. We saw it earlier in the season with the debate over Alexander-Arnold’s form; were his defensive lapses causing the team to struggle, or were the team’s struggles causing his lapses? Is the midfield broken because of Fabinho’s and Jordan Henderson’s travails or have their levels dropped because they, having been run into the ground last season, have been overstretched by weaknesses elsewhere?\nAll of it, arguably, stems from bigger, wider issues, whether they relate to physical or mental fatigue after a gruelling 63-match campaign ended in disappointment on two fronts, or the constraints of Fenway Sports Group’s self-sustaining business model, which since the 2019 Champions League triumph has seen Liverpool outspent in the transfer market by 10 Premier League clubs (including West Ham United, Aston Villa, Wolverhampton Wanderers and Leeds United — and if you want to extend that to net spend, you can add Southampton and even newly-promoted Nottingham Forest to that list). Liverpool have bought Thiago Alcantara, Diogo Jota, Ibrahim Konate, Luis Diaz, Nunez and Cody Gakpo in that time, but more could and should have been done, surely, to refresh and rejuvenate the squad from a position of strength.\nIt has left Liverpool needing a bigger rebuild or reset than Klopp would previously have imagined. He has touched on this in recent weeks, rejecting the notion that he is “too loyal” or the suggestion that he might struggle to move on players who have served him so well for so long.\nAdvertisement\nKrawietz made the point, upon leaving Dortmund, that “it would have needed a revolution, a changed team with a changed playing style,” so “wasn’t it easier to change the face up front?” He and Klopp felt that was the right thing for the club — a fresh start for everyone — but it is worth noting that others disagree to this day. “It would have been better if we changed the entire team, not the coach,” chief executive Hans-Joachim Watzke said subsequently.\nAt Liverpool, by contrast, Klopp intends to stay on and rebuild. For that, the club’s supporters and the owners can be thankful. As former Liverpool defender Jamie Carragher said in his latest column for the Telegraph, Klopp is “definitely the man” to conduct that overhaul, provided he has the energy for it.\nHe has expressed enthusiasm for that particular challenge even if, in his recent interview with Michael Calvin’s Football People podcast, he pointedly suggested he would not be able to do it like “Chelsea with the new ownership” when “nobody knows exactly how they do it, how they can spend this much money”.\nKlopp hates talking about transfers — at his own club, at least — because he feels it is reductive and insulting to suggest problems can only be resolved externally.\nBut it has become unavoidable because things have been allowed to drift. The midfield department has fallen into disrepair. It always seemed illusory for Klopp to talk of strength of depth in that area, given the ages of James Milner, Henderson and Thiago and the injury records of Naby Keita and Alex Oxlade-Chamberlain, but there is no glossing over the issue now.\nLast summer they wanted Aurelien Tchouameni, but he preferred Real Madrid, as players very often do. Once again Klopp responded to questions about the need for reinforcements by talking up the strength of his midfield department, but this can now be seen as an exercise in saying the right thing rather than necessarily speaking his mind. By the end of August, with midfielders dropping like flies, he was admitting publicly that “from time to time I would like to risk a bit more”, but “we get told what is possible and what isn’t.”\nThe intriguing thing is that, even with Liverpool at a low ebb, the signing of Jude Bellingham remains a possibility this summer. Failure to qualify for the Champions League, or even the lesser European competitions, might not necessarily be a deal-breaker.\nBut three questions persist: 1) Can the Dortmund and England midfielder be convinced that any absence from the Champions League would be a mere blip? 2) Given the need to strengthens in several positions, would it be right to commit more than £100 million on a single player? 3) Are FSG willing to back Klopp in pursuit of his top transfer targets at a time when they are looking to sell the club?\nAdvertisement\nIt is worth recalling what Klopp said last April when he extended his contract to 2026. “There is a freshness about us as a club still and this energises me,” he said. “For as long as I have been here, our owners have been unbelievably committed and energetic about this club and it is clear that right now this applies to our future as much as I’ve ever known.”\nExcept that … within months The Athletic revealed that FSG were looking to cash in, whether by selling the club or finding someone willing to buy a minority stake. That has been unsettling, as has the decision to move FSG president Mike Gordon away from the day-to-day running of the club (which involved working very closely with Klopp) in order to focus on the search for investment, the loss of sporting director Michael Edwards and the resignation of his successor Julian Ward, who, having only taken over last summer, has been working his notice since November.\nSo that is uncertainty over the ownership, Gordon otherwise engaged, Edwards gone, Ward going and head of research Dr Ian Graham going. Jim Moxon, the club’s doctor, left abruptly in the summer and is working for Manchester United on an interim basis. Add to that a series of other backroom departures (head of performance Philipp Jacobsen, analysts Harrison Kingston and Mark Leyland) over the past couple of years and, in contrast to the on-pitch question, it starts to look like too much upheaval rather than too little.\nThat is the great contradiction of Liverpool in 2023. Stability behind the scenes has given way to a sudden sense of upheaval, while the squad that performed so well for so long has begun to stagnate at a time when more fresh blood was needed.\nLittle wonder that Klopp has looked agitated. He is known to be furious at reports suggesting that some within the camp have questioned the role of Andreas Kornmayer, his head of fitness and conditioning, and at former Liverpool midfielder Dietmar Hamann’s questioning of assistant manager Pep Lijnders. As personally as Klopp has taken criticism of his players at times this season, criticism of the coaching staff has gone down even worse.\nWhenever a long-serving manager is in difficulty (and there aren’t many of them these days), people mention the Sir Alex Ferguson principle of constantly freshening up his backroom team. Ferguson went through seven different assistant managers during his 26 years in charge of Manchester United. In the final 12 years alone he switched from Steve McClaren to Jim Ryan to Carlos Queiroz to Walter Smith to Queiroz (again) to Mike Phelan.\nIt always seems slightly overstated, though. Ryan and Smith were seen as stopgaps. Brian Kidd, McClaren and Queiroz (twice) all left to pursue managerial ambitions in big jobs (Blackburn Rovers, Middlesbrough, Real Madrid, Portugal) in some cases against Ferguson’s wishes. It was not a proactive policy and it would be an insult both to him and to, for example, Queiroz to suggest United’s success relied on a rapid turnover of assistant managers.\nAdvertisement\nOn the other hand, Arsene Wenger seemed to go stale at Arsenal with the same core of coaching staff around him for years (21 years in the case of his trusted assistant Boro Primorac). Wenger was the great moderniser of the Premier League in the mid/late 1990s, but by the 2010s — and certainly by the late 2010s — he and Primorac seemed stuck in their ways. For all this season’s issues at Liverpool, it would be hard to make the same assessment of Klopp, 55, and Lijnders, his 40-year-old assistant.\nIf there is a parallel with Wenger’s Arsenal tenure, it might relate to upheaval behind the scenes. Just as Wenger was left isolated by the departure in 2007 of his close ally, vice-chairman David Dein, so it would be entirely natural if Klopp feels unnerved by the change in Gordon’s position.\nGordon has been Klopp’s primary point of contact at boardroom level and a close ally from the moment the German joined the club in 2015. Klopp once described him as “the brain behind all the things at Liverpool”. Others might prefer to describe Edwards or Graham as such. What can be said with reasonable certainty is that the support network around Klopp does not look as strong, unified or focused as it did.\nWhen Edwards was leaving, there was a gradual handover to Ward in the hope of making that transition as smooth as possible. Subsequent developments would suggest it wasn’t smooth enough, but the idea was right. A year on, Ward is serving his notice and the search for his replacement is into its third month — an appointment Liverpool cannot afford to get wrong, given that this summer already looks far more challenging than the previous four.\nNone of this helps Klopp. None of it excuses this season’s failures either, but his whole ethos is based around unity, loyalty, everyone pulling — fast, hard — in the same direction and having fun. Right now, nobody at Liverpool seems to be having fun, least of all the manager. They can only hope the run of games coming up, against Everton, Newcastle United and Real Madrid, stir the collective soul.\nIt was no surprise that, at his pre-match news conference on Friday, Klopp ducked questions about the Premier League’s announcement that it has charged Manchester City with 115 breaches of financial regulations. He and the Liverpool hierarchy have questioned their rivals’ financial arrangements and commercial activity for years, but in the present circumstances he was in no mood to say, “Told you so.”\nCity deny any wrongdoing, but twice under Klopp (and once under Brendan Rodgers), Liverpool have lost out to them after taking the Premier League title race to the final day of the season. In some way, Klopp might feel vindicated by this week’s developments, but right now he seems more likely to feel wearied by thoughts of an alternative reality.\nAdvertisement\nSome managers are comfortable living from game to game, each one a war of attrition. Klopp isn’t like that. At Dortmund and again at Liverpool, it has looked quite like one long rollercoaster ride, an adrenalin rush of emotions and a near-constant sense of hurtling towards something unknown and impossibly exciting.\nThere is no manager you would want more in a situation like that, riding on the crest of a wave. But this is very different, reminiscent of the “extremely shitty situation” Krawietz recalls them enduring in Dortmund, “unbelievably exhausting, unbelievably depressing”.\nIt looks it too. And for all that Klopp might bristle when he is interrogated publicly, Krawietz’s words about their Dortmund experience suggest they are not afraid to ask themselves the same uncomfortable questions behind the scenes. It is just as well.\nOn his arrival in 2015, Klopp spoke of the need to turn doubters to believers. Seven largely glorious years on, he needs to do it again — and he is going to need more support, financially and otherwise.\n(Top image: Getty Images; design: Eamonn Dalton)",
  "word_count": 2548,
  "scraped_at": "2026-02-14T01:59:41.717323",
  "_text_extracted": true
}