{
  "article_id": "9900a62daa98",
  "url": "https://theprideoflondon.com/chelsea-interested-two-centre-backs-amid-defensive-struggles",
  "title": "Chelsea interested in two centre - backs amid defensive struggles",
  "date": "20251113T164500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Defence has been Chelsea's biggest area of weakness this season. The numbers tell a clear story. They have conceded the most goals in the top six. Now, a large part of that is down to the absence of Levi Colwill, their best centre-back, who suffered an ACL injury in pre-season and might not even return to action in this campaign. Even if he does, it will be in the latter portion of it.\nJust taking one centre-back out of your defence should not result in it collapsing though. The issue is, Chelsea's backline is filled with either injury-prone defenders like Wesley Fofana and Benoit Badiashile or average ones like Tosin Adarabioyo and Trevoh Chalobah. As for Jorrel Hato, he simply does not look ready.\nSo, it might be time to move on from a few of them and bring in a new centre-back capable of being a nailed-on starter, not a rotational option. And it appears that they have two in their sights. As reported by Simon Phillips, Chelsea are closely looking at Joel Ordonez and Ronald Araujo.\nNow, there are question marks around both of them. But at the same time, they have their unique strengths as well.\nChelsea interested in two centre-backs amid defensive struggles\nThere is no doubt that on his day, Araujo is an elite defender. He is a leader as well, something that Chelsea are missing in a squad full of youngsters. The issue is, he has proven to be very injury-prone. Another centre-back struggling with fitness issues is the last thing Chelsea need right now.\nOn the other hand, Ordonez fits the type of player Chelsea have constantly signed under the new ownership. He is 21 years of age and currently plays for Club Brugge. It would be a move based on potential rather than proven quality at the highest level. Then again, he is a regular for Ecuador at the international level and has played Champions League football as well.\nSo, there is a lot to like about Araujo and Ordonez, as well as some concerning areas as well. Would they be an upgrade on some of the options that Chelsea have at the moment? Most probably.",
  "word_count": 364,
  "scraped_at": "2026-02-14T02:03:26.532169",
  "_text_extracted": true
}