{
  "article_id": "9944b89e7383",
  "url": "https://justchelsea.com/posts/injured-kante-trains-at-cobham-as-chelsea-prepare-for-trip-to-france/",
  "title": "Injured Kante Trains at Cobham as Chelsea Prepare for Trip to France - Latest Chelsea Football News",
  "date": "20230319T143000Z",
  "domain": "justchelsea.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The injured midfielder was among those involved in the training at Cobham as part of the Blues’ preparation for their trip to Lille.\nN’Golo Kante was among those who were present at the training centre as the Blues put on their finishing touches ahead of their game against Lille in the UEFA Champions League. He took part in the session after missing the game against Brighton.\nAfter two straight wins in domestic competitions, the Blues have switched their focus on European football. They have been concentrating to get their first points on the board in Group H.\nChelsea boss, Frank Lampard said that the France international had a minor hamstring issue. Lampard said that not playing Kante recently was more of a precautionary move so as not to aggravate the condition. He said he is wisely using Kante so as not worsen the injury.\nAside from Kante, Kurt Zuoma was also present during the training session. He too was ruled out. Olivier Giroud was also there following similar reason. However, Long-time absentee Ruben Loftus-Cheek was not able to train. Antonio Rudiger and Emerson Palmiere were also not able to join the training. The three players were the only ones from Chelsea’s Champions League A-List who were not able to train with their 24-man squad.\nLampard Accepts Ross Barkley’s Apology\nBarkley who was recently involved in an incident in Liverpool on Sunday has apologised to Lampard and to the club. The Chelsea boss gave his opinion on this matter and said:\n‘He has travelled with us. In terms of permission, it’s not a problem to spend a day off in Liverpool. In the modern world the few hours to go up there and back is the least of my worries, especially when your family is there. It’s important for people to see them.\n‘To address the issue, he hasn’t [broken] a club code being out. The lads were given a day off on Sunday. He hasn’t committed a crime, other than eating chips in the back of a cab which is a bit out of order for the cabbie.\n‘But on a serious note, what he has done from my point of view has been naïve to be out on that evening, in the build-up to a Champions League game. He has admitted that as well, and very aware of that. On a professional level those are little things that shouldn’t happen.\n‘I like Ross and I have had no problem with him since he’s been here, in fact the opposite. He wants to do well for this club. This morning he admitted he made a mistake. I will take that one at face value, and we move on.’\n‘Unfortunately for them they live in a modern day. There are a lot of benefits, but there are difficulties that come with that. I don’t understand why, but people have to pick up their phone at first glance and video people in any moment that they think might be interesting to possibly sell or pass on. People will do that.\n‘What the lads need to do, firstly for their own benefit, and whether you’re a footballer or anybody growing up, is behave in the right way, and secondly be aware of the pitfalls.\n‘We have a very good bunch of lads at this club. I made mistakes as a player along the way, don’t we all. I have got confidence in them that they are professional lads who want to do the best for this club. They must take on their responsibilities off the pitch.’\nLampard has reminded his players to always be vigilant on and off the field. They must be aware especially when they are in the public.",
  "word_count": 618,
  "scraped_at": "2026-02-14T01:59:46.882526",
  "_text_extracted": true
}