{
  "article_id": "99533e9e3ae7",
  "url": "https://metro.co.uk/2023/10/29/pep-guardiola-makes-monstrous-dig-at-man-utd-board-after-man-city-win-19739399/",
  "title": "Pep Guardiola makes  monstrous dig  at Man Utd board after Man City win",
  "date": "20231029T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola made a ‘monstrous dig’ at Manchester United’s hierarchy after their 3-0 defeat at home to Manchester City on Sunday, according to Gary Neville.\nTwo goals from Erling Haaland and Phil Foden’s late strike sealed a deserved win for the champions at Old Trafford, leaving United with their fifth defeat in the Premier League this season.\nAfter the game, Neville claimed a ‘toxic’ culture at United’s boardroom level is having a negative impact on Erik ten Hag and the players.\nAnd Neville believes Guardiola highlighted the key difference between City and United in his post-match press conference as he posted on X: ‘That quote from Pep Guardiola is a monstrous dig into the running of United!\n‘Pep Guardiola on the secret of Man City: “We are in the same direction, me, the CEO, the sporting directors, the chairman. That is why I think the club is so stable”.’\nWhen asked about the difference between United and City after Sunday’s game at Old Trafford, Guardiola said: ‘I know what we have done but I don’t know what United have done because I’m not here.\n‘But I didn’t expect it, honestly, when I arrived here it was Jose Mourinho, with Ibrahimovic, with top, top players, Lukaku, I’ve had the feeling the squad is really…\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘But I think I’ve said many times we [City] are in the same direction – the chairman, the CEO, the sporting director, the manager and the players.\n‘We go there, wrong or right, it doesn’t matter, we [all] go there. We make mistakes, of course, when we lose or the situation is not going well, we are not here to blame someone, it’s just, ‘okay, what do we have to do better? What happened? Is the opponent getting better or are we getting worse?’. Find a solution, that is nice.\n‘We’ve done it since day one. First season we didn’t win, I didn’t feel my chairman complain, absolutely not, he supported me unconditionally.\nMore Trending\n‘I remember we lost the Champions League final against Chelsea, I was devastated and the chairman said, ‘sooner or later we’re going to win it, what do we have to do next?’.\n‘With that everybody feels that the club relies on me, the players know we rely on them, but when it happens we’re not over-excited when we win and when we lose it’s not dramatic, it’s not that we’re going to kill ourselves. It’s a football game, what do you have to do to get better.\n‘We have done many times, when another opponent beats you, you congratulate them and we try it again. That’s why I think the club, the organisation, is so stable.’\nMORE: Peter Schmeichel blasts Sofyan Amrabat after Manchester United’s defeat to Man City\nMORE: Arsene Wenger highlights two major Manchester United mistakes after Man City defeat\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 545,
  "scraped_at": "2026-02-14T02:13:18.803103",
  "_text_extracted": true
}