{
  "article_id": "999bee04725b",
  "url": "https://www.meathchronicle.ie/2023/12/13/how-do-manchester-uniteds-current-european-struggles-compare-to-2005-06-woes/",
  "title": "How do Manchester United current European struggles compare to 2005 - 06 woes ? ",
  "date": "20231213T171500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How do Manchester United’s current European struggles compare to 2005-06 woes?\nBy PA Sport Staff\nManchester United are out of Europe after they lost to Bayern Munich in their final Champions League group game on Tuesday.\nIt is the sixth time they have failed to qualify for the knockout stages and just the second they have finished bottom of the group, the other being in 2005-06.\nHere, we compare United’s struggles this season to one 18 years ago.\nUnited had to qualify for the group stage in 2005-06 after finishing third in the Premier League the previous season, but did so with ease. They were drawn in, what looked to be on paper, a favourable group alongside Villarreal, Lille and Benfica.\nAn opening draw against the Spanish side was followed by victory over Benfica, but then things went wrong. They took one point from a double-header against Lille, drew again with Villarreal before crashing out by losing to the Portuguese side.\nThe current crop of United flops were up against it from the beginning as they lost their opening two games to Bayern and Galatasaray. A home victory over Copenhagen was undone by defeat in the reverse fixture and when they squandered a lead in Turkey the writing was on the wall.\nHarry Kane’s Bayern then delivered a knockout blow in the final group game to ensure United did not even drop into the Europa League.\nThe 2005-06 United squad was one in transition but they still had some heavyweight names, especially in attack where they had a front three of Ruud van Nistelrooy, Wayne Rooney and Cristiano Ronaldo. Ryan Giggs was still in his prime while in Rio Ferdinand they had one of the best defenders in Europe.\nIt was a squad that should not have been going out in the group stages.\nThe recruitment that has seen the 2023-24 United group put together has been heavily criticised, with several underperformers and average players. Andre Onana’s wayward form in goal has arguably been crucial in their demise while Marcus Rashford’s displays have not matched last year’s.\nAntony appears not to have justified his hefty price tag while Scott McTominay, Diogo Dalot and Victor Lindelof may not be up to the standard required.\nUnited were hanging on the coat-tails of Jose Mourinho’s Chelsea and Arsenal, with their utter domination of English football a thing of the past.\nBut they were still consistent and ended up being the second best team in the league that year, behind the Blues. United lost just five games all season, four of them away, and finished with 83 points.\nThis season’s side have already lost seven of their 16 games so far, four of them at Old Trafford, which is no longer the fortress it once was. The fact they have not drawn any games has helped them into a position where they could mount a top-four challenge in the second half of the season but consistency would have to improve immeasuarably.\nAlex Ferguson remained in total control at Old Trafford, even with the disappointing European campaign. He was in the process of rebuilding a squad that would win the Premier League and Champions League again in the coming years. He was still respected and feared by his players and opponents and was very much the boss.\nErik ten Hag has some similar traits to Ferguson, especially surrounding discipline, but he is being undermined by poorly performing players. A promising start to his reign last season has capitulated this time around and he now appears to be in a fight to save his job.",
  "word_count": 599,
  "scraped_at": "2026-02-14T02:10:33.605767",
  "_text_extracted": true
}