{
  "article_id": "99ca9086eeb6",
  "url": "https://www.90min.com/posts/rio-ferdinand-reveals-two-big-factors-which-have-harmed-man-utd",
  "title": "Rio Ferdinand reveals  two big factor which have harmed Man Utd this season",
  "date": "20231024T111500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rio Ferdinand reveals 'two big factors' which have harmed Man Utd this season\n- Man Utd have lost six of their opening 12 games so far this season\n- Expectations were high for Erik ten Hag's side after outstanding 2022/23 campaign\n- Rio Ferdinand pinpointed two major reasons for underperformance this term\nManchester United legend Rio Ferdinand believes the inability of Marcus Rashford and Bruno Fernandes to recreate their stunning form from last season has contributed to the Red Devils' slow start to this campaign.\nErik ten Hag's side have already lost six of their 12 games across all competitions so far this term, though they have at least managed to arrest that slump with back-to-back Premier League wins against Brentford and Sheffield United.\nThey are, however, facing an uphill battle to avoid elimination from the Champions League at the group stage after losing to Bayern Munich and Galatasaray in their opening two fixtures.\nSpeaking to 90min ahead of Tuesday's visit of Kobenhavn, Ferdinand insisted that Man Utd must now win their remaining group matches in order to qualify for the knockout stages.\n\"They have to, they've got to win the home games especially,\" Ferdinand said.\n\"Obviously they got off to a terrible start against Galatasaray and didn't get the points they needed in that game but it's a huge game now, the pressure mounts even bigger on this game against Kobenhavn because of the first [home] game and the loss.\n\"They've got to perform. None of this 'maybe rest a few players here and there because they've got a tough schedule', they've got to go out and put the players on the pitch who are going to be able to perform and get the three points.\"\nTen Hag's first campaign in charge of Man Utd ended with a third-place Premier League finish - something few fans and pundits predicted before the season kicked off - and victory in the Carabao Cup to end the club's six-year trophy drought, raising expectations for his second season.\nPivotal to last year's success were the performances of Rashford and Fernandes. The England forward registered a career-high 30 goals in all competitions, while the Portugal midfielder scored 14 times and added 15 assists.\nNeither have been able to find their best form so far this season, totalling nine goal contributions in a combined 22 games for Man Utd to begin the 2023/24 campaign.\nFerdinand was asked whether he thought Man Utd were making progress after such a promising debut season with Ten Hag at the helm and what the reasons are for this sudden decline.\n\"I think if you'd asked me at the end of last season, I'd have said yeah, we're going in the right direction, I could see the style of football starting to take shape, the manager's been having to do a lot off the pitch in terms of culture and the stuff he's been really adamant to shift and change, that area needed work with other areas in the background,\" he said.\n\"But the season's started and for whatever reason - you could say injuries or lack of form or whatever it is - that kind of improvement we'd seen since Erik ten Hag came in has kind of faltered a little bit.\n\"I don't know [if Ten Hag is trying to do anything differently]. There's obviously some stuff that's just not clicking at the moment. I think there were two big factors last season as to why Man Utd improved, and that was Marcus Rashford and Bruno.\n\"Every time a result or moment was needed, one of those two came up with it, mostly the goals from Marcus. That hasn't been as fluid yet, they haven't been as impactful in terms of goal and assist output yet. But I'm hoping when that clicks, we'll be able to do that.\n\"But you want the team not to be so heavily reliant on individuals, and that's the problem.\"\nWhen asked if his expectations for Man Utd this season had changed, Ferdinand said: \"Yeah, it's obvious. I think every fan was quite optimistic before a ball was kicked. But since the season's started, like I said for many reasons, the team hasn't kicked on the way we wanted it to. There's been a lot of injuries, a lot of noise off the pitch for the manager to have to deal with.\n\"So it's been a difficult start, a difficult start to watch as a fan as well. But hopefully the last couple of result have instilled a bit of confidence, so hopefully the tables will turn a little bit.\"\nFinally, Ferdinand was asked to outline what he thought would now be a successful year for Man Utd.\n\"A trophy, Champions League football and being closer to the top teams. I think if you see that in terms of points but also in terms of the way you're feeling about the team as well, not just 'oh we're close but we're still miles off it'. You want to be closer with a real realistic thinking of next season we can challenge maybe, but it might be wishful thinking,\" he said.\nWatch Man Utd v Copenhagen live exclusively on TNT Sports 2 from 7pm on Tuesday 24th October. TNT Sports is available through its streaming destination discovery+ and across all major TV platforms. This isn’t Just Sport, This is Everything. For more info visit: tntsports.co.uk/football",
  "word_count": 901,
  "scraped_at": "2026-02-14T02:10:28.704615",
  "_text_extracted": true
}