{
  "article_id": "99cb7418d400",
  "url": "https://theathletic.com/4689494/2023/07/14/dele-overlap-everton-tottenham/",
  "title": "Forget what Dele might have become – his achievements are remarkable given everything he went through",
  "date": "20230714T051500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There was a moment, half an hour into an interview that must have felt more like a therapy session, when it all threatened to become too much for Dele Alli.\n“At six,” he said, “I was molested by my mum’s friend, who was at the house a lot. My mum was an alcoholic. And then…”\nAnd at this point, as English football’s lost prodigy rubbed at his face and let out the nervous chuckle that he describes as a coping mechanism, his eyes reddened, he mopped his brow, wiped his eyes and briefly disappeared under the rim of his baseball cap.\nAdvertisement\nGary Neville, who was one of Dele’s coaches in the England squad when the midfielder burst onto the scene back in 2015, reached over and held the Everton and former Tottenham Hotspur player’s knee in a show of support.\nDele wiped his eyes again and chuckled once more. “Sorry,” he said.\n“Don’t be sorry,” Neville told him.\nDele tried again. “So, that happened at six,” he says. “And then I was sent to Africa to learn discipline and then I was sent back. Seven, I started smoking. Eight, I started dealing drugs.”\n“Selling drugs?”\n“Selling drugs, yeah” — another nervous chuckle. “An older person told me they wouldn’t stop a kid on a bike, so I would ride around with my football and then underneath I would have the drugs and… yeah, so that was… At 11, I was hung off a bridge by a guy from the next estate, a man.”\nAnd as he kept talking about a traumatic childhood to which he had only referred obliquely in the past, everything Dele had already told Neville’s Overlap channel about his struggles over recent years — about mental health issues, excessive drinking, an addiction to sleeping pills and finding himself “in a bad place” at Tottenham at the age of 24, “literally staring in the mirror (…) and asking if I could retire” — made so much more sense.\nDele was English football’s golden boy: first-team regular at MK Dons at 16, a move to Tottenham at 19, man of the match on his first start for England against France, PFA Young Player of the Year at 20, scoring in a World Cup quarter-final at 22, playing in a Champions League final at 23.\nHe is seven months Jack Grealish’s junior and had anyone suggested back then that one of them would be English football’s first £100million player, nobody would have proposed it would be the guy struggling for consistency in the Championship at Aston Villa.\nAdvertisement\nIt often felt like Dele’s fall from grace happened the way Ernest Hemingway described: gradually, then suddenly.\nOne moment we were wondering why the goals had dried up and where the spark had gone. Was it tactical? Was it symptomatic of Tottenham’s stagnation? Had he, as was rumoured, taken his eye off the ball?\nThe next moment, he was falling out of favour at his club, losing his place in the England squad, being sold to Everton and then, within months, shipped off on loan to Turkish club Besiktas, where he made just 13 appearances last season, before returning to face what seemed like a bleak future on Merseyside. Rarely in modern times has a leading Premier League footballer fallen so far so quickly.\nBut the more you listened to Dele, who is now back in training at Everton after six weeks in rehab in a clinic in the United States, the harder it became to separate the decline over the past few seasons from the issues he had tried to bury in his troubled past. Drinking, popping sleeping pills (“definitely way too much”), losing his motivation and his purpose: these were symptoms of a wider struggle rather than the cause of his decline.\n“I definitely abused them too much,” he said of the sleeping pill addiction. “It got really bad at some points and I didn’t understand how bad it was. But I was never dealing with the route of the problem, which was when I was growing up, and the traumas I had, the feelings I was holding onto and I tried to deal with it all by myself. I didn’t want to tell anyone.”\nAnd then he said something else that will resonate with so many players and so many people in the public eye.\n“Don’t get me wrong,” he said. “I love football, it saved my life, I owe everything to football. But it’s not just as easy as everyone thinks it is. It’s not this ‘high life’. Yes, you have money, you can do a lot of things that you wouldn’t be able to do without it. But mentally, I don’t think people will ever understand until you’re in it, what it can do to you.”\nAdvertisement\nSome, such as Dele’s former Tottenham team-mate Harry Kane, seem to take it all in their stride, blessed not just with great physical or technical gifts but with the disposition and — crucially — the stable background to be able to deal with the intense glare of the spotlight and all that comes with it.\nFor many others, the sudden arrival of fame and vast fortune can be disorienting.\nThere are things Dele didn’t say about his childhood in Milton Keynes, but the “few incidents” he mentioned were enough to paint a picture of chaos. “They taught me in rehab I’m not allowed to say I was a bad kid, but I got in trouble a lot,” he said. “I had no rules. I grew up without any rules. Like I said, my mum drank a lot and I don’t blame her at all for what happened. I think (rehab) really helped me understand her and the things she was going through and what she had to deal with — and it was all she knew.”\nHe spoke of his mother having no money and how “there was always like 10 guys, like just around, like just in the house”. He referenced drugs being around and then, as he was in danger of going off the rails at the age of seven, being packed off to Nigeria to live with his father (“my blood dad”) and how “it was horrible (…), so I would be a little bit naughtier and then after six months I got sent back”.\nIt is little wonder, perhaps, that, lacking positive role models in his life, Dele had issues with discipline. At MK Dons’ centre of excellence, coaches were in awe of his talent but dismayed by his erratic nature. Things only began to change when, at the age of 12, he was adopted — never formally — by Alan and Sue Hickford, whose son Harry was also at MK Dons. He calls them an “amazing family”, adding: “If God created people, it was them.”\nDele’s mother Denise told the Daily Mail in 2018 it was “tough to give up my son, but it has turned out to be his salvation. It was the only way he could fulfil his dream of becoming a professional footballer”.\nUnder the circumstances, it is astounding that Dele went from such a traumatic, turbulent childhood to playing first-team football for MK Dons at 16 and then progressing serenely to the Premier League, immediately establishing himself at Tottenham and in the England team. For at least three seasons, despite a few minor indiscretions both on and off the pitch, it was as if he could do no wrong.\nAdvertisement\nDele seemed single-minded. Ruthless, even. His performances for Tottenham suggested that. So did the way he articulated his decision to reject the “Alli” name in 2016, preferring to have “Dele” on the back of his shirt, saying he felt “betrayed” after his parents spoke to tabloid newspapers about him.\n“After that, I felt so let down and betrayed that I couldn’t keep the relationship with my mum,” he told Neville. “And I don’t want a relationship with my dad either, so…”\nBut the issues were always there, under the surface.\n“There were a number of times my adopted family and my brother — you know, it makes me sad — they would take me to rooms crying, asking me just to speak to them, to tell them what I’m thinking, how I’m feeling, and I just couldn’t do it because I wanted to deal with it by myself,” he said. “I didn’t feel like opening up to anyone. It wasn’t who I was.\n“I lost myself for a few years and I was just turning everyone away, not accepting any help from anyone. When I have the family that saved my life, crying, asking me to tell them what’s wrong, I just didn’t want to do it.”\nMaybe it isn’t surprising that, when Dele encountered the first real dip in his career, having soared to that point, he struggled to cope with the unexpected blows to his self-confidence. “Rejection,” he said. “Being told you’re not good enough, fighting every day, even something like losing a game, it can affect you mentally. And you have to be ready, you have to be smiling the next day. When you’re not, it’s a problem.\n“I was caught in a bad cycle. I was relying on things that were doing me harm. I think I was waking up every day and I was winning the fight, going into training, smiling, showing that I was happy… But inside, I was definitely losing the battle.”\nIt wasn’t easy to picture the timeline of what Dele said. The “bad cycle” has been a long, unhappy and deepening one. “Losing the battle” could apply to almost any point between the summer of 2019 and his painful experience in Turkey.\nHow many times had he fallen into that cycle? When did we last see the real Dele? His impact as a substitute on the night Everton secured their Premier League status with a dramatic comeback to beat Crystal Palace in May 2022, perhaps? The odd brief flourish under Antonio Conte, Nuno Espirito Santo or Jose Mourinho under Tottenham?\nAdvertisement\nFor more than a fleeting glimpse, you probably have to go back further to Mauricio Pochettino’s tenure and to the run to the Champions League final in 2019. Maybe even further than that.\nDele says he finally sought help at the end of last season “when I came back from Turkey (…) and found out I needed an operation and I was in a bad place mentally”. At that point, he said, “I could feel the feelings I had when the cycle begins and I didn’t want it to happen anymore”, so he “decided to go to a modern-day rehab facility for mental health. They deal with addiction, mental health and trauma. It was something I felt like it was time for.”\nWith the support of Everton, whom he thanked extensively, he was in the U.S. for six weeks and has been home for three. In terms of his rehabilitation process, it sounds like early days.\nThe fact that he sounds so upbeat — “Mentally, I’m probably in the best place I’ve ever been”, “I’ve got that passion back for football,” “I’m doing really well” — is highly encouraging. But having said at one point that it was “probably the right time to talk” and to help others by doing so, he also admitted the timing of his interview had been forced on him by concern that a newspaper was going to tell the story, presumably with a different spin.\nIt is a long, long road back to where he was four or five years ago.\nWhen Dele scored his 50th Premier League goal in March 2020, much was made of how he had done it at the age of 23, in just 153 appearances. By contrast, Paul Scholes had taken 211 games (aged 27), Frank Lampard 278 games (aged 26), Steven Gerrard 281 games (aged 27).\nDele’s rise was indeed extraordinary, but so has been his fall; he is now 27 and has added precisely one more Premier League goal to his tally. Nobody is talking about surpassing those other players’ career trajectories now.\nAdvertisement\nSince the start of 2022, he has started just one Premier League game and, while he spoke of positive conversations with Sean Dyche, it is clear he has a great deal to do in order to get his career back on track once he is injury-free. Nobody should be expecting things simply to click into place and then stay like that. It isn’t that easy.\nBut neither, on reflection, is Dele’s decline quite as startling as it previously seemed given some of the issues he spoke about and the complicated personal baggage he has carried with him in his football career, which was always likely to become a burden at some point.\nBy coincidence, an interview with Lampard was published yesterday in which, as well as talking about his recent spells in charge of Everton and Chelsea, he discussed his upbringing and the different roles his parents played in creating the work ethic that underpinned his football career.\nHis father, West Ham United stalwart Frank Lampard Senior, was a tough taskmaster, always pushing him to achieve more. His late mother Pat was “my best friend, the person who gave me all of that emotional stuff and warmth”.\nDele didn’t have that stable grounding and, perhaps, rather than castigate him while fantasising about the player he could have become if only he had knuckled down, we should consider what he had to overcome to scale such rarefied heights in those early years with Tottenham and England.\nIt calls to mind something Jermaine Pennant, another of English football’s “lost” wunderkinds, said towards the end of a career that had taken him from Notts County to Arsenal, Birmingham City, Liverpool, Real Zaragoza, Stoke City and numerous other clubs without fulfilling the potential that was widely identified when he was 15 years old.\nPennant spoke about a turbulent childhood in Nottingham, losing his mother at a young age and then growing up surrounded by drugs, gang warfare and gun crime, then suddenly finding himself rich beyond his wildest dreams while living away from home in London, and asked whether it was really so surprising he went off the rails, lacking the focus and stability to make the most of his talents.\nAs journalists and fans, we too easily overlook the human frailties that might lie beneath elite-level athletes — and the mental fortitude required to stay at that level day after day, week after week, year after year.\nAdvertisement\nManagers do it too. Even one as astute as Mourinho did it with Dele, calling him into his office at Tottenham’s training ground in that awkward scene in the club’s All or Nothing series and warning him, in front of the Amazon Prime cameras, that “time flies and one day you will regret it if you don’t reach what I think you can reach”.\nTime has proved Mourinho correct: Dele is now 27, a glorious future behind him and an uncertain time ahead, even if he is able to approach it with a renewed, refreshed, enlightened outlook and with ways to cope with and rationalise some of the insecurities and anxieties that have haunted him for as long as he can remember.\nMourinho famously called him lazy, again in view of the Amazon Prime camera crew, and Dele says the coach, now at AS Roma, later apologised for that comment.\nMourinho is far from the only coach to have questioned the player’s application over the last few years but, as Dele diplomatically put it to Neville, “The problem was probably more than that, I think.”\nIf you would like to talk to someone having read this article, you can call the Samaritans in the UK free any time, from any phone, on 116 123. Click here to contact them from the US. Young Minds also provides support for young people across the UK experiencing a mental health crisis: Text YM to 85258.\n(Top photo: Isa Terli/Anadolu Agency via Getty Images)",
  "word_count": 2681,
  "scraped_at": "2026-02-14T02:00:36.700825",
  "_text_extracted": true
}