{
  "article_id": "99ce164f9d53",
  "url": "https://www.liverpoolfc.com/news/good-one-every-word-arne-slots-press-conference-after-liverpool-2-0-bologna",
  "title": "  A good one  – every word from Arne Slot press conference after Liverpool 2 - 0 Bologna",
  "date": "20241003T021500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Reaction'A good one' – every word from Arne Slot's press conference after Liverpool 2-0 Bologna\nArne Slot enjoyed his first experience of a Champions League night at Anfield as his Liverpool team beat Bologna 2-0.\nThe Reds made it six points from two outings in the competition’s league phase thanks to goals in either half from Alexis Mac Allister and Mohamed Salah on Wednesday night.\nSlot therefore achieved a feat unprecedented in the club’s history by becoming the first Liverpool boss to win eight of his first nine matches in charge.\nRead every word the head coach said in his post-match press conference below.\nOn his first experience of a Champions League game at Anfield...\n[It was] a good one because it was a win. It wasn’t an easy one but that’s normal if you play Champions League, there is always a lot of resistance and a lot of good teams play in the Champions League – and Bologna is one of them. You could also see the [other] results tonight where we saw maybe some surprising results. It was good to win, a clean sheet, some good individual performances, so positive overall.\nOn there being further room for improvement...\nThe thing is, you will probably never reach perfection. You are always aiming for perfection, but you will never reach this. We can improve, we have to improve, that’s clear, but there are also a lot of positives to take from tonight and also from the other games. There was a spell in the game where we didn’t control and they were threatening us more than I would like to see, but again this is normal. I saw a lot of games yesterday, I saw some games before we played, in the Champions League [and] it is never that only one team plays – there are always two teams playing. I think for most parts of the game we controlled, we had more ball possession, but they threatened us, especially in the last phase of the first half a few times.\nOn Salah’s club-record-setting goal...\nWhat can I say about Mo? What you saw today is what you get. If you bring him often enough in positions like this, he can score a goal. He had a great assist as well. I think the second [goal], if you look at the way he scored it I can understand everybody is talking about the finish because it was a fantastic finish. He had almost the same one just before, but it wouldn’t do justice to Virgil [van Dijk], to Diogo [Jota], to Dom [Szoboszlai] and to Trent [Alexander-Arnold] if we only talk about the great finish because Virgil played a fantastic ball through, Diogo dropped, turned, Dom was again involved – he was involved in the first goal as well – and Trent made a crucial overlapping run because that opened up the space on the inside for Mo to do what Mo always does.\nOn whether he was ‘surprised’ by how Bologna approached the game...\nNot surprised because we analysed them really well. I said yesterday already, this team only lost once and that is not a coincidence. They were 1-0 up for a long time until the last minute against Atalanta – and this club knows how good Atalanta is. I was not surprised, but maybe I was impressed how they were playing here, not afraid to play the ball out from the back and not afraid to play man-v-man all over the pitch for 90 minutes long. If I then look at us, the manager will say that’s what we create, but the amount of times we could have played the last ball in an overload, where we had more players than Bologna had, but then missed out on the pass, that happened far too much for us. Maybe that’s also a quality of theirs.\nOn Darwin Nunez’s performance and general form…\nI don’t think it’s really honest to say he only scored one [this season] for Liverpool because you also have to look at the playing time he got and I think it was his third start of the season. I don’t look at it in the way you do that only focuses on the individual. I think in the first hour we didn’t create a lot of chances for him as well because we missed out on the last pass on numerous occasions and if we would have done better it probably would have led to chances for him as well. His home game against Bournemouth, great goal, and today he was also involved and the team we faced was really hard and tough on him. And his teammates didn’t always find him when they could have so it’s a bit early, after three games, to say he only scored one. For me, that’s a bit too early.\nOn Salah…\nI am just thinking about the answer I gave a second ago. I think before Wolves, Mo played three games without scoring a goal so in football it can happen that sometimes in three games you score one or you don’t score. But these players, like Mo, like Darwin, like all the others, they will always score their goals if you just keep playing them – the thing is, I can’t play them all! But it’s good to have them and they will always score their goals. Mo has done really well today and I am happy with what he does at the moment. I am not looking forward to next season as long as we have six group games to play and hopefully many others to come afterwards.\nOn Ryan Gravenberch’s ability to disrupt Bologna’s man-to-man marking system…\nThere are a few ways how to to overload or outplay them and one of them is definitely a player who can drive with the ball, dribble with the ball and outplay someone because if you outplay someone you immediately have an overload and that is what happened, I think, after two or three minutes when Ryan turned away again from a good pass from Virgil. He was outstanding again today, Ryan, with his dribbling ability and that was important against this team but if we only focus on the dribbles he had we forget maybe how important he is without the ball, where he does a lot of work and wins a lot of second balls as well.\nOn what conclusions he draws from becoming the first Reds boss to win eight of his first nine games…\nI don’t draw many conclusions, but it is nice [because] so many incredible managers have worked here doing so many special things. The only thing is I don’t hope that the only thing people remember me for in one, two, three years – because you never know how long I can be here! – but if they only say, ‘That is the manager who won eight out of his first nine games,’ I am hoping to do more special things than winning eight out of nine games! But it says a lot about many things, it also says a lot about how Jürgen [Klopp] left this club, the squad I inherited, how much work-rate the players put in and how much my staff members are helping me to get these results. But again, I am hoping to do more special things than only be remembered for eight wins out of the first nine.",
  "word_count": 1244,
  "scraped_at": "2026-02-14T02:25:58.973352",
  "_text_extracted": true
}