{
  "article_id": "99cf34e2898f",
  "url": "https://metro.co.uk/2025/05/27/europa-conference-league-final-odds-chelsea-can-triumph-back-manchester-united-flop-antony-score-23257833/",
  "title": "Europa Conference League final odds : Chelsea can triumph but back Manchester United flop Antony to score | Football",
  "date": "20250527T131500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are primed to enter football folklore in Wroclaw by becoming the first club to make a clean sweep of major European competitions by beating Real Betis in the Europa Conference League final.\nThe Blues were red-hot favourites to lift the trophy before kicking off their campaign with a 2-0 victory against Servette in August and have breezed through to the decider by beating Gent, Panathinaikos, Noah, Heidenheim, Astana, Shamrock Rovers, Copenhagen, Legia Warsaw and Djurgarden to reach the final.\nThe opposition has hardly been glamorous and the competition is third-tier compared to the Champions League, which Chelsea have won twice along with a couple of triumphs in both the Europa League and the old European Cup Winners’ Cup, with a pair of Uefa Super Cup and a Fifa Club World Cup success also on their glowing record.\nBut they can only beat what’s in front of them and adding this piece of silverware to a stacked trophy cabinet should not be belittled.\nA 1-0 victory at Nottingham Forest on Sunday saw Enzo Maresca’s side, the youngest in the Premier League, finish fourth in the final standings and qualify for next season’s Champions League so victory in Poland will be the icing on the cake.\nBetis reached a European final for the first time by edging past Fiorentina in the semi-finals thanks to rejuvenated Brazilian Antony, on loan from Manchester United, pulling the strings and former Manchester City and West Ham manager Manuel Pellegrini will be hoping ex-Tottenham midfielder Giovani Lo Celso, trying to shake off an injury, will be present in midfield.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBlues boss Maresca played for Pellegrini at Malaga and worked for him at West Ham, giving the showpiece occasion another interesting subplot, and he should see his expensive team reward chairman Todd Boehly and the club’s owners with a celebratory end to a campaign which suffered a few low before finishing on a high.\nNicolas Jackson returns from domestic suspension to lead the attack and is 6/1 with Betway to break the deadlock and 21/10 with William Hill to score at any time while Antony is 9/2 to reply for the Spanish club who are sixth in La Liga.\nThe Blues are 9/10 with Betfred to win in 90 minutes and 21/10 with Hills, Betfair and 888Sport to prevail with both teams scoring while a 2-1 final score is 15/2 with bet365.\nFrench Open odds: Raducanu can give Swiatek a scare\nEmma Raducanu’s form on clay this season suggests she can put up a decent show against Iga Swiatek at the French Open as the reigning champion is currently some way below her glorious best.\nThe British star is 13/10 with William Hill and Betway to win with a +5.5-game advantage in their handicap markets.\nMore Trending\nStefanos Tsitsipas knows his way around Roland Garros having reached the final of the French Open four years ago, when he lost a five-set thriller to Novak Djokovic, and he will be seeking another strong run on the clay in Paris.\nThe 20th seed is evens with William Hill to beat Matteo Gigante, the world No.132 from Italy, in straight sets in their second-round affair after beating Argentina’s Tomas Martin Etcheverry with minimum fuss on Monday.\nMORE: Mary Earps announces shock retirement from England before European Women’s Championship\nMORE: Xabi Alonso sends message to Arsenal and Chelsea over Rodrygo transfer\nMORE: Five things we learnt from brilliant and unpredictable Premier League season",
  "word_count": 626,
  "scraped_at": "2026-02-14T02:09:11.445313",
  "_text_extracted": true
}