{
  "article_id": "99f630f12ead",
  "url": "https://metro.co.uk/2025/04/22/ollie-watkins-handed-arsenal-transfer-advice-dropped-aston-villa-22954995/",
  "title": "Ollie Watkins handed Arsenal transfer advice after being dropped for Aston Villa",
  "date": "20250422T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Owen Hargreaves has urged Ollie Watkins to push for a move away from Aston Villa if he continues to be unhappy under Unai Emery.\nWatkins admitted at the weekend that he was ‘fuming’ with Emery for starting him on the bench for both of Villa’s Champions League quarter-final legs against Paris Saint-Germain this month.\n‘We’ve put in a lot of hard graft the last few years to get to that position. And obviously I played 20 minutes against PSG in both games,’ Watkins said after Villa’s 4-1 win over Newcastle United on Saturday.\n‘I’m not going to lie. I was fuming I wasn’t playing and I let him know that.\n‘But he’s the manager at the end of the day and you’ve got to respect his decision, but I’m not one of those players that’s happy to sit on the bench.’\nWatkins was Villa’s standout performer in the win over Newcastle as he scored and registered an assist.\nHowever, the 29-year-old was surprisingly dropped to the bench for Villa’s 2-1 defeat to Manchester City on Tuesday evening.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWatkins was the subject of a £40 million bid from Arsenal in the January transfer window and Hargreaves believes the striker needs to consider his future if he continues to be overlooked by Emery.\n‘Thing is they [Villa] need everybody,’ Hargreaves told Premier League Productions.\n‘They need Marcus Rashford, they’ve proven that, they need Ollie Watkins firing.\n‘They’ve got four games left, they’ve just got to get over the line because if they don’t get over the line they’re not playing Champions League, everybody’s future looks different, so they’ve got to get on board.\n‘Obviously Ollie has every right to be upset. But the best thing you can do is play like he did against Newcastle, finish the job, score goals, get them to the top four.\n‘If you’re not happy, play somewhere else, at 29.’\nMeanwhile, Tim Sherwood admits he was surprised by Emery’s decision to bench Watkins after his impressive display against Newcastle.\n‘It’s really difficult to second guess how Unai Emery thinks about it,’ Sherwood said.\n‘I would’ve thought he was certain to start tonight after what he did against Newcastle. He scored a goal, he caused them all sorts of problems, created chances for his teammates.\nMore Trending\n‘And all of a sudden he turns up at the Etihad tonight and he’s sitting on the bench, so you can’t second guess the man [Emery].\n‘He will look at the opposition and he’ll make a decision based on that. I said it from the start, you have to trust this man, he doesn’t make too many mistakes.’\nAsked if Watkins was dropped for his comments about Emery’s team selection, Sherwood replied: ‘No, no. Forget that.\n‘I don’t think he’s [Emery] worried about what he [Watkins] has said. I think he’s genuinely trying to pick a team there on the basis of trying to win this football match.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Marcus Rashford stance on Manchester United return revealed as Aston Villa consider £40m option\nMORE: Matheus Cunha responds as Manchester United prepare to activate £62.5m release clause\nMORE: Man Utd drop Rasmus Hojlund asking price ahead of summer transfer window",
  "word_count": 603,
  "scraped_at": "2026-02-14T01:58:31.709861",
  "_text_extracted": true
}