{
  "article_id": "99fbd98d5e53",
  "url": "https://theathletic.com/4185344/2023/02/13/champions-league-last-16-preview-analysing-each-teams-tactics/",
  "title": "Champions League last - 16 preview : Analysing each team tactics",
  "date": "20230213T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Europe’s top competition is back.\nFor those who have missed the soothing tones of the Champions League anthem, fear not. The knockout stage is upon us and we have 16 more games to feast on over the next four weeks.\nUsing FiveThirtyEight’s well-respected prediction model, Bayern Munich stand as favourites to win the competition, edging ahead of Manchester City, Real Madrid and dark horses Napoli. However, we all know how knockout football works — do not expect things to go the way you might predict.\nAdvertisement\nMark Carey and Liam Tharme tee up the Champions League knockout stage, outlining what to expect from each team and identifying the key players to watch…\nParis Saint-Germain vs Bayern Munich\n(First leg: Tuesday, February 14, second leg: Wednesday, March 8)\nPSG\nA repeat of the 2020 final in Lisbon has come with Paris Saint-Germain in their worst form of the season. They went unbeaten in their first 21 games across all competitions but have lost four of their 10 matches in 2023, including a 3-1 defeat to second-placed Monaco on Saturday.\nHead coach Christophe Galtier is tactically flexible, having started the season playing a 3-4-3 with Neymar and Lionel Messi in roaming No 10 roles behind Kylian Mbappe. He has used back-four shapes recently but his hand is now forced by an injury to Mbappe, who netted seven group-stage goals in six games.\nGaltier played Messi and Neymar as a front two in a 4-4-2 diamond in the Coupe de France loss at Marseille but both like dropping and receiving to feet more than running in behind, with neither a box presence — Messi’s 14 shots generated following a carry (six shots, eight chances created) were the most in the group stage.\nExpect PSG to keep possession well — they ranked fourth among knockout sides for group-stage possession (58.9 per cent) — but could struggle to break opponents down without Mbappe’s penetrative runs and transition threat. PSG outperformed expected goals (xG) more than any side in the group stages (6.1).\nHugo Ekitike, 20, could lead the line and has three goals and three assists in 742 Ligue 1 minutes this season, but has only appeared as a substitute in the Champions League.\nBayern Munich\nLook at the tables and things seem typically fine for Bayern — they have lost just once all season (1-0 at Augsburg in September) and won all six games to cruise through a Champions League group containing Inter Milan and Barcelona.\nAdvertisement\nThey scored the second-most goals (18, after Napoli’s 20) and conceded the joint-fewest (two, alongside Manchester City) while keeping the most clean sheets (five) in the group stages.\nBut three consecutive league draws (versus RB Leipzig, Cologne and Frankfurt) was a slight stutter before Saturday’s 3-0 win over Bochum, adding to their recent, controversial sacking of goalkeeper coach Toni Tapalovic. Yann Sommer has taken over No 1 duties from the injured Manuel Neuer, keeping only one clean sheet in five Bundesliga games, conceding five goals.\nBayern showed flexibility in the group stages — they had more of the ball in wins against Viktoria Plzen but beat Barcelona twice with minority possession shares, scoring twice at the Camp Nou from counter-attacks.\nJulian Nagelsmann’s trademark 4-2-3-1 and 4-2-2-2 formations used a fixed back four with a double pivot behind a fluid, interchanging front four.\nThis has led to Bayern having eight different goalscorers in the group stages. Top scorer Leroy Sane (four), Sadio Mane (three), Serge Gnabry (one) are wingers by trade but can operate as false nines.\nShould he wish for a more structured approach, Nagelsmann may use 6ft 3in (190cm) Eric Maxim Choupo-Moting (three goals) at No 9.\nHe dabbled with a back three in the DFB-Pokal win at Mainz, fielding loan signing Joao Cancelo at right wing-back. Given PSG’s tendency to use a back three, Nagelsmann may be prepared to change tactics.\nNapoli vs Eintracht Frankfurt\n(First leg: Tuesday, February 21, second leg: Wednesday, March 15)\nNapoli\n“Systems no longer exist in football, it’s all about the spaces left by the opposition,” said Napoli head coach Luciano Spalletti after their 4-2 win at home to Ajax.\n“You must be quick to spot them (the spaces) and know the right moment to strike, have the courage to start the move, even when pressed.”\nAdvertisement\nNapoli are doing all of those things in abundance. They topped the group-stage rankings for Opta-defined ‘big chances’ (30), through balls (21), goals (20) and xG (16.4). Twenty-four wins in 29 games across all competitions underlines their excellence.\nSpalletti’s side scores headers from crosses, carves opponents apart with intricate passing moves and exploits teams in transition — they have crafted every type of goal imaginable and had 11 different scorers in the group stages. Serie A’s top scorer Victor Osimhen (17 goals) has seen his European minutes limited through injury — he has just one Champions League goal in three games this season, showing Napoli’s depth and attacking versatility.\nThey profile as a 4-3-3 but are not ball-dominant, averaging 51.6 per cent possession, though this also reflects the proportion of time they spend defending in winning positions. Napoli’s biggest strength has been their chameleon-like tactical ability to shapeshift and adapt to the game state.\nExpect the wingers to play high and wide and provide ball-carrying threats, primarily Khvicha Kvaratskhelia off the left and either Hirving Lozano or Matteo Politano on the opposite flank. Napoli attempted the second-most dribbles (134, behind PSG’s 138) in the group stage and had the most take-ons leading to goals (four). Kvaratskhelia’s 10 shot-ending carries were the joint-most of any individual.\nFrankfurt\nLast season’s Europa League winners have followed the same tactical blueprint for European success on their Champions League debut.\nFrankfurt are not the most expansive, having the third-lowest group stage possession (45.6 per cent) of the knockout teams and scoring the joint-fewest goals (seven, alongside Club Bruges) — the only team to qualify with a negative goal difference (minus one).\nBut they had just 48 per cent possession in the Europa League last campaign and went unbeaten with a counter-attacking and crossing approach, a style that suits knockout matches.\nHead coach Oliver Glasner primarily uses a 3-4-2-1 formation, where the wing-backs stretch the play either side of a box midfield — two defensive midfielders behind two No 10s.\nFrankfurt finished second behind Tottenham and ahead of Sporting and Marseille, but benefitted from those sides also playing back-three shapes that they could cancel out — Napoli’s 4-3-3 will provide a different test.\nAdvertisement\nMario Gotze will be the most well-known of the Frankfurt midfield but 22-year-old Jesper Lindstrom and Daichi Kamada are key players in the engine room, with seven Bundesliga goals apiece. Kamada (three goals) is Frankfurt’s top Champions League scorer.\nTheir tactical consistency is linked to the core of the squad not changing. Six of their seven players to start all European games this season were among the starting XI for the Europa League final last May.\nSummer signing Randal Kolo Muani is the seventh constant starter for Glasner in Europe — his 19 Bundesliga goal involvements (nine goals, 10 assists) are the most of any in Germany’s top flight. He thrives in transitions and is an excellent dribbler against disorganised defences, isolating opponents to create cutbacks and angled shots.\nBorussia Dortmund vs Chelsea\n(First leg: Wednesday, Feb 15, second leg: Tuesday, March 7)\nBorussia Dortmund\nDortmund have some catching up to do. They crashed out of the Champions League in the group stages last season and only once in the last four years have they gone beyond the round of 16.\nBut they are in good form under Edin Terzic, winning all six games since the World Cup restart.\nThey were characteristically counter-attacking in the group stages, having the joint-lowest possession (45.4 per cent, tied with Porto). Dortmund also recorded the fifth-most direct attacks (3 per 90) — which are sequences starting inside a team’s own half with at least 50 per cent movement towards an opponent’s goal, ending in a shot or a touch in the box.\nTerzic uses a 4-2-3-1 or 4-1-4-1 that plays Jude Bellingham in either a double pivot or a No 8 role in a midfield triangle.\nThe 19-year-old had the most progressive passes (32), shot-creating actions (15) and goals (four) for Dortmund in the group stages, but his 18 tackles plus interceptions underline his all-round midfield game — given Graham Potter’s liking for a box midfield, Dortmund will need Bellingham at his best to control the central spaces against Chelsea.\nThere is a heartwarming narrative in this fixture too, with Sebastien Haller scoring his first Dortmund goal just over a week ago, six months after being diagnosed with testicular cancer.\nThe Ivory Coast international has shown he can cut it in this competition, too, despite not playing in the Champions League since March 2022.\nHis 11 goals are the most of any player in their first eight Champions League appearances. They were scored while leading the line in Ajax’s 4-2-3-1 that consistently provided crosses and cutbacks. Dortmund scored more group-stage goals (10) than only three teams, so will need Haller to continue his efficiency.\nAdvertisement\nChelsea\nGraham Potter is still finding his feet after replacing Thomas Tuchel as head coach in September but Chelsea’s significant January transfer activity further complicates any predictions of his shape, starting XI or gameplan. There is no simple answer as to if, how and where Enzo Fernandez, Mykhailo Mudryk, Joao Felix and others fit, but the head coach needs short-term solutions.\nGoals are a major problem. Only Tottenham (eight) won their group by scoring fewer goals than Chelsea (10), who ranked second for possession (64 per cent) but close to the median for xG (9.7). They are no better at translating possession into chances in the Premier League.\nPotter’s attempt to solve this has seen consistent squad rotation and shape-switching. He made a league-high 61 changes to his first 14 league-starting XIs, an average of 4.4 per match. Only three Chelsea players have played more than 75 per cent of possible Champions League minutes: Raheem Sterling (injured), Kepa Arrizabalaga (goalkeeper) and Jorginho, who was sold to Arsenal last month.\nThe potential return of wing-backs Ben Chilwell and Reece James would provide essential wide-area quality, with Chelsea favouring a three-back formation in Europe — this offers a more balanced pressing shape and maximises their athleticism, with James and Chillwell able to push on and create a front five to overload Dortmund’s back four.\nPotter has made Chelsea effective defensively. They averaged the fewest passes per defensive action (PPDA — 8.6, indicating a high-energy press) and made the third-most attacking third regains (43) in the group stages. Only Manchester City and Bayern Munich (two) conceded fewer than their four goals. Dortmund may not provide the sternest attacking tests but an ability to not lose games could be significant for Chelsea if they go further in the competition.\nInter Milan vs Porto\n(First leg: Wednesday, February 22, second leg: Tuesday, March 14)\nInter\nSimeone Inzaghi’s side have started 2023 in great form. They kicked off January by handing Napoli their first (and only) league loss of the season and have won seven of their nine games in all competitions, including twice against neighbours AC Milan without conceding a goal — the first of those victories, in Saudi Arabia, gave them the Supercoppa Italiana.\nSystematically, Inter are predictable but they have different profiles in key positions that allow them to vary their approach.\nAdvertisement\nThey do not dominate the ball, with only four of the round-of-16 teams having a lower possession average than Inter (47.4 per cent) in this season’s Champions League. Inter defend in a 5-3-2 mid-block where the wing-backs (yellow dots) drop back alongside the centre-backs.\nThe wing-backs are key attacking threats and push forward to create wide overloads and deliver crosses — only Real Madrid (13) and Milan (11) bettered Inter’s 10 chance-creating crosses in the group stages.\nDenzel Dumfries and Matteo Darmian are contrasting right wing-back options, with the former more attacking, a better crosser and an aerial back-post threat, whereas the latter offers greater security in possession and is a stronger dueller defensively. Given Porto’s defensive approach, Dumfries may provide more solutions in overloading their back four.\nLautaro Martinez and Edin Dzeko are the likely strike partnership. They might be stereotyped as a “big man, little man” pairing but Martinez’s hold-up play is pivotal to Inter’s counter-attacking and Dzeko is a strong runner in behind.\nThere is surely a role for Romelu Lukaku too, who has battled back from injury.\nPorto\n“We can reach those heights again,” said Porto head coach Sergio Conceicao in November 2020 when reflecting on his side reaching the Champions League quarter-finals in 2018-19.\nNow six seasons into his reign, Conceicao has guided Porto to this stage of the Champions League four times and twice taken them to the quarter-finals (2018-19, 2020-21).\nThey reached the knockouts the hard way this season, losing their first two games before winning the remaining four. In those wins, they only conceded once to outscore opponents 11-1 and ended up topping a group containing Club Bruges, Bayer Leverkusen and Atletico Madrid.\nConceicao’s approach centres on No 9 Mehdi Taremi, who is usually partnered in a 4-4-2 with either Evanilson or Pepe (not that one — although he is still going strong as captain, aged 39).\nAdvertisement\nPorto had the joint-lowest group-stage possession average (45.4 per cent, with Dortmund) of the remaining teams. Four of their six lowest games for possession in all competitions this season have been in Europe — their tactics must change compared to league games.\nYet Taremi has netted five times and assisted twice in Europe this season, the most goal involvements for a Porto player since Moussa Marega in 2018-19 (eight), and only three players can better Taremi this season: Liverpool’s Mohamed Salah (eight) and PSG pair Messi (eight) and Mbappe (10).\nStatistically, he profiles as a goalscorer that is strong in link-up play, with Edin Dzeko — whom Taremi may well line up against — and Harry Kane among his most similar strikers across the past year. Smarterscout data assigns players ratings for metrics between zero and 99, with Taremi outperforming 96 per cent of forwards in progressive passing while also having above-average attacking outputs (xG from shot creation, 64 out of 99).\nRB Leipzig vs Manchester City\n(First leg: Wednesday, February 22, second leg: Tuesday, March 14)\nRB Leipzig\nLeipzig come into this clash as one of the most in-form teams in Germany. Until Saturday’s 2-1 defeat to Union Berlin, they were unbeaten since mid-September — a run of 12 Bundesliga games.\nSince Marco Rose took over from Domenico Tedesco, Leipzig have rotated between a 4-2-3-1, a 3-4-3, and the typical RB-style 4-2-2-2, but the principle is the same — a direct, transitional style that is highly effective.\nDuring the Champions League group stage, Leipzig’s 10 shots from fast breaks were more than any of the remaining sides in the competition, with the pacey threat of Timo Werner and Andre Silva alongside the smart positioning of Dani Olmo and Dominik Szoboszlai providing a double threat.\nLeipzig should also be boosted by the return of their star man Christopher Nkunku from a recent knee injury that kept him out of the World Cup. Nkunku’s 12 goals in the Bundesliga — alongside his three in the Champions League group stage — is comfortably ahead of his nearest team-mate (Werner, five), and will provide a potent threat to cap off Leipzig’s sweeping attacks.\nAdvertisement\nAs can be seen in his non-penalty xG graphic below, Nkunku can shoot off either foot, making him dangerous almost anywhere within a 25-yard radius of the goal.\nIn the group stage, only Vinicius Junior (8.4) had a higher open-play xG sequence involvement total than Nkunku (7.5), but there has not been an overreliance on a single player this season. Leipzig boast 15 different goalscorers in the Bundesliga this season, more than any other side.\nLook out for Leipzig from set pieces too — only Union have scored more from free kicks and corners in Germany’s top flight.\nManchester City\nThey are the bookies’ favourites but City have been fallible this season despite the arrival of the Megatron that is Erling Haaland.\nA lower rate of goals, xG, and shots per 90 minutes in the Premier League this season compared with last season does not make for great reading. The same metrics ‘conceded’ are all alarmingly higher than last campaign, too.\nTeams are working out how to expose them, whether that is stopping their build-up or capitalising on their vulnerability in transitions. This criticism is all relative to the sky-high standards that City set for themselves as they remain one of the most dominant teams in European football.\nCity are one of four teams to be unbeaten in the Champions League, breezing through Group G with 14 points. Only Real Madrid averaged more shots per 90 than City, with their territorial dominance — shown by their 79.5 per cent field tilt (the share of possession a team has in a game, considering only touches or passes in the attacking third) — rivalled by no one.\nIt is also fun to play ‘which way is Pep Guardiola going to overthink it this time?’ in a Champions League knockout tie. You’ll always find a tactical tweak here and there — sometimes they pay off, sometimes not, but it’s always fun to watch him roll the dice.\nAdvertisement\nLiverpool vs Real Madrid\n(First leg: Tuesday, February 21, second leg: Wednesday, March 15)\nLiverpool\nLiverpool are one of the most out-of-form teams in Europe.\nTheir inability to stave off the threat of the counter-attack has been well-documented, with 28 goals conceded in the Premier League — more than the whole of last season’s tally (26).\nJurgen Klopp has battled injury issues to key personnel, with Virgil van Dijk, Diogo Jota, Roberto Firmino and Luis Diaz all spending extended periods out, but Liverpool need to improve at both ends of the pitch.\nTheir 10-game rolling average xG difference — which considers the quality of chances created and conceded — shows how much of a downward slide they are experiencing in the Premier League.\nLiverpool fought back to a second-place finish in Group A after Napoli’s 4-1 victory blew them away in their opener. That was Liverpool’s heaviest defeat in Europe since 1966 (a 5-1 loss to Ajax).\nAs a reward, they face the team that defeated them in last season’s final, with Madrid boss Carlo Ancelotti saying how predictable Liverpool’s approach was in May.\n“Liverpool were easier to decipher than the others because they have a very clear identity. We could prepare. We knew what strategy to take: don’t give them space behind the defence to run into.”\nTo account for their poor pressing, Liverpool have recently moved to a mid-block out of possession, which is far removed from their intense pressing tactics in the Klopp era.\nBut pragmatism is required at this stage. Liverpool must become harder to play against. Expect to see a different game to last summer’s final in Paris.\nReal Madrid\nMadrid have not developed too much consistency since returning from the World Cup. Three losses and two draws (albeit one was decided by a penalty shootout victory in the Supercopa de Espana) in 13 games is not the form you would expect from the Spanish and European champions but Ancelotti’s men will be boosted by their Club World Cup victory over Al-Hilal.\nOne surprising area of weakness has been Madrid’s midfield. Aurelien Tchouameni is slowing growing into the engine of the team but Toni Kroos and Luka Modric look to be running on fumes at times, with Ancelotti rotating between the trio, Federico Valverde and an in-form Dani Ceballos.\nAdvertisement\nThe graphic below shows each player’s minutes played against their age — as can be seen, Ancelotti relies mostly upon players who are outside the expected ‘peak age’ bracket of 24 to 28.\nSuch is the rotation required that French starlet Eduardo Camavinga has been forced to play out of position, performing admirably at left-back to cover for the injured Ferland Mendy and David Alaba.\nIt points to a wider task that Ancelotti faces to keep his side fresh, after a gruelling fixture schedule that has included a trip to Saudi Arabia (Supercoppa) and Morocco (Club World Cup) in recent weeks.\nHowever, one player who has not been rested is Vinicius Jr, who has clocked up the most minutes of any Madrid player this season. A tally of 49 take-ons in his last three La Liga games is evidence of what the Brazilian likes to do the most. Madrid focus their moves down the left, with 42 per cent of their attacking touches coming down that flank during the group stage.\nVinicius Jr has been directly involved in seven goals in his last eight Champions League away games (five goals and two assists). Stopping him would be a good start to stopping Madrid’s attack.\nClub Bruges vs Benfica\n(First leg: Wednesday, February 15, second leg: Tuesday, March 7)\nClub Bruges\nBruges are the minnows of the knockout stage, having reached the round of 16 for the first time in 10 attempts. They qualified with two games to spare, becoming the first Belgian club to win their opening three group games.\nThough Bruges favoured a back three under former manager Carl Hoefkens, they have moved more frequently to a back four under new boss Scott Parker, who has only managed one win in seven games in the Belgian Pro League.\nParker will become the third English manager to take charge of a non-English team in the Champions League after Bobby Robson (Porto and PSV Eindhoven) and Gary Neville (Valencia) — and he will need his goalkeeper to be on top form across the two legs.\nAdvertisement\nThough Spanish forward Ferran Jutgla has been the leading attacker at one end, Simon Mignolet has rolled back the years at the other end, with the 34-year-old becoming Bruges’s most-important player during the group stage.\nUsing expected goals on target (xGOT, which measures the quality of shots), we can see that no goalkeeper was statistically more impressive at shot-stopping across the group stage than Mignolet. From an xGOT of 10.3, Mignolet conceded four goals, suggesting he prevented at least six goals more than would be expected by the average goalkeeper.\nBruges don’t come into the knockout stage in the best of form domestically, but they are riding the crest of a wave in Europe. Who is to say that they will not provide another shock against Benfica?\nBenfica\nBenfica have every reason to be confident. They are five points clear at the top of the Primeira Liga, they finished top of a group containing Paris Saint-Germain and Juventus, and have suffered one loss in all competitions this season.\nOf course, one notable absentee to the line-up will be Enzo Fernandez, who became a British record signing after helping Benfica to the last 16. Roger Schmidt has played 27-year-old Chiquinho alongside Florentino Luis in midfield since Fernandez’s departure, as Benfica remain set in a 4-2-3-1 structure this season.\nThey have attacking potency in Goncalo Ramos, with the 21-year-old having a breakout season for club and country. Ramos joins Joao Mario with 12 goals scored in the Primeira Liga, but Benfica’s central creative hub in the Champions League has been Rafa Silva.\nNo Benfica player created more than Silva’s 11 open-play chances in the group stage and though he did not register an assist, his energy and creativity have been key to how Benfica play this season.\nEnergy is the operative word when discussing Benfica. Schmidt has them playing high-intensity football on and off the ball, with their PPDA of 8.0 being the lowest — and most intense — of any side in the Primeira Liga. In Europe, Benfica generated the most shots (14) and scored the most goals (five) from high turnovers of all teams in the group stage this season.\nThey press with purpose and look to punish you quickly.\nThey have the physical and technical quality across the pitch, and they are unbeaten in the Champions League so far. When do we consider Benfica to be a surprise contender in the competition?\nAdvertisement\nAC Milan vs Tottenham Hotspur\n(First leg: Tuesday, February 14, second leg: Wednesday, March 8)\nAC Milan\nThis is unfamiliar territory for Milan in recent years, as they prepare to play their first knockout game in the Champions League since 2013-14.\nThe timing is not great. Stefano Pioli’s men suffered four defeats on the bounce before stemming the flow on Friday with a 1-0 against Torino.\nPioli has switched from a 4-2-3-1 to a 3-4-3/3-5-2 in recent weeks to add more defensive solidity after their typically intense pressing structure fell away after the World Cup. Injuries have not helped, but Milan have looked like a shadow of the side that won the title last season.\nMilan’s attacking full-backs provide the service for 36-year-old Olivier Giroud, who led Milan’s scoring with four goals in the group stage and is the oldest player to have 10 goal involvements (seven goals, four assists) across Europe’s top-five leagues.\nWidth is important, and there is one key wide man who Milan know can cause damage to the opposition: Rafael Leao. The Portgual international leads the way for Milan in league goals (eight) and assists (five) — and has been one of the most progressive ball carriers in Europe, having forged an incredible understanding with left-back Theo Hernandez down Milan’s left side.\nLeao’s average carry distance of 8.7 metres is the second highest of any player in the group stage. Expect him to drive forward when he receives it.\nWith first-choice goalkeeper Mike Maignan, midfielder Ismael Bennacer and defender Fikayo Tomori hoping to be fit for the first leg, there is growing optimism in Milan after a difficult few weeks.\nTottenham Hotspur\nSpurs made hard work of their qualification from Group D, overcoming a difficult start to finish first with 11 points. It was the lowest first-placed tally this season.\nOnly Frankfurt and Bruges scored fewer (seven) than Spurs’ eight goals across the six group games.\nSpurs have produced some strong performances recently — particularly their 1-0 victory against Manchester City, which featured an organised press, good shape and purpose in transitions — but Saturday’s 4-1 defeat to Leicester showed their frailty.\nAdvertisement\nYou know what you’re going to get with an Antonio Conte team: a 3-4-3 that will look to contain the opposition and spring a counter-attack. In the group stage, only Milan averaged a higher direct speed — which outlines how fast a team progresses upfield — than Spurs’ 1.4 metres per second, which highlights how vertical their style is when they have possession.\nWith Dejan Kulusevski back from injury, Son Heung-min appearing to have regained some form in recent weeks and Harry Kane full of confidence after his record-breaking goalscoring tally, Spurs’ front line could punish Milan. The trio have the highest goal contributions per 90 among the Spurs squad in all competitions this season.\nWhile things look positive at the top end of the field, the same can’t be said in other areas. A knee injury to Hugo Lloris — which will rule him out for at least six weeks — has come at the wrong time, while a long-term injury to Rodrigo Bentancur, suffered during the defeat to Leicester, has made matters worse. With Pierre-Emile Hojbjerg suspended for the first leg, Antonio Conte may have to start with Oliver Skipp (22) and Pape Matar Sarr (20) in central midfield at San Siro.\nSpurs will be hoping for a stronger defensive display, having conceded first in four of their six group games — an issue that has plagued them in all competitions this season.",
  "word_count": 4644,
  "scraped_at": "2026-02-14T01:59:41.715716",
  "_text_extracted": true
}