{
  "article_id": "9a03a609bcea",
  "url": "https://menafn.com/1105717355/PSGs-Neymar-Needs-Ankle-Surgery-Set-To-Miss-Rest-Of-Season",
  "title": "PSG Neymar Needs Ankle Surgery , Set To Miss Rest Of Season",
  "date": "20230306T210000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- Khaleej Times) Published: Mon 6 Mar 2023, 11:24 PM Neymar is set to be sidelined for the rest of the season after Paris Saint-Germain said on Monday the forward requires ankle surgery and will be out of action for three to four months.\nThe Brazilian, who injured his ankle on February 19 against Lille in Ligue 1, 'has had several episodes of instability in his right ankle in recent years,' said the club, adding that its medical staff 'recommended a ligament repair operation to avoid a major risk of recurrence'.\nQatar-owned PSG said Neymar would go under the knife in Doha 'in the next few days' and said it would take 'three to four months before he can return to training with the team'.\nThat would appear to end any prospect of Neymar playing again this season, with the Ligue 1 season due to end on June 3 and the Champions League final, if PSG were to get there, a week later in Istanbul.\nPSG, still waiting for a maiden Champions League title, will bid to overturn a 1-0 first-leg deficit in the last 16 against Bayern Munich in Germany on Wednesday.\nNeymar, who has scored 18 goals in all competitions for his club this season, was in fine form for the French champions before the World Cup break.\nBut the 31-year-old has netted only three times in nine appearances since returning from Qatar, where he injured the same ankle playing for Brazil.\nHe came off with a sprain in his country's 2-0 win over Serbia in their opening game and didn't play again in the group stage.\nThe ex-Barcelona man returned in the knockout rounds but Brazil lost to Croatia on penalties in the quarter-finals, despite Neymar putting them ahead in extra time in that game.\nNeymar's fitness has regularly been a concern for PSG, ever since he signed from Barcelona for a world-record fee of 222 million euros ($264m) in 2017.\nIn his first season at PSG, a fractured metatarsal ruled him out of the second leg of their Champions League last-16 tie against Real Madrid, which they lost.\nHe didn't play again for his club that season and faced a race against time to be fit to play for Brazil at that year's World Cup in Russia.\nThe following year another metatarsal injury saw him miss the last-16 tie against Manchester United as they again went out in the first knockout round.\nNeymar has scored 118 goals in 173 games for PSG, but has missed more than 100 games due either to injury or suspension.\nPSG are also without Presnel Kimpembe against Bayern on Wednesday, with the France centre-back set to miss the rest of the season due to an achilles injury.\nALSO READ:\nwatch: cristiano ronaldo's reaction to young football fan shouting 'lionel messi is way better'\nmbappe breaks record, becomes psg's all-time top scorer\npsg and morocco footballer achraf hakimi charged with rape: prosecutors",
  "word_count": 490,
  "scraped_at": "2026-02-14T02:16:40.094831",
  "_text_extracted": true
}