{
  "article_id": "9a12eb2d9e9a",
  "url": "https://www.fourfourtwo.com/news/controversial-champions-league-decision-could-see-european-competition-head-to-the-united-states-report",
  "title": "Controversial Champions League decision could see European competition head to the United States : report",
  "date": "20250212T173000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Controversial Champions League decision could see European competition head to the United States: report\nThe Champions League will have games played in the United States as the latest commerical rights deal is imminent\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Champions League is set to undergo a controversial change that could see games in the European competition head to the United States.\nOne of the biggest club competitions in the world, the Champions League sees Europe's elite battling it out every year for the coveted 'Big Ears' trophy. 23 different teams have won the Champions League in its 70-year history, while a total of 17 different nations have hosted a final, with Hungary set to become the 18th when the Puskas Arena stages the 2026 final.\nAnd while there have been some major overhauls of the Champions League over the years, not least the name change from the European Cup to its current moniker and sides from stronger nations who didn't win their respective leagues being allowed to enter from 1997, none have been quite as controversial as what could happen in the coming years.\nChampions League to controversially head to the United States\nIndeed, there's a strong possibility that Champions League games - and even the final - could head to the United States within less than a decade, following the imminent agreement over a new commercial rights deal.\nUEFA and the European Club Association - the sole independent body for football clubs at European level - have entered into an exclusive negotiation period with New York City-based Relevant Sports Group. The sporting events promoter has worked on selling the competition's media rights specifically in the United States for for 2024-2027, but the company is now set to become the global commercial rights partner for the period 2027-2033.\n\"The Board of UC3, the joint venture between UEFA and the European Club Association (ECA), has agreed to enter into an exclusive period of negotiation with Relevent Sports over the global commercial rights to the UEFA men’s club competitions for the period 2027 - 2033,\" a statement released on Tuesday read.\n\"The decision follows an open tender process, launched last summer, which attracted bids from a number of global and regional agencies. UC3 anticipates concluding the process in the coming weeks.\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nRelevant Sports Group has been a keen advocate for major European games, both domestically and continentally, to be played in the US. Miami Dolphins owner Stephen Ross also takes charge of Relevant Sports, and discussions took place with La Liga over playing Barcelona and Atletico Madrid's league match at the Hard Rock Stadium in December 2024. Plans were ultimately dropped, but La Liga presdient Javier Tebas has reiterated his interest in playing games away from Spain in the future.\nShould a deal between UEFA and Relevant be concluded, then there's a very real possibility that Champions League games will be played in the US by 2033 - if not sooner.\nThis would follow the trend of other competitions moving elsewhere for showpiece events. The Spanish Super Cup is now hosted each year in Saudi Arabia, while the Supercoppa Italiana has been played in China, Qatar and Saudi Arabia in the past 15 years.\nIn FourFourTwo's view it would be a crying shame for a Champions League final to be played away from Europe, because the vast majority of local fans won't have the option of attending the game. Questions would also remain over which teams are willing to give up their home advantage if one leg from a knockout round is played outside the continent. It's clearly all just a money-grabbing exercise that will eventually force fans away from the clubs they love.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 801,
  "scraped_at": "2026-02-14T02:18:11.277832",
  "_text_extracted": true
}