{
  "article_id": "9a1c5df021c7",
  "url": "https://www.geosuper.tv/latest/34006-uefa-confirms-swiss-model-for-champions-league",
  "title": "UEFA confirms  Swiss Model  for Champions League",
  "date": "20240304T200000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nMarch 04, 2024\nThe UEFA Champions League will undergo a significant transformation starting from the 2024-25 season with the introduction of the \"Swiss model.\" This departure from the traditional group stage format aims to create a more inclusive and dynamic tournament structure.\n\"UEFA has clearly shown that we are fully committed to respecting the fundamental values of sport and to defending the key principle of open competitions, with qualification based on sporting merit, fully in line with the values and solidarity-based European sports model,\" said UEFA president Aleksander Ceferin.\n\"I am really pleased that it was a unanimous decision of the UEFA Executive Committee, with the European Club Association, European Leagues and national associations all agreeing with the proposal made. Another proof that European football is more united than ever.\"\nIn the new system, the Champions League will expand to accommodate 36 teams in the group stage, up from the current 32. This enlargement ensures a broader representation of clubs, enhancing the competitiveness and excitement of the tournament. Central to this reform is the league-phase fixtures, guaranteeing each participating team eight matches—four home and four away.\nUnlike the previous format where teams were grouped into eight groups of four, playing six games in a double round-robin format, the revamped model offers a more diverse set of matchups.\nEach team will face eight different opponents, selected through a draw placing the 36 teams into four pots based on their UEFA coefficients. This approach aims to increase the intensity and attractiven ess of the competition, reducing predictability.\nThe final standings will be consolidated into a single league table, with the top eight teams progressing automatically to the round of 16. Teams ranked between ninth and 24th will engage in a two-legged knockout play-off for the remaining eight spots in the last 16.\nNotably, there will be no country protection in the knockout rounds, potentially leading to domestic clashes in the latter stages.\nThe reform also addresses the allocation of additional places in the Champions League. Two spots will be granted to clubs from the best-performing leagues in Europe based on their current season's performance, while the third-placed team in the league ranked fifth in the UEFA coefficient will secure another place.\nMoreover, the qualifying path for champions will expand from four to five teams, promoting broader participation.\nThe adoption of the Swiss model aims to increase revenue and facilitate more high-profile encounters between Europe's top clubs. By adjusting the original proposal from ten to eight group-stage fixtures, UEFA seeks to strike a balance between tournament expansion and effective calendar management.",
  "word_count": 431,
  "scraped_at": "2026-02-14T02:17:27.962565",
  "_text_extracted": true
}