{
  "article_id": "9a25128c51b5",
  "url": "https://www.managingmadrid.com/2023/4/29/23703356/fix-you-29-april-2023",
  "title": "Fix You : 29 April 2023",
  "date": "20230429T053000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Daily Merengue is a place where you can feel free to discuss all things football. Do not be alarmed by the overt RMCF bias. It’s in the name!\nFix You : 29 April 2023\nMatchday Edition of The Daily Merengue\nShoutout to the mods who do a fantastic job, Valyrian Steel, Felipejack, Juninho, NeRObutBlanco and yours truly, Kung_Fu_Zizou\n‘TIS MATCHDAY AT THE BERNABEU!!\nHistory beckons for Karim. Can he keep his body underneath him and hold his nerve once again? Karim hasn’t been quite at the races so far this season, he’s going to have to go through the gears if Real Madrid are to make history again.\nAnimo Lukita!\nLuka Modric has been a mainstay for a decade in the Real Madrid midfield and has been reliable for the business end of the season during all that time. Luka Modric much like Karim Benzema managed last season has continued to defy, “Father Time” but it seems to be catching up with both.\nHopefully the maestro’s absence will not weigh too heavily on the youngster who has to fill his boots in the meantime.\nTraining Day\nAs usual the camp is in high spirits. It is unlikely they will be seriously affected by La Liga results given the prospect of the Copa del Rey and Champions League silverware. Hopefully they don’t leave they shooting boots on the training ground.\nThe Return\nReal Madrid have finally taken a step toward addressing the deficiencies at fullback. While Ferland Mendy on his day is arguable the best defensive fullback, he has struggled to replicate the form he showed in his debut season and injuries have seemingly taken their toll. Fran has a mighty job on his hands but he should be well prepared for it, given that he’s from the academy and understands the demands.\nThe Bellingham Affair\n“Hey Jude, if you come to Madrid I will come back to coach you..”\n- Zidane, probably\nSo far reports of progress in the potential signing of Bellingham have not been refuted by Dortmund or Bellingham’s entourage. Furthermore, other media outlets have been relatively quiet about City and Liverpool who are the other clubs said to be in hot pursuit of the Englishman’s signature.\nThe Daily Poll\nPoll 2",
  "word_count": 375,
  "scraped_at": "2026-02-14T01:55:54.926468",
  "_text_extracted": true
}