{
  "article_id": "9aa70f725630",
  "url": "https://www.teamtalk.com/news/transfer-gossip-man-utd-scout-70m-goalscorer-tottenham-cause-mystery-chelsea-keep-eye-promoted-striker",
  "title": "Transfer Gossip : Man Utd scout £70m goalscorer as Tottenham cause mystery ; Chelsea keep eye on promoted striker",
  "date": "20230501T074500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Transfer Gossip: Man Utd scout £70m goalscorer as Tottenham cause mystery; Chelsea keep eye on promoted striker\nManchester United scouts saw one of their striker targets score over the weekend, while Chelsea are also eyeing an attacker and Leicester have made a massive decision – all in Monday’s transfer gossip.\nMAN UTD KEEPING TRACK OF TAMMY ABRAHAM\nTammy Abraham was the subject of another scouting mission by Man Utd over the weekend, according to reports in Italy.\nAbraham is one of the strikers on Man Utd’s radar as they look for a more reliable successor to Wout Weghorst. Indeed, the Netherlands international will not be staying with the club after his loan spell from Burnley.\nMan Utd have plenty of options to consider, but Abraham appeals to them. Currently in his second season with Roma, the English striker has suffered a downturn in form this term – but scored in front of United’s scouts on Saturday in a 1-1 draw with AC Milan.\nIt was Abraham’s ninth goal of the season, in his 45th appearance. Man Utd have still been regularly watching him, though, according to La Gazzetta Dello Sport.\nThe Italian newspaper claims that Man Utd officials were joined by counterparts from Paris Saint-Germain – who are looking for a replacement for Hugo Ekitike – in viewing Abraham on Saturday.\nThere was also the presence of Tottenham scouts, although the report confesses it is something of a mystery as to whether they were watching Abraham or someone else, from either side.\nIf Abraham was the reason for their visit, it might point to a fear about losing Harry Kane this summer. The England captain – Abraham’s superior in the international pecking order, of course – is similarly one of Man Utd’s top targets, though there might be easier deals out there.\nEven trying to sign Abraham this summer would require a significant financial effort. After all, Chelsea have a buyback clause worth €80m (£70m) for the 25-year-old.\nAnd despite the goals drying up for Abraham this season, the report claims Roma are still holding out for a transfer fee in that region.\nBesides, if they receive a lower bid, they will still have to tell Chelsea – whose stance on allowing a rival to sign their former academy product remains to be seen – before being able to accept it.\nRoma have six more Serie A matches awaiting him this season, while they are also in the Europa League semi-finals. Therefore, Man Utd will have up to eight or nine more opportunities to watch Abraham before the summer transfer window.\nCHELSEA MONITORING NEXT ATTACKING TALENT\nContinuing to look to the future, Chelsea have supposedly identified recent Stevenage debutant Malike Evans as a prospect they could target.\nEvans recently became Stevenage’s youngest ever player after making his first-team bow at the age of 16. A week after his debut, he watched on as his teammates secured promotion from League Two to League One.\nYet the young Evans could be aiming even higher. According to The Sun, Chelsea are keeping tabs on him as they pursue the next generation of talent.\nInterest in Evans is also emerging from Aston Villa, Brighton and West Ham, per the report. But Chelsea could be major contenders to sign the teenager.\nPresumably, he would then go into their own academy ranks. At under-18 level, he has scored 15 goals for Stevenage this season.\nEvans has also built up a bit of experience during a brief loan spell in non-league football with Potters Bar back in March.\nNow, Chelsea are keeping tabs on him. They might add him to their conveyor belt of attackers for the future after already signing the likes of David Datro Fofana and Jimmy-Jay Morgan in recent months.\nLEICESTER LOOK TO SELL MADDISON\nIt is ‘inevitable’ that James Maddison will leave Leicester City this summer, a report has claimed.\nLeicester are currently in danger of relegation from the Premier League, occupying a place in the bottom three. However, avoiding defeat in Monday night’s clash with fellow strugglers Everton would lift them out of the drop zone.\nFighting for their future, Leicester will be relying on key players like Maddison to pull them over the line. But regardless of whether they stay up or go down, the attacking midfielder will be sold this summer.\nThat’s according to an update from the Daily Telegraph, which lists Man Utd, Tottenham and Newcastle as among his admirers. They are all currently fighting for European qualification; Man Utd and Newcastle should have Champions League football on offer next season.\nOut of contract in 2024, Maddison will be made available for somewhere between £45m and £60m. After significant financial losses recently, Leicester will have to take the opportunity to cash in.\nAt the age of 26, Maddison will be keen to make the right next move for his career. He previously played for Coventry City and Norwich City.",
  "word_count": 820,
  "scraped_at": "2026-02-14T01:50:29.457701",
  "_text_extracted": true
}