{
  "article_id": "9aa74f6d610b",
  "url": "https://www.prokerala.com/news/articles/a1489003.html",
  "title": "Guardiola wants to  close the little circle  by winning Club World Cup",
  "date": "20231219T063000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jeddah, Dec 19 : Pep Guardiola wants his Manchester City side to \"close the little circle\" on City's incredible success in recent seasons and claim the only trophy they are yet to win at the FIFA Club World Cup in Saudi Arabia this week.\nCity have qualified for the Club World Cup for the first time ever, entering at the semi-final stage after winning the UEFA Champions League in June.\nGuardiola has overseen the most trophy laden period in the Club's history, collecting 15 major honours since arriving in Manchester in 2016.\nThat leaves the Club World Cup, which City have not previously competed in, as the only trophy outstanding from his time in England.\nNow Guardiola wants his Treble-winners to become the first side in English history to win the quintet of Premier League, FA Cup, Champions League, UEFA Super Cup and FIFA Club World Cup in the space of 12 months.\nSpeaking in the pre-match press conference at the King Abdullah Sports City in Jeddah, the boss reflected on previous entries with Barcelona and emphasised his desire to add to the Club's magnificent haul during his reign.\n\"We want to win it. Once we are here, it is a trophy we do not have. We want to close the little circle and win all the trophies we could do. This is the last one. \"In the Premier League you have another game in three days. Here it may be another lifetime,\" Guardiola told City's club website ahead of Tuesday's semifinal against Japanese side Urawa Red Diamonds in Jeddah.\nWhile City will be favourites to beat Urawa Red Diamonds in the semifinals, Guardiola is not expecting an easy tie. \"To see the Japanese national team, they know the games and they beat Germany - look at the World Cup,\" he said.\n\"Football in Japan grew up incredibly in the past 10 years. They are sharp and quick on the transitions and unpredictable in many cases. I respect them a lot and of course I want to be in the final next Friday of the Club World Cup,\" he added.\nCity have been through a period of indifferent form in the Premier League-- winning one, drawing four and losing one of our last six domestic fixtures-- leaving them on fourth place as they seek to win a record fourth successive title.\nThe 52-old has urged his players to put those recent results to the back of their mind and focus on the job of winning the Club World Cup.\n\"It's a different competition. Whatever happens here will be different to when we return and play Everton, Sheffield United and Newcastle.\n\"Except the Aston Villa game, our performance was excellent in many ways but we have to be better at managing games. But hopefully we can maintain passion and desire tomorrow against Urawa,\" he added.",
  "word_count": 474,
  "scraped_at": "2026-02-14T02:07:27.047134",
  "_text_extracted": true
}