{
  "article_id": "9ab4377083da",
  "url": "https://metro.co.uk/2025/12/19/enzo-maresca-makes-statement-chelsea-exit-claim-responds-man-city-link-25610173/",
  "title": "Enzo Maresca makes statement over Chelsea exit claim and responds to Man City link | Football",
  "date": "20251219T110000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca has dismissed reports linking him with a move to Manchester City and claims he will be at Chelsea next season.\nThe 45-year-old sparked speculation over his future at Stamford Bridge last weekend when he described the build-up to the 2-0 win over Everton as his ‘worst 48 hours ‘at the club since his arrival in June last year.\nMeanwhile, reports on Thursday claimed that Manchester City have Maresca on their shortlist of candidates to replace Pep Guardiola, whose contract expires in 2027.\nBut in his press conference on Friday, Maresca described the link as ‘just speculation’ and said he will ‘absolutely’ be staying at Chelsea beyond the current campaign.\nWhen asked about the link with City, Maresca replied: ‘It doesn’t affect me at all because I know it is 100 per cent speculation and in this moment there is no time for these kind of things.\n‘First of all, I have a contract here until 2029 and my focus is just on this club and I am very proud to be here. It is speculation, one week ago in Italy it was the same with Juventus. I don’t pay attention because I know it’s not true.\n‘It’s just speculation. Now it’s important to understand why this news was there but it is just speculation, I don’t care at all. I think the players they are focused on the Newcastle game that is important and very difficult.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAsked if he will stay at Chelsea beyond this season: ‘Absolutely, yes. Again, I have a contract until 2029.\nMore Trending\n‘This is speculation 100 per cent, I don’t have nothing to add, I don’t pay attention, if we continue to talk about that it means I’m paying attention to that, but I’m not focused on that.\n‘I’m focus on my job, last year I signed a contract until 2029, I’m happy with that and no more than that.\n‘We achieved the other day the third semi-final in eighteen months. We finished fourth last season to qualify for the Champions League and the target is to improve this season.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Enzo Maresca told he is mismanaging Chelsea star ahead of Newcastle clash\nMORE: Igor Thiago injury latest ahead of Wolves vs Brentford\nMORE: Sir Alex Ferguson makes brutal prediction on when Man Utd will next win the Premier League",
  "word_count": 462,
  "scraped_at": "2026-02-14T01:59:31.520347",
  "_text_extracted": true
}