{
  "article_id": "9ac8f5c09b31",
  "url": "https://www.espn.com/soccer/english-premier-league/story/4845501/man-city-not-perfect-at-chelsea-but-still-cut-gap-to-arsenal",
  "title": "Man City not perfect at Chelsea but still cut gap to Arsenal",
  "date": "20230107T111500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LONDON -- Riyad Mahrez came off the bench to net a 63rd-minute winner as Manchester City beat Chelsea 1-0 at Stamford Bridge on Thursday to close the gap on Premier League leaders Arsenal to five points\n- Stream on ESPN+: LaLiga, Bundesliga, more (US)\n- Premier League table | Upcoming fixtures\nSubstitute Carney Chukwuemeka hit the post toward the end of a first half short on goalmouth action. Just after the hour mark, a flowing move ended with two City substitutes combining as Jack Grealish's cross drifted close to Chelsea goalkeeper Kepa Arrizabalaga but still found Mahrez for a tap-in at the far post.\nThe result leaves Graham Potter's side languishing in 10th place in the table ahead of the two sides meeting again in Sunday's FA Cup third-round tie at Etihad Stadium.\nJUMP TO: Player ratings | Best/worst performers | Highlights and notable moments | Postmatch quotes | Key stats | Upcoming fixtures\nRapid reaction\n1. City not perfect but good enough as Potter's problems grow\nPep Guardiola claimed Manchester City would have to be \"almost perfect\" to catch Arsenal at the top of the table, but they were nowhere near that on Thursday, yet still cut the deficit to five points. City looked unusually disjointed in the first half, taking more than half an hour to register their first shot of the game -- their longest wait in a Premier League game since October 2018. Perhaps the stakes played a factor, or the sheer volume of football since domestic play resumed following the World Cup, but City rarely got out of second gear and yet were still able to inflict a fifth defeat in eight games across all competitions on their hosts.\nPotter is not under any imminent threat in terms of his job, but Chelsea remain in 10th place, 10 points behind fourth-placed Manchester United. The club's new owners, Todd Boehly and Clearlake Capital, have been adamant that Potter will be given time to stamp his authority on the squad, having only been appointed in September, but the club spent more than £270 million on summer transfers, and as they prepare to invest heavily again, a more handsome return on that outlay will be expected. Chelsea have taken just three points against teams currently in the top half of the table.\n2. Injury problems mount for Chelsea ...\nMason Mount was missing from the starting lineup after picking up a knock in training, and within the first 22 minutes here, Chelsea had two more injuries to contend with as Raheem Sterling and Christian Pulisic limped off. Potter was always likely to rotate for Sunday's FA Cup tie against the same opponents, but the need to rest players for the extra Premier League fixture they have to squeeze in against Fulham next Thursday will be heightened by the overall injury picture.\nWesley Fofana, Armando Broja, Reece James, Ben Chilwell and N'Golo Kante are all already missing, but at least Benoit Badiashile was in the stands next to Boehly here, fresh from completing a €37m move from AS Monaco earlier in the day. He might be needed sooner than ideal at this rate.\nChelsea are actively looking to strengthen in the January transfer window, continuing talks with Benfica over midfielder Enzo Fernandez, and negotiations are expected to take place with Shakhtar Donetsk director of football Darijo Srna over a deal for winger Mykhailo Mudryk. The team's current plight, combined with the number of players absent, will only heighten the pressure on the club to act decisively in the market.\n3. ... as City's bench makes the difference\nThere was a passing resemblance to the 2021 Champions League final in the first half as Guardiola was in danger of overcomplicating his lineup as happened that night in Porto. City operated with a back three in possession as Joao Cancelo was utilised in an advanced right-sided role. Bernardo Silva and Kevin De Bruyne often came over to that flank in attempt to overload Chelsea, but more than anything, the players looked unable to find space in the manner City so often manage better than anyone else.\nIn the end, Guardiola's adjustments worked the oracle as Manuel Akanji and Rico Lewis came on at the interval to give City better balance before Grealish and Mahrez were introduced on the hour mark, combining for the winning goal just three minutes later. There was even time for £45m signing Kalvin Phillips to make sure of things late on.\nBy contrast, Potter opted for Pierre-Emerick Aubameyang when Sterling was forced off. Chelsea have privately insisted Aubameyang was always a preferred target regardless of the manager (he arrived less than a week before Thomas Tuchel, whom he thrived under at Borussia Dortmund, was sacked) but the 33-year-old was a peripheral figure and was subbed off with Chelsea needing a goal. Potter introduced Chukwuemeka, a highly rated but inexperienced teenager, Conor Gallagher and two more youngsters in Omari Hutchinson (who was making his senior debut) and Lewis Hall.\nThe contrast between City's firepower and Chelsea's reliance on youth was marked.\nPlayer ratings\nChelsea: Kepa Arrizabalaga 6, Cesar Azpilicueta 6, Thiago Silva 6, Kalidou Koulibaly 7, Marc Cucurella 6, Denis Zakaria 7, Mateo Kovacic 7, Hakim Ziyech 6, Christian Pulisic 6, Raheem Sterling 5, Kai Havertz 6\nSubs: Pierre-Emerick Aubameyang 5, Carney Chukwuemeka 7, Omari Hutchinson 6, Lewis Hall 6, Conor Gallagher 6\nManchester City: Ederson 6, Kyle Walker 5, John Stones 8, Nathan Ake 7, Joao Cancelo 6, Ilkay Gundogan 7, Rodri 6, Kevin De Bruyne 7, Bernardo Silva 6, Phil Foden 5, Erling Haaland 6\nSubs: Manuel Akanji 6, Rico Lewis 6, Riyad Mahrez 7, Jack Grealish 7, Kalvin Phillips 6\nBest and worst performers\nBest performer: John Stones, Manchester City. Was a commanding presence at the back, producing an excellent early tackle to deny Pulisic. Won seven of his eight duels overall.\nWorst performer: Pierre-Emerick Aubameyang, Chelsea. Subbed on in the fifth minute, subbed off in the 68th after 14 touches, no shots and therefore an individual xG of 0.00.\nHighlights and notable moments\nChelsea's attacking ranks are beginning to look rather thin.\nChelsea's injury woes continue 😬 pic.twitter.com/7tc4KGtaP9\n— ESPN FC (@ESPNFC) January 5, 2023\nAfter the match: What the players/managers said\nGuardiola: \"We didn't play good in the first half. I said thank you to Cancelo for his effort, playing in not his usual position, but we decided to go with a lineup where our players could adapt on the pitch if they decided to go five at the back. In the second half, we were miles, miles better in every department. It's a big result for us.\"\nPotter on the pressure mounting on him: \"You always have to take responsibility, but you hope people look at the whole context and see where we are and what we have had to deal with, but at the same time emotions are high and you have to try and ride out any storm and try to stay level. The crowd were behind the team and could see them doing everything.\"\nKey stats (provided by ESPN Stats & Information research)\n- It took Man City 32 minutes and 3 seconds to record their first shot, the longest it's taken the club to record a shot in a game under Guardiola since Oct. 7, 2018, in a Premier League match against Liverpool (38 minutes).\n- Prior to Thursday, the last time Mahrez scored a Premier League goal away from the Etihad was Jan. 1, 2022, at Arsenal.\nUp next\nChelsea and Manchester City won't have to wait very long for a rematch, as they're set to square off in less than 72 hours. The sides will meet in the FA Cup third round at the Etihad on Sunday (11:30 a.m. ET, stream live on ESPN+).",
  "word_count": 1298,
  "scraped_at": "2026-02-14T02:29:04.533270",
  "_text_extracted": true
}