{
  "article_id": "9acf547f28a2",
  "url": "https://theathletic.com/5252083/2024/04/10/eastern-european-clubs-champions-league/",
  "title": "The demise of eastern European clubs , once regulars at football top table",
  "date": "20240410T043000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In May 1991, as Red Star Belgrade prepared to become only the second team from communist Europe to lift the European Cup, they were bracing themselves for an uncertain future.\nHaving set up base in a secluded town near Stadio San Nicola in Bari, the club’s management cocooned their players from the advances of western clubs by placing the squad in semi-quarantine so they were unable to receive incoming calls.\nAdvertisement\nIt was likened to a jail, but Red Star, then part of Yugoslavia rather than the independent state of Serbia, broke out to win 5-4 in a penalty shootout against Marseille and become champions.\nThe team was packed with stellar names and it was an eclectic composition of players from five of the six republics of what was then Yugoslavia: Serbia, Montenegro, North Macedonia, Bosnia and Herzegovina, and Croatia.\nBut the presence of Dragan Stojkovic, the Yugoslavia captain who had been poached by big-spending Marseille owner Bernard Tapie for £5.5million ($7m at today’s rates) in 1990, was a sign of things to come.\nThe Belgrade sports weekly Tempo, which diarised Red Star’s cup final week, stated that 59 players had left for western European clubs in 1990 and the number was expected to be even greater after Red Star’s success.\n“I don’t agree with those who claim that the political situation in Yugoslavia is ‘killing’ the price of our stars,” said Belgrade businessman Branko Perovanovic.\n“This isn’t a question of tourism… if it comes to disintegration (which I don’t believe), our players will profit the most. The football laws that currently ban them from going abroad before the age of 26 will fall. The price of our players is killed by our own unprofessionalism — nothing more!”\nThe unimaginable became reality. Yugoslavia did indeed disintegrate. After a century of suppressed nationalism, civil war broke out in June 1991 and spread across the region, ending in the breakup of the country into six republics (now seven including Kosovo, which declared independence from Serbia in 2008).\nIt led to the top teams in the region being dismantled as players moved their families to safety and cashed in on their peak earning years.\nFive of the winning Red Star XI had left by the start of their European Cup defence, and within two years all of them were gone. Their European Super Cup against Manchester United was diluted to a single game in Manchester and they were forced to defend their title in Bulgaria and Hungary.\nMany saw Red Star’s success as the start of a golden period for the region.\nAdvertisement\nItaly’s manager, Azeglio Vicini, said the Soviet Union had played “the football of the next century” during the Mexico 1986 World Cup and, with Yugoslavia’s Under-20 World Cup-winning team from 1987 reaching their peak, the national team was considered among the favourites for Euro 1992 after reaching the quarter-finals of the 1990 World Cup.\nInstead, the start of an era became the end of one. Red Star remain the last team from former communist Europe (FCE)* to win the European Cup.\nMore profoundly, the idea that another team could do it again has all but vanished.\n(*When referencing former communist Europe, we are referring to the states that emerged from the disintegration of the Soviet Union and the Eastern Bloc, as well as those from non-Bloc Yugoslavia and Albania)\nThe European Cup started on the proviso that only national champions would be entered.\nIn the second edition of the tournament, in 1956-57, the preliminary round featured 21 teams alongside holders Real Madrid, grouped into three geographically balanced groups: seven teams each from north-western Europe, southern-central Europe and eastern Europe. As holders, Real Madrid automatically made it to the first knockout round.\nBefore the Soviet Union entered its first representative in 1966-67, 16 FCE teams reached the quarter-finals in the competition’s opening 11 years.\nHungary’s Vasas (1958) and Vasas ETO Gyor (1965), Czechoslovakia’s Dukla Prague and Bulgaria’s CSKA Red Flag/Sofia (both 1967) all reached the semi-finals, while Yugoslavia’s Partizan Belgrade (1966) were runners-up to Real Madrid.\nIn the competition’s first 35 seasons, until the format changed to a group stage in 1991-1992, FCE clubs accounted for 71 of the 280 quarter-finalists. The depth of quality was shown in the fact that 33 different clubs comprised that total.\nAdvertisement\nAlthough FCE clubs did not regularly make it to the last four, they were represented in four finals, with Steaua Bucharest defeating Barcelona on penalties to become the first to lift the trophy.\nThey were also often the bogeymen of defending champions. Celtic’s Lisbon Lions of 1967 were eliminated in the first round the next year by Dynamo Kyiv, while the Ukrainian club also defeated Bayern Munich in 1976-77 when they were going for a fourth consecutive title.\nBut in 1992, a year after Red Star’s crowning achievement, Europe’s centre of gravity started its shift westward.\nThe European Cup became the Champions League and the format changed to include group stages, taking away the jeopardy of straight knockout ties.\nIn 1997, UEFA made the step of changing the competition to allow league runners-up to enter the tournament and, in 1999, some countries were able to enter up to four teams.\nSince the Champions League switched to its current format of eight four-team groups in 2003-04, only 12 FCE clubs from a total of 105 have progressed to the last 16. The map below gives an idea of the geographical divide, highlighting the teams who made it to this year’s knockout stages.\nIt is 25 years since a club from the region last reached the semi-finals and Shakhtar Donetsk in 2017-18 are the last team to feature in the knockout stage.\nThe Europa League, the continent’s second-tier European competition, has become the level at which they can compete — and even then, success has dried up, with only three victories since the end of communist rule in central and eastern Europe (CSKA Moscow in 2005, Zenit St Petersburg in 2008 and Shakhtar Donetsk in 2009).\nAutomatic qualification for the Champions League being skewed towards the top five leagues is one factor, but why did that change seem to disproportionately affect the former communist countries even more than other nations?\nAdvertisement\nRichard Mills, a professor in modern European history at the University of East Anglia and author of The Politics of Football in Yugoslavia: Sport, Nationalism and the State, first points to the geopolitical changes in the region.\n“In Yugoslavia, you had hyperinflation and an economy on its knees, against the backdrop of rising nationalism, political instability, doubts about the future of the country and a brain drain picking up pace. It was the perfect storm for football to descend into chaos,” says Mills.\n“With the war ratcheting up, Red Star’s victory becomes a Serbian victory in the eyes of many. It becomes increasingly difficult to push a multi-ethnic outlook. You have clubs that are effectively ethnically cleansed from their stadiums within months. The demographic situation is being simplified very rapidly.\n“Red Star as an institution is torn apart. United Nations sanctions completely strangle sporting activity. It takes years and years for it to even think about being able to compete on the European stage again.”\nIt took Red Star until 2018-19 to make the Champions League group stages — 26 years on from their title defence in 1992.\nIronically, the town they stayed in before their most historic night was named Monopoli — the very thing that western European leagues have held over the competition ever since that night in Italy.\nBut it is also the same level of dominance they and city rivals Partizan have held over the Serbian league, with 16 titles for Partizan and 14 for Red Star in the time since, with only Obilic in 1997-98 interrupting the duopoly.\nGO DEEPER\nSerbia, strikers and scouting: Under the skin of one of Europe's talent hotbeds\n“This is the biggest problem. You have the teams who came out of the upper echelons of Yugoslavia and the Soviet Union, then you have the rest,” says Mills.\n“You took what was a coherent football environment and carved it up into fragments, so you don’t have any kind of strength in depth.\nAdvertisement\n“A team like Slovenia’s Olimpija Ljubljana go from competing against high-quality European sides in the Yugoslavia First League every week to playing in a 21-team Slovenian league against villages of a couple of thousand people. They can’t really sustain professional football within that context, let alone challenge in Europe, so they are one of several who go bust.\n“In Serbia and Croatia, there are four or five teams with a fanbase and then there are teams lucky to have 200 people watching them. It is that kind of marriage.\n“Montenegro has a smaller population than Norfolk, so while you have the big two, Buducnost and Sutjeska, beyond that it is small-time, semi-professional and amateur sides. To build anything from that becomes a real challenge.”\nThe contrast in fortunes between clubs from West Germany and East Germany since the fall of the Berlin Wall and German reunification in 1989 is stark. When Germany won the World Cup in 2014, its squad included only one player from the East.\nThe Bundesliga features only two clubs from the East, with RB Leipzig an exception given they are owned by a multinational conglomerate. Clubs in that region simply did not adapt to the new world and many were left behind, now defunct or reduced to an existence as provincial regional teams.\nThe populations of Russia and Ukraine dwarf the other nations, bar Poland and Romania, and is partly why they have been able to maintain a more even domestic league and benefit from oligarch owners who profited from the privatisation of state-owned assets.\nThat overnight switch to a capitalist system caused major societal problems in several countries. It left little in the way of rules or regulations and meant football was ripe for corruption.\n“There was a limbo period where clubs weren’t sure whether they were private businesses or whether they are owned by the state, or something in between,” says Mills.\nAdvertisement\n“Really, that process is still ongoing as hardly any clubs own their grounds in the Balkans. It is why you see clubs emerge quickly through the leagues while functioning on a different model, a private business one.”\nBulgarian champions Ludogorets are a prime example. In 2010, Kiril Domuschiev bought the club, won promotion to the top division the following year and they have won every league since, with the team on course to make it 13 in a row.\nIt echoes the big fish in a small pond conundrum that plagues the competitiveness of Europe’s competitions.\nWhat does not help is the financial gap between leagues, which means clubs often rely on those in rich leagues buying their players to stay afloat.\nBefore the dissolution of Yugoslavia, elite footballers had to ply their trade in their home league until the age of 26-28, meaning the chance of a final payday often came late in their career, if at all.\nIt meant teams could grow together and gain experience in Europe, but that is not as feasible in today’s climate.\nGheorghe Hagi’s Viitorul Constanta (now known as Farul Constanta) won the Romanian league for the first time in 2016-17 with a team mostly comprised of academy players, but they were gradually sold and they could not build the level of the side to access European group-stage competition.\n“It’s more difficult to build a team than buy a team,” he told The Athletic in 2020.\n“Our team’s average age was 21.4 years. That is the big problem in the football world. The best projects take time. You need to mix them together and for the concept to become automatised. Today for tomorrow doesn’t work anymore.”\nClubs from FCE countries disproportionately export their players to other leagues and at a younger age.\nA study by CIES Football Observatory assessing which nations have produced the most players in the top 31 leagues had Montenegro, Croatia, Slovenia, Serbia, Bosnia, North Macedonia and Slovakia all in the top 10 per head of population.\nAdvertisement\nCroatia, despite having a population of just over five million, have the sixth-highest number of players in major European leagues, with Serbia (population around 6.5 million) in eighth place.\nAnother CIES study in October 2021, surveying which academies have produced the most players active in the top 48 world leagues, included Dynamo Kyiv, Shakhtar Donetsk and Dinamo Zagreb in the top 10 (this was weighted to account for the level the players were operating at).\nSlovenia, Croatia and Slovakia are among the six European leagues with the lowest average age of player, which is partly because the age at which their best talents leave has been getting younger and younger.\n“The argument that it is purely down to the breakup of the countries doesn’t hold when you look at other sports like basketball, water polo, handball. These countries still remain very strong in European competitions and it hasn’t affected them in the same way,” says Mills.\n“The best examples to look at are the nations that got their act together quickly and joined the European Union, like Poland. Czech Republic is a bit different as Czechoslovakia was cut in half too, but they have had a smoother transition and their clubs have held up reasonably well.\n“Yugoslavia would probably be doing better than the seven states they are now, but other countries like Turkey, Romania and Bulgaria haven’t had wars and they have had the same drain of talent. It is just almost impossible to compete against the western leagues financially.”\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 2283,
  "scraped_at": "2026-02-14T02:10:47.906003",
  "_text_extracted": true
}