{
  "article_id": "9ad2459de5a3",
  "url": "https://www.ariananews.af/cristiano-ronaldo-celebrates-40th-birthday-wont-retire-yet/",
  "title": "Cristiano Ronaldo celebrates 40th birthday , wont retire yet",
  "date": "20250205T134500Z",
  "domain": "ariananews.af",
  "source_country": "Afghanistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "International Sports\nCristiano Ronaldo celebrates 40th birthday, won’t retire yet\nShowing no signs of retiring, or even slowing down, the Portugal captain has just recently increased his record number of goals to 923\nCristiano Ronaldo, who is arguably one of the greatest soccer players of all times, celebrated his 40th birthday on Wednesday.\nShowing no signs of retiring, or even slowing down, the Portugal captain has just recently increased his record number of goals to 923.\nRonaldo scored twice for Al Nassr, to propel his team to a 4-0 triumph over Al Wasl on Monday, in an Asian Champions League match.\nIt was his 700th club career win.\nRonaldo is widely regarded as one of the best players of all time. In his mind, he also believes he has little competition for that title.\n“I honestly haven’t seen anyone better than me,” the Al Nassr forward told El Chiringuito TV in a recent interview.\n“I believe I am the most complete player that has ever existed. I do everything in football.”\nIndeed, if one takes his achievements and longevity into consideration, then he is indeed one of the greatest players ever.\nRonaldo, who started his professional career at Sporting CP in 2002 before moving to Manchester United one year later, has won 33 senior titles.\nHe has lifted five Champions League crowns, including four during his nine-year spell at Real Madrid.\n“I’m so competitive that many times I forget what I’ve achieved as it gives me motivation to do more and be better every year,” Ronaldo said.\n“I think that is the difference with others. Somebody else in my position would have left football 10 years ago. I continue with that passion. I’m different.”\nRonaldo, who has won five Ballon d’Ors and two FIFA the Best awards, said he isn’t ready to stop.\nCristiano Ronaldo has 923 goals and hopes to reach 1000 before he retires. Y\n“I could honestly end my career now and I wouldn’t have any regrets,” he said.\n“It would be a pity, however, because I’m still very well, I still make a difference. I can continue making a difference for one or two years more,” ESPN reported.\nIt remains to be seen if Ronaldo will reach the 1000 career goal mark.\n“It would be great, but if it doesn’t come, I’m already the player in history with the most goals,” Ronaldo said.\n“To score goals is the best sensation in the world and the most difficult thing in football.”\nAmong his many achievements, Ronaldo captained Portugal to Euro 2016 glory, and to the inaugural UEFA Nations League three years later.\nHe is the men’s all-time leading scorer in international football with 135 goals and holds the world record for most appearances at 217.\nRonaldo is the only player to have featured in six European Championships. He is the record goal scorer in the history of the competition with 14 goals, ESPN reported.\nThe former Juventus star scored a Saudi Pro League record 35 goals in his first full campaign at Al Nassr last season and was named the Best Middle East Player of 2024 at the recent Globe Soccer Awards.\nInternational Sports\nAFC Champions League Elite delivers key results as race for knockout stage intensifies\nIn Tuesday’s action, Sanfrecce Hiroshima claimed a hard-fought 2–1 victory over Johor Darul Ta’zim, strengthening their position as the race for qualification tightens.\nThe AFC Champions League Elite continued on Tuesday, February 10, with four crucial matches that further shaped the standings in Asia’s premier club competition, as teams battle for places in the knockout rounds.\nThe AFC Champions League Elite is the top tier of Asian club football, bringing together the continent’s strongest teams in a league-phase format before progressing to the Round of 16 and the knockout stages later in the season.\nIn Tuesday’s action, Sanfrecce Hiroshima claimed a hard-fought 2–1 victory over Johor Darul Ta’zim, strengthening their position as the race for qualification tightens.\nVissel Kobe continued their impressive campaign with a composed 2–0 win against FC Seoul, reinforcing their push near the top of the standings.\nElsewhere, Buriram United picked up a vital 1–0 away victory over Chengdu Rongcheng, a result that keeps the Thai side firmly in contention for a place in the Round of 16.\nMachida Zelvia also enjoyed a successful night on the road, defeating Shanghai Shenhua 2–0 to boost their hopes of progressing from the league phase.\nThe competition continues on Wednesday with more decisive fixtures on the schedule. Gangwon FC face Shanghai Port in a clash where both sides will be looking to secure valuable points, while Ulsan HD FC host Melbourne City FC in a high-profile encounter with major implications for the standings.\nAll AFC Champions League Elite matches are being broadcast exclusively in Afghanistan on Ariana Television. Fans are encouraged to follow official social media pages for the latest match schedules, updates, and highlights as the tournament moves closer to the knockout stages.\nInternational Sports\nWinter Olympics: Milan action continues with packed schedule on Tuesday\nTuesday’s schedule meanwhile also features a full slate of events, including short-track speed skating finals, cross-country skiing sprints, figure skating competitions and additional freestyle and alpine skiing action.\nCompetition continued across multiple venues at the Milan-Cortina Winter Olympics on Monday, with medals decided in speed skating, snowboarding and curling as the Games gathered momentum.\nMonday’s highlights included high-stakes finals on the ice and snow, as athletes from Europe and Asia featured prominently in speed skating and snowboard events, while curling teams completed round-robin play to determine semifinal match-ups. Several nations strengthened their early medal positions as crowds filled venues in Milan and the surrounding alpine regions.\nTuesday’s schedule meanwhile also features a full slate of events, including short-track speed skating finals, cross-country skiing sprints, figure skating competitions and additional freestyle and alpine skiing action.\nCurling medal matches and women’s ice hockey games are also set to take place as the Olympic programme intensifies.\nOrganisers said competition would continue throughout the day across multiple sites, with several medal events expected to draw strong international interest.\nIn Afghanistan, Ariana Radio and Television Network (ATN) holds exclusive broadcast rights to the Milan-Cortina Winter Olympics.\nFans are also encouraged to follow Ariana News and Ariana Television’s official social media platforms for updated daily schedules, results and coverage from the Games.\nInternational Sports\nIPL 2026: Franchise sales gather pace as global investors circle teams\nRoyal Challengers Bengaluru (RCB) has been put on the market by its current owner and is estimated to be worth up to $2 billion.\nDevelopments off the field are drawing growing attention ahead of the 2026 Indian Premier League season, with two franchises — Royal Challengers Bengaluru and Rajasthan Royals — formally up for sale and attracting interest from high-profile domestic and international investors.\nRoyal Challengers Bengaluru (RCB), one of the league’s most recognisable teams, has been put on the market by its current owner, Diageo’s United Spirits Ltd, following a strategic review. The sale process is expected to be completed by the end of March 2026. Market estimates suggest the franchise could be valued at around $2 billion, reflecting the soaring commercial value of the IPL.\nSeveral bidders have been shortlisted for RCB, including investment groups led by Indian industrialists, private equity firms and overseas sports owners. Among those reported to have shown interest is a consortium linked to the Glazer family, co-owners of English Premier League club Manchester United. Non-binding bids have already been submitted, with binding offers expected in the coming weeks.\nRajasthan Royals (RR), winners of the inaugural IPL title in 2008, are also in the process of being sold. A shortlist of potential buyers has been finalised, featuring a mix of Indian and international investors, including private equity firms, entrepreneurs and media-linked groups. The franchise is expected to attract a valuation of more than $1 billion, according to market estimates.\nFinal bids for Rajasthan Royals are anticipated in early March, while the RCB transaction is expected to move into its final phase later this month. Any change in ownership will require approval from the Board of Control for Cricket in India (BCCI).\nThe potential sales mark one of the most significant ownership shake-ups in IPL history and underline the league’s growing appeal as a global sports investment as preparations continue for the 2026 season.\n-\nSport5 days ago\nChampions League Elite action continues as qualification race tightens\n-\nInternational Sports4 days ago\nIPL 2026: Franchise sales gather pace as global investors circle teams\n-\nSport5 days ago\nEarly medal leaders emerge as Winter Olympics continue in Italy\n-\nLatest News4 days ago\nTerrorist activities observed along Afghanistan borders, says Lavrov\n-\nWorld5 days ago\nHong Kong tycoon Jimmy Lai sentenced to 20 years in jail in national security trial\n-\nLatest News5 days ago\nPakistan president claims situation in Afghanistan is ‘similar to or worse than pre-9/11’’\n-\nBusiness4 days ago\nUzbekistan approves feasibility study agreement for Trans-Afghan Railway\n-\nSport2 days ago\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats",
  "word_count": 1506,
  "scraped_at": "2026-02-14T01:52:15.346178",
  "_text_extracted": true
}