{
  "article_id": "9b12f4c3f5db",
  "url": "https://dailynews.co.tz/dar-to-host-caf-interclub-preliminary-draw/",
  "title": "Dar to host CAF interclub preliminary draw – Daily News",
  "date": "20250808T161500Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dar to host CAF interclub preliminary draw\nDAR ES SALAAM: FOR the first time in history, the Confederation of African Football (CAF) will conduct the preliminary draw of the CAF Champions League and CAF Confederation Cup in Dar es Salaam tomorrow.\nThe draw, scheduled for 4:00pm, will be broadcasted live on CAF’s YouTube page and through CAF’s broadcast partners, signalling the start of what promises to be an exciting season of African club football.\nCAF confirmed the decision in a statement released on its website yesterday, citing the growing popularity of its interclub competitions in the region.\n“Following the overwhelming success of the previous CAF Champions League leading to increased TV audiences, CAF is taking the preliminary draw to Tanzania, Dar es Salaam for the first time,” reads part of the statement.\nThe draw will be hosted at the studios of Azam Media, a key CAF partner in East Africa. Azam hosting CAF draws joins a list of leading broadcasters such as SuperSport, beIN Sport and Canal+.\nCAF noted that East Africa continues to show tremendous growth in cumulative TV audiences for both the CAF Champions League and the CAF Confederation Cup, underscoring the region’s increasing influence in African football.\n“Saturday’s event signals the kick-off of what promises to be another thrilling season of Africa’s premier club competitions the CAF Champions League and CAF Confederation Cup,” the statement added.\nAccording to CAF, the preliminary round will begin on September 19th, followed by the second preliminary round starting October 17. The group stages of both tournaments will kick off on November 21st, while the knockout phase is set to begin on March 13th next year.",
  "word_count": 274,
  "scraped_at": "2026-02-14T02:18:43.320240",
  "_text_extracted": true
}