{
  "article_id": "9b12eb305694",
  "url": "https://www.fourfourtwo.com/news/manchester-united-man-utd-manu-manager-erik-ten-hag-facing-sack-following-copenhagen-defeat-report-rumours-firing-luhg-ggmu-mufc",
  "title": "Manchester United manager Erik ten Hag facing SACK , following Copenhagen defeat : report",
  "date": "20231109T011500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United manager Erik ten Hag facing SACK, following Copenhagen defeat: report\nManchester United manager Erik ten Hag could lose his job, with the Red Devils rooted to the foot of their Champions League group\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester United could sack Erik ten Hag in the coming weeks, following a crushing Champions League defeat away at Copenhagen.\nThe Red Devils lie bottom of their Champions League group, needing a minor miracle to advance to the next round of the competition, following a woeful 4-3 collapse in Denmark. Marcus Rashford was sent off in a seesawing epic in which Copenhagen snatched all three points courtesy of 17-year-old Roony Bardghji in the dying embers of the match.\nWith Manchester United six points off the top four in the Premier League too, pressure is mounting on Ten Hag, with rumours suggesting that the Glazers could be set to axe the Dutchman imminently.\nFootball Insider has claimed that incoming investor, INEOS billionaire and Nice owner Sir Jim Ratcliffe, is set to relieve Ten Hag from duties less than 18 months after he was hired.\nThe former Ajax manager, who won the League Cup in his first season and guided United to third in the table, is to be succeeded by Brighton boss, Roberto De Zerbi, should Ratcliffe get his wish.\nVIDEO: Jim Ratcliffe's Manchester United Takeover EXPLAINED\nThe Sun, meanwhile, believes that legendary manager Sir Alex Ferguson will advise Ratcliffe to stick with Ten Hag for now.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“Erik has Sir Alex’s unwavering support. He’s been hugely supportive of Erik since he arrived at the club,” the report states.\n“He’s impressed at the job he is doing and, in particular, the way he has taken on big decisions.\n“If consulted, that’s a position he would be prepared to make clear to any new investors who come into the football club.”\nMore Manchester United stories\nScott McTominay has revealed how Manchester United's players were motivated to beat Fulham this weekend.\nMarcus Rashford missed that game, though, and Erik ten Hag has had some strong words for one of his star men.\nMeanwhile, a United wonderkid has been linked with a shock move to Manchester City.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 550,
  "scraped_at": "2026-02-14T01:48:34.043058",
  "_text_extracted": true
}