{
  "article_id": "9b2a0478d16b",
  "url": "https://cartilagefreecaptain.sbnation.com/tottenham-hotspur-news/67524/tottenham-hotspur-news-mathys-tel-brought-into-champions-league-squad-dom-solanke",
  "title": "Mathys Tel brought into Tottenham Champions League squad over Dom Solanke",
  "date": "20251209T180000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "One of the first controversies? big decisions? made by Thomas Frank in the early days of his Tottenham Hotspur tenure was the selection of Spurs’ Champions League squad for the group stage. There was a lot of discussion about the lack of home-grown, association-trained players in Spurs’ squad, at least this season, and how it would impact the squad’s construction. In short, Spurs had too many List A players and not enough homegrown players to allow for a full squad.\nMathys Tel brought into Tottenham’s Champions League squad over Dom Solanke\nThis decision suggests the coaching staff is not counting on Solanke to be up to speed until the end of January.\nIn the end, it was newly-signed 19-year-old striker Mathys Tel who got the short end of the stick. Tel was left out of the Champions League squad by Frank, a particularly bitter pill to swallow for the youngster, who has yet to get meaningful minutes in the Premier League either so far this season.\nWell, injuries have changed that somewhat. According to multiple sources, including The Athletic, Dominic Solanke’s long term and ongoing injury has allowed Spurs to make a player swap, bringing Tel in for Dom for what remains of the group stage.\nWait, I hear you saying, how does that work exactly, since the squads were already finalized a few months ago? Apparently there’s a rule in the Champions League that allows for injury-related squad substitutions after a certain period of time. Here’s Alasdair Gold with a good explanation on how it works, with particular attention paid to the fact that an association-trained player is being replaced with a non-association-trained player.\nHowever, a UEFA rule that allows a team to bring in a squad substitute if a player has been ill or injured for 60 days has allowed Spurs to make the change, but it can only be done up until the sixth game of the group phase, which falls this week with the game against Slavia Prague, which Tel can now play in.\nYou cannot normally change an association trained player for a non-locally trained player, but Spurs have been able to register the four required association trained players in Djed Spence, Archie Gray, Ben Davies and Brennan Johnson, which allows Solanke to move into the main group, so he can be replaced by Tel. The UEFA rule suggests that Solanke can come straight back in for Tel when he returns to fitness.\n— Alasdair Gold, Football.London\nThis means a couple of things — Tel will now be an option to play off the bench not only for tonight’s match against Slavia Prague at the Tottenham Hotspur Stadium, but also the last two group stage matches home to Dortmund and away at Eintracht Frankfurt. That’ll be good for him, hopefully, and will give him a boost of confidence. He’s been good for France U21 and is clearly a talented player, but my guy needs minutes if he’s going to improve.\nBut secondly, this gives a little insight into Solanke’s injury return timetable, and it’s not great. If Solanke is the man to make way in the squad, it means that Frank doesn’t think Solanke will be at a place where he can be useful in the Champions League until the next round, assuming Spurs make it that far. The Frankfurt match is January 28. Now, that’s not to say that Solanke might not return and play in the Premier League before that point, but it does suggest that the coaching staff is not counting on Solanke to be a factor in the Champions League until at least the end of January.\nFrank even admitted that had he known the extent of Solanke’s absence he never would’ve left Tel out of the squad to begin with.\n“Of course, if I knew back then what I know now, it maybe would have changed the decision, no doubt about that. Of course, it’s something we can have in consideration. We need players that are fit and available, so we have enough players to shoot with from the bench.”\nI don’t know if we’ll see Mathys Tel on the pitch tonight against Slavia Prague, but it seems very likely he’ll be on the bench, and that’s still a heck of a lot better than not being in the squad at all.",
  "word_count": 722,
  "scraped_at": "2026-02-14T02:03:26.516238",
  "_text_extracted": true
}