{
  "article_id": "9b4309504f04",
  "url": "https://clutchpoints.com/manchester-united-news-raphael-varane-saudi-arabia",
  "title": "Manchester United star deny talks with Saudi Arabia",
  "date": "20230823T073000Z",
  "domain": "clutchpoints.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United star defender Raphael Varane has assured that he will not leave Old Trafford in this transfer window. The Frenchman has been considered one of the key defenders in the system of Erik ten Hag.\nAccording to the reports of Fabrizio Romano, Varane has denied contact with the Saudi Pro League. Although he is linked with a move to the Middle East, the Manchester United defender has insisted that he will stay at Old Trafford. The Red Devils also consider the World Cup winner an important member of their squad, and he's not on the transfer list.\nVarane signed for Manchester United in 2021 from Real Madrid but has had a mixed bag of performances since his Old Trafford move. His debut campaign was disappointing, hampered by injuries and poor performances. However, to be frank, he wasn't the only one to blame, as the entire team was flat, finishing 6th in the Premier League and crashing out of the Round of 16 in the Champions League.\nHowever, Varane improved in his first season under ten Hag. He created a formidable partnership with Lisandro Martinez, enabling the Red Devils to create a fantastic home record in all competitions. Manchester United haven't lost a game at Old Trafford since the opening week of last season when they lost 2-1 to Brighton.\nVarane retired from International Football after the 2022 World Cup, and his future career will only be limited to domestic football. This is an important thing for Manchester United as their main defender won't have a tough schedule hampered by international duty. However, their only concern is to keep Varane fit for the season, which hasn't been the case in his two full seasons at Old Trafford.",
  "word_count": 287,
  "scraped_at": "2026-02-14T01:56:26.907724",
  "_text_extracted": true
}