{
  "article_id": "9b4e60f2b24b",
  "url": "https://www.dailymail.co.uk/news/article-13795783/Kieran-Trippier-called-time-England-spotlight-wife-charlotte.html",
  "title": "Revealed : The REAL reason why England star Kieran Trippier called time on his international football career",
  "date": "20240830T104500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inside Kieran Tripper's decision to retire from England career after marriage breakdown with childhood sweetheart\nKieran Trippier retired from international football to focus on life outside football after the breakdown of his marriage, MailOnline understands.\nThe Newcastle United defender, 33 called a halt to his England career following a tumultuous time off the field resulting in the end of his six-year marriage to Charlotte.\nSources close to the footballer told MailOnline that they believe he partly took the decision to step away from the England set up in the hope that it would remove a 'layer of pressure' as he attempts to rebuild a new life without his wife.\nThe source said: 'Kieran has faced a lot of problems recently and it's not been easy for him. Premier League footballers are under the public spotlight as it is and being in the England team just increases this.\n'He's hoping that not being involved in international football will take some of the pressure off him. He just wants to get out of the media limelight as much as he can because there's been a lot of coverage about what's been going on.'\nThe Newcastle United defender, 33 called a halt to his England career following a tumultuous time off the field resulting in the end of his six-year marriage to Charlotte\nThe couple enjoying a holiday together before their split\nCharlotte provided an insight into their troubles when she took to Instagram just 48 hours before England's final group game against Slovenia and posted a cryptic message\nAnother source added: 'Kieran loved playing for England and his decision was driven by a combination of football reasons and the end of his marriage. He's hoping that not being involved with the international game will help him to get on.'\nSpeculation surrounding Trippier's marriage emerged when Charlotte did not travel for any of England's games during the Euros.\nShe provided an insight into their troubles when she took to Instagram just 48 hours before England's final group game against Slovenia and posted a cryptic message.\nIn her post, Charlotte wrote: 'Sooner or later you get over the s*** you swore you'd never get over and it's the best feeling in the world.'\nFurther posts in the story, which included the caption 'the sun is shining, happy Monday', showed the WAG sitting in the car listening to music while she waits to pick up her children from school.\nThe profile belonging to her husband did not come up in the list of accounts she was following - leading social media users to claim she had unfollowed him.\nFollowing the end of the Euros, the couple also headed off on separate holidays, further underlining their marriage breakdown.\nTrippier flew to Turkey with his close pal and England teammate Kyle Walker, who has endured his own marriage difficulties in recent months.\nCharlotte went to Santorini with her sister and posted a series of glamorous pictures of herself in stunning outfits and bikinis.\nDuring the Euros it also emerged that the couple's lavish six-bedroom house had been put on the market for £3.8 million.\nThe multi-million-pound mansion was built in 2009 and includes an open plan kitchen diner, a Grand entrance hallway, swimming pool, a formal living room with fireplace and a reception room.\nThe property is surrounded by landscaped gardens in a quiet, woodland setting.\nSources close to the footballer told MailOnline that they believe he partly took the decision to step away from the England set up in the hope that it would remove a 'layer of pressure' as he attempts to rebuild a new life without his wife'\nCharlotte uploaded a slew of snaps from a holiday in Greece last month\nMeanwhile, the footballer headed off to Turkey with Kyle Walker before jetting over to Dubai\nCharlotte is believed to have moved out of the family home with the couple's three children and is living in a mansion nearby.\nOne of the first indications that all was not well between them surfaced last year when Trippier was filmed getting close to a blonde woman in a Newcastle karaoke bar where he was with teammates celebrating Newcastle's qualification for the Champions League.\nIn the footage, he wrapped his arms around the mystery woman and then picked her up by her bottom as the crowd belted out a karaoke tune.\nOn the pitch, the new football season has not got off to the best of starts for Tripier, who has struggled to find a regular starting spot in the Newcastle United team and also lost the captaincy.\nIt has been reported that he now wants to leave the club he joined in January 2022 and has been linked with a move to Everton.\nThe source said: 'Things are very much up in the air for Kieran, and he's not ruled out the possibility of even moving abroad.'\nAnnouncing his international retirement on social media, Trippier wrote: 'I never thought as a young lad from Bury that I would play for my country let alone achieve 54 caps.\n'It's been one of the biggest honours of my life to represent my country at 4 major tournaments.\nHe added: 'And finally a big thank you to all the England fans for your incredible support travelling all over the world to support us and keeping us going in the difficult moments.'\nCharlotte and Trippier first met in 2014 and married two years later but she has always been considered one of the more private WAGs.\nCharlotte spending time in Santorini with her sister\nThe Newcastle defender has retired from international football\nShe gave birth to their first son Jacob in December 2016. Daughter Esme Rose was born in February 2020.\nAnd the newest addition to their family was in 2022 when they welcomed their third baby.\nPrior to their breakup, Charlotte and the children regularly attended Newcastle United games to watch Trippier in action and she has been credited with playing a major part in his success.\nCharlotte used to run Instagram fashion blog Style Up Sisters alongside her sister Rosie Wray, but the account appears to no longer be active.\nCharlotte and her husband appeared together in a Prime Video documentary about Newcastle United in which she spoke candidly about her difficulties when they moved to Spain where Tripper was playing for Atletico Madrid.\nShe said: 'When we first moved to Madrid, I was on my own for long. I felt so lonely, 'cos people don't see that side of things. About four months in, I was saying to him 'I don't know if I can stay here Kieran, I feel depressed. I've got no family over here, I've got no friends here.'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Food vlogger dies after 'eating toxic devil crab'\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Deepak Chopra confronted over his relationship to Epstein\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 1241,
  "scraped_at": "2026-02-14T02:14:29.070481",
  "_text_extracted": true
}