{
  "article_id": "9b5d6c2b41e0",
  "url": "https://theprideoflondon.com/otd-chelsea-s-last-trophy-under-roman-abramovich-s-ownership-01jkxmmfp1yd",
  "title": "OTD : Chelsea last trophy under Roman Abramovich ownership",
  "date": "20250212T181500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Many clubs can call themselves the “Champions of Europe” or the “Champions of Africa” but few can call themseves the “Champions of the World” and that short list includes Chelsea Football Club. The Blues lifted the 2021 Club World Cup trophy, played in 2022 thanks to COVID pushing the football calendar by a year or so, and it happened to be the last trophy under Roman Abramovich.\nChelsea qualified for the competition by virtue of winning the Champions League in 2021 and entered it in the semi-finals as the rules allow the CONMEBOL and UEFA teams to skip the earlier stages. They defeated Saudi giants Al-Hilal 1-0 in the semifinals thanks to a goal from Romelu Lukaku and moved on to the final against Brazilian superclub Palmeiras.\nThe final was hard fought as Chelsea took an early second half lead, again through Lukaku, but were pegged back by a Palmeiras penalty just 10 minutes later. The match went into extra time and looked to be headed to penalties until a handball in the box was called against the Brazilians.\nKai Havertz stepped up to bury the penalty and scored his second trophy-winning goal for the Blues less than a year after he won the Champions League against Manchester City. This was back when he was still known for scoring big goals in big games for the Blues and fans lovingly called him “King Kai’.\nShortly after the Blues won the tournament in February 2022, Roman Abramovich was forced by the Premier League and the UK government to divest himself from Chelsea. They won an astounding 19 major domestic and European trophies during his reign from 2003-21 and they were able to cap it off with the one that crowned them champions of the world.\nChelsea under Roman Abramovich were known for spending on big name players, developing the academy setup, being impatient with managers, and most importantly for winning trophies. There was a ruthless approach to the whole thing as Chelsea went through managers like footballers go through boots but success was the constant all throughout.\nSince the departure of Abramovich, the Club World Cup is the last trophy the Blues have lifted despite massive spending by new ownership. The club has fallen way out of Premier League title contention and the closest they have come to a title is the 2023-24 League Cup where they fell short against Liverpool.\nThe club has shifted focus from the ruthless big money approach to a long term approach of investing in young talent and hoping they develop. We will have to wait and see if this approach becomes successful but we think it is safe to say that nothing will ever come close to the success the Blues experienced under Roman Abramovich. The circumstances around his departure still dont sit right with many Chelsea fans but we can take solace in the fact that he went out on top.",
  "word_count": 487,
  "scraped_at": "2026-02-14T02:08:52.954399",
  "_text_extracted": true
}