{
  "article_id": "9bb0d86aa5d8",
  "url": "https://www.90min.com/posts/fara-williams-reveals-2023-women-world-cup-predictions",
  "title": "Fara Williams reveals 2023 Women World Cup predictions - including overall winner & dark horse",
  "date": "20230709T183000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fara Williams reveals 2023 Women's World Cup predictions - including overall winner & dark horse\n- Fara Williams shares her prediciton for the 2023 Women's World Cup with 90min\n- England's most capped player loves analysing football\n- Successfully predicted last season's WSL top three and England 4-0 Sweden\nEngland legend Fara Williams has earned a reputation as a predicitons savant since swapping her boots for a microphone, most notably predciting the Lionesses' unexpectedly one-sided 4-0 demolition of Sweden in the semi-finals of Euro 2022 last summer.\nIn a previous interview with 90min last October, she also successfully predicted that Chelsea would win a fourth consecutive WSL title in 2022/23, that Manchester United would finally break into the top three to qualify for the Champions League and that Manchester City would miss out.\nBut Williams, England's most capped female or male player of all time, is no chancer who simply gets lucky with her predictions. By her own admission, she loves analysing the game, which is why she has become such an in-demand pundit, and delving into what she calls the 'nitty gritty'.\nThis summer she has partnered with LiveScore for a weekly column around the Women's World Cup.\n\"I'm really excited because I love analysing football and it's going to the nitty gritty and the honesty. It will open up engagement for fans to come ay me with opinions, which is what I really like,\" she explains in an interview with 90min.\n\"LiveScore started their women's section last year at the Euros and have really invested since then in terms of growing their audience. If you download the LiveScore app, you get live results and goals as they go in, which is exciting because it hasn't been done for the women's game before.\"\nGiven her expertise and track record in the predictions game ahead of what promises to be the biggest Women's World Cup yet, the natural thing to do was ask Williams for her thoughts on what will happen at the upcoming tournament, any potential shocks and her pick for the overall winner.\nGroup A - New Zealand, Norway, Philippines, Switzerland\nContext: New Zealand are co-hosts but have never won a World Cup game across five previous tournaments. Norway are looking to bounce back after a surprisingly poor Euro 2022, while Philippines are first-time qualifiers with a largely inexperienced squad.\n\"There's no shock. I think Norway and Switzerland qualify through that,\" Williams says.\n\"What will be a shock is if New Zealand get out of that group – I wouldn't put it past them just because the home crowd could help towards that. [But] progress for New Zealand would be to win a World Cup game. It didn't quite happen for them at the last World Cup.\n\"If Norway and Switzerland don't qualify out of that group, that's a disaster for them.\"\nGroup B - Australia, Republic of Ireland, Nigeria, Canada\nContext: Australia have never been beyond the quarter-finals but are a contender to go all the way as co-hosts with Sam Kerr leading the line. Nigeria are World Cup ever-presents, while Canada are reigning Olympic champions, and Ireland are here for the first time.\n\"I was being harsh and having a bit of banter with Katie McCade, the Irish captain - we're good friends – saying I don't think they’ll score a goal in that group, just to rub her the wrong way,\" Williams says\n\"She was quite annoyed by that and seems to think Ireland will get out of the group – I don't think that happens, but who knows?\n\"Nigeria are always tough opposition. I'm going to say Australia and Canada progress from the group.\"\nGroup C - Spain, Costa Rica, Zambia, Japan\nContext: Spain come into the World Cup having only partially resolved their player dispute, recalling some of the stars who declared themselves unavailble last September. Alexia Putellas is back from injury. Japan won in 2011, while Zambia stunned Germany in a recent warm-up friendly.\n\"Spain will win and I think Japan finish second. Spain and Japan dominate,\" Williams says.\n\"I still think there are a few big players missing in that [Spain] squad. It's disappointing because you want a tournament to have the best players on show. Their number one goalkeeper [Sandra Panos], not there, centre-half [Mapi Leon], not there.\n\"[But] they're still strong – Spain always develop good young talent, we're still seeing that. They continued without nine starting players and their young players went ahead and did the job, so they're not short of talent. I'd have liked to see a fully available squad and they might have had an even better chance of winning the tournament.\"\nGroup D - England, Haiti, Denmark, China\nContext: England won Euro 2022 last summer for a first major international trophy, but the Lionesses are missing Beth Mead, Leah Williamson and Fran Kirby to injury, with Ellen White and Jill Scott also retiring since the tournament. Haiti are first-time qualifiers. Denmark are often inconsistent.\n\"England win the group. Denmark or China to finish second. I think both have an equally good chance of going through and I think their head to head will be the difference,\" Williams says.\n\"Pernille Harder came to form at the end of the season with Chelsea, obviously having a big chunk of the season out through injury. She will be super fit and is an exciting player who can carry this Denmark team further than expectations.\"\nREAD MORE ON THE WOMEN'S WORLD CUP IN AUSTRALIA & NEW ZEALAND\nGroup E - United States, Vietnam, Netherlands, Portugal\nContext: The United States have won each of the last two World Cup and have a squad blend of older returning champions and new talent. Netherlands reached the 2019 final but disappointed at Euro 2022, with Portugal arguably Europe's most improved team. Vietnam have never qualified before.\n\"Portugal have surprised me, especially in the [0-0 friendly] against England – they frustrated and have a couple of individual talents. They've certainly progressed from the Euros and look a much better team, more organised, leak less goals and beat USA recently as well,\" Williams says.\n\"I would have said America and Netherlands [go through]…but Portugal? When Netherlands played them at the Euros, it was a tough game for the Dutch even though they won. Is there going to be an upset in that group and Portugal progress? I'm going to put a question mark by that one.\n\"[Netherlands?] With a new manager going into the Euros and now another new manager, and [without] Vivianne Miedema...her absence is big. They are in transition and trying to find their way again, moving on from a few of the older players, but they've got some great young talent. They should progress and I think if Portugal do ahead of them, that's a failure for this Netherlands teams.\"\nGroup F - France, Jamaica, Brazil, Panama\nContext: France and Brazil are both ranked top eight in the word by FIFA and possess some of the game's biggest names. But Jamaica have gathered something of a cult following with Manchester City striker Khadija Shaw leading the line. Panama are competing at their first World Cup.\n\"France progress as group favourites. Brazil should go through,\" Williams says.\n\"But Jamaica, for some reason…Bunny Shaw, can get you a goal? They've got a lot of WSL players in their squad. I've been reading some of the off-field stuff around the Jamaica federation – hopefully that gets resolved.\n\"I'd like to think they could upset the odds, but the experience of France and Brazil in World Cup football might be a bit too much for them.\"\nGroup G - Sweden, South Africa, Italy, Argentina\nContext: Sweden are longstanding giants of women's international football and often go far in tournaments but haven't won a major competition since the inaugural European Championship in 1984. Italy impressed in 2019 but went backwards at Euro 2022.\n\"Sweden as group winners, but I think it's quite open,\" Williams says.\n\"Italy really let themselves down at the Euros, I think they would have expected to do a lot better. With Roma and Juventus players – I actually expected more from Italy at the Euros. You don't know which Italy are going to turn up, that’s the thing.\n\"South Africa are a bit of a dark horse but they've had problems, I've seen in the media they boycotted a game recently and some craziness going on there. Italy should go through, but I wouldn't really put it past South Africa. I don't think Argentina [will go through].\"\nGroup H - Germany, Morocco, Colombia, South Korea\nContext: Germany are two-time World Cup winners and reached the final of Euro 2022 after quarter-final exits at Euro 2017 and the 2019 World Cup. South Korea have only won one of 10 World Cup games they have played. Colombia have similarly won one of seven, with Morocco first-timers.\n\"Obviously the Germans top that group. But [the rest] could go any way,\" Williams says.\n\"Should I put my neck on the line and go with Korea [to finish second]? Korea are the more experienced out of the three others.\n\"Morocco are new to the World Cup and Colombia are unpredictable, but difficult opposition. If they bring fans to Australia they have every chance because their fans are crazy. I remember the 2015 World Cup when we played Colombia, their fans were so bloody loud.\"\nOverall winner & tournament dark horse\n\"Germany to win,\" Williams says.\n\"[But] if England beat Germany in the quarter-finals, I think England could win.\n\"A dark horse, if we could call it a dark horse, would probably be France. Only because in previous tournaments they’ve not really lived up to expectation for the talent in their squad. I actually think they could be someone nobody is speaking about.\n\"They've got a really good manager (Herve Renard) now and the environment looks as if it's a lot better than in previous years. They've brought a couple of their older players back into the squad, which should have been done last summer.\"\nKeep up to date with all the key moments, content, scores, and tournament details from the Women’s World Cup with the LiveScore App.",
  "word_count": 1700,
  "scraped_at": "2026-02-14T02:07:08.868509",
  "_text_extracted": true
}