{
  "article_id": "9c021cf6326f",
  "url": "https://www.uefa.com/uefaeuropaleague/news/028b-1a5c2c1c2532-2862c9101e3e-1000--what-to-look-out-for-in-the-uefa-europa-league-round-of-16-s/",
  "title": "What to look out for in the UEFA Europa League round of 16 second legs | UEFA Europa League",
  "date": "20240308T153000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What to look out for in the UEFA Europa League round of 16 second legs\nThursday, March 14, 2024\nArticle summary\nLeverkusen are braced for more of the same from Qarabağ, West Ham seek home comforts while Rangers and Benfica prepare to resume an almighty tussle.\nArticle top media content\nArticle body\nThe UEFA Europa League quarter-finals beckon, and while Liverpool and Roma have one foot in Friday's draw, plenty more ties are in the balance. Leverkusen resume against Qarabağ with the scores level at 2-2 and West Ham trail Freiburg while Rangers and Benfica are ready to resume an almighty tussle.\nIn this piece presented by Enterprise Rent-A-Car, we pick out some key talking points ahead of the second legs on 14 March. Remember: Every mission matters.\n18:45 CET\nVillarreal vs Marseille (0-4)\nRangers vs Benfica (2-2)\nWest Ham vs Freiburg (0-1)\nSlavia Praha vs AC Milan (2-4)\n21:00 CET\nBrighton vs Roma (0-4)\nLeverkusen vs Qarabağ (2-2)\nAtalanta vs Sporting CP (1-1)\nLiverpool vs Sparta Praha (5-1)\nWhat happens next?\nQuarter-final & semi-final draws: 15 March\nQuarter-finals: 11 and 18 April\nSemi-finals: 2 and 9 May\nFinal: 22 May\nWhat to look out for\nQarabağ not done yet against Leverkusen\n\"I don't want to name any individuals, but they have quality players who are capable of playing in the top leagues,\" Xabi Alonso said of Qarabağ in Baku, and not without good reason. For 91 minutes, the Azerbaijani champions ran his Leverkusen side hard, coming as close as any team has to beating the runaway Bundesliga leaders this season before Patrik Schick swooped in to salvage a 2-2 draw for the visitors.\nQarabağ have been bubbling under for a while now, steadily improving during Gurban Gurbanov's 16-year tenure at the helm. Alonso recalled their draws with Atlético de Madrid during the 2017/18 UEFA Champions League and, while much of the Horsemen's success has been at home, they are increasingly a force on their travels. \"I'll prepare the team to play even better in Germany,\" warned Gurbanov. Believe it.\nCan Freiburg burst West Ham's bubbles?\nP10 W10 D0 L0 F25 A6. Whose recent European home record is this? Not Inter, Real Madrid, Bayern nor Atlético de Madrid. Not even Manchester City (the European champions are on a 12-match winning home run). It is of course West Ham. The UEFA Europa Conference League holders have been formidable on their own turf over the past two seasons and, after losing 1-0 away to Freiburg, they know only another victory will do.\n\"We didn't have our shooting boots on,\" David Moyes rued after the first leg. \"We'll do everything to try and turn it around. We'll have our crowd and atmosphere behind us.\" Much rests on the shoulders of Jarrod Bowen, who last month registered his first professional hat-trick, though his sights were slightly off in Germany. The West Ham faithful expects, and so does England, with this match potentially having repercussions for next season's Champions League entry.\nRangers and Benfica set to resume tussle\nBenfica and Rangers both went into the first leg nursing that rarest of wounds: domestic defeat. For the Eagles it was particularly raw, their wings summarily clipped in a 5-0 loss at Porto, and the Scottish side arrived in Lisbon braced for the retaliation. \"The coach told us that, as they were at home, they had to show a big response after their last result,\" said Rangers' Portuguese forward Fábio Silva, once of Porto. \"We are not used to defending like this.\"\nDefend Rangers did as Benfica threw everything at them, to the tune of 24 attempts on goal and 13 corners. A 2-2 draw felt like something of a victory for the visitors, and more like a defeat to the Portuguese side. \"We have to be positive, believe in ourselves, try to improve, correct our mistakes,\" said Benfica's Nicolás Otamendi. \"We're going through a tricky phase and the important thing is the unity of the group, trying to move forward.\" Rangers will not make that easy, especially at Ibrox.\nWhere is the 2024 Europa League final being played?\nThe 2023/24 Europa League season will conclude at Dublin Arena in the Republic of Ireland on 22 May 2024.\nWith a capacity in excess of 50,000, Dublin Arena is the home of the Republic of Ireland's national football and Ireland's rugby union team. First opened in 2010, the stadium will be staging its second Europa League decider, having been the venue for the all-Portuguese final of 2011 between Porto and Braga, when Radamel Falcao scored the only goal as the Dragons took the trophy.",
  "word_count": 766,
  "scraped_at": "2026-02-14T02:29:59.647514",
  "_text_extracted": true
}