{
  "article_id": "9c06ff807b60",
  "url": "https://www.caughtoffside.com/2024/05/02/chelsea-new-goalkeeper-pochettino/",
  "title": "Chelsea transfer news : Blues looking to sign Aaron Ramsdale from Arsenal",
  "date": "20240502T101500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mauricio Pochettino remains a beleaguered figure at Chelsea Football Club, with no idea as to whether his tenure at Stamford Bridge will continue beyond the current campaign.\nGiven an incomprehensibly bad injury list which has lasted for the majority of the season, the Argentinian has done remarkably well to get the team to a Carabao Cup final and an FA Cup semi-final, whilst keeping the club reasonably competitive in the Premier League.\nHowever, the fact remains that the Blues haven’t won anything this season and there’s every chance that they won’t make it into European competition for next season.\nChelsea targeting Aaron Ramsdale\nThough a Champions League berth would arguably have been preferred by Todd Boehly, the very least the American is likely to have settled for is the Europa League.\nEven that could be out of reach unless Chelsea win their remaining five games and results elsewhere go their way too.\nAssuming that precise scenario occurs, it would be no real surprise to see Pochettino sent packing, despite the extenuating circumstances.\nEven if he stays, it appears that decisions are already being made above his head which is surely something that the Argentinian won’t abide.\nAccording to the Daily Mail (h/t Fichajes), the Blues are running the rule over Arsenal’s out-of-favour goalkeeper, Aaron Ramsdale.\nEver since David Raya arrived at the Emirates Stadium, Ramsdale has been persona non grata at Arsenal, and a move away would surely be welcomed by the custodian.\nChelsea are believed to be unhappy with their goalkeeping options of Robert Sanchez and Djordje Petrovic, not to mention that Kepa Arrizabalaga will return from Real Madrid at the end of the season.\nIf Ramsdale is taken to the European Championship by Gareth Southgate, which isn’t a definite at this point because of a lack of first-team action, he might at least be able to get back some of the confidence lost when replaced by Raya.\nChannelling that into any new position at Chelsea would certainly be a win-win situation for the Blues.",
  "word_count": 336,
  "scraped_at": "2026-02-14T02:07:51.313638",
  "_text_extracted": true
}