{
  "article_id": "9c0a5d7fb2ab",
  "url": "https://www.gdnonline.com:443/Details/1345468/Mbappe-powers-Real-Madrid-into-last-16",
  "title": "Football : Mbappe powers Real Madrid into last 16",
  "date": "20250219T231500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid dispatched Manchester City 3-1 with a Kylian Mbappe hat-trick last night in their Champions League playoff second leg at a raucous Santiago Bernabeu stadium, earning them a 6-3 aggregate victory and a place in the last 16.\nLast year’s champions will face either Bayer Leverkusen or city rivals Atletico Madrid, depending on today’s draw, as they seek a record-extending 16th title.\nIt was the first time in City coach Pep Guardiola’s illustrious career that one of his teams in the Champions League had failed to reach the round of 16.\n“It was a perfect night,” Mbappe said.\n“It’s only logical that Real Madrid advance to the last 16 of the Champions League. We are very strong at home and it’s great to give joy to our fans.”\nReal did not have to work too hard to subdue their sorry rivals who failed to manage a shot on target on the first half, looking a shadow of Guardiola’s dominant force from past years.\nAlready 3-2 down after a first leg defeat at home, City’s task became even harder an hour before kickoff when they announced a starting 11 without leading striker Erling Haaland, who suffered a knee injury at the weekend.\nWith City looking clueless and out of ideas, Real took full control of proceedings and never looked under threat.\nMbappe opened the scoring with Real’s first attack in the fourth minute, taking advantage of another massive blunder by City’s defence when captain Ruben Dias missed his header and left the French forward free to lob over the onrushing Ederson.\nMbappe scored again in the 33rd minute with a close-range strike after a humiliating cutback that left defender Josko Gvardiol on the floor.\nReal kept piling on the pressure and wasting chances against Pep Guardiola’s struggling team. Mbappe scored his third in the 61st minute with a left-footed strike from the edge of the box just inside Ederson’s right post.\nManchester City scored a compensation goal at the death, Nico Gonzalez converting a rebound after Omar Marmoush’s free kick bounced off the crossbar, but it did little to tarnish a fantastic night for the Spaniards.\nMeanwhile, Paris St Germain cruised into the last 16 with a crushing 7-0 home victory over fellow French side Brest in their knockout phase playoff second leg to secure a 10-0 aggregate triumph.\nFollowing PSG’s 3-0 away win in the first leg, both teams started slowly, showing little urgency or a clear game plan with the hosts fully in control of the tie.\nBradley Barcola broke the deadlock for PSG after 20 minutes and shortly before halftime Khvicha Kvaratskhelia doubled the lead with a tap-in from a tight angle.\nVitinha made it three just before the hour mark and Desire Doue added the fourth.\nNuno Mendes grabbed PSG’s fifth, Goncalo Ramos added a sixth and Brest’s humiliation was complete four minutes from time when Senny Mayulu became the seventh PSG player to score and complete the rout.\nTop stories for today:\nLatest innovations in sustainable agriculture on show\nRamadan gifts for needy families\nBuying home appliances becomes more affordable",
  "word_count": 515,
  "scraped_at": "2026-02-14T01:52:15.334517",
  "_text_extracted": true
}