{
  "article_id": "9c1443b76b13",
  "url": "https://www.caughtoffside.com/2025/11/28/enzo-maresca-full-press-conference-transcript/",
  "title": "Enzo Maresca full press conference transcript",
  "date": "20251128T170000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea manager Enzo Maresca has spoken at a press conference ahead of this weekend’s big Premier League game against Arsenal.\nThe Blues host the Gunners at Stamford Bridge on Sunday afternoon, and it could end up being a crucial six-pointer in this season’s title race.\nChelsea are six points behind league leaders Arsenal at the moment, but they’re in fine form after beating Barcelona 3-0 in the Champions League this week.\nMaresca has now given a press conference looking ahead to the game, discussing topics such as the Moises Caicedo vs Declan Rice debate and Cole Palmer’s fitness. Read on for the full press conference transcript below…\nEnzo Maresca full press conference transcript\nAny other concerns after Tuesday night at all?\nNo. We have also Dario Essugo, he took part in the session this morning. So, good news for both.\nIs Estevao Willian making it very difficult not to pick him week in, week out with performances like he did on Tuesday?\nIt’s always good when the ones that they start and they play, they do the right things. It’s good because they give, in this case, they give me a doubt always for the next games. But it’s important that when they have the chance, they play good, they do the right things. And then it’s a good problem for the manager always.\nArsenal top of the league, top of the Champions League. What is it about Arsenal that you think are setting them apart from everybody else this season?\nFor sure they defend fantastically. Any teams against them, they struggle to score goals, not only to score goals, but even to create chances. So it’s a team that they defend very well. Then they have weapons when they attack. So I think it’s, as you said, in this moment they are top in the Champions League, they are top in the Premier League. And we’re going to try our best to win the game.\nAre Moises Caicedo and Declan Rice the two best midfielders in the Premier League and do you see that midfield battle as being maybe a key between who comes out on top on Sunday?\nI think the Premier League is full of good players, very good midfielders. As you said, Moises, Declan, Rodri from City, [Elliot] Anderson from Nottingham Forest, [Bruno] Guimaraes from Newcastle. I think the Premier League is full of very good midfielders.\nDo you see that midfield battle though as being crucial on Sunday?\nIt’s a big part but it’s not the only one. I think it’s 11v11, the ones that go on from the bench. The big picture is not just one part of the picture. It’s a big game, first versus second.\nYou win, you go three points behind Arsenal. There is talk that there’s not too much expectation on Chelsea to perhaps win the Premier League this season. But if you were to beat Arsenal on Sunday and close that gap, would there be a feeling internally that actually this might be something we could achieve this year?\nI think it’s too early in any case. If we win, if we don’t win, I think it’s too early. We are still, end of November, we are still five, six months to go. I think it’s very important when we’re going to be in February, March, where we are, and from there we decide and we see if we can achieve something important.\nWould you say Arsenal is an even bigger challenge than Tuesday night?\nI think it’s, I said after the game, it’s another big game. We finished one against Barcelona. As you said, we won, it was a good feeling. And now we have another one. Now if it’s bigger than the last one, I don’t know. For me, they are all important games for sure. Beating Barcelona, or in case we are able to beat Arsenal, it’s a nice feeling. But at the end, it’s three points.\nIs the feeling different in training? Is the mood different, the mindset different at all?\nYeah, the mindset and the mood in this moment for us is very good because we are doing quite good in the Premier League, we are doing quite well in the Champions League. I think it’s a good feeling also that we can see that we are improving, we are growing. So this is the best feeling for us.\nIt was an amazing atmosphere on Tuesday night at Stamford Bridge. How important to recreate that on Sunday? Can you use that to your advantage?\nAbsolutely, yes. We need that environment, we need the fans in the way they were. And it’s always nice to share that kind of moment at the end of the game with everyone.\nIt was about this time last year that people were saying you could win the title, but you played it down. Do you think it’s different now? Do you think you are ready as a group to win it?\nI think for sure it’s different compared to one year ago. It’s because we spent one more year together. We went through moments where we can learn from that moment. Then again, for me it’s very early. We are still at the end of November, December. So it’s very early and it’s important to be where we are now in March, April and then we’ll see.\nCan you see different mentalities in the players this season and wins over Barcelona surely that’s only going to help?\nYes, but these players, I can understand that we are always talking about the last game. But I think these players, they showed many times that they can beat teams. In the Premier League last year I think we had some good moments where we were able to beat teams. Then PSG, the Club World Cup final. This season, I don’t know, against Liverpool or Barcelona. We compete always. Sometimes we are able to win, sometimes we are not able to win. But it’s important that we compete against any team.\nSo is the hard part maintaining that level of performance that you produced on Tuesday night, trying to get some consistency given that it is a young group?\nYes, but I think we are in the right direction.\nArsenal are really strong from set-pieces. How do you counter that?\nWe try to defend in the best way we can. I think Arsenal is not just against one team or two teams. Arsenal, they score goals in set-pieces against any team. The last game against Bayern Munich, they scored the first one from corner. It’s not just that they score goals against. They score goals against any team. They have a system in place that works very well and we’re going to try to do our best to defend in the best way.\nHow different a challenge is it for you to go from trying to prepare against Barcelona now against Arsenal?\nIt’s a different challenge, as you said. We planned the game against Barcelona in one way. We need to plan a game against Arsenal in a different way and then we’ll see at the end of the game.\nA lift for the players having Palmer back?\nYes, everyone is happy. The team-mates are happy. We are all happy and the most important thing is that Cole is happy because at the end, a football player, they want to play games and make sessions every day.\nHow worrying for defences to see Palmer and Estevao linking up?\nNo, they can play together. It depends on which team, it depends a little bit on the game plan, but for sure they are excited. The fans are excited to watch both together. We are also excited, thinking that at the end we need always a balance between the two phases.\nSpeaking of mentality, your team seems to be improving also in that aspect. How are you working on that? How are you working on building that winning mentality you often talk about?\nFor me personally, I already said a few times that the only way to build a winning mentality is to win games, no matter the competition. I think we are in the right direction. We have also players inside the changing room that behave like a leader. They are growing also in this aspect and it’s very important, especially when you have a group like our squad.\nWhat kind of contribution do you expect from Palmer?\nA lot, a lot. He is, as you said, probably our best player. We are happy that he is back. Now we need to give him time to be 100% fit. He has done fantastic in the past and no doubt he is going to do very well for this club in the future.",
  "word_count": 1469,
  "scraped_at": "2026-02-14T02:27:05.519394",
  "_text_extracted": true
}