{
  "article_id": "9c2e7029d8cf",
  "url": "https://www.teamtalk.com/news/transfer-gossip-liverpool-firm-move-70m-prem-star-who-is-ready-to-move-man-utd-dortmund-keeper-signing",
  "title": "Transfer Gossip : Liverpool make firm move to sign £70m Prem star who is ready to move ; Man Utd target Bundesliga keeper ; Chelsea near £17 . 7m deal for Ecuador talent",
  "date": "20230302T130000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Transfer Gossip: Liverpool make firm move to sign £70m Prem star who is ready to move; Man Utd target Bundesliga keeper; Chelsea near £17.7m deal for Ecuador talent\nLiverpool are ready to sign a Premier League midfielder in a £70m deal, Manchester United fancy a £25m-rated Borussia Dortmund goalkeeper, while Thursday’s Transfer Gossip claims Chelsea are closing on an exciting Ecuadorian teenager.\nALEXIS MAC ALLISTER READY FOR MOVE TO LIVERPOOL\nLiverpool are ready to raid Brighton this summer by making a firm move for Alexi Mac Allister – with reports claiming the star is ready and willing to make the switch to Merseyside.\nJurgen Klopp is desperate to bolster his midfield options this summer after seeing Liverpool struggle in that department. And while they are firmly back in the mix for Champions League qualification, Klopp knows he needs to seriously strengthen his squad this summer.\nMidfield will be the major area of Klopp’s concern. And with Naby Keita and Alex Oxlade-Chamberlain poised to leave as free agents, Liverpool need to spend big there when the window opens for business.\nTop of their wanted list is Jude Bellingham, but Borussia Dortmund’s demands – now set to total £132m (€150m) – look too great for Liverpool. As such, the Reds are beginning to look at alternative options.\nInter Milan star Nicolo Barella is one such alternative. Indeed, Klopp is very keen on a deal for the Italy star, though early attempts to sanction a swap have seemingly fallen short.\nAnother target though who is firmly entering their thinking is Brighton star Mac Allister. The World Cup winner is a man in high demand following his performances in helping Argentina to glory at Qatar 2022.\nLiverpool make their move for Brighton star\nNow Football Insider reports that Liverpool are ready to make a move for the Seagulls star.\nHe will likely cost a fee in the region of £70m. And it’s reported that Mac Allister is ready to push for the move, with the midfielder described as ‘ready to go’ to a bigger club.\nBrighton paid £7m for Mac Allister back in 2019 and are now seemingly ready to cash in for a vast profit.\nBut they will not stand in his way if they receive £70m for the star.\nMac Allister is under contract at Brighton until summer 2025 and has seven goals across 22 appearances in all competitions this season.\nCHELSEA CLOSING ON £17.7M DEAL FOR KENDRY PAEZ\nChelsea’s incredible spending under Todd Boehly is not about to cease, with the Blues nearing a £17.7m for Kendry Paez.\nThe 15-year-old is rated as the brightest prospect in Ecuador having shone at youth level for Independiente del Valle.\nHis performances have alerted a string of top clubs, ranging from Manchester United, Bayer Levekusen and Real Madrid.\nAnd despite his tender years, Chelsea appear in the driving seat to pull off a costly transfer deal.\nIndeed, according to TyC Sports, the Blues are ready to land Paez in a deal worth around £17.7m (€20m).\nThat is now slotted to go through this summer. However, the player will stay in Ecuador until he is 18 due to UK work permit laws.\nNonetheless, Chelsea want a deal done now and secure the player’s signature before his value soars.\nTo underline his enormous potential, Paez looks set to break an all-time record in the coming weeks. That’s because he is set to become the Copa Libertadores’s youngest-ever player when turning out for Independiente del Valle later this month.\nTheir sporting director, Santiago Morales, spoke about interest in the teenager earlier this week.\n“There is interest from several teams, we cannot deny it,” Morales told Machdeportes.\n“Perhaps the difference is that the clubs are finding out with their football associations how to sign a contract today. So, when he turns 18, he can be registered with them.\n“We are waiting for that to see how that document would be put together. Then we can proceed to sign a contract. But for now the monitoring and interest of important teams in Europe is maintained.”\nREAD MORE: Chelsea push goalkeeper towards exit door with long overdue move to Serie A giants in pipeline\nMAN UTD CHASING DORTMUND KEEPER GREGOR KOBEL\nManchester United are chasing a deal to sign Borussia Dortmund keeper Gregor Kobel.\nThe Red Devils are in the market for stronger competition for David De Gea this summer as they look to strengthen their squad.\nManager Erik ten Hag has seemingly ruled out a costly summer signing between the sticks. De Gea looks set to be rewarded with a new deal – albeit one with a pay decrease. However, United want to bring in a new No 2 to challenge him.\nThe likes of Sevilla’s Yassine Bounou is an option to fill that void.\nHowever, Swiss daily Blick claims Manchester United are now pursuing a deal to sign Kobel.\nThe 25-year-old has been capped four times by Switzerland and is seen as the long-term successor to Yann Sommer.\nNow established as Dortmund’s No 1, Ten Hag is reportedly looking to lure Kobel to Old Trafford.\nThey face competition from both Chelsea and Bayern Munich, who are both also reportedly keen.\nKobel is contracted until 2026 and is rated in the £25m – £30m bracket.",
  "word_count": 876,
  "scraped_at": "2026-02-14T01:55:49.879807",
  "_text_extracted": true
}