{
  "article_id": "9c4a279b3bff",
  "url": "https://metro.co.uk/2024/01/30/arsenal-job-a-bigger-draw-managing-barcelona-says-paul-merson-20193408/",
  "title": "Arsenal job is a  bigger draw  than managing Barcelona , says Paul Merson | Football",
  "date": "20240130T114500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Merson says the ‘game has changed’ and Arsenal are now a ‘bigger draw’ for Mikel Arteta than Barcelona.\nAt the weekend, a report from Spanish outlet Sport claimed Arteta had told his close circle that he was considering leaving the Gunners at the end of the season, four-and-a-half years after taking over the reins from Unai Emery.\nIt came as Xavi announced his impending departure from Barca and Arteta has been mooted as a potential successor at the Camp Nou, with the Spaniard’s name thought to be high up on the club’s shortlist of managerial targets.\nHowever, Arsenal moved quickly to pour cold water on the speculation emanating from Catalonia, insisting Arteta was committed to the cause in north London as they fight for honours in the Premier League and Champions League this term.\nAt his press conference on Monday, Arteta echoed the sentiment and said he had been ‘upset’ by the ‘fake news’ that had spread surrounding his future.\nAsked whether there was any truth to the rumours, he told the media: ‘No, that’s totally fake news. What I read yesterday I don’t know where it’s coming from. I’m really upset about it.\n‘I could not believe it. I don’t know where it’s coming from. I think we have to be very careful when you talk about personal things especially.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I’m in the right place.’\nIn his column for Sky Sports, Merson said he understood Arteta’s anger towards the speculation and told the 41-year-old to resist Barca’s advances as they are no longer a ‘big threat’ in European football.\n‘Mikel has said he is not happy with it and has denied it. You have to go with his word,’ the ex-Arsenal and England midfielder said.\n‘The game has changed now, Arsenal is a bigger draw than Barcelona in my opinion.\n‘Five, 10, 15 years ago, you ask any footballer or manager in the world and they all wanted to play for or manage Real Madrid or Barcelona. That was the pinnacle of your football career.\n‘But I do not think that is now the case with Barcelona anymore, they are an also-ran.\n‘They are not a big threat in Europe anymore and are well of the pace in the title race, while they got smashed again the other night [against Villarreal].\n‘Five, six, seven years ago I may have said, “I do not see anything but Arteta leaving”, although I could be wrong, but I do not see how they are a bigger draw than Arsenal today.\n‘I do not see how they are a step forward, then there are their finances and you would rather work with Arsenal’s squad of players than Barcelona’s right now.’\nAccording to Merson, Arteta’s men must secure maximum points from their next two games against Nottingham Forest and Liverpool to keep their title hopes intact.\n‘Arsenal have to win their next two games, it is as simple as that. If they do not get anything but six points out of these next two games, then that will be that,’ he added.\n‘They had to win in their last league game and they won it very well. So credit where it’s due, although I think it was a bit of a Polyfilla result, it covered over the cracks.\nMore Trending\n‘Arsenal have not gone and got a centre-forward and I think that could be the thing that comes and bites them at the end.\n‘That day against Palace, they put away their chances, but you have to remember they went 2-0 up through a centre-half and then two goals from a substitute.\n‘So you have to have a look at the all-round picture there and these are two big games – win both of these and they are massively in the title race, but do not win them and I think they are only fighting for the top four.’\nMORE: ‘I know how it has happened’ – Rafael Benitez understands why Jurgen Klopp is leaving Liverpool\nMORE: The pressure’s on as Arsenal and Aston Villa step up Premier League title bids\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 753,
  "scraped_at": "2026-02-14T02:25:18.572551",
  "_text_extracted": true
}