{
  "article_id": "9c59c5fee870",
  "url": "https://www.teamtalk.com/newcastle-united/dan-ashworth-ranking-every-permanent-signing-next-man-utd-director-made-magpies",
  "title": "Dan Ashworth : Ranking every permanent signing next Man Utd director made for Newcastle",
  "date": "20240214T151500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nDan Ashworth: Ranking every permanent signing next Man Utd director made for Newcastle\nThere’s a new era at Manchester United, with sir Jim Ratcliffe looking to make waves after securing a 25 per cent stake in the Premier League giants.\nOne of his first moves is to appoint a new sporting director, and he’s had his sights set on Newcastle’s Dan Ashworth since before his takeover was confirmed.\nNow, it looks as if United are going to succeed in depriving the Magpies of their transfer chief. Indeed, it’s reported they are ‘braced for departure’ with Ashworth ‘thought to be open’ to making the switch to Old Trafford.\nHe could already be kicking off his tenure at United with a role in the transfer of Denzel Dumfries, with a report suggesting the Inter Milan defender could be Manchester bound.\nAshworth would be picking up where he left off at Newcastle, a club who have added some quality talents under his watch.\nHere, TEAMtalk ranks each of the signings Ashworth has overseen in his time at St James’ Park.\n12. Loris Karius\nThe best thing to reflect on regarding Karius’ Newcastle career is that he cost nothing. Ironically, had he never played a game, he’d have been a better asset than he was after doing so.\nIndeed, the mistake-ridden goalkeeper played just once for the Magpies, in their most important game for years – last season’s League Cup final, where they lost to Manchester United.\nKarius was drafted in for is debut due to an injury to Nick Pope and the unavailability of his understudy Martin Dubravka, who had already played for Newcastle’s opponents in the competition.\nKarius conceded twice in the 2-0 loss, and could have saved the second goal – a looping effort from Marcus Rashford that the goalkeeper flapped at and, despite getting hands on, beat him into the net. He’s not been trusted with a minute since.\n11. Garang Kuol\nKuol is a player with enormous upside potential, being plucked out of Australia as a player likely unknown to a lot of big European clubs. If he does develop into a star, his signing will have been a masterstroke from Ashworth.\nIt’s far too early to say if the 19-year-old will come good, but he’s scored and assisted during his loan with FC Volendam this term, while also having scored an international goal for Australia.\nCapable of playing anywhere across the front line, if he can break into the side and have an impact for Newcastle, £300,000 will have been an absolute steal.\n10. Yankuba Minteh\nMinteh is another of Newcastle’s recent signings never to have pulled on the shirt. Indeed, after signing this summer from Odense, he was immediately loaned out to Feyenoord.\nThere, he has scored three Eredivisie goals and provided three assists, with his club second in the table.\nThe winger has also scored once in four appearances for The Gambia – netting on debut – before playing three games at the African Cup of Nations.\nA player with clear promise that’s developing away from Newcastle, he could repay the £6million fee paid for him almost immediately if he keeps up form if and when he’s given a shot at St James’ Park.\n9. Harrison Ashby\nPlucked from West Ham for just £3million, Ashby could conceivably become a useful asset for Newcastle in years to come, and they’d have deprived a rival side of his talent if that happens.\nThe 22-year-old had a decent impact out on loan for Championship side Swansea at the start of the season, with a goal and an assist in his first four games.\nWhile he’s yet to play for Newcastle, there’s clearly promise, and the fee they paid was a minuscule one in the grand scheme of things.\n8. Sandro Tonali\nA 23-year-old Serie A winner – who directly contributed to eight goals that season for AC Milan – who signed for £60million should have become a marquee player that was able to elevate Newcastle further from their fourth-placed finish last season and help them make tracks in the Champions League.\nHowever, while surely not the fault of Ashworth, as it was seemingly unknown before Tonali joined the club, the midfielder had been engaging in illegal betting activity, and was banned for 10 months after playing just 12 Newcastle games.\nThere is still a lot of time for him to come good and have the impact the club were hoping for, but as of right now, they have essentially burned £60million for a season – money that could have been invested elsewhere.\nThe only reason he is not lower on the list is that he has actually played for Newcastle, and at least scored once before he was forced to sit out.\n7. Matt Targett\nWhile no longer a massive asset for the Magpies, having played just 77 Premier League minutes this season before a hamstring injury sidelined him, Targett has been a useful understudy since he joined.\nIndeed, he was plucked from Aston Villa for just £15million after half a season on loan at St James’ Park, and played 17 Premier League games as Newcastle finished fourth in his first term as their player, starting six of those games.\nOnly four of the fixtures he was involved in ended in losses, so he was a worthwhile asset to feature from the bench, and the Magpies did not have to pay an awful lot to get him.\nDON’T MISS: Rio Ferdinand claims Man Utd star faces ‘big decision’ on future as Newcastle, West Ham linger\n6. Harvey Barnes\nAshworth has plucked players from different levels during his time as Newcastle’s sporting director, and Barnes was one of two talents that would have been playing in the Championship this season had the Magpies not come in for him.\nHe had a fantastic last couple of seasons with Leicester, directly contributing to 16 Premier League goals two seasons prior to his move, and had a hand in 14 goals in the season the Foxes were relegated.\nAs such, a £39million move was probably a fair reflection of his talent, and he’s shown that at times this season, despite having spent the majority of it sidelined with injury.\nBarnes has scored twice and assisted once in eight Premier League games – a goal and an assist came on his debut, giving Magpies fans a taste of what was to come, and a goal in a 27-minute cameo on return from injury showed there was no rust.\nAt 26, he should be entering his prime years soon, and if the last few seasons are anything to go by, Newcastle will have got themselves a fantastic asset, who could easily rise up this list once fully fit.\n5. Tino Livramento\nLivramento was the other of two relegated players that Newcastle picked up as part of Ashworth’s savvy thinking in the last summer window. A Chelsea academy product who had starred in one season with Southampton, he was seen as a top asset for the future.\nIt seems that will be important, with the 21-year-old right-back shadowing 33-year-old captain Kieran Trippier, with a view to taking his place once he can no longer cut it.\nBut Livramento is not only a player there to learn from Trippier, but to have his own impact for Newcastle. He’s played 25 games in all competitions this season, split between right and left-back, and has torn down the flank and caused problems in many of those.\nHe played the full 90 minutes in the 3-0 pasting of Manchester United in the League Cup in November, assisting a goal and generally proving a nuisance going forwards.\nHis qualities have already served the Magpies well, and he’s only going to get better over the years.\n4. Anthony Gordon\nA slow starter at St James’ Park, Gordon had Everton fans counting themselves lucky that their side had made £45million from a forward who had scored seven goals in 78 games with them, before failing to net more than once on his debut Newcastle season.\nBut if there were any doubts, they are now a distant memory, with Gordon ripping up the Premier League in his second season in the North East.\nThe 22-year-old has seven goals and seven assists in all competitions this season, with only Alexander Isak matching his tally of direct goal contributions.\nGordon’s youth means he’s very much one for the future as well as the here and now, and given he’s already repaying the £45million spent on him in goals and assists, Newcastle will have got their full money’s worth soon enough.\n3. Nick Pope\nPope had proven himself to be a top goalkeeper during his time with Burnley, a side regularly under the cosh and in need of saving from peril on multiple occasions. He showed his quality best in the 2019/20 campaign, when he kept 15 clean sheets, helping the Clarets to 10th in the league.\nAs such, when Newcastle were on the hunt for a top goalkeeper to ensure they bounced back from a season in which they shipped 62 Premier League goals, Pope was top of the list, and after they signed him, bounce back they did.\nMissing just one league game all season, he kept 14 clean sheets, including six in a row during a run in which the Magpies faced Chelsea and Arsenal. The goalkeeper massively aided his side’s fourth-placed finish and proved a steal at just £10million.\nHis importance has been all the more clear when he’s been out of the side. Pope has been missing since December, and Newcastle have conceded more goals (25) in the 10 games he’s been missing for than the 14 they shipped in the first 14 games with him in the side.\n2. Sven Botman\nNewcastle conceded 62 goals in the Premier League despite finishing 11th in the season prior to signing Botman. Only five teams conceded more, and one of the relegated sides did not even have as leaky a defence as the Magpies.\nAs such, defensive stability was key the following term, and the signing of Botman went a long way to ensuring that was possible.\nThe Dutchman missed just two games in the league, and was a pillar of a much tighter defence that saw the goals they conceded almost half, to 33, as they secured Champions League football for the first time in 20 years.\nWhile having been injured for much of this season, Botman has scored twice and assisted twice – Newcastle won all but one of the games in which he had a hand in a goal.\n1. Alexander Isak\nIt was expected that a £63million signing would be a useful asset, especially having played two seasons of Europa League football prior to joining Newcastle, and Isak has lived up to that price tag.\nIn his first campaign, the Swede bagged 10 goals in the Premier League as the Magpies finished fourth, securing Champions League football, despite the fact he missed half of the season.\nThis term, the star striker is once again finding the net consistently – he’s already reached 10 goals after playing 17 games in the league, and some of those have been against big teams such as Chelsea, Liverpool and Manchester City.\nIf he can stay fully fit, there’s no doubt Isak will smash his goals tally from last season, and Newcastle’s top-goalscorer’s form will be vital to their chances of securing European football again for the next campaign.",
  "word_count": 1920,
  "scraped_at": "2026-02-14T01:51:19.061716",
  "_text_extracted": true
}