{
  "article_id": "9c6502e93a45",
  "url": "https://www.90min.com/how-many-champions-league-finals-borussia-dortmund",
  "title": "How many Champions League finals have Borussia Dortmund been in ? ",
  "date": "20240601T001500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How many Champions League finals have Borussia Dortmund been in?\n- Borussia Dortmund play in their third Champions League final in 2024\n- Dortmund beaten in first all-German Champions League final\n- Lars Ricken scored iconic goal in 1997 final vs Juventus\nBorussia Dortmund have perpetually embraced their underdog tag, with the club's ability to thrive when unfavoured allowing them to scale great heights.\nDortmund have never been Germany's supreme force. They're the third-most successful team in German football history, but periods of success have been somewhat fleeting.\nBVB came close to achieving sustained dominance under Jurgen Klopp at the start of the 2010s, but their time at the summit of the German game was brief compared to the several domineering spells Bayern Munich enjoyed, what Borussia Monchengladbach embarked on in the 70s, Hamburg thereafter and Schalke pre-World War Two.\nTheir sporadic domestic successes has seen Dortmund compete at Europe's top table on many occasions, although regular appearances in UEFA's premier club competition is a fairly modern phenomenon. And they're very rarely there to make up the numbers.\nHere's a reminder of Dortmund's history with the Champions League final.\nBorussia Dortmund Champions League finals history\nThere was once a time when league champions and league champions only qualified for the European Cup/Champions League. Thus, Dortmund reached their maiden Champions League final on just their fifth appearance in 1996/97.\nThey'd previously gone as far as the semi-finals in 1963/64 but had to wait over 30 years for their next appearance in 1995/96.\nDortmund endured a disappointing Bundesliga title defence in 96/97, with their campaign revolving around their continental journey. They progressed alongside Atletico Madrid from Group B and benefitted from a kind quarter-final draw with Auxerre, downing the French side 4-1 on aggregate.\nA Manchester United outfit still trying to get to grips with the European stage were beaten 1-0 in both legs of their semi-final before the mighty Juventus awaited in the final. Juve, the holders and competing in the second of three consecutive Champions League finals, were the clear favourites,\nOttmar Hitzfeld had the rare luxury amid a tumultuous campaign of having a full complement of players available, although Dortmund's stars paled in comparison to the individual majesty of the Bianconeri.\nHowever, it wasn't Zinedine Zidane or Alessandro Del Piero, despite his tidy flick to get Juve back into the game, who stole the show. Dortmund's Karl-Heinz Riedle scored a first-half brace to put BVB in the ascendancy before substitute Lars Ricken, just 16 seconds after entering the fray, sealed Dortmund's victory with an iconic sequence of audacity which caught goalkeeper Angelo Peruzzi in no-man's-land.\nTheir 3-1 win in Munich meant Dortmund became the third German European champion after Bayern and Hamburg.\nFinancial woe in the wake of early 21st-century success meant they'd have to wait until a certain Jurgen Klopp arrived on the scene to regenerate a club which had faded into obscurity. Klopp's impact was immediate, with the German's heavy-metal football converting BVB into a juggernaut once more.\nThey captured back-to-back Bundesliga titles and competed in the first all-German Champions League final in 2013. Following years of Spanish domination, German pressing reigned supreme at the summit of the European game with Dortmund and Bayern battering Real Madrid and Barcelona respectively on their way to the Wembley final.\nHowever, there was no fairytale in London on this occasion as Arjen Robben's late winner broke Dortmund hearts after Ilkay Gundogan had cancelled out Mario Mandzukic's opener. 2012/13 was the start of a decade-long reign of Roten superiority in Germany, as Bayern's triumph at Wembley secured them the treble.",
  "word_count": 599,
  "scraped_at": "2026-02-14T02:10:54.442704",
  "_text_extracted": true
}