{
  "article_id": "9c7184c35a2d",
  "url": "https://thepeoplesperson.com/2023/09/22/manchester-united-rejected-the-chance-to-permanently-offload-alvaro-fernandez-to-granada-269961/",
  "title": "Manchester United rejected the chance to permanently offload Alvaro Fernandez to Granada - Man United News And Transfer News",
  "date": "20230922T230000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United, on the back of three losses on the trot, will try and return to winning ways when they take on Burnley away from home on Saturday in the Premier League.\nManager Erik ten Hag is being put under immense pressure by the British media with stories of dressing room unrest doing the rounds.\nThe team is currently decimated with injuries with the list extensive enough to prepare an entire XI including not having his first-choice full-backs.\nUnited’s LB search\nLeft-back was a major issue in the closing stages of the summer transfer window with Luke Shaw and Tyrell Malacia both ruled out of action till November.\nTen Hag was forced to play Diogo Dalot as the emergency left-back in games but Aaron Wan-Bissaka’s subsequent injury has meant the Portuguese has shifted to the right-back spot.\nUnited, after letting go of Brandon Williams on loan, were without a specialist senior left-back which prompted the club to sign Sergio Reguilon on deadline day.\nThe manager had the option of playing academy graduate Alvaro Fernandez Carreras in that position, who had come back to the team after excelling out on loan at Championship side Preston North End.\nHe was selected for United’s pre-season squad and played the opening two games but did not play for the first team in the USA which indicated he might not be ready for a jump to the first team on a consistent basis.\nWith Champions League games to come, Ten Hag knew opportunities would be scarce and thought it would be best for the youngster to gather more experience.\nUnited still believe in Alvaro Fernandez\nA lot of clubs were interested in permanent deals for the Spaniard including La Liga team Granada where he ultimately joined on loan.\nThe player admitted that his loan club tried their best to agree a loan deal with an option to buy but United flat-out refused.\n“Manchester United rejected it and no agreement was reached,” he told reporters during his official unveiling. This indicates that United still think highly of him and that eventually a first-team place is up for grabs.\nPlaying for Granada, who are currently in the relegation zone, will be a great test and will show how ready he is for top-level football with the threat of relegation hanging over the club’s head.",
  "word_count": 387,
  "scraped_at": "2026-02-14T02:00:57.125053",
  "_text_extracted": true
}