{
  "article_id": "9c7562578272",
  "url": "https://theathletic.com/4795742/2023/08/23/tyler-adams-bournemouth-premier-league-match/",
  "title": "Tyler Adams and Andoni Iraola Bournemouth are a perfect tactical match",
  "date": "20230823T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "From Leeds United to Chelsea to Bournemouth. On the face of it, Tyler Adams’ dramatic week of transfer twists and turns in English football might look to have fizzled out into a slight anti-climax.\nThe 24-year-old USMNT midfielder sealed a move worth around £23million ($29.1m) from Yorkshire down to England’s south coast on Sunday, as Andoni Iraola’s side swept in to sign him following a failed switch to the capital. As reported by The Athletic, concerns about a hamstring injury caused negotiations with Chelsea to stall.\nAdvertisement\nIn Bournemouth, however, Adams has not only found an exciting project, but one that specifically needs a player like him for it to flourish.\nWith a forward-thinking head coach at the helm, one seeking to implement a fearless, high-intensity style of play, Adams’ energy and defensive tenacity will make him an essential part of a promising, new-look side.\n“He’s a really good player,” Iraola said of the American last week, “he has performed in the Champions League, has national-team experience, but I don’t want to go too far because right now he’s not our player.”\nWell, now he is.\nAnd you can be sure that his new coach will be going into every possible detail with the player himself.\nThis is what Adams can expect at Iraola’s Bournemouth…\nFirst and foremost, Iraola will be delighted to get his hands on a high-quality ball-winner to play in the centre of midfield, particularly after the departure of Jefferson Lerma to Crystal Palace as a free agent earlier this summer. Only Philip Billing averaged over 2.0 tackles a game among Bournemouth central midfielders to play more than 900 minutes in the league last season, while up at Leeds, Adams was the third-most prolific tackler among the 20 clubs in the division, averaging 3.7.\nDrilling into some more advanced defensive metrics shows us that Adams brings quantity and quality in terms of defensive actions.\nUsing the true-tackles metric — a combination of successful tackles, failed challenges and fouls committed while attempting a tackle — we can see he was one of the more aggressive midfielders in the 2022-23 Premier League, attempting to make a tackle 8.8 times per 1,000 opposition touches. His true-tackle win rate was only bettered by four Premier League midfielders who played a minimum 900 minutes, and his capabilities in the air were similarly strong.\nIt’s a gung-ho approach to defending that Adams has developed during a career under some of the sport’s most demanding coaches.\nAdvertisement\n“I always err on the side that I’m going to win every single ball,” he said in an interview with The Athletic’s John Muller in February 2022 (see below), “so I tend to be aggressive and go for it.\n“In the Red Bull DNA (Adams played for New York Red Bulls in MLS and then their German sister club RB Leipzig before going to Leeds, where he worked under Jesse Marsch, who had previously managed Red Bull Salzburg and Leipzig), counter-pressing is such an important thing. We try to win the ball as quickly as possible and aren’t afraid to make mistakes because we’re confident in our pressing as a team.”\nWords that will be music to Iraola’s ears.\nGO DEEPER\nMy game in my words. By Tyler Adams\nBefore taking charge at Bournemouth, Iraola led Madrid club Rayo Vallecano to La Liga promotion in the summer of 2021, before launching two unprecedented pushes to qualify for European football.\nDespite perennial off-field turbulence and a shoestring budget, Rayo’s fearless approach under their young coach saw them beat Barcelona three times in four meetings, while also catching Real Madrid, Villarreal and Sevilla off guard with their high-pressing football. No side in Spain’s top flight won back possession in their attacking third more often than Rayo did last season, in a system that encouraged risk-taking in advanced areas on the pitch.\nAdams will rarely be the player tearing after opposition defenders, looking to win the ball back in Bournemouth’s attacking third, nor will he be busting a lung to join in every attack. Instead, his ability to defend the width of the pitch will provide the assurance for his team-mates to push on, knowing he will work tirelessly to maintain the side’s defensive shape.\nHis role is likely to be similar to the one played for Iraola’s Rayo by Oscar Valentin, a similarly tenacious ball-winner at the heart of midfield, and the player who attempted the most true tackles in La Liga last season.\nAdvertisement\nAs we can see from the comparison chart below, the two profile remarkably similarly in regards to their defensive tenacity, while their attacking contributions are minimal.\nOne of the principal ways Iraola teams attack you is via their full-backs, so Valentin’s role was about positional discipline to cover the spaces those wide men left behind.\nHere against Real Valladolid in January, for example, Valentin sprints over to the left side of the pitch as he sees full-back Fran Garcia carry the ball forward, making sure he is in a good position to deal with any counter-attack if the ball is lost.\nAnd here he is on the right against Getafe last October, as Ivan Balliu charges forward, ready to plug the gap should Rayo’s marauding right-back lose the ball.\nWhether provided with a midfield partner or not, Valentin was always prepared to put out fires across the width of the pitch.\nHungarian left-back Milos Kerkez and English right-back Max Aarons are among Iraola’s other signings this summer, transfers that certainly suggest Adams will be expected to play a similar role for him to Valentin at Rayo: the facilitator who allows high-flying full-backs to get forward.\nKerkez profiles similarly to Garcia, a high-volume tackler who looks to get forward and cross the ball often, while Aarons is a relentless dribbler, having attempted the most take-ons of any full-back (97, 2.6 per game) in England’s top four leagues with Norwich City in 2022-23 — 42 more than any other full-back in the Championship.\nAnd, looking at Adams’ tackles and interceptions map from last season, it’s clear he is comfortable dropping in to defend wide spaces, with the majority of his ball-winning actions taking place on the flanks.\nHe looks to be the perfect midfield sweeper who can allow his team’s wide players to attack without fear of what is going to happen behind them if it goes wrong.\nOn the ball, Adams won’t need to be the principal creator, particularly with Alex Scott also joining the club.\nAdvertisement\nValentin completed an average of just 33.7 passes and created less than a chance per game for Rayo last season, with a pass completion rate of 81.9 per cent.\nAdams offers an upgrade on all of these figures, having completed 46.2 passes per game for Leeds last season with an accuracy of 82.4 per cent and moving the ball particularly well into the attacking third, so he should have no problems adapting to Iraola’s stringent possessional demands.\nWith a need for solidity rather than creativity, Adams’ role in this Bournemouth team won’t need to be as expansive as it might have been if he had signed for Chelsea, allowing the USMNT star to focus on what he does best — winning back the ball.\n(Top photos: Getty Images)",
  "word_count": 1210,
  "scraped_at": "2026-02-14T01:56:26.908003",
  "_text_extracted": true
}