{
  "article_id": "9c8442ad91f1",
  "url": "https://metro.co.uk/2025/05/29/liverpool-star-block-marcus-rashfords-dream-transfer-move-manchester-united-23279590/",
  "title": "Liverpool star could block Marcus Rashford  dream  transfer move from Man Utd",
  "date": "20250529T234500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marcus Rashford’s ‘dream’ move from Manchester United to Barcelona could be blocked by a Liverpool star, according to reports.\nRashford held a meeting with Barcelona chief Deco earlier this week to discuss a proposed move to the Nou Camp.\nThe 27-year-old does not have a future at boyhood club Manchester United while Ruben Amorim is still in charge and spent the second-half of the season on loan at Aston Villa.\nAmorim criticised Rashford’s output in training before sanctioning his move to Villa in January and has advised the club to offload him on a permanent deal this summer.\nRashford is not against extending his stay at Villa Park but views Barcelona as his ‘dream’ destination after holding talks with the La Liga giants in January.\nBarca are interested in a deal, with United asking for £40m, but have also expressed interest in Liverpool forward Luis Diaz.\nDiaz has scored 30 goals for Liverpool over the past two seasons and, according to Spanish transfer expert Gerard Romero, is a genuine option for Barcelona.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Spanish champions can neither afford or accommodate both so will choose between Rashford and Diaz as they look to bolster Hansi Flick’s options in the wide areas.\n‘We like Luis and we like Rashford,’ former Barcelona, Chelsea and Portugal midfielder Deco told the Catalan radio station last week.\n‘However, we can’t talk about players who are under contract. For me, it’s much more important to improve what we have at home.’\nDiaz joined Liverpool in a £37.5m move from Porto in 2022 and has made 148 appearances for the Reds.\nThe Colombia international featured in all but two of Liverpool’s Premier League games this season as they stormed to the title.\nRashford, meanwhile, played over 400 games for Manchester United after coming through the club’s academy and developing into a key player for the Red Devils.\nAmorim effectively banished Rashford from his first team shortly after replacing Erik ten Hag in the Old Trafford hot-seat and is ready to give incoming signing Matheus Cunha his No. 10 shirt.\nMore Trending\nRashford has shown encouraging signs at Aston Villa but suggested after the season ended that he did not expect to stay part of Unai Emery’s squad next year.\n‘Just a message of thanks to everyone here at Villa for what has (injury aside) been an incredible few months for me,’ he posted on social media.\n‘It is a really special club and I appreciated the way Villa fans embraced me with open arms from 1st minute on the pitch. Manager, team, and coaching staff have all been brilliant.\n‘I know it is a huge disappointment not to have made the Champions League place which everyone worked so hard all season for but I know this club and team will come back stronger.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Erik ten Hag targets two Manchester United stars as first Bayer Leverkusen signing\nMORE: Arsenal in talks to sign £85m star as Mikel Arteta approves deal\nMORE: Concern for Arsenal as Real Madrid given fresh hope of signing £51m star",
  "word_count": 581,
  "scraped_at": "2026-02-14T02:02:47.540265",
  "_text_extracted": true
}