{
  "article_id": "9c87170e165d",
  "url": "https://www.caughtoffside.com/2023/07/12/liverpool-transfer-column-mbappe-colwill-henderson-gravenberch/",
  "title": "Liverpool transfer column : Mbappe Colwill Henderson Gravenberch",
  "date": "20230712T214500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hello and welcome to my weekly column for CaughtOffside – click here to subscribe to get this ad-free and straight to your inbox as soon as it drops, as well as other exclusive content from Fabrizio Romano, Ben Jacobs, Christian Falk and Jonathan Johnson!\nThe truth behind those Kylian Mbappe and Liverpool links\nKylian Mbappe is a name we’ve often seen linked with Liverpool in recent times, but I can say now that there’s no chance of Liverpool signing him any time soon. If you look at the money he’s going to be moving for and how much he’d be earning, it’s just not realistic.\nThe truth is that the best chance Liverpool had of signing Mbappe was when he was still a teenager at Monaco. He burst onto the scene there in spectacular style, and possibly by establishing himself so quickly it cost Liverpool because he very quickly got that big move to PSG in 2017 after a great season with Monaco in the Champions League. I think that was the moment when Liverpool had half a chance of signing him, but then again they ended up signing Mohamed Salah that same summer, so you can argue that it didn’t really cost Liverpool much because they instead signed one of their best ever players who went on to win all sorts of major trophies.\nA lot of the talk about Mbappe and Liverpool has been fan-led, really. There have been little bits and pieces in the press here and there, with the player speaking highly of the club, including calling them “a machine” in an interview a few years back, and often choosing to play as them on FIFA. I think he himself might also have admitted about a year ago that he had some talks with Liverpool, but nothing advanced, and that, again, the most realistic time for him to have moved there would’ve been when he was at Monaco.\nUnless something huge changes in terms of who owns Liverpool and what their financial power is in the future, then I think their chances of signing Mbappe are very slim. There’s maybe a vague history there, but nothing much to get too excited about.\nIt’s a hypothetical, but it would also be interesting to ask Jurgen Klopp about how he’d deal with having a superstar name like Mbappe in his dressing room. You look at the values he’s always instilled at Liverpool and Borussia Dortmund, it’s all about the team, the collective, and humility. Mbappe is one of, if not the best footballer in the world at the moment, so it would be a huge question. Of course, there are certain players, such as Cristiano Ronaldo, Lionel Messi, and I’m sure Mbappe and Erling Haaland as well, that you make an exception for.\nIt would also be interesting to know if all this noise that seems to follow Mbappe is down to him or down to the environment at PSG. Would he be different at a better-run, stable, happy, cohesive club? Still, I think it would be perhaps Klopp’s biggest challenge to fit in someone with such status into a team that revolves so much about putting ego to one side and doing what’s best for the team.\nGenuine Saudi interest in Jordan Henderson but exit would surprise me\nThere’s been speculation in the last few days about Jordan Henderson’s future. My understanding is that interest from Saudi Arabia definitely exists, and I’d say this week is likely to be pretty crucial in terms of where Henderson’s future lies. I imagine Liverpool would want clarity as soon as possible. My hunch is that he stays but we’ll see.\nLiverpool may have made changes in midfield, but Henderson would also leave a void to be filled in terms of the captaincy. I’d imagine the obvious choice to take the armband would be Virgil van Dijk, who has stepped up to be vice-captain now that James Milner’s left. There’s a leadership group there, with Alisson Becker and Andrew Robertson as well, but I think Van Dijk is the leading candidate.\nStill, I’m not convinced this is going to be an issue – at the time of writing there’s been no offer made from any club, and no communication from Henderson himself that he would like to leave or that he’s considering leaving. The links are there with Steven Gerrard now manager of Al-Ettifaq, and it’s worth noting that there are also similar stories linking them with the likes of Sadio Mane, Georginio Wijnaldum, Philippe Coutinho – there’s an obvious theme there with ex-Liverpool players and people Gerrard knows well.\nI would personally be quite surprised if Henderson were to turn his back on being Liverpool captain and being part of the England squad ahead of the European Championships next summer. It would be a huge decision for one of the biggest names in English football to leave for Saudi Arabia now, and I’m not convinced he will. He’s turned up for pre-season in tip-top shape, giving the impression that he’s ready to fight for his place at Liverpool and to be part of that England squad for the Euros, and get back to winning trophies – that’s what drives him, I don’t think he’s someone who’d easily have his head turned even by the life-changing money on offer in the Saudi Pro League. I think he’s still got some miles left in the tank in the Premier League.\nLooking further ahead, if you ask people at Liverpool, I think he has that character to succeed as a coach in his post-playing career. He has an authority about him, he has high standards, and has always been known as being one of the main figures, along with the departing James Milner, to set the tone and the culture at the club. Knowing him as I do from talking him in the past, I don’t think he’s thinking about stopping playing yet, but he maybe has one eye on the future. I don’t know for certain if he’s started doing his coaching badges or made some kind of move into that yet, but I wouldn’t be at all surprised if that was a direction he ended up going down. He’s been captain of Liverpool for eight years, so it’s hard to imagine him not seeing Liverpool in his future once he’s finished playing. Of course he’s a good speaker so he’ll have offers in the media as well, but I think his future will be in coaching, whether that’s senior management, or at youth level, I think there’ll be plenty of opportunities for him there.\nLiverpool like Levi Colwill and paying big won’t be an issue\nIt’s no secret that Liverpool like Levi Colwill, as I reported back in March. Colwill is someone Liverpool really admire, and it’s hardly surprising as he was one of the best centre-backs in the league last season, he’s young, left-footed as well which is something Liverpool want, and I think he’s got a big future ahead of him.\nThe question has always been what Chelsea will do with him. There’s no question that Liverpool and Brighton want him, but it remains a big question if Chelsea are willing to allow him to leave, and at what kind of price. I think there is a possibility that Colwill will look at the situation at Chelsea and says he wants to play regularly and pushes to do so elsewhere if he thinks it’s not going to happen for him at Stamford Bridge. I think Chelsea would like him to sign a new contract, but there’s some uncertainty if he’ll do that, but equally the new manager Mauricio Pochettino could put him into the team once he’s back, and then I’m sure everyone would forget about any prospect of him leaving.\nI think if Chelsea were to give any inkling that they were willing to negotiate for Colwill, then I think Liverpool would be right in there. But let’s not forget Chelsea have just sold one of their homegrown prospects in Mason Mount to a Premier League rival, so would they be willing to approve another deal like that? It seems like a big risk on Chelsea’s part, especially when they haven’t really had a good look at him in their first-team. He’s been out on loan, but he hasn’t really had the chance to show what he can do at Chelsea, so let’s see what the player decides, because that could be something that forces Chelsea’s hand and then let’s see what Liverpool can do.\nThere’s been talk of Brighton bidding as much as £40m for Colwill, and I don’t necessarily think money would be an issue for Liverpool if it came down to it. They’re slightly unfairly billed as a club who don’t like to splash the cash, but they will do it if it’s for a player they really want. They paid the most anyone had ever paid at the time for a centre-back in Virgil van Dijk, and spent big money on Alisson not long after that, and then there was the big fee for Darwin Nunez just last summer, and then €60m for Dominik Szoboszlai just recently, so if they feel the player is the right player, they could do it.\nWith Colwill, though, it might be a case of waiting and reassessing the defensive situation in a year’s time. If you look at the Liverpool defence at the moment, they’re not currently short of options; they’ve got Ibrahima Konate who I think is going to be one of the very best around, and they might look again at Joe Gomez to see if he can stay fit, so they might be more inclined to keep an eye on Colwill for another year and then go all-out for him next summer. By then it’ll be clearer what level Virgil van Dijk is still at, Joel Matip will be at the end of his contract, so that could be the ideal time to go and splash the cash on a centre-back.\nOf course, the risk with that is if Colwill does leave Chelsea this summer, Liverpool surely have to be in the mix now because they don’t want to let him go to somewhere like Manchester City or Arsenal, then the chance is gone. Unless the fee is £100m or something absurd I don’t think it’s going to put Liverpool off, so it depends what Chelsea decide to do.\nLiverpool have most likely moved on from Ryan Gravenberch\nMy understanding is that while Ryan Gravenberch to Liverpool might be one to keep half an eye on, it’s certainly cooled. There was talk before the end of the season that he was on Liverpool’s radar and that talks had taken place, but if you look at the players they’ve signed since then in Alexis Mac Allister and Dominik Szoboszlai, I think you’d have to say it’s unlikely they get another midfield player of that type.\nI think the problem with Gravenberch was always that Bayern didn’t want to sell him. They made it clear that he certainly wouldn’t be going cheap, so if you then look at Mac Allister and Szoboszlai, both deals were made that bit easier because they both had release clauses, so Liverpool knew what they had to do and the deals were quite smooth. Liverpool prefer to avoid long-drawn-out sagas and that kind of thing, and it’s proven a successful strategy for them, with two new midfield signings now in place before the start of pre-season.\nUnless Bayern were to change their demands and perhaps negotiate Gravenberch for a reasonable price, I wouldn’t expect Liverpool to be back in the market for him. From his point of view, he’s obviously made it quite clear he’s not happy with the amount of playing time he’s had, and he’s open to seeing what might happen next. But he’s also said he’s at one of the top clubs in the world, so whether that’s something he’s said so as not to upset the fans or his bosses, or because he’s had some reassurances from Bayern about getting more playing time – who knows? What I will say is that Bayern have already brought in another midfielder in Konrad Laimer, and we know they tried to sign Declan Rice. So that doesn’t bode too well for Gravenberch, it doesn’t look like they’re looking to build their team around him. So let’s see if he looks to force a move in order to play regularly and if Bayern are ready to sell.\nAs I said, the message to Liverpool earlier in the summer was ‘no’, but let’s see if that changes nearer the end of the window. In terms of Liverpool, though, I expect that they decided to turn their attention to Mac Allister and Szoboszlai instead and this saga is now over.\nKaide Gordon closing in on return after 18-month injury nightmare\nUnfortunately he’s been out for 18 months now with a pelvic problem, which is linked to his growth and has been a real tough slog for him, but he’s now closing in on a return. He’s expected to be back training properly and working on the grass again by the end of this month.\nHe’s still only 18 years of age and has already shown so much promise, and he was back with the first-team squad at the AXA this week doing the last stages of his rehab. He’s going to be eased back in, playing with the Under-21s to start with, and then I think we’ll see him getting a slow reintroduction into football after such a long time out.\nLiverpool fans can be excited by the young players coming through at the moment, such as Stefan Bajcetic and Ben Doak, but my message is that they definitely shouldn’t forget about Kaide Gordon either. Hopefully we’ll see him back on the pitch sooner rather than later and he can remind everyone why he was such a hot prospect not so long ago.",
  "word_count": 2339,
  "scraped_at": "2026-02-14T02:00:36.701768",
  "_text_extracted": true
}