{
  "article_id": "9c919ba2fa9a",
  "url": "https://www.twtd.co.uk/blogs/22060/premier-league-preview-west-ham-united",
  "title": "Premier League Preview : West Ham United by ad _ wilkin - Ipswich Town Blog",
  "date": "20250523T214500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Written by ad_wilkin on Friday, 23rd May 2025 20:42\nI don’t like West Ham. The Hammers were responsible for much of my childhood football misery between 2004 and 2006 when they knocked Town out of the play-off semi finals two seasons in a row with Bobby Zamora playing the villain of the piece.\nFast forward 19 years and the two clubs face each other at Portman Road with nothing to play for.\nThe Hammers spent big in the summer with a bit of a scattergun transfer policy and were a team that I incorrectly predicted would do well. Despite an okay start, they were unable to ever put together a string of wins.\nThe only time they’ve won back-to-back games this was against Arsenal and Leicester in February not long after Graham Potter’s appointment on 9th January.\nThey’d failed to win in eight games before a much-rotated Manchester United team came along and the Hammers dispatched them 2-0. They were unable to follow that up last week as they lost 2-1 to a Champions League-chasing Nottingham Forest side.\nLast Time Out (West Ham 4-1 Ipswich Town)\nThings did not start well in this one. Kalvin Phillips was loose on the ball and was dispossessed far too easily, resulting in West Ham working the ball out to Jarrod Bowen on the right-hand side. Town got back into a good shape but Bowen slid a ball right through the legs of that man Phillips again where West Ham had managed to overload the box and Michail Antonio scooped the ball in having got the right side of Dara O’Shea.\nTown responded well though. O’Shea won first contact from a Leif Davis corner and the ball dropped to Liam Delap in the area. The striker fought off Lucas Paqueta, took an excellent touch to set himself and hammered the ball towards the near post where it squeaked under Alphonse Areola’s arm and into the back of the net.\nThe Blues were in the game up until just before half-time with Jacob Greaves failing to find the target with a glorious headed opportunity from close range and Mohamed Kudus hitting the post with a header of his own.\nBut Town almost created their own downfall trying to play out from the back. Aro Muric played the ball in to Sam Morsy but the skipper was surrounded and Phillips wasn’t in the position for the lay off, which was instead intercepted by Paqueta, who calmly laid it off to Tomas Soucek and it took heroics from O’Shea to clear it off the line.\nWest Ham took the lead again when Town failed to clear a long ball, Emerson was allowed to run through the defence past Morsy and Antonio was left unmarked in another overloaded box where Town were matched four bodies to four in there. Antonio powered his header against the crossbar but Kudus was the quickest to react, nodding in the rebound from close range ahead of Leif Davis.\nThat damage was compounded not long into the second half when Ben Johnson inexplicably lobbed a ball back to Muric. The keeper's first touch was poor but he just about managed to scramble it away but only as far as Bowen on the right wing. Bowen stood Phillips up, made it look like he was going down the line before dropping his shoulder, leaving him for dead and cutting inside before calmly slotting the ball into the net.\nTown’s confidence dropped from then on and they never looked like getting back into the game. Delap forced a save from Areola with a strong header in their only chance of note before West Ham finally wrapped the game up with a move that started right at the back as they passed their way all the way through to that man Bowen once again. The England international drove into the box and played a square ball across that left the easiest of tap-ins for Paqueta.\nPlayers to watch\nArron Wan-Bissaka\nThe former Manchester United player leads the way in the league with 61 interceptions cementing his place as one of the best one-on-one defenders in the league.\nHe’s added creativity to his game under Potter with two assists in his last two games and is probably one of those who hasn’t got the recognition he’s deserved this season given West Ham’s poor league form.\nSurprisingly the 27-year-old does not yet have England honours but if he keeps up this form they may not be far off.\nJarrod Bowen\nBowen has been the West Ham talisman for a few years now. He tops their scoring charts with 12 goals so far this season and has six goal contributions in his last five games as he hits a hot streak of form.\nWith West Ham’s injury issues, he’s often had to lead the line when the regular number nines have been injured/out of form but is more effective coming of his favoured right wing. Keeping him quiet will be critical to getting anything from this game.\nTomas Soucek\nSoucek is another player who is on a hot run of form. He’s behind Bowen in the scoring charts with nine and one more here would allow him to equal his seasons best total.\nAlthough he was originally signed as a defensive midfielder, he has found his most success for the Hammers as a box crashing midfielder.\nWith West Ham’s switch to a back five and lack of recognisable strikers, he has been playing as a 10 and providing an aerial target at the top of the pitch when the wingers split wide in a fluid attacking three.\nThe Teams\nPotter could make a few changes from last weekend’s defeat, possibly in midfield where he was accused of being too defensive in recent games.\nSomeone who is likely to start though is Aaron Cresswell, who will leave the club in the summer after 11 years of service and it’s a fitting send off that he’ll play his last game back at Portman Road.\nDespite the defeat at Leicester, Ipswich created the most chances that they’ve had in a game all season so it wouldn't surprise me if McKenna goes with an unchanged side.\nPrediction\nNeither side has anything to play for but hopefully Town will play with a freedom and be able to build on the performance against Leicester but actually take their chances this time round. That’s easier said than done but if everything clicks I'm going for a 2-0 win.\nIf Leicester slip up at Bournemouth that could still mean that Town finish 18th which wouldn’t be undeserved.\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nYou need to login in order to post your comments",
  "word_count": 1122,
  "scraped_at": "2026-02-14T02:28:43.346597",
  "_text_extracted": true
}