{
  "article_id": "9c9f46636517",
  "url": "https://toffeeweb.com/season/24-25/comment/editorial/45324.html",
  "title": "With the Friedkins back in , the Moshiri years might finally be over",
  "date": "20240923T201500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Everton have been here before — a year to the week, coincidentally enough — but the Club could be in the hands of new owners by Christmas, perhaps sooner if all goes well in terms of the Premier League’s Owners and Directors Test and vetting by the Football Association and the Financial Conduct Authority.\n12 months on from the announcement of a deal between Farhad Moshiri’s Blue Heaven Holdings and 777 Partners, news broke today that The Friedkin Group (TFG) have agreed a deal with the Anglo-Iranian for his 94.1% stake in Everton, signalling, perhaps, the end of a tumultuous eight-year reign that has witnessed the dizzying contrast between a gleaming new stadium rising out of the north docks on Liverpool’s iconic waterfront on the one hand and near-catastrophe on the pitch on the other.\nTFG returned to the negotiating table earlier this month having abandoned a takeover attempt in July citing concerns over the Club’s complicated debt structure and, specifically, the £200m loaned to Everton by 777 (via their chief backer, A-Cap) which had become one of the focuses of a civil case brought against both entities by London-based Leadenhall Capital Partners in a New York district court.\nThe volte-face by Dan Friedkin, TFG’s billionaire owner and CEO, first reported by Bloomberg last week, was not wholly unexpected — the 59-year-old had done a similar thing during his ultimately successful bid to buy AS Roma four years ago, stepping away from talks, only to later return to the table to complete a $700m deal.\nTFG’s ownership of the Serie A club, together with French club AS Cannes whom they acquired in June last year, should smooth the group through the regulatory approval process and with their due diligence already completed over the summer, it could see them complete their acquisition of Everton some time between mid-November to mid-December.\nDan’s son, Ryan, who is vice-president at Roma, is expected to take operational control at Everton if the takeover goes through while his father splits his time between the Italian capital and Liverpool; emblematic, perhaps, of how two big clubs of their respective leagues might vie for attention if TFG can bring success back to the Blue half of Merseyside.\nIn terms of personal image, Dan Friedkin could not be further removed from Moshiri, a chartered account by trade who is fairly quietly spoken and has been less-than inspiring as owner of Everton, the wonderful new ground at Bramley-Moore Dock notwithstanding.\nSan Diego-born Friedkin, meanwhile, is a qualified pilot who famously flew the authentic Spitfire in an aerial dogfight before landing it on the beach in Christopher Nolan’s Dunkirk.\nHe became CEO of Gulf States Toyota, the largest distributor of the Japanese cars in North America, at the age of 35 when his father, the company’s founder, stepped aside and he has since expanded his interests to golf courses and luxury resorts, movie production, and wildlife and nature conservation, particularly in East Africa.\nThat seemingly colourful persona has not extended to an outlandish public presence during his ownership of Roma, however, and he is unlikely to be a larger-than-life owner of Everton either.\nIn contrast to John Textor, who has been vocal in recent weeks about both his desire to own Everton and what his plans might be had he succeeded in first jettisoning his Eagle Football Group’s shares in Crystal Palace and then agreeing a deal with Moshiri, Friedkin has said nothing publicly about his attempted takeover of the Blues, apart from the statements issued by the Club around exclusivity, in the first instance in June, and the ending of talks between the two parties in July in the second, and now the confirmation of an agreement.\nA TFG spokesman said via evertonfc.com:\n“We are pleased to have reached an agreement to become custodians of this iconic football club. We look forward to providing stability to the club, and sharing our vision for its future, including the completion of the new Everton Stadium at Bramley-Moore Dock.\"\nTo Roma's fans, the Friedkins offered a note of reassurance:\"We remain active investors in the sports industry. We love the beautiful game. The potential addition of Everton to our portfolio does not alter our focus on AS Roma. If anything, the multi-club symbiosis will only help Roma. Each club in our portfolio operates independently and AS Roma remains at the heart of our football ambitions. Rest assured, our commitment of time, resources, and energy to Roma will not be diminished. Our goal is clear - to see AS Roma consistently compete at the highest levels of European football.\"\nThat low-key approach appears very much to be the Friedkin modus operandi. Back in June, John Solano from AS Roma Press told The Toffee Blues podcast that TFG don’t talk very much.\n“I still couldn’t tell you much [about them] beyond the surface level,” Solano said. “If you want a guy out in front of the camera, who likes to be heard, you’re not going to like the Friedkin Group.\n“If you prefer a group that may not be so accessible and you don’t have to worry about them leaking many things to the newspapers and, on top of that, backs that up with very deep financial resources, then you’re going to be thrilled.”\nIndeed, with Dan Friedkin boasting a reported personal net worth of around $6bn and the Group itself with revenues almost double that, TFG have the financial muscle and stability that Everton will need as the Club tries to rebuild following Moshiri’s near-catastrophic ownership.\nThey will benefit from the soon-to-be-completed Everton Stadium, a big chunk of which was paid for by the £158m MSP Sports loan TFG covered in June and an additional £42m they chipped in on top, but have the deep pockets to which Solano alluded to alleviate the Club’s other crippling debts and then provide operational capital and funds for transfers in the coming months.\nNot all Roma fans have been happy with the Friedkins’ ownership of the Giallorossi, though. Just this weekend, fans staged protests at the ownership for what they deemed the premature sacking of Daniele De Rossi just five games into the 2024-25 season and less than nine months after he had been appointed, and CEO Lina Souloukou resigned just hours before Roma’s win over Udinese on Sunday.\nEarlier this year, Roma fan Alessandro Marinella described Dan and Ryan Friedkin as “sharks … who have been killing Roma for four years,” and accused them of allowing the club’s best players, like Romelu Lukaku and Paolo Dybala to leave.\n“Dan and Ryan Friedkin are two sleazy speculators who took Roma for two cents. They exploited the debt that the old management had, since without debt they would have had to pay it out of their own pockets. They only paid out of their own pocket the part given to James Pallotta (i.e. €190m that the old owner had put in from his pocket); the [remaining], €400m they financed euros through debt with JP Morgan.\n\"They didn't pay the debts, but they shouldered them. It's very different. [They paid] the debt with Roma's own money — or rather with the money that Roma produces: transfers, capital gains, earnings, UEFA prize money, stadium, box office, gate receipts, sponsors, TV rights, merchandising, etc.”\nMarinella feared that his team was destined for a battle to avoid relegation to Serie B this season and TFG’s under-the-radar approach has been cited as a problem by some pundits in Italy who criticised them for a lack of communication and hands-on direction.\nESPN contributor, Gabriele Marcotti, tweeted that TFG will invest their own money — a lot — but in addition to making \"some really poor choices, [communication] is awful and there is a constant turnover in personnel at the club.\"\nThat echoes former West Ham favourite, Paolo di Canio who recently said: “They need a link between the owners and the team, somebody who understands why things work well and why they don’t.\n“What’s impressive is that they’re spending a lot of money — nearly 1 billion over these years — [but] the Americans are like this. They manage a business, staying in the office without the crowd outside. It’s a different world, and they are proving to be struggling.\n“They thought they had solved everything with Mourinho; they won a cup and became heroes. They picked up Lukaku with a private jet. Those are great things, but then there is daily work. When things don’t go well, you need directors.”\nTFG have had relative success in their attempts to restore a previously struggling Italian giant to their former glory, though. Over the past year or so, Roma recorded a €117m increase to the bottom line over the previous year.\nUnder Mourinho, with whom they replaced Paolo Fonseca, they became the first winners of the Europa Conference League and last season they qualified again for the Europa League after finishing sixth in Serie A.\nLuca d’Allessandro, deputy director of the AS Roma website Voice of the Red and Yellow is more complimentary than Marinella.\n“Dan and Ryan are well viewed by the supporters, especially after the Uefa Conference League win,” he says. \"They renovated the training ground, invested in the AS Roma Women’s stadium, brought in new sponsorships and started a new stadium project. Overall, they have improved the financial situation of the club.”\nHowever, as Chiesa Di Totti of the AS Roma blog on SB Nation explained to sister site Royal Blue Mersey in June, the Lupi's lack of involvement in the Champions League and the associated revenue has prevented the Friedkins from taking the club to the next level.\n“The problem has been, quite simply, they haven’t been able to follow up [the Conference League triumph], piling up little more than a string of sixth-place finishes the past few years. They’ve spent next to nothing on actual transfers, relying on loans and free-agent signings, highlighted by Paulo Dybala, who has been excellent for Roma. But the inability to spend money on the transfer market has hampered Roma’s ambitions.\n“I’m sure they have an overall strategic vision for the club, but without that added revenue, it’s been impossible to implement. Despite that, TFG has brought a much-needed sense of calm to the club. Roma fans are an emotional lot, so it’s nice to have an even keel in the owner’s box.”\nWhere Farhad Moshiri has struggled since the tap from USM was turned off following Russia’s invasion of Ukraine to justify his early promise that money would never be an object under his stewardship, The Friedkin Group should, at the very least, offer stable financial backing and direction as Everton try to find their feet again after three hectic and emotionally-draining years.\nThe Blues have essentially been treading water for the past year, as the farce of 777 Partners’ bid played out and Moshiri has desperately courted a host of potential suitors, trying to find a way out of a quagmire of his own making.\nWhile the terms of the deal are not yet known, TFG’s initial £200m loan, secured against Everton Stadium, will almost certainly be converted to equity and their immediate priority will be either the restructuring or repayment of a further £425m of debt owed to 777/A-CAP and Rights & Media Funding. That’s before any further funds for day-to-day operations and transfer expenditure are taken into account.\nThe Athletic report that fresh capital has already been made available for the stadium fit-out and they speculate that TFG \"is going to pay off a good chunk of [the] £200m [nominally owed to 777/A-CAP] now, with the rest being converted to payment-in-kind notes,\" a deal that should be acceptable to Leadenhall.\nMeanwhile, the boardroom urgently needs strong strategic thinking and direction; filling those positions with qualified, energetic people must be high on the Friedkins' agenda.\nOn the footballing side, an assessment will need to be made on the performance of director of football, Kevin Thelwell, and manager Sean Dyche, both of whom are out of contract next summer. Judging by Friedkin’s itchy trigger finger where De Rossi was concerned at Roma, Dyche in particular will need to produce results in the coming weeks if he is to be considered for retention by the new owners.\nFor Everton supporters, though, a successful takeover by TFG will finally offer clarity over the ownership situation and an end to the Moshiri years, even if the future is unknown. Where the Toffees will sit in a multi-club model or, at least, in the Friedkins’ divided attention remains to be seen but the Americans will know that they are acquiring a sleeping giant, a rich local cultural asset and the focus of a devoted, passionate and very large latent fanbase that is desperate for any tangible signs of progress.\nThanks to Moshiri’s mis-steps, it’s a very low bar in the short term but the road ahead is still a very long one. Patience, as ever, will be needed but the potential is massive. Evertonians everywhere will be praying the ownership can realise it.\nStay tuned for news of an updated edition of The Unofficial Everton Timeline — The Moshiri Years, to be released soon along with an audiobook version\nReader Comments (54)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 23/09/2024 at 21:05:14\nWith that, it will have to be and end of an era for many people that work at the club, those cosy positions will be replaced over time.\nSome of those areas we need to see change over the next twelve months is in public relations together with commercials and marketing/media departments. Two areas where it's been piss poor for decades.\n2 Posted 23/09/2024 at 21:16:40\nEmployees can only perform the tasks asked of them, whether they do a good or bad job is to be judged by those that employ them and how much support they are given to carry out those tasks.\nMy concerns would surround the paragraph below:\nESPN contributor, Gabriele Marcotti, tweeted that TFG will invest their own money — a lot — but in addition to making \"some really poor choices, [communication] is awful and there is a constant turnover in personnel at the club.\"\nI'm not saying that everyone currently working for Everton FC in whatever capacity, are doing a really good job, but hiring and firing for the sake of it, is a path to destruction and doesn't help to improve anything and could stunt the growth of the club in the longer term.\nWe'll see what transpires, but I don't think we need a night of the long-knives scenario, as most of the people within the club aren't directly responsible for the major financial mess we are in.\n3 Posted 23/09/2024 at 21:17:06\nBill Kenwright had his faults but I bet he couldn't believe the antics of Moshiri and Usmanov and the resultant madness of appointing Benitez. The hope has to be new owners can rescue us from the financial disaster of building a new stadium before building a decent team – while building a decent team!!\nBetter have deep pockets…\n4 Posted 23/09/2024 at 21:23:33\nGet this gift wrapped up now, please.\n5 Posted 23/09/2024 at 21:29:52\nBut next season, when we kick off in the first game at the new stadium, maybe just maybe we can forgive him?\n6 Posted 23/09/2024 at 21:35:04\nBut will it be fun?\nHard to predict…\n7 Posted 23/09/2024 at 21:40:39\nAs I just posted on the other thread, I believe that whatever TFG's imperfections, the bottom line is performance. Since Friedkin took over Roma, they have finished 7th, 6th, 6th and 6th in Serie A, won a Europa Conference title and made a Europa League final. They're back in Europe this year as well.\nEvery Everton fan on the planet would take that right now.\n8 Posted 23/09/2024 at 21:41:26\nI expect The Friedkin Group will make decisions that are cut throat which may mean those employees that are not performing are heading out the exit door.\nThis club will need to get ruthless over time in order to become a successful corporate business. Jobs for the boys will be long gone. A clean sweep will be much needed at every level.\n9 Posted 23/09/2024 at 21:50:06\nFrom a personal perspective, there is a sense of relief more than anything else, relief that finally the years of shonky ownership, years of lies, deceit, failures at every turn, could, finally be over.\nAlong with it the fear of relegation, administration and above all else, the closure of the chapter of Moshiri and Bill Kenwright.\nShould Friedkin get the required approvals, for me it will be the most apt ending to possibly the worst era of our club. The end of so many things, the start of so many more. Hope. A fabulous new home, a fitting farewell to the Old Lady, she did us proud.\nI am pleased for every Evertonian, not just the tiny sample here on TW, but those youngsters starting out in their blue kits they have got for Christmas, what a wonderful future they might have.\nLastly, a message to the other side. Your pact with the devil has ended, we are coming for you. This news will start to shift the balance of power away from the red side of the city to the blue once more. We are coming…\n10 Posted 23/09/2024 at 22:02:13\nhttps://www.longmanbrewery.com/beers/sleeping-giant/\n11 Posted 23/09/2024 at 22:02:57\nAs the news broke about this deal, the other side of the park was awash with rumours of a Saudi takeover. Okay, it was a single rumour, I didn't read the whole thing but long and short of it was that they would have to sell the Skunks first.\nIntriguingly, the Blues haven't been the only Merseyside club linked with a potential shift in ownership. Amid talks to merge LIV Golf with the PGA Tour, suggestions arose anew over Saudi Arabia investing in Liverpool Football Club.\nThere's not a story on the planet that the other lot can't make about themselves. It's just what they do.\n12 Posted 23/09/2024 at 22:28:04\nThis morning, that much battered sense of pride is slowly seeping through my limbs. I have a little smile on my face. The king is dead, long live the king.\n13 Posted 23/09/2024 at 22:44:44\n14 Posted 24/09/2024 at 01:14:04\nIf it's true that disaffection from Brighton fans brought him to tears, he wouldn't last half an hour at Goodison Park!\nIn all seriousness, though, even if Potter's brand of possession football, almost for possession's sake, was what we Blues wanted (I'm not sure it is), now would not be the time to introduce it.\nWe need effective football first and quickly to get us out of danger. We can plan for a longer-term future later and, for me, that is with someone other than Sean Dyche in charge.\n15 Posted 24/09/2024 at 08:10:13\nA bit of hope goes a long way.\n16 Posted 24/09/2024 at 08:56:50\nThe most successful teams play possession-based football. Obviously he'd have to sign players who could play that way.\nAt the moment the current squad's inability to keep the ball is killing us.\n17 Posted 24/09/2024 at 09:25:32\nXavi intrigues me… same school as Pep, same ideals and a thinker…\nBut realistically yes, I'd be okay with Potter. He did well with Brighton.\n18 Posted 24/09/2024 at 09:47:35\nWhy do you mention players?! Surely successful managers have a magic wand to transform players without the need for new signings, a sound recruitment and development system, an expert analysis team and a well-structured, stable support environment?\nPotter was a success at Brighton because he inherited all those features. He failed at Chelsea because he found himself out of his depth in an unstable, confused situation.\nOnce our club has stabilised, having put in place all the building blocks required for success including a settled squad of players recruited for a specific playing system, Potter might be a good appointment. But not until then.\n19 Posted 24/09/2024 at 10:05:50\nAs regards improving the product on the pitch, that will take longer but, with good management both on and off the pitch, we will get there.\nI assume that the new owners will want a say on the managerial situation going forward. I suspect that the current manager is under more pressure as a result of the agreement being reached.\n20 Posted 24/09/2024 at 10:08:26\nI just liked the way Potter transformed Brighton from a defensive set-up under Hughton to a more modern-day possession-based football club on a shoestring budget.\nI'd like any of the above named managers. But would they come to Everton?\n21 Posted 24/09/2024 at 10:20:34\nWould we have got new owners without this stadium — which will be the rock on which the future Everton will be built.\n22 Posted 24/09/2024 at 10:20:48\nBasically, they will be cautious spenders – and managers will be expected to deliver against the level of investment.\nMourinho was sacked because he was underperforming their investment. They've since tightened their belt dramatically but not fallen away particularly. However, they haven't kicked on either. They are more or less where they were pre-takeover (possibly a bit below that).\nOn that basis, I expect they will see Dyche as a very good fit for the time being. He has an excellent track record of over-performing the level of investment. I don't think they'll care at all about the style or quality of the football. At least in the short term. The main thing is keeping us in the top flight.\nIt is possible that they do something about the manager in summer (or sooner if we get to an emergency) but I doubt very much that Potter will be in their thinking. The idea of Xavi, Low or Tuchel is probably cloud cuckoo land. Not sure why anyone would think they would be remotely interested in managing Everton.\nI suspect (hope) they will be more focussed on getting a new right-back of quality (and maybe better cover at left-back). Hopefully that gets lined up for January.\n23 Posted 24/09/2024 at 10:41:04\nJudging by some of the football we have played in the opening games of the season, we are definitely not one of the three worst teams in the Premier League but Dyche's decision-making, substitutions, style of playe and apparent stubbornness in refusing to change things when Plan A is not working are all extremely hard to tak.\nMaybe, if the injury situation improves and he can play the team he wants, we will begin to put some wins together and pull away from the bottom of the table and pressure for his dismissal will subside.\nBut our squad is paper-thin and any further injuries could plunge us back into a relegation fight again.The problem is that the club does not have much time to make such a crucial decision; leave it too late and the situation may be beyond recovery.\nThe players also have to take responsibility. MK states that McNeil has created more chances than anyone else in the league so far this season but our strikers have missed a number of good chances that even if 2 or 3 had been taken could have resulted in wins. I recall against both Brighton and Bournemouth we could have scored 4 or 5, so it's not all the manager's fault.\nI think the picture will become clearer after the next 5 or 6 games but a decision to stick or bust must be made then.\nIf a decision is made to replace Dyche, I have absolutely no idea who it should be, although no doubt now TFG will have a finger in the pie somewhere. I don't think he will be in charge after his contract expires next season, at least I hope not. His style of football is outdated and just too turgid for me, but what do I know?\nThe bottom line is that we must remain in the Premier League this season and open next season in the new ground.\n24 Posted 24/09/2024 at 11:39:08\nMoshiri threw money at Everton but couldn't turn our fortunes around.\nI wouldn't buy Everton; I hope Freidkin is ready for what lies ahead.\nEverton have sunk to new lows in my 40 years supporting them, I've never seen it so bad.\nTurning this ship around is a titanic task, we need a new DNA, culture... everything.\nIt's going to be a long road, but at long last we have some positivity ahead, but it's a long journey, as I'm sure Dan is about to find out.\n25 Posted 24/09/2024 at 14:27:35\nI'd have put my mortgage on there being some kind of rumour about Liverpool FC around the time this news broke about Everton.\nIt's what they do, Slot's debut in the opening game against Ipswich was the 12:30 kick-off and, although he had never managed them before, he still made a little quip about the team finding it hard to get going when they get the early kick-off.\nI expect that Liverpool will be sold to someone with a lot of money in the not-too-distant future but Liverpudlians won't have enjoyed this news yesterday, and that's why you will have heard that little rumour imo.\nMy own view about football is that it reflects life itself, and my own view about life is that, if you want to make the most of it, then concentrate on yourself. Let's hope so!\n26 Posted 24/09/2024 at 14:40:07\nHowever, they have off-loaded one manager already this season after only 5 games and that does not bode well long-term in my view.\n27 Posted 24/09/2024 at 14:41:22\n“What we do in life echoes in Eternity”\nI hope St Peter is a Juventus fan.\nKAGS\n28 Posted 24/09/2024 at 14:55:31\nI'm not sure why anyone would want him. He had a worse win rate than Dyche and Benitez.\n29 Posted 24/09/2024 at 15:18:39\nYes, it's been a disaster.\nBut one thing I will always say in his defense:\nHe got us a new stadium...\nYes, it was financial suicide. Yes, the path was strewn with terrible results, stress, angst, etc. But!\nIn the end he's the reason and the driving force behind BMD. And in the end that will prove vitally important for Everton Football Club.\nSo rip the fella, but for me I'll always balance the nightmare of the past three to four years of looking into the abyss with the fact that we're going to be in a state-of-the-art, fuck-off nice stadium for the rest of my lifetime.\nAnd that is, without debate, a damn, damn good thing.\nGood luck to him. Good bye as well to be sure, but thanks for minimally seeing that rocky road through to BMD Moshri. Without him, we'd be slapping our 105th coat of paint on Goodison struggling to find revenue from gameday.\n30 Posted 24/09/2024 at 15:36:30\nIf we said we were on the verge of signing Messi, you can bet that a few hours later, they would be saying they were on the verge of signing Ronaldo!!\n31 Posted 24/09/2024 at 15:57:20\nAgreed, this is the opportunity (a debt free, sound financial footing and shiny new stadium) to re-set the narrative, both in terms of the mentality (ie, the expectations of and demand for success on the pitch) as well in terms of how Everton is perceived by the outsider.\nNo more reference to the 'The People's Club' please. An (entirely understandable) attempt at a charm offensive line trotted out by a new manager at a 2002 press conference shouldn't have defined the club thereafter.\nLet's give less consideration to being 'liked'. I'd much rather opposition fans hated Everton than the present mocking indifference.\nFirst and foremost, we're a football club whose primary aim, and obligation to its fans is to win football matches.\nSecondly, we're a business. Think like one.\n32 Posted 24/09/2024 at 20:46:57\nWith respect to Friedkin, he will want to make the club viable and sustainable. He will do.\n33 Posted 24/09/2024 at 20:59:22\nIf they are the shrewd business types, then seeing that Thelwell will know what's needed in the short term to improve us, he should know right now what he could do with a bigger budget.\nA bit like know knowing you'd like a Porche but can only afford an Astra.\nHe's earned a chance in my opinion.\n35 Posted 24/09/2024 at 21:09:02\nThere's a lot that needs fixing, and it's crucial that the move to the new stadium is a success and moves the club forwards.\nWith cautious optimism, Friedkin looks to be a significant step up in class of ownership.\nAnd if this is truly the end of the ‘Moshiri Years', then thank the lord, we have suffered enough.\nJust thinking about some of the things that have happened at our club over the last few years, it's almost unbelievable that we still exist as pretty much every major decision made was wrong.\nSurely the new stadium cannot be allowed to fail, so perhaps one day the outgoing owner may get some credit, but probably not a statue.\n36 Posted 25/09/2024 at 00:59:52\nBut it literally couldn't be worse than the last few years, although I think Thelwell has actually done a great job shifting a lot of dead wood and bringing in smart young signings.\nAt the end of the day, injury free, we are a mid-table outfit. The \"sinking ship\" brigade has been a bit OTT after decent performances. Yes, Dyche has shot himself in the foot with some dismal game management but there's a decent look about a lot of players.\nWe just need to get the full-backs sorted and we could see quite a quick upward trajectory. But without ambitious investors, it will just be wasted.\n37 Posted 25/09/2024 at 01:46:46\nChristine @ 9, you are right – all those who were looking forward to our demise, and there are many of them in my opinion, will be rattled at the news. What's our name?\nAs far as the team is concerned, we know we need a few players but the current squad has changed my view of them recently. I think they are capable of playing decent football.\nI don't think we will see a change of manager at least until the deal is approved by the FA and Premier League, but if we do change manager, Potter would definitely not be my pick. If I had a choice, I would go for the South American Marcel Gallardo.\n38 Posted 25/09/2024 at 02:20:03\nAlthough I have long got over my bitterness towards the red mob.\nIf Dych wants to keep his job, he has to change his mindset. However, I don't think he can… Either way, I hope The Friedkin Group have ideas to bring a new menu to the table. A feast of new and exciting players to put us back at the top.\n39 Posted 25/09/2024 at 02:41:00\n40 Posted 25/09/2024 at 03:49:17\nReading between the lines, I think you're about the same age as me and have a similarly bizarre reason for being obsessed with the club since childhood even though neither of us our locals. But I'm sure neither of us thought Kenwright's triumphant unveiling of a billionaire would end this way eh?\nHave to agree with you on Potter. Seems like a nice man but on the possession for possession's sake argument, I foolishly watched a replay of the 1989 Cup Final a few years ago.\nAnd here we were after Rush did what he always did and out-did McCall's best efforts, slowing making sideways 5-yard passes without (as Roberto Martinez would ironically say, considering his performances) possession without progression. Just passing for passing sake until the clock ran down and we lost.\nSo I agree, Potter with a game plan involving 900 passes to get Maupay 5 shots on goal, only one of which might be on target, is not the way to go.\nLikewise, I'm assuming rumors of Southgate are just media buzz. Presumably, FFP rules are a problem for Friediin also in which case I'd stick with the fellow in role who's shown he can polish a turd.\n41 Posted 25/09/2024 at 04:00:05\nI am not on board with the Dyche Out crew... last season would have been a welcome relief of a mid-table finish other than the deductions. A poor start to this season but we could easily be on 4, 5 or 6 points. We have been in front in 3 games and got mowed down in all of them... that is unlikely to be a long term issue.\nPotter is not the answer to any question being asked. His record at Brighton is very much overstated (De Zerbi had much more impact). Moyes is in my opinion a better, more experienced, manager than Dyche but not enough to break the golden rule of never going back.\nI would be happy to see where we are at by the November international break. I think we will be comfortably lower mid-table, playing a mix of decent and awful football, bewildered by some of the manager's tactics and subs (universal fan reaction) and excited that the new owners are in place and we can get back to enjoying the transition to the new stadium.\n42 Posted 25/09/2024 at 07:24:32\nThe Russian and his tool saw big money in the development of that part of the city. The first part of which was the new stadium.\nIt all going tits up has left us with a new stadium that gives us a future in which we can compete.\nRenewed hope and pride will be in our fans as they walk up Regent Road on match days and, the best bit, complete fucking awe on the faces of visiting fans.\n43 Posted 25/09/2024 at 08:34:53\nWhen we do eventually change manager, let's be sure to appoint one with character and great people skills as well as knowing how to bring a football team together.\n44 Posted 25/09/2024 at 09:08:39\nThe boardroom was deserted last year. The people who Kenwright brought in to run Finch Farm have all long since gone. Kenwright himself has gone. Six managers, two DoFs, I don't think getting rid of the tea lady and the fella who has worked the turnstile for 20 years will make a difference.\nThe clear-out from the glass ceiling period has, to all intents and purposes already happened. When Moshiri rides off into the sunset, the only relevant remnant of that period that I can think of, will be Seamus and we none of us want him gone... except maybe upstairs – Fuck me, I'm already starting it again lol.\nTFG may just be in the right place at the right time. Dyche and his team will probably be relieved of their firefighting duties but staff-wise , this is as close to a blank canvas as I can remember.\n45 Posted 25/09/2024 at 10:55:30\nWe make plenty of chances in games he thinks we can win, whether home or away, and when we play a side obviously better than us, we try to sit in and hit on the break.\nWe played great football against Bournemouth, good stuff in the first half against Leicester City, but we keep missing chances to sew games up, like we did last season.\nMaybe Broja will help, and we have 2 great wide attacking players now and a future England captain coming back soon at the back.\nBetter players mean better results. We will be fine and Dyche deserves the chance to see where he can take us.\n46 Posted 25/09/2024 at 12:39:14\nEverton have complex layers of management in most departments, as I found on investigation two years ago. Barrett-Baxendale created a raft of roles and titles. Even Thewell created 33 new positions, according to Barrett-Baxendale just before she left with her huge payout.\nThe wages percentage is one of the highest in the Premier League, as is Directors renumeration.\nWhen one looks at the commercial development outside the stadium development, it is non-existent and has poor end product.\n47 Posted 25/09/2024 at 14:11:04\nI recall recently reading the views of a manager who pointed out some of the differences between working at some of the elite clubs and not-so-successful clubs. One of the differences he highlighted was the quality and professionalism of some of the departments within those clubs, eg, Sports Science & fitness.\nI suspect Friedkin will (hopefully) conduct an in-depth assessment of the Club and improve the standards within the separate depts making the Club thoroughly professional throughout.\n48 Posted 25/09/2024 at 14:43:58\nYour view is the same as mine. Put a bureaucrat like Denise Barrett-Baxendale in charge and you get a bloated structure and lack of accountability.\nI worked for an American corporation for 35 years and I saw several rounds of downsizing. I felt sorry for the small number of competent people who were axed but it was good for the remaining employees in the long run as the company remained competitive.\n49 Posted 25/09/2024 at 15:34:31\nWasn't that supposed to be a nuts-and-bolts assessment?\nPersonally, I think we need a new CEO who understands football and the way it works in the UK. Not that Chong needs binning – it's just that his inexperience of that position is the first point of improvement.\nIMO we need a BMD team whose only purpose is to exploit all the opportunities the new stadium affords us. If we sort out the management of the club and the financial issues, the rest will follow.\nLike the Brighton model, we don't need a Potter – just a well-run club.\n50 Posted 25/09/2024 at 18:38:49\n51 Posted 25/09/2024 at 18:43:23\nAnyone who has worked in the Corporate world has experienced the failings of such structures and knows where the problems lie and are aware where the solutions. I agree with all of your posts.\nAs I said about 2 years ago, I decided to find evidence for my posts, having been asked by fellow posters. What I found on the football side was a sophisticated structure, probably the remnants of the School of Science.\nWhat stood out was parental-type appointments, all with qualifications. The admin side was equally sophisticated, but less substantive, with a autocratic focus and patronage dependent.\nI do believe that the remnants of the School of Science have kept Everton in the Premier League, along with a fan base brought up on it, which other clubs involved in relegation dogfights falter when up against it — the 'big club' that Everton always is.\nThe underlying problem at Everton is a culture allowed and encouraged to built up of self-preservation, which is a parasite that has grown round an effective football structure.\nI expect The Friedkin Group to bring in performance targets and accountability with an underlying focus on quality by service level agreements.\nOf course management changes will be necessary and the hard-nosed awareness and wherewithal to implement. I expect huge resistance to such changes.\nI once worked for a corporation who where a textbook example of scientific management. I then worked for one that had developed along quality management principles, but some managers were not convinced.\nAs I was leaving, the latter took over the former corporation... What amazingly ensued was a reverse takeover with the farmers culture and declining effectiveness allowed to become dominant with disastrous results. A loss of £40M in turnover.\nSo cultural change at Everton will be difficult and protracted. It is important to realise that Everton was sold because it was a declining and ineffective organisation.\n52 Posted 25/09/2024 at 21:06:41\nI'm hopeful that TFG comes to understand Everton and its fan base quickly and that there is at least some communication between the two going forward.\nStability and slow but incremental growth is what Everton has lacked since Moshiri took over and Kenwright stuck around.\nHopefully TFG brings that to the table.\n53 Posted 26/09/2024 at 20:16:19\nThat JR was a right Cnut!\n54 Posted 27/09/2024 at 14:30:00\nIf you believe that Moshiri is different than Kenwright was, then you are wearing rose tinted glasses. Kenwright had him under his thumb, right from the start somehow, and Moshiri as a result did and continued to do things the Kenwright way in many respects, so they were as bad as each other in my view.\nThe fact that Moshiri had two masters (Kenwright and Usmanov) must have been difficult for him but that doesn't excuse him for the shockingly poor way in which he ran our club.\nIn that respect, the fact that we have new owners on the horizon can't come soon enough.\n55 Posted 27/09/2024 at 14:55:51\nI think you have hit the nail on the head and described the sort of problems that will be faced by TFG. Getting over those problems won't be easy but it must be done.\nThere will be tantrums thrown and tears shed but the problems have been building ever since the School of Science era, which for us older supporters, is just yesterday, it seems. The good old days.\nI do hope that the fabulous Everton supporters realise that this process is not going to be over in a day and will be patient and understanding with those people having to do the job and not make a fuss as that will only hinder the process.\nI, and everyone else, I imagine, look forward to the day when the Everton ship is on an even keel in calmer waters.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 7021,
  "scraped_at": "2026-02-14T02:25:58.981859",
  "_text_extracted": true
}