{
  "article_id": "9ca809381be8",
  "url": "https://www.dailystar.co.uk/news/latest-news/liverpool-parade-driver-police-ambulance-35290213",
  "title": "Liverpool FC parade updates as 27 hospitalised including one child seriously injured",
  "date": "20250526T231500Z",
  "domain": "dailystar.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A car has driven into crowds of Liverpool fans at the club’s Premier League celebrations. Images and videos circulating show a black car ploughing into crowds of fans as they enjoyed their club’s victory.\nA white British man, 53, has been detained by police. Emergency services were called to an incident shortly after 6pm around Water Street and Dale Street in Liverpool. There was a large police presence with a number of ambulances.\nAmbulance have said that 27 have been taken to hospital. Four children have been hurt and another 20 people were treated at the scene.\nOne clip from X shows police officers encircling a car, while an angry mob understood to be Liverpool fans are held back. One man is restrained by an officer as he appears to try and throw a punch in the direction of the vehicle.\nAn eyewitness shared a video showing the aftermath of the crash. Police could be seen swarming the vehicle and keeping members of the crowd away.\nA caption under the video said: \"Some maniac just ran everyone over. People stuck under the car got absolutely battered. Car doors ripped off.\"\nFollow our live updates below....\nHeartbroken MP pleads with public not to speculate\nMP for Birkenhead Alison McGovern has pleaded with the public not to speculate on the \"really awful\" incident at Liverpool FC's Premier League victory parade.\nSpeaking on BBC Radio 4's Today programme, she said she was at the parade for four hours and was \"so devastated\" by the events that unfolded.\nShe said: \"The police gave out some very clear messages yesterday, not least that if people have got footage or anything that might be useful to them, then please, please give it to Merseyside Police and don’t speculate on the internet or share things like that.\n\"In Merseyside, I think the police have been through quite a lot in recent times and they’re very, very capable, and I would ask people to listen to them and to do as they’ve asked.\"\nVideo shows aftermath of Liverpool parade chaos\nThis is the view of Castle Street, a large cordon remains at the junction of Dale Street. Many people travelling to work today have been asking for directions from officers. One person asked when the cordon would be down and an officer said he “couldn’t say” @LivEchonews pic.twitter.com/VK3YTGBau2\n— Olivia Williams (@livs_wills) May 27, 2025\n'Thousands were enjoying themselves... then all hell broke loose'\nA journalist who attended the Liverpool FC Premier League victory parade has described the momen \"all hell broke loose\".\nBBC Sport reporter Dan Ogunshakin said: \"I was congregating around by the Liver building with thousands of others waiting in the rain for the parade. We were treated to a sight of the triumphant team.\n\"Thousands of people enjoying themselves. But we then noticed a car in front of the ambulance and we both thought how strange it was - the next thing we noticed was people gathering around the car. Shaking it, hitting it and people were getting quite angry. Then everything changed and the car reversed and hit into the crowd.\n\"People did scatter incredibly quickly but no real surprise because the car did accelerate very very quickly. All of a sudden it was like all hell had broken loose. People were flying in all directions. We saw a gentleman come towards us who was unconsolable - in floods of tears.\"\nLiverpool Mayor says four people 'very ill' in hospital\nMayor of the Liverpool City Region has told BBC Radio 5 Live there are four people 'very ill' in hospital.\nHe said: \"We are hoping of course that they pull through.\"\nIt was previously thought that one adult and one child were seriously injured and when Mr Rotheram was asked whether that figure had gone up, he said: \"No, not directly, but of course we're in liaison with the police and with the ambulance services.\n\"Last night they had two gold command meetings – one was really late in the evening, so this morning I'll get some updates.\"\nLiverpool parade crash victim's two words after being hit by car\nJack Trotter was among the thousands of fans who flocked to Merseyside to witness Monday's open-top bus procession after Liverpool's historic 20th Premier League win.\nOriginally from Newtownards, County Down, in Northern Ireland Trotter arrived in the city with his girlfriend Abbie Gallagher.\nTragically, he was one of the spectators hit by a car following the conclusion of the parade. Speaking to BBC News Northern Ireland from his hospital bed, he expressed his pain as \"absolute agony\".\nThe morning after...\nA large police van and a number of tents line the street near the Liver Building this morning after the shocking scenes at last night's Liverpool title parade.\nYou can see discarded Liverpool flags on the floor.\nWhat it looks like this morning\nThis is what the scene in Water Street near the Liver Building in Liverpool city centre looks like this morning\nLiverpool Mayor says day of joy \"overshadowed\"\nMayor of the Liverpool City Region Steve Rotheram has been speaking to BBC Breakfast.\nHe said that the day of celebrations and absolute joy in the city was overshadowed by what happened.\nIt put a dampener on the trophy parade for everyone, he said.\nPrime Minister Keir Starmer said he spoke with Mayor Rotheram last night about the \"terrible events\".\nLiverpool FC in \"direct contact\" with Merseyside Police\nAfter a day of celebrations on the bus, Liverpool Football Club issued a statement about the incident.\nWe are in direct contact with Merseyside Police regarding the incident on Water Street which happened towards the end of the trophy parade earlier this evening.\n— Liverpool FC (@LFC) May 26, 2025\nOur thoughts and prayers are with those who have been affected by this serious incident.\nWe will continue to offer… pic.twitter.com/xreiSqiEnL\n\"It is vital that people do not speculate or spread misinformation\"\nJenny Sims, Assistant Chief Constable at Merseyside Police, spoke at a press conference last night asking the public to not speculate on social media.\nACC Sims said: \"Extensive enquiries are ongoing to establish the circumstances leading up to the collision and it is vital that people do not speculate or spread misinformation on social media.\n\"I know that people will understandably be concerned by what has happened tonight.\n\"What I can tell you is that we believe this to be an isolated incident and we are not currently looking for anyone else in relation to it.\n\"The incident is not currently being treated as terrorism.\n\"We would ask that people refrain from sharing distressing footage from the incident online and please share any information directly with our investigation team. Information, including video footage, can be passed on via the Major Incident Police Portal (MIPP) - https://mipp.police.uk/operation/05MP24M59-PO2\nEverything we know so far\nAn estimated 800,000 people flocked to the city and celebrated LFC’s historic Premier League win under skies turned red by flare smoke. However, just four hours into the official celebrations, chaos broke out when a people carrier smashed into a crowd on Water Street near the Liver Building.\nA 53-year old man was arrested at the scene and 27 people were taken to nearby hospitals for treatment. Two people, including a child, suffered serious injuries after the car smashed into a number of people on Water Street.\nLarge police cordon remains in place\nPeople are urged to avoid the city centre as the cordon begins at the junction of Moorfields.\nLiverpool traffic update\nA number of roads in Liverpool City centre remain closed this morning.\nWater Street is still closed with a large cordon in place. Traffic site Inrix says Chapel Street and Dale Street are also closed. Tithebarn Street is closed from the junction with Moorfields to Chapel Street.\nThis follows last nights traffic chaos as people tried to leave the city.\nLeader of Liverpool City Council shared update\nLeader of Liverpool City Council, Liam Robinson, said: \"I'd like to start by saying on behalf of everyone in Liverpool how much our thoughts and prayers are with those affected by this appalling incident in the city centre.\n\"It has cast a very dark shadow over what had been a joyous day for the city and the finale to a fabulous bank holiday weekend.\n\"I would like to pay tribute to the emergency services who responded to help those who were hurt and to our NHS staff treating them in hospital.\n\"We are working closely with Merseyside Police to support their investigation, and with other relevant organisations to make sure those affected get the appropriate support.\n\"I would appeal for people please not to share the horrifying footage of the incident on social media - please if you have information forward it to Merseyside Police to help them with their investigation.\n\"We won't be commenting any further but will provide relevant updates as and when we know more and it is appropriate to.\n\"Once again, our hearts go out to all those affected.\n\"Liverpool is a city that has a proud history of coming together and supporting each other during challenging times.\n\"I've no doubt that will again be the case over the coming days and weeks.\"\nUK football united\nFootball clubs from across the country have united around Liverpool, club and city, after the car crash. Other major Premier League clubs, such as Manchester United, Manchester City and Chelsea shared their solidarity.\nChelsea FC wrote: “Everyone at Chelsea Football Club's thoughts are with Liverpool Football Club and those impacted following the horrific incident in the city today.”\nBoth Manchester clubs shared a joint statement which read: \"Our thoughts are with everyone affected by the terrible incident during Liverpool’s parade. We stand united in support of the fans, the club and the city.\"\nLeBron James reacts\nIn a post on his personal X account, LeBron sent his \"deepest thoughts and prayers to everyone\" at the parade.\nLFC has a special place in LeBron's heart as he was awarded a two per cent stake in Liverpool as part of a marketing deal with FSG in 2011. He has since traded that ownership to one per cent.\nOMG!!!! WTH. My deepest thoughts and prayers goes out to everyone affected that attended @LFC Premiere League trophy parade today! Such a senseless act! . #YNWA\n— LeBron James (@KingJames) May 26, 2025\nRundown of Liverpool car incident\nEverything we know so far about the horrific incident in Liverpool's victory parade:\n- Police responded to reports of a vehicle driving into pedestrians near the end of Liverpool FC’s victory parade in the city centre at around 6pm. The incident occurred on Water Street, where emergency services arrived quickly at the scene.\n- A total of 27 people were taken to hospital, while another 20 received treatment at the scene. Among the injured were four children; one child and one adult are reported to be seriously hurt.\n- Eyewitnesses described a dark people carrier as the vehicle involved. It came to a stop at the scene, where bystanders were seen knocking on its windows and confronting the driver.\n- A 53-year-old white British man, from Liverpool, was arrested at the scene on suspicion of being the driver.\n- While counter-terrorism officers were supporting Merseyside Police with the investigation, the incident is being treated as isolated and is not believed to be terror-related.\n- Liverpool FC were concluding a 10-mile open-top bus parade to celebrate their recent Premier League title. Tens of thousands had gathered across the city, with one local councillor estimating over a million people were in attendance.\nEyewitnesses speak out about the horror\nEyewitnesses at the scene have spoken out about their frightening ordeal, including supporters mere metres from where the car careered into the fans. Harry Rashid said: \"This people carrier just pulled up from the right and just rammed into all the people at the side of us.\n\"Then he stalled for a few seconds, probably about 10 seconds. Then the crowd that was a bit further back started rushing at him trying to smash the windows.\"\nLatest photo from Water Street, Liverpool\nThe large police cordon remains in place as officers continue their investigations.\nLFC fan speaks out from hospital\nA Liverpool FC supporter, hospitalised after being struck by a car during today's Premier League title parade, has described his condition as \"absolute agony.\"\nJack Trotter was among the thousands of fans who flocked to Merseyside to witness Monday's open-top bus procession after Liverpool's historic 20th Premier League win.\nOriginally from County Down in Northern Ireland, Trotter arrived in the city accompanied by his girlfriend, Abbie Gallagher. Tragically, he was one of the spectators hit by a car following the conclusion of the parade.\nPM says Liverpool has \"long and proud history of coming together\"\nPrime Minister Sir Keir Starmer has said he has spoken to Liverpool City Region mayor Steve Rotheram \"about the terrible events\" on Monday evening.\nSir Keir also praised the \"remarkable bravery shown by the police and other emergency services\".\n\"They are supporting and caring for those injured in these terrible events,\" the PM added.\n\"Everyone, especially children, should be able to celebrate their heroes without this horror.\n\"The city has a long and proud history of coming together through difficult times.\"\nThe prime minister said \"Liverpool stands together and the whole country stands with Liverpool\".\nLiverpool legend says he's \"absolutely sickened\"\nLiverpool legend Robbie Fowler took to X to share his distress about the news from Liverpool today.\nHe wrote: \"Heartbreaking news .. absolutely sickened with what's happened here in Liverpool.\"\nChild pulled from under car, Merseyside Fire and Rescue Service said\nFour children were injured, one seriously, when a car drove into crowds at the Liverpool FC Premier League parade in the city centre today.\nMerseyside Fire and Rescue Service said that their crews managed to lift the vehicle and remove a child from underneath. They said that upon their arrival at the Water Street location, four individuals were trapped beneath the vehicle.\nThe North West Ambulance Service reported that two individuals, including one child, sustained serious injuries.\n'Robust' traffic management plan had been in place\nAssistant Chief Constable Jenny Sims said: “In the lead-up to this event we had been working closely with event organisers and a robust traffic management plan was put in place for the parade, which included a number of road closures throughout the route and the city centre”.\nPolice: An 'isolated incident'\nAssistant Chief Constable Sims told a press conference tonight (Monday, May 26): “The car stopped at the scene and a 53-year-old white, British man from the Liverpool area was arrested.\n“We believe him to be the driver of the vehicle.\n“Extensive inquiries are ongoing to establish the circumstances leading up to the collision, and it is vital that people do not speculate or spread misinformation on social media.\n“I know that people will understandably be concerned by what has happened tonight.\n“What I can tell you is that we believe this to be an isolated incident, and we are not currently looking for anyone else in relation to it.\n“The incident is not being treated as terrorism.”\n20 people treated at the scene\nDavid Kitchin of North West Ambulance Service also noted that 27 people in total were treated at hospital.\n'Horrific incident'\nAssistant Chief Constable Jenny Sims said: “I want to thank all of the emergency services, partner agencies and members of the public who came to the assistance of the injured following this evening’s shocking incident, which we declared a major incident.\n“This had been a joyous day in Liverpool with hundreds of thousands of people lining the streets to celebrate Liverpool Football Club’s victory parade.”\n“A number of people have been injured and were taken to hospital,” she added.\n“In addition, a large number of people of all ages were treated at the scene, but did not require hospital treatment.”",
  "word_count": 2652,
  "scraped_at": "2026-02-14T02:26:38.628842",
  "_text_extracted": true
}