{
  "article_id": "9cb78c3e0b28",
  "url": "https://www.fcbarcelona.com/en/club/news/3570499/50-years-since-fc-barcelona-first-conquered-europe",
  "title": "50 years since FC Barcelona first conquered Europe",
  "date": "20230707T130000Z",
  "domain": "fcbarcelona.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "50 years since FC Barcelona first conquered Europe\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nIn 1961, the FC Barcelona football team narrowly missed on a first European title when they lost to Benfica in the final. 12 years later the club finally did it, and against the same Portuguese club. But it wasn't the football team that delivered the title. The roller hockey team was Barça's first ever European champion.\nMuch of that was thanks to president Agustí Montal and the new Palau Blaugrana, a turning point for the other sports sections at the club.\nAfter seeing off Rolls Sport of Switzerland in the semi-final, 19-8, they lined up against Benfica, who had just beaten the dominant force in Spanish roller hockey at the time, Reus Deportiu\nAfter going two goals down early on, things weren't looking too good, but Barça regrouped to win 5-3 at the Palau Blaugrana, and then drew 7-7 in the return match in the Portuguese capital.\nThat was the first of what is now an immense collection of 22 European Cups for the team.\nDomination in Europe\nIn total, the pro sports teams have won a record 46 European crowns. The men's football team has won five of what is now called the Champions League, while the women have just won their second. The basketball team has won the EuroLeague twice, the handball team has 11 European titles and the futsal team has contributed four.\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 274,
  "scraped_at": "2026-02-14T02:07:08.869472",
  "_text_extracted": true
}