{
  "article_id": "9cc1ed76403b",
  "url": "https://www.gdnonline.com:443/Details/1364110/Shabab-claim-stunning-victory",
  "title": "Football : Shabab claim stunning victory",
  "date": "20250926T230000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – DEFENDING champions Muharraq were held by a battling Malkiya while Al Khaldiya were stunned by Al Shabab last night in the 2025-26 Nasser bin Hamad Bahrain Premier Football League.\nMuharraq erased an early deficit to come away with a 1-1 stalemate against 10-man Malkiya at the National Stadium in Riffa, while Khaldiya gave up a second-half goal in a 0-1 setback against Al Shabab at Khalifa Sports City Stadium in Isa Town.\nBoth matches were part of the third week of action in the new season, with the two chief title-contenders dropping points in their respective encounters. The results ended their perfect starts so far to this campaign, but Muharraq and Khaldiya stayed first and second, respectively, on the league table.\nIn Muharraq’s draw, Malkiya struck first when Tunisian professional Mohamed bin Altaher Faleh put his team ahead in the 15th minute. Faleh fired in a stunning strike in the box off a short pass delivered by Mauritanian teammate Mohamed Salem Mohamed, who received a long pass from their own half.\nThen, in first-half stoppage time, Malkiya were reduced to 10 men after Fahad Alasmari was sent off for a dangerous challenge on Muharraq’s Waleed Al Hayyam.\nAfter the re-start, Muharraq made the most of their man-advantage and Edimar Ribeiro da Costa Junior provided the heroics in the 67th minute.\nAbdulkarim Oumar Madou Diarra sent in a cross from the right wing which da Costa Junior collected with first touch. He then drove the ball in with his second on a low effort that bounced past Malkiya goalkeeper Godwill Chia Ndang.\nNeither team could find a winner over the remainder of the contest, and Malkiya did well to stave off Muharraq’s potent attack. Ndang had a crucial save in the 10th minute of second-half injury time on a Hussain Abdulkarim effort from the face of goal.\nMuharraq were handed their first draw of the campaign as they went to seven points atop the standings, while Malkiya improved to five with their second standoff.\nMeanwhile, in Shabab’s hard-earned triumph, following a goalless first half, they took the lead four minutes after the re-start on a quick counterattack.\nHussain Ali Alqassab did well to lead their charge and he sent a short pass to Cameroonian professional Stephane Samir Binong, who fired in from close range.\nKhaldiya pressed hard to bring the game back on level terms but their efforts were in vain.\nShabab secured the full three points for the first time this season and improved to four on the table, while handing Khaldiya their maiden loss as they remained on six points.\nThe league’s third match week concludes today with another two matches at separate venues. Budaiya battle Bahrain Club at Khalifa Sports City Stadium while A’ali take on Al Ahli at the Late Shaikh Ali bin Mohammed bin Isa Al Khalifa Stadium in Arad. The two fixtures are scheduled to get underway at 7pm.\nFollowing yesterday’s action, both Muharraq and Khaldiya are back in action representing the kingdom in the 2025-26 AFC Champions League (ACL) Two.\nMuharraq will be playing Esteghlal FC of Iran in their second Group A fixture at Shahr-e-Qods Stadium in Iran, while Khaldiya will face FC Arkadag of Turkmenistan in Group B at the National Stadium.\nBoth games are to be played on Wednesday.\npatrick@gdnmedia.bh",
  "word_count": 551,
  "scraped_at": "2026-02-14T02:21:48.752039",
  "_text_extracted": true
}