{
  "article_id": "9cc70c840827",
  "url": "https://www.heraldscotland.com/news/24663249.ally-mccoist-love-affair-80s-punk-scene/",
  "title": "Ally McCoist and his love affair with the 80 punk scene",
  "date": "20241020T051500Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Listen, listen, listen, we’ll get to the football. We’ll get to Rangers and Scotland and Old Firm derbies and the game as it was and as it is. But right now, right at the beginning of our conversation this Monday morning on the last day of September, we have other priorities. Because Ally McCoist is trying to decide on his three favourite punk singles.\n“White Man at Hammersmith Palais,” he begins confidently and then starts to falter. “Oh, right I mean this is … Emergency, 999,” he almost shouts. Not a cry for help, but a shout-out to the London punk band 999 and the band’s third single\nThere is a pause. A long pause. “You know I’m going to have to phone you back. I’ll be changing these daily for the next two months.\n“Oh my God, I don’t have a Damned single. Neat, Neat, Neat, by the Damned.”\nThere you go. Now you know. Why do you need to know? Well, a couple of hours before I am scheduled to speak to him, a photograph of McCoist appears on my social media feed. A photograph of the former Rangers and Scotland striker with his arms around the shoulders of one Joe Strummer at T in the Park back in 1995.\nIt chimes with something McCoist says in his new book Dear Scotland - which is being exclusively serialised in The Herald this week; the revelation that back in the day - that day stretching over 1977 and 1978 - McCoist was big into punk and The Clash were his heroes.\n“I’m going to tell you something,” Ally McCoist tells me in that very Ally McCoist way of his when I bring that picture of him with Strummer up this morning. “I’ve only got two pictures in my wee room where I do my radio,” he says.\nRead more from Teddy Jamieson:\n- Surely BBC didn't plan for Tam Cowan to be the first to memorialise Salmond?\n- Weird and (occasionally) wonderful: Are these really Scotland's best No1 hits?\n- Dad carried me into ambulance: Belle and Sebastian singer on inspiration for novel\n- 'Gruesomely compelling' - The story behind the bomb that almost killed Mrs Thatcher\n“They’re not for general display. They’re not in the living room. One of them is with Muhammad Ali and one of them is with Joe Strummer.\n“Joe Strummer is one of the most influential rock stars - and he probably wouldn’t like to be called a rock star; that’s one of the beautiful things about Joe Strummer. But what a hero he was to thousands and thousands, myself included.”\nSuddenly the lid is out of the memory bottle and he is back in his teenage years.\n“Growing up in that period football was probably the only thing that prevented me going all out Mohican and safety pins …” McCoist suggests.\nWhile I’m trying to conjure up an image of McCoist in full-on Seditionaries gear and thinking that you couldn’t really have a kickabout in bondage trousers, McCoist has already moved on to recall the gigs he witnessed back then.\n“I remember going to see The Jam the In the City tour, Paul Weller at the Glasgow Apollo ’77. I went to see Devo who weren’t really punk, but who were new wave from Ohio. I saw The Undertones, Sham 69, Jimmy Pursey on stage. My mate got on stage at the Glasgow Apollo and sang with Jimmy Pursey. Saw them a couple of times.\n“The UK Subs, 999. That’s the stuff I grew up listening to. That’s what it was for me. I’ll never forget the energy that came with that.\n“Don’t get me wrong. I think one of the first records I ever bought might have been Steve Harley and Cockney Rebel, to be brutally honest with you.”\nI hope you’re keeping up. Because McCoist isn’t waiting around. He jumps forward to a memory of his former manager and friend Walter Smith. “I used to love talking with Walter and arguing with Walter Because Walter loved the Beatles and said music died when the Beatles split up. That’s what he used to say. He wasnae for the punk. I used to try to explain to him the energy and the anarchy and the rebellion that punk brought was just a rollercoaster to be on.\n“It was the greatest rollercoaster of all time for me. I love my music. I listen to everything now. I listen to classical stuff. I listen to Rammstein, Springsteen. But The Clash are never far away.”\nI think he’s about to stop and then off he rushes again. “The Buzzcocks … I saw the Buzzcocks, Pete Shelley. There’s another one I’ll throw at you. So, the Glasgow Apollo for us every weekend, a Friday or a Saturday night, if there was a band playing we used to get the 77, the 79 in from Cantieslaw Drive straight into Cathedral Street and then we’d go and watch the bands.”\nIn many ways this is all a perfect snapshot of a typical chat with Alistair Murdoch McCoist, now OBE. His conversation is - much like punk, come to think of it - full of energy and enthusiasm, rattling around, jumping between ideas and memories. All flash and fast cuts.\nLess anger than punk, to be fair, and more humour, and with a healthy sprinkling of local detail (I’m presuming that was an East Kilbride reference in his last answer) and rhetorical emphasis.\nApply that to his role as football co-commentator or his presenting on talkSPORT and you’ve got one of the most popular broadcasting voices in the country.\nAnd football is obviously what we know him for. Back in the day McCoist won 10 league titles with Rangers, one Scottish Cup (in 1992; he was injured and didn’t play in the 1993 victory over Aberdeen), nine Scottish League Cups and two European Golden Boots. He also played for his country 61 times, scoring 19 goals.\nRead more from Teddy Jamieson:\n- Forget the spirit of the Blitz, serial killers stalked the streets during the war\n- 'Her bravery grabbed me' - Flyer Amelia Earhart's final tragic flight inspires album\n- Music, books, films and, er, rocks: 10 Scots festivals to brighten up autumn\n- Janey Godley: 'I got to do everything I wanted to do'\nAnd football is his default lingua franca. Right at the start of our conversation he asks me where I am. Falkirk, I tell him.\n“Lovely. Mind you. I’m saying that. You got beat on Saturday. That’s your first defeat wasn’t it?”\nPossibly, I tell him, but actually Stirling Albion are my Scottish team. And Spurs, for my sins, are my first love.\n“They were impressive yesterday,” he says of the latter.\nThey were. They had just beaten Manchester United 3-0. A week later they would revert to the mean by capitulating to Brighton.\n“I must admit I love watching the Spurs. We have Spurs fans on all the time moaning about this, that and the next thing, but I think they are a good watch. There are always goals.”\nThis is very Ally, I think. He’s someone who is happy to talk about football at any opportunity. Back in the 1990s, during the Keegan era at Newcastle United when I was commuting from Durham to Glasgow every Sunday night, I recall McCoist jumping on the train at Newcastle, sitting in standard class and talking to anyone who wanted to talk to him. There were plenty, as you’d imagine.\nNearly 30 years later (eek), this Monday morning, he’s talking to journalists about his new book, which you can read serialisations for in The Herald this week. “And then I am heading down to London tonight, doing the show from the studio tomorrow. I’ve got Champions League Tuesday and Rangers Thursday, so, quite a busy week.”\nIt’s maybe worth noting that he has omitted what he will be doing on the Wednesday, two days after we speak. That’s when he picks up his OBE from Prince William at Windsor Castle for services to football and broadcasting.\nPut it down to modesty. Or maybe, given that we’re here to talk about his life in football, he reckons it is irrelevant.\nDear Scotland - which he has co-written with Leo Moynihan - is framed around this summer’s Euro 24 tournament which, let’s face it, was not a memorable one for Scotland. But, really, it’s an opportunity for McCoist to tell his favourite football stories. You’ll have heard a few of them before. Yes, the time he and Paul Gascoigne hid a couple of fish in the car of fellow Rangers player Gordon Durie gets a mention.\nBut then it’s a very Ally book, full of good humour and a passion for the game. My favourite line in it, I tell him, is his description of Celtic legend Roy Aitken, who he describes as “a fantastic player, one who loved the Old Firm games, and wouldn’t have minded if we’d decided to play them without a ball.”\nHe laughs when I remind him of it. “It’s so true. It’s so true. I saw Roy a few months back. He was in the director’s box. He’s brilliant, the big man. He came down to say hello and I had to ask him if I needed to go back to the car and get my shin pads.\n“He’s just a brilliant lad and back in the day we got on ever so well. We fought like cat and dog in the Old Firm games, with Granty [Peter Grant] and Paul McStay and big Packie [Bonner] in goals, but there was a wonderful - and still is - a wonderful respect. And when we see these boys and we catch up …\n“I’m in a WhatsApp group with [Frank] McAvennie, Simon Donnelly, Derek Whyte, and the laughs we have.”\nIt’s good to be reminded that as much as the Old Firm divides Glasgow - and it does - it can also unite.\nIt is certainly a fixture deeply wrapped into McCoist’s own story. After spells at St Johnstone and Sunderland, McCoist signed for his boyhood club Rangers in 1983. The first thing he did after signing the contract was phone his gran, a huge Rangers fan herself.\n“I remember phoning my gran from the Crest Hotel in Carlisle and it was an old two bob job into the phone to my wee granny in Carnwadric.”\nAt which point McCoist recites her number from memory, which probably tells you all you need to know about family and time and love.\n“And I never saw her face obviously, but I’ve got a picture of her face in my mind that I will take with me to my grave. I can just see that big, beaming, happy smile on my wee granny.”\nREAD MORE\nYou could argue that for him love and Rangers football club are entwined together. When he talks about his former manager and friend the late Walter Smith it is with huge affection and an inevitable touch of grief given Smith’s death in 2021. In the book, Ally, I say, you describe him as a second father to you.\n“He was, he was. Sadly missed. Really sadly missed. I’ve still got his number in my book. I cannae get rid of it and I never will.\n“I was very lucky. I worked under him as his assistant at Scotland, assistant at Rangers. Just a great friend. Absolutely great friend and a massive part in my life and a massive part in so many people’s lives. He touched so many people.\n“Everybody who met Walter will have a story about him and a good memory. He had a great ability to make people feel good.\n“But at the same time he commanded respect and you knew he certainly was no soft touch.”\nAs McCoist found out the first time they met on a Scotland trip to Monte Carlo when McCoist locked Smith out on the balcony of your hotel.\n“Oh Jesus, that’s got to go down as an error. Which thankfully I recovered from. There was a moment during it I wasn’t going to.”\nMcCoist did OK at Rangers, I think it’s fair to say. “I can’t complain. It’s funny you remember the not so good days as much as you remember the good ones.”\nBut he’s not one to dwell on the good or bad old days. Ask him where he keeps all his memorabilia and he says: “I’ve given it all away, the vast majority. I’ve obviously kept all the medals, but in terms of jerseys I’ll have a couple of really special ones to me but I think I’ve just about given about everything away to charities and things like that.”\nThe past is the past. He’s happy in the present. He’s been married twice, has five children, some of them now grown up. He’s 62 and his playing days are long behind him. That said, would he like to be playing football as it is today with its emphasis on nutrition and diet and no alcohol?\n“My answer is undoubtedly yes. I would love to be a footballer today. However I’d far rather play in the era that I did and enjoy the career that it did.\n“That’s key. Could I have played today? Without doubt. Would I rather play today than when I did? No, I wouldn’t.”\nMcCoist finished at Kilmarnock in 2001, by which time he was already making inroads to broadcasting. He spent 11 years as a regular on the BBC’s A Question of Sport, ensuring his popularity amongst Britain’s grandmothers. But in 2004 he joined Walter Smith as an assistant to the Scotland team and then in 2007 he returned to Rangers as assistant manager under Smith, before taking over the managerial reins in 2011. The timing wasn’t perfect. The club was in the midst of the financial upheaval that would ultimately cause it to go into administration in 2012 and be demoted to the fourth tier of Scottish football.\nAfter guiding the club back to the Championship McCoist stood down at the end of 2014 during a season marked by boardroom ructions, job cuts and poor performances on the pitch.\n“It was the absolute dream job at the wrong time,” McCoist admits. “Simple as. But I look back and I say, ‘Well, I’m actually quite happy it was me,’ to be honest with you. Because I knew the club, I cared about the club and we had great people around us.\n“And of course common sense would tell you it was a disaster for the club at that period, but effectively there was nothing we could do about it other than attempt to handle the situation as well as we could.”\nHe would have liked to have managed again, but he never got the opportunity. And so he is now a man with a microphone. He has replaced playing football with talking about it.\n“The way it’s worked out. I’ve probably seen more football and enjoyed more football than I would have within management.”\nHave broadcasters approached him to widen his remit, I wonder? Have you had the call to appear on Strictly, Ally? “A long time ago. They’ve given up.”\nWhat about Celebrity Big Brother?\nHe gives one of those familiar Super Ally laughs at the very prospect. “Never in a million years, never in a million years. Listen, I go mental if I’m cooped up with the kids for half an hour. Imagine sitting in that house with somebody … Oh no, forget it Teddy, forget it.”\nWith that Alistair Murdoch McCoist OBE signs off to talk to another journalist about football. It’s what he does. It’s what he has always done. Unless you ask him about The Clash.\nDear Scotland: On the Road with the Tartan Army by Ally McCoist publishes October 24 (Hodder & Stoughton, £22)\nTo purchase: https://www.hachette.co.uk/titles/ally-mccoist/dear-scotland/9781399739580/",
  "word_count": 2659,
  "scraped_at": "2026-02-14T02:11:06.626294",
  "_text_extracted": true
}