{
  "article_id": "9ccbfc8c2935",
  "url": "https://www.fourfourtwo.com/news/manchester-united-transfer-news-man-utd-manu-report-raphael-varane-successor-on-the-radar-for-summer-move-axel-disasi-monaco-erik-ten-hag-signings-rumours-gossip-paper-talk-mufc",
  "title": "Manchester United report : Raphael Varane successor on the radar for summer move",
  "date": "20230331T190000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United report: Raphael Varane successor on the radar for summer move\nManchester United are looking at the French defender tipped to take over from Raphael Varane's considerable mantle – for club and country\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester United are poised to make a move for Raphael Varane's successor in defence.\nLast month, the highly-decorated defender announced his retirement from international football, aged just 29. In 10 years of playing for the French national side, Varane won the World Cup and the Nations League, making 93 caps.\nIn an injury-plagued time at Manchester United, Varane has been essential to the defence – but now, thoughts are turning to a future without the centre-back for both club and country.\nOne late inclusion to France's World Cup squad, Axel Disasi is a target for United, according to CaughtOffside. The Monaco stopper was given a debut in Qatar and will likely feature a lot more in the coming years with Varane out of the set-up – with French football expert Jonathan Johnson suggesting that the 25-year-old could be a solid squad option for Erik ten Hag, if not an elite answer for the back four.\n“Monaco defender Axel Disasi is an interesting player who’s starting to attract links with the likes of Manchester United ahead of the summer,” Johnson said.\n“He’s in that kind of ‘finishing school’ phase that Aurelien Tchouameni was in when he was there, and that someone like Wesley Fofana is in with Chelsea right now. He’s now made the breakthrough at international level and that’s helped get him onto the radar of a number of big clubs. For someone like United, I think he would add competition to their squad, but I do have questions about whether or not he’d be the best fit for Erik ten Hag’s side and where they are now.”\n“I think Disasi will definitely be coveted by Premier League clubs in the future, but it wouldn’t surprise me if it ended up being someone a level below Manchester United, one of those clubs aspiring to get it into the Champions League reckoning.”\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nWhile not expected to reach the heights that Varane has in his career, the added cover for United would certainly be welcome. Luke Shaw has had to fill in at centre-back this season, while Harry Maguire has not been fully trusted by Ten Hag.\nDisasi is valued at €25 million by Transfermarkt.\nMore Manchester United stories\nManchester United are looking to capitalise on their resurgence in the transfer market, with big new signings. Victor Osimhen is one option for €100m, Declan Rice is on the radar and Jeremie Frimpong could arrive as a new right-back. More outlandish theories include signing Kylian Mbappe and selling Marcus Rashford to Arsenal.\nThe Glazer ownership are not guaranteed to sell up – despite bids from lifelong fan, Sir Jim Radcliffe and Sheikh Jassim Bin Hamad Al Thani. Meanwhile, Marcus Rashford has underlined the importance of positive mentality at Old Trafford.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 684,
  "scraped_at": "2026-02-14T01:59:46.868458",
  "_text_extracted": true
}