{
  "article_id": "9ccce9cdf882",
  "url": "http://thepeninsulaqatar.com/article/27/04/2024/kane-doubles-up-for-bayern-leipzig-beat-dortmund-to-tighten-grip-on-fourth",
  "title": "Kane doubles up for Bayern , Leipzig beat Dortmund to tighten grip on fourth",
  "date": "20240427T190000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nBayern Munich's English forward #09 Harry Kane scores the 2-1 goal from the penalty spot during the German first division Bundesliga football match between FC Bayern Munich and Eintracht Frankfurt in Munich, southern Germany on April 27, 2024. (Photo by ALEXANDRA BEIER / AFP)\nLeverkusen: Harry Kane scored twice as Bayern Munich beat Eintracht Frankfurt 2-1 at home, while RB Leipzig tightened their grip on fourth spot with a 4-1 home victory over Borussia Dortmund on Saturday.\nKane scored in each half, finishing off a tearing Konrad Laimer run and converting a penalty, to raise his league tally to 35 goals in 31 games.\nKane is now six goals shy of Robert Lewandowski's all-time single-season Bundesliga goals record.\nThe England captain's goals came either side of a Hugo Ekitike stunner, a day after the Frenchman became a permanent Frankfurt player.\nDespite the victory, which solidified Bayern's chances of a second-placed finish, both Laimer and defender Matthijs de Ligt subbed off with injury just days before Tuesday's home\nChampions League semi-final against Real Madrid.\nDortmund, Germany's other Champions League semi-finalist, had a setback ahead of hosting Paris Saint-Germain on Wednesday, being thoroughly outclassed at Leipzig.\nThe undermanned visitors, missing captain Emre Can, Donyell Malen, Ian Maatsen and Sebastien Haller, dominated early, hitting the lead after 20 minutes through Jadon Sancho.\nThe England winger curled an excellent shot from the edge of the box into the top right corner to give Dortmund the lead.\nJolted to life, Leipzig equalised almost immediately, Lois Openda turning in a superb Xavi Simons cross for his 24th goal of the season.\nOriginally called offside, the goal was awarded after a VAR review and the video referee intervened again shortly after, overturning a penalty for Leipzig.\nLeipzig then scored two quick-fire goals either side of half-time. Benjamin Sesko pounced on a rebound just before the break and Openda found Mohamed Simakan early in the second.\nChristoph Baumgartner added a fourth with 10 minutes remaining to send Leipzig five points clear of Dortmund in fourth, the final guaranteed Champions League spot.\nWith three teams in the semi-finals of the top two European competitions, Germany may however snare a fifth Champions League spot.\nWerder Bremen guaranteed first division football next season, winning 3-0 away at Augsburg to go 10 points clear of the drop with three games to play.\nGoals from Romano Schmid and Olivier Deman and a Marvin Ducksch penalty took Bremen to a second-straight win for the first time since February.\nWolfsburg also took a major step towards securing top-flight football, scoring two goals in the final minutes to come from behind and beat a 10-man Freiburg 2-1.\nIn Saturday's late game, Bundesliga champions Bayer Leverkusen will try and keep their unbeaten record alive this season when they host third-placed Stuttgart.\nNo team in Bundesliga history has ever gone through a season unbeaten.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 544,
  "scraped_at": "2026-02-14T01:51:24.787853",
  "_text_extracted": true
}