{
  "article_id": "9cda25dd1c15",
  "url": "https://www.bbc.com/sport/football/articles/cjek3new138o",
  "title": "Premier League predictions : Chris Sutton v The Charlatans guitarist Mark Collins and AI",
  "date": "20251024T120000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sutton's predictions v The Charlatans guitarist Mark Collins\n- Published\nBrighton have won at Old Trafford in each of the past three seasons but can Manchester United get the better of them on Saturday?\n\"People get angry whenever I don't back United to win but why should I trust them?\" said BBC Sport football expert Chris Sutton.\n\"They got a great result against Liverpool last time out, but it would be typical of them to follow that by losing this game.\"\nSutton is making predictions for all 380 Premier League games this season, against AI, BBC Sport readers and a variety of guests.\nFor week nine, he takes on The Charlatans guitarist Mark Collins, who supports Manchester United.\nThe Charlatans' 14th album, We Are Love, is out on 31 October and they tour the UK in December.\nDo you agree with their scores? You can make your own predictions below.\nThe most popular scoreline selected for each game is used in the scoreboards and tables at the bottom of this page.\nA correct result (picking a win, draw or defeat) is worth 10 points. The exact score earns 40 points.\nCollins, who has been going to Old Trafford since he was growing up in the 1970s, once gave Gary Neville some guitar tips before the former United defender joined The Charlatans on stage.\n\"I saw Gary the other week and he actually mentioned that, but I am not sure there will be a repeat performance anytime soon,\" Collins told BBC Sport.\n\"He'd asked us to play a gig on the roof of Hotel Football [Neville's hotel next to Old Trafford] when it opened in 2015.\n\"We'd heard that he used to take a guitar with him when he was with England so we said we'd do it, if you play guitar with us.\n\"I went round and gave him a couple of lessons, then we watched a few videos of the tune he was going to play - Just When You're Thinkin' Things Over - and went through a few chord shapes and a few moves for when we got him on stage.\"\nSo, was Gary any good on guitar? Could the Neville brothers rival those other famous Manchester siblings, the Gallaghers?\n\"He had a couple of chords he could play... but let's just say I covered for him!\" was Collins' verdict.\nChris Sutton and Mark Collins were speaking to BBC Sport's Chris Bevan.\nThe AI predictions were generated using Microsoft Copilot Chat - we simply asked the tool to 'predict this weekend's Premier League scores'.\nPremier League predictions\nFriday, 24 October\nElland Road, 20:00 BST\nWe know why Nuno Espirito Santo was brought in - to keep West Ham up - but it looks like it is going to be difficult for him.\nHe is still waiting for his first win after three games as Hammers manager, and his side were quite lucky to only lose 2-0 against Brentford on Monday.\nWhenever I watch a team play as poorly as West Ham did then, I wonder how they will ever win a game.\nLeeds are not on a great run either, but I still feel like they've been competitive when I've seen them.\nMost people would probably go for a draw here - that's what I'm expecting from the readers anyway - but I actually think Leeds might edge this one.\nI have a feeling West Ham will score, because Jarrod Bowen is always dangerous, but I don't fancy them to keep a clean sheet even though sorting out their defence is probably Nuno's priority.\nSutton's prediction: 2-1\nMark's prediction: Neither of these teams are having a great time of it at the moment. They are both badly in need of a win, so this will probably be a draw. 1-1\nAI's prediction: 2-1\nSaturday, 25 October\nStamford Bridge, 15:00 BST\nThis fixture does not hold too many good memories for me, because my Chelsea debut was against the Black Cats in 1999.\nThey are terrible memories, actually, because I missed a couple of one-on-ones but at least it was a good team performance and I still got a win bonus... although thinking about it, they should have taken that off me.\nI am going for another Chelsea win this time too, even though Joao Pedro is in my Fantasy team and he is not scoring.\nThey made lots of changes against Ajax on Wednesday but still won so emphatically.\nEnzo Maresca's side were not as convincing when they beat Forest last weekend and the 3-0 scoreline flattered them a bit, but after a bit of a wobble in September, they have now won four in a row in all competitions.\nSunderland are extremely well organised but I'd still fancy Chelsea to find a way through - which is probably bad news for Blues supporters.\nI don't want to sound too negative about how my predictions are going, but I got Sunderland wrong every week even when I was doing well, and at the moment I am doing badly.\nI am going to write the Black Cats off again now though because I think we are already at the stage where their fans want me to. They know it means there is a good chance of them winning.\nSutton's prediction: 2-0\nMark's prediction: When we played Sunderland they did ok, but Chelsea will have too much for them. 2-0\nAI's prediction: 2-1\nSt James' Park, 15:00 BST\nI nearly always back Newcastle to win at home, even after they've just played in the Champions League, and I feel pretty confident about their chances here too.\nEddie Howe's side played well against Benfica in midweek and while I think Fulham are a well-organised team who are capable of going to St James' Park and winning - like they did last season - they are not in great form at the moment.\nSutton's prediction: 3-1\nMark's prediction: There's not much between these two teams either. They both lost last weekend, so let's go for another draw. 1-1\nAI's prediction: 2-1\nOld Trafford, 17:30 BST\nUnited were lucky with their first goal against Liverpool last week because the game should have been stopped, and we've all seen the issues with the Liverpool backline this season too.\nSo, while I understand why any win for United against their rivals at Anfield is a massive result, it doesn't mean they have cracked it and turned a corner.\nThey have just managed back-to-back league wins for the first time since Ruben Amorim took charge last November, but I am not looking at them and thinking they will make it a hat-trick on Saturday.\nBrighton striker Danny Welbeck impressed me when he came on the Monday Night Club this week and I am backing his boys here.\nThe Seagulls are always bold under Fabian Hurzeler and they will be fearless at Old Trafford too. I am backing Welbeck to get one of their goals, and haunt his former club.\nIt is down to United to prove me wrong, and show everyone they do have the consistency they have been lacking, and that may well be part of Amorim's team talk.\nSutton's prediction: 1-2\nMark's favourite United players: I loved the two wingers we had in the 1970s, Gordon Hill and Steve Coppell, and I always appreciated that kind of player who is exciting to watch.\nWe've had a few of them down the years, like Ryan Giggs and Cristiano Ronaldo and I was hoping Antony would be another one - but that didn't quite work out, did it? At the moment I am enjoying watching Bryan Mbeumo play. He's not explosive like the others I've mentioned but he's fitted in really nicely.\nMark's prediction: I live in Portugal now but I am back in Cheshire for rehearsals this week and to go to this game, and United are going to put on a show for me!\nBrighton have done well every time they have come to Old Trafford recently, but I think United are going to show a bit of spirit. We are not going to take the foot off the pedal after beating Liverpool. We deserved that result, despite what Arne Slot was moaning about, and I feel like this is going to be a convincing win. 3-1\nAI's prediction: 2-1\nGtech Community Stadium, 20:00 BST\nLiverpool will probably be without Alexander Isak after he was injured against Eintracht Frankfurt on Wednesday.\nIt feels like what has happened to him is a case of you reap what you sow. Isak has been short of full fitness and especially sharpness all season anyway, and he did not help himself there by missing training with Newcastle in order to try to force his move to Anfield through.\nHe got what he wanted, but now he is trying to play catch-up instead of hitting the ground running because of the time he had off, and that is when you can pick up injuries.\nIsak is too good a player not to eventually start scoring goals but this whole situation has affected Liverpool as a team too, because his lack of fitness is one of the reasons they have not clicked in the final third yet.\nThey scored a few goals against Frankfurt on Wednesday but this is going to be much harder for them.\nBrentford were more dominant on the ball when they beat West Ham on Monday but you know how Bees boss Keith Andrews will set up his team for this game - they will sit and then counter, and they are good at it.\nLiverpool's attack will click at some point, but I don't think it will happen here, and their vulnerability to direct balls in behind their defence means I don't see them keeping a clean sheet either.\nSutton's prediction: 1-1\nMark's prediction: Brentford will score and I'd love it if they nicked a last-minute goal that got them something, but Liverpool will probably win. I hope I'm wrong but they have to, don't they, otherwise Slot is going to get 'sacked in the morning' sung at him. 1-2\nAI's prediction: 1-2\nSunday, 26 October\nVitality Stadium, 14:00 BST\nSean Dyche is a sensible appointment by Nottingham Forest but the way his predecessor Ange Postecoglou was treated by their fans makes me think he is better off out of there.\nDyche is more of a Nuno Espirito Santo figure than an Ange in terms of how he will set his side up, but Forest's aim now is to stay in the Premier League and Dyche has already shown he can keep teams up.\nThis is a tough start for him, though. Bournemouth should have beaten Crystal Palace last week but they are still third and are flying at the moment.\nThe Cherries always create chances, especially at home, and I don't feel as if Forest will be able to hold out.\nSutton's prediction: 1-0\nMark's prediction: I know there is usually a bounce when you get a new manager but I don't see that happening here. Bournemouth are a really good team and I don't think Dyche will be able to turn things around that quickly. 2-0\nAI's prediction: 2-0\nEmirates Stadium, 14:00 BST\nCrystal Palace have given Arsenal some trouble in the past but how can anyone back against Mikel Arteta's side at the moment? They are like a juggernaut, and not just because of their strength at set-pieces.\nViktor Gyokeres got a couple of goals for the Gunners in the Champions League in midweek and I can see why Arteta raves about him.\nPeople may view Gyokeres as something of a flat-track bully but he is going to score some important goals for Arsenal, and he gives them something they previously lacked up front.\nIf there is a side that can upset them at the moment, then it's Crystal Palace - I saw them absolutely tear Liverpool to shreds at Selhurst Park a few weeks ago.\nThey did not lie down against Bournemouth last week either, but going to Emirates Stadium and hurting Arsenal still feels like a big ask.\nIt doesn't help that Palace play in the Europa Conference League on Thursday, because their squad is not big enough for European football.\nArsenal's squad is, and that is something else that will make a difference here.\nIt is the Gunners' defence that impresses me the most at the moment, though.\nI am only half-joking when I say I am not going to back anyone to score against them in the league for the rest of the season, because it is their ability to keep clean sheets that will help them win the title.\nSutton's prediction: 2-0\nMark's prediction: Palace are a decent team but Arsenal are at home. It will be tight, but Arsenal will get over the line 2-1\nAI's prediction: 2-1\nVilla Park, 14:00 BST\nWhat a phenomenal player Erling Haaland is.\nAll the Fantasy Football talk at the start of the season was about Haaland versus Mohamed Salah, and on the FPL podcast I do with Alistair Bruce-Ball and Statman Dave, they both said 'Haaland? No chance' and they went with Salah as captain.\nGuess what they are doing now? They have copied me and got Haaland as captain, and so has everyone else. It is dull as anything because everyone in the world has done the same.\nWe are at the stage now where we just expect him to score, the same as he does. He is like my old Blackburn strike partner Alan Shearer in that you just know it will happen.\nIn fairness to Manchester City, they are more than just a one-man team. Phil Foden is looking sharp again and I love the signing of goalkeeper Gianluigi Donnarumma.\nStill, like City, Villa have won their past three league games so this is going to be a tough test for Pep Guardiola's side.\nCity have lost on their past two visits to Villa Park and, while I don't see them getting turned over this time, they might have to settle for a point.\nSutton's prediction: 1-1\nMark's prediction: I'm going 5-0 to Villa! No, not really - I know they have picked up a bit recently after a terrible start, but I still think City will be too strong for them. Haaland is just unplayable at the moment. 0-2\nAI's prediction: 0-2\nMolineux, 14:00 BST\nWolves have to win eventually and at home to Burnley feels like the game it really has to happen for them - their fans will definitely be thinking that.\nBurnley will be eyeing victory too, though. They will take great encouragement from their win over Leeds last time out, and they could do Wolves a lot of damage if they beat them.\nAll things considered, it would be easy to go for a draw, but I am going to back Wolves to break their duck.\nSutton's prediction: 2-0\nMark's prediction: Wolves are struggling and I can see another draw here. This might be quite boring! 0-0\nAI's prediction: 2-1\nHill Dickinson Stadium, 16:30 BST\nTottenham have become a more versatile side under Thomas Frank, able to set up to suit the opposition, but I don't feel as if they are ever clinical enough in the final third.\nIt is a similar story with Everton. I always feel they have a goal in them, just not from the centre-forward, whether it is Beto or Thierno Barry leading their attack.\nIt must be frustrating for Toffees manager David Moyes but being realistic who can they attract, or afford, who would make a difference up front?\nAll of that makes me think this is going to be a tight game, and I don't think there will be a winner.\nSutton's prediction: 1-1\nMark's prediction: Everton are doing pretty well at their new ground and are still unbeaten there, so I am going to back them to win. I actually hope they do because I don't like Spurs after they beat us in the Europa League final last season. I was in Bilbao for that, and it was a very disappointing night. 1-0\nAI's prediction: 0-1\nHow did Sutton do last week?\nChris got three correct results, including one exact score, from the 10 games played in week eight, giving him 60 points.\nThat was enough for him to tie with the BBC readers, who also got three correct results with one exact score, and to out-do AI, which got four correct results without an exact score and ended up on 40 points.\nThe weekly win went to the guests, Aya and Addison from CBBC football drama Jamie Johnson FC.\nAya got three correct results without an exact score for a total of 30 points while Addison got seven correct results with one exact score for a tally of 100 - meaning their average of 65 points was enough for victory.\nWeekly wins, ties and total points after week eight\nGuest leaderboard 2025-26\n* Average after eight weeksRelated topics\n- Published16 August 2025",
  "word_count": 2839,
  "scraped_at": "2026-02-14T01:52:49.016484",
  "_text_extracted": true
}