{
  "article_id": "9ce900569eac",
  "url": "https://theathletic.com/5445542/2024/05/08/ancelotti-real-madrid-champions-league-record-reinvented/",
  "title": "Carlo Ancelotti Real Madrid reinvention shows why he should be counted among the greats",
  "date": "20240508T074500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“There are two types of managers: those that do nothing and those that do a lot of damage,” Real Madrid coach Carlo Ancelotti said last week. “The game belongs to the players.”\nWith characteristic modesty and humour, the Italian was speaking before his side’s Champions League semi-final first leg at Bayern Munich — one of the clubs on his coaching CV where his reputation was most questioned.\nAdvertisement\nBy some metrics, Ancelotti is arguably the greatest football manager of all time. Only he has led a team to the league title in Italy, England, France, Spain and Germany. He is also the only manager to win the European Cup/Champions League four times — and today (Wednesday) he will take charge of a team for a record 203rd time in the continent’s elite club competition, surpassing Sir Alex Ferguson’s mark of 202.\nYet, despite his tremendous success and longevity at the highest level, there remains an idea that the 64-year-old is not really a top coach, that he is somehow not as tactically sophisticated as peers such as Manchester City’s Pep Guardiola, Jurgen Klopp of Liverpool or Bayern’s Thomas Tuchel.\nThat idea arose again when Madrid midfielder Jude Bellingham spoke after they eliminated City in the Champions League quarter-finals last month.\n“Our biggest strength is that he finds a way to let a lot of the boys play with freedom,” the Englishman said of his manager. “That we’re so kind of off the cuff. As a man as well, he fills you with calmness and confidence.”\nBellingham would not have intended it, but his words fit a narrative that has followed Ancelotti through almost three decades in the coaching elite — that his primary strength is not bothering top players with detailed tactical demands.\nThe narrative annoys those who have worked closest with Ancelotti over his career, although ‘Don Carlo’ himself is too gentlemanly to ever show it in public.\nBut last week’s match in Munich again showed he knows what he is doing. His substitutions and switches brought about a comeback against Tuchel’s Bayern for a 2-2 draw that makes Madrid favourites to go through to the final from tonight’s return at the Estadio Santiago Bernabeu.\n“There was the legend that Carlo only man-managed great players,” says someone who knows the Italian well, but declined to be identified to protect that relationship. “This second stage at Madrid is really good to understand what he is really like as a coach.” (Ancelotti also managed the Bernabeu side for two seasons from 2013-15, then returned in summer 2021.)\nAs a player, Ancelotti was not the strongest or quickest, but he read the game from midfield as part of Arrigo Sacchi’s legendary AC Milan team who won consecutive European Cups in 1989 and 1990.\nAdvertisement\nAfter serving as Sacchi’s assistant with Italy’s national team (1992-95), Ancelotti began his own coaching career at hometown club Reggiana, sticking to his mentor’s rigid 4-4-2. But he soon began to adapt to the players at his disposal. His teams have set up in many different shapes and systems in the years since.\nAt Juventus, he found space for floating playmaker Zinedine Zidane. Back with Milan, he placed Andrea Pirlo as a deep-lying playmaker in a 4-3-2-1 system that helped win his first two Champions Leagues as a coach, in 2003 and 2007.\nGO DEEPER\nReal Madrid's Carlo Ancelotti — the Galactico whisperer and king of cups\nAfter joining Chelsea in 2009, Ancelotti switched to a 4-3-3 that got the best out of goalscoring midfielder Frank Lampard. During two seasons at Paris Saint-Germain, he based the team around its dominant centre-forward Zlatan Ibrahimovic.\nOn arrival in Madrid in the summer of 2013, Ancelotti decided to balance the team’s ‘BBC’ superstar front three — (Gareth) Bale, (Karim) Benzema and Cristiano (Ronaldo) — by using winger Angel Di Maria as a box-to-box midfielder. Di Maria was voted player of the match when Ancelotti delivered ‘La Decima’ — Madrid’s long-awaited 10th European Cup/Champions League trophy — at the end of that first season.\nStill, a debate over Ancelotti’s tactical acumen continued, especially as this was the era of the ‘superstar coach’, with systems and tactics paramount. Many believed Ancelotti’s main attribute was a relaxed dressing room approach that liberated a team of superstars drained by three intense years of Madrid predecessor Jose Mourinho’s micro-management.\nAfter a poor end to his second season at the Bernabeu, he was sacked. Some claimed he did not drive his players hard enough.\n“Our desire for constant improvement means there is no room for resting on our laurels,” Madrid president Florentino Perez said a few months after hiring Rafa Benitez as his (short-lived) replacement.\nAdvertisement\nReal Madrid are La Liga champions\n- Artful Ancelotti, brilliant Bellingham: How Real Madrid won La Liga\n- Madrid’s ‘dystopian’ dominance – Barcelona and rivals are way behind\nAncelotti then declined an opportunity to talk to Liverpool (who hired Klopp that October), before moving to Munich to replace Guardiola in the summer of 2016.\nGuardiola had driven Bayern to three Bundesliga titles and two German Cup successes in three years, but they had fallen short each season in the Champions League (including a 5-0 aggregate defeat to Ancelotti’s Madrid in the 2013-14 semi-finals).\nBayern won the 2016-17 Bundesliga with a 15-point lead over second-placed RB Leipzig, and a goal difference of 67. They were eliminated by Madrid in the Champions League quarter-finals, after extra time in the second leg, with the ties featuring two red cards for Bayern players, and two goals from Madrid that looked offside.\nStill, Ancelotti’s methods were not being accepted in Munich. Senior players felt his training sessions and tactics did not match up to Guardiola’s. Some in the club hierarchy felt Ancelotti was technically inferior to younger German coaches Tuchel and Julian Nagelsmann, and he was fired just a few weeks into his second season.\nThat time at Bayern seemed to set Ancelotti’s career on a downward trajectory.\nHis next two jobs in football were at relatively lower-level clubs. He joined Napoli in summer 2018 believing the squad was capable of winning Serie A, and their second place in his first season was the team’s highest finishing position since the second title won with Diego Maradona in the side in 1990.\nBut when Napoli president Aurelio De Laurentiis then fell out with most of his squad, Ancelotti took the players’ side. He was sacked in December 2019, having just secured qualification for the Champions League’s last 16.\nThen, within two weeks, came a big surprise.\nEverton were 15th in the 20-club Premier League, but owner Farhad Moshiri promised Ancelotti resources to build a squad capable of challenging England’s top six.\nAdvertisement\nA 2-0 victory at Liverpool in February 2021 — Everton’s only win at Anfield this century — raised hopes of Champions League qualification. However, a very unbalanced squad eventually finished 10th. It was Ancelotti’s lowest finishing position since 1995-96 with Reggiana in Serie B.\nThe idea that Ancelotti was no longer cutting edge, if he ever had been, was also shared by many back in the Spanish capital.\nWhen Zidane resigned as Madrid coach in May 2021, Massimiliano Allegri, Antonio Conte, Mauricio Pochettino and Raul were all considered for the vacancy, but none of those options worked out for different reasons. It took over a fortnight before Ancelotti received a call, but only a few moments for him to accept.\nOn arrival back at the Bernabeu, he could see the job was now very different to six years previously.\nAncelotti constantly repeating the word “intensity” was bad news for late-career Bale, Eden Hazard and Isco. The plan was also to sit deeper, meaning less running for veteran midfielders Toni Kroos and Luka Modric, and more space for young attacker Vinicius Junior to exploit. Balance came from deploying midfielder Federico Valverde on the right wing. This paid off when Valverde assisted Vinicius Jr’s winner in the 2022 Champions League final against Klopp’s Liverpool.\nThat title, won thanks to the tremendous ‘remontada’ victories against Pochettino’s PSG, Tuchel’s Chelsea and Guardiola’s City, was widely seen as a product of Madrid’s heritage in the competition — the Bernabeu atmosphere lifting their players and freezing their opponents. But Ancelotti’s decisions also fuelled these comebacks — such as replacing Kroos with 19-year-old Eduardo Camavinga at key moments.\nThose who know Ancelotti say these were not “off the cuff” calls, but purposeful choices in keeping with his idea of modern football — that energy and physicality were more important than ever, but players’ talent was still what won games and trophies.\nAdvertisement\nWhen Benzema left to play in Saudi Arabia last summer and Perez did not sign a new top centre-forward as a replacement, Ancelotti reacted by reinventing the team again.\nNewcomer Bellingham became a withdrawn central attacker, a role he had not played for either previous club Borussia Dortmund or England. A new flexible shape was honed through repeated work at training, with Bellingham on the left of midfield without the ball, then with the freedom to break forward and link with a front two of Vinicius Jr and Rodrygo.\nIt has worked spectacularly well.\nMadrid have just secured another Spanish title and Bellingham has scored 22 goals in all competitions so far — including dramatic late winners in each of the season’s decisive Clasico meetings with Barcelona.\nGO DEEPER\n'Half artist, half warrior' - watching Bellingham with Di Stefano's former team-mates\nYet the idea of Ancelotti being tactically not the greatest remains. Guardiola was even asked about it at the Bernabeu before City’s last-eight visit in early April.\n“If Carlo was a bad coach from a tactical point of view, he wouldn’t have used Pirlo as a midfielder,” Guardiola replied. “He would use Kroos in a different position, he would not have adapted Bellingham so he could explode.\n“Sometimes people try to put him down in this way, but we know he is a very good coach and a very good manager.”\nAncelotti’s tactical nous and adaptability were then shown in that tie against City, with lessons learned from the previous season’s defeat by the same opponents. In the first leg, a surprise setup placed Bellingham deeper, with Vinicius Jr more central and Rodrygo and Valverde on the wings. Both wide players scored in a thrilling 3-3 draw. For the return in Manchester, there was balance and intensity in Madrid’s gritty defensive display before they won a penalty shootout.\nIn the first leg in Munich last week, Vinicius Jr’s speed in a central position was exploited as he opened the scoring. But Ancelotti was not happy with his team’s approach in the game’s first hour. After they fell 2-1 behind, he removed club captain Nacho, and put midfielder Aurelien Tchouameni into the back four. He also hooked Bellingham for the more experienced Modric. The game’s momentum swung, Vinicius Jr equalised and, finishing at 2-2, the complexion of the tie was completely altered.\nAdvertisement\nThose changes were made after a conversation Ancelotti had with his number two — his son Davide. Father and son coaching teams are unusual in top-level sport, to say the least. The idea of it raised many eyebrows at first around the Bernabeu, but Ancelotti senior was clear from the start that Davide was up to the job.\nSources say Davide, 34, is a “football fanatic”, studying the latest tactical and physical preparation trends, which he brings to debates with his father. Francesco Mauri, 35, is another valued assistant coach (and son of Giovanni Mauri, who was Ancelotti’s fitness coach during his first spell with Madrid and also at Bayern).\nGO DEEPER\nReal Madrid assistant Davide Ancelotti wants to forge his own path - but not just yet\n“We have an elite coaching staff, with young fitness guys who bring real enthusiasm,” Ancelotti said recently. “When I’m lacking a little bit of enthusiasm due to my age, it’s hugely important to have young guys around the place who are always looking to improve and to do new things.”\nContemporaries who have not been able to adapt as well to circumstances have long faded away, or are struggling to find any job at the top level. Benitez is the same age as Ancelotti, also managed Napoli and Everton, and was most recently fired by La Liga strugglers Celta Vigo. Three years younger, Mourinho has not been elite for over a decade now.\nEven recently, some around the Bernabeu have pushed the idea of hiring a younger coach with the latest tactical ideas, such as Bayer Leverkusen’s Xabi Alonso. But Perez has been won over, and recently agreed to extend Ancelotti’s contract until 2026.\nAncelotti himself remains very confident in his abilities, no matter what narratives or ideas might surround him. He listens closely to advice, wants to hear different opinions, but also very clearly makes the final calls himself. That confidence also means — unlike many of his peers — he does not feel the need to publicly talk up his own work.\n“The game belongs to the players,” Ancelotti said last week. “You can tell them a strategy to follow, but they have to be convinced they can do it.\n“What a coach can do is ensure the players understand well what the team has to do. All (top-level) teams have quality players, the difference is how they use that quality.”\n(Top photo: Aitor Alcalde Colomer/Getty Images)",
  "word_count": 2230,
  "scraped_at": "2026-02-14T01:54:40.194220",
  "_text_extracted": true
}