{
  "article_id": "9d356e9012fe",
  "url": "https://thepeoplesperson.com/2024/03/16/jadon-sancho-likes-social-media-post-appearing-to-slam-his-disastrous-man-united-spell-277568/",
  "title": "Jadon Sancho likes social media post appearing to slam his disastrous Man United spell - Man United News And Transfer News",
  "date": "20240316T154500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United loanee Jadon Sancho liked a social media post which seemed to slate his time at Old Trafford.\nSancho appears to be back to his best and enjoying his football once more since he sealed a January loan move to Borussia Dortmund.\nThe Englishman returned to Signal Iduna Park to escape his troubles at United after he fell out with Erik ten Hag.\nThe two were involved in a bitter spat that played out in public. They couldn’t amicably resolve their differences and so a decision was made by United to let Sancho leave.\nHe scored in back-to-back games for the first time in more than two years during Dortmund’s clashes against Werder Bremen and more recently, vs. PSV Eindhoven in the Champions League.\nSancho’s goal against PSV essentially sent the Bundesliga giants through to the quarter-final of the competition, where they’re set to meet Diego Simeone’s Atletico Madrid.\nBeyond finding the back of the net, the 23-year-old was impressive against the Eredivisie giants and put up a complete performance. He won the man-of-the-match award for his exploits.\nAs pointed out by The Daily Mail, Sancho took to social media after the match and liked a post from Dortmund that appeared to slam his United tenure.\nThe German outfit put out a video that displayed some of his best moments in a Dortmund shirt since he made his way back to the club.\nThe post was captioned, “Sancho is back doing Sancho things.”\nSancho is back doing Sancho things. pic.twitter.com/GDtTztNTzd\n— Borussia Dortmund (@BVB) March 12, 2024\nThe Mail note that the video may have suggested that Sancho was struggling until he wore the Dortmund shirt again.\nHowever, it’s more likely that there was no malicious intent from either Sancho or Dortmund. It may simply be a case of the club praising their forward for his contributions to the side.\nA recent report covered by The Peoples Person relayed that United have finally set an asking price in the region of €35-40m to permanently part ways with Sancho.",
  "word_count": 339,
  "scraped_at": "2026-02-14T01:48:46.206125",
  "_text_extracted": true
}