{
  "article_id": "9d4405af05b1",
  "url": "https://www.teamtalk.com/newcastle-united/transfer-news-approach-chelsea-over-signing-exciting-bryan-mbeumo-alternative",
  "title": "Newcastle transfer news : Magpies  approach  Chelsea over signing exciting winger",
  "date": "20250605T223000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nNewcastle ‘approach’ Chelsea over signing exciting Bryan Mbeumo alternative\nNewcastle United have reportedly approached Chelsea over a move for winger Noni Madueke, who Enzo Maresca is willing to sell this summer.\nEddie Howe is prioritising the signing of a new right-winger as he looks to bring in more competition for in-form star Jacob Murphy.\nNewcastle need to add more quality and depth to their squad ahead of the 2025/26 campaign, in which they’ll be playing Champions League football after finishing fifth in the Premier League table.\nMadueke, 23, has shown flashes of brilliance for Chelsea but isn’t part of Maresca’s long-term plans, so the Blues are ready to listen to offers for him.\nAccording to Caught Offside, Newcastle have ‘approached Chelsea to enquire about the possibility of signing Madueke.’\nIt’s claimed that Madueke ‘also has interest from AC Milan’ and ‘won’t come cheap if he does move on’, with Newcastle ‘in contact for information on the player’s situation.’\nThe report adds that Chelsea would consider offers in the region of €60m (£50.5m) for Madueke, which would give them a tidy profit on the £28.5m they paid to sign him from PSV Eindhoven in 2023.\nREAD MORE: Chelsea in dreamland as elite star AGREES Stamford Bridge switch\nNewcastle target Madueke after Mbeumo blow\nMadueke has played a big role for Chelsea this season, starting 27 Premier League games, notching seven goals and three assists in the process.\nThe five-time capped England international is a key reason why The Blues finished fourth in the Premier League table. He also played the full 90 minutes in the Europa Conference League final victory against Real Betis.\nHowever, as TEAMtalk transfer correspondent Fraser Fletcher revealed on April 28, Madueke is one of several players Chelsea are willing to sell, for the right price, as was the case in January.\nMadueke is someone Maresca is keen to upgrade upon and with this in mind, Chelsea are in active discussions to sign Borussia Dortmund winger Jamie Gittens, with a view to completing the deal before the Club World Cup.\nNewcastle showed interest in Madueke last summer and if the latest reports are to be believed, he’s back on their radar.\nThe Magpies are also keen on Brentford winger Bryan Mbeumo, but look set to miss out, as his preference is to join Manchester United.\nWith this in mind, it will be interesting to see whether Newcastle make a concrete move for Madueke and if they’re willing to go as high as £50m for him.\nDON’T MISS: The 25 biggest transfers in the 2025 summer transfer window, ft. Man Utd, Real Madrid signings\nLatest Newcastle news\n⚫⚪ Man City nearing £143m TRIPLE signing with Newcastle ace next\n⚫⚪ Leeds’ chance of Nick Pope deal revealed as Newcastle keeper digs heels in over future\n⚫⚪ Anthony Gordon ‘open’ to Liverpool transfer with big-money sale to fund Newcastle raid – sources",
  "word_count": 487,
  "scraped_at": "2026-02-14T01:58:41.959971",
  "_text_extracted": true
}