{
  "article_id": "9d48611036dd",
  "url": "https://www.euronews.com/2025/09/02/dream-draw-for-kazakhstans-kairat-tough-journey-for-real-madrid",
  "title": "Dream draw for Kazakhstan Kairat , tough journey for Real Madrid",
  "date": "20250902T121500Z",
  "domain": "euronews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kazakhstan's Kairat will face Real Madrid and Inter Milan in the 2025–26 Champions League, thrilling fans while Spanish media lament the long trip to Almaty.\nKazakhstan’s Kairat will face Real Madrid and Inter Milan in the 2025–26 Champions League, a historic draw that electrified fans at home but left Spanish media lamenting the daunting trip to distant Almaty.\nUEFA's draw last week paired the Kazakhstani side with Spanish giants Real Madrid and Italian powerhouse Inter Milan from the first pot.\nKairat players watched the draw together, erupting in celebration after drawing the 15-time Champions League winners, with some struggling to believe Real Madrid would visit Kazakhstan.\nHowever, 16-year-old winger Dastan Satpayev, already purchased by Chelsea, appeared more contemplative than celebratory, seemingly considering the difficulty of facing such elite opposition.\nKairat will also host Belgium's Club Brugge, Greece's Olympiacos and Cyprus's Pafos at home, while travelling for away fixtures against Arsenal, Portugal's Sporting CP and Denmark's Copenhagen.\nKairat fans ‘assault’ Real Madrid’s Instagram\nEcstatic by the draw and the opportunity to see one of the most famous football clubs at home, Kazakh football fans flooded Real Madrid’s social media.\nThe first several posts on their Instagram are full of comments in Kazakh of people eagerly waiting for them in Almaty and hoping to see the first team and, especially, Kylian Mbappe. Some even hope that Kairat will be able to beat the Spanish giant.\nOne of the fans created an AI-generated video of Mbappe in front of Almaty’s Central Stadium, where the game will take place.\nThe French footballer already played in Kazakhstan as part of the French national team in qualifying games for the 2022 World Cup, but then he played in the capital Astana.\nMany have already started thinking about who to take to the game, how much the tickets will cost and planning the trip to Almaty.\nFans from India, Brazil, Uzbekistan, Azerbaijan, and all other neighbours expressed their support for Kairat and wished them luck.\nReal Madrid’s account wasn’t the only one drowning in comments from Kazakh fans. The social media of all other opponents also saw a surge in commentators from Kazakhstan.\nSpanish are not that happy about the draw\nFor Real Madrid this draw proved to be challenging. The trip will be one of the longest in the Champions League – 6,400 km one way − which takes around nine hours on a direct flight.\nReal Madrid’s Director of Institutional Relations Emilio Butragueño underlined that the match will be “more difficult than people think” and they will have to pay attention to a lot of details.\n“We've never played against them, and they're very far away; it's another factor to take into account, considering the demanding and compressed schedule we have. We have to accept that and prepare well for that game,” Butragueño said.\nCommentators from Spanish ASTV found Real Madrid’s draw too challenging and uneven, especially compared to Barcelona’s draw.\nThey were unhappy that the team would have to travel to Almaty, calling it the worst location from the worst pot, “just 300 kilometres away from China’s border”.\nSome Spanish outlets managed to reach out to Kairat’s player Luis Mata from Portugal, asking him what to expect from Almaty.\n“If you come here in September, October, you will see a very nice weather, the city is very modern, it has very beautiful mountains nearby,\" Mata told Spanish football TV programme El chiringuito de Jugones.\n\"But if you arrive here in November, December, January there will be snow, it will be very cold, negative 12°C, I think,” he added.\nWhat do Kazakh sports experts think?\nContrary to the Spanish media, Yermukhamed Maulen, editor of aladop.kz, a Kazakh website focused on football, thinks that the travel will not be too difficult for Real Madrid, as they constantly tour the world playing with a wide range of teams.\nSports commentator Alimzhan Askar says there is always a chance to score a goal, even against Real Madrid. He recalled Moldova’s Sheriff Tiraspol, who played against Real Madrid in 2021 and won 2:1.\n“There is nothing impossible. Kairat reached the league phase for a reason. We beat Celtics, a big European club, so the game with Real Madrid will be, dare I say, on equal terms,” Askar said.\nA home game with Real Madrid “stole the show,” the commentator noted, highlighting that both Inter and Arsenal have a big fanbase in Kazakhstan as well.\nYermukhamed Maulen thinks that Inter will be a more formidable opponent.\n“The main opponent is Inter. The match will be in their home turf in Milan in Giuseppe Meazza Stadium. Hoping that we will score at all, I think it’s impossible,” Maulen said.\nBoth sports experts agree that Pafos, Sporting and Copenhagen will be a lot more manageable, but still worthy opponents.\nOverall, they believe the chances of Kairat proceeding to play-offs are pretty low, but getting to be one of 36 is already a fantastic achievement and experience both for the team and for the country.\nMatch to promote Kazakhstan as tourist destination\nThe games that Kairat will play at home will undoubtedly put Almaty on the map for many football fans as a new tourist destination.\nThe KazakhTourism National Company expects 4,760 international tourists.\nWhen discussing the probable revenue from the match, they cite the National Bank and industry sources, which state that the average cost for a tourist in Kazakhstan is €1,000-1,300 for a trip lasting about four days.\n“Thus, direct expenses of fans alone could amount to $6 to $7.5 million (€5-6.5 million),” they said, noting the team members, UEFA representatives and international journalists will likely bring additional €170,000-€340,000.",
  "word_count": 938,
  "scraped_at": "2026-02-14T01:52:36.762614",
  "_text_extracted": true
}