{
  "article_id": "9d5415ba36a3",
  "url": "https://www.90min.com/posts/every-english-goalscorer-el-clasico",
  "title": "Every English goalscorer in El Clasico",
  "date": "20231014T193000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every English goalscorer in El Clasico\n- El Clasico pits Spanish giants Real Madrid and Barcelona against one another\n- Only four English players have scored in the fixture's history\n- One Englishman has netted a hat-trick in the bitter rivalry\nThere is not an extensive list of English players that have represented Real Madrid or Barcelona.\nIt's an elite club, joined by only a few lucky superstars over the years. Of those to have represented the Spanish giants, even fewer have added their name to the scoresheet in El Clasico - one of the biggest and most fiercely-contested rivalries in world football.\nHere are the four players to have achieved the feat so far.\nLaurie Cunningham - Real Madrid\n- Clasico apps: 5\n- Clasico goals: 1\nLaurie Cunningham was a trailblazer for British players in La Liga, becoming the first individual from the United Kingdom to sign for Real Madrid back in 1979. The winger played 63 times for the side from the Spanish capital, winning one league title and lifting the Copa del Rey twice.\nIn his five meetings with rivals Barcelona, Cunningham scored once - just 32 minutes into his first clash with the Catalan side. Madrid won the Clasico 3-2 after a thrilling first half that witnessed all five goals, with the former West Bromwich Albion forward scoring the eventual winner.\nCunningham failed to find the net in his next four matches against Barcelona, winning one, drawing one and losing two of the clashes.\nGary Lineker - Barcelona\n- Clasico apps: 8\n- Clasico goals: 5\nGary Lineker holds the unique record of being the only Englishman to have scored a hat-trick in El Clasico. The lethal striker featured in eight meetings with Real Madrid, but his second clash with them was the most memorable.\nIn a 3-2 victory for Barcelona back in 1987 - a game Lineker described as \"one of the most special moments\" of his career - the English forward bagged all three goals on a famous night.\nIn typical Lineker fashion, all three goals came from a collective distance of about 18 yards, the first two being tap-ins from close range. The former Leicester City man completed his hat-trick just after the break, dinking the ball over Madrid's onrushing goalkeeper to cap a wonderful performance.\nLineker would score twice more against Madrid, doing so in two victories in his next four games against them. Three years after his arrival in Catalonia, Lineker left for Tottenham Hotspur, finishing with five goals in total in El Clasico.\nSteve McManaman - Real Madrid\n- Clasico apps: 7\n- Clasico goals: 1\nSteve McManaman faced Barcelona seven times during six years at the Bernabeu, only finding the back of the net once. The former Liverpool winger drew a blank in five La Liga matches against them, but scored his one and only goal in a pivotal Champions League victory.\nReal Madrid met Barcelona in the Champions League semi-final during the 2001/02 season on their way to the trophy, beating their bitter foes 3-1 on aggregate. During the first leg, McManaman grabbed a stoppage-time goal to secure a 2-0 win with a lovely chipped finish, adding to Zinedine Zidane's earlier strike.\nThe attacker did have the impressive record of never losing a Clasico during his years in the Spanish capital.\nMichael Owen - Real Madrid\n- Clasico apps: 2\n- Clasico goals: 1\nMichael Owen had a history of scoring against Barcelona prior to his move to Real Madrid. The striker scored Liverpool's only goal in a 3-1 Champions League defeat against the Spanish side at Anfield in 2001 but would fare better the next time he netted against Barca.\nOwen spent just one season at the Bernabeu, featuring against Barcelona just twice as a result. The 89-cap England international suffered a 3-0 defeat in his first meeting but managed redemption the second time round, scoring the fourth in a 4-2 Clasico victory in 2005.\nThe striker was set up by a wonderful lofted through ball from compatriot David Beckham - who himself failed to score in a Clasico - firing a powerful low drive past Victor Valdes. It would prove one of just 16 goals Owen would manage in 45 appearances for the Spanish side.\nJude Bellingham - Real Madrid\n- Clasico apps: 1\n- Clasico goals: 2\nBy his own admission, Jude Bellingham wasn't at his best on his Clasico debut. Yet, a forgettable opening 68 minutes was erased with one swat of his right boot from 30 yards. \"Maybe the opponents expect me to try to get into the box or combine with a team-mate and I wanted to surprise them by hitting it from outside the box,\" Bellingham explained of his thunderous equaliser against Barcelona in October 2023.\nAs the match ticked into stoppage time, Bellingham pounced from much closer range, stabbing Madrid towards another dramatic win. No other Madrid player of any nationality had ever scored more than once on their Clasico debut in the 21st century.",
  "word_count": 836,
  "scraped_at": "2026-02-14T01:56:32.776622",
  "_text_extracted": true
}