{
  "article_id": "9d6738de1adf",
  "url": "https://metro.co.uk/2025/12/31/declan-rice-breaks-silence-missing-aston-villa-win-injury-25948317/",
  "title": "Declan Rice breaks silence after missing Aston Villa win through injury",
  "date": "20251231T084500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Declan Rice sent a message to his teammates after missing Arsenal’s winover Aston Villa on Tuesday night through injury.\nThe England midfielder sat out of the impressive 4-1 victory over the Villains, which sent the Gunners five points clear at the top of the Premier League table.\nThe game was goalless at half-time, but efforts from Gabriel Magalhaes, Martin Zubimendi, Leandro Trossard and Gabriel Jesus gave Arsenal a rousing win.\nVilla’s Ollie Watkins scored in the 94th minute in a consolation for Unai Emery’s men as their 11-match winning run came to a sudden stop.\nIt is very rare that Rice misses a big game for Arsenal, but Mikel Arteta will be encouraged by how his team performed without the influential midfielder.\nThe Gunners boss revealed before the game that Rice picked up a knee injury in the win over Brighton which kept him out of the clash at the Emirates.\nThe 26-year-old may have missed the action, but he still celebrated the win, posting on Instagram: ‘This team!!! We keep going ❤️❤️❤️.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nExplaining Rice’s fitness issues before the Villa match, Arteta said: ‘Declan got a big kick in his knee during the match [against Brighton], at the start of the match actually, and by the time he finished the match he had a massive swell up. The game [against Villa] was too early for him to be able to consider.\nOn whether he believes it is a short-term issue, the Spaniard said: ‘I think so. I hope that when the swelling comes out he can function, he will be fine. We miss Riccy [Calafiori] as well today.’\nArsenal are back in action at Bournemouth on Saturday and Arteta could not be sure whether the former West Ham man would be available.\nPrefer us to the others? Then tell Google!\nAs a loyal Metro reader, we want to make sure you never miss our stories when searching for your news. Whether it is the latest politics news explained, live football coverage or a showbiz scoop.\nClick here and tick Metro.co.uk to ensure you see stories from us first in Google Search.\n‘Depends,’ said the manager. ‘That swelling has to come right down for him to have the chance to function. He wasn’t available to do that today yet. He’s improving but let’s see what it is in the next couple of days.’\nArsenal’s injury problems have cleared up a bit, with both Jesus and Kai Havertz starting on the bench against Villa, fit again after long-term injuries.\nGabriel Magalhaes is back in central defence alongside William Saliba, with Ben White on the bench and Jurrien Timber at right-back.\nRiccardo Calafiori and Cristhian Mosquera are expected to return soon, as is Rice, with just Max Dowman out for a longer spell.\nA delighted Arteta said after the rousing win over Villa: ‘It’s belief, it’s energy as well because they put in so much.\n‘We’re playing every two-and-a-half days, the schedule is very, very demanding, we have some very tough matches and injuries but the players are still winning, so winning helps all that.\n‘All the sacrifices and commitment that you put in gets reflected in results and great performances and that’s so satisfying, but we know there’s still so much to play for.\nArsenal's January fixtures\n03: Bournemouth (a) Premier League\n08: Liverpool (h) Premier League\n11: Portsmouth (a) FA Cup\n14: Chelsea (a) Carabao Cup\n17: Nottingham Forest (a) Premier League\n20: Inter Milan (a) Champions League\n25: Manchester United (h) Premier League\n28: Kairat (h) Champions League\n31: Leeds United (a) Premier League\n‘It’s a great way to end the year, that’s for sure, and tomorrow we’ll have a good night with our families, but then the next day we are in and we have to go to Bournemouth, and we know what that means.’\nHe added: ‘I’m so happy. We play every three days, we played an opponent today that comes from 11 wins in a row, a superb team, very difficult to play against and we knew that we were going to have periods throughout the game.\nMore Trending\n‘We talked about how demanding it was going to be emotionally and we struggled in the first 10 minutes, arriving a bit late. They were playing through us and creating some open space situations that they are very dangerous at.\n‘Then we adjusted, got a bit more control, two big chances by Viktor [Gyokeres] and one scrappy situation inside the box, but we didn’t manage to score. In the second half, we clicked.\n‘Everything went much better, timings were better and the individual duels were fulfilled in an extraordinary way, so efficient in everything that we did.\n‘Unlike the last few games where we had so many big situations, today we were very prolific and accurate to make the difference.’\nMORE: Paul Merson puts his neck on the line with bold Arsenal title claim after Aston Villa win\nMORE: Emiliano Martinez embroiled in furious bust-up with Arsenal fans after Aston Villa defeat\nMORE: Jamie Carragher names two replacements for Arsenal star who ‘shouldn’t be starting’",
  "word_count": 901,
  "scraped_at": "2026-02-14T01:59:31.504801",
  "_text_extracted": true
}