{
  "article_id": "9d7977c40cad",
  "url": "https://www.the42.ie/europa-league-final-preview-6385118-May2024/",
  "title": "Alonso and Leverkusen seek immortality in Dublin date with Atalanta",
  "date": "20240522T081500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "HELLO EUROPE, THIS is Dublin calling!\nOr, to be more accurate, this is Dublin answering the phone.\nThe Europa League final is back in town for the first time since 2011, given to us as a consolation prize for being unwilling to host our Euro 2020 games amid the pandemic.\nWe are told this event a tremendous showcase for Dublin and Ireland – let’s hope nobody looks too closely at the state into which we have allowed our actual football facilities to descend! – but while Molly Malone, Trinity College and the Convention Centre (?) have got plenty of airtime on Uefa’s promotional videos, this isn’t really an invitation to Europe to see what we’re all about.\nNo, the Dublin Portal is a true showcase of who we are: this final is a test of Dublin’s ability to host Uefa’s strictly-uniformed travelling circus.\nUefa moved into Dublin 4 a few weeks ago – which resulted in Leinster crossing the Liffey for their Champions Cup semi-final – to prepare this final to look like all of the recent finals. Hence the national football stadium is now known as the ‘Dublin Arena’, as Aviva are not among Uefa’s retinue of sponsors. This is, in fairness, a major operation: over 53km of fibre optic cables have been wound around the ground so as to be able to broadcast the game across the world, with footage to be captured by 30 cameras around the stadium.\nThe last time this game was held in Dublin, one of the most exciting young coaches in the game led their side to the second leg of a treble with victory, having won the domestic league without losing a game.\nFor Andre Villas-Boas and Porto in 2011, read Xabi Alonso and Bayer Leverkusen this year. Alonso’s potential treble would be even more impressive than Villas-Boas’, given Leverkusen have yet to lose a game in any competition. (Porto lost a couple of knockout ties in Europe but progressed on aggregate.)\nAlonso is the hottest coaching property in the game at the moment, having shed his club’s Neverkusen title in thrilling, quixotic and faintly ridiculous fashion. They have ended Bayern Munich’s 11-year hold on the Bundesliga, have a German Cup final against second-tier Kaiserslautern this weekend, haven’t lost in 51 matches and have scored 15 goals in stoppage time alone.\nAlonso would have had the pick of the Liverpool, Bayern, and Real Madrid jobs this summer, but has instead decided to remain loyal to Leverkusen, whom he will take into the Champions League next season. He is determined to pace his coaching career, which stands in contrast to Villas-Boas, who said after the 2011 Dublin win that he wouldn’t still be working as a manager in 10 years. (He has kept his word: his last job in management ended in 2021, and he was recently elected president of Porto.)\nAlonso worked under Pep Guardiola, Jose Mourinho, Carlo Ancelotti, Rafael Benitez, and Vicente del Bosque and has made the most of his enviably diverse education. In his first season he guided Leverkusen away from relegation by steeling the defence and turning them into a ruthless counter-attacking team, whereas this season they have better controlled possession. Leverkusen play a back three, in front of which a midfield duo sit, which will include Granit Xhaka, once of Arsenal.\nTheir wing-backs are outrageously productive: in 49 games this season, Alejandro Grimaldo has 12 goals and 19 assists while Jeremie Frimpong has 14 goals and 12 assists.\nThe key creator is the playmaker Florian Wirtz, though Alonso was coy as to whether he will start tonight, given recent injury problems.\nThis game might have been Jurgen Klopp’s farewell game – if that had transpired this final would have become one of the biggest events ever staged in Ireland – but any Liverpool fans with tickets can console themselves that, with victory, they will see one of their greatest players lead what may be Europe’s current best team to victory. This final is Leverkusen’s penultimate step in potentially securing one of the greatest single seasons in the history of European football.\nAtalanta are the reason why Klopp said his goodbyes at Anfield at the weekend: they pulverised Liverpool in the quarter-final, the 1-0 second leg defeat immaterial given their stunning 3-0 win at Anfield.\nWhile Alonso is at the start of what is expected to be a garlanded coaching road Atalanta’s Gian Piero Gasperini is in the autumn of his career, and thus far the only silver he has collected is that which flows from his head. Following spells with Crotone and Genoa, he was given a shot at Inter Milan in 2011, who abruptly sacked him after just five games. He bounced around Palermo and Genoa before he belatedly found a home at Atalanta in 2016 and started working miracles, qualifying for the Champions League for the first time and then twice subsequently, reaching the quarter-finals in 2020.\nIt has been a glorious period for the club, but neither they nor Gasperini have yet won a trophy. Atalanta’s only major trophy was the 1963 Coppa Italia, which is one more trophy than Gasperini has won in his career. He has lost his four cup finals, the most recent being last week’s Copa Italia final to Juventus.\nVital to breaking that duck for both is Gianluca Scamacca, recently seen making no impact at West Ham. He has returned to Italy with Atalanta and caught fire, with six goals in this competition alone. He missed last week’s Cup final, but is available tonight. Atalanta will be without captain Marten de Roon, who picked up a knee injury against Juventus. The Dutch international posted online from the slough of his heartbreak, saying “what should’ve been the most important week of my career, became the biggest nightmare.” Atalanta fans responded by hanging a banner outside of his home: Sense of belonging, sacrifice and a sweaty shirt at all times. De Roon, you have already conquered your cup.\n“It brought a tear to my eye”, De Roon said at the pre-match press conference.\n“Leverkusen appear invincible at this moment in time, but maybe we can change things”, he added.\nAtalanta’s style of play is thrilling: they press high and man-to-man, which completely overwhelmed Liverpool, though Alonso cautioned that they occasionally sit deep. Sticking with Plan A would be a hire-wire act against a side of Leverkusen’s quality, but it would also assure the quality of the spectacle.\nBoth sides play a 3-4-3, but Alonso warned against putting too much emphasis on how either coach writes down their side.\n“Football is so dynamic: the system is just a picture, the game is a movie”, said Alonso, slightly profoundly.\nOne of these sides will be replaying tonight’s tape for years to come.\nOn TV: Virgin Media Two and TNT Sports 1; KO: 8pm",
  "word_count": 1140,
  "scraped_at": "2026-02-14T02:25:33.976187",
  "_text_extracted": true
}