{
  "article_id": "9d7d9e16f4a4",
  "url": "https://www.freemalaysiatoday.com/category/opinion/2026/01/09/devils-cant-afford-any-more-duds",
  "title": "Devils cant afford any more duds",
  "date": "20260109T020000Z",
  "domain": "freemalaysiatoday.com",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The search is back on. Nope, not for Jho Low, the missing MH370 or the Lost City of Atlantis.\nBut for the elusive individual who can get a tune out of a discordant bunch of footballers in the red half of Manchester.\nToo bad the blue half has a fella who is probably the best in the business. And too bad United let him slip through their fingers.\nFergie thought he had him when they met for dinner in New York. But Pep wasn’t sure as he couldn’t decipher Fergie’s Scottish accent. Or so the story goes.\nWell, it’s been downhill from there.\nThere has been the Fergie Clone, the Dutch Master, the Special One, the Club Legend, the Professor, the New Sheriff and lastly, the Poet.\nYou can’t say the club hasn’t tried.\nBut it’s not an easy job and it’s getting tougher. The basic requirements are: to outsmart Pep, qualify for Europe and not to lose to Liverpool.\nA candidate must also adhere to the famous youth policy, handle big names, and be nice to club legends, especially Gary Neville.\nAnd at all times, he must attack, attack, attack whenever they have the ball.\nAnd he must now kowtow to a collection of busybodies, officially known as the CEO, sporting director and football director.\nThere was even a Marginal Gains guru, whatever that is, but he didn’t last long.\nThey sit up on high, are stern-faced and think they know better than you. They’ve been dubbed the Politburo.\nAnd then there’s the old man, Jim Ratcliffe who pokes his nose into tactics and team selection too.\nIf you feel you tick a few of those boxes, send your CV to Ratcliffe, the billionaire boss of petrochemical company Ineos, who now owns 29% of the club.\nIt pays not to underestimate these guys, as they have already achieved the considerable feat of making a bigger mess of Manchester United than the Glazers.\nAll the time in Florida, at least they gave the manager some peace.\nRuben Amorim certainly didn’t get any, even the old man was telling him not to play three at the back.\nAnd looking back to last weekend, it seems that the Portuguese had already had enough.\nLike Enzo Maresca at Chelsea and Nuno at Forest, he talked himself out of the job.\nManagers are doing this more often now, and who can blame them when they stand to collect millions in the payoff?\nBut if Devils fans thought a corner had been turned with the departure of a man clearly out of his depth, don’t be too sure.\nAfter announcing that Darren Fletcher, the erstwhile Under-18 coach, would be the caretaker, it was then revealed that talks had been held with two other former players.\nFletcher oversaw a 2-2 draw at Burnley and will be in charge for the Cup game with Brighton on Sunday.\nBut Ole Gunnar Solskjaer and Michael Carrick are being considered for the longer-term caretaker role until the end of the season.\nSolskjaer, who was in charge between December 2018 and November 2021, hardly seems a step forward.\nAnd again, you feel, it’s too many cooks.\nUnited may think they need time to wade through the world’s most eligible candidates, and hope to pick The One this time.\nIt may appear to be sound thinking for once, but – and there is a sizable but – there’s the small matter of the World Cup taking place in June and July, and many of the A-listers will be there.\nEven if a secret deal is done beforehand, a manager of a national side will not have time for a proper pre-season.\nNew signings could also be problematic. Clubs can be wary about paying a “World Cup tax” on those who have shone in the tournament.\nJust ask Liverpool about Gerard Houllier’s “last pieces of the jigsaw” in 2002.\nEl Hadji Diouf and Salim Diao starred for Senegal, who reached the quarter-finals, but never brought that form to Anfield.\nIt’s now a cautionary tale.\nAll top managers deem this an absolute must if the club is serious about the following season.\nAlthough it might be tempting to wait and lure Carlo Ancelotti for the coming season, what if Brazil implode as they did in Qatar?\nAnd would cool Carlo want the hassle anyway?\nOther national managers that may be of interest include Thomas Tuchel (England), Didier Deschamps (France), Julian Nagelsmann (Germany) and Mauricio Pochettino (USA).\nIntriguingly, Marcelo Bielsa, who did a great job at Leeds, is also there in charge of Uruguay.\nAnother worry for the Ratcliffe regime and the fans is that form, which had picked up from last season, has dropped off.\nSince the beginning of November, United have won only two of 10 games against the teams in the bottom eight.\nAnd against the bottom three, they’ve managed three draws.\nThere are doubts now that they’ll qualify for European football at all, let alone the Champions League.\nThey are unlikely to splash out big in this month’s transfer window as they don’t have a manager, so the existing squad has to do the job.\nIt’s possible that under an ex-player having basically a free hit in charge, the team may also find that elusive freedom of expression.\nNo longer shackled by Amorim’s back-three obsession, they can revert to a more attacking style.\nApart from the No 1 spot, where Arsenal now seem to have a grip on the trophy, the top half of the table is congested.\nLast season, the top seven all made it into Europe, but the chances are United may have to settle for one of the lesser places, if they get one at all.\nAs for who should get the job, this column sees one outstanding candidate.\nHe’s not at the World Cup, he’s won a European (Europa League with Eintracht Frankfurt) as well as a domestic trophy (FA Cup, beating Pep’s Man City), and his contract runs out at the end of the season.\nOliver Glasner, Crystal Palace’s Austrian boss, could be the man.\nCool, erudite and committed to attractive football from three at the back, he speaks excellent English and knows the EPL.\nIf I were Ratcliffe, I’d be talking to him now.\nThe views expressed are those of the writer and do not necessarily reflect those of FMT.",
  "word_count": 1055,
  "scraped_at": "2026-02-14T01:55:32.916671",
  "_text_extracted": true
}