{
  "article_id": "9d99dd093a54",
  "url": "https://thepeoplesperson.com/2025/08/19/rasmus-hojlund-napoli-learn-price-as-they-look-to-gazump-ac-milan-297870/",
  "title": "Rasmus Hojlund : Napoli learn price as they look to gazump AC Milan - Man United News And Transfer News",
  "date": "20250819T121500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United may have started the season with a defeat, but solid Premier League debuts for new attackers Matheus Cunha, Bryan Mbeumo and Benjamin Sesko gave Ruben Amorim something of a silver lining.\nThe club have spent big on forward talent for the new campaign, but this has forced United’s existing number 9, Rasmus Hojlund, towards the exit door.\nHe endured a dismal second season at Old Trafford, scoring only four Premier League goals, and wasn’t even included in the squad for the 1-0 loss to Arsenal at the weekend.\nHojlund in demand\nBut while Amorim has run out of patience with the young Dane, a fight for his signature is taking shape in Italy. Hojlund has long seemed set for AC Milan but reports yesterday suggested Napoli are ready to crash the party, with the Serie A champions reeling from a long-term injury to first-choice centre-forward Romelu Lukaku.\nWith United unwilling to sell Joshua Zirkzee his Danish strike partner is now in the frame, and Napoli are getting serious about exploring a deal. La Gazzetta dello Sport report today that Hojlund is top of Napoli’s list of Lukaku replacements, and that “initial contacts were initiated yesterday” by Napoli sporting director Giovanni Manna.\nThe club are sounding out a “complicated” loan deal, described as “costly”, and know they must act fast to beat AC Milan, although believe that the offer of Champions League football should be persuasive and allow Hojlund to “build a dazzling future.”\nUnited name their price\nCorriere dello Sport report that United have informed Napoli what they must pay to take Hojlund back to Serie A.\nThe outlet offers some hard numbers and report that the Red Devils, who have “practically thrown him out” are open to a loan worth €5-6m with a buy option between €35m and €40m. They suggest that these are the terms offered to AC Milan, and Napoli would be given the same as they have “effectively entered the race” for Hojlund.\nGdS note that Napoli see Hojlund as an instant impact kind of signing: “He knows Italy, doesn’t need to settle in, would benefit from the presence of McTominay to integrate into Napoli, has a good eye for goal, and guarantees loyalty to the project.”\nCdS echo these reports, also stating that Hojlund offers “qualities that wouldn’t force Conte to overturn” his established tactical setup.\nThat both outlets are so certain of Napoli’s attraction to Hojlund, and considering the club’s desperation to find a replacement for Lukaku before the start of the new Serie A season at the weekend, these developments will be music to INEOS’ ears as they look to bring some money in after spending big so far this summer.\nFeatured image Vincent Carchietta via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 462,
  "scraped_at": "2026-02-14T02:02:51.929902",
  "_text_extracted": true
}