{
  "article_id": "9d9d02bbae2b",
  "url": "https://quicknews-africa.net/uba-in-partnership-with-mastercard-reward-customers-with-all-expense-paid-trip-to-uefa-champions-league-semis-finals/",
  "title": "UBA in partnership with Mastercard Reward Customers with All - Expense Paid Trip to UEFA Champions League Semi & Finals",
  "date": "20250819T090000Z",
  "domain": "quicknews-africa.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "United Bank for Africa (UBA) PLC in partnership with Mastercard, have announced they are giving away all-expenses paid trips to the Semi-Finals and Finals of the 2019 UEFA Champions League to 12 lucky UBA Mastercard holders and their plus ones.\nOpen to all existing and new UBA Platinum Mastercard holders, this amazing giveaway is an opportunity to pamper customers and give them a unique, unforgettable and priceless experience including flights, visas, 5-star accommodation, tickets to watch either the semi-finals or final matches of the UEFA Champions League and so much more with their MasterCard Platinum Access.\nA total of 12 UBA Platinum Mastercard holders from Nigeria and 11 other African countries will share the enthralling experience of watching the finals live with a loved one as well as enjoy the great ambience of host city of the Semi-Finals or Finals (Madrid). The participating countries are Benin, Cameroon, Chad, Congo Brazzaville, Gabon, Ghana, Liberia, Sierra Leone, Tanzania, Uganda, Zambia.\n“As we celebrate our 70 years of Banking and excellence, this is our way of rewarding customers for their continued patronage to the UBA brand. There will be many more this year as we want to continue to appreciate all our customers … for now. Customers who qualify should get a UBA Platinum Mastercard and spend a minimum of $10,000 or its equivalent in his or her local currency to stand a chance to win the all-expense paid package. To get your UBA Platinum Mastercard at any UBA Branch, a customer simply needs to contact his or her relationship manager at any UBA branch office” the Group Head, Marketing, UBA Plc, Mrs. Dupe Olusola said.\nShe said, “The UEFA Champions League is the most sought-after trophy in club football competition, and one of the most followed sporting spectacles in the world. To this end, we decided to partner Mastercard and UEFA in bringing the most iconic and cherished moments in the history of football to our esteemed and loyal customers who are the reason why we are so successful.\n“We realize that, a lot of our customers love football and we feel giving them this treasured experience while they are pampered in far-away Spain is the way to go. These are the moments that make football such a passionate sport and we want to share these moments and experiences with our loyal customers across Nigeria and Africa,” Olusola said.\nUnited Bank for Africa Plc is a leading pan-African financial services group, operating in 20 African countries, as well as the United Kingdom, the United States of America and with presence in France.",
  "word_count": 430,
  "scraped_at": "2026-02-14T02:09:18.615900",
  "_text_extracted": true
}