{
  "article_id": "9dba09646527",
  "url": "https://punchng.com/kazakhstans-kairat-almaty-stun-celtic-book-first-ever-champions-league-spot/",
  "title": "Kairat Almaty Stuns Celtic , Secures Champions League Spot",
  "date": "20250827T050000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kairat Almaty carved their names into football history on Tuesday night, booking a maiden UEFA Champions League group-stage berth after outlasting Celtic 3–2 on penalties in Almaty.\nThe Kazakh side frustrated the former European champions across two legs, both ending goalless, before holding their nerve in a nerve-shredding shootout.\nCeltic collapsed from the spot, missing three penalties —including a decisive effort from Daizen Maeda—to confirm their relegation to the Europa League.\nThe defining moment belonged to Temirlan Anarbekov, Kairat’s 21-year-old goalkeeper, who pulled off decisive saves and cemented his status as the unlikely hero of the night.\nHis late intervention had already denied Celtic when he palmed away Luke McCowan’s 112th-minute effort to force penalties.\nDespite dominating possession, Celtic “struggled in front of goal”—managing 22 shots across both matches but only eight on target.\nRodgers laments\nManager Brendan Rodgers admitted the result was “a huge blow,” lamenting not just missed chances but “recent transfer delays and the poor pitch quality in Almaty” as compounding factors.\n“I thought overall it was a poor game. The quality of the pitch made it awful.\n“We were defensively okay but couldn’t make the breakthrough. We had chances, and then when it goes to penalties anything can happen.\n“Very disappointed. There was plenty of endeavour there, the players worked hard, but over the two legs we’re disappointed not to have scored.\n“We just have to reflect on opportunities we had that we didn’t take. We have to settle for the Europa League.\n“It’s very frustrating, we showed a glimpse of what we can do at this level [last season], but we haven’t showed that over these two games. It’s a huge blow for us.\n“We all know the consequence. We want to be in the Champions League, we aren’t. Europa League is still a prestigious competition but we’ve missed a massive opportunity across these two games.\n“There is a long journey home. There isn’t a lot to say to the players now, they are bitterly disappointed.”\nFor Kairat, the triumph marked a watershed: their first-ever Champions League appearance, and only the second by a Kazakh club since Astana’s debut in 2015.\nThe result capped a historic night for debutants across Europe.\nNorway’s Bodo/Glimt Maiden Spot\nAlso, Norway’s Bodo/Glimt secured a group-stage place despite losing 2-1 at Sturm Graz, progressing 6-2 on aggregate after last week’s emphatic 5-0 home win.\nIt means Norway will field a team in the Champions League proper for the first time since Rosenborg in 2007.\nCyprus’s Pafos FC First-ever Berth\nIn Cyprus, Pafos FC also celebrated a first-ever berth after edging Red Star Belgrade 3-2 on aggregate.\nA dramatic 89th-minute strike from Jaja salvaged a 1-1 draw on the night before the hosts clung on through 10 minutes of stoppage time, sparking jubilant celebrations in the coastal city.\nThe Champions League draw will be held Thursday in Monaco, with the group stage kicking off September 16–18.",
  "word_count": 485,
  "scraped_at": "2026-02-14T01:58:57.509156",
  "_text_extracted": true
}