{
  "article_id": "9dfb494a212a",
  "url": "https://www.sundaystandard.info/gu-paints-botswana-red/",
  "title": "GU paints Botswana red | Sunday Standard",
  "date": "20250609T231500Z",
  "domain": "sundaystandard.info",
  "source_country": "Botswana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2024/25 season will probably go down in the annals of Botswana’s football history as Gaborone United’s Annus Mirabilis.\nFor the first time in Botswana’s sporting history, both the men’s and women’s teams have won their league titles. Buoyed by the double victory GU’s 22 have a spring in their feet as they prepare to represent Botswana in international competitions.\nThe men’s team will take part in the CAF Champions League while the women’s team will compete in the COSAFA regional championship. This is a major achievement for the club and for football in Botswana.\nAfter the women’s team won their semi-final match in the DTCB Women’s National Championship, On Friday, Gaborone United director Nikolas Zakhem spoke to Sunday Standard Sport.\n“We are going for COSAFA and we are going to compete,” said Zakhem. He is confident that the team will go to COSAFA not just to participate, but to compete seriously. In their debut last year, the team reached the finals. This season, after dominating local teams, expectations are high that GU will perform well again in the regional COSAFA competition.\nHe thanked everyone involved in the club’s success. “This is not just one person’s work. It took a team effort from everyone at GU,” he said.\nIf the women’s team wins the national championship, it will be a historic moment — both the men’s and women’s teams will have qualified to represent Botswana internationally in the same season.\nLast year, the women’s team reached the COSAFA finals but lost. Zakhem said the team protested the result, claiming that the match officials were not fair. The protest was sent to COSAFA through the Botswana Football Association (BFA), but Zakhem said they never received a response.\nHe said there is a lot of talent in women’s football in Botswana. “We need to be patient and committed to grow the game,” Zakhem said. “In two or three seasons, women’s football will be strong and will attract more supporters.”\nHe also noted that the teams in the semi-finals had many skilled players who need proper support and development.\nZakhem is one of a few local investors who has helped grow football in Botswana. Since he became involved, Gaborone United has improved and won several trophies.\nHe also leased the BIAC ground and built a football facility there. The GU ground was used by other teams during the league season, which helped the Premier League finish on time. Since he joined the club, GU has become financially stable and more competitive.\nGaborone United’s success this season is a proud moment for the club, its players, and football in Botswana.",
  "word_count": 436,
  "scraped_at": "2026-02-14T02:09:11.427592",
  "_text_extracted": true
}