{
  "article_id": "9e68c68f4cec",
  "url": "https://www.liverpoolfc.com/news/i-will-be-forever-grateful-my-liverpool-story-chris-kirkland",
  "title": "  I will be forever grateful  - My Liverpool Story … with Chris Kirkland",
  "date": "20251216T130000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Feature'I will be forever grateful' - My Liverpool Story… with Chris Kirkland\nIn a new entry to the 'My Liverpool Story' series on Liverpoolfc.com, Chris Kirkland tells the tale of his Reds career in his own words…\nI've always been a Liverpool fan since I was very small. My first game was in 1988 and I was stood on the Kop with my dad when I was just seven years old. We used to get the supporters' bus up from Leicester whenever we could afford it.\nI started off my playing career at Coventry City and I was still young when I first heard of Liverpool's interest in 2001. You can imagine my excitement, being a boyhood Red. I didn't even have an agent at that time! I'd only just broken into the first team. I remember getting a call from Gary McAllister, who had been at Coventry and made the move to Liverpool.\nI'd played against the Reds twice and I recall doing quite well and he obviously said there was strong interest and not to sign anywhere until any decision had been made.\nI was happy where I was even though we'd just been relegated, but it was the lure of Liverpool. I had my bags packed for a few weeks before making the transfer, but it took until the actual deadline for it to go through.\nI remember I was at Highfield Road and Gordon Strachan came to find me and said there had been a bid. I was super-nervous. It wasn't the fact of moving clubs, as I was young and hugely confident in my own ability. It was more leaving home and having that comfort blanket taken away. Fellow goalkeeper Steve Ogrizovic was at the ground at the same time, and he just said to me: \"What are you still doing here?!\"\nIt was all a whirlwind from then. I think I ended up signing about 15 minutes before the deadline officially passed in the end. One of the best things I did on the day was I went and stood on the Kop where I used to watch from at Anfield.\nThere was a bit of back and forth on negotiations, so it dragged on a lot longer that everyone thought. We were a bit worried about whether it had gone through or not! I remember there was an issue with the printer and things like that. Everything you see on deadline day these days is true from my experience. It was carnage!\nIt's funny because I obviously signed on the same day as Jerzy Dudek. Gerard Houllier gave me a call to speak about the situation. He said I'd be coming in to be the backup, and he wanted me to learn from him and push him on and if I did, I'd get my chance. He was true to his word.\nThe most frustrating part of my career at Liverpool was the injuries that I picked up. I got labelled 'injury prone' and while I understand that, I felt I was very unlucky. I had a lot of collision injuries; Dele Adebola at Crystal Palace, Harry Kewell broke my wrist in training, and my back one was just a freak incident. I also broke my finger colliding with Kevin Davies!\nAfter I left Liverpool later, I hardly had any problems, which was annoying because maybe it could've been different. However, as a kid when I was stood on the Kop, if someone had turned to me and said that you'll play nearly 50 times for Liverpool I would've shaken their hand there and then.\nI remember in 2002-03 I had to be patient before I got a run in the team and things were going well until I got that injury in the FA Cup at Palace and did my cruciate.\nIt meant I missed the League Cup final, which was a shame because I had played in every game before that in the competition. Gerard showed his class there because I wasn't in the squad, which meant I didn't get a medal - but he gave me his on the pitch afterwards.\nThe same happened a few years later when I'd played a few games early in the Champions League run to Istanbul in 2004-05. Everyone remembers that famous comeback against AC Milan, but Scott Carson offered me his medal in the same way, though I didn't take that one. It just didn't feel quite right even though it would've been an honour to have it.\nI've spoken openly in the past about having to leave Liverpool after Rafael Benitez came in. The training regime was different, and I just didn't quite fit into that for one reason or another. The club signed Pepe Reina too, so it wasn't a bad swap was it!\nI knew I needed to leave. I signed at Wigan Athletic and went on to have a good career elsewhere, even getting an England cap, which I'm extremely proud of. I actually went to collect my legacy cap at Wembley when they played Wales in October and that was a huge honour for me.\nI've been quite open about my addiction and mental health problems that occurred later in my career and into early retirement. I've actually now written a book about it all. I am over three-and-a-half-years clean and I'm very happy to say I feel in a very steady place currently.\nIt felt important for me to do that and has been hugely therapeutic – if the book was just about my football career I don't think I would've done it. My biggest thing is that I hope that in being open and talking about these things it may help other people, who are battling their own issues with whatever they may be. My wife and my daughter have been my rocks throughout it all.\nMy role with the LFC Foundation as a community ambassador has been crucial too, along with being an honour, it is something I don't take for granted. I love the city. We are not from here, but I have lived on Merseyside for nearly 25 years now and it is proudly our home. I love being able to give back in whatever little way I can.\nIt also gives me something to get up for in a morning and a structure to my week too and that has been vital for me in helping battle my own issues away from the game. I want to give a shoutout to all the unsung heroes at the Foundation – the work they do is incredible and they often don't get the recognition they deserve.\nI've been offered ways back into football before but because I love the role too much I've said no, as it would have to stop in that scenario. I do a lot of talks around mental health and addiction and the struggles I faced and tried to hide away for a long time.\nI can't speak highly enough of the club and the Foundation for all their support in the last few years since deciding to tell my own story. When I told them about my problems back in 2019, they just did everything they could to help me. To have that from them at that time was exactly what I needed because while I felt I wanted to be open and honest with the world, I was also petrified at the reaction that was going to follow.\nThe way the club handled everything gave me the biggest boost and knowing I had their support has been a big part of where I am today. I'm very happy with where I am now. I still have down days, I think we all do, but I know those days will pass and I don't look for an escape anymore.\nLiverpool played a huge role in my playing career – but perhaps they were even more key off the field with their help and understanding. And for that I will be forever grateful.\n- Keeping It Quiet - The Chris Kirkland Story is out now",
  "word_count": 1355,
  "scraped_at": "2026-02-14T02:03:26.510914",
  "_text_extracted": true
}