{
  "article_id": "9e821d7606f3",
  "url": "https://english.aawsat.com/home/article/4215596/real-madrid-beats-liverpool-reach-champions-league-qf",
  "title": "Real Madrid Beats Liverpool to Reach Champions League QF",
  "date": "20230316T150000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There was no historic comeback for Liverpool. Real Madrid's title defense in the Champions League rolls into the quarterfinals.\nLiverpool never really came close to overcoming its three-goal deficit from the first leg against the titleholders at the Santiago Bernabéu Stadium on Wednesday, losing 1-0 to end its hopes of another run to the final.\nKarim Benzema scored late and Madrid advanced to the last eight for the third straight season with a 6-2 aggregate score following a 5-2 win from the first leg in England, when it rallied from two goals down early in the first half.\nLiverpool was trying to pull off something never done before in the Champions League — erase a three-goal loss as a visitor. Only five times the team that lost at home rallied in the second leg in Europe's top club competition.\n“You needed a special performance and we didn’t show a special performance,” Liverpool manager Jurgen Klopp said. “In moments, it was a good performance, but Real Madrid was the team in control the whole game. Madrid was the better team and deserved to advance.”\nThe only time Madrid failed to advance in the Champions League after winning the first leg on the road was in 2019, when it was eliminated by Ajax in the round of 16. It had won six of its last seven matches against Liverpool in the tournament, drawing another.\n“It was the type of match we wanted,” Madrid coach Carlo Ancelotti said. “It was difficult for them to press up front. The team played well, it was focused from the start.”\nNapoli defeated Eintracht Frankfurt 3-0 in the other round-of-16 match on Wednesday to join Madrid, AC Milan, Bayern Munich, Benfica, Chelsea, Inter Milan and Manchester City in the draw for the quarterfinals on Friday.\nBenzema scored from close range after a pass by Vinícius Júnior in the 79th minute. The France striker, who had missed Madrid’s Spanish league win against Espanyol last weekend because of an injury, has scored 13 goals in his last eight Champions League knockout stage matches. He limped during the goal celebration but said afterward it was just a knock.\n“It was a complicated match, against a good opponent,” Benzema said. “We showed from the start that we wanted to attack, so it was a good match for the fans and we are into the quarterfinals.”\nLiverpool came out with an attack-minded lineup and showed its intentions early, with Darwin Núñez forcing Madrid goalkeeper Thibaut Courtois to make a tough save on a breakaway seven minutes into the match.\nIt was an open match at the Bernabéu and Madrid had its chances as well, with Eduardo Camavinga coming close to scoring in the 20th with a shot from outside the area that struck the crossbar after a deflection by Alisson Becker. The Liverpool goalkeeper also stopped a chance by Madrid forward Vinícius Júnior in the first half and another in the second in a one-on-one situation with midfielder Federico Valverde.\nKlopp kept trying to push his team forward from the sideline, but as the minutes passed it became clear it wasn’t going to be enough for the English team.\nLiverpool had managed a big comeback at home in the 2019 semifinals, rallying against another Spanish club, Barcelona. It won 4-0 after losing 3-0 at the Camp Nou to keep alive a run that eventually ended with the team winning the trophy.\nMadrid, which had beaten Liverpool in last year's final, played in its 300th Champions League game.\nThe loudspeakers at the Bernabéu played Liverpool’s “You’ll Never Walk Alone” anthem at the end of the match as fans from both clubs applauded.\n“We are two heavyweights who meet each other quite frequently in international football and quite clearly we respect each other a lot,” Klopp said. “It was a really nice gesture, absolutely.”",
  "word_count": 640,
  "scraped_at": "2026-02-14T02:16:40.070611",
  "_text_extracted": true
}