{
  "article_id": "9e84a114a4cb",
  "url": "https://www.nytimes.com/athletic/6676495/2025/10/01/barcelona-camp-nou-fans-players-coaches/",
  "title": "What Barcelona fans , players and coaches think about the constant Camp Nou chaos",
  "date": "20251001T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Champions League is back in Barcelona, but not where the club wanted it to be.\nBarca had planned for tonight’s match with Paris Saint-Germain to be played at the Camp Nou. Instead, the team is back at the Estadi Olimpic Lluis Companys, their temporary home over the past two seasons, with the re-opening of their iconic home ground now almost a year behind schedule.\nAdvertisement\nThe continual delays have led to many embarrassing moments, the most recent coming last Tuesday, when, after Barca officials told the media the Camp Nou was ready, the Barcelona city council arranged a press conference of their own in reply.\n“Just because the stadium isn’t finished doesn’t mean it isn’t safe,” vice-president Elena Fort had claimed that morning. “The Spotify Camp Nou is the safest stadium in all of Spain. You can play in the stadium.”\nA few hours later, city officials entirely contradicted that statement, and we still don’t know for sure when Barca can realistically expect to be back there — even though they insist they are close, as they have been for months now.\nBarcelona’s messaging and management around their Camp Nou return has been chaotic, to say the least. The club has been saying since the summer that the stadium only requires a few finishing touches for it to re-open at a reduced capacity of about 27,000.\nBut many deadlines have been missed, and several emergency measures have been taken, as a result. It has meant the club has not been able to sell any season tickets yet for this campaign, and two home games have had to be hastily arranged at the 6,000-capacity Estadi Johan Cruyff by their training ground.\nThat has meant a big drop in matchday revenue, but playing at the 55,000-capacity ground on Montjuic also costs the club money. Fort put the figure at between €300,000 and €900,000 per game — on top of the €41million (£35.8m; $48.1m) they invested in the venue over the past two seasons, in order for it to host football matches.\nThe Camp Nou rebuild is part of the Espai Barca Project, which also includes some improvements and construction to the area surrounding the stadium. It is the biggest and most expensive project the club has ever undertaken, with costs currently estimated at €1.4billion. Barcelona’s most recent published accounts put their total debt at €2.4bn.\nAdvertisement\nYou might reasonably expect for all this uncertainty, disorder and debt to have been met with fan protests. Well, that’s not really been the case at all. And there are interesting reasons that help to explain why.\nBarcelona’s fanbase is unique.\nFirst of all, it is the socis (members) who actually own the club. In June 2024, their official number was 133,164, with 50,797 living in the city of Barcelona, 70,201 in the rest of Catalonia, and 12,166 in the rest of the world.\nBarca’s history, which made them a bastion of the Catalan culture and language that was repressed in the Spain of General Francisco Franco, is still reflected in fans’ thoughts and feelings towards the club.\nYou might think that, if anything, those members should be even more invested in the club’s management, more ready to noisily react when things start to go wrong. But in fact, a large proportion often remain more distant than that, despite the depth of the bond.\nIt’s something of a paradox, because FC Barcelona is always a hot topic in the city, if not the hottest. But just as the connection is meaningful, it is also fluid and might even seem casual in other respects. For example, over the past two seasons Barca spent at the Estadi Olimpic, only 16,151 season ticket holders signed up for a seat at the stadium. In the 2022-2023 season at the Camp Nou, there were 82,000.\nWhen Barca played at the Estadi Johan Cruyff in September, those 16,151 members were the only ones able to buy tickets at the 6,000-capacity ground. It meant there was a unique opportunity to canvass opinion, and The Athletic spoke to several supporters to get their thoughts on all the drama around the Camp Nou.\n“I didn’t like how the communications have been handled,” said Martina Perez. “The empty promise to return at the Camp Nou for the Joan Gamper pre-season trophy (on August 10), now not knowing where we really play. Plus the members, we don’t know how much this season is going to cost yet, or if I will be in a position to apply for a seat or not.”\nAdvertisement\n“I would love to play at the Camp Nou to feel like you’re back at home,” said 35-year-old Oriol Mora. “I think the club is trying to be back as soon as possible, firstly from a financial standpoint and what it means to the club, but then there’s also a reputational element.”\n“I’d prefer to spend another year on Montjuic and finish the Camp Nou, rather than trying to be back but not knowing when,” said 33-year-old Marcal Riu.\nDionis Clusellas, 66, said: “It is not ideal to be here, but it’s what we have to do.”\nAll the fans we spoke to had complaints about the delays, but their feelings of frustration were balanced by understanding, compromise and even resignation on the subject. In general, they were all just, most of all, happy to have got tickets for the game.\nThe overriding mood among the Barca fanbase right now is positive, and perhaps that should not come as a surprise. Despite all their problems off the pitch, Barcelona seem to be going from strength to strength under Hansi Flick.\nLast season, they won a domestic treble, beat their Clasico rivals Real Madrid four times and reached the Champions League semi-finals. They have arguably a stronger squad this term, having invested wisely to bolster a squad led by local talent Lamine Yamal — and with more coming through their La Masia youth academy.\nThe fundamental truth is that, so long as things work out on the pitch, what happens off it will not matter too much — unless it really is too big to ignore.\nThat was the case back in 2021, when Barca’s biggest star Lionel Messi sent the club’s board a registered fax asking to leave. Social pressure on the executives was so high that Josep Maria Bartomeu stepped down as president. It is fair to say the team was also not performing as expected.\nHis successor Laporta is, overall, a very popular figure in Barcelona, because he’s played a key role in assembling the best teams in the club’s modern history. From Ronaldinho’s team, to the Pep Guardiola era, to Flick and Yamal now. His decisions can be questioned, or look too focused on the short-term, but he still has strong support among fans.\nThat position of strength means, in the local media, the messaging can often be shaped to the club’s advantage. As a result, there are many Barca fans, and Laporta supporters, who believe that local institutions are not making it easy for them to return to the Camp Nou. Those at the city council find these suggestions baffling.\nAdvertisement\nAs things stand, it is difficult to see the Camp Nou drama having a hugely negative impact on Laporta’s popularity before the next presidential elections in 2026… unless things get significantly uglier in the coming months.\nBut what do the players and coaching staff think?\nThe truth is that Barca’s players really do not seem to care too much. Yes, they all want to be back at the Camp Nou as soon as possible, and to play in front of big crowds, but they know they’ll have to turn up wherever they are needed each week and perform at the required level.\nMultiple dressing-room sources — who preferred to speak anonymously as they did not have permission to comment publicly — acknowledge how ridiculous the situation has turned out to be, but they also feel that they can’t really do anything to change it.\nBarca players have perhaps even become used to operating in such unusual and uncertain circumstances — just look at last season’s registration drama around Dani Olmo, or when Marc-Andre ter Stegen was stripped of the captaincy in August.\nThat goes for the coaching staff, too. This pre-season, the tour of South Korea and Japan was almost cancelled the day before they were due to fly. The Camp Nou drama is seen as another situation they are forced to adapt to.\nThe feeling is that players’ performances have not been too badly impacted, and that the connection between the fans, the squad and the coaching staff is very strong at the moment, regardless of where they play home games.\nAgain, a poor run of form would change that feeling, but Flick and his team have been the bulletproof shield for Laporta and the club, and if results were to change, so too would the experience at the top.\n(Top image: Getty Images. Visual design by Kelsea Petersen)",
  "word_count": 1502,
  "scraped_at": "2026-02-14T02:26:56.617101",
  "_text_extracted": true
}