{
  "article_id": "9eba4b90f090",
  "url": "https://www.90min.com/posts/4-things-we-learned-arsenal-4-1-thrashing-newcastle-24-2-24",
  "title": "4 things we learned from Arsenal 4 - 1 thrashing of Newcastle",
  "date": "20240225T173000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "4 things we learned from Arsenal's 4-1 thrashing of Newcastle\n- Newcastle were blown away by Mikel Arteta's in-form side on Saturday\n- Arsenal moved to within two points of leaders Liverpool\n- The Gunners have the best goal difference in the division\nEddie Howe provided a blunt but accurate summation of Newcastle United's 4-1 thrashing at the hands of Arsenal on Saturday evening. \"They played well, we played poorly.\"\nTino Livramento helped Arsenal on their way by firing the ball into Newcastle's net off his teammate Sven Botman inside the opening 20 minutes...but that was merely the consequence of a suffocating start for the hosts. Kai Havertz soon doubled Arsenal's lead before Bukayo Saka and Jakub Kiwior completed the rout after the break.\nHale End graduate Joe Willock nabbed a late consolation for the visitors, which didn't stop Howe from sighing: \"We were off.\"\nHere are the key takeaways from a night that saw Arsenal most certainly turn it on.\nRevenge is powerful motivation\nFootball fans may have short memories but players find things harder to forget - particularly any perceived injustices.\nArsenal's first league defeat of the season was a narrow 1-0 loss away to Newcastle decided by a hotly controversial Anthony Gordon goal. Unprompted, Arsenal skipper Martin Odegaard cited that November reverse after Saturday's victory as a source of \"extra motivation\".\n\"We had that fire inside us,\" he grinned.\nThere was nothing spurious about Arsenal's Champions League defeat to Porto on Wednesday (aside from David Raya's goalkeeping) but the Gunners tore into Newcastle with some wrongs to right.\n\"I could sense it from the moment we were in Porto that we were ready for the game,\" Mikel Arteta said, enamoured by his side's emphatic reaction. \"We wanted the game the next day because we could have done so much better there.\"\nWhile Arsenal didn't attempt a single shot on target against Porto, frustrated by their wily hosts but hampered by their own hesitancy just as much, they laid siege to Newcastle's goal.\n\"In sport things happen,\" Arteta shrugged, \"so you have to learn from that. If you feel sorry for yourself for three days what happens?\"\nJorginho elevates Arsenal\nArteta doesn't have many selection decisions to make each weekend but Jorginho is one of the few figures capable of breaking into the starting XI.\nThe 32-year-old began on the bench for Arsenal's trip to Porto in midweek, prompting Ben White to invert from full-back and shackling Declan Rice with the responsibility of picking through the opposition blockade. Jorginho couldn't get into the rhythm of the contest after coming on in the final 20 minutes but has repeatedly proven how instrumental he can be from the first whistle this season.\nCapable of keeping a cool head while conducting a furious press, Jorginho was mesmeric in the middle. The same was true in his previous start; Arsenal's commanding 3-1 victory over Liverpool earlier this month.\nSlotting into the base of midfield, Jorginho allows Rice to step up the pitch, covering the same prodigious amount of ground but closer to goal. Arsenal robbed Newcastle of possession in the final third 11 times in the first half alone.\nAt this point in his career, Jorginho cannot be fielded in every fixture, but his ability to deliver when called upon has not gone unnoticed. \"He was magnificent today,\" the Arsenal boss noted, \"again.\"\nBukayo Saka is in a class of his own\n\"No comment,\" Saka smirked, resisting any urge to weigh in on the tiresome debate of whether he is 'world class' or not. (He quite clearly is.)\nTino Livramento would certainly attest to Saka's enduring quality. Howe gave in to the growing demands to remove an increasingly cumbersome Dan Burn from the firing line after a series of chastening performances. Yet, the younger and swifter Livramento was tossed about in the tumble dryer that is trying to mark Saka.\nSince the winter break forced Arteta to give his star pupil a well-deserved rest, the 22-year-old has stormed into the new year with a rejuvenated air. Saka's crisp strike to kill the game off after a brief fightback from the Magpies at the start of the second half was his seventh goal in five games. Ian Wright was the last Englishman to find the net in as many as five consecutive top-flight games for the Gunners back in 1994 - seven years before Saka was even be born.\nA slightly more pared-back, streamlined approach has underpinned Saka's hot streak - less shimmies, more shots. Livramento had been tormented by Saka for 72 minutes before Howe turned to Burn to spare the youngster any more agony.\nSolid foundations underpin everything\nArsenal's startlingly prolific start to the new year invariably catches the eye. The Gunners have racked up 25 league goals in 2024 - Manchester United can boast just 36 across the entire campaign.\nHowever, the staunch defensive resolve prevalent throughout the campaign has been just as critical. Arsenal denied Newcastle a single shot in anger throughout the first 45 minutes - the first time the Magpies have failed to register an attempt by the half-time break in a decade.\nThis parsimony is nothing new. Arsenal have given up chances worth a combined 2.2 xG across six games in 2024. City have the next-best defensive record in the division over the same period but have shipped 7.0 xG (per UnderStat).\nWith the door bolted at the back, Arsenal have the confidence to go in search of that all-important opening goal - which was forced over the line from yet another set-piece on Saturday. Since the first day of 2022, Arsenal have lost just one Premier League game in which they've taken the lead.\n\"We're in a good moment,\" Arteta beamed post-game. \"Things are flowing.\" But a rock-solid backline ensures that Arsenal are in every match even when the attack isn't quite so fluent.",
  "word_count": 979,
  "scraped_at": "2026-02-14T01:56:44.618675",
  "_text_extracted": true
}