{
  "article_id": "9ebe32ac2efa",
  "url": "https://www.empireofthekop.com/2024/10/10/slot-hughes-orkun-kokcu-transfer-plea-liverpool/",
  "title": "Arne Slot urges Richard Hughes to land Orkun Kokcu for Liverpool",
  "date": "20241010T181500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot has implored Richard Hughes to secure the services of a playmaker from Europe for Liverpool.\nWhile the Reds have enjoyed a tremendous start to the campaign under the new head coach, squad depth could become an issue as the season progresses, as highlighted by the hamstring injury to Alisson Becker and ongoing concerns over Alexis Mac Allister.\nThe Dutchman is duly eager to reinforce from a position of strength, and he’s given the sporting director one name in particular to prioritise ahead of the next transfer window.\nVOTE for Empire of the Kop as Best Club Content Creator (Premier League) here: Football Content Awards\nOR on X with the FCA’s one-click X link with:\nI am voting for @empireofthekop in @The_FCAs for #BestClubContentCreator (Premier League)\nSlot issues Kokcu transfer plea\nAccording to Portuguese outlet Record, Slot has instructed Liverpool chiefs to do everything in their power to sign Orkun Kokcu in January.\nThe 46-year-old previously worked with the Benfica playmaker during their mutual time at Feyenoord before his €25m (£20.9m) move to Lisbon in June 2023, and his name already appears to be on the radar at Anfield.\nThe report adds that a scouting delegation from LFC was sent to the Estadio da Luz last week to watch him in action as Benfica thrashed Atletico Madrid 4-0 in the Champions League, with one of the goals coming from the 23-year-old.\nHowever, the Primeira Liga giants will only sell him if they reap a substantial profit, placing an €80m (£66.9m) price tag on the Turkiye international, who has a whopping €150m (£125.5m) exit clause in his contract, but those demands are thought to be an impediment to Liverpool’s interest in him.\nKokcu’s perfomance figures are hugely impressive\nKokcu has had a splendid start to the season for Benfica, with four goals and three assists in nine matches across all competitions, needing to score only thrice more to match his entire goal tally from last term (Transfermarkt).\nHis underlying performance metrics are also hugely impressive. As per FBref, he ranks among the top 3% of midfielders outside of Europe’s five main leagues for non-penalty goals, non-penalty xG, shots, assists and shot-creating actions per 90 minutes over the past year.\nThat points to a player who can be massively influential in the final third and would almost certainly make Liverpool even more formidable in attack, getting in on the action himself in addition to loading the ammunition for the forward line to score.\nWhile signing players with whom a coach has worked before is no guarantee of success – just look at the ex-Ajax contingent that Erik ten Hag has brought to Manchester United – Slot seems convinced that Kokcu would be a perfect addition to the current Reds setup.\nHughes’ first transfer window as LFC sporting director was a largely quiet one, but will he push the boat out for a potential marquee signing in January in the Benfica playmaker? The head coach certainly appears to have made his feelings clear!",
  "word_count": 501,
  "scraped_at": "2026-02-14T01:49:08.088000",
  "_text_extracted": true
}