{
  "article_id": "9ec1defde3f6",
  "url": "https://www.arsenal.com/news/every-word-mikel-artetas-pre-psg-presser",
  "title": "Every word from Mikel Arteta pre - PSG presser",
  "date": "20240930T143000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With the dust barely settling on Saturday's dramatic 4-2 win over Leicester City, Mikel Arteta was back in front of the media to talk about our Champions League clash against Paris Saint-Germain.\nEveryone gathered at the Sobha Realty Training Centre to hear the boss discuss facing his former club, injuries, winning in any context and much more.\nHere is everything he had to say:\non injuries:\nNo news, we have a training session this afternoon and we have to review a few players, but overall, especially [anyone] returning, there’s nothing to give back.\non our first home Champions League game this season:\nWe're looking forward to it. These are the kind of nights that we want to experience and want to have against an unbelievable opponent. We’re just ready for it.\non showing different ways to get results this term:\nWe’ve had some very different ones! We ended up having to play a very different game in the second half against Man City, and in the end we lost two points in the last minute. We did completely the opposite playing against a low block like we did against City and with different challenges, but watching the game back, the amount of things that we generated, I was so pleased with the team.\non whether Ben White and Riccardo Calafiori are fit:\nThose are the two players that are in contention and we have to review today. We didn’t do any training sessions yesterday, [Riccardo] was a bit emotional after the game, so let's see how he is today.\non his time at PSG as a player:\nIt was my first professional experience. It was an unbelievable time that I spent there and I loved every minute of it. I will always be grateful to the club and Luis Fernandez because he was the one who believed in me when I was 17, 18 years old. I played professional football and from there it was a platform to share an experience in a club of that size and a city that is probably the most beautiful in Europe. It was an experience that will stay with me forever, with teammates who helped me and shaped who I wanted to be as a player, and ignited something in me to become a manager in the future. There were some very important individuals in that part of my career.\non why he didn’t stay there:\nRonaldinho, Anelka, Okocha, Pochettino, Gabriel Heinze were all unbelievable players. I wanted to stay there but I was at that moment owned by Barcelona and they didn't find an agreement and then I had to do something else. I was so happy there, I wanted to stay there but in the end, I had to do something. This is football.\non whether he was ever close to going back:\nOnce I was here, my career started to develop and it's been a few years since then.\non the momentum winning games like against Leicester:\nIt shapes the character and the body of the team, that they have the certainty that they can win in any context and adapt to very different contexts during matches. The Champions League demands that, you can pretend to play against this kind of opposition and dominate for 95 minutes but it does not happen at this level so you have to be really good in other phases as well - to stay in the game, to be comfortable and still always have the belief and intention to win it.\non Champions League nights at Emirates Stadium:\nEverybody is looking forward to it. We missed it for a number of years, and last year was the first one after so many years that we had the experience to do it. The group stage is a bit different this season and the opposition we are going to face tomorrow is probably at the highest level that you can face in European football. But honestly, it’s a good opportunity for us to see how we deal with these nights, how prepared we are and how we can impose ourselves in this kind of context.\non his relationship with Luis Enrique:\nA smile on my face! I’m a huge admirer of him. An unbelievable personality, huge character, huge energy, always very supportive with young players. What I love about him is wherever he’s been, as a player or a manager, his fingerprints are all over the place. You can sense it’s his team the way his players behave, the way they want to attack and dominate games. The spirit, the energy they have, he has this unbelievable power with all the clubs he’s been at, with the Spain national team. And then his approach to life, to his profession – it’s something to really look at and I learnt a lot of things from him.\\\non whether Enrique has influenced him:\nI admire his honesty. He’s straightforward – he will look in your eyes and tell you what he thinks. In the end, players appreciate that. They might like it more or less, depending how it happens, but I have had two or three players here who were with him in the national team, and they always said the same thing. They all enjoy playing under him. When somebody can make you feel like that in this profession, it’s a big quality to have.\non Timber and Calafiori bringing something new to the full-back position:\nWe missed Jurrien for 11 months and Ricky wasn’t here. They are two players that have a football brain, the intelligence, the quality and adaptability to occupy different spaces whether attacking or defending. That gives the team a different dynamic and makes it unpredictable for the opponent to defend certain ways. Both are huge personalities too which I love.\non whether the full-backs all have different qualities:\nThey have to have one in common – they have to love defending first. Because they are defenders, then after that they have qualities to add, that’s great. As well playing full back’s natural foot, especially when we play inverted attacking midfielders or wingers many times, for the flow of those units, it’s incredibly important and you can see that.\non Timber’s character off the pitch:\nHe's a leader, a guy that is constantly thinking: ‘how can I help others?’ He's brought unbelievable commitment to everything he does, in the time he’s been with us, especially the amount of time he spent off the pitch. For everybody to speak so highly of him, to respect him and look at him in the way that they do will tell you the story of the personality we have in that team.\non slowly introducing Timber into the team:\nJust to get him in his shoes. He came from Ajax, he was a captain there. Big move, different country. He came here with big expectations, started really well and then got injured in the first game. And then what? You have to look ahead… eight, nine, 10, 12 months maybe. It was a difficult period and it can feel very lonely and far from the expectations that you had, and this can be very disappointing and very difficult to handle personally and emotionally. He did the complete opposite, he started to build unbelievable relationships with physios, with his teammates. He started to gather all the information about how we were playing, he was in every meeting and that really helped him to develop himself as a person and also to understand what we wanted in a much better way and be prepared for when he was back.\non how highly he rates PSG:\nThey're really tough. They are exceptional and they dominate every phase of play. They have a very clear intention of how they want to dominate the game through the ball and when they don’t have it, they want it straight back. They are really aggressive with it and they confront you.\non how important the game is, and facing Enrique:\nOf course, we want to win the game and we know after the draw in Atalanta, with the number of games we have left still, it’s going to be really important. Nothing is going to be decided tomorrow. Regarding Luis and I, we want to do the best for our clubs. He’s won pretty much every competition you can imagine already in his career, he has transformed a club that has a very clear identity. It’s a very good test for all of us.\non what he has been impressed about with Calafiori:\nHow willing he is. The moment I spoke with him on the phone for the first time, he wanted to come here. He understood what we wanted straight away and he felt that he was going to be a perfect fit here and he was. He landed with the biggest smile on his face. He’s got this energy and aura around him. He’s very likeable and he’s a fighter, a player that wanted to play in the way we want to play and he’d do anything for the team. When you have those qualities, a lot would have to go wrong for you not to succeed.\non whether he has a special relationship with him:\nWith all the players, we try to give them and their families the best possible environment to fill in the best way. I think he appreciates the effort that the club and staff have made since his arrival to make his life as good as possible and I think he’s enjoying it.\non Ousmane Dembele possibly not being in the PSG squad:\nWe just got the news and we don’t know if it’s true or not. We’re going to prepare like we always do with every possibility and let’s see. They have many other options.\non whether our set pieces could be an advantage:\nI think every team has their own strengths and weaknesses and tomorrow we will try to exploit ours for sure.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1695,
  "scraped_at": "2026-02-14T02:11:06.639236",
  "_text_extracted": true
}