{
  "article_id": "9ed5b0275c76",
  "url": "https://metro.co.uk/2025/10/21/mikel-arteta-hails-four-arsenal-players-atletico-madrid-thrashing-24488770/",
  "title": "Mikel Arteta hails four Arsenal players after  tough  win over Atletico Madrid",
  "date": "20251021T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has singled out four Arsenal players for praise after his side thrashed Atletico Madrid 4-0 in the Champions League on Tuesday.\nGabriel Magalhaes opened the scoring from Declan Rice’s set-piece with Gabriel Martinelli doubling the lead before Viktor Gyokeres netted twice.\nMyles Lewis-Skelly produced an impressive performance with the teenage left-back conjuring up a beautiful assist for Martinelli on 64 minutes.\nArteta hailed Lewis-Skelly along with Martinelli, Gyokeres and Rice in his post-match interview on Amazon after the full-time whistle at the Emirates.\n‘That’s him, that’s his quality,’ Arteta said about Lewis-Skelly’s assist. ‘The way he carries the ball, the ability he has to release the ball in the right moment.\n‘Martinelli as well, I thought he was superb today. It’s really good to see the impact they had on the team.\n‘[I am] delighted [for Gyokeres] as he fully deserved it. The workrate he brings to the team is outstanding.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We value a lot of things that he does for the team and it was the biggest smile on his face today and look at his team-mates.\n‘Hopefully this is the start of some beautiful sequences.\n‘[Rice’s set-piece delivery] was superb. We could have scored in the first half – but [we] have that ability to score those types of goals.’\nArteta: It was a tough match\nSpeaking more generally about his team’s victory, Arsenal boss Arteta added: ‘It was a tough match.\n‘After the goal they opened up a bit and it was a little easier for us to find the spaces. Very happy with the result.\nMore Trending\n‘At this level in the Champions League you really need to step up and we certainly did that in every phase of the play. Very happy.’\nAsked about building belief with the Arsenal fans, Arteta continued: ‘[These results] create a better cohesion between ourselves and our supporters.\n‘Belief is huge in sport. Let’s focus on Sunday [against Crystal Palace] now.’\nGyokeres: I am very pleased!\nArsenal striker Gyokeres, meanwhile, said: ‘I am very pleased… Both [my] goals were great. I try to do my best all the time and work hard, contribute with different stuff and the goals would have come sooner or later.’\nMORE: Antonio Conte admits Napoli ‘mistake’ after Rasmus Hojlund and Kevin de Bruyne transfers\nMORE: ‘Dangerous player’ – Pep Guardiola praises Arsenal flop after Manchester City beat Villarreal\nMORE: Jose Mourinho names ‘best player on the pitch’ as Newcastle United beat Benfica",
  "word_count": 463,
  "scraped_at": "2026-02-14T01:59:14.388372",
  "_text_extracted": true
}