{
  "article_id": "9ef89e4eebe6",
  "url": "https://menafn.com/1107917486/Pogbas-Career-In-Jeopardy-As-France-Star-Handed-Four-Year-Doping-Ban",
  "title": "Pogba Career In Jeopardy As France Star Handed Four - Year Doping Ban",
  "date": "20240229T220000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pogba's Career In Jeopardy As France Star Handed Four-Year Doping Ban\nFrance star Paul Pogba has been given a four-year ban from football by Italy's anti-doping tribunal after testing positive for testosterone last August, his club Juventus said on Thursday.\nA spokesman for the club told AFP it had been notified of the decision against the 30-year-old World Cup winner, who had been provisionally suspended in September.\n\"We received notification from the tribunal this morning,\" the spokesman said. Italy's anti-doping body did not immediately respond when contacted by AFP.\nA source close to Pogba confirmed to AFP that he would appeal the ruling, which risks bringing a premature end to his career.\nIt means Pogba will not be able to play again until the 2027/28 season, by which time he will be 34.\nAnti-doping prosecutors had called for the four-year ban to be imposed on the former Manchester United midfielder, who tested positive following Juventus's opening match of the Italian Serie A season against Udinese on August 20, during which he was an unused substitute.\nA month later a B sample confirmed the presence of testosterone, and he has been provisionally suspended since.\nPogba's representatives said the testosterone came from a food supplement prescribed by a doctor he consulted in the United States.\nThe ban could have been limited to two years if Pogba had been able to prove he was not at fault, or even just a few months if the use of the substance took place \"out of competition and (was) not related to his level of performance\".\nPogba, who returned to Juventus for a second spell in 2022 after six years at United, was a key member of the France team that won the World Cup in Russia in 2018, scoring in the final against Croatia.\nHis positive doping test came as he was trying to put behind him a difficult first season back at Juve, in which he struggled with fitness problems and made just 10 appearances, while also missing France's defence of the World Cup in Qatar due to injury.\nHe made two substitute appearances for Juventus at the start of this campaign before being suspended.\nHis contract at Juventus, worth a reported eight million euros ($8.7 million) a season, runs until 2026.\nHowever, he has been unable to train since the announcement of the positive test and Juve have suspended payment of his salary.\nPogba made just a handful of appearances in his first spell in England before becoming a star at Juve between 2012 and 2016.\nIn that time he won four straight Serie A titles and played in the Juventus side that lost to Barcelona in the 2015 Champions League final.\nHe returned to United in 2016 for 105 million euros, a world record fee at the time, and won the Europa League and League Cup in his first season back, playing under Jose Mourinho.\nPogba has won 91 caps for France, and played in the team that got to the final of Euro 2016 before their World Cup triumph two years later.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 567,
  "scraped_at": "2026-02-14T02:13:34.134259",
  "_text_extracted": true
}