{
  "article_id": "9f0d0e27d238",
  "url": "https://www.nytimes.com/athletic/5952020/2024/12/04/club-world-cup-2025-explainer/",
  "title": "Club World Cup 2025 : What is it , who is competing and how to watch the draw",
  "date": "20241204T194500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The draw for the revamped FIFA Club World Cup being held in the United States next year takes place in Miami on December 5.\nA prelude to the 2026 World Cup hosted on the same continent across the U.S., Canada, and Mexico, FIFA hopes to make the competition a more significant part of the footballing calendar. The world governing body has changed the format from an annual seven-team tournament to a 32-team event held every four years.\nAdvertisement\nInter Miami were controversially granted a host nation spot, which means Lionel Messi is set to feature, and the Argentine great could find himself coming up against familiar foes Real Madrid, who are among the European giants taking part, alongside Manchester City, Bayern Munich, Chelsea and others.\nHow can I watch the draw?\nThe live draw, which will determine each group, will start at 1pm ET (6pm GMT) in Miami and can be watched live on DAZN after it was announced on Wednesday that the digital streaming platform will broadcast all 63 Club World Cup matches.\nGO DEEPER\nFIFA agrees Club World Cup broadcast deal with DAZN\nWhat is the Club World Cup?\nThe Club World Cup used to take place every December and was contested by the winners of the six continental club competitions, as well as the host nation’s domestic league champions. It featured a team from each of FIFA’s confederations: the winners of the AFC Champions League (Asia), CAF Champions League (Africa), CONCACAF Champions League (North America, Central America and the Caribbean), Copa Libertadores (South America), OFC Champions League (Oceania) and UEFA Champions League (Europe).\nThe new competition follows the 32-team format from the old FIFA World Cup. Teams will be drawn into eight groups of four, with each side playing their group opponents once. The top two of each group will progress to the round of 16 and from there it will be single-match knockouts through to the final.\nFIFA’s Intercontinental Cup replaces the annual Club World Cup and will see the UEFA Champions League winner (Real Madrid this year) face the winner of the FIFA Challenger Cup, a team who will have come through intercontinental play-offs, for a one-off match. Qatar will host this year’s final on December 18.\nWho will be competing?\nOf the 32 places, 31 have been filled with clubs qualifying via either a ranking pathway based on performances over a four-year period or by winning continental titles between 2021 and 2024. The only exception is Inter Miami, which we will come to later.\nAdvertisement\nFor example, Chelsea have qualified as the 2021 UEFA Champions League winners, despite finishing sixth in the Premier League and failing to win a trophy last season.\nFIFA’s two-club limit on teams from a single country — except if more than two clubs from the same country had won the Champions League — meant some of Europe’s more renowned teams, such as Barcelona and Liverpool, missed out even though they were ranked higher on the pathway than, for example, Austria’s Red Bull Salzburg.\nThe 32 teams will be split into four pots to “ensure competitive balance and geographical diversity”, according to FIFA.\nPot 1 will be an even split of the highest-ranked teams from Europe and South America, with Pot 2 containing the remaining eight European teams. The two highest-ranked teams from the AFC, the CAF and CONCACAF will be in Pot 3, which is completed with the other two South American teams. That leaves Pot 4, which will have the remaining teams from Asia, Africa and the North America, Central America and Caribbean region, plus Oceania’s sole representative and Inter Miami, who are representing the hosts.\nPot 1: Manchester City (England), Real Madrid (Spain), Bayern Munich (Germany), Paris Saint-Germain (France), Flamengo (Brazil), Palmeiras (Brazil), River Plate (Argentina), Fluminense (Brazil).\nPot 2: Chelsea (England), Borussia Dortmund (Germany), Inter (Italy), Porto (Portugal), Atletico Madrid (Spain), Benfica (Portugal), Juventus (Italy), Red Bull Salzburg (Austria).\nPot 3: Al Hilal (Saudi Arabia), Ulsan HD (South Korea), Al Ahly (Eygpt), Wydad (Morocco), Monterrey (Mexico), Leon (Mexico), Boca Juniors (Argentina), Botafogo (Brazil).\nPot 4: Urawa Red Diamonds (Japan), Al Ain (United Arab Emirates), Esperance de Tunis (Tunisia), Mamelodi Sundowns (South Africa), Pachuca (Mexico), Seattle Sounders (United States), Auckland City (New Zealand), Inter Miami (United States).\nAdvertisement\nWhere will the competition take place?\nThe opening game will be held at Miami’s Hard Rock Stadium on June 15 and the final at MetLife Stadium in New Jersey — where the 2026 World Cup final will be held — on July 13.\nWhy did Inter Miami’s inclusion raise eyebrows?\nThe host nation was given a club representative in previous Club World Cups, and the 2025 edition will take a similar approach. However, in the past, the extra place was awarded to the champions of the host nation’s top league.\nInter Miami will not be the 2024 national champions in the United States but have qualified for the Club World Cup by winning the 2024 Supporters’ Shield, awarded to the MLS team with the best regular-season record.\nThe winners of the MLS Cup, a play-off tournament based on regular-season rankings, are typically regarded as the U.S. national champions. Lionel Messi and Inter Miami were knocked out of that competition in the first round by Atlanta United.\nAnd there’s more controversy…\nIn an unprecedented move in October, Europe’s top leagues and FIFPro, the global players union, filed a complaint against FIFA with the European Commission, an executive branch of the European Union, over what it claims is the world governing body’s “conflict of interest as a competition organiser and a governing body”, and mentioned the men’s international calendar and the Club World Cup in claiming FIFA had broken EU competition law.\nIn addition, the European Leagues, which represents more than 30 countries across Europe, and FIFPro Europe, the umbrella body of European player unions, agreed to take legal action in July over what they claim was an “unsustainable” international calendar that “risks players’ health”. FIFA, in response, said there had been “comprehensive and inclusive consultation” over the football calendar.\nA FIFA spokesperson told The Athletic this week that the governing body had been in regular contact with participating clubs and in meetings senior club executives, even in Europe, had been “extremely supportive of the tournament and its competitive nature”.\nAdvertisement\nHow can we watch the matches?\nAfter initially struggling to sell broadcast rights, FIFA on Wednesday announced a deal with DAZN, claiming it to be worth around $1billion (£787million). Every match will be free to watch on DAZN, which is not widely known or watched in the United States, and it has the option to sub-licence to local free-to-air channels as part of the deal.\nAnother area of consternation has been around sponsors. It is unclear how many there will be. Three have been named — Chinese consumer electronics firm Hisense was announced as FIFA’s first official partner for the tournament, and drinks company Anheuser-Busch InBev and Bank of America have since been added to the list. In a statement to The Athletic, a FIFA spokesperson said “interest from the market is very strong”.\n“The packages being negotiated and contracted currently are with both new and existing FIFA sponsors. Based on current deals, we expect to have a fully sold-out commercial programme for the new tournament,” the spokesperson added.\nWill fans care about the competition?\nFIFA has described the tournament’s format as global and inclusive. Its president, Gianni Infantino, said the Club World Cup was an “innovative” and “merit-based competition”.\nThe victors will get to lift the new Club World Cup trophy but not many of the world’s best teams or their fans have prioritised winning previous editions.\nCould the revamped version change that? Perhaps. Or it could be regarded as a glorified pre-season tournament for some, taking place at the same time European clubs usually go on pre-season tours. Adding to the complexity is how the European summer transfer window will be open during the tournament.\nThe success of the Club World Cup depends on how seriously clubs take it and how the draw plays out. The prize money on offer, which is unconfirmed, could have a major bearing on how clubs end up perceiving the competition, and whether they select their star players. For context, UEFA Champions League finalists walk away with €18.5million (£15.4m; $19.5m) each, with a further €6.5m for the winners.\nAdvertisement\nInterest will likely increase if Messi and Neymar go up against each other, or if big rivals are drawn into the same group. A lesser-known club defeating a major team, or making an unexpected run to the knockouts, could also generate headlines.\nBut with the competition less than a year away, questions remain unanswered.\n(Top photo: Francois Nel/Getty Images)",
  "word_count": 1455,
  "scraped_at": "2026-02-14T01:58:00.755622",
  "_text_extracted": true
}