{
  "article_id": "9f1fe02df5eb",
  "url": "https://www.fourfourtwo.com/news/jules-breach-thomas-tuchel-is-a-proven-winner-and-has-all-the-tools-to-take-england-to-world-cup-glory-in-2026",
  "title": "JULES BREACH : Thomas Tuchel is a proven winner and has all the tools to take England to World Cup glory in 2026",
  "date": "20241114T120000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JULES BREACH: Thomas Tuchel is a proven winner and has all the tools to take England to World Cup glory in 2026\nThe TNT Sports reporter on why a German could be the key to England bringing football home\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThomas Tuchel will start life as England manager on January 1. An exciting chapter kicks off in the new year, as England have a man at the helm who has proven he is capable of winning the biggest prizes.\nAn elite coach, Tuchel has been appointed purely because of his exceptional talent and ability to manage the best players on the planet. The 51-year-old commences his 18-month contract on the first day of the year, giving him the perfect timeframe to focus on achieving England’s goal: to win the 2026 World Cup.\nGareth Southgate did a great job during his eight years in charge, guiding the Three Lions to two Euros finals, a World Cup semi-final and laying down solid foundations that his replacement can now build on. Southgate came closer to lifting a trophy than any other England manager since 1966 – the mission for the latest boss is to finally get them over the line.\nTuchel is a winner, as illustrated by his glittering CV featuring 11 honours over a 15-year senior coaching career. Major trophies include one Bundesliga and two Ligue 1 titles, domestic cups in Germany and France, as well as the Champions League, UEFA Super Cup and FIFA Club World Cup with Chelsea.\nThe German loves knockout football, reaching four cup finals (two FA Cup, one EFL Cup, one Champions League) in his 100-game spell as Blues chief. He was named the world’s best club coach in 2021 – now he has the opportunity to taste success on the international stage.\nTactically he hasn’t stuck to the same formation from club to club, but that flexible style may suit tournament football, which often requires coaches to adapt to varied opposition.\nAlongside right-hand man Anthony Barry, a Liverpudlian who assisted Tuchel at Chelsea and Bayern Munich and was also part of Roberto Martinez’s coaching team with Belgium and Portugal, England’s new supremo must find a system that puts his best players on the pitch in their best positions, and that will inevitably mean having to disappoint a number of big names.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThat’s where Tuchel’s experience comes in. He’s managed some of the most technically gifted players in the game and won’t shy away from making tough decisions. He’s also very familiar with a few of the squad already, none more so than captain Harry Kane. England’s all-time leading scorer played under Tuchel at Bayern last season, netting an astounding 44 goals in 45 appearances. Tuchel knows how to get the best out of the talisman and must apply those skills to the rest of the remarkable talent at his disposal.\nHe’s always been a huge fan of English players and football culture in this country, and has openly expressed that he feels more appreciated in England as a coach, so let’s hope that affection is here to stay.\nTuchel is the third overseas manager of the Three Lions, again provoking a debate about whether the national team should be overseen by a homegrown gaffer. The Football Association made their position clear: that hiring an Englishman wasn’t the priority and identifying the right person to capitalise on the squad’s recent progress and deliver a trophy was.\nBeing able to develop more Englishmen that the FA believe are capable of winning silverware is a bigger picture problem that needs to be addressed. However, for now, they think they have selected someone who will give the side a genuine chance of hitting the target the entire country wants – ending 60 years of hurt in New Jersey.\nTuchel has the personality required to handle everything that this punishing role brings. He can be entertaining and charming with the media, as well as diplomatic, and is an excellent communicator – all traits that will come in handy when he’s under the spotlight.\nEvery football appointment is a gamble, but this certainly seems like one worth taking. Nothing is guaranteed, but England should head to North America among the favourites for World Cup glory, escorted by a manager of the highest quality who can mould this talented group of players into a team of immortal winners.\nRead more from Jules Breach:\nJules Breach is a broadcast journalist who has lead presenting roles for TNT Sport, Channel 4, ITV, and Premier League Productions. Jules hosted BT Sport’s live flagship football show Score and also presents live Premier League, Europa League and Champions League matches. Jules is the lead presenter for Channel 4’s coverage of the England games and also hosts ITV’s EFL Highlights show. Jules presents worldwide coverage for Premier League Productions and away from work is a passionate Brighton fan.",
  "word_count": 932,
  "scraped_at": "2026-02-14T02:08:26.320998",
  "_text_extracted": true
}