{
  "article_id": "9f4230cd99f6",
  "url": "https://www.twtd.co.uk/ipswich-town-news/38239/the-most-memorable-day-in-town%e2%80%99s-history/onthisday",
  "title": "The Most Memorable Day in Town History - Ipswich Town News",
  "date": "20240506T063000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wednesday, 6th May 2020 06:00\nTwo years ago, on the 40th anniversary of the FA Cup win, Mel Henderson, Town's public relations officer at the time, recalled that great day, the run which took the Blues to Wembley and how he came to be among those sitting on the bench during the final. Here's that piece again.\nMay 6th, 1978, was undoubtedly the most memorable day in the history of our favourite club.\nI’m not forgetting what must have been an unforgettable climax to a fairytale 1961/62 season as Alf Ramsey’s team were crowned Football League champions, or the treasured memories of May 1981 when Town fans turned Amsterdam blue and white in recognition of the club’s outstanding success in capturing the UEFA Cup.\nNor am I ignoring another Wembley victory, in 2000, when Town returned to the Premier League courtesy of a play-off final win over Barnsley and a new generation of supporters experienced what, for them, remains the obvious highlight of their time backing the Blues.\nBut for those of a certain vintage, who were fortunate enough to have been present at the national stadium 40 years ago, nothing will ever surpass the feeling of witnessing Roger Osborne, the ultimate local hero, scoring the only goal to overcome firm favourites Arsenal, and then seeing skipper Mick Mills collect the trophy to kick start several days of partying throughout Suffolk.\nIt was the 50th FA Cup final to be played at Wembley and surely one of the most one-sided of all time. True, only Roger’s 77th minute clincher separated the sides at the end, but had the Gunners been on the receiving end of a 4-0 scoreline it would have been a more fitting reflection of Town’s supremacy on the day.\nYounger fans will have to take my word for it that the FA Cup was a trophy well worth winning back in the day, not just for its special significance as the world’s oldest knockout competition or the fact that it carried a passport into Europe via the Cup Winners’ Cup, now sadly defunct as part of UEFA’s restructuring plans.\nWith the advent of the Premier League and the Champions League, the FA Cup is no longer the glamour tournament it formerly was. These days, live games litter our television screens, whereas prior to the Sky revolution we had grown accustomed to the FA Cup final being the only game covered live and it was a must-view occasion, regardless of the participants, in homes the length and breadth of the country.\nWhen Town triumphed at Wembley I had been in my role as the club’s public relations officer for less than four years and it was a privilege to be as closely involved as I was on the day, not only occupying a seat on the bench but, bizarrely, also being part of a clue in the crossword featured in the official match programme.\nIt was then-Football Association secretary Ted Croker’s visit to our hotel, Sopwell House at St Albans, that saw me trade my seat in the stand for a place alongside manager Bobby Robson, his backroom staff, substitute Mick Lambert and squad men Russell Osman and Robin Turner.\nTed had requested a meeting with Bobby to discuss FA Cup protocol. He discussed a number of points and it was when he said that each club was required to have a staff member on the bench that I was summoned.\nIn truth, my role did not extend much beyond ensuring that players were available afterwards, in the tunnel area, for live interviews by both BBC and ITV personnel — and that each was seen to be sipping from a pint of milk as they faced the cameras.\nThat requirement was crucial to a deal struck by the Milk Marketing Board, not with the clubs but their players, as one of several lucrative commercial spin-offs designed to line the pockets of players whose wages were modest in comparison to today’s Sky-high salaries.\nAs a huge armchair audience tuned in at home, it was viewed as cheap, subliminal advertising by the sponsors and for years the after-match drinking of milk by the winning team was as much an FA Cup tradition as the pre-match singing of the hymn, Abide with Me.\nTown’s route to Wembley had been fairly non-eventful as Cardiff City and Hartlepool United, struggling second bottom of the old Fourth Division, were swept aside in rounds three and four.\nNo one was daring to even think of securing a place at the national stadium as the Town party travelled across country to meet fifth round opponents Bristol Rovers, the team bus arriving in the city as a snow blizzard immediately placed a question mark against the next day’s game being able to go ahead.\nManager Robson was summoned to Eastville for a morning inspection, leaving behind a group of players convinced there was no way the game would be given the thumbs-up. Even when he returned to declare the game was to take place as scheduled, several players thought it was a prank and took some convincing that he was serious.\nBrentwood-based referee Brian Daniels, who didn’t even don his football boots or ask for a ball, had somehow decided, for reasons that remain unclear to this day, that the snow-covered pitch was fit for purpose.\nRobson was not just stunned by the official’s shock verdict, he was also furious and seeing his team trailing 2-1 after 64 minutes led to him replacing Colin Viljoen with Osborne, whose impact in supplying the finishing touch for Town’s 86th minute equaliser went unnoticed as Robin Turner, who had scored his side’s first, was also credited with the crucial second.\nIt was only years later that Osborne would admit it should have been his goal, owning up: “It was definitely Robin’s goal. I thought I might be offside and I was actually trying to get out of the way!”\nNot only were Town relieved at earning a replay, they were also grateful to referee Daniels for disallowing what should have been a third goal to Rovers, the official chalking it off for offside while clearly unaware that it was from an under-hit Allan Hunter back-pass that Bobby Gould had been put clear to find the net.\nOnly eight of the Wembley starting line-up featured at Eastville and it was the same story for the replay 10 days later. By the time it came round, of course, the sixth round draw had paired the winners with Millwall, causing an upbeat mood in both camps, and after a comfortable 3-0 win it was Town who were heading for The Den, knowing they were just one win away from a place in the semi-finals for only the second time in their history.\nAgain, things were far from straightforward in South London. The hooligan element among the home side’s support didn’t take kindly to seeing their team fall behind and a pitch invasion ensued.\nReferee John Gow ordered both sets of players to return to the dressing room and there was an 18-minute delay, during which a number of Town fans were injured by missiles hurled into their section of the ground.\nEventually Town romped to a resounding 6-1 win, with Paul Mariner netting a hat-trick, but manager Robson was furious that his after-match comments — “they should turn the flamethrowers on them” — were relayed to millions of viewers by his friend, former Fulham team-mate and Match of the Day host, Jimmy Hill.\nRobson did not deny uttering the words but had used them in conversation with friends afterwards, unaware that they had been overheard by a member of the media.\nAnd so to the semi-final at Highbury against a West Bromwich Albion team riding high in the First Division under new boss Ron Atkinson, while Town uncharacteristically lacked consistency in the league and were instantly installed as second favourites to advance. However, on the day, Robson’s troops rallied to triumph 3-1, although the scoreline only tells part of the story.\nBrian Talbot’s diving header put Town in front but he was seriously injured, picking up a nasty wound above the eye that blurred his vision. He was replaced by Mick Lambert and when skipper Mills made it 2-0, as early as the 20th minute, everything seemed to be going Ipswich’s way.\nHowever, 14 minutes from the end Hunter inexplicably stuck up an arm to make contact with a cross and Albion were able to pull a goal back from the spot through Tony Brown.\nThe fear of them nicking a second goal remained until right at the death when John Wark headed in a third goal and Town were heading for Wembley.\nRobson decided to throw open the doors of the dressing room for journalists and photographers to have unprecedented access to the players and chairman Patrick Cobbold and his brother, John, came down from the directors’ box to join in the celebrations, no doubt reflecting on their father’s successful mission to bring professional football to Ipswich more than 40 years earlier when no one could have anticipated the club’s progress being quite so dramatic or that it would occur so quickly.\nAs fans celebrated their team’s historic achievement, I made the trip back to Ipswich on the team coach, chatting to the players to gather information for a pre-Wembley club publication.\nBut when I awoke on the Sunday morning to discover I was covered in a nasty rash, quickly diagnosed by my doctor as measles, I had no idea of the disruption I was about to cause.\nThe doctor used my bedside phone to call Bobby. I listened as he explained that the average incubation period for measles in adults was 14 days, meaning that anyone in close contact with me was at risk. I was effectively banned from Portman Road for a fortnight while Bobby had to ask players to check with their parents whether or not they had previously had measles when they were children.\nOne national newspaper carried a front-page teaser that read ‘FA Cup finalists in measles scare’ while their back page story was headlined ‘SPOTCHECK’ but, thank goodness, there were no further casualties and I was able to work from home until my suspension expired.\nThe biggest question on people’s minds in the build-up to Wembley was whether or not they would get their hands on a ticket. The club’s allocation meant they were able to guarantee one for every season ticket holder, while also catering for those who had attended games on a regular basis and were in receipt of the required vouchers handed out via the turnstiles throughout the season.\nNevertheless, demand meant many were disappointed, future chairman David Sheepshanks revealing some years later that he was among those unable to share the club’s big day.\nThe club’s ticket office had never been busier and it wasn’t unusual for supporters to have their tickets handed over by manager Robson as he joined others, including the chairman and some directors, in taking a turn behind the counter and reduce the queue as it snaked all the way round the stadium.\nMuch to everyone’s relief, the club’s First Division status was secured in the build-up to the final, although a 6-1 defeat at Aston Villa one week beforehand clouded preparations.\nManager Robson had selected Viljoen to replace Osborne in a clear attempt to assess the South African-born England midfielder’s fitness with a view to restoring him to the starting line-up at Wembley.\nThe gamble backfired spectacularly, not only by a potentially morale-damaging defeat but by his players’ reaction as they voiced their disapproval, some more audibly than others, to his controversial plan.\nThey made it clear they were not in favour of Osborne being dropped, leaving Robson with no alternative but to scrap the idea of a possible recall for the fit-again Viljoen, who had not featured at first team level since the 3-0 defeat of Bristol Rovers two months and 14 games earlier.\nRobson was quick to deny paper talk of player power but he admitted to feeling he had been let down. He identified 17-year-old goalkeeper Paul Overton, who was never to feature at senior level again, as the team’s best player on the day. How could that be, he wondered, and when he asked the other players all he received in return were blank faces.\nBut Robson ensured the negative atmosphere of Villa Park was not allowed to linger. He even expressed the view that it had helped to galvanise the squad by bringing the players closer together ahead of the final and that he could sense they were anxious to make amends at Wembley.\nFrom the players’ perspective they were amazingly confident ahead of the game, their mood in stark contrast to the bookmakers’ generous odds of 5-2 against them pulling off a shock win.\nAs they assembled for breakfast, Lambert spotted the odds as he scanned a morning paper and wasted no time in collecting money from his colleagues before phoning a bookmaker to place a sizeable bet. Such behaviour is frowned on now, of course, but back then it was not in breach of any regulations.\nWhat the players didn’t realise as they travelled by coach to the national stadium, with the ITV cameras and Gerry Harrison for company, was that referee Derek Nippard was giving serious consideration to postponing the game. A torrential downpour had left several puddles on the pitch and only when he was assured the ground staff could remove the surface water did he give the go-ahead.\nBut there was still a lot of surface water as the game kicked off and this, together with the sun beating down on the soggy surface, sapped the energy of players on both sides.\nIt seemed Town, despite enjoying the greater share of possession, were destined not to score as Mariner struck the crossbar after 11 minutes, Wark twice saw shots rebound off the same post and George Burley’s netbound header was clawed away by Arsenal goalkeeper Pat Jennings.\nThen it happened. David Geddis, included in an unfamiliar role wide on the right, got the better of Sammy Nelson and sent a firm low cross into the middle. Gunners’ defender Willie Young was first to make contact but could only direct his attempted clearance straight to the feet of a grateful Osborne, who fired beyond Jennings to finally break the deadlock.\nConfusion ensued as Osborne was engulfed by jubilant team-mates and eventually succumbed to a mixture of exhaustion and elation to be replaced by Lambert. As Osborne sat on the bench he kept asking himself: “Have I just scored the winning goal in the FA Cup final or is it going to extra time?”\nBut his anxiety was misplaced and Town recorded a narrow, but nevertheless emphatic, victory. The trophy was collected and paraded, and it was on to the Royal Garden Hotel in London for the club’s official banquet.\nThere was no opportunity to nurse hangovers as everyone was required to be back on the bus after breakfast the next morning for the return journey to Ipswich, where an open-top bus parade through the town and on to the Cornhill preceded a civic reception.\nThe trip back down the A12 was interrupted so that the players — and trophy — could visit the Army & Navy pub, a regular stop on the way back from games in London and further south. Bobby Robson had been asked weeks earlier to bring the cup in and he was only too pleased to be able to deliver.\nPhotos: Action Images/ITFC\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 2629,
  "scraped_at": "2026-02-14T01:48:52.527402",
  "_text_extracted": true
}