{
  "article_id": "9f44ae851829",
  "url": "https://www.nytimes.com/athletic/5759768/2024/09/11/how-usmnt-sealed-pochettino-deal-the-data-debate-premier-league-hat-trick-race/",
  "title": "How USMNT sealed Pochettino deal , the data debate , Premier League hat - trick race",
  "date": "20240912T124500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Athletic FC ⚽ is The Athletic’s daily football (or soccer, if you prefer) newsletter. Sign up to receive it directly to your inbox.\nComing up:\nHello! He made us wait — but Mauricio Pochettino is flying the Stars and Stripes.\n- Why a delay in USMNT’s Poch deal?\n- Pulisic wants ‘culture change’\n- Aguero/Haaland hat-trick race\n- Football on the day of 9/11\nSealed With A Steak: USMNT finally unveil Pochettino as head coach\nIt’s real. It wasn’t a dream. Mauricio Pochettino is the new USMNT coach. Officially.\nThe news dropped after a few weeks of stoic silence from him and U.S. Soccer. If the final throes of negotiations were a little torturous, the seduction of Pochettino in the wake of the USMNT’s Copa America whimper has been impressively swift.\nAdvertisement\nFrom the get-go he was target No 1, despite initial chats with Jurgen Klopp. U.S. Soccer made contact with him before they fired Gregg Berhalter. Sporting director Matt Crocker flew to Barcelona to meet the Argentinian 48 hours after the Copa final, armed with a bottle of red wine and a kitty for Argentine steak.\nThe hire takes the U.S. onto fresh, tasty, ambitious ground. It had to. In reputational terms, Poch brings instant credibility. He’s also friends with USWNT boss Emma Hayes (below), who actively urged him to give the American dream a whirl.\nLet’s start with the facts:\n- Pochettino has signed a contract taking him through the 2026 World Cup.\n- He had a watching brief for friendlies against Canada and New Zealand, with Mikey Varas in interim charge, but Panama in Austin, Texas, on October 12 (9pm ET) is the game where the baton will pass to him.\n- This is U.S. Soccer’s first foreign pick for the top job since Jurgen Klinsmann in 2011. Trading Berhalter for Pochettino is like hopping from the local beach to St Tropez.\nThe die is cast. U.S Soccer has its man and its stardust. Start the car.\nHow did they convince him?\nCrocker had a few aces up his sleeve. Pochettino liked the thought of managing at a World Cup and the U.S. job gives him the inflated profile of coaching a host nation and a young squad.\nU.S. Soccer had money to work with, too, though we’re waiting on details about the numbers involved. They won’t be modest, especially after a substantial donation from billionaire Ken Griffin to help move things along. Wrangling over Pochettino’s severance package at Chelsea was one reason it took time to formalise the appointment, but it wasn’t a deal-breaker.\nLemons, maté, energy and style\nThe first thing USMNT stars might spot in Pochettino’s office is a bowl of lemons. He likes having them to hand, though not to eat. In his head, lemons suck away negative energy.\nThey worked for him at Tottenham Hotspur, but not so much at Paris Saint-Germain or Chelsea.\nMagic fruit aside, Pochettino’s success will depend on three factors: his tactics and the available resources marrying together as a coherent unit; him raising the bar of individual performances (otherwise known as making players better); and his ability to stop the squad believing in limits.\nAdvertisement\nThese are strengths of his. When his high-pressing, possession-based football peaked at Spurs, it nearly brought them the Premier League title — and it took them to a Champions League final. Pochettino prides himself on motivation. Mandatory handshakes, walking through fire pits; there’s no end to his methods of building trust.\nEven so, international football is not club football. Pochettino will have short, isolated spells in which to mould the USMNT. He’s adapting to a new culture and America’s summer reminded us that he can’t be expected to flick a switch overnight.\n- The Athletic FC podcast has been discussing whether Poch is the right fit. You might have noticed U.S. Soccer’s ‘Done deal’ tweet using an emoji of the popular South American drink, maté. We’ve got you covered on that topic, too.\nInternational Recap: USMNT concede another shocker\nIf ever a goal said ‘time for a fresh start’, it was New Zealand’s 89th-minute equaliser in their 1-1 draw with the USMNT in Cincinnati yesterday — another defensive disasterclass (above).\nPochettino is arriving at the perfect moment. The U.S. are flailing and yearning to draw a line under a feeble summer. Christian Pulisic bagged their goal against New Zealand and admitted afterwards the culture of the squad has to change. In Poch’s hands, it surely will.\nBrazil’s summer has been pretty miserable, too. They flopped at the Copa America and lost 1-0 to Paraguay in a World Cup qualifier last night. Brighton-bound Diego Gomez settled the contest. Pick this shot out:\nNo such stress for England. They beat Finland 2-0. Harry Kane scored twice on his 100th appearance. Trent Alexander-Arnold’s passing had the Finns on toast. Two games in and interim head coach Lee Carsley already looks nailed on for the full-time job.\nBut international fortnights would not be international fortnights without some injury drama. Hot on the heels of Martin Odegaard’s twisted ankle, Nathan Ake pulled a muscle in the Netherlands’ Nations League draw with Germany.\nManchester City and Pep Guardiola will be thrilled.\nAdvertisement\nNews Round-Up\n- Attempts to buy Everton are complicated enough. It might not help that one of the club’s former sponsors, Uzbek businessman Alisher Usmanov, is embroiled in a court case with current Everton owner Farhad Moshiri. Just another day at Goodison Park.\n- Good news and bad news for Liverpool. The good news: midfielder Curtis Jones is back training after a two-game absence through injury. The bad news: Harvey Elliott has fractured a foot. He’s out for at least a month.\n- Aston Villa won’t back down over eye-watering Champions League ticket prices (they’re as dear as £97, or $127). According to Villa, “achieving our sporting ambitions while complying with financial stability regulations requires difficult decisions”. And deep pockets.\n- There’s a famous banner inside Luton Town’s ground which criticises the Football Association over a 30-point deduction inflicted on the club in 2008. The FA seemingly tried to censor the flag during an England Under-21s match there on Monday. Luton aren’t happy.\n- Arsenal like to wear their home shirt in any game against Tottenham Hotspur, but the design of this season’s kit means it will have to be their black away outfit in Sunday’s north London derby. To be honest, it’s the least of their worries.\nData debate: how much has it changed the game?\nThe Athletic’s Michael Cox was one of the first football writers to focus specifically on tactics. His way of studying the sport inspired others to mimic him. He proudly puts himself in the category of ‘spreadsheet nerd’.\nSo when he took on a piece about whether the impact of data analysis in football has been overstated, I assumed he’d say no. After all, there’s no pretending that elite clubs aren’t obsessed with science and numbers. It’s why Liverpool (or their owner, Fenway Sports Group) went cap in hand to Michael Edwards.\nBut that’s where nuance comes in. Michael can see how data has changed the industry; the way money is spent on it, attention is paid to it, strategies are built around it and the recruitment of players depends on it. But has it changed the game? As in, the nature of football matches themselves? He’s not convinced. And having read his take, I think he’s right.\nAround The Athletic FC\n- Sergio Aguero has the all-time record for Premier League hat-tricks (above). Erling Haaland is going to break it. How do the two Manchester City goal machines compare? And how starved must Manchester United (above) feel?\n- Signing goalkeepers was all the rage in the last window. If you were building the perfect one, how would you do it? The Athletic’s goalkeeping expert, Matt Pyzdrowski, had a bash, taking bits of Ederson, Alisson, Manuel Neuer et al to form the supreme prototype.\n- Kiernan Hughes-Mason is a former professional forward. On Tuesday, he was sentenced to 14 years in prison for a violent attack on a two-year-old girl. Somehow, he was able to continue working in football prior to his conviction. I’ll warn you that parts of Adam Leventhal’s article are harrowing.\n- To Germany on the club nickname trail. They seem to have missed the memo somewhat; very literal and straight-laced with their choices. ‘The Nullfunfers’ (Mainz) is decent, though.\n- Most clicked in yesterday’s TAFC: Greg O’Keeffe’s USMNT player tracker.\nFrom the archive…\nThere’s no forgetting where you were on 9/11. I was 20 and covering my first game as a football writer, a low-key League Cup tie between Grimsby Town and Sheffield United. I guess I would have remembered it because of the novelty. I remember it more because of the date.\nFootball carried on that evening. I wouldn’t say carried on regardless because I recall a sense of unease about the game at Grimsby going ahead, but the English schedule held and UEFA pushed on with the Champions League. It took until the following night for UEFA to postpone eight matches, including Manchester United’s meeting with Olympiacos.\nUnited had already travelled to Greece. In this feature published on the 20th anniversary of 9/11, which is free to read, Danny Taylor wrote about their squad flying home in near silence. On the day of the Twin Towers attack itself, Liverpool drew 1-1 with Portugal’s Boavista. Gerard Houllier, the Liverpool manager, summed up the occasion at Anfield by saying neither side felt motivated to win.\nSome events are so much bigger than football. Twenty-three years later, very few have made the sport feel less significant. And when you think back, it feels like yesterday.\n(Top photo: Henry Browne/Getty Images)",
  "word_count": 1624,
  "scraped_at": "2026-02-14T01:54:48.968828",
  "_text_extracted": true
}