{
  "article_id": "9f4e69d2b24d",
  "url": "https://www.the42.ie/what-has-happened-to-liverpool-5973681-Jan2023/",
  "title": "What has happened to Liverpool ? ",
  "date": "20230121T111500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "IF A week is a long time in politics, a season in football can sometimes feel like an eternity.\nLiverpool’s 2021-22 campaign deserves to be remembered as one of the all-time great years for the club.\nYet it is destined to be reflected on for what it could have been rather than what it was.\nThe team agonisingly finished on 92 points — a tally good enough to win the title most seasons but which left them just a point adrift of champions City, who required some late heroics by super-sub Ilkay Gundogan to eventually get them over the line.\nIn all competitions, they lost just four matches — one of those was a Champions League round-of-16 clash in which they still went through on aggregate and another was the final itself.\nLeicester City and West Ham were the only teams that could beat them in the Premier League.\nFinishing with two trophies — the FA and EFL Cup — would be considered an incredible achievement by most teams’ standards, but it was impossible to ignore a sense of anti-climax from the Reds’ perspective.\nFast-forward to this season and they have already been beaten six times in the top flight alone.\nThey are already out of the EFL Cup and needed a fortuitous officiating decision in their favour to avoid a similar fate in their FA Cup tie with Wolves.\nTheir Champions League adventure may also conclude prematurely, having been paired with their old nemesis and reigning champions Real Madrid in the round of 16.\nBut last Saturday’s comprehensive 3-0 loss to Brighton felt like a new low — and Jurgen Klopp certainly thought so.\n“I can’t remember a worse game — and I mean all, not only Liverpool,” the manager said afterwards.\nThe narrow midweek cup win over Wolves provided a much-needed morale boost, but how seriously a game in which both sides rested key players can be taken is debatable.\nThe stark reality is that Liverpool currently sit in ninth position — 19 points off leaders Arsenal in a dramatic reversal of their fortunes from last year.\nAnd there seems to be no definitive explanation as to what has gone wrong. Talented players don’t become poor overnight, but Klopp’s men have looked way off the pace for much of the season.\nThere have been occasional scapegoats — Trent Alexander-Arnold, Darwin Nunez, Klopp himself.\nYet really, it feels like a wider systemic problem. There is simply no quick fix.\nAt this point last year, Liverpool had scored 50 goals and conceded 15, compared to 34 for and 25 against currently.\nSomething feels broken. In every area of the pitch, it is a case of diminishing returns. The high-intensity style that Klopp teams are renowned for is currently nonexistent.\nThe prevailing incoherence has been reflected by off-field developments too, with some important figures behind the scenes leaving the club.\nAgainst the Seagulls, Liverpool started with an ill-advised midfield diamond consisting of Fabinho (29), Jordan Henderson (32), Alex Oxlade Chamberlain (29), and Thiago Alcântara (31).\nIt was a quartet that looked their combined age at times, especially when up against an effervescent Brighton outfit. The fact that two of the eight changes Klopp introduced for the Wolves encounter were teenagers seemed telling.\nMore than ever, the Premier League requires pace and athleticism to succeed, with stamina and mental fortitude doubly important in this unique, World Cup-interrupted season. It is no coincidence that Arsenal, the team with the youngest squad, are currently thriving while Liverpool are seemingly paying for a failure to adequately rebuild the team of late.\nTo come into Saturday’s fixture with two players who have served the club well but have a lot of miles on the clock (Fabinho and Henderson), one who has endured an injury-ridden few years (Oxlade Chamberlain) and another who for all his technical prowess has never been particularly imposing physically (Thiago) felt a little naive.\nThe squad were also involved in an incredible 63 competitive matches last season — a factor that cannot be overlooked.\nThis year has felt like an extended hangover and their fortunes have certainly not been helped by the departure of Sadio Mane.\nYou could argue that the 30-year-old’s best days are behind him with his body increasingly prone to injury — he was ruled out of the World Cup after requiring surgery to his knee having picked up a knock while playing for Bayern last November — but his absence has certainly been felt.\nThe likes of Cody Gapko and Nunez may ultimately be regarded as astute reinforcements, but Mane’s energy and commitment as the first line of defence so often set the tone for what Liverpool were about.\nThe speedy attacker was in many ways the archetypal modern forward. Essentially the antithesis of a Cristiano Ronaldo — his goalscoring numbers, 120 in 269 appearances were impressive but not eye-watering (by comparison, Mo Salah has 173 in 282), but his pressing, attitude and general off-the-ball work was always exemplary.\nPerhaps only now, Liverpool are realising their departed forward’s true value.\nSo in Saturday’s early kick-off, Klopp will attempt to find more solutions to the many problems that leave his side in danger of suffering their worst campaign of his reign and first season outside of the top four since 2015-16, during which he replaced Brendan Rodgers as manager.\nToday they play Chelsea, another talented side who are struggling under the weight of great expectations.\nWith similarly tough games on the horizon against Newcastle (18 February) and Man United (4 March), not to mention the Madrid fixtures (21 February and 15 March) as well as a Merseyside derby (11 February) in which Frank Lampard’s relegation-threatened Everton will be more desperate than ever to claim bragging rights, the coming weeks will be pivotal if Liverpool are to avoid a season (or perhaps even longer) in the wilderness.\nA win this afternoon would alleviate the sense of crisis temporarily at least, with rivals such as United, Newcastle and Arsenal resurgent, while even City showed midweek against Tottenham that they do not deserve to be written off yet. Conversely, it increasingly has the feel of a terminal decline for the beleaguered Reds — or at least, this incarnation of Klopp’s team.\nFor all their shortcomings, there are still crumbs of optimism to cling to, however. At home, they remain formidable enough opponents — just one of the aforementioned six defeats came at Anfield. This afternoon, Klopp will be hoping his side can draw inspiration and feed off the energy of the crowd to heap more misery on Graham Potter and co.\nA loss, on the other hand, would leave them mired in uncertainty, far closer to the relegation zone than the top of the table.\nUpcoming fixtures (all games kick-off at 3pm unless stated otherwise)\nSaturday\nLiverpool v Chelsea (12.30)\nBournemouth v Nottingham Forest\nLeicester City v Brighton\nSouthampton v Aston Villa\nWest Ham v Everton\nCrystal Palace v Newcastle (17.30)\nSunday\nLeeds United v Brentford (14.00)\nMan City v Wolves (14.00)\nArsenal v Man United (16.30)\nMonday\nFulham v Tottenham (20.00)",
  "word_count": 1179,
  "scraped_at": "2026-02-14T02:19:30.183572",
  "_text_extracted": true
}