{
  "article_id": "9fc5cf41a27c",
  "url": "https://theathletic.com/4295543/2023/03/11/paris-saint-germain-champions-league-failure/",
  "title": "Paris Saint - Germain latest Champions League failure : The inside story",
  "date": "20230311T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Paris Saint-Germain’s Qatari president Nasser Al-Khelaifi addressed the club’s staff in January, he was feeling optimistic. Buoyed by a World Cup in his home country that had finished with a final for the ages illuminated by two of the club’s star players, he wanted his employees to share in his confidence.\n“2023 will be our most successful year for PSG,” he declared.\nAdvertisement\nBut little more than a week into March, PSG are out of the Champions League and have lost more matches in 2023 than in the entirety of 2022.\nThe speech itself was framed around a change of direction for the Parisian project, which began in the summer with a new coach, a new sporting director and crucially, the renewal of Kylian Mbappe’s contract. Those three points were the foundation for the year ahead, yet they were pillars built on sand. This is a project painfully stuck between two stalls.\nThere was this new outward desire to ‘build’ a team, a sporting project epitomised by the arrival of Luis Campos, a master of that art. Yet there was no full relinquishing of the ‘bling’, something Al-Khelaifi had promised to phase out in an interview with La Parisien last year.\nThis remains a club trying to shoe-horn three of the game’s greatest individual talents into a single team, an exercise borne of an environment where image clashes can supersede sporting merit and where marketing is deeply valued amid the ownership’s desire for soft power and status.\nCombining stars seeking instant success with a strategy for a longer-term build is like mixing water with oil, and the flaws in the approach were laid bare on Wednesday as PSG’s group of individuals succumbed to a true team performance from Bayern Munich, a club where everyone is on the same page.\nOn that night, PSG could rightfully claim to be unlucky. Injuries killed them; the absence of Neymar was one thing, but losing three defenders — first Presnel Kimpembe in Marseille last month, then Marquinhos and Nordi Mukiele over the course of the contest itself — left them frail and unbalanced. But while that can seem like misfortune, it is also a result of the club’s whole approach in the transfer market.\nDespite the millions of euros poured into the French club by backer Qatar Sports Investments (QSI), it was revealing that there was no core of established talent on the bench for coach Christophe Galtier to turn to when things were going wrong. In contrast, Bayern had Serge Gnabry, Leroy Sane and Sadio Mane among their replacements.\nAdvertisement\nThis was another reflection on a difficult season and a decade of questionable squad building. They are the club with the largest wage bill in football, according to a report by Football Benchmark, yet their record is of five Champions League exits before the quarter-finals in seven years. Having reached the final in 2020, they have since taken steps back in Europe.\nThe Athletic has spoken to a range of people associated with PSG, from those near staff, the dressing room, the hierarchy and others connected to or working with the club, to assess how they have reached this point and where they might go next. They spoke on condition of anonymity to protect their relationships, positions and confidences.\nThey paint a picture of a club victim to a post-World Cup malaise but also one where the internal culture and DNA are in flux, grappling with the paradox of image and on-field merit. They suggest the club is at a crossroads: the manager looks condemned, contracts are expiring and the future of their star assets rests on their direction of travel. It is a crossroads, though, from which they can still emerge successfully.\nThis is the story of PSG’s latest failure, a product of continuity as the club sought to find change.\nLuis Campos stormed into the technical area at the Parc des Princes last month. He was shouting at his team, demanding a response and insisting on improvements. PSG were trailing 3-2 to Lille at the time and they would ultimately turn the game around. But the thing is, Campos is not the manager.\nThe images of Campos swept across European sports pages. This, remember, is a man whose consultancy role is actually only part-time and who has the title of ‘football adviser’. He is not a direct employee of the club and, in fact, also works part-time with Celta Vigo. Here, though, was a display of real power and influence. It did not give the impression of Galtier as a man in a position of strength.\nCampos was brought back in the summer, remarkably, as part of the negotiations that led Kylian Mbappe to renew his contract. The French World Cup winner, and now PSG’s all-time leading goalscorer, wanted Campos, who he has known since his teenage years at Monaco, to lead the renewal of the PSG project.\nAdvertisement\nCampos’ reputation preceded him. In his squad building at Monaco, where he was sporting director, he oversaw the transfers of James Rodriguez, Radamel Falcao and Anthony Martial, as well as assembling a title-winning team in 2016-17 including Bernardo Silva and Thomas Lemar. He would pip PSG to the post again later, in 2021, with Lille.\nSuch is Campos’ relationship with Mbappe that the sporting director actually had an agreement to go to Real Madrid before the France striker put pen to paper on his renewal with PSG. The Spanish club initially felt betrayed when they learned Campos was expected to move to Parc des Princes instead in the summer of 2022, but the Portuguese telephoned Los Blancos president Florentino Perez to ask for permission to complete that move — and Perez agreed.\nHis remit in the market was to steer the club in a new direction. Over the past couple of windows, players including Angel Di Maria, Leandro Paredes, Mauro Icardi, Keylor Navas, Ander Herrera and Idrissa Gueye have all moved on. But they have been replaced by players who, according to some of the people The Athletic spoke to, are not at the required level.\nFull-back Nuno Mendes signed permanently from Sporting Lisbon after an initial loan last year before Campos’ arrival, has impressed; so too has Mukiele, their first-choice target at full-back signed from RB Leipzig. Fabian Ruiz, 26, signed from Napoli, has done OK, while Renato Sanches has been impacted by injuries.\nBut the likes of Carlos Soler, who was an unused substitute in Munich, 20-year-old Hugo Ekitike and Vitinha have all been considered inadequate replacements for the very highest level. Vitinha, who was behind their initial preference, Aurelien Tchouameni, on PSG’s list of targets, started brightly on the pitch and has potential has struggled to make an impression in a strong-willed dressing room and Ekitike was thrown in early — off the back of one breakout season with Stade de Reims.\nMore than this, PSG were essentially left with three central defenders, complemented by Danilo Pereira, a converted midfielder, Mukiele, a versatile defender but better known for his work at right-back, then youngsters, such as El Chadaille Bitshiabu, 17.\nWhen trying to play a back three, this was a huge problem. Milan Skriniar from Inter Milan was the club’s main central-defensive priority in the market but that did not materialise, though it will be completed for free in the summer, while the club’s pursuit of Hakim Ziyech ended in farce in January. PSG sources blame Chelsea for the delay, citing the wrong document being sent three times before the deadline. That is disputed by Chelsea sources, who acknowledged one mistake and also pointed to PSG acting late at a very busy point in the window.\nAdvertisement\nFinancial fair play (FFP) regulations have played a role in shaping PSG’s market work. L’Equipe reported the club had seen a 45 per cent uplift in wages over the past two financial years, increased again by the signing of Lionel Messi — albeit PSG claim the transfer has paid for itself. PSG settled an FFP breach with UEFA for failing to comply with a break-even agreement between 2018 and 2022 late last year, meaning they must pay €10million (£8.8m, $10.6m) but could be fined up to €65m depending on compliance over a three-year period.\nReducing the wage bill was a necessity and expenditure has been limited as a result, but even so, there is an acceptance that mistakes have been made, something Campos acknowledged during an interview with French radio station RMC in September. “We are at the end of the window without the perfect balance,” he said. “It is a serious problem for us.” That would be proven evident in Munich.\nThat interview with RMC raised eyebrows internally at PSG, particularly for the way Campos presented himself. Like his touchline cameo — and he is also known to have stepped into the dressing room, too — it suggested his role was wide-ranging and his influence has grown. PSG have another consultant sporting advisor, Antero Henrique, and the pair had a tense relationship, particularly over player sales where it was felt by Galtier and Campos that more permanent sales were required than loans. This was Henrique’s area of operation. It is worth noting Henrique was key to Mbappe’s contract renewal — as he was when PSG signed him initially from Monaco.\nThere can be no doubting Campos’ influence, though. He is ‘Mbappe’s man’ and it is his coach who is in charge. Campos worked with Galtier at Lille and their relationship is illustrated by Campos’ words to RMC about learning of his PSG appointment. “The first thing I did was call Christophe Galtier, even before calling my wife and my mother,” he said.\nYet squad building appears to have hamstrung the coach, whether that be a legacy of spending nearly €400m on two players and adding Messi to boot or the summer’s incomplete overhaul.\nCampos has a fondness for discussing jigsaw puzzles, which he did again in that interview with RMC, emphasising the need to put the right pieces in place. The problem though, as one PSG source described, is that no one quite knows what the final picture is meant to be.\nExpenditure is one thing, but there are off-field issues too. Staff who have previously held senior roles at PSG have remarked on the poor quality of the club’s training facilities at the Camp des Loges. They have been described as dirty in places, pockmarked by clutter and facilities not being up to scratch for a top-level club, with an inadequately small physio room.\nAdvertisement\nThat is one problem that should soon be resolved, though, as PSG are set to unveil a brand new, state-of-the-art training facility in Poissy costing €300m. It will have 17 pitches, cover 74 hectares and the club’s elite will begin using it from the start of the 2023-2024 season. The rest of the club will follow next year, upon full completion.\nGaltier has tried to make things work with the assembled squad he has inherited but, as outlined, it is one with limitations. He is a straight talker and is generally liked internally.\nThe early signs following his arrival were positive. PSG went 23 matches unbeaten at the start of the season but they ended up finishing second in Group H of the Champions League after Benfica smashed Maccabi Haifa 6-1 in the final round of matches. Those goals meant a tie with Bayern, rather than one with Club Bruges, and their Champions League path suddenly became much more difficult. When it is the competition upon which your entire season is judged, that makes a problem.\nThere can be little doubt the World Cup has had an impact. It was the main target for PSG’s star players — Messi, Mbappe and Neymar all had realistic hopes of winning with Argentina, France and Brazil respectively — but at least two were always going to be left devastated midway through the season. For Neymar, that came in the form of early elimination and a tournament disrupted by injury; for Mbappe it was heartbreak in the final after producing one of the great individual World Cup performances. Messi had the opposite emotion: the fulfilment of a lifetime dream. It would hardly be surprising if what came next was underwhelming for him.\nSo much of the PSG discourse revolves around how best you accommodate those three players into a coherent team. That is not an issue Galtier faced against Bayern because Neymar’s season is already over — ankle ligament damage has seen to that — and it has meant a tactical rethink.\nThe manager had enjoyed some success with Neymar and Messi playing behind Mbappe, but in the new year, he struggled to find the right formula and those good early results were overshadowed by major, stinging defeats. Not least in the Coupe de France round of 16, when an Mbappe-less PSG were beaten by rivals Marseille. Galtier moved from a back four to a back three when PSG returned to league action last month, and a 3-5-2 formation without Neymar seemed to work well. But working well in Ligue 1 and working well against Bayern Munich are altogether different propositions.\nGaltier is not the architect of PSG’s long-term problems but, as the incident at Lille showed, he is seen as weak by some sources, his position tied inextricably to Campos. Considering the talent at his disposal, it is felt internally that PSG should be performing better and, as one source close to the dressing room described, he prefers above all else to seek calm and harmony.\nAdvertisement\nThis is not always easy and it feels like a very PSG issue; a cultural one stemming from a decade of trying to bring in the best players, with team chemistry an afterthought.\nThis is not, there can be no doubt, a normal dressing room. Former senior members of staff have spoken about there being no overarching culture, with egos a key issue. They remark that situations would arise where players would be unhappy if they are looked at strangely or would seek the support of those higher up the food chain if unhappy with a selection.\nMbappe evidently wields influence, not just in terms of his link to Campos and then, by association, Galtier. The France striker was unhappy at the club’s recruitment last summer having been involved in identifying the targets of Robert Lewandowski, Tchouameni and Skriniar. The player discussed a move with Lewandowski himself. His own future will, as it so often is, be a dominant theme of this coming summer.\nBut while there are undoubtedly egos at play at PSG, multiple sources close to the dressing room say the environment within it is much better than is widely perceived. For the three big PSG stars, their motivation is, fundamentally, success. Those close to Messi say he has an excellent relationship with Mbappe and that Neymar was influential in him signing for PSG in the first place.\nThe issue, though, is that they do not always want to share, whether that be goals or otherwise. They are great players but rather than improving each other, it is felt they hold each other back. They are not necessarily the best fits together either: both Neymar and Mbappe are at their best when stepping off the left wing. It’s another reflection on squad-building issues.\nWhat separates PSG from other big clubs is that the stars have been indulged, which creates a problematic culture. That starts with Mbappe’s influence — Campos’ appearances in the dressing room are not always warmly received by those not close to Mbappe. Last month, Neymar confirmed he had a dressing room altercation with Campos, which he later described as being blown out of proportion.\nPenalties are often where this issue comes to the fore. In 2017, Neymar had a public dispute with Edinson Cavani against Lyon and this season there was a similar instance, this time against Montpellier. Mbappe missed a penalty and in the second half, after PSG were awarded another spot-kick, Neymar grabbed the ball and scored. Mbappe did not celebrate with his team-mate and, after full-time, Neymar liked posts on social media criticising Mbappe as first-choice kick taker. Mbappe took issue with this and is thought to have confronted Neymar face-to-face the next day. They were distant for a short time afterwards but there is no lingering problem.\nAdvertisement\nTaken together, these factors make managing PSG a challenge, particularly for a coach stepping into his first role at a so-called super club.\nThe immediate question after PSG’s exit is what it means for Galtier. Many of those spoken to by The Athletic cannot foresee that he continues in the role, although it appears he is safe for now, with a decision likely to be made at the end of the season.\n“My future? It’s really too early to talk about it,” Galtier said after the defeat by Bayern. “It obviously depends on the management and my president. There’s disappointment. The club had a lot of hopes (for the Champions League). I stay focused on the end of the season with a lot of energy and determination.”\nMuch will rely on the direction PSG wish to take from the crossroads at which they find themselves. Do they continue down the road started by Campos? Or do they reset once more?\nA return for Thomas Tuchel, the only coach to have led PSG to a Champions League final, would be difficult. He remains popular at the club — the principal issue that led to his dismissal in December 2020 was a fall-out with the former sporting director, Leonardo. However, it is unlikely he will go back. At the time, he was seen as wanting more control of recruitment, which makes him an uneasy fit in Paris.\nLuis Enrique is another who is available after leaving the Spain job, while so too is the former France captain Zinedine Zidane, although it is thought he was never close to getting the job when Galtier was appointed last summer.\nThe futures of the club’s highest-profile players are up in the air, too, and there remains an open question about whether it is worthwhile to continue fielding three superstars when so far it has failed to deliver in Europe. Mbappe is the talent around which many think the club should build its future and the constant thought of an exit, fuelled by a contract that runs until 2024 and one where the forward has the power to decide whether to extend or not, means his long-term future will forever be a live issue.\nAdvertisement\nBefore Bayern, multiple sources described how Mbappe had spoken more positively than ever before about the PSG project and were optimistic about his commitment. Post Bayern, he told the waiting press: “I’m calm, the only thing that matters to me this season is winning the championship and then we’ll see.”\nHe must make a decision by the summer and, depending on his answer, PSG will then need to decide if they were to sell him or run the risk of losing him for free. They hope to know by May.\nBeyond Mbappe’s situation, there is Messi’s contract, which expires this summer. Those close to Messi’s camp believe he is likely to stay, with talks ongoing. Neymar is contracted until 2027 and while some believe PSG would let him go, there are no talks on the matter and nothing is on the horizon. He had surgery today on his ankle — he will be out into the summer — further complicating any potential move. The priority is Mbappe’s situation, but the futures of Kimpembe (2024), Marquinhos (2024) and Sergio Ramos (2023) are also all to be decided.\nFinancial limits may play a part in what is offered.\nCampos, meanwhile, is keen to remain and continue the project. He is said to feel the fans are patient and that he can build a team as he has done elsewhere. Manchester City’s Bernardo Silva is admired, having been a target last summer too.\nFundamentally, though, PSG have to choose a path for the club. On the field, there is the question of how they can match the consistency of a club like Bayern, dominating domestically but competitive in Europe. And then also the inexplicable reasons why they have not capitalised on an astonishing hotbed of talent in Paris. The progression of Warren Zaire-Emery, 17, and the involvement of Bitshiabu, too, suggest some attempt at rectifying that.\nBut there are also off-field questions about the project. In January, as Al-Khelaifi outlined the year ahead, the PSG president pointed to the club’s growing international footprint: “More revenue, more fans, more digital — 30 million followers on TikTok,” he said in a speech relayed to The Athletic.\nAdvertisement\nPSG, through collaborations with Jordan in 2018 and the addition of stars like Messi, have become a marketing success. For a club that is a state-sponsored project by Qatar, the soft power and influence already conveyed could well be enough in itself.\nLooming in the background, of course, is the Qatari bid tabled for Manchester United and the legacy that could leave for their Parisian project.\nAl-Khelaifi, though, was keen to touch on what can make the team a success. “When we work together, we are unbeatable,” he said.\nRight now, such alignment between the club’s sporting direction and marketing impulse feels disjointed at best.\nAdditional reporting by David Ornstein, Adam Crafton, Pol Ballus and Jack Pitt-Brooke\n(Top photo: Getty Images; design Sam Richardson)",
  "word_count": 3582,
  "scraped_at": "2026-02-14T01:59:46.889519",
  "_text_extracted": true
}