{
  "article_id": "9fd454aa8eb4",
  "url": "https://metro.co.uk/2025/12/29/chelsea-signing-targeted-january-move-just-six-months-35-5m-transfer-25905790/",
  "title": "Chelsea signing targeted for January move just six months after £35 . 5m transfer",
  "date": "20251229T160000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ajax are exploring the possibility of re-signing Jorrel Hato on loan from Chelsea in the January transfer window, according to reports in the Netherlands.\nHato departed Ajax to join Chelsea for an initial fee of £35.5million in the summer, with the Dutchman putting pen to paper on a seven-year deal at Stamford Bridge.\nBut while Hato touched down in English football with weighty expectations on his shoulders, the 19-year-old but has so far struggled to make an impact in west London, making just two starts in the Premier League.\nSince his shaky performance against Qarabag in the Europa League, fitness problems have meant Hato has been limited to just one solitary appearance, which came in the side’s Carabao Cup victory over Cardiff.\nDespite his mixed start, Hato is highly thought of by Chelsea’s hierarchy and Enzo Maresca remains confident that the versatile youngster – who covers both left-back and centre-back – can go on and be a key asset for the club.\nWith Hato struggling for regular game-time with the Blues, there has been some talk and speculation that the Netherlands international should be allowed to leave on a temporary basis next month.\nDutch newspaper De Telegraaf claim Hato is ‘clearly the number one on Ajax’s list’, with the Eredivisie outfit looking to strengthen at left-back just six months after letting the defender leave for Chelsea.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHowever, the report claims it is ‘questionable’ as to whether Chelsea would be willing to loan Hato back to his former club midway through the campaign.\nBurnley’s Quilindschy Hartman, Everton’s Adam Aznou, Utrecht’s Souffian El Karouani and Como’s Ignace Van Der Brempt are also on Ajax’s shortlist should Chelsea decide to block Hato’s exit.\nHato’s current contract with the Club World Cup holders runs through to June 2032.\nEarlier this month, Maresca confirmed that Hato had been in line to make his comeback from injury for Chelsea in the side’s Premier League meeting with Newcastle.\nBut Hato suffered another frustrating setback during Chelsea’s warm-up at St James’ Park and it’s unclear when the teenager will be able to return to the fold.\nAsked whether Hato could return to the squad for Chelsea’s upcoming match against Bournemouth, Maresca told reporters on Monday: ‘I don’t think so, no, I don’t think so.’\nBefore Chelsea’s Champions League win over Ajax back in October, John Heitinga – Ajax’s then manager – suggested Hato’s peripheral role summed up difference in strength between the two squads.\nMore Trending\n‘They have a lot of quality in every position,’ Heitinga told reporters at the time.\n‘To name one example, Jorrel Hato was one of our best players at Ajax.\n‘He is bought by Chelsea and he is sitting here on the bench. He hardly plays.\n‘That says a lot about this Chelsea team, about the quality, because Jorrel was a difference-maker for us.’\nShould Chelsea let Hato leave on loan in January?\n-\nYes\n-\nNo\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ruben Amorim tells Man Utd star he has ‘no chance’ of playing against Wolves\nMORE: Alan Shearer identifies three signings Chelsea need ahead of January transfer window\nMORE: Mikel Arteta speaks out on Arsenal’s January transfer window plans",
  "word_count": 598,
  "scraped_at": "2026-02-14T01:49:57.601299",
  "_text_extracted": true
}