{
  "article_id": "9fe1c20afdcd",
  "url": "https://thepeoplesperson.com/2023/06/27/manchester-united-have-earmarked-three-replacements-should-mason-mount-deal-not-work-out-265828/",
  "title": "Manchester United have earmarked three replacements should Mason Mount deal not work out",
  "date": "20230627T054500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United manager Erik ten Hag kept his part of the bargain as he guided the club back to the Champions League while ending a six-year trophy drought.\nHowever, as has been seen in the past, the club are once again struggling to back the manager after a season of finishing in the top-four.\nAfter admitting defeat in the race for Tottenham’s record goalscorer Harry Kane and Serie A winning defender Kim Min-jae of Napoli, a deal for Chelsea’s Mason Mount could befall a similar fate.\nUnited’s Mount alternatives\nUnited have seen three of their bids rejected by the London side and the Red Devils are prepared to walk away if a compromise cannot be reached.\nThe latest reports indicate Chelsea are open to reaching a middle-ground but United, aware of their budgetary issues, have no plans to budge from their final offer.\nIn case they do miss out on the Englishman, ESPN have reported that a three-man shortlist has been prepared by the club.\n“Manchester United are considering other midfield targets because of fears that negotiations with Chelsea for Mason Mount are stalling, sources told ESPN.\n“Sources have told ESPN that United’s latest offer for Mount remains on the table, but enquiries have been made about the availability of other targets, including Brighton midfielder Moises Caicedo, Ajax’s Mohammed Kudus and Taylor Booth at FC Utrecht.”\nThe trio have all been previously linked with a move to Old Trafford and have their own redeeming qualities.\nWhat will United do?\nThe Brighton star is Chelsea’s top target and they are advanced in negotiations and the Ecuadorian will cost significantly more than Mount.\nKudus was mainly played as the No 8 in a two-man system or as the attacking midfielder by Ten Hag during his time as Ajax boss but the Ghanaian has shone up front last season.\nAs for Booth, he still seems raw having just played a single season of regular first-team football and playing for FC Utrecht in the Eredivisie and playing for United is not the same.\nIt will be interesting to see how United progress on this front. One thing is for certain. Ten Hag needs backing and he needs it fast as pre-season is approaching and he wants new players to be present for the tour.",
  "word_count": 380,
  "scraped_at": "2026-02-14T02:12:52.294834",
  "_text_extracted": true
}