{
  "article_id": "a00e4bb4b6df",
  "url": "https://www.arsenal.com/kai-havertz-transfer-premier-league-chelsea-mikel-arteta-edu",
  "title": "Kai Havertz joins on long - term contract",
  "date": "20230628T210000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Germany international Kai Havertz has joined us from Chelsea on a long-term contract.\nThe 24-year-old has been a key player at both club and international level in recent seasons and already has 35 appearances for the German national team to his name, scoring 13 times and representing his country in two major tournaments.\nHavertz is a graduate of Bayer Leverkusen’s academy, where he signed his first professional contract in 2016. During his four years at Bayer Leverkusen, Havertz made 150 appearances, scoring 46 goals and assisting 31 times. In October 2016, Kai became Leverkusen’s youngest ever debutant in the Bundesliga at 17 years and 126 days, and also went on to become their youngest ever scorer in the league, scoring a late equaliser in a 3-3 draw against VfL Wolfsburg in April 2017.\nIn summer 2020, Havertz moved to the Premier League, by signing for Chelsea. During his three seasons in west London he made 139 appearances, scoring 32 goals and assisting 15 times in all competitions. Kai notably scored the only goal of the match in Chelsea’s victory over Manchester City in the 2021 UEFA Champions League Final.\nSporting Director Edu said: “We’re excited to bring Kai to the club and great work by everyone to get this deal complete. Kai is an exciting addition to our squad, who will bring great attacking quality and versatility.\n“As an experienced 24-year-old, his signing represents another important step in strengthening our young core of talented players we have at Arsenal. We look forward to working with Kai.”\nManager Mikel Arteta added: “Kai is a player of top quality. He has great versatility and is an intelligent player. He will bring a huge amount of extra strength to our midfield and variety to our play.\n“We welcome Kai and his family to Arsenal Football Club and we are all excited to start working with him when we start pre-season training soon.”\nOur new signing said: “It's super exciting for me to be joining this amazing club and to be part of the Arsenal family. This club has such a big history, and I hope we can achieve lots of things.\n“The mentality in the Arsenal squad is very high and you can feel that. That was one of the reasons why it has been so hard to play against Arsenal recently.\n“The aim is to win trophies and I’m going to give everything to do that for the supporters and everyone at the club. I'm now looking forward to meeting all the players and the staff when we come back for pre-season.”\nKai will join up with his new team mates for pre-season training in early July and will wear the number 29 shirt - you can purchase your replica Havertz 29 shirt here.\nEveryone at Arsenal welcomes Kai to the club.\nThe transfer is subject to the completion of regulatory processes.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 507,
  "scraped_at": "2026-02-14T01:50:37.772778",
  "_text_extracted": true
}