{
  "article_id": "a021fbdf0606",
  "url": "https://dailytrust.com/npfl-pillars-remo-stars-others-stake-unbeaten-run/",
  "title": "NPFL : Pillars , Remo Stars , others stake unbeaten run",
  "date": "20240921T001500Z",
  "domain": "dailytrust.com",
  "source_country": "Niger",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Although matches involving the two clubs that are representing Nigeria in this year’s CAF inter-club competitions, Enyimba and Enugu Rangers, have been shifted to October 2, other mouth-watering week three matches in the 2024/2025 Nigeria Premier Football League (NPFL) will hold this weekend across the designated match venues.\nEnugu Rangers’ week 3 fixture at home against Bayelsa United has been moved to October 2 to enable them to travel to Angola for their Champions League second preliminary round return leg clash with Sagrada Esperanca. The reigning NPFL champions won the first leg 1-0 in Uyo.\nOn their part, Enyimba will host Etoile Filante of Burkina Faso in the return leg of the CAF Confederation Cup playoff on Sunday before their rescheduled NPFL week 3 clash with Akwa United on October 2 in Aba.\nIn the absence of the continental clubs, the biggest clash this weekend in the NPFL is without doubt the fixture between former champions, Kano Pillars, and last season runners up, Remo Stars. This is a confrontation between two big teams that are yet to suffer defeat in the current season.\nWhile Kano Pillars opened their campaign with a 3-0 smashing of new boys Ikorodu United followed by a well-deserved 1-1 draw at Bayelsa United, Remo Stars were in Umuahia where they stunned Abia Warriors 2-0 before returning to Ikenne to earn a slim 1-0 victory over regional rivals Sunshine Stars to mount the top position on the log with the maximum six points.\nSo, tomorrow’s week three match offers Kano Pillars who have amassed four points from two matches an opportunity to dislodge Remo Stars from the top of the table but the ‘Masu gida’ boys led by coach Usman Abdallah, must be at their best to accomplish the herculean task on Sunday.\nWhen both clubs battled over two legs in the 2023/2024 season, there was nothing to separate them as they produced similar results in each of the ties. In the first round clash in Kano, Pillars came out tops 2-1 with Ibrahim Mustapha, who is now with El-Kanemi Warriors and Rabiu Ali scoring a goal each in the victory.\nIn the return leg in Ikenne, Olamide Akinyele and captain Nduka Junior scored a goal each while Mustapha Salisu reduced the deficit as Remo Stars avenged 2-1 defeat suffered in Kano in the first leg clash.\nAs they go head-to-head again, all eyes will be on the 43-year-old captain of Kano Pillars, Rabiu Ali, who has already scored two goals in the present campaign. Apart from the inspirational captain, Auwalu Ali Malam, who netted a goal at Bayelsa United, is another threat that Remo Stars must be wary of.\nBut as they fancy their chances, Pillars must keep an eye on Remo Stars’ goal scoring attacking wing-back, Sodiq Ismail. Apart from his dangerous crosses into the box, he is not goal shy. He set Remo Stars on the way to victory at Heartland in week one.\nAnother battle of unbeaten clubs will be staged today at the Lafia Township Stadium, where Lobi Stars faceoff with Rivers United in a clash of former champions.\nAfter opening their campaign with an away draw at Bendel Insurance, Rivers United returned home to whip Heartland 3-1 to stay unbeaten while Lobi Stars who were forced to a 1-1 draw at home by Akwa United had their week 2 tie with Enyimba shifted due to the latter’s continental engagement.\nRivers United who are managed by former Super Eagles coach George Finidi, face an uphill task against Lobi Stars, who are eager to impress under the new board led by the Benue State Director of Sports, Dr. Philip Nongu.\nWith most of the players who made them a dreaded side in the previous season still around, Lobi Stars are looking good to pick their first win of the season.\nIn this same fixture last season in Port-Harcourt, Rivers United triumphed 1-0 over Lobi Stars but in the return leg, the ‘Pride of Benue’ took back their pound of flesh winning 2-1 at the Lafia Township Stadium.\nElsewhere, there will be another clash of unbeaten sides in Jos where Plateau United would welcome Niger Tornadoes in a north-central derby that promises to be entertaining. Both clubs have four points each from two matches.\nWhile Plateau United kicked off their campaign a home with a slim 1-0 win over Katsina United before the 1-1 draw against 3SC in Ibadan in week 2, Niger Tornadoes shocked many with a convincing 2-1 win against Kwara United in Ilorin but were forced to a 1-1 by north-central rivals Nasarawa United in Minna.\nWhen both teams battled over two legs in the past season, Plateau United had the upper hand as they pipped Tornadoes 3-2 at the ‘Ikon Allah’ boys’ adopted home ground in Kaduna before the barren draw in the second round in Jos. On current form, there is nothing to separate the two sides, but Tornadoes may want to build on their first away win of the season in Ilorin.\nThe ‘Chanji Boys’ as Katsina United are called will take a long trip to the east to battle embattled Heartland at the Dan Anyiam Stadium in Owerri. While the ‘Nazi millionaires’ under the tutelage of Emmanuel Amuneke have suffered back-to-back losses already, Katsina United recovered from their opening day defeat at Plateau United to beat Bendel Insurance 2-1 at the Muhammadu Dikko Stadium.\nThe coach Bishir Sauduki tutored lads will aim to inflict a third consecutive defeat on Heartland who were relegated last season but returned to the topflight on the ticket of Beyond Limit.\nWhen Heartland and Katsina United clashed last season, both fixtures ended in 1-1 draw. In the first leg in Owerri, Katsina United fell behind through Alladoum Kolimba’s own goal, but Michael Okoro Ibe restored parity for his side to earn a point in the fixture.\nIn the return leg, Barnabas Ingya put Heartland ahead in the 56th minute, but Nafiu Ibrahim equalised in second half added time for the match to end in a draw.\nNPFL returnees, El-kanemi Warriors had their week two fixture with Kwara United shifted due to the flood in Maiduguri, but they will be back in action today as they visit Nasarawa United.\nIn Lafia, the reigning Federation Cup champions who recorded a 0-0 draw in their opening match against Rangers in Enugu will be up against the ‘Solid Miners’ who are yet to taste defeat in the current season.\nAlthough both teams spent the past season in the lower division, when they faced off in the 2022/2023 season before their relegation, El-Kanemi Warriors defeated Nasarawa United 2-1 home and away.\nOn Sunday, the ‘Afonja Warriors’ as Kwara United are known will welcome newcomers Ikorodu United on Sunday as they aim to atone for the last home loss to Niger Tornadoes.\nThe tie is also an opportunity for the Lagos boys to shake off the big defeat at kano Pillars as they brace for life in the Nigerian topflight. This is the first time both teams will be meeting in the NPFL, so it is a historic clash.\nIn Akure, Abia Warriors, one of the first to suffer home defeat in the current season will have their hands full with Sunshine Stars who won their opening match against Bayelsa United but were pegged back in the south-west derby against Remo Stars the following week.\nApart from the continental clubs’ rescheduled fixtures, the week three tie between Bendel Insurance and 3SC in Benin City has been postponed to October 2 due to this weekend’s gubernatorial election in Edo State.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 1294,
  "scraped_at": "2026-02-14T02:20:44.348557",
  "_text_extracted": true
}