{
  "article_id": "a05dc8a41210",
  "url": "https://metro.co.uk/2026/02/11/gary-lineker-urges-tottenham-look-at-two-ex-chelsea-managers-replace-thomas-frank-26835485/",
  "title": "Gary Lineker urges Tottenham to  look at  two ex - Chelsea managers to replace Thomas Frank | Football",
  "date": "20260211T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ex-Tottenham striker Gary Lineker has encouraged the club to pursue a possible move for Enzo Maresca following Thomas Frank’s dismissal as manager.\nTottenham announced that Frank had been relieved of his duties this morning in the wake of the side’s 2-1 loss at home to Newcastle in the Premier League.\nIt was just the latest in a desperately poor run of domestic results, with the club languishing down in 16th place in the table, just five points above the relegation zone.\nSpurs were also eliminated from both the FA Cup and the Carabao Cup under Frank and their impressive group-stage showing in the Champions League was ultimately not enough to keep the Dane in the job.\nThere had been a growing feeling of discontent amongst Spurs’ fanbase as the season wore on – and Frank’s role was deemed to be untenable after chants of ‘You’re getting sacked in the morning’ reverberated around the Tottenham Hotspur Stadium on Tuesday night.\nThe 52-year-old leaves his post after just eight months at the helm having previously managed Brentford for seven years.\nIt’s understood the north London outfit will first hire an interim head coach – ahead of their upcoming match against arch-rivals Arsenal – before appointing a long-term solution in the summer.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe likes of Robbie Keane, Oliver Glasner, Xavi and Mauricio Pochettino have all been linked with the vacant position in the intervening hours, with ex-Brighton and Marseille boss Roberto De Zerbi installed as the early bookies’ favourite.\nLineker can understand why Tottenham might consider bringing Pochettino back to the club given the affinity the Argentine shares with the fanbase after his previous managerial spell between 2014 and 2019.\nBut the former Match of the Day host believes Maresca – who succeeded Pochettino at Chelsea – should also be under consideration, a month-and-a-half on from his sacking at Stamford Bridge.\n‘People talk about him [De Zerbi] being the style of manager that perhaps the Spurs fans would accept and enjoy,’ Lineker said on The Rest Is Football podcast.\n‘A little bit of the criticism of Thomas Frank was that he was a little more of a defence-minded coach than perhaps someone like Ange Postecoglou previously.\n‘My point would be that the most important thing is winning and that’s what you need.\n‘De Zerbi is favourite along with John Heitinga who obviously the coach, so he’d jump in if they don’t get a manager immediately. Those two are the favourites.\n‘Interestingly, for me, someone like Maresca, 20/1 with the bookies, and if I were Tottenham then I’d very much look at him even though he’s former Chelsea and they don’t like that kind of stuff, the Tottenham fans, possibly.\n‘But having said that, I think the Tottenham fans would really, really like a former Chelsea coach as well, but mainly a former Tottenham coach, and that will be Pochettino.’\nPochettino remains committed to his role as head coach of the United States’ national team until the conclusion of the side’s World Cup campaign this summer.\nLineker can therefore envisage a scenario where Spurs turn to Pochettino after calling upon a temporary option for the time being.\n‘He’s got a job to do in the summer so he’s not going to be free until after that if he decided to leave the USA national team,’ he added.\n‘I suspect they won’t do that well in the World Cup because they haven’t really god the players, but home advantage can drive you through. If he got them to the last 16 then that wouldn’t be a bad effort.\n‘He could become available so do they give it to an interim until the end of the season?’\nGiven the way Tottenham’s results have spiralled, Lineker’s colleague on The Rest Is Football, Alan Shearer, is not in the least bit surprised to see Frank lose his job.\n‘They’re in a relegation battle after last night’s performance and I don’t think the performances could go on,’ Shearer – the Premier League’s all-time top scorer – explained.\n‘The Tottenham fans made their feelings known last night both with their booing and also empty seats which, for an owner or a chairman, that’s not a good look.\n‘So I’m not surprised at all that it happened this morning.’\nAsked whether social media has made life tougher for managers in the modern game, Shearer replied: ‘The top and bottom of it is that it hasn’t changed in terms of the rules of a manager or a coach: you get results or the noise around you is going to get loud.\nMore Trending\n‘It’s louder now than it’s ever been because of social media, because of podcasts, because of fan channels, because of everything else, but, ultimately, that noise stays away if you win matches.\n‘That’s what it boils down to and Tottenham haven’t been winning matches.\n‘They’re in a relegation fight and that’s why, ultimately, he’s lost his job. Not because of social media, not because of fan unrest, it’s because results have been nowhere near good enough for Tottenham.\n‘Someone has to pay the price and the vast majority of the time that’s the head coach or the manager.’\nWho would be the better appointment for Spurs?\n-\nEnzo Maresca\n-\nMauricio Pochettino\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd dodge bullet as Roy Keane says Chelsea signing ‘lacks quality’\nMORE: Gary Neville ‘objects’ to Roy Keane comment after brutal assessment of Man Utd star",
  "word_count": 976,
  "scraped_at": "2026-02-14T01:59:36.831482",
  "_text_extracted": true
}