{
  "article_id": "a075ba78e4dd",
  "url": "https://metro.co.uk/2026/01/18/xabi-alonso-stance-taking-tottenham-job-revealed-26358689/",
  "title": "Xabi Alonso stance on taking Tottenham job revealed",
  "date": "20260118T044500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Xabi Alonso would turn down an approach from Tottenham if Thomas Frank is sacked, according to reports.\nFrank’s future was placed in further doubt on Saturday after Spurs were beaten 2-1 at home by West Ham.\nSpurs have registered just one win in their last seven Premier League matches, while they crashed out of the FA Cup last weekend following a 2-1 defeat against Aston Villa.\nThe Independent reports that Spurs are now seriously considering Frank’s position and the club’s hierarchy are ‘debating’ whether to keep the 52-year-old in place for the team’s Champions League game at home to Borussia Dortmund on Tuesday.\nThe report adds that the prospect of appointing Alonso has been discussed by Tottenham’s board, however, the 44-year-old ‘feels he will have better options over the coming months’.\nAlonso, who has also been linked as a potential replacement for Arne Slot at Liverpool, was sacked by Real Madrid on Monday just seven months after joining the Spanish club.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSpurs supporters sang, ‘you’re getting sacked in the morning’, towards Frank during the defeat to West Ham which has left the team 14th in the Premier League.\n‘Of course, I’ve probably had better times, it’s probably not the best time of course,’ Frank said after the game when asked about the reaction from Spurs fans.\n‘But I understand, I’m the man in charge. So the blame will go to me. That’s fair, no problem in that sense.\n‘As long as they are backing the players, doing everything they can, to support them and drive them forward, that’s what we do, and we will keep going forward.\nNext Tottenham manager odds\nOliver Glasner 2/1\nMauricio Pochettino 4/1\nXabi Alonso 4/1\nMarco Silva 6/1\nEnzo Maresca 8/1\nRuben Amorim 10/1\nJurgen Klopp 12/1\nRobert De Zerbi 12/1\nXavi Hernandez 14/1\n‘If you’re not winning enough, we know you will not get enough support from the fans. But when we’re winning, it will change, when we start winning again. Which we will do. I’m not in doubt of that.\nMore Trending\n‘I think also you can look a little bit at the performances. Let’s say the Bournemouth and the Villa and this game here, if the players stop running, or stop doing anything, or not working hard, and we are not the team that’s closest to winning, then you can say okay but I think the team is working very hard. And I still think, and I know it sounds a little bit crazy, that we are close to something very good, than further away.\nPrefer us to the others? Then tell Google!\nAs a loyal Metro reader, we want to make sure you never miss our stories when searching for your news. Whether it is the latest politics news explained, live football coverage or a showbiz scoop.\nClick here and tick Metro.co.uk to ensure you see stories from us first in Google Search.\n‘I think you all saw the game today, we could easily have won this 2-1. I think it’s no excuses. But also the reason we’re a little bit down to the bare bones with players. And we also need some of the offensive players to score a goal or two.\n‘All that is difficult for me to do like that and click with a finger. But I can promise that I’m sitting here, giving everything, every single day. I feel the trust from everyone and there’s only one way, we need to keep going.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Tottenham make Thomas Frank decision before Champions League clash\nMORE: Manchester United make decision on Joshua Zirkzee deal, confirms Roma chief\nMORE: Morocco explain shocking Brahim Diaz penalty miss in AFCON final defeat",
  "word_count": 685,
  "scraped_at": "2026-02-14T01:50:01.809410",
  "_text_extracted": true
}