{
  "article_id": "a097d4b30242",
  "url": "https://www.caughtoffside.com/2025/09/02/marc-guehi-planning-failed-move-liverpool/",
  "title": "Marc Guehi planning to release a statement after failed Liverpool move",
  "date": "20250902T173000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to Ed Aarons of The Guardian, Crystal Palace captain Marc Guehi has been left extremely unhappy after his long-anticipated transfer to Liverpool fell through at the very last minute of the summer window.\nThe England international had been the subject of concrete negotiations between the two clubs, with a fee of around £35 million reportedly agreed in principle.\nGuehi, who had given no indication of wanting to force the move, continued to train and play for Palace throughout the saga, determined to handle the situation with professionalism.\nHowever, Palace ultimately pulled the plug on the deal when they were unable to secure a suitable replacement in time.\nMarc Guehi is upset over his failed move to Liverpool\nFor Guehi, the collapse of the move has left a sour taste. Aarons reports that the defender feels he conducted himself correctly, respecting his contract and commitment to Palace while waiting for the clubs to finalise terms.\nSources close to the player suggest he is deeply frustrated by how events unfolded, particularly as the transfer breakdown was beyond his control.\nThe 25-year-old, who has developed into one of the Premier League’s most consistent centre-backs since joining Palace from Chelsea, had been keen on the switch to Anfield, where he would have linked up with fellow England teammates and played Champions League football under Arne Slot.\nCrystal Palace defender is planning to release a statement\nWith Palace standing firm, however, Guehi now finds himself in a tricky position, balancing his loyalty to his current club with his ambitions to compete at the very highest level.\nGuehi is preparing to release a public statement in the coming days to clarify his stance and outline his perspective on the failed move. Although he remains committed to performing for Palace in the short term, the situation is likely to fuel further speculation about his long-term future.\nFor now, Palace have retained their captain, but the fallout from this saga may linger well into the season.\nCrystal Palace set to agree deal with England international after deadline day",
  "word_count": 341,
  "scraped_at": "2026-02-14T01:58:57.496043",
  "_text_extracted": true
}