{
  "article_id": "a0c62c63793a",
  "url": "https://punchng.com/1941177-2/",
  "title": "Harry Kane Double Leads Bayern Munich 5 - 0 Rout of Hamburg",
  "date": "20250913T200000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bundesliga: Kane scores brace as Bayern Munich trash Hamburg 5-0\nAgency report\nHarry Kane scored in each half as Bayern Munich piled the pain on old foe Hamburg in a 5-0 home win on Saturday.\nKane brought his Bayern tally to 93 goals in 101 games while Serge Gnabry, Luis Diaz, and Aleksandar Pavlovic also scored.\nAlongside Borussia Dortmund as the only Bundesliga sides to win the European Cup, Bayern and Hamburg have taken different paths since dominating German football in the 1980s.\nBayern have won 12 of the past 13 league titles, while Hamburg were promoted last season after seven seasons in the second division.\nGnabry hammered the ball into the roof of the net just three minutes in. Bayern junior Pavlovic finished off a team move six minutes later.\nKane converted a penalty awarded for handball with 26 minutes played. Diaz made it four three minutes later, his fourth goal since joining Bayern in the summer.\nNicolas Jackson came on at half-time, making his debut after moving to Bayern on loan from Chelsea in the summer.\nBayern open their Champions League campaign at home against Chelsea on Wednesday.\nThe England captain then started and finished off his own move to score Bayern’s fifth and final goal in the 62nd minute.\nSince Hamburg’s last win in Munich in 2007, Bayern have won 16 and drawn three of their home matches in the series, scoring 76 goals to Hamburg’s seven, a run which includes two 8-0 wins and a 9-2 victory.\nBayern moved atop the table as the only side with three wins from three.\n– Guirassy scores, Dortmund wins –\nSerhou Guirassy scored for the eighth straight league match as Dortmund won 2-0 at 10-man Heidenheim.\nHeidenheim’s Budu Zivzivadze received a red card 21 minutes in for a studs-up challenge just below the knee on Dortmund’s Felix Nmecha.\nAn acrobatic save from Heidenheim goalie Diant Ramaj, on loan from Dortmund, denied Guirassy from the ensuing free-kick.\nThe Guinean did not take long to get on the scoresheet, heading in a pinpoint Julian Ryerson cross with 33 minutes played.\nIn the sixth minute of first-half stoppage time, Karim Adeyemi danced through the Heidenheim defence before squaring to Maximilian Beier, who tapped Dortmund two in front.\n“Our goal is to become champions, so we have to get points. We did that,” Beier told Sky Germany.\n“When you’re a man up the entire game, that makes it easier.”\nAsked about Guirassy’s performance, Dortmund sporting director Sebastian Kehl said simply: “Serhou scores again.”\nGuirassy, 29, has only failed to score in two of his past 15 matches for Dortmund in all competitions, racking up 18 goals in the process.\nChampions League finalists in 2024, Dortmund kick off their European season away at Juventus on Tuesday.\nElsewhere, Freiburg scored three goals in the final 10 minutes to beat Stuttgart 3-1 at home.\nLeft to carry the mantle up front after Nick Woltemade’s big-money move to Newcastle, Ermedin Demirovic put Stuttgart in front with a classy backheel after 20 minutes, holding up two Freiburg defenders and sliding a slick finish into the corner.\nStuttgart looked set to hold on for victory until Freiburg’s Igor Matanovic kick-started a late flurry, scoring with nine minutes remaining.\nDerry Scherhant put the hosts in front five minutes later and Matanovic grabbed another in stoppage time for Freiburg’s first points of the season.\nUnion Berlin gave away two penalties and finished a man down in a 4-2 home loss to Hoffenheim.\nHoffenheim’s Fisnik Asllani scored a brace, while Andrej Kramaric and Tim Lemperle converted from the spot.\nJohan Bakayoko scored his first goal since arriving at RB Leipzig in the summer in a 1-0 win at Mainz.\nPromoted Cologne scored in the 14th minute of second-half stoppage time to snatch a point in a 3-3 draw at Wolfsburg, with Jakub Kaminski providing the crucial goal for the visitors against his parent club.\nAFP",
  "word_count": 653,
  "scraped_at": "2026-02-14T01:49:53.054157",
  "_text_extracted": true
}