{
  "article_id": "a0eba1b7d78f",
  "url": "https://timesca.com/backup-goalkeeper-anarbekov-secures-champions-league-berth-for-kairat-almaty/",
  "title": "Backup Goalkeeper Anarbekov Secures Champions League Berth for Kairat Almaty",
  "date": "20250827T131500Z",
  "domain": "timesca.com",
  "source_country": "Kyrgyzstan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Temirlan Anarbekov, the reserve goalkeeper for Kazakhstani football club Kairat Almaty, played a starring role as his team reached the UEFA Champions League group stage for the first time. On August 26 Kairat secured its place in Europe’s premier club competition this season by beating Scottish champions Celtic in the final qualifying round.\nKairat entered the Champions League qualifiers after claiming their fourth domestic title last year. This summer, the Kazakh champions successfully navigated three qualifying rounds, defeating Slovenia’s Olimpija, Finland’s KuPS, and Slovakia’s Slovan Bratislava, to reach a decisive playoff against Celtic.\nThe Scottish club, a regular participant in recent Champions League group stages, posed a formidable challenge. Kairat, by contrast, had previously reached the autumn phase of European competition just once, in the lesser UEFA Conference League three years ago.\nIn the first leg in Glasgow last week, Kairat held Celtic to a 0-0 draw. However, the result came at a cost: first-choice goalkeeper and national team regular Alexander Zarutsky sustained a leg muscle injury and had to be substituted. Temirlan Anarbekov, the team’s backup, stepped in.\nWith Zarutsky still sidelined, Anarbekov started the return leg in Almaty. He delivered a flawless performance, keeping a clean sheet through regular time and two 15-minute periods of extra time.\nThe match was ultimately decided by a penalty shootout. Anarbekov stole the spotlight by saving three out of five attempts. Kairat won the shootout 3-2. The team became only the second from Kazakhstan to reach the Champions League group stage, following Astana’s breakthrough in 2015.\nKairat will discover its group-stage opponents during the Champions League draw on August 28. They are Kazakhstan’s sole representative in European competition this season, after Aktobe failed to qualify for both the Europa League and Conference League, and Shymkent’s Ordabasy and Astana exited in earlier rounds.\nMeanwhile, in neighboring Uzbekistan, the national football federation continues its search for a new head coach. As previously reported by The Times of Central Asia, former South Korea and Portugal manager Paulo Bento is the frontrunner for the role.",
  "word_count": 339,
  "scraped_at": "2026-02-14T02:11:49.083600",
  "_text_extracted": true
}