{
  "article_id": "a11ec2f05e64",
  "url": "https://thepeoplesperson.com/2026/02/03/manuel-ugarte-galatasaray-make-sensational-late-move-for-united-star-304602/",
  "title": "Manuel Ugarte : Galatasaray make  sensational late move  for United star - Man United News And Transfer News",
  "date": "20260203T160000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United had a quiet January transfer deadline day, as INEOS maintained their stance of only pursuing long-term targets.\nUnfortunately for Michael Carrick, United’s preferred midfield targets, Carlos Baleba and Elliot Anderson, were not available for sale during the winter window.\nFurthermore, United now face a battle to keep hold of Manuel Ugarte, as the Turkish window is open until Friday.\nGalatasaray trying to sign Manchester United midfielder\nAccording to Turkish-Football, Galatasaray have opened talks with United over a “sensational late move” for Ugarte. The development has “sent shockwaves through the Süper Lig.”\nThe league leaders are trying to sign the Uruguayan midfielder on an initial loan deal with an option to buy at the end of the campaign.\nIt is believed Galatasaray dream of partnering Ugarte with his fellow countryman Lucas Torreira.\nHowever, United are thought to be hesitant to sanction a mid-season exit despite a “lucrative loan package” from the Turkish giants.\nManuel Ugarte Stats: 2025/26 Season\nUgarte is one of only four senior midfielders, including Bruno Fernandes, at Carrick’s disposal.\nFurthermore, the Red Devils want a significant loan fee or a mandatory buy clause to be included in a deal to even consider the Lions’ proposal.\nManuel Ugarte wants Galatasaray move\nIt is understood Galatasaray are banking on the former Paris Saint-Germain midfielder’s desire for regular minutes to get the deal over the line. Carrick is yet to hand a start to the 24-year-old South American.\nThe report adds: “The Galatasaray board, led by İbrahim Hatipoğlu, are currently in direct contact with the player’s representatives.”\nIt is added that the lure of Champions League football and the chance to “join a revolution alongside the likes of Victor Osimhen” is an attractive proposition for Ugarte.\nFeatured image Shaun Botterill via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 317,
  "scraped_at": "2026-02-14T01:59:36.848652",
  "_text_extracted": true
}