{
  "article_id": "a12a22a38db8",
  "url": "https://english.aawsat.com/sports/5225363-maresca-leaves-chelsea-after-just-18-months-charge",
  "title": "Maresca Leaves Chelsea After Just 18 Months in Charge",
  "date": "20260101T190000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca left his role as Chelsea head coach on Thursday after just 18 months in charge, the Premier League club announced.\nThe Italian's exit from Stamford Bridge comes with the club fifth in the Premier League table -- 15 points adrift of leaders Arsenal -- with one win in their last seven top-flight games.\n\"Chelsea Football Club and head coach Enzo Maresca have parted company,\" said a club statement.\nSpeculation about Maresca's position increased during Chelsea's poor run of recent results amid reports of a worsening relationship between the coach and the club's hierarchy.\n\"With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the club believe a change gives the team the best chance of getting the season back on track,\" Chelsea added.\nMaresca did not attend the post-match press conference following a frantic 2-2 draw with Bournemouth on Tuesday, although his absence was attributed to illness.\nThe draw meant Chelsea had dropped 13 points at home from winning positions this season -- the bulk of the 15-point deficit between the Blues and Arsenal.\nHis decision to substitute Cole Palmer just after the hour mark during the Bournemouth game was booed by Chelsea fans.\nMaresca has stood by comments made on December 13 after a league win at home to Everton when he said many people at Chelsea \"didn't support me and the team\".\nHe repeatedly refused to clarify the comments, although he insisted they were not an attack on the club's supporters.\nThe 45-year-old said the days leading up to the 2-0 victory over Everton were \"the worst 48 hours\" of his time at Chelsea.\nMaresca's stock at Chelsea was high after the Blues beat Barcelona 3-0 in the Champions League in November.\n- Man City talks -\nBut damaging defeats by Leeds, Atalanta and Villa increased the pressure on the Blues boss.\nMaresca had also been linked as a potential successor to Manchester City boss Pep Guardiola should he end his decade-long stay at the Etihad Stadium at the end of the season.\nIt has been reported that Maresca twice informed Chelsea of talks with City, where he previously worked as one of Guardiola's assistants, as his contract required him to reveal negotiations with other clubs.\nChelsea sit 13th in the Champions League table and are likely to miss out on direct qualification for the last 16 via a top-eight finish.\nBut they have progressed to the semi-finals of the League Cup, where they will face Arsenal over two legs.\nMaresca's contract had been due to run until the summer of 2029, with a club option of a further year.\nChelsea won the UEFA Conference League and the Club World Cup in 2025 and Maresca also led them back into the Champions League via a fourth-placed finish in the Premier League in his only full season in charge.\n\"Thank you for everything, mister, and to your staff. For the work and the trust from day one, and for the memories,\" Chelsea defender Marc Cucurella posted on social media alongside pictures of the Spain international with Maresca.\nThe Blues return to action on Sunday at Manchester City, the first of nine fixtures across four competitions during a congested January schedule.\nLiam Rosenior, the head coach of French club Strasbourg, owned by Chelsea's parent company BlueCo -- a consortium headed up by US billionaire businessman Todd Boehly -- is a candidate to replace Maresca despite the 41-year-old's lack of Premier League experience.\nFormer Barcelona head coach Xavi, Crystal Palace manager Oliver Glasner, Fulham's Marco Silva and Bournemouth boss Andoni Iraola are other potential contenders for the job.",
  "word_count": 607,
  "scraped_at": "2026-02-14T02:27:05.499967",
  "_text_extracted": true
}