{
  "article_id": "a131a5177311",
  "url": "https://www.themag.co.uk/2026/02/ask-yourself-this-question-next-time-newcastle-united-lose-a-match/",
  "title": "Ask yourself this question next time Newcastle United lose a match",
  "date": "20260201T230000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ask yourself this question next time Newcastle United lose a match\nFirst, I’m going to double down on the views expressed in my instant assessment of the Liverpool v Newcastle United match at Anfield. They were filed about five minutes after full-time, so not exactly the product of rumination and reflection.\nIn the first half hour we made Liverpool look second-best all over the pitch: movement, athleticism, territory, creativity. You name it, we were better than the Premier League champions.\nUnfortunately, unlike at Wembley last March, that was as good as it got.\nThanks in no small part to Ekitike and Wirtz, megabucks transfers on megabucks wages, Merseyside’s second club undid us with alarming ease. Even though their former star man Salah contributed almost nowt, they were in the end comfortable winners.\nOther factors in our defeat? A third hard game in seven days, a growing injury list and, of course, the absence of a Swedish striker who had spearheaded our success last season.\nThe game was increasingly depressing from about 40 minutes in, as we ran out of gas just as Liverpool belatedly found a way to cope with three wide forwards running hard at their ponderous defence.\nSome fans wanted us to sit back from the start, form a low block and try to hit Liverpool on the break. With everyone fit and playing to the best of their ability, perhaps that would have worked.\nI prefer to take the game to the opposition, force them back and make them look distinctly ordinary. We’ve kicked off at Anfield too many times with a passive approach that invites them to dominate proceedings. They don’t need any invitation.\nIf the cracking shot from Barnes had bounced in off the post rather than back into the box at 0-0, or if Alisson had not produced a top save to deny Barnes in the second half, with the score 2-1, the complaints would not be as strident.\nWe lose at a ground where we have not won in this millennium and some fans want wholesale changes.\nWho honestly expected an away win or a draw? For half-an-hour, that was a realistic prospect.\nWe allegedly want a team that try. Well, we’ve got one and I’m happy to enjoy the ride.\nNewcastle United will play a minimum of 55 competitive matches this season. Apart from the bread-and-butter 38 in the domestic league, we have at least five in the League Cup, two in the FA Cup and 10 in the Uefa Champions League.\nThat’s being ultra-pessimistic, which seems to be the default position of many supporters despite the team’s impressive results and performances in these tournaments.\nBeat Qarabag and we are into the Round of 16 in the elite European club tournament. That would take United to 57. On form, we should progress. They were named by Rory Smith of the New York Times as potential dark horses last summer and they have reached the play-offs but, having lost 6-0 at Anfield, they cannot fancy a second leg at St James’ Park on February 24.\nWin the League Cup semi-final against Manchester City (I do know we are two down at half-time but stranger things have happened) and the total will become 58.\nBeat Villa in their back yard and we are up to 59 and counting. No wonder some of the players not on the sidelines nursing injuries are now showing signs of fatigue.\nI wouldn’t have it any other way. Much rather the packed schedule than, for example, the trials and tribulations of the Salfords. No European campaign, out of the League Cup, out of the FA Cup, hoping to gain a place in next season’s Champions League.\nFootball at the top level is all about money (as it has been for decades) but there is still space for dreams.\nOurs have come true three times already under the current management: two Champions League runs and a League Cup in our Mother Hubbard.\nBecause of PSR and other curbs, we have to take the route less travelled when recruiting and retaining. Accusations of multiple failures in these tasks make me laugh when comparing our decisions with, for example, Liverpool.\nYes, I realise they beat us on Saturday night but ask yourself this: how much of that was down to Salah and Van Dijk?\nEach of those, whose best years are behind them, is allegedly being paid £300k-plus a week with contracts that run until the end of next season.\nThe abuse they were getting from Liverpool fans in my Worthing local made the Mags who criticise Willock seem like St Francis of Assisi.\nThe contract extensions given to those Liverpool greats were viewed by many football followers as an overreaction to the loss of “call me Trent” last summer\nWhether that is an accurate perception, the deals look less than good value a few months down the line.\nBetween February 4 and the end of the month we will play eight times in 25 days. Even if we lose every match, I will not be pointing the finger of blame.\nEddie Howe, his assistants and the squad are competing on an uneven playing field.\nThe privileged six have massively bigger revenues. Clubs such as Bournemouth, Brighton and Leeds have much lighter workloads. It’s a cliché . . . but there really are very few easy matches in the Premier League. Nobody rolls over and asks you to tickle their tummy (except Chelsea in the first half against West Ham on Saturday!).\nThe aim at United is to become Champions League regulars. Almost impossible under the current restraints but I know everyone at St James’ Park is giving it their best shot.\nSo, happy to be still competing in February on multiple fronts with hope in my heart; or miserable as sin because we might end the season with no silverware?\nI know my answer to that question.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1000,
  "scraped_at": "2026-02-14T02:09:42.991008",
  "_text_extracted": true
}