{
  "article_id": "a1371d2ab251",
  "url": "https://allafrica.com/stories/202511130114.html",
  "title": "Nigeria / Gabon : 2026 FIFA WC Play - Off - Nigeria Vs Gabon Super Eagles Under Pressure , Undeterred",
  "date": "20251113T093000Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Super Eagles are in for a long, arduous trip as the hunt for a ticket to the 2026 FIFA World Cup gathers momentum. The route is strewn with death traps and landmines which requires careful planning and meticulous execution to navigate their way through to the 2026 FIFA World Cup.\nIt is no doubt, Nigeria's longest route to the World Cup in history. It will be a disaster for a country with such a rich pedigree to miss out of what has been projected to be the biggest World Cup ever, the first to be co-hosted by three countries - Mexico, Canada and the USA - with an expanded format that will see 38 teams representing their countries.\nThe immediate task before the Super Eagles are the CAF playoffs. Nigeria takes on Gabon today in Morocco, while Cameroon tackles DR Congo in the other semi final. Winners of the two matches face each other in the decisive one-legged final, for the solitary African ticket to the inter-continental playoffs in Mexico next year.\nMany Nigerians did not believe the Super Eagles could extend the World Cup conversation to this point. Their skepticism was based on the team's poor qualifying campaign in the group stage as it was largely inconsistent, except for a late surge in energy and purpose which saw them leapfrog the Republic of Benin to the second spot in Group C on the last day.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nSuddenly, there is a renewed sense of belief among Nigerian football fans. Many now believe the Super Eagles can achieve whatever they want, including qualifying for the World Cup if they play to their full potential.\nNigeria is the highest ranked team among the four African countries at the playoffs. The Super Eagles are ranked 41 in the latest FIFA rankings, while Gabon lies 36 places below in the 77th position. But football is not Mathematics, where two plus two equals to four.\nOne-time assistant coach of the national team, Sylvanus Okpala wondered why some people are asking, how Nigeria, a giant in African football could not pick the World Cup ticket directly from the group stage. \"I said no. That is football. Right now, the standard of the game has improved tremendously. Every country has players in top leagues of the world. Imagine Senegal beating England 3-1 recently in England. Can you compare the level of football in Sengal with that of England? It doesn't mean that when the World Cup begins, those that qualified automatically will do better than those who qualified through playoffs\n\"Nigeria's chances are as bright as any other country's in the playoffs,\" he quipped.\nStrategy\nOkpala advised the players to adopt the typically Nigerian never-say-die attitude, as they go about their business. \"When I was a player, I never gave up until there was nothing to play for any more,\" he said. \"Even as a coach, I adopt the same attitude,\" he emphasised.\"It depends on the players and the coach. What strategy is he going to apply? The most important thing in football is strategy. And that strategy has to revolve around the players, their individual abilities and characteristics. That is the only way that can take you to the next level.\"\nOkpala said the Super Eagles must strive for early goals. \"If they can adopt the same approach they handled the Republic of Benin, go for early goals, Gabon will fall because that will destabilise them and put to rest whatever plan they have.\"\nSuper Eagles coach Eric Chelle's style is always high octane pressure game, where the wingers supply the attackers with the ball to run down opponent's defences. With the players showing a better understanding of his preferred formation--the 4-4-2 diamond, the Super Eagles are beginning to roll back the glory years of the Green Eagles. He loves to confront the opponents with restless attackers, running behind the defence line in search of goals. One of Nigeria's all-time greats, Segun Odegbami said: Chelle's strategy mirrors the successful playing style from Nigeria's golden years.\n\"These are tactics taken straight from Father Tiko and Clemens Westerhof's football philosophy. He reminds me of how Nigerian football was at its best--quick forwards, swift counterattacks, and explosive strength and speed down the flanks.\"\nGabon has a number of top quality players in their team, including Pierre Emerick Aubameyang.\nChelle said he would fashion out a way of stopping Gabon. \"I can tell you that they have a very good coach with good philosophy. This is the finals and the most important thing is for us to focus on our team,\"\nChelle said,\"My job now is to analyse Gabon, and to think about the way we must approach the game. Maybe I will like to defend for the entire 90 minutes of the game or I will increase the pressure on the players.\"\nCoach Eric Chelle vs Coach Thierry Mouyouma\nThe ingredients for a fiery evening in Morocco's administrative capital is complete, with both Chelle and Mouyouma likely to adopt the 4-3-3 formation to play to the strengths of their lead orchestrators.\nChelle, unbeaten in four competitive matches with Nigeria in the qualifying campaign (three wins and a draw), will most likely stick with goalkeeper Stanley Nwabali, and in the absence of injured Olaoluwa Aina (injury) and Semi Ajayi (suspension), probably calibrate a rearguard of Benjamin Fredericks, captain William Ekong, Calvin Bassey and Zaidu Sanusi, with Wilfred Ndidi, Alex Iwobi and Frank Onyeka in midfield.\n2023 Africa Player of the Year Victor Osimhen, who netted six goals in the qualifying series (all against three teams viz Rwanda, Zimbabwe and Benin Republic), is likely to have Samuel Chukwueze and Ademola Lookman as partners from the off.\nThe rampant Osimhen, with 29 goals in 44 matches for the Nigeria senior team, has netted 160 goals and 36 assists in 275 club career matches, and is presently one of the most feared forwards in world football.\nGabon emerged the best second runners-up in all the nine qualification groups, and hinge their hopes of an upset on 36-year- old forward Pierre-Emerick Aubameyang, who has turned out for English Premiership side Arsenal and German Bundesliga top team Borussia Dortmund, and is now with former European champions Olympique Marseille in France.\nThe brilliant forward's father, Pierre-François Aubameyang, featured for the Panthers at the 1994 Africa Cup of Nations in Tunisia, in which the Panthers lost their first match 0-3 to Nigeria and crashed out at group stage, as the Eagles went on to win their second continental title.\nMouyouma is likely to stick to his regular army, which puts Loyce Mbaba in goal, with youngster Jacques Ekomie alongside Bruno Manga, Mick Omfia and Anthony Oyono at the rear, and Guélor Kanga, Mario Lemina and Didier Ndong in midfield.\nAubameyang, who scored all four goals in the dismantling of The Gambia away in the qualifying series, will have regular partners Denis Bouanga and Noah Lemina as co-conspirators at the fore.\nMouyouma has revealed that his Panthers are contemplating the quick, short passing game to force Nigeria's matadors to chase the game, while Chelle has kept his option to his chest as the fiery encounter looms.\nHow Gabon coach plans to stop Osimhen\nJust as Chelle is planning, his opposite number in Gabon, Coach Thierry Mouyouma is not leaving anything to chance. He has made a bold statement about Nigeria's Victor Osimhen ahead of the 2026 World Cup qualifying playoff clash. Mouyouma admitted that Osimhen is a \"difficult problem\" to solve for Gabon, praising his unpredictability, aerial ability, and runs behind the defense.\nThe Gabon sweat merchant admitted that his team must adopt a special tactical approach to deal with the threat of Victor Osimhen ahead of their 2026 World Cup qualifying playoff match with Nigeria, describing the Super Eagles striker as an unpredictable striker.\nDespite featuring in only five matches during the 2026 Fifa World Cup qualifiers due to fitness concerns, Osimhen made a remarkable impact, netting six goals.\nThe highlight of his performance was a stunning hat-trick in Nigeria's emphatic 4-0 victory over Benin's Cheetahs on October 14.\nAt club level, Osimhen has continued his blistering form, shattering records since the start of the season.\nThe Super Eagles talisman has been in unstoppable goalscoring mood, and his treble against Ajax Amsterdam propelled him to the summit of the UEFA Champions League scoring charts.\nOsimhen's ability to single-handedly dismantle defences has become a defining feature of his game.\nHis performances in the World Cup qualifiers, where he inspired Nigeria to four wins in their last five outings, serve as further proof of his match-winning prowess.\nMouyouma said: \"We have to defend as we wouldn't defend against just anyone. How do we actually defend against him?\n\"This type of player can be unpredictable, but he also loves playing in behind.\n\"The ability to reduce the distances behind us is one way, but even if you solve this problem, he has another side to his game -- set pieces and corners.\n\"That's where the complexity lies. That's where the work of a coach becomes interesting, because we are going to dissect, debate, and agree on a common defensive strategy.\n\"This Nigeria team could stay further back. We need to be able to take the match into the opponents' half of the pitch. I think that's the solution to the problem today.\"\nContinuing, the coach said, \"it will be a clash of styles, We perhaps need to improve our game management, learn to slow the tempo, better manage our energy, counter their set pieces, and their runs in behind the defense.\n\"These are two of Nigeria's strengths, for instance. It's by playing against Ivory Coast, Morocco, Senegal, and Nigeria that we progress.\"\n5 Gabon stars Super Eagles should be wary of\nThe Super Eagles of Nigeria are set for a crucial test as they face the Panthers of Gabon in the semi-finals of the 2026 FIFA World Cup African Qualifiers Playoffs in Rabat, Morocco today.\nUnder the guidance of former international defender Thierry Mouyouma, Gabon have impressed in the qualifiers, losing just once in 10 matches. Their mix of experienced campaigners and emerging talents have turned them into one of the continent's most organised and dangerous sides.\nPierre-Emerick Aubameyang (Olympique Marseille, France)\nThe veteran forward remains Gabon's undisputed talisman. Aubameyang, who has scored seven times in the 2026 FIFA World Cup qualifying campaign, is his country's all-time leading scorer with 39 goals in 83 appearances.\nAt 36, the former Arsenal and Chelsea striker still poses a major attacking threat with his sharp movement and finishing instincts. The captain has contributed four goals and five assists in 11 appearances across all competitions for Olympique Marseille this season.\nDenis Bouanga (Los Angeles FC, USA)\nBouanga, 30, is renowned for his blistering pace and eye for goal. The Los Angeles FC winger has netted eight times in the qualifiers -- only Algeria's Mohamed Amoura (10) and Egypt's Mohamed Salah (9) have scored more.\nThe former Saint-Étienne star has also been in scintillating form in Major League Soccer this year, registering 24 goals and eight assists in 32 appearances.\nMario Lemina (Galatasaray, Turkey)\nOnce a youth international for France, Lemina switched allegiance to Gabon and has become one of Mouyouma's most dependable players.\nThe 32-year-old Galatasaray midfielder brings experience, composure, and defensive stability to the team. His technical ability and solid passing make him a key figure in controlling the midfield battles that could decide the tie.\nShavy Babicka (Red Star Belgrade, Serbia)\nPHOTO: SHAVYBabicka, 25, adds flair and creativity to Gabon's attack. Blessed with pace and dribbling ability, he can stretch any defence on his day.\nHe announced his arrival on the international scene with a debut goal against the Democratic Republic of Congo in June 2022 and has since been a regular feature for the Panthers during the qualifiers.\nJim Allevinah (Angers, France)\nPHOTO: JIM\nBorn in France, Allevinah chose to represent Gabon and has become a reliable contributor to the national team. The versatile forward adds attacking depth and has shown his ability to score and create chances.\nThe 30-year-old has found the net 10 times in 35 appearances for Gabon and will be one of the key players Nigeria's defence must watch closely.\nNigeria vs Gabon head-to-head: Does history favour Super Eagles in World Cup playoff?\nNigeria's quest for a World Cup return takes them to Rabat, where the Super Eagles face Gabon in a playoff that could shape the next chapter of this team's story. The memories of 2022 still sting, and the players know what's at stake. The Moulay El Hassan Stadium will host a contest between a team desperate to restore its status and another trying to make history of its own.\nMomentum is on Nigeria's side after that emphatic 4-0 win over Benin Republic in their final group match. Victor Osimhen led the charge, with a hat-trick that reminded everyone why he remains Africa's most feared striker.\nGabon arrive with their own quiet confidence. They've never been to a World Cup, but there's a real bite to their attack. Pierre-Emerick Aubameyang, Denis Bouanga and Aaron Boupendza bring both experience and quality, and that makes them a threat. They've troubled big sides before, and they'll fancy their chances again on neutral ground.\nNigeria vs Gabon head-to-head\nThere's a bit of history between these two. There have been nine meetings in total; Nigeria have won five, drawn three, and lost just once. That lone defeat came in 1989 during World Cup qualifying, a reminder that Gabon have had their moments too. Most of the time though, Nigeria's Super Eagles have found a way to get the job done.\nBut football has a way of ignoring the past. Gabon today are not the same side from those earlier years. They're more compact, more disciplined, and carry a sharper edge in transition. It's not a fixture that comes often, but whenever it does, it tends to be tight and physical.\nNigeria vs Gabon previous results\nThe last meaningful Nigeria vs Gabon meeting came back in 2005, a World Cup qualifier that ended 2-0 in favour of Nigeria. That was during a period when the Super Eagles rarely struggled against Central African teams. Since then, both sides have evolved, and the dynamics have shifted.\nNigeria's route to this playoff was built on bursts of brilliance. The 4-0 win in Uyo was their best attacking display in months, and it came at the right time. Osimhen's movement, Alex Iwobi's link-up play, and Samuel Chukwueze's width gave them a balance that had been missing. Those three will be crucial again.\nGabon, on their part, came through a tough group behind Ivory Coast. They've learned how to grind results when it matters. Aubameyang may not have the same pace as before, but his experience and finishing remain invaluable. Add Bouanga's work rate and Boupendza's directness, and they have a front line that can test any defence.\nBonus, allowances dispute disrupt Nigeria's preparations\nSuper Eagles' preparations for the all-important World Cup play-off against Gabon was disrupted after players and team officials stayed away from training in protest over unpaid match bonuses and camp allowance.\nThe dispute centres on bonuses owed to players and staff for past matches in the ongoing World Cup qualifying series. Sources suggest that the matter has been lingering for several weeks, with promises of payment made but not fulfilled.\nThe squad is understood to be resolute, insisting that the financial issues be addressed before they return to training, reflecting a broader frustration that has been simmering throughout the campaign.\nThe timing of the dispute could not be worse. With the semi-final against Gabon scheduled for today, followed by a potential final on Sunday, 16 November against either Cameroon or DR Congo, the Super Eagles need all hands on deck. The NFF has stated that it is engaging with team representatives to resolve the matter swiftly and ensure that preparations are not derailed.\nSimilar issues have arisen in Nigerian football in the past, often impacting performance and morale. The Super Eagles' technical staff have been working to maintain focus within the squad, but the absence of training on the eve of such an important fixture may have repercussions on tactical readiness and cohesion.",
  "word_count": 2711,
  "scraped_at": "2026-02-14T02:03:26.532632",
  "_text_extracted": true
}