{
  "article_id": "a13db54e7aed",
  "url": "https://www.palatinate.org.uk/the-return-of-the-champions-league/",
  "title": "The return of the Champions League",
  "date": "20231005T193000Z",
  "domain": "palatinate.org.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The return of the Champions League\nBy Ben Marsden\nThe Champions League is back for another season of comebacks, upsets and screamers. Last season saw Barcelona, Ajax and Juventus knocked out in the groups, City thrashing Real Madrid in the semi-finals, and an impressive run by Inter Milan before they were narrowly beaten by eventual winners Manchester City. This season promises to entertain again so let’s look at the favourites to lift Ol’ Big Ears, the toughest groups and the big names missing from the 2023/2024 Champions League.\nHaving secured their first Champions League last year, alongside a historic table, Manchester City look set to be favourites to claim back-to-back European titles, having improved on their already remarkably talented squad. Real Madrid have been a consistent European force since the competition began and will back themselves to win an unprecedented 14th title. They’ve begun their season in impressive form, winning seven of their first eight matches, largely thanks to the form of the supremely talented Jude Bellingham. Perhaps the other main favourite is the Bavarian powerhouse, Bayern Munich. Robert Lewandowski has finally been replaced, in the form of former Tottenham captain Harry Kane. Like Bellingham, Kane hasn’t shied away from a big-money move and has a remarkable 13 goals and assists in his first 8 games for Bayern. Arsenal, PSG, Napoli and Barcelona will all be hoping to challenge the main favourites as dark horses who could cause an upset.\nEach year the draw is made and a group is termed the “group of death” – yet this year this title seems an understatement, with Newcastle United, AC Milan, Paris Saint Germain and Borussia Dortmund all drawn together in what may be the hardest Champions League group of all time. PSG have consistently underachieved in Europe, but the threat of Mbappe cannot be denied, whilst Newcastle will be raring to show they are back for good and this is not a one-off appearance for the Magpies. Then there’s prolific winners AC Milan who have lost local lad Sandro Tonali but tied down the electric Rafael Leao to a new contract. It’s certainly a group of death when Dortmund are arguably the weakest team, but the power of the Yellow Wall in their home games can push them through to the knockout round.\nGroup D is also a wide-open group containing last year’s finalists Inter Milan, alongside Portuguese champions Benfica, Austrian champions Red Bull Salzburg and Real Sociedad who have started their La Liga campaign brightly and have the impressive Takefusa Kubo on the wing.\nYet there are multiple big names missing, most notably legends Lionel Messi and Cristiano Ronaldo, who have scored a remarkable 269 goals combined. This year will be the first tournament since 2003/2004 when a budding Ronaldo made his UCL debut for Manchester United, that features neither player, with big boots to fill for the likes of Erling Haaland and Kylian Mbappe. Karim Benzema and Neymar, two players with huge European pedigree, will also miss out thanks to lucrative moves to Saudi Arabia.\nThere were also a few under-par seasons across Europe leaving giants Liverpool and Ajax to compete in the Europa League. Liverpool have missed out on Champions League football for the first time in a full season under Jurgen Klopp’s management, whilst Ajax struggled without Erik Ten Hag, finishing 3rd in the Eredivisie, with two different managers across the season. 2021 winners Chelsea finished a miserable 12th in the Premier League after having 4 managers take charge of at least one game across a turbulent season made worse by their excessive spending. Two-time winners Juventus complete the list of European giants missing out this season, as they were handed a one-year ban from European competitions by UEFA for breaches of club licensing and financial fair play.\nWith some key names missing out, the last year of the traditional Champions League, before a new league-style system is implemented, seems one-sided on paper, but there’s bound to be upsets and controversy in the biggest club competition in world football.\nImage: James Taylor",
  "word_count": 675,
  "scraped_at": "2026-02-14T02:16:55.102290",
  "_text_extracted": true
}