{
  "article_id": "a13e4ed37990",
  "url": "https://theathletic.com/4192575/2023/02/15/bobby-90-ronaldo-pep-relying-on-mourinho-analysing-bobbys-barcelona/",
  "title": "Bobby  90 : Ronaldo , Pep & relying on Mourinho analysing Bobby Barcelona",
  "date": "20230215T173000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bobby ’90 is our way of remembering Sir Bobby Robson in the week he would have been 90 years old. It includes articles all week, including this introduction. There is also a four-part podcast series, brought to you by George Caulkin, The Athletic and Sir Bobby Robson’s family. To listen, just search for Pod on the Tyne on Apple Podcasts, Spotify, The Athletic app or wherever you get your podcasts, or follow this link.\nAdvertisement\nIn the modern era, English managers rarely experience great success when working abroad. There are a few examples — Steve McClaren won the Eredivisie with FC Twente. Graham Potter took Ostersund from the fourth division into Europe. Bev Priestman won Olympic gold with Canada’s women’s side.\nBut none of those jobs quite compared to Bobby Robson taking charge of Barcelona in 1996-97, a season when — in the view of then-Spain manager Javier Clemente — the club had assembled the most talented squad in the history of football.\nRobson had won the UEFA Cup with Ipswich, he’d been a penalty shootout away from reaching a World Cup final, he’d won league titles with PSV and Porto. But nothing truly prepared him for arguably the most difficult job in world football.\nThis is the eventful story of Sir Bobby in Barcelona, part of The Athletic’s Bobby ’90 series.\nFollowing Cruyff\nTaking charge of Barcelona, with no prior experience of Spanish football and no understanding of the unique pressures at Camp Nou, would have been a struggle at any time.\nBut Robson was particularly unfortunate to be succeeding Johan Cruyff, the most celebrated figure in Barcelona’s history. Already a legendary player at the club, as head coach Cruyff had created the fabled Dream Team, which enjoyed tremendous success at home and abroad, and played scintillating football, too.\nBarcelona won nothing in Cruyff’s final two seasons, but the real reason for his departure was his terrible relationship with Josep Lluis Nunez, the club’s volatile president. After Cruyff, Nunez wanted a more amiable figure less likely to publicly disagree with him. Robson, who had previously turned down the Barca job twice when under contract at Ipswich and England, would make Nunez’s life easier. To his critics, that made Robson a ‘yes man’ from the outset.\nAdvertisement\nBarcelona’s board was split over Robson’s appointment, however, and some complained about Robson’s methods even before Barcelona had lost a league game. Meanwhile, it didn’t help that Cruyff remained in Barcelona, attending matches as a mere season ticket holder rather than in the directors’ box. “I wouldn’t even have a coffee with Nunez,” said Cruyff.\nAt least Nunez and Robson didn’t have to cope with the presence of Cruyff’s son, Jordi, who it was considered could act as a ‘spy’. He headed to Manchester United in summer 1996 but nevertheless continued to snipe about Barcelona’s decline from England.\nAll this was a little too much for Robson. “I didn’t realise the political battle I was coming into and what Cruyff meant to the city,” Robson later acknowledged in Jimmy Burns’ book, Barca. “This is what football here is all about, it’s about power, about the necessity of winning, it’s about this city and about Catalonia… I used to say to myself, ‘Do I need this in my life?’ I didn’t come here for this political battle. I came here to try and win football games.”\nChemi Teres, Barcelona’s press officer during Robson’s season in Barcelona but also his unofficial interpreter and often described as his closest support at the club, says Robson initially found Barcelona’s sheer stature difficult to get his head around.\n“It was a difficult time for Barcelona,” he says. “I think he was surprised about the dimension of the club, the number of journalists that were attending press conferences, covering the training sessions, and the amount of information that was in the newspapers.\n“But Bobby was very happy living in Sitges (a town 30km north of Barcelona). He always said the people were very nice to him. He was living there with no pressure, doing whatever he wanted to do, no fans stopping him and asking for autographs. He was having a very relaxed and comfortable life here, with good food and nice weather. I think his life was quite comfortable. I think he enjoyed it very much.”\nRonaldo’s sole season at Barcelona\nConsidering Ronaldo would later struggle with injuries at Inter Milan and was a much less mobile centre-forward by the time he joined Real Madrid, his sole season at Barcelona is generally considered his outstanding club campaign.\nBut the truth is more complex.\nAdvertisement\nRobson had personally recommended the signing of Ronaldo, having heard about his sheer talent through his old PSV connections. Nunez was worried by the financial outlay required, but Robson insisted he was worth it. In terms of goals, it’s difficult to argue. Ronaldo scored 34 in 37 La Liga games, including the most celebrated of his career, the absurd Maradona-esque dribble against Compostela.\n“He’s an incredible dribbler, he has an amazing ability to just plough his way through,” Robson told FourFourTwo magazine. “Part of that is his natural talent and part is his amazing physique. He’s incredibly strong and beautifully balanced. And of course, he has astonishing pace. I have never seen a player as fast as him. He just explodes.”\nThe whole of Spain was obsessed with him, to the extent that Deportivo La Coruna manager John Toshack responded by signing a Brazilian striker from Atletico Mineiro called Renaldo. “I am like Ronaldo, but with an ‘e’,” he announced at his unveiling. He didn’t quite live up to the billing.\nDefenders simply couldn’t handle the real Ronaldo. “That was the most difficult marking job I’ve done in my life,” said Tenerife centre-back Cesar Gomez after facing him. “I feel like I’ve just played five games.”\nBut Ronaldo also caused problems. Off the field, Ronaldo’s agents were trying to shift him onto a big-spending club in Italy from as early as October, and rumours about his future dominated coverage of the club. Upon his arrival, Robson declared that he was “a great investment for the next 10 years”. Sadly, he was nine years out.\nThen there was Ronaldo’s lack of discipline. He was regularly required to return to Brazil for international duty and was often late back to Barcelona for training. When given a couple of days off, he would fly back to his homeland again, most inevitably for the Rio carnival in mid-February, where he was photographed dancing into the early hours and arrived back in Barcelona looking exhausted.\nRonaldo often seemed like he didn’t care about Barcelona. When the whole squad went out for a farewell dinner for departing club legend Jose Mari Bakero, Ronaldo went to a concert instead. When he pulled out of a European game away in Greece with a muscle problem and watched from the stands, he spent the whole match on his phone. It didn’t help that his girlfriend posed for a newspaper in a Real Madrid shirt, saying Ronaldo had realised he’d made a mistake by joining Barca.\nAdvertisement\nOn the field, too, there were issues. Ronaldo was, at this point, a very raw striker. He participated little in build-up play and frustrated team-mates with his head-down, individualistic style. He regularly complained about the lack of service from midfield, particularly from Pep Guardiola, who preferred to spread play wide.\nHe also complained about Robson’s tactics, repeatedly making a specific complaint about the lack of compactness, and calling Robson’s approach “outdated” and ineffective against the top sides. Robson became frustrated that a 20-year-old, who he’d brought to the club, was so outspoken. Ronaldo’s international manager, Mario Zagallo, joined in, claiming Barcelona “lacked tactical organisation and rely too much on individuals, and leave too much space between the lines”.\nAnd therefore, for all the legend about Ronaldo’s sole season at Camp Nou, there wasn’t much affection shown towards him from Barcelona fans. A group of supporters whistled him after every poor touch throughout a 1-0 victory over Celta Vigo in December, his fourth game without a goal.\nRobson played peacekeeper, insisting the fans were merely frustrated, not angry. But Ronaldo hit out, claiming he “wouldn’t forget” about the jeering from supporters who “go to football to let off steam and forget about their problems at home”. An official club supporters’ group responded by telling him to stay in Brazil. This was a player who had just been named World Footballer of the Year. But Barcelona’s player of the season, by common consent, was Luis Enrique, who played all over the pitch, but predominantly at right-back.\nThere was a sense Ronaldo was not truly a Barcelona player, but a Brazil player who simply happened to turn out for Barcelona. After his final game at Camp Nou, he didn’t join his team-mates in hailing the crowd to mark the last home game of the season, but walked off without a glance at the stands.\nRonaldo can’t be blamed for the scheduling of an international tournament, but it was symbolic that, by the time Barcelona competed in the Copa del Rey final in late June, Ronaldo had spent the previous three weeks playing for Brazil at the Copa America.\nEven more significantly, he was about to sign for Inter Milan.\nAdvertisement\nCamp Mou\nJose Mourinho has sometimes been cast as a shadowy background figure during Robson’s season at Barcelona. But that couldn’t be further from the truth: Mourinho was public enemy No 1 from an early stage.\nRobson struggled with learning Spanish. He’d vaguely stumbled along in Portuguese with Sporting Lisbon and Porto, and started twice-weekly lessons in Spain but quickly gave up, deciding he was too old to pick up a new language. This inevitably caused problems when communicating with individual players, most of whom didn’t speak English.\nIn group situations, Robson depended upon Mourinho. Previously his mere interpreter, by this stage Mourinho was officially his assistant and, when mocked for his previous lowly role, got defensive and insisted Robson treated him “as an equal”. Indeed, Robson often responded to questions about his tactical approach with the word ‘we’ rather than ‘I’, which was assumed to refer to he and Mourinho.\nWhen journalists wanted a snappy quote on a certain issue, they knew Robson couldn’t speak Spanish. So they went to Mourinho, who couldn’t resist a barbed comment. He annoyed Ronaldo at an early stage by telling journalists the striker couldn’t afford to score once and “spend the other 89 minutes sleeping”. The criticism was probably fair, but Ronaldo complained about Mourinho saying it through the press rather than to his face.\nMourinho increasingly turned on journalists, too. After one victory, he said he’d wanted to win to shut them up. Before a must-win game, he was asked what the consequences were if Barcelona lost, and Mourinho implied Robson and he would be sacked. After a defeat in Bilbao, he became involved in a physical confrontation with Athletic manager Luis Fernandez. And this was, after all, a mere assistant with no prior reputation in the game. People were astonished by Mourinho’s aggression, particularly given he was supposed to be the mediator between Robson and his players, and sometimes between Robson and the press.\nSome journalists were so baffled by Mourinho’s role that they, shamefully, implied Robson and Mourinho were having an affair. Robson’s decision to live in Sitges, known as Spain’s gay capital, perhaps played its part.\nMourinho felt compelled to give an interview with Sport, one of two local sports newspapers. “I’m anything but homosexual,” he said. “Bobby is married with three kids, I’m happily married and my wife is expecting our first baby. Anyone who knows me will tell you how much I like women. I’m here because of my professional relationship with Bobby.”\nAdvertisement\nIt’s doubtful anyone truly believed Robson and Mourinho were in a relationship. But that’s the extent to which Mourinho’s status was questioned, and the extent to which some journalists wanted to belittle him.\nPost-Bosman debate\nRobson’s arrival in Barcelona wasn’t simply difficult timing because he was following Cruyff. It was also awkward because he arrived in the first summer after the Bosman rule, and therefore the first time when Barcelona could go all-out on signing foreign players. Previously, they’d been limited to selecting three non-Spanish players in a matchday squad.\nEvery club took advantage of the new laws, particularly as the Spanish federation had also agreed new rules which permitted 25-man squads, rather than 22. But few went as crazy as Barca.\nThey signed Brazilians Ronaldo and Giovanni, who became Robson’s first-choice No 9 and No 10. Argentine Juan Antonio Pizzi, who had won the previous season’s Pichichi (top scorer) at unfashionable Tenerife, arrived as an alternative up front.\nTwo new centre-backs were signed — Frenchman Laurent Blanc and then Fernando Couto from Portugal, who arrived alongside his compatriot Vitor Baia, the new first-choice goalkeeper. They’d both worked with Robson in Portugal, as had Nigerian winger Emmanuel Amunike, who joined in December. There was also the return of fan favourite Hristo Stoichkov after a quiet season at Parma.\nBecause Gheorge Popescu, Luis Figo and Robert Prosinecki were already at the club, this meant Barcelona had 10 foreign players, far more than ever before. And for a club with a proud tradition of bringing youngsters through the academy and a club inextricably linked with Catalan nationalism, this caused issues.\nRobson essentially dropped goalkeeper Carles Busquets, right-back Albert Ferrer and midfield trio Oscar, Bakero and Ivan de la Pena. All had been regulars in the previous campaign. Four were Catalan, while the other, Bakero, had been club captain. Barcelona-born Albert Celades also fell out of favour.\nAdvertisement\nSuddenly, the debate wasn’t even about whether the dressing room chat was in Spanish or Catalan, it was about whether it was Portuguese, with the arrival of two Portuguese, two Brazilians, and Mourinho. Some graffiti on the outside of Camp Nou read, “More Catalans, less mercenary scum”.\nThat was an extreme view, but this was a new period of internationalism. Luis Enrique — another new signing, from Real Madrid of all places — questioned “why people still called it the Spanish league” when there were so few Spaniards on show, and said he felt like a foreigner in the dressing room. Guardiola complained about everyone “banging on about foreign players and ignoring the Spaniards”.\nThere was also a financial divide. One board member claimed it was logical that the star foreign signings should earn more than the local players. The homegrown players, funnily enough, disagreed.\nAmong all this nationalistic discourse, it didn’t help that Robson didn’t speak Spanish, let alone Catalan. He also misjudged the situation when Bakero departed — he appointed Romanian Popescu as his successor, whereas Spanish squads were accustomed to voting for a new captain. Guardiola would have been the popular choice and — indeed — became the captain the following season.\nThe situation with so many foreign players became a national debate. “Selecting a team of native Spanish players is becoming a problem for Javier Clemente,” claimed Jorge Perez Arias, a spokesman for the Spanish federation. “We have had some of the best youth teams in Europe, but as soon as our players reach 20 or 21 they stop improving because, with so many foreigners around, they can’t get a game.”\nAmid so much controversy, the federation voted to limit the number of non-EU players allowed in a squad, in keeping with other major European leagues. That, to a certain extent, stopped the complaints.\nThe next couple of seasons saw the emergence of Xavi Hernandez and Carles Puyol, and Barcelona once again had a serious homegrown identity. But in 1996-97, to many, the club didn’t feel like Barca.\nAdvertisement\nTactical changes\nThroughout 1996-97, Robson faced criticism for his system — or lack of it. After years spent playing football according to the Cruyffian principles that shaped the club, Robson was considered a more laissez-faire manager who left players to their own devices, with less commitment to dominate possession. Barca’s momentous victories were often credited to players working out tactics for themselves; although that ignored the fact Cruyff himself was always happy for players to debate strategy and challenge his ideas.\nRobson’s first-choice XI was essentially a 4-2-3-1. Vitor Baia was in goal. Luis Enrique, Blanc, Couto and Sergi played at the back. Popescu considered himself a centre-back, but Robson fielded him alongside Guardiola in midfield. Figo played on the right, Stoichkov was on the left until Amunike’s arrival, Giovanni played No 10, and Ronaldo was up front.\nThe first time Robson fielded his preferred side, Barcelona smashed Logrones, who eventually finished bottom by a huge margin, 8-0. Robson was still questioned about his tactics after the game, something he could never get over.\nCriticism focused on the lack of guile in midfield. Popescu, the new captain and a Robson favourite, was a slightly cumbersome presence and fans yearned for the presence of the gifted playmaker De La Pena. Robson eventually relented in the second half of the campaign, having previously been sceptical that he and Guardiola could play together. That was, in part, an admission he’d got it wrong.\nGiovanni was Nunez’s signing rather than Robson’s and proved underwhelming. With an inconsistent No 10, very wide wingers and Ronaldo not contributing much in build-up play, Barcelona sometimes looked like a broken side, with too much space between the lines and a reliance on individual brilliance. And yet despite all this, they hit 102 league goals, at that point a record in La Liga. You can understand why Robson was perplexed by the criticism.\nHowever, they also conceded 48, and Barca had a habit of conceding daft goals. That sloppiness would cost them the title.\nRobson’s big decision\nThe ‘what might have been’ moment for Robson at Barcelona didn’t actually concern anything that happened in Spain. It came in January, when Kevin Keegan suddenly quit as Newcastle United manager, half a year after nearly guiding them to the Premier League title. Robson, a proud Geordie who had not yet represented his boyhood club as a player or manager, was the inevitable first choice\nAdvertisement\nDespite his pride at never having walked out on a contract before, Robson seriously considered the move. He had found the challenge of leading Barcelona overwhelming. He’d dreamt of the Newcastle job his whole life. His wife, Elsie, after several years in Holland, Portugal and now Spain, was keen to go home. Newcastle’s board members flew out to Spain to convince Robson to join. Many at Barcelona suggested the move might suit all parties.\nBut Robson elected to stay. Newcastle appointed Kenny Dalglish instead.\nBy the end of the campaign, with Robson set be replaced, he admitted he should have taken the Newcastle job. “I turned down megabucks to stay,” he said. “If I knew what was going to happen to me, I wouldn’t have turned down the offer Newcastle made to me in January.”\nTwo years later, though, he would return home to Newcastle.\nThe comeback\nThe most memorable game of Robson’s reign was a home Copa del Rey quarter-final against Atletico Madrid. After the first leg had finished 2-2 in Madrid, Atletico raced into a three-goal lead in Barcelona courtesy of Serbian Milinko Pantic’s hat-trick. Barca were heading out, and perhaps so was Robson, as fans chanted for both he and Nunez to resign.\nRobson then made the boldest move of his career. Five minutes before half-time, he took off centre-back Blanc and holding midfielder Popescu, and introduced left-winger Stoichkov and striker Pizzi. He used a 3-2-5 formation, with a frontline of Stoichkov, Luis Enrique, Pizzi, Ronaldo and Figo. It was do-or-die.\nRonaldo got Barca back in it, twice volleying home, to make it 2-3. But then goalkeeper Vitor Baia, who endured a horrendous game, made another error and allowed Pantic to score a fourth. 2-4.\nBut then came another volley, this time an outstanding hit from Figo. 3-4. Then Ronaldo completed the second hat-trick of the game, spinning his defender brilliantly to make it 4-4. But Barcelona were still going out on away goals. And then, as Barcelona sent almost everyone forward for a late set piece, substitute Pizzi was quickest to a rebound and scored yet another volley — Barca’s fourth of the night — to make it 5-4, completing one of the most remarkable comebacks in Barcelona’s history.\n“You’ll have to give me a minute to sit back and take it all in,” said Robson afterwards. “I’ve been in football a hell of a long time and I don’t remember anything remotely like that second half. We’ve just seen something special, so let’s take some time to enjoy it.” His early double substitution, the type his assistant Mourinho would later become famed for, not merely sparked the comeback, but probably saved his job.\nAdvertisement\nVan Gaal lingers\nRobson didn’t know it at the time, but he was essentially a temporary solution between two legendary Dutch coaches.\nWhen it became clear Cruyff was leaving, Barcelona’s board approached Louis van Gaal, who had taken Ajax to the 1995 European Cup with a group of brilliant young players and a brand of exciting attacking football. Van Gaal didn’t want to leave Amsterdam yet, though. Not merely did he have a contract until 1997, his wife Fernanda had passed away a couple of years earlier. For the sake of his children, Van Gaal didn’t want to uproot his family just yet.\nBarcelona, therefore, were looking for a short-term fix. Robson had a two-year contract, but there was a clause that allowed Barca to change his role in the second year.\nThe club handled this situation badly. Van Gaal’s arrival was reported as early as February, but Nunez continued to publicly insist that Robson would continue as first-team coach the following season. That was probably never on the cards.\n“I honestly thought I was coming here for two seasons,” Robson admitted in Jeff King’s excellent book about that period in his life, High Noon. “In retrospect, you’d have to say the club hired me as a one-year stop-gap. Van Gaal had already said this would be his last season at Ajax. In my opinion, Barcelona got in touch with him and he told them to wait a year. I think they’ve known all along that he was coming.”\nHe was probably right. The July 1996 issue of World Soccer magazine, reporting on Robson’s appointment, reads: “The long-term target was Van Gaal. One scenario envisaged by Nunez was that Robson would take over for the coming season, keeping the bench warm for Van Gaal, then move up to the post of technical director.” That’s precisely what happened.\nThree trophies out of four\nFor all the disillusionment surrounding Barcelona in Robson’s sole campaign, they did actually win three trophies.\nAdvertisement\nThe first was the Spanish Super Cup at the start of the season, after a 6-5 aggregate victory over the previous season’s double winners Atletico Madrid.\nBut the other two were proper trophies. Barcelona won the European Cup Winners Cup with a 1-0 victory over Paris Saint-Germain in Rotterdam, courtesy of a Ronaldo penalty, sidefooted down the middle. The Brazilian had won it himself, taking a heavy touch which sucked in Bruno N’gotty before nicking the ball away from the defender and going to ground. But Ronaldo, not for the last time in a final, didn’t look himself throughout.\nRobson, despite the triumph, appeared exhausted afterwards, and club officials almost had to drag him up to the trophy presentation while he was, sportingly, commiserating with the defeated PSG players.\nThe second, the Copa del Rey — with Ronaldo not involved — came via a thrilling 3-2 extra-time victory over Real Betis, made all the sweeter by it being at the Bernabeu.\nRobson’s side twice went behind, but Figo scored an outstanding long-range drive and Pizzi headed home from Guardiola’s lovely ball over the top. And then, after Figo bundled his way through the defence, the ball rebounded into his path for a simple tap-in from two yards. Barcelona had done it. Nunez and Robson embraced in the directors’ box, although Robson already knew he wouldn’t be staying on next season.\n“I’m happy and sad at the same time,” Robson said afterwards. “I’ve made history, too. I must be the first coach to win three out of four titles in his first season at a club and not get the chance to carry on!”\nA gentleman\nFor all the problems throughout the season — few of his own making — Robson bowed out with silverware, dignity, and attracted praise from all quarters. Even his fiercest media critics conceded that he’d ended his tenure on a high.\nAdvertisement\nBarca had Robson contracted for another season and chose to keep him around as ‘general manager’, although this was a fairly vague job in practice, explained as networking to help with Barcelona’s future transfer business. “My new role will be partly ambassadorial, partly honorary, but the setting up of the network of contacts is something I look forward to,” he explained.\nRobson used that second year, in his own words, “as a sabbatical”, taking advantage of his remit by regularly flying to wherever he wanted around the world. However, as Jimmy Burns says in his book, Barca, Robson had become “an increasingly unappreciated and isolated figure” by the end of his second season.\nBut while players sometimes criticised his tactics, they sympathised with the unique pressures of coaching Barcelona that season. “Not a day goes by when I don’t think about what a difficult job he has on his hands,” said an unusually reflective Stoichkov towards the end of the campaign.\nRonaldo would also later be complimentary of Robson’s man-management skills. “He was like a father to me,” the Brazilian said. “I have had a lot of managers in football but the difference between all of them and Bobby was his humanity and the relationships he had with the players. He was always like a father to everyone.” When at Newcastle, Robson made an ambitious attempt to sign the Inter striker on loan, to get him up to full match fitness after his injury problems. Inter unsurprisingly said no, but Robson insisted Ronaldo had been keen.\nGuardiola, too, while a disciple of Cruyff and Van Gaal in a tactical sense, greatly admired Robson’s ability to manage the most difficult dressing room in world football. “I learned a lot from him in that period,” Guardiola said. “I thought, ‘I want to become a manager’. How he handled that situation was incredible. I admire him a lot.”\nFormer press officer Teres, his closest support during his time in Barcelona, most fondly remembers a subsequent meeting.\n“It was a Champions League game when he was manager of Newcastle, when Barcelona went there in the group phase in 2002-03. I hadn’t seen him since he left the club. We arrived at the stadium and we greeted each other.\nAdvertisement\n“It was an hour before the game. And he took me for a tour of the stadium, to show me that Newcastle was a big club, a big stadium. He was very proud of the club. It was absolutely incredible, I was saying, ‘Bobby, in an hour you have a game, you should go to talk to your players!’\n“It was one of those things that really touched me. He was saying, ‘You hosted me for a couple of years in Barcelona, now I am the host, and I want to show you my club’. He was a great guy. I think people in Barcelona appreciate him very much, as a nice person, a respected man, a gentleman.”\nThe Sir Bobby Robson Foundation funds cutting-edge cancer treatment and innovative cancer support services. Part of Newcastle Hospitals Charity, it works within the NHS.\nFor more information about what Sir Bobby called “his last and greatest team”, or to donate, please visit sirbobbyrobsonfoundation.org.uk.",
  "word_count": 4659,
  "scraped_at": "2026-02-14T01:53:21.834192",
  "_text_extracted": true
}