{
  "article_id": "a13fd27bc65b",
  "url": "https://www.teamtalk.com/chelsea/joe-cole-urges-chelsea-tie-down-leader-to-new-contract-liverpool-ramp-up-dangerous-interest",
  "title": "Joe Cole urges Chelsea to tie down  leader  to new contract as Liverpool ramp up  dangerou interest",
  "date": "20230224T230000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nJoe Cole urges Chelsea to tie down ‘leader’ to new contract as Liverpool ramp up ‘dangerous’ interest\nFormer Chelsea star Joe Cole has urged the Blues to tie down Mason Mount to a new contract, amid interest from Premier League rivals Liverpool.\nThe 24-year-old has now entered the final 18 months of his current deal, so far refusing to pen an extension, but the London club remain confident an agreement can be struck.\nBut, with several top European teams circling, Mount’s head could be turned and make a shock exit from Stamford Bridge this summer.\nAs revealed by TEAMtalk on Friday, Chelsea are willing to sell Mount if they fail to agree on a new contract by this summer.\nThis is because it could be the last chance for the Blues to recoup a sizeable transfer fee for his services, but he will still be a big loss for Graham Potter and co.\nSince breaking into the first team under Frank Lampard, Mount has made 191 appearances across all competitions, scoring 33 goals and making 37 assists.\nThe midfielder has played a key part in the club’s recent success, too, helping Chelsea to lift one Champions League, a UEFA Super Cup, a FIFA Club World Cup and two FA Cups.\nMount was also a key player in Gareth Southgate’s England squad at the World Cup last year, making four appearances, so there is no doubt that he can perform at the highest level.\nREAD MORE: Man Utd rejection sees Real Madrid preparing to sign Chelsea winger in incredible promotion\nJoe Cole says Chelsea must keep ‘leader’ Mount\nAs mentioned, Liverpool are thought to be one of the favourites to pen a deal for Mount should he leave Stamford Bridge. Cole, however, does not want to see that happen.\nDuring his playing days, he spent a successful seven-year spell at Chelsea, before heading to Liverpool, which was a bit of a shock move at the time.\nSpeaking to 90Min, he said: “Mason Mount is probably sitting there thinking: ‘I have performed for this club for three or four years now, I won the Champions League, I’ve been pushed forward in every campaign…’\n“He’s a leader, he sacrifices himself for the team. He wants to stay at Chelsea, I’m sure he does.\n“I don’t for the life of me understand, and I don’t know the dealings – they’re probably far apart on where they’re valuing each other. He probably thinks: ‘Where do I sit?”\n“He’s out the team now, which is a dangerous position to be in for Mason and for Chelsea. Football is very fickle, we can forget what a good player Mason Mount is.\n“Even more so in this generation – players go away for three or four weeks and they’re forgotten. I think Chelsea need to remember what a great player he is. He will come good again.\n“[A contract renewal] would be the top of my list. There must be some middle ground to solve it.”\nChelsea have not yet given up hope of a new deal, but they will be forced into a difficult decision if nothing changes before the end of the current campaign.",
  "word_count": 533,
  "scraped_at": "2026-02-14T01:55:49.889217",
  "_text_extracted": true
}