{
  "article_id": "a149cfbd9b7d",
  "url": "https://theathletic.com/4759040/2023/08/09/matt-turner-nottingham-forest-premier-league/",
  "title": "Why Nottingham Forest signed Matt Turner : Strong in the air and a superb shot - stopper",
  "date": "20230809T123000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The signing of Matt Turner from Arsenal is the first of two major pieces of incoming transfer business Nottingham Forest hope to complete this summer to bolster their goalkeeping options.\nUnited States international Turner will almost certainly be in goal, back at the Emirates Stadium against the club he just left, for Saturday’s 2023-24 Premier League season opener, having made a £10million ($12.7m) move to the City Ground. However, Forest remain determined to bring Dean Henderson back as well, following last season’s successful loan from Manchester United.\nIn the meantime, they have made a significant addition in Turner.\nAdvertisement\nWhile he will be a familiar face at the Emirates after his one season there, the 29-year-old might be a lesser-known quantity to some Forest fans, given the limited game time he saw for Arsenal after a transfer from MLS last summer.\nOur Forest correspondent Paul Taylor (PT), along with The Athletic’s goalkeeping expert Matt Pyzdrowski (MP) — an American who spent over a decade playing professionally in Swedish from 2011 — takes a look at what Turner brings to the table, why he wanted to sign for Forest and what it means for the club.\nWhy has Turner made this move to Forest?\nThe reality is that he wasn’t going to get close to being first-choice at Arsenal.\nHe knew that to lock down his place as the No 1 for the USMNT, who co-host the World Cup in 2026, he was going to need to leave the north London club he only joined a year ago.\nWhile it may seem an obvious move, it won’t have been an easy decision to give up the prestige and glamour of being at a Champions League club for one that had to fight hard to avoid relegation to the EFL last season and, let’s face it, accept the financial implications that come with it.\nSo for Turner to be mature enough to understand that and say, “I’m hungry, I’m not OK sitting on the bench. I want to play!” is a smart and proactive position to take and speaks volumes about his character and ambitions.\nIt’s the kind of move his international team-mate Zack Steffen didn’t make early enough after joining Manchester City in 2019. Steffen waited a season too long to leave City (joining Middlesbrough of the Championship on loan for last season) and his development stagnated. This ultimately cost him a squad spot at last year’s World Cup — something that at one point would have been unthinkable.\nTurner is coming off a very strong CONCACAF Gold Cup this summer, where he captained the U.S. and played a key role, highlighted by his heroics in their shootout win over Canada in the quarter-finals. He was arguably the only American player on his team to walk away from the tournament with any credibility (they lost in the semi-finals to Panama).\nMoving now, when he’s in form and confident, is ideal. MP\nAdvertisement\nWhy do Forest want him?\nWhen on-loan duo Henderson and Keylor Navas returned to their parent clubs at the end of last season, it left a huge void in the squad and there was a growing sense of trepidation that head coach Steve Cooper’s side might start the season without having signed replacements.\nForest have always wanted to bring Henderson back and there is a belief that it will happen, once he is back to fitness after the January injury that ended his season early. But the arrival of Turner eases the pressure on that front.\nThe club also explored the idea of trying to bring Navas back from Paris Saint-Germain, but the finances involved were prohibitive — particularly when it came to potentially signing both him and Henderson.\nOne benefit of signing Turner and Henderson is that they are both likely to increase in value if they flourish at the City Ground. Henderson is 26 and Turner three years older — still relatively young for goalkeepers.\nForest will keep 36-year-old Wayne Hennessey as a third option between the posts, while looking to move on Ethan Horvath — another U.S. international. George Shelvey, a 22-year-old who has done well in pre-season but is yet to make his senior debut for the club, will be sent out on loan to gain experience.\nPresuming the deal to bring Henderson back from Old Trafford gets completed as well — which is likely to be another loan with either an obligation or an option to make the move permanent — Forest will have two high-quality players fighting it out to be first-choice in goal.\nLegendary Forest manager Brian Clough understood the value of having a good goalkeeper — as he demonstrated when he paid a then significant £270,000 ($344,000) to sign Peter Shilton in 1977 — and that ethos has not been lost at the club 46 years later. PT\nWhat will Turner bring to the Forest team?\nOne of the biggest question marks for Turner on his arrival at Arsenal a year ago was his ability with the ball at his feet.\nAdvertisement\nTurner admitted this was an area of his game that needed to improve if he wanted to take the next step in his career, and at Arsenal he was in an ideal place to do so.\nTheir manager, Mikel Arteta, encouraged Turner to take even more risks than he was used to with the U.S. and his MLS side, New England Revolution, and, judging by his performances over the past 12 months, it’s clear that has paid dividends.\nWhile it would be wrong to suddenly classify him as an expert passer, he has undoubtedly improved and grown in confidence — especially in regards to his decision-making — and in a short amount of time added a more expansive skill set to his game.\nAt Forest, it’s unlikely that Turner will be called upon to play out from the back in a similar way regularly, but he is more than capable of doing so if required. It is more likely that he will be required to play long, accurate passes to his wingers and forwards to stretch the opposition and try to catch them on the counter. This is something he is comfortable doing, which is good news for Forest.\nBut his biggest strengths have always been his athleticism and shot-stopping.\nThe test for him will be how he handles the pressure of being on a team most people expect to be in the bottom half of the Premier League, with the threat of relegation again a possibility.\nIt will also be interesting to see how he responds after making his first big mistake. Will he learn from it or not? Dealing mentally with errors is something that every goalkeeper has to do and the ability to bounce back quickly is what defines them.\nJudging by his performances, it is unquestionable that Turner improved in his year with Arsenal and he now has a chance to prove he is good enough to be a No 1 in the Premier League. MP\nWhy do Forest want Henderson too?\nForest did well to land a player of Navas’ quality and experience in the January window once it became clear Henderson was going to be sidelined for a considerable amount of time. It was a truly vital mid-season signing and a key factor in their eventual top-flight survival.\nNavas played 17 games, including big wins over Brighton, Southampton and Arsenal.\nBut the club do not want to have to be scrambling around for such a last-gasp signing again next January if they suffer similar injury misfortune. Rather than having to pull a rabbit out of their hat as they did with Navas, they want to be proactive.\nAdvertisement\nTheir desire is to have two quality players fighting it out for the first-team spot — competition for places would help to keep both Turner and Henderson on their toes, regardless of who is in the team. PT\nWhat would the impact of Henderson signing be on the team dynamic?\nIt has the potential to set up one of the more intriguing goalkeeper battles in this season’s Premier League.\nComing off his injury and being cast aside at United, where £43million Andre Onana has been signed from Inter Milan to replace the departed David de Gea, Henderson will feel like he has a lot to prove, and he won’t be happy sitting on the bench and missing valuable game time with a European Championship squad place with England next summer surely in his sights.\nIt will be interesting to see how he handles that, should it happen, and also to see how it impacts Turner and the rest of the goalkeeping group. Though it’s quite possible they will support one another, it may potentially challenge the relationships the pair have with each other, and even with the club — much in the same way it did between Henderson and De Gea at United.\nAlso fascinating is the fact Turner and Henderson are so similar in their ability as goalkeepers. They are both more traditional in terms of their strengths — strong in the air and good shot-stoppers.\nBoth will be expecting to be the one to play and there are also those national-team implications for each of them. It will be a very delicate and difficult relationship to navigate. The key for Cooper and the rest of his backroom staff will be to handle the situation well.\nWhat will encourage Forest is Henderson’s attitude last season.\nDespite being a loan signing, he moved to the area and, more than that, when sidelined with injury, stayed around rather than return to United and even travelled to away games. He remained a familiar face around the training ground too, even once he had undergone surgery and it was clear he would not play again last season. Such a mentality will be vital again now. PT/MP\nAdvertisement\nForest already have one U.S. international goalkeeper in Horvath… is Turner an upgrade? And how will all this impact the USMNT?\nSteffen’s sporadic and limited game time for Manchester City, in addition to his inconsistent form when he did play, left the door open for Turner’s rise to claim his country’s No 1 jersey.\nIt is perhaps ironic that those roles have now shifted. Steffen made 45 appearances for Middlesbrough last season and was one of their best performers as they made the promotion play-offs. In total, he played 4,050 minutes of club football in 2022-23, while Turner managed just 630 (way down on what he was registering in MLS).\nThough Steffen is currently recovering from knee surgery, Turner knows that another year on the bench at the Emirates would risk seeing him lose his place in the national team. That is a big reason why he has left Arsenal and why he hopes to be the No 1 at Forest.\nAnother goalkeeper who had a strong 2022-23 and is in the conversation for the USMNT No 1 jersey is Horvath.\nLoaned out to Luton Town, he played a huge part in their promotion to the Premier League via the play-offs, registering a total of 4,620 minutes on the pitch, keeping 20 clean sheets in 47 appearances. However, overall Horvath is seen as being a step below Turner — with the latter a much more well-rounded goalkeeper.\nShould Turner come in and perform at his best, he has the potential to single-handedly win Forest several points this season. MP\n(Top photo: Matthew Ashton – AMA/Getty Images)",
  "word_count": 1915,
  "scraped_at": "2026-02-14T02:00:36.685704",
  "_text_extracted": true
}