{
  "article_id": "a152184f6af2",
  "url": "https://www.geosuper.tv/latest/51018-carragher-slams-liverpools-poor-form-after-psv-defeat",
  "title": "Carragher slams Liverpool poor form after PSV defeat",
  "date": "20251127T143000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nNovember 27, 2025\nFormer Liverpool defender Jamie Carragher expressed his frustration with the team's current form on Thursday following their humiliating 4-1 defeat to PSV, warning that Arne Slot's position could soon become \"untenable.\"\nCarragher also claimed that Mohamed Salah's \"legs have gone,\" citing the winger's decline in form.\nThe defeat marked Liverpool’s ninth loss in 12 games, extending their worst run of form in 71 years. It leaves the club languishing in 13th place in their Champions League group, putting even greater pressure on Slot and his players as they fight to secure a top-eight finish.\nJust six months ago, Slot was celebrating a Premier League title after an impressive first year in charge, but the recent slump has increased scrutiny of the manager.\nReflecting on the embarrassing defeat to PSV, Carragher noted that Liverpool is a club known for supporting its manager and giving them time to prove themselves.\nHowever, he added that poor results can eventually make a manager’s position \"untenable,\" and admitted that the mounting pressure could soon reach a point where it is no longer sustainable.\n\"Liverpool's not a sacking club,\" Carragher said.\n\"Liverpool are different from almost every club in European football – the manager is the king, the manager gets time.\"\nHe continued, \"I've always been in the camp that you stick with the manager... But I’m angry with the players, if I’m totally honest. However, it does get to a stage for any manager at a club where it’s untenable. It can’t go on any longer. I'm not quite there yet, but I know others are.\"\nCarragher also questioned the Liverpool team, implying that Alisson Becker, star winger Salah, and captain Virgil van Dijk could not \"carry\" the team as they had in the past.",
  "word_count": 296,
  "scraped_at": "2026-02-14T02:12:17.571983",
  "_text_extracted": true
}