{
  "article_id": "a16541768851",
  "url": "https://www.caughtoffside.com/2024/08/23/tottenham-willing-pay-e30m-vanderson/",
  "title": "Tottenham willing to spend around €30m in order to land defender",
  "date": "20240823T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur remain keen on signing Vanderson from AS Monaco.\nThe 23-year-old Brazilian fullback has been linked with the move to the North London club and a report from French publication L’Equipe claims that Tottenham would be willing to pay around €30 million to secure his signature.\nIt is fair to assume that Monaco could accept an offer in that region for the Brazilian defender. Vanderson will be tempted to move to the Premier League as well. It would be a major step up in his career and he would get to test himself at a high level.\nHowever, the 23-year-old needs to play regularly at this stage of his career and that might be difficult at Tottenham. The North London club already have Pedro Porro and Djed Spence at their disposal. They might not be able to hand the Brazilian regular game time. However, he would be a useful squad player for them.\nIt will be interesting to see how the situation develops. Tottenham are yet to follow up on their interest with an official proposal to sign the player.\nVanderson would be a superb addition\nThe reported €30 million offer would be reasonable for a player of Vanderson’s quality and experience. There is no doubt that he has the physical and technical attributes to do well in English football and he could be a key player for Tottenham in the long term. The defender certainly has the potential to justify the investment.\nTottenham will be hoping to secure Champions League qualification this season and they will look to win a domestic trophy as well. They need to improve their squad in order for that to happen and someone like Vanderson will certainly help them improve at both ends of the pitch.\nIt remains to be seen whether Spurs can get the deal done before before the window closes.",
  "word_count": 310,
  "scraped_at": "2026-02-14T01:48:56.587875",
  "_text_extracted": true
}