{
  "article_id": "a171a41ccdd1",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-match-coverage/75726/liverpool-vs-southampton-league-cup-2025-26-preview-team-news",
  "title": "Liverpool vs .  Southampton : League Cup 2025 - 26 Preview & Team News",
  "date": "20250922T233000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool vs. Southampton: League Cup 2025-26 Preview & Team News\nLiverpool host the Saints for the Third Round proper of this season’s Carabao Cup\nLIVERPOOL VS. SOUTHAMPTON\n| Tuesday, September 23rd |\nLeague Cup, Third Round Proper | Anfield\n8PM BST/3PM EST\nThis will be one of the harder matches to both predict and preview since Southampton, who have been struggling, have been very heavily rotated on a game-by-game basis. Southampton manager Will Still has said Monday that he’s still deliberating on the “right mix” of players who deserve to have a go against Liverpool.\nSouthampton have been struggling this season, winning their first match against Wrexham but going on a run of five league matches without a win (D3 L2). They have managed only one league match without conceding, logging a 0-0 home draw against Portsmouth on September 14th. They’ve had better luck in the League Cup, and have yet to concede in the competition. The Saints beat Northampton away 1-0 back in mid-August before beating a poor Norwich City 3-0 at Carrow Road on August 26th. Liverpool will hope to end this streak of clean sheets for Still’s side.\nLast season Liverpool played Southampton three times (twice in the league and once in the quarter finals of this competition) with the Reds prevailing on all three occasions. Indeed, Liverpool have won the last eight meetings between the two sides, last failing to achieve a victory back in May 2017 in a 0-0.\nThis match should also see a sneaky return to Anfield for Adam Lallana, who is now a first team coach at Southampton. He played for the Reds between 2014 and 2020 after leaving Southampton, and retired from football in June of this year.\nPredicted Liverpool Lineup (4-3-3)\nMamardashvili; Frimpong, Williams, Leoni, Robertson; Endō, Jones, Nyoni; Chiesa, Danns, Ngumoha\nArne Slot confirmed that Liverpool captain Virgil Van Dijk, Ibrahima Konaté, Ryan Gravenberch, Dominik Szoboszlai, and Mohamed Salah will not feature on Tuesday, which — while explicit — is not entirely unexpected given the business of Liverpool’s schedule. Exactly how many senior players will feature for the Reds is unknown, though we can expect to see vice captain Andy Robertson leading out the side, and Georgian goalkeeper Georgi Mamardashvili is likely to see his first start of the 2025/26 campaign.\nWe would have expected to see Stefan Bajčetić at the base of the Liverpool midfield, but unfortunately the Spaniard is nursing a hamstring injury and will miss out. Given his absence, we should see Wataru Endō play in his familiar defensive midfield role, though the Japanese captain might also be selected as a centerback option depending on the fitness (or willingness to risk the fitness) of Joe Gomez. Regardless of partnership, Italian defender Giovanni Leoni likely to make his debut. Given the defensive experience in the fullbacks, Slot does have wiggle room with his centerback options as the Liverpool head coach looks to manage minutes and give experience.\nThough most of the changes around Gomez’s fitness seem to be in terms of recovery time in training, given Liverpool’s failed move for defensive cover we might well see Rhys Williams, who trained with the first team this weekend, start. Gomez never seems to lack in form when coming in from the cold, so Slot could well weigh Gomez’s experience value against the benefits of treating the player with an abundance of caution.\nReports from team training tell us that along with Rhys Williams, all of Jayden Danns, Tommy Pilling, Kieran Morrison, and Kaide Gordon all missed the last U21 outing and trained with the first team, so they can be expected to feature. Rio Ngumoha, who has been with the first team this season, will certainly be eying a start as well.\nThis should be a chance for those on the first team squad who have mostly featured on the bench this season, or have seen their minutes limited with injury. We can expect a first team player to feature at right fullback, though, with Jeremie Frimpong and Conor Bradley sharing minutes there thus far, and one or the other — if not both — might well log some minutes in this one. Indeed, swapping one for the other either at halftime or between 60’ and 70’ might be among the easiest calls for the coach to make.\nCurtis Jones has returned from injury and seems likely to start as an experienced head in midfield — all the more needed should Endō be called to action as part of the back four for some or all of this one. Young Trey Nyoni will want to see his name on the midfield team sheet as well. It’s worth noting that there could be a surprise thrown in along Liverpool’s spine: it would not be completely unreasonable to see the likes of Alexis Mac Allister make an appearance on Tuesday to get some minutes as the midfielder has been suffering somewhat from form, fitness, or a combination of the two. Should that happen, though, he might block young players like Morrison and Pilling from getting minutes, and it’s entirely possible that Slot will opt for an extremely changed side.\nJoining Rio Ngumoha and Jayden Danns up front will likely be Federico Chiesa, who missed out on the initial Champions League squad (though the squad list there is hampered somewhat by specific challenges for homegrown players). It’s entirely possible that Alexander Isak could get some minutes in this one as he re-builds his fitness after missing pre-season.\nShould Liverpool score it will be the 200th goal against Southampton in all competitions, and should Ngumoha find himself on the scoresheet he will accomplish another “youngest goalscorer for Liverpool in x competition” record.\nLiverpool were runners-up in the competition last season, though the added matches may have harmed the team’s form in crucial stages of the Champions League. Nevertheless, Slot will want to win as many trophies as possible, even if the early stages here are largely an exercise allowing young and squad players to gain top-level minutes.\nThe Managers Have Their Say\nArne Slot, who decided against a traditional preview press conference for this one: “Last season we reached the final with these line-ups and there’s no trophy we underestimate, we always want to win every trophy we compete for. That’s the good thing about the quality of the squad we have, that we still have a very good team that we can play tomorrow. But we have to think about the long term as well. If we want to compete in every single trophy then some players need a normal week, which is not playing during the week once in a while as well. That’s managing a team throughout the whole season with trying to compete at every level we are competing for.”\nWill Still: “They’re the best team in England, probably one of the best teams in Europe, and we have to go there with the belief that we can play football and that we’re good at doing certain things in our register. We just have to show a bit of personality, a bit of bravery to stand back up, to get back up. I just want us to have a go, to be brave and show a bit of what we’re about, not just go there and fold over and crumple. We need to be strong, we need to be good at what we do. Just go there and have a go”\nThe Officials\nReferee: Thomas Bramall Assistant Referees: Simon Bennett & Andrew Dallison Fourth Official: Lewis Smith\nNote: There is no VAR at this stage in the competition\nIf you haven’t done so already, we’d love if you signed up for an SB Nation account and join the community at TLO. We’ll bring you and your fellow Liverpool fans from around the world full coverage of every match from the 2025-26 season in the Premier League, Champions League, and domestic cups along getting you breaking news, insight and opinion, tactical discussion, and post-match reactions as the new season plays out. Hopefully you’ll join us for it!",
  "word_count": 1347,
  "scraped_at": "2026-02-14T02:26:56.623715",
  "_text_extracted": true
}