{
  "article_id": "a189628781c1",
  "url": "https://www.manutd.com/en/news/detail/background-on-michael-carrick-man-utd-midfield-maestro",
  "title": "Why Reds love Michael Carrick",
  "date": "20260113T211500Z",
  "domain": "manutd.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why Reds love Michael Carrick\nThroughout his 12 years as a Red, holding midfielder Michael Carrick kept United’s engine ticking over with a simplicity of play that proved so vital to the team’s success.\nIt wasn’t that he was without a flourish in his play, rather that his dedication to the team and calm presence in the middle of the pitch allowed his more creative team-mates to express themselves.\nHe was vital to the success enjoyed by Sir Alex Ferguson’s side from 2007 to 2013, a period in which he became one of the most decorated English footballers ever.\nMichael was born on 28 July 1981 in Wallsend, Tyneside. He was a boyhood Newcastle United fan and played for his local side Wallsend Boys Club, who famously produced ex-Reds captain Steve Bruce, and England internationals Peter Beardsley and Alan Shearer, to name just a few.\nCarrick was signed up by West Ham aged 16, and two years later he won the 1999 FA Youth Cup with the Hammers’ Under-18s.\nUnited appoint Carrick as head coach\nArticleMichael's return is officially confirmed, along with his support staff.\nLoan spells with Swindon Town and Birmingham City followed, then he established himself in the heart of the West Ham senior side.\nIn 2004, Carrick switched across London to play for Tottenham Hotspur, where he impressed so much that in summer 2006, Sir Alex Ferguson signed him for United, giving him Roy Keane’s no.16 shirt. No pressure then, Michael!\nIn his first season (2006/07), Carrick struck up an instinctive partnership with Paul Scholes in the centre of midfield as the Reds looked to win the Premier League for the first time in four years. They combined beautifully: the new man sweeping up and keeping things running smoothly with a wide range of passes, while Scholes was always probing and looking to burst forward to score.\nThey were key to toppling Chelsea as English champions, as United thrilled crowds with a stunning brand of attacking football led by Wayne Rooney and Cristiano Ronaldo.\nA Champions League semi-final defeat to AC Milan ended our European hopes, but only after an amazing 7-1 quarter-final win against Roma in which Carrick scored two stunning goals. Look them up on YouTube!\nThe following season, 2007/08, the side grew in strength again and this time realised their European dream.\nWith the Premier League crown retained on the final day against Wigan Athletic, United met their main title rivals Chelsea in the Champions League final.\nAfter a 1-1 draw across 120 minutes, the game was settled by penalties – United winning 6-5, with Carrick converting his spot-kick. He was a European champion; then a world champion some six months later when he helped the Reds to defeat LDU Quito 1-0 in the FIFA Club World Cup in Japan.\nFurther success followed for Michael: Premier League titles in 2009 (to make it three in a row), 2011 and 2013, the FA Cup in 2016, the League Cup in 2009, 2010 and 2017, the Europa League in 2017, plus six Community Shields.\nWhile international recognition was only occasional (he won 34 England caps), he was certainly appreciated by United fans and team-mates.\nWho is on Carrick's coaching team?\nArticleThe five men who are supporting Michael with first-team duties.\n“Carrick’s like a piano,” Gary Neville once said of him. “When you play with him you think there is authority, control, peace. Sometimes you don’t want people running around like flies. Scholes and Carrick together was peaceful. It was like going into a bar and hearing a piano playing. Relaxing!”\nHis partner Scholes was also glowing in praise, saying: “I remember Michael coming in and taking over the no.16 shirt from Roy Keane, one of the Premier League’s best ever midfielders. He had big boots to fill, but I think he proved that he was more than worthy of the shirt. I loved playing with him.”\nCarrick retired at the end of 2017/18, having played 464 games for the Reds, scoring 24 goals.\nHe became a coach at United, leaving in 2021, before being named Middlesbrough boss and then returning to the Reds in January 2026.\nHe’s since shown the same cool-headed approach in coaching as he displayed across a decade of controlling United’s midfield.\nThis profile was first published in United Heroes, a children's book that tells the story of 30 club legends. Discover more about the Reds' history, with United Chronicles.",
  "word_count": 737,
  "scraped_at": "2026-02-14T02:09:43.010804",
  "_text_extracted": true
}