{
  "article_id": "a1c43706b33c",
  "url": "https://arsenalnews.co.uk/2025/07/02/arsenal-confirm-permanent-signing-of-england-star-chloe-kelly/",
  "title": "Arsenal confirm permanent signing of England star Chloe Kelly",
  "date": "20250703T010000Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal Women have confirmed the permanent signing of Chloe Kelly from Manchester City.\nThe England forward spent the second half of last season on loan with the Gunners and made an instant impact.\nShe scored two goals and provided five assists in 13 appearances during her short spell in London.\nKelly’s performances were key to Arsenal’s strong finish, helping the team secure the UEFA Women’s Champions League title.\nKelly rejoins Arsenal after a successful loan spell\nThe 26-year-old returns to a familiar setting, having started her football journey at Arsenal.\nBorn in London, she joined the club’s academy at the age of 12 in 2010 and went on to feature in 19 first-team matches between 2015 and 2018.\nDuring that time, she scored nine goals and showed clear signs of her attacking quality. She also had two separate loan stints at Everton before making a permanent switch in 2018.\nKelly scored 18 goals in 51 appearances for Everton, becoming a key part of their attack.\nHer form at Everton earned her a move to Man City in 2020, where she further developed her game.\nKelly made 109 appearances and scored 30 goals for City across four seasons. She lifted the Women’s FA Cup in 2019/20 and the League Cup in the 2021/22 campaign.\nOn the international stage, Kelly has scored eight goals in 53 appearances for England Women.\nShe famously netted the winning goal in the 2022 European Championship final against Germany, sealing England’s historic victory.\nKelly also played a major role in the Lionesses’ run to the 2023 Women’s World Cup final.\nThe attacker is currently with the Lionesses at the UEFA Women’s Euros in Switzerland, aiming to help the team secure back-to-back titles.\nHer return to Arsenal adds experience, creativity and goals to Jonas Eidevall’s attacking options ahead of the new season.",
  "word_count": 304,
  "scraped_at": "2026-02-14T02:15:31.396941",
  "_text_extracted": true
}