{
  "article_id": "a1cfa6299e98",
  "url": "https://www.teamtalk.com/manchester-city/man-city-target-ready-to-talk-pep-guardiola-dreams-blockbuster-deal-summer",
  "title": "Man City target  ready to talk  as Pep Guardiola dreams of blockbuster deal this summer",
  "date": "20230523T181500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City target ‘ready to talk’ as Pep Guardiola dreams of blockbuster deal this summer\nManchester City have gone from strength to strength under Pep Guardiola and they could further strengthen their squad in the summer.\nWith the Premier League title now in the bag, Guardiola’s men are gearing up for the FA Cup and Champions League finals to come.\nDuring the second half of the season, Man City have been an unstoppable force. Since Guardiola has tinkered with the system, they haven’t looked back.\nThe likes of John Stones and Ruben Dias have formed the base of their backline and City are keen to add to their defensive options once more.\nRB Leipzig defender Josko Gvardiol has emerged as a primary target for City this summer. The defender is highly rated and would be a statement signing to say the least.\nThe 21-year-old starred at the World Cup for Croatia and plenty of top European clubs have registered an interest.\nAccording to Sport Witness, Leipzig are now ‘ready to talk’ over a potential deal this summer.\nIt is stated that while the club don’t want to sell the defender, an offer of around £97million might be too good to turn down.\nThe German club currently sit third in the Bundesliga and have already qualified for the Champions League next season.\nIt’s fair to say that City have a good track record when it comes to investing in players from the Bundesliga.\nThe likes of Erling Haaland, Ilkay Gundogan and Manuel Akanji have all played crucial roles in Guardiola’s side this season.\nA natural Aymeric Laporte replacement?\nIt’s fair to say that Man City aren’t short on defenders, but a new vacancy could soon be opening up in their side.\nLaporte’s time in Manchester could be coming towards its conclusion. The Spanish defender has been a fine player over the years, but could soon seek a new challenge.\nThe likes of PSG, Barcelona and Tottenham have all registered an interest in the 28-year-old.\nAcross his six seasons with the club, he has made 177 appearances across all competitions. However, this year he hasn’t featured as much as previously.\nIn the Premier League, Laporte has only started in 10 matches and has racked up just 904 minutes of football.\nA knee injury along with the form of Nathan Ake and Akanji has left the Spanish defender watching the majority of the season from the sidelines.\nGvardiol could represent a natural replacement to Laporte. The Leipzig defender is also left-footed and is seven years younger than the Man City man.\nGuardiola always seems to know the perfect time to move players on and freshen up the squad with new blood.\nAn exiting young talent like Gvardiol would certainly be an exciting addition to the Premier League, although he wouldn’t come cheap.\nTo open negotiations with the German club, City will have to be prepared to pay around £97million.\nREAD MORE: Man City identify Prem-based Erling Haaland replacement who Man Utd, Tottenham will fight to sign",
  "word_count": 509,
  "scraped_at": "2026-02-14T02:00:19.993733",
  "_text_extracted": true
}