{
  "article_id": "a1eda2be1428",
  "url": "https://theathletic.com/4584836/2023/06/08/mac-allister-letter-brighton-liverpool/",
  "title": "Thank you , Alexis : A letter to Mac Allister",
  "date": "20230608T114500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dear Alexis,\nWhat a season it has been, for you and Brighton & Hove Albion.\nA World Cup winner’s medal to cherish forever, helping Brighton reach Europe for the first time in their history, and now joining a club with nine European trophies (and that’s not counting the four UEFA Super Cups!), a world championship and 19 top-flight domestic titles.\nNobody of a Brighton persuasion begrudges you this life-changing move to Liverpool.\nAdvertisement\nThe clubs will, of course, be rivals in the Europa League as well as the Premier League next season.\nYou featured in a thrilling 3-3 draw at Anfield in Roberto De Zerbi’s first game as Brighton’s head coach last October, the 3-0 demolition of Jurgen Klopp’s team in the league at the Amex Stadium in January, and also helped knock holders Liverpool out of the FA Cup with a 2-1 home win in the fourth round 15 days later.\nNone of which detracts from understanding the decision you have made.\nYou want to play in the Champions League. Realistically, there’s more chance of that happening regularly at Anfield than the Amex. Your wages will multiply over the five-year contract you have signed. On top of all that, you are 24 years of age, with an opportunity to further your career in an industry where one bad injury can change everything.\nThe way you have politely conducted yourself across the three years and three months since you first kicked a ball for Brighton has been exemplary. You have only ever spoken positively about the club and what they have done for you.\nThe tearful farewell at the end of the final game of the season last month, where you stood on the pitch at Aston Villa applauding fans in the away section, stemmed from heartfelt affection.\nAlexis Mac Allister disappears down the tunnel at Villa Park, perhaps for the final time in Brighton colours, with a pat on the back from shirtless team-mate Evan Ferguson. #BHAFC #AVLBHA pic.twitter.com/m1SGEBk3Ux\n— Andy Naylor (@AndyNaylorBHAFC) May 28, 2023\nYou are the epitome of the player recruitment model that serves Brighton so well.\nThey paid £8million ($9.97m) when they bought you, from Argentinos Juniors of Buenos Aires, in the January 2019 transfer window.\nYou have developed into a player attracting a fee of around six times that amount from one of the most prestigious clubs in the world after scoring 20 goals and contributing nine assists in 112 appearances.\nAdvertisement\nWhat a journey it has been so far since your introduction to the beautiful game, playing “baby futbol” with your two older brothers, Kevin and Francis, at the Club Social Parque academy in Buenos Aires, which previously produced Diego Maradona.\nAlthough born in the agricultural province of La Pampa, you were never going to be a farmer! Not when your dad, Carlos, played for Argentina with Maradona in the 1990s. Football was always going to be your destiny.\nAt Argentinos Juniors — where your father and Maradona both played — you featured in the first team at the age of 17, and played alongside your brothers.\nHaving signed you, Brighton let you stay there for the rest of the 2018-19 season before loaning you to the mighty Boca Juniors the following season, because you didn’t at that stage meet the criteria for a UK work permit (it feels funny typing that now!).\nIt was during that loan spell with your boyhood idols that you first caught the eye of Argentina coach Lionel Scaloni, who gave you a couple of appearances in friendlies.\nBrighton knew full well the scale of the talent they were moulding. That’s why they paid $1million (£785,000) to buy you out of what was a season-long loan with Boca to bring you to England for the second half of the 2019-20 season.\nIt’s easy to overlook, with the passing of time and everything that you have already achieved, just how difficult it was for you in the early stages of your Brighton career.\nYou made your Brighton debut as an 80th-minute substitute in a 0-0 draw at Wolverhampton Wanderers in March 2020 — the club’s final game before the COVID-19 global pandemic shut down the Premier League for three months.\nThat must have been tough, stuck in a flat in a new country, your grasp of the English language nowhere near as strong as it is now. At least you had your mother Silvina to help with settling in, after she was caught in that initial COVID-19 lockdown when she came to visit.\nGO DEEPER\nFrom scouting with his dad to playing with Messi: the Alexis Mac Allister story\nIt took a while to establish yourself under head coach Graham Potter, competing initially for a place in midfield with Yves Bissouma, Aaron Mooy, Davy Propper and Dale Stephens.\nIn your first full season at the club, 2020-21, you were limited to 21 league appearances, with 13 starts, out of the possible 38. Your solitary league goal, in the 90th minute to snatch a 1-1 draw away to Brighton’s arch-rivals Crystal Palace, was a good way to win over any doubters.\nAdvertisement\nYou have just kept growing since then into the accomplished, all-round midfielder that you have become.\nYou only missed five league games in 2021-22, when your five goals and two assists aided the club’s rise under Potter from 16th the previous year to finishing ninth.\nThat was just an appetiser for the main course: the season that concluded last month.\nYou played a pivotal part in Brighton’s success, primarily as one half of a central midfield combination with Ecuadorian accomplice Moises Caicedo, following the sale of Bissouma to Tottenham Hotspur last summer.\nIt was still under Potter for the first six league games, before you and the team blossomed when he left for Chelsea in September and De Zerbi was picked as his replacement. You were ideally equipped to implement the Italian’s precise style of playing out from the back with your comfort in possession under extreme pressure from the opposition and use of the ball.\nThen, at the World Cup in November and December, you demonstrated your versatility by starring in a more advanced role under Scaloni, often linking with Lionel Messi. Your passing ability and awareness were showcased on the biggest stage of all with your exquisite assist for Angel Di Maria’s wonderfully fashioned team goal in the final against France.\nYou had been substituted deep into the second half of extra time after an outstanding performance in that exhilarating 3-3 draw. Your team-mates won the penalty shootout without you, 4-2.\nWe have no doubt that, if you had been put on the spot that night in Qatar, you would have coped with the pressure. Just as you did with your penultimate goal for Brighton, the penalty nine minutes into stoppage time that secured a precious 1-0 home win over Manchester United last month to keep their challenge for Europe on course.\nAdvertisement\nYou only failed once among the nine league penalties you took for Brighton, an impressive record that will be hard to replace.\nThe dead-ball skills extend to free kicks, as you demonstrated with your first home goal of the season, against Leicester City in September.\nLast time out against Leicester… 💥🎯 pic.twitter.com/v6uOn5sVJl\n— Brighton & Hove Albion (@OfficialBHAFC) January 19, 2023\nI know how much you appreciated Brighton granting you extra time off to enjoy the post-World Cup celebrations in Argentina with family and friends, which coincided with your birthday, and the fuss the club made when you returned to a hero’s welcome at their training complex in Lancing early in the new year.\nWelcoming back our World Cup winner! 🙏 pic.twitter.com/Bb2MoZmf2B\n— Brighton & Hove Albion (@OfficialBHAFC) January 2, 2023\nIt would have been understandable if there was a World Cup hangover. Instead, in your first post-tournament start, you scored twice in a 5-1 victory away to Championship side Middlesbrough in the third round of the FA Cup, an environment far less glamorous than the global kudos of Qatar and the wild scenes in Argentina. You finished the season as Brighton’s top scorer with 12 goals. Seven of those were scored after the World Cup.\nNow, a warm welcome is assured when you return to the Amex with Liverpool next season (we’ll find out, roughly, when soon — the fixtures come out on June 15).\nYour contribution to Brighton’s progress, culminating in the greatest season in the club’s 122-year history, won’t be forgotten.\nWith appreciation,\nThe Brighton family\n(Top photo: Daniel Jayo via Getty Images)",
  "word_count": 1423,
  "scraped_at": "2026-02-14T02:19:46.295417",
  "_text_extracted": true
}