{
  "article_id": "a1fd7f0f4cc4",
  "url": "https://theprideoflondon.com/2023/10/04/fulham-chelsea-3-positive-2-negative/",
  "title": "Fulham 0 - 2 Chelsea : 3 Blues positives and 2 negatives",
  "date": "20231004T214500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea FC finally get a win in the Premier League and score more than once. As with every match, there are some things that went well and other aspects that may need looking into. Positives and negatives are a very normal part of every match and evaluating them can lead to better matches in the future.\nChelsea positives\nA confidence boost\nA second win in a row and winning twice in a week is a huge boost in confidence for the squad. While Chelsea haven’t been playing poorly this season, they’ve had their heads hung more than up in celebration. However, during both goals, you could see what it meant from the whole squad. Players celebrating far from the goal together and others running to the goal scorer and exclaiming they deserved this moment.\nWinning games and scoring goals is a huge way to boost confidence within the team and instill more of a drive to continue to do well. After Chelsea’s two great performances, this confidence boost will be massive going into a stretch of matches that will truly test the squad to their limits.\nArmando Broja:\nAfter suffering a serious injury last year, questions were in the air regarding Broja behind the second choice striker behind an unproven Nicholas Jackson. Players coming back from long term injuries could face further setbacks and personal issues, but Broja’s first official start back was quite the opposite.\nAfter a pretty wild mis very early on in the game, Broja soon after netted his first goal in quite some time. This will not only show that Broja is capable of getting on the score sheet, but is also able to put in a great shift while he is still working up to full match fitness. While Jackson doesn’t deserve to have the start taken from him just yet, Broja’s performance will raise questions on who should be the Blues No. 9 when he returns to full match fitness. Luckily having two strikers capable of playing well is a good problem to have.\nPochettino’s Squad Selection:\nMuch of the supporters’ complaints from early on in the season came from ‘Poch’s’ lineups and his decision to play certain players out of their positions. While we can never be sure if Poch has learned from his mistakes or injuries have forced his hand, he can no longer deny that when players play where they are supposed to, it works very well. With such a young squad and players who are first timers in the Premier League there was always going to be a massive learning curve. However, it is finally looking like Pochettino is turning the keys to unlock the potential of this Blues squad.\nNegatives\nInjuries, injuries, injuries:\nWhat can only be described as an epidemic is sweeping through Chels’ with further players going off injured. While blame can’t always be placed on one source, the amount of injuries to key players is astounding and will only hamper ambitions to secure Champions League football or simply continue to win games. Hopefully with another international break fast approaching and the news that certain players have returned to training, this issue will disappear into early season woes.\nPossession:\nWhile Chelsea looked commanding in a lot of aspects of the match, their possession percentage was slightly lower than expected. It can be argued that they rely heavily on the press and counter attack, with players such as Enzo Fernandez and Moises Caicedo they should be able to hold onto the ball more and punish opponents by tiring them out. Having your opponent chase the ball and then find a lane to pass has been incredibly effective for other top teams in Europe. With the caliber of players CFC has, there should be no reason Pochettino can’t rely on this method of attack.",
  "word_count": 635,
  "scraped_at": "2026-02-14T02:00:57.113589",
  "_text_extracted": true
}