{
  "article_id": "a208c8cafcd5",
  "url": "https://www.barcablaugranes.com/2024/6/29/24188761/barcelona-fans-from-around-the-world-share-their-love-for-the-club-and-their-hopes-for-the-future",
  "title": "Meet Dr Heron Rodriguez , a Barcelona fan thanks to Marquez and Messi",
  "date": "20240629T230000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to Forbes, FC Barcelona is the third most valuable football team in the world at $5.5 billion, just behind Real Madrid and Manchester United.\nCulers Talking: Meet Dr Heron Rodriguez, a Barcelona fan thanks to Marquez and Messi\nBarca fans around the world sound off on their love for the club and their hopes for the future\nThat’s amazing when you consider it’s owned by the members, whereas Manchester United, for example, along with the many American sports franchises that make the most valuable sports teams list, are owned by individual billionaires.\nBarcelona’s value has grown exponentially over the past few decades as it expanded its reach internationally.\nSocios span the globe. As Dr. Heron Rodriguez explains it, there’s a reason why you can go to any airport, in any country, and find someone walking around with a Barcelona jersey.\nAnd that’s something we should all appreciate as we look for hope going into next season, and beyond.\nBarcelona is a footballing institution. And football continues to be, and likely will be ad infinitum, the number one sport in the world.\nThere is a way out of the forest, and back to the promised land for the Blaugrana.\nIn the first two articles of this series, Culers Talking, we stayed local, and looked back at the early history of the club. Fortià Viñas and Ferran Carreras, both lifelong fans dating back to the 1950s when the Camp Nou was inaugurated, illustrated what makes Barcelona more than a club by explaining how its ups and downs mirror the political history of Spain itself.\nIt’s important to appreciate the heritage of Barcelona, and the people and the events that laid the groundwork for the success that would follow.\nBut the world continues to change, and Barcelona has been at its best when it leads the way.\nI believe we’ll always think about the history of Barcelona as before and after Lionel Messi. During the era of the GOAT, Barcelona became not just a symbol for the best brand of football, but a cultural icon as well.\nAnd with it came a new wave of fans.\nDr. Heron Rodriguez: Vascular Surgeon, United States\nAmongst those new fans was Dr. Heron Rodriguez, a vascular surgeon, born and raised in Mexico, but currently living and working in Chicago.\nA lifelong football fanatic, but relatively new to the club of culers.\nTo hear his story is to understand the significance of Barcelona beyond the borders of Spain, and the potential it continues to have for greatness going forward.\nWhen asked if Barcelona is his favorite football team, Dr. Rodriguez shared a familiar story of the experience of many dual nationals.\n“The problem is that I have three passports. I’m Mexican. I’m American. And I’m a Spaniard. So my heart gets divided in international competitions.”\n“I was born in Mexico City, when my dad was doing medical training, and then we moved back to the hometown in Puebla, where I grew up. And even though they have a professional team, it’s not my favorite team. Naturally I should have been a Puebla fan. But the way I have always developed my love for my teams is by seeing a game at the stadium for the first time.”\n“In Mexico, my heart is with Club America, even though it should be with Puebla. I even have a brother who plays professionally for them. It’s because when I was really young, my dad took me to an America game, and I fell in love with the team. At that time, America was playing beautifully. It was just a beautiful game, the technical qualities of the players at that point was just unbelievable. And something similar happened to me in Spain.”\nPeople get connected to football for different reasons. The pursuit of trophies is one. The connection to community, and the traditions that surround it is another. But above all else, for Barcelona fans at least, is an appreciation for what makes the beautiful game beautiful. An adjective that Dr. Rodriguez kept coming back to.\nSo when the time came to choose between Real Madrid and Barcelona, the choice was not a difficult one.\nIt all happened on his first trip to Spain right before the Messi era began.\n“My dad is from the north of Spain, in Asturias, but I didn’t grow up there, wasn’t born there. But I do have the Spanish nationality. The very first time I went to Spain was in the mid-2000s, and first I went to Madrid. You know growing up in Mexico in the 80s, Hugo Sanchez was an idol. He was scoring goals every minute, so at that time I was really impressed by Real Madrid. That was the era of the Quinta del Buitre. An amazing team. But when I went to Madrid and I went to the Bernabéu, I was disappointed. I didn’t see a game, but saw the stadium, and the people were so pompous and full of themselves.\n“And then I went to Barcelona, and I went to the Nou Camp and saw a game against Valladolid. And there was this amazing team. I got to the game early, and I saw some of the players, and they looked very approachable. And then I saw them play. And the beauty of the play. It was Frank Rijkaard who was the manager, but they already had the influence of Cruyff. And they had the mentality of let’s play our game. If we win the game, great. And even if we don’t, we’re still going to play our game. As opposed to Real Madrid who are all about the results, and just want to win, no matter how. But at Barcelona, the game was so beautiful.”\nSo there it was. A feeling. Once again, as Ferran explained it.\nSomething different in the atmosphere of the great stadium. A quality that cascaded down to the players themselves, and all the people surrounding the club.\nBut there was one player who really finalized the culer conversion for this doctor.\n“And then, at the medio tiempo, the halftime, this young central defender came out to warm up, and I saw his number and realized it was Rafa Marquez, who is Mexican. And then he came in and played in the game, and that sealed it for me. I was so in love with Barca my first time going to the stadium. And then, of course, the best years of Barcelona came. Ronaldinho. And then obviously what happened when Messi arrived.”\nThis is not an uncommon story. Fans from outside of the country where the club is from become fans because of that one player from their home country that makes it big. I had a best friend growing up, who was born in South Korea, who became a lifelong Manchester United fan because of Park Ji-Sung.\nRafa Marquez was a legend in Mexico, and he became one of the best defenders that Barcelona has ever had. As a result, Barcelona gained a massive base of fans in one of the biggest football loving countries in the world.\n“The majority of Barca fans in Mexico became fans because of Rafa,” Dr. Rodriguez explained. “We would follow the game every week when he was playing.”\nBut it’s not just Mexico where Barcelona grew its influence. Today, the colors can be seen anywhere you go, a point Dr. Rodriguez felt was important to make.\n“No matter where you go in the world, you will see a Barca shirt. Go to any airport in the world, and you will see someone wearing the shirt. We’re all in the same boat as people. And Barcelona as a team has become a global phenomenon in the past twenty years. They’ve achieved a lot, won the titles, and they have been spectacular.”\nSpectacular indeed. Specifically, as it has always been throughout Barca history, they made it happen with the product on the field. And Dr. Rodriguez, a true culer now, was attracted, above all else, to the way the game manifested through the team.\n“The style of play, I just loved it. Passing the ball, and building the play, and never changing the mentality. That’s what I love about Barca. We play our game, and sometimes to our own pain. Because sometimes the results don’t come if we don’t adapt to the opponent as much as other teams do. But we do what we do well, and we go on that. And I just love that. It’s the beauty of the way Barca has played in the past 20 years.”\n“I remember being at Camp Nou, and seeing Messi take a free kick, and winning an important game. And after that, I was like, I can die tomorrow. I have seen Messi score at a completely packed Camp Nou. This is it.”\nBut as we must acknowledge, the club has fallen on tough times, leaving the future uncertain, especially as Real Madrid continues to build in strength.\nBut Dr. Rodriguez has a positive outlook.\n“Nothing lasts forever. We went through really great years, and now we’re rebuilding. And I am so hopeful. Now, this team we have, is packed with young talent. And I think they will do great. I don’t follow administrative things as closely as some people, so I don’t really know how the presidents are managing things differently. But in terms of the team, I just see young players with amazing qualities. And incorporating the style we’ve had for years. But it’s going to take time, and it’s going to be hard, especially with Real Madrid doing so well, and continuing to sign stars.”\nBut can they win titles? That’s the question on most of our minds.\n“Next season is going to be tough, but at the end of the day, anything is possible with football. That’s the beauty of the game. We’re going to see. We have a brand new coach. The hope is always there. Look at Lamine Yamal, he is just amazing, I mean amazing. And he is going to join Pedri and all the young talent. And I think Barca will have a great season.”\nWhen asked what Barcelona means to him, specifically the mantra, “more than a club,” Dr. Rodriguez shared a perspective that’s important to consider as the club continues to gain fans globally.\n“More than a club means something because of the style and quality of play. But sometimes it hurts me to see the team used for political reasons. We’re at a time when not only Spain, but the entire world is so divided. Terribly divided. And the more we do to unite, the better for everybody. That’s one thing I wish didn’t happen with Barcelona, is using the team for politics. Football should be uniting people as members of the same world. Barcelona obviously has the power to do so, to bring people together.”\nOn the one hand, Barcelona will always be connected to its Catalan identity. For people growing up in the region, the stadium has always been a sanctuary to safely and proudly express their identity. When you consider the sordid history of Spain during the dictatorship, and the repression that Catalans, Basques, and other faced, it’s essential to appreciate the role of football as a saving grace.\nThe challenge will be continuing to honor that history while being inclusive. So younger generations, and fans around the world, can find a club that makes them feel welcome, while introducing them to transcendent beauty of the game, in a way that only Barcelona can.\nDr. Rodriguez became a culer for life on his first trip to Spain.\nAnd no doubt, many others will experience the same magic on their first visit to the Camp Nou when it reopens next year.",
  "word_count": 1964,
  "scraped_at": "2026-02-14T02:13:55.806993",
  "_text_extracted": true
}