{
  "article_id": "a213a4aedd8c",
  "url": "https://www.prokerala.com/news/articles/a1574559.html",
  "title": "Champions League : Lenglet joins Atletico Madrid injury list ahead of Lille tie",
  "date": "20241021T191500Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Madrid : , Oct 21 (IANS) Atletico Madrid's French defender Clement Lenglet won't be able to play against Lille in the UEFA Champions League on Wednesday night and is likely to be out of action for around a month after twisting his left knee and ankle. The injury happened after he collided with teammate Axel Witsel in Sunday's 3-1 win at home to Leganes in La Liga.\nIt was at first feared the defender, who is on loan from FC Barcelona had suffered ligament damage, but the club's tests on Monday morning ruled that out, although the Atletico website confirms he has \"a grade 1 twist on the internal ligament in his left knee and a grade 1-2 twist on the left ankle ligament.\"\nAlthough Atletico don't give a return date, Lenglet is unlikely to reappear ahead of the next international break in November, reports Xinhua.\nOther players unavailable for Wednesday's vital match are defenders Cesar Azpilicueta and Robin le Normand and utility player, Marcos Llorente, while Pablo Barrios is also likely to be sidelined after he suffered what looked like a relapse of a muscle problem that originally sidelined him in September.\nDiego Simeone's side need all three points from their game at the Estadio Metropolitano in Madrid to Lille after suffering a 4-0 thrashing to Benfica in their last Champions League match.\nAtletico Madrid was recently sanctioned for three games and a fine of 45,000 euros (48,700 US dollars) by the Disciplinary Committee of the Spanish Football Federation for untoward incidents during the Madrid derby with the partial closure of the south stand in the Metropolitano Stadium.\nThe derby between Atletico and Real Madrid was halted for around 15 minutes in the second half, after members of Atletico's 'Frente Atletico' group of 'ultra' supporters, situated in the south stand, hurled objects, including cigarette lighters and plastic bottles at Real Madrid goalkeeper Thibaut Courtois after he celebrated Eder Militao's opening goal in the game that ended 1-1.",
  "word_count": 328,
  "scraped_at": "2026-02-14T01:51:57.643391",
  "_text_extracted": true
}