{
  "article_id": "a21d70279de5",
  "url": "https://metro.co.uk/2025/04/30/athletic-bilbao-send-nico-williams-transfer-message-arsenal-ahead-man-utd-clash-23000358/",
  "title": "Arsenal sent Nico Williams transfer message by Athletic Bilbao | Football",
  "date": "20250430T120000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ernesto Valverde is hopeful that Nico Williams will stay with Athletic Bilbao for many years yet, despite increasing speculation over a move to Arsenal this summer\nMikel Arteta’s side have made attacking reinforcements a key priority for the summer window after injuries to key players in the final third hampered their Premier League title bid this season.\nWilliams is likely to once again be under consideration after the Gunners failed with a move to sign the 22-year-old following Spain’s success at Euro 2024 last summer.\nAndrea Berta, the club’s new sporting director, is said to have already met the wingers’ representatives to discuss a deal, with Chelsea, Bayern Munich and potentially Barcelona considering a move.\nWilliams, who has 11 goals and seven assists in all competitions this season, has a €58 million (£48.4m) release clause in his current deal.\nHaving recovered from a minor groin injury, the Spaniard is set to feature for Athletic as they take on Manchester United in the first leg of their Europa League semi-final clash.\nAnd Valverde is hopeful that his star player can play a part in many more big European games with Athletic in the coming years.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He has had a very good season and there has been some speculation,’ Valverde said in his pre-match press conference on Wednesday.\n‘We hope that he is with us next season and for many years because we want to have the best players.’\nWilliams, meanwhile, has remained coy on his own future as speculation begins to ramp up again ahead of the transfer window reopening.\n‘The only thing I’m focusing on at the moment is reaching this (Europa League) final,’ Williams said last month in an interview with El Desmarque.\n‘All my energy and focus is 100 per cent on that. Everything else will be decided later. I’m very happy right now.’\nWhile Athletic are fourth in La Liga and currently on course to qualify for the Champions League, United are languishing in 14th and have to win the Europa League to secure a return to European football next season.\nDespite their unconvincing start to life under Ruben Amorim, Valverde is expecting a tough test from his Premier League opponents on Thursday.\nMore Trending\n‘There are many things we need to consider with Utd,’ he said. ‘They are very good at set-pieces with Hojlund, Maguire and De Ligt if he plays, and shooters like Fernandes.\n‘They are a big team and have big capabilities. If you focus on one thing you forget about the others\n‘Ten bad minutes can knock you out and 10 good minutes can keep you alive – that’s what happened to United in the last round (against Lyon).\n‘These are one-time matches and you need to know how to play them. You need to be ready for any kind of situation.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Mason Mount and £50m star told to leave Man Utd ahead of summer transfer arrival\nMORE: Man Utd boosted as star duo return to training ahead of Athletic Bilbao clash",
  "word_count": 575,
  "scraped_at": "2026-02-14T01:58:31.690839",
  "_text_extracted": true
}