{
  "article_id": "a222c43ce97b",
  "url": "https://thepeoplesperson.com/2025/04/23/arsenal-plotting-to-hijack-manchester-uniteds-deal-for-matheus-cunha-293252/",
  "title": "Arsenal plotting to hijack Manchester United deal for Matheus Cunha - Man United News And Transfer News",
  "date": "20250424T020000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are currently seen as favourites for Wolverhampton Wanderers’ Matheus Cunha with Ruben Amorim a known admirer of the Brazilian.\nThe Red Devils are eager to get the deal done as quickly as possible with the head coach keen to add a versatile goalscoring option to his ranks.\nThe former Atletico Madrid star can play as a striker, as one of the attacking midfielders and can even do a job out wide, something Amorim has seen first-hand.\nAlso, with Wolves playing in a similar style as the Red Devils, the 25-year-old is expected to hit the ground running and will not take too much time to adapt to the Portuguese tactician’s style.\nArsenal also like Cunha\nBut as Givemesport have revealed, Arsenal also like the Wolves talisman and are weighing up whether to try and hijack United’s potential deal.\nHowever, the Gunners are not fully convinced with Cunha’s underlying stats while they seem to prefer Brentford’s Bryan Mbeumo, another target for the 20-time English league champions, over the Brazil international.\nThis means United are in pole position to land the Olympic gold-medallist who has twice the number of goals as Rasmus Hojlund and is a more natural fit as compared to Alejandro Garnacho.\n“Arsenal have been weighing up a move for Matheus Cunha but are wary of getting dragged into a transfer tug-of-war for the Wolverhampton Wanderers forward.\nForest as well\n“The Gunners admire the Brazilian’s impact at Molineux and have been impressed by his goalscoring return. There is also an admiration for his versatility and game-changing ability as boss Mikel Arteta goes in search of fresh creativity and firepower.\n“However, sources say there is hesitation behind the scenes over whether his output is truly sustainable at the very highest level, while there is also some concern around his discipline.”\nInterestingly, Nottingham Forest are also known admirers of the Brazilian, who is holding out for a move to a more prestigious club.\nThis suits United with the versatile attacker open to moving to Old Trafford even without Champions League football. The fact that Wolves would be open to a installment-based deal makes it even more perfect for INEOS.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 364,
  "scraped_at": "2026-02-14T01:58:31.708023",
  "_text_extracted": true
}