{
  "article_id": "a22e906732e0",
  "url": "https://www.thenews.com.pk/print/1275760-klopp-needs-time-to-make-impact-as-red-bull-boss-says-alonso",
  "title": "Klopp  needs time  to make impact as Red Bull boss , says Alonso",
  "date": "20250124T213000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Klopp ‘needs time’ to make impact as Red Bull boss, says Alonso\nBERLIN: Bayer Leverkusen coach Xabi Alonso on Friday backed Jurgen Klopp to make an impact in his new job at Red Bull, but said the former Liverpool manager “needs time”.\nKlopp took over as Red Bull´s global head of soccer in January, overseeing a stable of clubs including RB Leipzig, who host Alonso´s Leverkusen on Saturday. Klopp won back-to-back Bundesliga titles with Borussia Dortmund and lifted the Champions League and Premier League trophies with Liverpool.\nThe 57-year-old has already been seen watching Leipzig and French second-tier club Paris FC from the stands. “In the future, yes,” Alonso said of Klopp´s influence.\n“I think that he´s only been in the job for around a month. His influence, his personality, his charisma are huge in the football world. “But everyone needs a bit of time.”\n-\nJames Van Der Beek's Final Conversation With Director Roger Avary Laid Bare: 'We Cried'\n-\nJaden Smith Walks Out Of Interview After Kanye West Question At Film Premiere\n-\nMichelle Obama Gets Candid About Spontaneous Decision At Piercings Tattoo\n-\nWhy Halle Berry Wasn't Ready For Marriage After Van Hunt Popped Question? Source\n-\nBunnie Xo Shares Raw Confession After Year-long IVF Struggle\n-\nBrooks Nader Reveals Why She Quit Fillers After Years\n-\nTravis Kelce Plays Key Role In Taylor Swift's 'Opalite' Remix\n-\nHow Jennifer Aniston's 57th Birthday Went With Boyfriend Jim Curtis\n-\nJoJo Siwa Shares Inspiring Words With Young Changemakers\n-\nJames Van Der Beek Loved Ones Breaks Silence After Fundraiser Hits $2.2M\n-\nDisney’s $336m 'Snow White' Remake Ends With $170m Box Office Loss: Report\n-\nTravis Kelce's Mom Donna Kelce Breaks Silence On His Retirement Plans\n-\nPremiere Date Of 'Spider-Noir' Featuring Nicolas Cage Announced\n-\nPedro Pascal's Sister Reveals His Reaction To Her 'The Beauty' Role\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters",
  "word_count": 333,
  "scraped_at": "2026-02-14T02:26:28.928044",
  "_text_extracted": true
}