{
  "article_id": "a231f26f9de6",
  "url": "https://metro.co.uk/2025/10/16/mikel-arteta-real-problem-arsenal-player-stinking-attitude-24442546/",
  "title": "Mikel Arteta had  real problem  with Arsenal player and his  stinking  attitude",
  "date": "20251016T150000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Darren Bent has revealed Mikel Arteta had a ‘real problem’ with a former Arsenal player and his ‘stinking’ attitude.\nArteta made a point of getting rid of supposed bad eggs when he returned to former club Arsenal to take over as manager in December 2019.\nPierre-Emerick Aubameyang was infamously stripped of the Arsenal captaincy before being released in February 2022.\nBut Arteta was similarly brutal with Matteo Guendouzi, who his predecessor Unai Emery signed in an £8m move from Lorient in 2018.\nEmery described Guendouzi as a ‘talented young player’ with ‘big potential’ when he arrived at the Emirates Stadium and the midfielder featured regularly during the 2018-19 campaign, making 48 appearances in all competions.\nBut Guendouzi’s minutes began to dry up under Arteta and the France international was excluded from training and left out of Arsenal’s squad due to issues with his ‘attitude and general conduct’.\nArsenal sent Guendouzi out on two loan moves before the 26-year-old completed a permanent transfer to Marseille in the summer of 2022.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Mikel Arteta got out Guendouzi, whose attitude was stinking,’ ex-England striker Bent said on talkSPORT. ‘That was a real problem, from what I’ve heard.\n‘I’m not obviously making these rumours up, but this is what I’ve heard that his attitude was poor, Guendouzi. So he obviously had to go.’\nIt is impossible to argue that Arteta was not right to get rid of players he feltwould prevent Arsenal from competing for major trophies once again.\nAfter a period of stagnation, Arsenal have finished as runners-up in the Premier League for the past three years and reached the semi-finals of the Champions League last season.\nArteta’s side sit top of the Premier League ahead of Saturday’s London derby against Fulham after defending champions Liverpool lost three games in a row.\nAsked about Arsenal’s title aspirations, Bent told the Football Association: ‘I definitely think that Arsenal can win either the Premier League or the Champions League this season. I think this is their time.\n‘I look at the squad depth they’ve got and, finally, Arsenal have now got two very good players for every position. We look strong.\n‘There were times in recent seasons where if the likes of Saliba, Saka and Odegaard were injured, the wheels would completely fall off.\n‘Now, all of a sudden, you look at the team and you’re suddenly asking questions like: “Are these players going to get back in the team?”\nMore Trending\n‘Arsenal have not had that for such a long time, but they’ve now got the squad to compete on both fronts, not just pick one or the other.\n‘I think they can go deep in the Champions League where they got to the semi-finals last year and I think they can win the Premier League this year. I really do.’\nWhile Arsenal return to action against Fulham, who they took four points from last season, defending champions Liverpool face Manchester United at Anfield.\nArne Slot’s side won their first seven games of the season before suffering consecutive defeats to Crystal Palace, Galatasaray and Chelsea prior to the international break.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Liverpool plotting shock January transfer move for Germany star\nMORE: Omar Alderete injury update ‘positive’ ahead of Sunderland vs Wolves\nMORE: Arsenal handed injury boost ahead of Premier League clash with Fulham",
  "word_count": 623,
  "scraped_at": "2026-02-14T01:52:49.024691",
  "_text_extracted": true
}