{
  "article_id": "a27b79f435af",
  "url": "https://metro.co.uk/2026/01/12/chelsea-boss-liam-rosenior-defends-arsenal-unfair-label-26245074/",
  "title": "Chelsea boss Liam Rosenior defends Arsenal from unfair label",
  "date": "20260112T183000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liam Rosenior has dismissed the idea that Arsenal have become ‘Set-Piece FC’ ahead of his Chelsea side taking on the Gunners on Wednesday in the Carabao Cup.\nArsenal are enjoying a fabulous season, sitting six points clear at the top of the Premier League table and three points ahead of their nearest challenger in the Champions League table.\nUnder Mikel Arteta the Gunners have become very dangerous from set-pieces, with no team scoring more goals in the Premier League from set-plays this season than Arsenal’s 12.\nClearly that is just one part of Arsenal’s offence, having scored 40 goals in their 21 Premier League outings so far this campaign.\nIt was put to Rosenior that Arsenal have been labelled ‘Set-Piece FC’ by some, but he thinks this is unfair to a team that is ‘good at everything’ under Arteta.\nIn just his second game in charge of the Blues, Rosenior will take on Arsenal in the first leg of the Carabao Cup semi-final at Stamford Bridge on Wednesday and is expecting threats from all areas.\n‘Arsenal are good at everything. They’re good at everything,’ the Chelsea boss told a press conference when asked if Arsenal are taking the game back in time. ‘They have a good team. It’s not about taking the game back in time.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘You have to manage your one per cent to be as good a team to win as many different ways as possible. I respect them. I think they’ll respect us, we’re a good team as well.\n‘But no, people can talk. I don’t know who’s calling them Set-Piece FC. I’m definitely not.’\nHe added: ‘I think they’re a team who are very good without the ball. I think they have a really, really clear idea in the way they want to play with the ball.\n‘On top of that, they’re very, very well organised with good deliveries on set-pieces. That’s what you want to be if you want to be successful. That’s the idea for every coach.’\nRosenior started his Chelsea career with a 5-1 win at Charlton in the FA Cup third round on Saturday, a good opening to his huge step up from Strasbourg.\nArteta is a manager who was given a massive opportunity by Arsenal when he had no experience in a top job beforehand and Rosenior hopes he is given the same kind of time the Spaniard has had at the Emirates.\n‘Everyone starts somewhere. It doesn’t matter. I think Mikel is someone who’s done an incredible job,’ said the Blues boss.\n‘He’s had time to build the way he wants his team to look. They’re very well organised. They’re very good in terms of their organisation in every aspect of the game. He’s done a very, very good job there.\n‘Like I said, everyone has to start somewhere. I’m really, really looking forward to the game.\nMore Trending\n‘It’s just one of those things that everybody has a different background. Everyone has a different way of getting to somewhere. And you respect everybody in the industry, because it’s a difficult industry to be in. Especially as a coach, you’re judged on every word, every action, every game. If you can’t deal with that pressure, then you shouldn’t be in a job.’\nOn Chelsea’s team news for the first leg on Wednesday, Rosenior did not commit on the status of Reece James, Cole Palmer and Malo Gusto, who were all rested for the Charlton game.\n‘Obviously, Moises [Caicedo] is suspended. He was marvellous in the last game,’ he said. ‘We’ve had no injury problems coming out from Charlton, which is a really, really good thing.\n‘I’ll make a decision on Cole, Reece and Malo tomorrow. I’m giving them some extra time. Doing the press conference two days before is not ideal. Sorry about that, but I’ve got time to make a decision. I haven’t made a decision on the team. I will make that decision tomorrow or the morning of Wednesday.’\nMORE: ‘He was bored’ – Martin Keown slams Gary Neville for scathing criticism of Arsenal star\nMORE: Arsenal legend tells Chelsea that Enzo Maresca ‘obviously’ left for ‘another job’\nMORE: Arsenal cult hero Per Mertesacker confirms he will leave academy manager role",
  "word_count": 757,
  "scraped_at": "2026-02-14T02:09:43.012588",
  "_text_extracted": true
}