{
  "article_id": "a27c34b2caa9",
  "url": "https://www.france24.com/en/live-news/20240629-manchester-united-s-earps-latest-to-leave-wsl-club",
  "title": "Earps leaves Man Utd saying she cannot stay at WSL team in  transition  ",
  "date": "20240629T134500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Earps leaves Man Utd saying she cannot stay at WSL team in 'transition'\nLondon (AFP) – Manchester United goalkeeper Mary Earps appeared to fire a parting shot at the direction of the club under minority owner Jim Ratcliffe on Saturday as she became the latest high-profile player to leave the Women's Super League side.\nIssued on: Modified:\nThe England international said she could not achieve her career ambitions at a club undergoing \"transition\".\nSince his takeover of football operations at Old Trafford, billionaire businessman Ratcliffe has made it clear that the focus has been on the men's team.\nEarps is now out of contract and reportedly close to signing with Paris Saint-Germain after rejecting a new deal that would have kept her at United.\n\"Dear the United family, after five years of service to your great club, I have decided that it's time for a new challenge,\" Earps wrote in an Instagram post.\n\"It's a decision I've gone backwards and forwards on for some time, and is not one I've made lightly,\" the 31-year-old added.\n\"The club is about to undergo a period of transition, and unfortunately I don't feel it aligns with the timing of where I'm at in my career, therefore I think now is the right time to make a change and embark on a new challenge.\"\nA club statement issued earlier Saturday said: \"Everyone at Manchester United would like to thank Mary for her fine service and wish her the best of luck in the next stage of her career.\"\nEarps's exit comes just two days after that of United club captain Katie Zelem, with the Old Trafford hierarchy having previously announced the departure of striker Lucia Garcia.\nEuro 2022 winner Earps joined United in 2019 and made 125 appearances for the club.\nDuring the 2022/23 WSL season, Earps kept 14 clean sheets to set a new league record, and a few months later finished fifth in the voting for the women's Ballon d'Or -- the highest placing achieved by a goalkeeper.\nLast season, Earps was between the posts as United beat Tottenham 4-0 at Wembley in the Women's FA Cup Final, to secure the club's first major trophy in the women's game.\nBut after finishing fifth in the WSL last season, 20 points behind champions Chelsea, United accept they are not yet in a position to challenge for either the league title or the Champions League.\nThe women's team, founded in 2018, moved into a new £10 million ($13 million, 12 million euros) training facility in 2023.\nUnited, however, plan to overhaul their Carrington training base in a move which will see the women's team leave the site.\n© 2024 AFP",
  "word_count": 446,
  "scraped_at": "2026-02-14T02:13:55.807824",
  "_text_extracted": true
}