{
  "article_id": "a29e82ea2e5b",
  "url": "https://www.al-monitor.com/originals/2023/09/iranians-give-ronaldo-excited-welcome-tehran",
  "title": "Iranians give Ronaldo an excited welcome in Tehran",
  "date": "20230918T191500Z",
  "domain": "al-monitor.com",
  "source_country": "Israel",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Iranians give Ronaldo an excited welcome in Tehran\nCrowds of Iranian football fans gave Cristiano Ronaldo a rapturous welcome on Monday as his Saudi team arrived in Teheran for the first home-and-away club tie since the two countries resumed diplomatic relations.\nFans chanted the name of the Portuguese five-time world player of the year as he arrived with his Al Nassr teammates to face Iranian club Persepolis in the Asian Champions League on Tuesday.\nThe match will be the first since Tehran and Riyadh reached a China-brokered deal announced in March.\nTeams from both countries had only played matches on neutral grounds since 2016 when Sunni-majority Saudi Arabia and Shiite-majority Iran severed ties.\nIn Tehran, excitement filled the air as fans eagerly waited to catch a glimpse of Ronaldo as he left Iran's Imam Khomeini's airport.\nLarge crowds of cheering fans lined the streets as Ronaldo and his team arrived at a hotel in Tehran on board a bus.\nOthers chanting \"Ronaldo, Ronaldo!\" even flooded into the hotel lobby.\nPosters of Ronaldo sprung up across the Iranian capital's main streets emblazoned with \"Welcome\", written in Arabic, English, and Farsi.\n\"I think it will be a beautiful game and will have a lot of excitement,\" said 28-year-old Navid Borhanifar, a Ronaldo fan.\n\"It's very exciting for me.\"\nSadly for the fans, none will be allowed to attend the match which will be held at the gigantic Azadi stadium, which can host up to 90,000 people.\nThe Asian Football Confederation have ruled that the game be played behind closed doors as punishment for a controversial 2021 online post by Persepolis before a match against an Indian team.\n- 'Unlimited internet' -\nRonaldo and his teammates have been placed under the protection of an \"elite unit\", specialised in securing presidential visits, according to sports website Varzesh 3.\nThe unit will be in charge of \"preventing any contact between fans and players of the Saudi team,\" it added.\nRonaldo's arrival has also sparked a debate over Iran's internet restrictions.\nIran has imposed strict internet curbs -- including on WhatsApp and Instagram -- since last year's mass protests triggered by the death in custody of Mahsa Amini.\nAmini, a 22-year-old Iranian Kurd, had been arrested for allegedly violating the Islamic republic's dress code for women.\nLast week, Persepolis's general manager Reza Darvish proposed that the Saudi team be given SIM cards with unfiltered internet access.\n\"I have talked to the CEO of Irancell (a local provider and sponsor to Persepolis) and asked for SIM cards for... players and those who accompany them with unlimited internet,\" he said in a press conference.\nThe 2023-2024 Asian Champions League officially begins this week with the spotlight on Saudi Arabia which alongside Ronaldo has lured a host of stars including Karim Benzema, Neymar and Sadio Mane.\nPersepolis are one of the region's most successful clubs and reached the final of the Asian Champions League in 2018 and 2020, while Al Nassr won the tournament in 1995.\nOther matches between the two countries will take place in the coming weeks. Saudi's Al Ittihad are scheduled to play Iran's Sepahan on October 2, and Saudi club Al Hilal are scheduled to meet Iran's Nassaji Mazandaran on October 3.",
  "word_count": 537,
  "scraped_at": "2026-02-14T02:25:00.763205",
  "_text_extracted": true
}