{
  "article_id": "a29ea42549e1",
  "url": "https://metro.co.uk/2025/10/21/gary-lineker-claims-64m-star-cost-arsenal-premier-league-title-24478491/",
  "title": "Gary Lineker claims £64m star could cost Arsenal the Premier League title",
  "date": "20251021T100000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Lineker believes Arsenal need Viktor Gyokeres to ‘start scoring’ if they are going to ‘realise their ambitions’ and ultimately win the Premier League.\nMikel Arteta’s side, runners-up for the past three seasons, moved three points clear at the top of the table with a 1-0 win over Fulham on Saturday.\nThe Gunners have the joint-best record over the past five games, taking 13 points in that period to establish themselves as the early pace-setters.\nSecond-placed Manchester City also clinched a victory but defending champions Liverpool lost to Manchester United, suffering their fourth successive defeat in all competitions.\nArsenal are now the bookmakers’ favourites to win the Premier League for the first time since 2004 but Lineker believes a successful title bid may be reliant on an upturn in form in Gyokeres.\nMuch was expected of Gyokeres following his £64m move to the Emirates Stadium given his productive spell at Sporting which produced 97 goals in 102 matches.\nThe Sweden international, 27, scored a brace on his home debut for Arsenal but has netted just one goal in 13 appearances for club and country since then.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nDespite Gyokeres’ goal drought, Arteta and several Arsenal players have defended the ex-Sporting striker and insisted he is contributing to the team’s impressive form.\n‘Viktor Gyokeres is going through a bit of a bad spell,’ ex-England striker Lineker said on The Rest is Football podcast. ‘It’s seven games in all competitions without a goal now [for Arsenal].\n‘I think for Arsenal to really realise their ambitions, he’s going to have to start scoring a lot of goals. I think it’s a big spell coming up for him over the next few games.’\nPremier League record goalscorer Alan Shearer, meanwhile, claims Arsenal ‘paid too much’ for Gyokeres.\nArsenal completed a £64m deal for Gyokeres after seeing off competition from Manchester United, who then spent £74m on Benjamin Sesko.\n‘I think Arsenal paid too much for him. I would say the same with Benjamin Sesko at Manchester United,’ Shearer said. ‘He’s definitely going to have to score more goals.\n‘But I do think he brings something to the Arsenal team. One of his positives is that he runs in behind which then will help create space for others to exploit.\n‘But there’s no doubt he’s going to have to improve his numbers with the goals because we said it last season, what Arsenal have needed, cried out for, is a goal scorer.\n‘He’s only got three up to now, but they are looking really impressive as a team and I think he has added something different to the team.\n‘Instead of coming short like Kai Havertz might or Mikel Merino might have, he offers something going the other way which then opens up a little bit of space.’\nMerino was asked about Gyokeres’ goal drought at Arsenal’s pre-match press conference ahead of the Champions League clash against Atletico Madrid on Tuesday night.\n‘I am sure goals will come, I am sure he wants to score as much as anyone else,’ said Merino, who spent a signficant section of last season as a false nine.\n‘I am pretty sure he is providing the best performances on and off the ball for his teammates. Everyone needs that love, everyone needs to feel comfortable to be surrounded by nice people.\nMore Trending\n‘Viktor is just an example but everyone is wishing him to keep doing what he’s doing. The most important thing is the team wins.\n‘He has the tools and the physicality, but we cannot be focusing only on the numbers. If you see the games you see how much he can give us.\n‘I think he’s a pretty confident guy. Everyday in training he scores goals. I feel like he knows what he’s capable of. He’s scored so many goals last season. We trust him.’\nArsenal will attempt to maintain their perfect Champions League record when La Liga side Atletico visit the Emirates Stadium on Tuesday.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ex-Man Utd coach Rene Meulensteen makes shock Premier League title prediction\nMORE: Jeremie Aliadiere tells Arsenal to avoid deal for £79m Liverpool star in January\nMORE: Chelsea vs Sunderland: Latest team news, predicted lineups and injuries",
  "word_count": 771,
  "scraped_at": "2026-02-14T01:59:14.388890",
  "_text_extracted": true
}