{
  "article_id": "a2a1526318d8",
  "url": "https://thepeoplesperson.com/2023/03/17/manchester-united-ready-to-splash-150million-to-sign-victor-osimhen-and-kim-min-jae-261386/",
  "title": "Manchester United ready to splash £150million to sign Victor Osimhen and Kim Min - jae",
  "date": "20230318T023000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Despite dropping out of contention in the Premier League, Manchester United are still in with a chance to add to their Carabao Cup triumph.\nThe Red Devils are set to face Sevilla in the Europa League quarterfinals while a trip to Wembley beckons in the FA Cup as they take on Fulham on Sunday.\nManager Erik ten Hag deserves credit for transforming the fortunes of this club in such a short span of time but he will privately admit that the team are overperforming considering the resources at his disposal.\nStriker and defender required at OT\nThe need for a striker is very evident with Marcus Rashford the only player in the squad to reach double figures in terms of goals.\nThe team has also suffered on the road against the big teams. The Reds have conceded a massive 16 goals in the three away ties against Manchester City, Arsenal and Liverpool.\nThe drop-off in quality when the duo of Raphael Varane and Lisandro Martinez is replaced with Victor Lindelof and Harry Maguire is there for all to see.\nWith Maguire and Lindelof’s futures uncertain, the defence also needs to be reinvigorated ahead of next season with Ten Hag making it clear that he wants to win every game in every competition.\nThe 20-time English league champions have been linked with a plethora of strikers including Tottenham’s record goal-scorer Harry Kane.\nAmong defenders, there are a lot of names to choose from including Jurrien Timber, who was close to joining last season.\nBut as per Football Insider, Napoli duo Victor Osimhen and Kim Min-jae are the favourites to join with United prepared to break the bank for the deadly duo.\nTen Hag admires both stars with multiple scouting trips returning with positive reviews.\nThe Nigerian striker is the top scorer in Serie A and has scored 23 goals in 28 appearances across all competitions this season, including four in five Champions League games.\nOsimhen & Kim to be brought in?\nThe South Korean, who has exceeded Kalidou Koulibaly’s performances in one season, has helped the club to 16 clean sheets in 33 games while the team has conceded only 16 times in 26 league games.\n“Man United are preparing to swoop for Napoli duo Victor Osimhen and Kim Min-Jae this summer. United understand that Osimhen would cost upwards of £100million given his superb form for the Italian outfit this season.\n“Kim’s contract has an inviting clause for bidders. It is understood that there is a release clause worth £43million in Kim’s contract that will run for two weeks in July.\n“Napoli are desperate to not lose both players in the same window but are aware that they may have their hand forced if the correct bids arrive in the summer,” the report mentioned.\nThese two signings would definitely elevate Ten Hag’s side but there is still a lot of uncertainty regarding the club’s takeover process and subsequently the summer budget available to be used for player recruitment.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £3 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before the big match and during the transfer window!\n- Get the exclusive build-up to the match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 593,
  "scraped_at": "2026-02-14T01:53:35.636727",
  "_text_extracted": true
}