{
  "article_id": "a2a6ed22df05",
  "url": "https://metro.co.uk/2023/05/25/paul-merson-premier-league-predictions-final-day-season-18846147/",
  "title": "Paul Merson Premier League predictions for final day of the season",
  "date": "20230525T183000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Merson has delivered his predictions for the final day of the Premier League season as Everton, Leeds United and Leicester City battle for survival.\nWhile Manchester City have already wrapped up the title and the top-four places appear sewn up, there is much to play for at the bottom-end of the table.\nSouthampton have already been relegated and will finish bottom, but two of Everton, Leicester and Leeds will join the Saints in the Championship next season.\nEverton are currently safe but will need at least a point at home to Bournemouth if Leeds beat Tottenham and Leicester beat West Ham.\nElsewhere, Premier League champions Manchester City conclude their victorious campaign against Brentford and runners-up Arsenal host Wolves.\nBrighton, who have booked a place in next season’s Europa League, travel to Aston Villa while Chelsea will look to end a miserable campaign on a high against Newcastle United.\nNottingham Forest, who ensured their survival last weekend, face Europa Conference League finalists West Ham, Manchester United play host to Fulham and Liverpool visit Southampton.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAll of Sunday’s Premier League fixtures kick-off at 4.30pm and Merson has revealed his predictions for the final day of the season in a column for Sportskeeda.\nAston Villa vs Brighton & Hove Albion\n‘This is a huge game for Aston Villa, as they’ll secure European football with a win against Brighton. The Seagulls have already sealed a place in next season’s UEFA Europa League after their 1-1 draw against Manchester City at the Amex Stadium, so this game is a bit of a dead rubber for them.\n‘When Roberto de Zerbi changes his squad around, Brighton get beat, as we’ve seen in recent weeks against Newcastle United and Everton. If I were a Villa supporter, I’d be happy to face Brighton in a situation like this.\n‘Aston Villa and Tottenham are going head to head for a place in European football and Spurs face relegation-threatened Leeds United, so this is a much easier game for Unai Emery and co.\n‘Considering where Villa were under Steven Gerrard, it would be an incredible achievement if they manage to secure European football. As for Tottenham, it’s all gone wrong for them in the second half of the season starting with the Antonio Conte fiasco, but they will look to finish with a flourish.\n‘I’ve heard that Aston Villa will have a fair bit of money to spend this summer, so watch out for them next season. As for this game, I think Emery and co will get the job done to finish what has been an outstanding second half of the season for them.’\nPrediction: Aston Villa 2-0 Brighton\nEverton vs Bournemouth\n‘Leicester City’s 1-1 draw against Newcastle United the other day could be a priceless result for them, as it puts a lot of pressure on Everton.\n‘It’s going to be a lot harder now for the Toffees and their misery could get compounded if Leicester score an early goal against West Ham, who could rest a bunch of key players with one eye on the UEFA Conference League final against Fiorentina.\n‘That said, I don’t see Bournemouth turning up, as they don’t have much to play for. Everton, on the other hand, are heading into one of their most important games in Premier League history, so I fancy them to step up and get the job done to avoid relegation.’\nPrediction: Everton 2-0 Bournemouth\nLeeds United vs Tottenham Hotspur\n‘This is a hard one to call as both teams have been quite unpredictable in recent weeks. Leeds United played half of West Ham’s reserves the other day and managed to lose despite taking the lead, while Tottenham’s away record is atrocious, to say the least.\n‘A draw is no good for either team, so I think this will be an end-to-end gung-ho football match. It’ll suit both teams and if you’re watching this game as a neutral, I think it’ll have bags of goals.’\nPrediction: Leeds United 2-2 Tottenham Hotspur\nBrentford vs Manchester City\n‘Manchester City can rest every player and still get a good team out – we saw it against Brighton yesterday. Erling Haaland not scoring against the Seagulls means he might find it hard to get to 60 goals in all competitions this season, but that will be the last thing on his or Pep Guardiola’s mind as the Cityzens chase an unprecedented treble.\n‘The Premier League champions play only one way and if we’re being completely honest, you could say the same for Brentford as they always look to be on the front foot regardless of the opposition. I’m going for a 2-2 draw here as Man City could once again play a much-changed squad, with one eye on the two cup finals they have on the horizon.\n‘I fully expect Manchester City to win the treble, I’d be utterly shocked if they didn’t. Kalvin Phillips is a player who has barely featured this season and there have been reports that he could be offloaded this summer, but I doubt that will be the case.\n‘If you look at the likes of Jack Grealish, Riyad Mahrez and Raheem Sterling at Manchester City over the years, they’ve all taken a year to adapt.\n‘With Ilkay Gundogan reportedly on his way out of the club, Phillips could get his chance next season, so I think he gets another year to show everyone what he’s capable of.\n‘He’s still young and could win three trophies this year, so even if he were to leave, where would he go?’\nPrediction: Brentford 2-2 Manchester City\nManchester United vs Fulham\n‘Manchester United need just a point from their remaining two games to book their place in the UEFA Champions League next season. They face Chelsea later today and I think they’ll get at least a draw, so this game could become inconsequential to them.\n‘If that were to be the case, I can see Erik ten Hag resting a handful of key players for this one, which could make Marco Silva’s side favourites.\n‘Fulham have surprised me this season and they have players who can hurt Manchester United’s backline, so I think they could record a famous win at Old Trafford to cap off what has been a successful return to the top flight.’\nPrediction: Manchester United 1-2 Fulham\nSorry, this video isn't available any more.\nChelsea vs Newcastle United\n‘It’s been a dismal season for Chelsea and I don’t expect them to beat Manchester United, so the game against Newcastle United at Stamford Bridge is the perfect chance for them to sign off on a high.\n‘That said, it will depend a lot on what Newcastle do, with Eddie Howe’s side currently on a high after sealing their return to the UEFA Champions League with a 1-1 draw against Leicester City.\n‘After a lorry load of games across all competitions, we still don’t know Chelsea’s best starting XI and we’re at the final game of the season. That just sums them up, really.\n‘They have too many players and with Mauricio Pochettino set to take over the reins from Frank Lampard, he’s got a massive job on his hands to trim the squad. He won’t want to work with 30-odd players, so I think there could be a bit of a fire sale at Stamford Bridge this summer.\n‘Two players who shouldn’t be allowed to leave are Mason Mount and N’Golo Kante. Chelsea face an uphill battle to finish in the top four next season, so they can’t afford to sell Mount to the likes of Arsenal, Manchester United or Liverpool, as they’d be strengthening one of their rivals.\n‘He’s come to a bit of a standstill this season but he was Chelsea’s Player of the Year in 2021 and has a wealth of experience for a 24-year-old.\n‘As for Kante, it’s a bit of a hard one because he’s on the wrong side of 30 and in recent seasons, injuries haven’t been kind to him.’\nPrediction: Chelsea 2-2 Newcastle United\nLeicester City vs West Ham United\n‘I really fancy Leicester City to win this one, but they need to take an early lead against West Ham to put pressure on the likes of Everton and Leeds United.\n‘On the final matchday of last season, Manchester City were 2-0 down against Villa with 15 minutes left on the clock. Liverpool could have put more pressure on the Cityzens if they had scored a goal against Wolves in that period, but they didn’t manage to do so, allowing Manchester City to stage a stunning fightback and win the title.\n‘It might not seem like much, but the smallest of margins could decide everything in the Premier League. I think Leicester will win and stay up but if they don’t, the likes of James Maddison, Youri Tielemans and Harvey Barnes will leave as they are too good to be playing in the Championship.’\nPrediction: Leicester City 3-1 West Ham United\nArsenal vs Wolverhampton Wanderers\n‘Arsenal need to win and send the fans home well as it’s been a bad end to a season that promised so much just a few weeks ago. They absolutely have to beat Wolves and I think they’ll do so comfortably, so I’m going for a 3-0 win.\n‘Mikel Arteta and his squad have undoubtedly exceeded expectations this season and have been outstanding as a team. You could say the same thing about the Arsenal faithful – their support has been magnificent throughout the season and they’ve experienced a title challenge after a long, long time.\n‘That said, next season is definitely going to be harder as the likes of Liverpool and Chelsea will look to bounce back, while Manchester United, Brighton, Newcastle United and Tottenham will all be in the mix as well.\n‘Arsenal have a fantastic young squad and could compete for the title once again if they manage to get Declan Rice, a centre forward and a couple of more shrewd signings, but if they don’t get it right this summer, their finishing top four is by no means a foregone conclusion.\n‘I will say one thing, though. As long as Pep Guardiola is around, I don’t see anyone else winning the Premier League.’\nPrediction: Arsenal 3-0 Wolves\nSouthampton vs Liverpool\n‘I think Liverpool will destroy Southampton to finish their season on a positive note, I’m going for a 4-0 win for the away side. On a hot summer’s day down at St Mary’s against a relegated team, they will finish on a blast.\n‘Mohamed Salah loves scoring goals and I expect him to play a big role for Jurgen Klopp’s side as the Reds prepare to bid adieu to the likes of Roberto Firmino, James Milner, Naby Keita and Alex Oxlade-Chamberlain.\n‘Firmino is an unbelievable player and I would like to think he’s a legend of the Jurgen Klopp era at Liverpool. Salah and Sadio Mane produced the numbers season after season, but Firmino knitted it all together. I couldn’t talk highly enough of the man – Liverpool wouldn’t have been as good as they were if it wasn’t for him.\n‘Oxlade-Chamberlain is a great player but he’s just been dogged by injuries over the years. If he gets fit, he could be a great signing for a handful of Premier League clubs. As for Keita, I can count on one hand the number of good games he’s hand for Liverpool. He’s a talented player but I don’t think he ever played 20 games in a row for the Reds, I have no idea why things just never happened for him at Anfield.’\nPrediction: Southampton 0-4 Liverpool\nCrystal Palace vs Nottingham Forest\n‘Nottingham Forest have done incredibly well to confirm Premier League survival before the last game of the season, fair play to Steve Cooper and his players.\n‘They got ten points from a possible 15 in a run that included Arsenal and Chelsea, which just shows that they showed up at the right time when the odds were stacked up against them.\n‘I’d say the job Steve Cooper’s done at Forest has gone a bit under the radar. There were talks that he could be sacked midway through the season, but they kept faith in him as he was the man that brought them up. Forest signed about 100 players and took time to get going, but they will look back on this season as a huge success.\n‘Palace are playing some good football under Roy Hodgson, with the likes of Eberechi Eze, Micheal Olise and Wilfried Zaha finishing the season on a positive note. There’s not much riding on this one, but I just have a feeling Palace will win as they are playing with a lot of freedom.’\nPrediction: Crystal Palace 3-1 Nottingham Forest\nMore Trending\nMORE: Chelsea ready to match PSG’s £52m bid for Sporting midfielder Manuel Ugarte\nMORE: Arsenal fall short of West Ham valuation for Declan Rice as Man Utd enter race\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 2232,
  "scraped_at": "2026-02-14T02:19:46.299511",
  "_text_extracted": true
}