{
  "article_id": "a2ad6180d7d6",
  "url": "https://www.fourfourtwo.com/features/ranking-every-premier-league-teams-summers-transfers-managerial-changes-and-results-so-far",
  "title": "Ranking every Premier League team summers : Transfers , managerial changes and results so far",
  "date": "20240903T113000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranking every Premier League team's summers: Transfers, managerial changes and results so far\nThe Premier League season is still young and there's time for a few on this list to make us look a bit stupid, but here's how it looks to us as it stands\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\n'Winning the transfer window' is a bit of a daft boast, I think we can all agree, but there is such a thing as a good window or a bad window... which ultimately all comes down to what happens on the pitch of course. So which Premier League sides have had good summers, who's had bad ones, and who's somewhere in the middle?\nWe've taken into account the signings that have come through the door, the players that have been lost, and those who clubs have been able to hold onto - as well as considering managerial changes, expectations, and perhaps above all else, performances in the league so far.\nWe'd also say it's still early day so we fully accept that some of these rankings may change over time, but we can only go off the information we have so far...\nVIDEO: Why Raheem Sterling Could Actually Be PERFECT For Arsenal Specifically\n20. Everton\nBottom of the table with no points and already into double figures for goals conceded, having lost a couple of key players... and that's the least of it for Everton.\nTwo collapsed takeovers have left he club facing a hugely uncertain future. There may be a light at the end of the tunnel on that front, but it's looking bleak again at the moment. They'll be praying Armando Broja is fit and firing as soon as possible.\n19. Leicester City\nAnother club with off-field matters hanging over them, Leicester lost both their promotion-winning manager and star player Kiernan Dewsbury Hall to Chelsea well before the season began.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nLeicester have recruited multiple midfielders and brought in Steve Cooper to oversee the whole project, but after the initial optimism of an opening-day point against Tottenham, it already looks like it could be a tough season for the Foxes, especially if they are docked points for their alleged financial breaches.\n18. Southampton\nWe have some sympathy for teams who come up from the Championship these days: a playing style that brings success in the second tier can look woefully inadequate in the Premier League.\nThat has proven to be the case for Southampton, who have recruited heavily but have a real self-destructive streak that, in truth, reared its head in the Championship too. It's been three defeats from three for Russell Martin's side, including against a Newcastle side playing with ten men for three-quarters of the game.\n17. Manchester United\nThe results and performances so far are the main factor, of course, particularly as they have the double-effect of making Manchester United's decision to stick with Erik ten Hag look a bit silly.\nThat's in spite of a transfer window that on paper actually looks pretty good - with the caveat that it's been constructed around a manager for whom the fans have ever-diminishing levels of patience. Casemiro was a big problem against Liverpool; United's best hope may be that deadline day Manuel Ugarte proves to be a considerable upgrade.\n16. Wolverhampton Wanderers\nA few late-window signings rescued Wolves from contending for the bottom of this list after they lost two of their best players, Pedro Neto and Max Kilman, to Chelsea and West Ham earlier in the summer.\nStill, it all feels a bit flat for Wolves, with none of their signings particularly provoking excitement even if they prove to be good pick-ups. Results have not been good either, and it's hard to give much credit for having had a tough start if they hadn't got smashed for six at home to Chelsea.\n15. Ipswich Town\nIpswich had a nightmare first two fixtures against Liverpool and Manchester City, so it's hard to judge them on results; those are two games most teams in this division would expect to lose, let's be honest.\nA point against Fulham is a decent start, but the jury really is out for now. Costing Ipswich a place or two is their frustrating deadline day, when Armando Broja opted to go to Everton and Reiss Nelson picked Fulham; there was clearly more they wanted to get done up top that they just weren't able to do.\n14. Newcastle United\nThis is probably the placement we most expect might end up looking stupid - but by Eddie Howe's own admission, the transfer window was 'challenging'. You can understand why, with no European football and constrictions from FFP.\nNewcastle have not suffered any major losses, however, while the defence has been bolstered as required, they have seven points from their first three games of the season, and Sandro Tonali is finally available for selection again.\n13. Crystal Palace\nCrystal Palace's brilliant run at the end of last season raised fears that their best performers might have just done enough to attract transfer interest.\nThat came true to an extent, with Michael Olise departing for Bayern Munich and Joachim Andersen heading to Fulham... but Palace were able to hold onto Marc Guehi, Eberechi Eze and Jean-Phillipe Mateta and add Eddie Nketiah, Mexence Lacroix and Trevoh Chalobah on deadline day. Considering what might have been, a good window for Palace.\nDefeats to Brentford and West Ham were disappointing, but holding Chelsea to a draw at Stamford Bridge is an encouraging step in the right direction.\n12. Nottingham Forest\nIt was a transfer window, so of course Nottingham Forest were busy - and spent heavily, at that, albeit while simultaneously shifting a load of dead wood out of the squad that needed to go.\nAn undefeated start is the real positive, though, even if two of their three league games to do have been draws. Above all else, Nuno Espirito Santo has continued his drastic improvement of a previously leaky defence, enhancing Forest's prospects of earning a fourth year in the Premier League.\n11. Chelsea\nHmmmm. That's the main reaction to Chelsea this summer. Just... hmmmm.\nIt's not that they've done loads of stuff that's outright terrible, it's just that there has been a lot of What They Have Done this summer and nearly all of it has seemed a bit weird.\nWe still just honestly don't know about Chelsea. Might they end up being good? Yes. Might they spend the whole season in mid-table? Yes. Might they regret some of those high-profile departures? Yes. Might it all work out for them regardless? Yes.\nOne win, a draw and a defeat feels perfect, then.\n10. Tottenham Hotspur\nTottenham look to be in a state of flux, as they always seem to be. The age profile of the squad has been brought down, with Dominic Solanke their only non-teenage new arrival, while they've managed to get a lot of unneeded players out the door.\nAs ever, this is a club trying to play the long-term game but showing the short-term drawbacks on the pitch: they have looked very callow at times. And if we're saying it's hard to judge Ipswich for having got thrashed by City, then it's also hard to judge Spurs for having battered Everton for their only win of the campaign so far...\n9. Fulham\nFulham's list of signings feels a bit like they've got someone standing in tube stations waiting for footballers to pass by before collaring them to ask if they fancy moving to a nicer part of London. Emile Smith Rowe is the crown jewel, of course, while Joachim Andersen has proven centre-back ability.\nLosing Joao Palhinha and replacing him by handing the the eminently bang-average Sander Berge yet another expensive Premier League move feels a bit meh, though, as do their results: they've played three not-brilliant sides and only have one win to show for it. Smith Rowe really is doing a lot of heavy lifting here.\n8. Bournemouth\nThere's a bit of a feel-good factor around Bournemouth this summer, with signings made from Porto, Juventus and Barcelona and a new-look attack. Even their new goalkeeper, Kepa Arrizabalaga, has a touch of glamour about him.\nLosing Dominic Solanke and Lloyd Kelly is a blow, of course, but that incredibly late comeback win against Everton to claim their first win of the season and keep their unbeaten run going puts a happy face on a promising summer for the Cherries.\n7. Aston Villa\nAston Villa have joined Chelsea in 'is this a bit weird?' club (gearing up for a Champions League debut by signing two players from relegated clubs and another from the Championship doesn't scream 'statement of intent'), but you often get a bit of that from European football newcomers as they prepare to have to use their squad more sparingly.\nAmadou Onana has started superbly since moving from Everton, and Douglas Luiz's departure from Juventus has almost been forgotten about already as a result. Villa have won both their away games and lost a tricky game against Arsenal; so far, so good.\n6. Brentford\nIn previous seasons, Brentford have been bad without Ivan Toney, and they've been good without Ivan Toney. This summer was the time to cash in, naturally - and the early indications are they won't particularly miss him.\nAbove all else, Brentford look to have made the most of their summer break on the training pitch, with Thomas Frank's side getting back to what they do well having drifted a bit for spells last season.\nBeing Brentford, their transfer work is all sensible but unglamorous signings for what they most needed to strengthen - even their new Brazilian centre-forward, Igor Thiago, came from Belgium. Most importantly, they've beaten everyone they've played not called Liverpool, and can't realistically ask for more than that.\n5. West Ham United\nAre West Ham... exciting now? We think they might be.\nTwo midfielders from PSG, a Brazilian winger from Palmeiras, a German international centre-forward who seems destined to become a cult hero, the most devastating winger the Championship had to offer last season...it all feels very uncharacteristic.\nWe honestly still don't know what to make of Julen Lopetegui as a manager (is he any good? God knows), but hey. Moyes brought European dreams to West Ham, but the time was probably right to make the change. We're very interested to see what West Ham can do this season.\n4. Manchester City\nTransfer window wise, not a huge amount to write home about for Manchester City - but when you've won the past four league titles, that's fine, isn't it?\nCity have got good money for players who they weren't particularly reliant on, secured a sentimental return for Ilkay Gundogan, and brought in the promising Savinho. Oh...and they're top of the league with Erling Haaland back to his best. That's quite important, we reckon.\n3. Liverpool\nNo, they didn't have the transfer window they wanted, but Liverpool had already done their most significant bit of business by picking Arne Slot as Jurgen Klopp's successor.\nEarly days, but the indications so far are very positive: Liverpool just look to be very efficient and clinical so far. Getting the somewhat mercurial set players they already had performing more consistently was always the top priority; three wins from three, including a gleeful 3-0 win at Old Trafford suggests they're on the right track.\nMeanwhile, a handful of high-profile players tipped for potential exits remain at the club, and signing Federico Chiesa for less than Birmingham paid for Jay Stansfield is a gamble worth taking.\n2. Arsenal\nArsenal didn't have loads to do this summer, but you look at all of their incomings and go 'yes, I like that'. You look at their outs and go 'yes, I understand that'.\nMikel Arteta's side look well-placed to challenge for the title again, winning convincingly over Wolves and away to Aston Villa and taking the lead against Brighton before having to play most of the second half with ten men; they still got a point out of it. Good stuff.\n1. Brighton and Hove Albion\nThe football looks exciting under new boss Fabian Huerzeler. They've battered Everton away from home. They've claimed a late win over Manchester United, and they've gone away to Arsenal and taken a point.\nAlright, so Man U are the only one of Brighton's four opponents in league and cup not to have had a man sent off...but as we've come to expect from the Seagulls, their transfer work looks very savvy so far.\nImmediately losing Matt O'Riley to injury is a shame, but after spending the second half of last season in borderline relegation form, Brighton fans are buzzing again. And rightly so.\nMore Premier League stories\nEngland star to pull out of Nations League squad, in big blow to Lee Carsley\nAlan Shearer responds to calls for boxing match with Roy Keane\nQuiz! Can you name every club playing in Europe this season?\nSteven Chicken has been working as a football writer since 2009, taking in stints with Football365 and the Huddersfield Examiner. Steven still covers Huddersfield Town home and away for his own publication, WeAreTerriers.com. Steven is a two-time nominee for Regional Journalist of the Year at the prestigious British Sports Journalism Awards, making the shortlist in 2020 and 2023.",
  "word_count": 2337,
  "scraped_at": "2026-02-14T02:01:51.742757",
  "_text_extracted": true
}