{
  "article_id": "a2b3e384ca60",
  "url": "https://punchng.com/nff-build-on-osimhen-other-caf-awards/",
  "title": "NFF , build on Osimhen , other CAF awards",
  "date": "20231220T010000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NIGERIA’S uninspiring football administrators should seize the platform presented by the individual awards handed out by the Confederation of African Football to three Nigerians in the 2023 ceremonies to resuscitate football in the country. After decades of being second best, Nigeria dominated this time as Victor Osimhen, the Napoli of Italy striker, grabbed the Men’s African Player of the Year award. Asisat Oshoala, Chiamaka Nnadozie and the Super Falcons also took home the prizes for the best in different categories during the spectacle in Marrakech, Morocco. These honours remind fans of the rich potential of Nigerian football. If built upon, they could catalyse a new era.\nIn a team sport that weaves success around individual mettle, the gong given to Osimhen underscores his brilliance. In the 2022/23 Italian season, he conquered the scoring chart with 26 goals, leading Napoli to their first championship in 33 years. That feat earned him the POTY award, the first time a Nigerian had won it after Nwankwo Kanu’s in 1999.\nThe women footballers also excelled. Oshoala, who won the UEFA Champions League with Barcelona of Spain, received the women’s POTY crown. Remarkably, it is the sixth time for Oshoala, who has been a brilliant spark for the Super Falcons.\nCAF judges named Nnadozie of Paris FC as the Best Goalkeeper of the Year. That goes along with crowning Nigeria’s national female team the best in Africa. The Falcons qualified from a difficult group in the 2023 FIFA Women’s World Cup, stunning hosts Australia 3-2 in the round robin. They lost to England in the round of 16, 4-2 on penalties. This performance rekindled the flame of excellence for the record African champions.\nWith these exciting awards, it is tempting to assume that Nigerian football is back to its halcyon era. Not so fast. Individual awards can only be beneficial when the Nigeria Football Federation puts its house in order.\nFor long, there had been copious signs of decline interspersed with a few moments in the sun. Mostly, the men’s national team – the Super Eagles – have stagnated after the 2013 African Cup of Nations triumph.\nAlthough the Eagles qualified for the FIFA World Cup in 2010, 2014 and 2018, they only qualified for the second round in Brazil. They placed bottom in 2010 in South Africa and third in the group stage in Russia. Worse, they did not qualify to the Qatar 2022 Finals. Uninspiringly, they have already drawn their first two matches in qualification for the 2026 Finals.\nThese days, the country’s age-grade teams struggle to qualify for FIFA tournaments. The clubs are nowhere near the best in continental football. In addition, Eagles players are few in the ranks of the biggest clubs in Europe. Languishing in average teams, they find it difficult to translate their forms to the national team. The Falcons’ pre-eminence status as the best team in Africa is being threatened by Equatorial Guinea, Morocco, and South Africa.\nFor the best impact from these awards, football administrators, the federal and state governments must be intentional about the development of the sport. The first point rests in deepening professionalism in the domestic league. England struggled to qualify for the World Cup but after repackaging its championship in 1991, the Three Lions have consistently graced major tournaments. Nigeria needs a virile domestic championship to produce talents.\nThe NFF should be responsible and have top-notch organisation ethos. It hires coaches and fails to pay them. It owes footballers bonuses. These are disincentives.\nGovernment at all tiers should invest massively in sports infrastructure, unlike now when the Eagles and the Falcons struggle for the venue to play their home games.",
  "word_count": 607,
  "scraped_at": "2026-02-14T02:10:33.594026",
  "_text_extracted": true
}