{
  "article_id": "a2dd22e13628",
  "url": "https://www.caughtoffside.com/2025/07/27/man-united-in-the-race-gianluigi-donnarumma/",
  "title": "Manchester United handed boost in pursuit of Gianluigi Donnarumma",
  "date": "20250727T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are looking to sign the PSG goalkeeper Gianluigi Donnarumma, and the French outfit have already secured his replacement.\nAccording to a report from L’Equipe, Manchester United and Manchester City are in the race to sign the 26-year-old goalkeeper. He has been a world-class player for the French outfit, and he helped them win the league title and the UEFA Champions League with outstanding performances last season.\nDonnarumma has been labelled as “extraordinary” by Khvicha Kvaratskhelia.\nMan United need Gianluigi Donnarumma\nManchester United are hoping to bring him in as an alternative to Andre Onana, who has been quite underwhelming. They have been handed a major boost in their pursuit of the Italian. PSG have agreed on personal terms with Lucas Chevalier, according to Fabrizio Romano. It certainly suggests that they are preparing for the departure of the Italian international.\nIt remains to be seen whether Manchester United can win the race for his signature.\nMan City keen on Donnarumma\nManchester City could use a player to replace Ederson Moraes, and the Italian would be ideal. Both clubs have the financial muscle to get the deal done. However, Manchester City could be a more attractive destination for the player. They will be able to offer him Champions League football next season and the platform to fight for trophies regularly.\nManchester United are going through a period of rebuilding, and they will not be able to offer him European football next season either. It will be interesting to see what the player decides.\nThe 26-year-old is at the peak of his career, and he will look to compete at the highest level. He will be hoping to join an elite club this summer. Whoever ends up signing the world-class Italian will have a tremendous asset on their hands.",
  "word_count": 298,
  "scraped_at": "2026-02-14T01:49:44.673239",
  "_text_extracted": true
}