{
  "article_id": "a2ee46979e8e",
  "url": "https://www.lbc.co.uk/article/enzo-maresca-cheslea-resigns-sacked-5HjdQ5w_2/",
  "title": "Chelsea part ways with head coach Enzo Maresca as favourite to replace Italian emerges",
  "date": "20260101T153000Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea head coach Enzo Maresca leaves club as favourite to replace Italian emerges\nChelsea manager Enzo Maresca has parted ways with the club after a series of poor results.\nListen to this article\nThe west London side have won just one of their last seven Premier League matches and sit 15 points off leaders Arsenal.\nFollowing their recent home draw with Bournemouth, Meresca claimed he was too unwell to speak to the press, a claim club sources allege is false.\nThe Italian held crisis talks with the club’s hierarchy today after reports emerged he could resign.\nRead more: Enzo Maresca dodges questions on claims he had endured his 'worst 48 hours' as Chelsea manager\nA Chelsea statement read: \"Chelsea Football Club and Head Coach Enzo Maresca have parted company.\n\"During his time at the Club, Enzo led the team to success in the UEFA Conference League and the FIFA Club World Cup.\n\"Those achievements will remain an important part of the Club’s recent history, and we thank him for his contributions to the Club.\n\"With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the Club believe a change gives the team the best chance of getting the season back on track.\n\"We wish Enzo well for the future.\"\nDespite recent poor results, Maresca has won two trophies during his time at Chelsea and helped stabilise the club after a chaotic period in the wake of Roman Abramovich’s departure.\nThe Blues are in a Carabao Cup semi-final and are currently 13th in the Champions League league phase.\nThe Italian’s relationship with the club’s hierarchy first began to collapse after he made a series of cryptic comments following Chelsea’s victory against Everton - calling the following 48 hours the “worst of his career.”\nIn the hours that followed, Maresca was linked to a move to Manchester City should Pep Guardiola leave in the summer.\nMaresca worked under Guardiola at City and shares a similar playing style.\nSince Todd Bohley and Clearlake Capital took over Chelsea, the club has had four separate managers - Thomas Tuchel, Graham Potter, Mauricio Pochettino and now Maresca.\nChelsea return to action on Sunday away to Manchester City, the first of nine fixtures across four competitions during a packed January schedule.\nLiam Rosenior, the head coach of French club Strasbourg, who are owned by Chelsea’s parent company BlueCo, has emerged as the early favourite to replace Maresca among bookmakers.\nFormer Barcelona head coach Xavi, Crystal Palace manager Oliver Glasner, Fulham’s Marco Silva and Bournemouth boss Andoni Iraola are other potential candidates.",
  "word_count": 432,
  "scraped_at": "2026-02-14T02:09:38.443321",
  "_text_extracted": true
}