{
  "article_id": "a3144ea20e3c",
  "url": "https://thepeoplesperson.com/2025/01/01/global-investment-bank-issues-extremely-positive-man-united-forecast-despite-ineos-rocky-start-289181/",
  "title": "Global investment bank issues extremely positive Man United forecast despite INEO rocky start - Man United News And Transfer News",
  "date": "20250101T234500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Global investment bankers UBS have forecasted an extremely positive turnaround for Manchester United, despite INEOS’ rough start to life at the club.\nIn February 2024, Sir Jim Ratcliffe completed his partial investment in the club, becoming a minority owner.\nHowever, his tenure so far has been nothing short of a disaster. United have faced a series of setbacks, including the redundancy of approximately 250 staff members and numerous cost-cutting measures, some of which have led to public embarrassment.\nPerformances on the pitch have also left a lot to be desired. Last season, United finished in eighth place, although there was some joy at the end of the campaign courtesy of winning the FA Cup.\nThis term is proving to be even more challenging, with the Red Devils currently in 14th position and just seven points above the relegation zone. After a summer spending spree in excess of £200m, new head coach Ruben Amorim has very little to spend in the just-opened January transfer window.\nNevertheless, investment bankers UBS have predicted that things will drastically improve over the next few years.\nIn an analysis [detailed by The Daily Mail], UBS say the arrival of Ratcliffe and INEOS following their 29 per cent acquisition “should (eventually)” see United return to the apex of English football.\nThe detailed 41-page analysis expresses unexpected optimism about the club’s future performance and financial stability.\nUBS predict that Amorim’s side will break back into the top four within four seasons while raking in revenues that should exceed the £1 billion mark.\nThey are of the opinion that United’s share price is currently undervalued and are even recommending that potential investors should buy now.\nOn Ratcliffe’s ruthless job cuts across various departments, UBS insist that the “new management and focus on cost management should support investment to improve sporting performance as well as a return to net profitability.”\nUBS’ analysis further notes, “Amid continued interest in sports teams and leagues from private equity and wealthy individuals seeing trophy assets, we see the valuation of Manchester United as well underpinned.”\n“This is by no means a foregone conclusion given the recent poor performance. But the new manager provides a potential turning point for change, albeit one which may take time to materialise.”\n“While we see no silver bullet to immediately reverse a decline in on-field performance, the shift in corporate management, coaching staff, and the greater focus on cost control, as evidenced by the rationalisation of employee numbers, are indicative of a change in mindset with a view to improving sporting and financial performance.”\n“Increased investment, a drive for redevelopment of the ageing stadium, and potential benefits from multi-club ownership could all drive upside.”\nThe analysts explain that United’s revenue base is “superior to most peers” and this provides an “ability to spend more on talent.”\n“We assume performance will turn around leading to a Champions League participation from 2028.”\nIn further uplifting news for the beleaguered Premier League giants, the Reds are dubbed as having “too much revenue generation to stay average for long.” United’s record revenues even in one of its worst-ever sporting periods are seen as a “demonstration of its loyal fan base and commercial appeal.”\n“Indeed it is this high revenue base with no direct link to on-field performance that supports our view that the team will continue to remain competitive, especially in light of an increasing focus on financial fair play.”\nLooking ahead, UBS projects that United will finish this season in seventh place, missing out on European qualification. However, they anticipate fifth-place finishes over the following two seasons, paving the way for a top-four return and a resurgence in the Champions League by the 2027/28 season.\nAmorim and his players are back in action on Sunday when they make their way to Anfield to face table leaders Liverpool.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 640,
  "scraped_at": "2026-02-14T01:58:00.736716",
  "_text_extracted": true
}