{
  "article_id": "a34dd8d78565",
  "url": "https://www.90min.com/features/liverpool-banish-regrets-jude-bellingham-transfer-failure-dominant-victory-real-madrid",
  "title": "Liverpool banish regrets over Jude Bellingham transfer failure with dominant victory over Real Madrid",
  "date": "20241128T193000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool banish regrets over Jude Bellingham transfer failure with dominant victory over Real Madrid\n- Liverpool faced Bellingham 18 months after missing out on his signature\n- Reds had last laugh with 2-0 win over Real Madrid\n- Decision to change transfer strategy ultimately justified\nBy David Lynch\nAppearing at a press conference to preview Real Madrid’s visit to Anfield this week, Jude Bellingham casually shot down suggestions that Liverpool had ever had the chance to withdraw from the chase for his signature.\nIt was in April of last year that the Reds briefed they were no longer pursuing a player they had been known to hold an interest in since his time at Birmingham City as he prepared to depart Borussia Dortmund.\nAnd the logic went that, amid a woeful 2022/23 season that ended in only Europa League football being secured, a midfield rebuild greater than the addition of a solitary player was required.\nInterestingly, when speaking on Tuesday, Bellingham explained that Liverpool would actually have had little say in the matter given he would never have turned down the lure of the Santiago Bernabeu.\nBut, after Arne Slot’s men moved top of the Champions League in finally getting one over on the Spaniards on Wednesday evening, it was hard not to feel that the events of last summer had ultimately worked in their favour.\nClearly, the same is also true for Madrid, who were led to a league and European Cup double last season by the brilliant Bellingham. But for Liverpool, it is quite apparent that signing him would not have brought them from the lows of just over a year ago to this point - being arguably the best side in Europe right now.\nAnd they proved as much in dominating Madrid thanks to a midfield unit that had been constructed in direct response to Bellingham's snub.\nOf course, as an academy graduate, the impressive Curtis Jones represented an exception. But the young Scouser was given the platform to shine by the brilliant duo of Alexis Mac Allister and Ryan Gravenberch, who both arrived in 2023.\nIt was already evident after a fine debut season, but Mac Allister’s £35m price tag is looking even more ludicrous as he continues to improve in a tactical setup that better suits his strengths. That his signing was Julian Ward’s last act as Liverpool sporting director prior to his shock departure tells you exactly why Fenway Sports Group were so keen to get him straight back in the fold as part of this summer’s backroom reshuffle.\nAnd what of Gravenberch, the player recruitment staff privately heralded as a rare talent they ranked alongside Bellingham prior to an up-and-down first campaign at Anfield?\nWith each passing week, that judgement is looking more and more prescient, and Bellingham himself would no doubt back it up after being eaten up by the Dutchman on numerous occasions on Wednesday.\nDominik Szoboszlai, meanwhile, may only have appeared as a late substitute in this one, but he has been fundamental to Liverpool's strong start in both the Premier League and Champions League this season.\nIt is the Reds' position atop both those standings - built on the success of the midfield alternatives they secured - that surely means there can't be many supporters left bemoaning the failure to capture Bellingham.\nAnd if any regrets did remain going into last night’s game, then they were emphatically answered by the Englishman being swept up in a midfield masterclass from Liverpool.",
  "word_count": 581,
  "scraped_at": "2026-02-14T02:26:24.520482",
  "_text_extracted": true
}