{
  "article_id": "a392e082d1c5",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-respond-marcus-rashford-tries-force-dream-transfer-through",
  "title": "Marcus Rashford : Man Utd respond after star tries to  force  dream transfer",
  "date": "20250518T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd respond after Rashford tries to ‘force’ dream transfer through\nMarcus Rashford is willing to take a substantial pay cut to help ‘force’ through his dream transfer, and a report has revealed Manchester United’s response to the proposed deal.\nRashford’s dazzling return to form during his loan spell with Aston Villa was curtailed by a hamstring injury. The forward had notched four goals and six assists in 17 appearances and his electric displays had even seen Unai Emery select Rashford ahead of Ollie Watkins on several occasions.\nVilla hold an option to buy worth £40m, though are yet to make a final call on whether to trigger the clause. Whether Villa qualify for the Champions League will have a major say in their decision.\nEven if Villa do activate the option, they must still agree personal terms with the player. TEAMtalk has consistently reported that might not be straightforward, with Rashford dreaming of a new chapter in Spain with LaLiga champions Barcelona.\nFabrizio Romano has confirmed Barcelona are interested in signing Rashford in the upcoming summer window. They previously explored loan opportunities for Rashford in January, though they could not make the finances work.\nAccording to two separate reports from SPORT and Mundo Deportivo, Rashford is still prioritising a Barcelona transfer.\nHansi Flick’s side are confirmed to be weighing up a move, though the type of deal they’d put on the table isn’t pleasing Man Utd.\nThe Red Devils have earmarked Rashford for a permanent sale. As a homegrown player, the proceeds from his exit will be logged as ‘pure profit’ on the books and greatly enhance United’s spending power ahead of a pivotal summer window.\nBoth Spanish reports claimed Barcelona have drafted a one-year loan deal for Rashford that would contain a mechanism to turn the deal permanent at the end of the 2025/26 season.\nAs you might expect, that structure of the deal is ‘not being considered’ by Man Utd, according to SPORT.\nNonetheless, Rashford is reportedly trying to ‘force’ through a move and is even willing to accept a significant wage decrease to make it happen.\nRashford currently pockets around £325,000-a-week and it’s claimed his willingness to take a pay-cut applies to Barcelona only.\nAs such, Villa would be asked to match his giant salary if activating their option. At £325,000-a-week, Rashford would become the highest paid player in Villa’s history and per SPORT, the club’s current stance is they are NOT willing to meet those demands.\nA permanent move to Villa Park thus looks increasingly difficult to make despite the presence of the option.\nWhether Rashford can secure his dream move to Barcelona will then depend on one of two things – Man Utd accepting another loan or Barcelona biting the bullet and tabling a permanent proposal.\nUnited will demand £40m if selling on the open market.\nLatest Man Utd news – Amorim to resign?\nIn other news, The Sun state there are growing fears within Man Utd that Ruben Amorim could decide enough is enough and resign.\nSir Jim Ratcliffe is currently seeking assurances from the Portuguese over his future. Amorim is heavily involved in the club’s planning for the summer window, but his influence on incomings and outgoings will diminish if he doesn’t inform Ratcliffe and co he’s fully committed and sticking around.\nInterestingly, the report insisted Amorim could choose to walk away even if Man Utd beat Tottenham in the Europa League final.\nElsewhere, Man Utd will NOT activate their option to buy Alvaro Carreras back from Benfica. The left-back is now giving full priority to signing with another of world football’s biggest clubs.\nFinally, a Sporting CP ace is understood to be keen on joining Amorim at Old Trafford, assuming Amorim doesn’t resign, of course.",
  "word_count": 630,
  "scraped_at": "2026-02-14T01:49:39.550401",
  "_text_extracted": true
}