{
  "article_id": "a3a553916c15",
  "url": "https://www.90min.com/mikel-arteta-man-utd-warning-arsenal-record-breaking-champions-league-win",
  "title": "Mikel Arteta sends Man Utd warning after Arsenal record - breaking Champions League win",
  "date": "20250305T103000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta sends Man Utd warning after Arsenal's record-breaking Champions League win\n- Arsenal romped to a 7-1 win on Tuesday\n- The Gunners toppled multiple records in the one-sided victory\n- Mikel Arteta shifted focus to Sunday's league meeting with Man Utd\nArsenal manager Mikel Arteta quickly shifted his focus towards Sunday's Premier League meeting with Manchester United after watching his side dismantle PSV Eindhoven on Tuesday night.\nThe Gunners had not scored in their previous two consecutive matches yet found the net seven times in Eindhoven, recording the club's largest-ever away victory in the Champions League. Noah Lang scored a penalty for the lacklustre hosts, yet the 7-1 scoreline still represents the joint-heaviest defeat in PSV's 112-year history.\n\"It was a special night,\" Arteta gushed. \"It's obviously given us a lot of joy and confidence and belief. In football, it's not what we did three days ago or today, it's going to be what we do tomorrow.\"\nThe north London outfit travel to Manchester United on Sunday and Arteta was keen to replicate Arsenal's energetic performance in this historic Premier League rivalry.\n\"We go to Old Trafford,\" the Spanish boss warned, \"how we behave, how we play and are we able to win a game. That's it, enjoy tonight because it was a very impressive performance and an unbelievable score. We deserve that and I'll take it and keep improving as a team.\"\nArsenal became the first away team in Champions League history to score as many as seven goals in the knockout stages of the competition. \"It's something that hasn't been done, so it's great to be part of that,\" Arteta briefly noted before shifting his focus to the club's real goal; titles. \"But as a team we want to achieve many other things that are far more important than that. The happiest I am is because we are in a very strong position to go to the next round, which is where we want to be.\"\nArteta lined up without a recognised striker for the fourth game in a row, having previously defeated Leicester City before losing to West Ham United and duking out a tepid goalless stalemate with Nottingham Forest last week. The Arsenal boss was keen to point out the unpredictability of Tuesday's result.\n\"That's the beauty of it,\" Arteta told his post-match press conference, \"nobody in this room, if I give you an envelope and say, 'can you predict what's going to happen tomorrow and who is going to score,' [nobody would say 7-1] that's the beauty of football.\"",
  "word_count": 426,
  "scraped_at": "2026-02-14T02:18:17.729052",
  "_text_extracted": true
}