{
  "article_id": "a3bee6aad7cc",
  "url": "https://www.the42.ie/tedesco-belgium-5990030-Feb2023/",
  "title": "Former Leipzig boss Tedesco named Belgium national football coach",
  "date": "20230208T151500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "DOMENICO TEDESCO WILL take over as head coach of Belgium, the country’s federation announced (RBFA) on Wednesday.\nThe 37-year-old Italy-born Tedesco succeeds Roberto Martinez, who stepped down after Belgium failed to qualify for the knockout stages at the World Cup in Qatar.\n“His mission is to qualify the Belgian Red Devils for the Euro 2024 in Germany. The first qualifying match will be played on 24 March in Stockholm against Sweden,” the RBFA said.\nTedesco, who has coached Schalke, Spartak Moscow and RB Leipzig, will be presented to the press later on Wednesday.\n“For me it is a great honour to be the new head coach of Belgium. I’m really looking forward to the task and I’m extremely motivated. I had a very good feeling right from the first conversation,” Tedesco said on the RBFA website.\nThe appointment had been expected since late January. The delay led to suspicion that Tedesco was considering the vacant Hoffenheim job. Barely 15 minutes after the RBFA announcement, the Bundesliga club tweeted they had hired Pellegrino Matarazzo.\nSpaniard Martinez left the Red Devils after a disappointing elimination in the group stage of the World Cup in Qatar, likely to mark the end of the country’s “golden generation” of players.\nThe closest to a title a Belgium squad containing Kevin De Bruyne, Romelu Lukaku, Thibaut Courtois, Jan Vertonghen and Eden Hazard, among others, came under Martinez was third place at the 2018 World Cup. Hazard announced his international retirement after the World Cup.\nMartinez was appointed Portugal coach on 9 January.\nBelgium were linked with an impressive list of potential candidates, including former assistant Thierry Henry, who the players reportedly supported but who did not apply.\nTedesco does not match the criteria laid out by the RBFA in an advertisement on their web site in December when they said they were seeking a coach with “the necessary international experience at top level” who was a “serial winner”.\nFormer Belgium, and Schalke, coach Marc Wilmots was less than impressed when Tedesco was first linked with the job.\n“He is a coach/computer. You have a suit and a laptop and it worked well. He finished second in the championship with Schalke, which is quite remarkable,” Wilmots told Belgian television at the end of January.\n“Be careful, he is a club coach. National teams are not the same thing. He won’t have time to prepare his matches as he does at the club.”\nTedesco was born in Calabria and arrived in Germany at the age of two.\nHe speaks Italian, German, Russian, English, French and Spanish and has a degree in industrial engineering.\nHe graduated top of the coaching class, ahead of Bayern coach Julian Nagelsmann, from the Hennes Weisweiler Academy, until last year the German football association’s central training facility.\nHis first head coaching appointment was at Erzgebirge Aue in 2017 and saved the club from relegation from Bundesliga 2 and moved up a division to Schalke.\nHe led the club to second in the Bundesliga in 2018 but was sacked in March 2019 after a 7-0 loss at Manchester City, and 10-2 on aggregate, in the Champions League round of 16, and with the club on a seven-match losing run.\nHe joined Spartak in October 2019 and led the club to a second-place finish in the Russian Premier League in 2021 but then opted to leave the club.\nHe took over at RB Leipzig, winning the German Cup last season, before being fired after a dismal start to the current campaign.\nTedesco will be supported by the former Belgium midfielder Franky Vercauteren, who was appointed director of football.\nThe42 is on Instagram! Tap the button below on your phone to follow us!",
  "word_count": 616,
  "scraped_at": "2026-02-14T02:16:35.968889",
  "_text_extracted": true
}