{
  "article_id": "a3d663716ec5",
  "url": "https://www.arsenal.com/news/every-word-jonas-pre-leicester-presser",
  "title": "Every word of Jona pre - Leicester presser | Press conference | News",
  "date": "20231110T171500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ahead of our Barclays Women's Super League game against Leicester City at King Power Stadium on Sunday, Jonas Eidevall held his pre-match press conference.\nAt London Colney, he was asked about Sunday's game, the return of Beth Mead and Vivianne Miedema, and more.\nHere's what he had to say on the following subjects...\non if he has received an apology from Gareth Taylor:\nNo.\non if he’s surprised by that:\nIt doesn’t take a lot of my thought process at the moment.\non the responsibility to respect the guidelines:\nI think you have a huge responsibility as a manager with how you act and what you say.\non if that’s the same in press conferences:\nAbsolutely.\non if there’s anything else to say on it:\nNot really, I felt I have said what I want regarding the subject and now I focus on the Leicester game.\non if he feels the way he behaves on the touchline is correct:\nAbsolutely.\non FA Cup prize money being increased:\nIt is good. Is it good enough? You have to zoom out and see what is the increase in the NWSL’s broadcast deal that got announced yesterday. The growth of the game is exponential - that’s where decision makers and deal makers need to be very aware. At the end of the day there’s going to be an increase in prize money - absolutely the growth of the game is tremendous at the moment but you still have a very big gap between the men's and the women's. There’s also a symbolic factor for it with the FA that is responsible for the growth and development of women's football in the country. If they start to have a big difference on it then of course that effects how people see and value the two different competitions as well. It’s a good increase but I’m not sure if it’s good enough.\non it still being less than a quarter for winning it compared to what the men get:\nWe need a plan for it or a trajectory - someone who has a plan to say where do we see this going in the next five years? Or is this something that is going to be on a year by year basis?\non if it will be more newsworthy when it’s equal:\nAnd then what is that going to be based on and what investments are going to be made in the Women's FA Cup, in order to raise the level of the competition to the point where it can generate more revenue?\non four teams in the WSL being on 10 points and if he expected it to be so tight:\nIt is early in the season, teams have played very uneven home and away and different opposition - but lets play more games and let the league table settle a little bit more before we start jumping towards early conclusions.\non Leicester City this season:\nThe way that they have recruited and the way that they have played since January last year, they are competing in every game and are a really hard team to play. They obviously play with a really high pace, high intensity, pressing football and now the manager has had two transfer windows he has been able to bring in players who fit into that style and I think you can see that more and more as well. We can definitely expect a really competitive game. Leicester’s development and their investment in their squad absolutely shows the development and the growth of the league as well.\non Willie Kirk winning Manager of the Month:\nAbsolutely I think Willie Kirk is a top manager who has done a really good job with Leicester. Both in the way he recruits players but also getting his group of players playing really well - he has played a massive part in making them a really competitive side.\non if there is added pressure on Sunday’s game due to us being within reach of Leicester:\nNo. Every time we step onto the pitch we want to do our best to win and like I said before, the league table is not going to be decided after six rounds. We need to treat it on a game by game basis.\non what needs to change to improve performances this season:\nI think the last seven games we haven’t been able to keep a clean sheet. If you look back over the last two seasons, we’ve been very good with keeping clean sheets and we’re constantly looking for ways to improve that. The reality of it is the number of chances that we concede in the games is probably the lowest in the league. We have the lowest conceded expected goals in the league compared to all teams but we definitely don’t have the lowest number of conceded goals, which is a problem. Sometimes that’s how football is that things don’t get distributed evenly, but they’re also things that we allow, big chances that we need to correct in our defending. When it comes to our offence and attacking play, I think we have come from a game against Liverpool, where we didn’t create enough, to come into games from Man United and onwards where we have created more and more in the games. We probably lacked a little bit of efficiency. We got that back against Manchester City and I think from a creation perspective when we played against Bristol in the Conti Cup yesterday, that was also good, so I think that’s something that we are continually improving upon.\non Lotte’s development this year:\nIt’s really important for us in order to have performances on a high level, that a player like Lotte is performing well. I think she comes to an age and with an experience where she is definitely ready to take her next step in her career. That’s what I think the start of this season has shown us, that she has the potential to do that. I spoke after the game yesterday, for Lotte it’s really about bringing both her leadership qualities but also her footballing qualities on the pitch and really working with that in a holistic way. As a person she thrives off responsibility, leading, and is an exceptional person and leader. When we get that across on the football pitch, I think it’s just going to improve her game even more.\non Stina stepping up when she gets opportunities:\nIt’s super important. It’s both the benefit but also sometimes the problem when you have a bigger squad with a lot of competition, that sometimes you might be better off in the finishing 11 than you are in the starting 11. Sometimes you might not get the chance even if you’re performing well because I think another player would benefit the team better at that moment, but you take Stina as a good example, but Kathrine Kühl and Kyra Cooney-Cross also as good examples, how they played in the Conti Cup yesterday but haven’t played so much for us in the beginning of the season but they’ve trained well. That means that now when they get the opportunity, they are also well prepared for taking that. That is so important and if that’s the culture that we can have in the team, that’s going to be really important for us across the season.\non if we’re starting to settle into the season a bit more:\nI don’t know if I said that something is going to settle down. I’m a very big believer that you play one game at a time and after all games you see where you finish in the league table. In regards to our development, I think I’ve been very clear from the beginning this season that time has not been a friend of ours. Going into the Champions League qualifiers and then coming into the first game of Liverpool, I spoke about how limited the number of training sessions had been where we had been able to work with the whole squad. I see as a team that we’re going to develop during the season. We’re far from a finished product and if we use the time in the right way we’re definitely going to be able to develop and grow and that’s what I think you can see from this Arsenal side because the players have been training very well, applying themselves and we go from game to game and learn new things. We develop together. Do we have room for more development? Absolutely.\non the returns of Beth and Viv:\nI’m really bad at celebrating anything on the football side. I think there’s a quote from a Brazilian volleyball coach that, when the players are out celebrating the victory in the evening, I go back to my room and worry about the next fixture. I think it sums up my life pretty much! I’m really pleased for the hard work that both those two players have been doing and that they now can start to be back on the pitch and doing what they love the most, but for my mindset, I very seldom stop and celebrate anything. I’m 100 percent focused on Leicester now and I want us to perform as well as possible as a team. Maybe that’s a part of my own personal development where I need to improve.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1598,
  "scraped_at": "2026-02-14T02:25:08.304422",
  "_text_extracted": true
}