{
  "article_id": "a3ddc0a3464f",
  "url": "http://thepeninsulaqatar.com/article/29/04/2025/feisty-arteta-urges-arsenal-fans-to-bring-boots-to-psg-champions-league-clash",
  "title": "Feisty Arteta urges Arsenal fans to  bring boot to PSG Champions League clash",
  "date": "20250429T020000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nArsenal's Spanish manager Mikel Arteta speaks during a press conference at the Emirates Stadium in London, on April 28, 2025, on the eve of their UEFA Champions League semi-final first leg football match against Paris Saint-Germain (PSG). (Photo by Franck Fife / AFP)\nLondon: Mikel Arteta has urged Arsenal fans to \"bring your boots\" and kick every ball as the Gunners prepare to take on Paris Saint-Germain with a place in the Champions League final at stake.\nThe Gunners, who have never been crowned European champions, demolished holders Real Madrid 5-1 on aggregate in the last eight to reach their first semi-final for 16 years.\nArsenal manager Arteta was in a bullish mood on the eve of the first leg against the French champions at the Emirates.\n\"I'm not exaggerating when I said, 'Guys, bring your boots, bring your shorts, bring your T-shirts and let's play every ball together,\" said the Spaniard.\n\"We want to do something special, that place has to be something special, something that we haven't seen.\n\"And I really hope that everybody that comes tomorrow to the Emirates and everybody that is watching and following us, brings that energy with them.\"\nArteta urged his men to \"make the next step\".\n\"Go there with that conviction and feel the conviction around it, I think it's key,\" he said.\n\"If we are able to generate that energy we're going to be much closer to winning the game.\"\nArteta, whose team appear likely to finish second in the Premier League for the third straight season, said it was vital to enjoy the moment despite the pressure.\n\"We are so fortunate to be in the position that we are,\" he said. \"We earn it with our work, with our enthusiasm, because we faced a lot of challenges.\n\"And we managed to compete at a high level for 10 months. So we earn it now. Be present and live the moment. A beautiful moment that we can enjoy.\"\nBut he downplayed suggestions that the Gunners are favourites to win the competition after dispatching 15-time winners Madrid.\n\"When you look at the history, we go back to the history, no, because we've never done it,\" he said.\n\"So there is so much to do. Hopefully, if somebody believes we can do it, it's because of the performances and what the team is transmitting against the big opposition. If that's the case, OK.\"\nMikel Merino handed Arteta a major injury boost when he took part in training on Tuesday.\nIf fit, the Spain international could revert to midfield with Thomas Partey suspended. Leandro Trossard may instead lead Arsenal's attack with Bukayo Saka and Gabriel Martinelli on either flank.\nMartinelli said the match would be the biggest of his life. \"It is a dream to be here,\" he said. \"Since I started to play football when I was five or six, I had this dream to be playing in the Champions League and to be in a semi-final, it is amazing.\n'\"It is the opportunity of our lives. We are going to enjoy the moment, but we deserve to be here and our mentality is to win.\"\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 591,
  "scraped_at": "2026-02-14T02:09:01.852877",
  "_text_extracted": true
}