{
  "article_id": "a406a3ba0a51",
  "url": "https://www.bbc.com/sport/football/articles/c74j4z10w97o",
  "title": "Man City hearing : Premier League 115 charges case to begin on Monday",
  "date": "20240912T203000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Sport's trial of the century to begin': Premier League v Man City on 115 charges\n- Published\nFinally, after years of build-up, perhaps English football's biggest and most controversial contest is set to begin.\nOn one side, the Premier League. On the other, its defending champions and dominant force Manchester City.\nCity face 115 charges for allegedly breaking the financial rules of the competition they have won for a record-breaking four consecutive seasons.\nThose charges will be heard at an independent hearing, which is set to start on Monday at an unknown location, subject to any late legal delays. Billed as sport's 'trial of the century', it is expected to run for 10 weeks, with a verdict expected in early 2025.\nIt marks a defining stage in a legal dispute the like of which the game has never seen and which could bring seismic consequences for both sides.\nThis, after all, involves one of the world's most successful clubs being accused of serial cheating by the very league it has dominated for years. A club at the centre of a global network of 13 teams across five continents, owned by a billionaire member of Abu Dhabi's ruling family, whose sovereign wealth has transformed the landscape of the sport.\nThe case involves an unprecedented catalogue of 115 allegations spread over 14 seasons, including multiple charges of subverting the regulations by failing to provide accurate financial information.\nCity have always strongly denied the charges, and while the speculation is intensifying, no-one knows what the outcome - expected early next year - will be.\nIf found guilty of the most serious charges, City would risk being forever associated with one of the biggest financial scandals in sport. City could, in theory, face a points deduction serious enough to condemn them to relegation - or even expulsion - from the Premier League.\nSuch a fate would cast a long shadow over City's achievements, plunge the future of the manager and squad into uncertainty, and possibly spark claims for compensation from other clubs. It has been suggested that such a stain on the reputation of City and the club's owners could even affect Britain's relationship with the United Arab Emirates (UAE), a key Gulf ally and trading partner - whose president is the brother of the club’s majority owner Sheikh Mansour.\nEqually, if City are cleared following a legal battle that is already thought to have cost both sides tens of millions of pounds, major questions will be asked of the Premier League.\nBut whatever verdict is reached after a hearing set to last several weeks, the impact could be profound, dictating the story of this season.\n'It is time now' for case six years in the making\nIt is difficult to overstate the seriousness and scale of a saga threatening to exacerbate widening divisions in the game, and which has become a test case for the Premier League’s authority and credibility at a time when it already faces an array of challenges.\nLast month, at a London launch event celebrating the start of the new season, but dominated by questions over financial regulations, the Premier League's chief executive Richard Masters told BBC Sport that \"it is time now\" for the City case to be resolved.\nChoosing his words carefully, but perhaps hinting at the toll the case has already taken and the turmoil it has unleashed, he added: \"It's been going on for a number of years and I think it's self-evident that the case needs to be heard and answered.\"\nSo 10 years after City were first punished by Uefa for breaching its financial rules, six years after the Premier League opened an investigation into the club, and 20 months since they were charged, how did we finally get here? What exactly does the club stand accused of? What forces are at play? And what is at stake?\nBackground - how did we get here?\nIn June this year, a Portuguese computer hacker in witness protection called Rui Pinto was reported to have told a conference that he was in possession of \"millions of documents\" that could be relevant to the City case.\nPinto was well known to the game's authorities. The 34-year-old was the man behind the Football Leaks website which has exposed confidential football transfer and contract information.\nDespite always claiming he was a whistleblower, last year he was handed a four-year suspended sentence by a court in Lisbon after it found him guilty on counts of attempted extortion, illegal access to data, and breach of correspondence. But his threat to release more information - confirmed by his lawyer - was a timely reminder of the continuing role of one of the key figures in this remarkable story.\nBack in 2018, the German publication Der Spiegel claimed City had manipulated contracts to get round Uefa rules, and said that its source was a whistleblower they called 'John' - the pseudonym Pinto created Football Leaks under.\nDer Spiegel had published leaked documents, including emails purportedly sent between top City executives (some of whom remain at the City Football Group), across several seasons following the club's Abu Dhabi takeover in 2008.\nThey alleged that these showed the club had inflated sponsorship revenue from state-owned airline Etihad and state-controlled telecoms firm Etisalat by disguising direct investment from its holding company (Mansour’s Abu Dhabi United Group, or ADUG) as sponsorship income by channelling the funds through the companies' accounts.\nThis, it was alleged, was a means of meeting 'financial fair play' (FFP) rules introduced by Uefa in 2011, and Profit and Sustainability Rules (PSR) brought in by the Premier League in 2012, limiting clubs' permitted losses.\nThere then followed further allegations of misreporting financial information centred on documents that claimed to show secret 'off-the-books' payments to then-manager Roberto Mancini via consultancy fees from a club in Abu Dhabi, and giving players more money than was officially going through the accounts so that recorded spending was less than it actually was.\nCity - who have always maintained that ADUG is a private fund rather than an arm of the state - refused to comment on any of Der Spiegel’s revelations, saying the leaked emails were obtained illegally, and that they were an “attempt to damage the club’s reputation”.\nCity - along with the companies involved - strongly denied breaking any financial rules. But that did not stop both Uefa and the Premier League launching investigations as a result.\nCity had already been fined millions of pounds by Uefa back in 2014 as part of a settlement after they were found to have breached FFP rules that were meant to make the game more sustainable, but which critics argue protect the historically biggest clubs by restricting investment by rivals, especially those with Middle Eastern backers.\nThen, in early 2020, the club was hit with a two-year ban from European club competition after being found to have committed \"serious breaches\" of the governing body's regulations. An independent panel of Uefa's Club Financial Control Body concluded that City had been \"overstating its sponsorship revenue in its accounts… submitted to Uefa between 2012 and 2016\", adding that the club \"failed to cooperate in the investigation\".\nCriticising what it called a \"prejudicial\" decision following a \"flawed and consistently leaked process\", City referred to a \"comprehensive body of irrefutable evidence in support of its position\", and appealed.\nA few months later they were successful, the Court of Arbitration for Sport (Cas) overturning the ban, with a Uefa statement noting that Cas had found \"insufficient conclusive evidence\" that City disguised funding from their owner as sponsorship, and that many of the alleged breaches of rules were \"time-barred\" because they fell outside the five-year statutory limit for prosecution.\nCas ruled that “based on the evidence in front of it...the majority of the panel is not comfortably satisfied that the arrangements discussed in the leaked emails were in fact executed. There is not sufficient evidence on file to establish that arrangements were actually made between [City, Mansour ADUG, & Etihad] or that Mansour and/or ADUG funded part of Etihad’s sponsorship obligations directly. In the absence of a link being proven…the majority of the panel finds that Uefa’s theory on disguised equity funding remains unsubstantiated.”\nCas revealed that Sheikh Mansour had written a letter to the court insisting that he had “not authorised ADUG to make any payments to Etihad, Etisalat or any of their affiliates in relation to their sponsorship of MCFC\".\nHowever, it also found that City had committed a \"severe breach\" by failing to co-operate with Uefa’s investigation, with an initial £25m fine reduced to £8m.\nFor more than two years, the saga seemed to go quiet, but behind the scenes, the Premier League's investigation had continued. In July 2021 there was a dramatic glimpse of it, when a High Court judge revealed that the Premier League had effectively accused City of delay tactics by failing to agree to hand over documents, ordering the club to do so.\nAnd then, in early 2023, came the most sensational twist in this saga to date, when, with City on their way to the third of four consecutive titles, and their first Champions League triumph, they were hit with that catalogue of charges, relating to every one of the years since the club was bought by Sheikh Mansour.\nManchester City 115 charges explained: What is latest on club's PSR case?\n- Published16 September 2024\nMan City charged with breaking financial rules\n- Published6 February 2023\n'Time to resolve' Man City charges - Premier League chief\n- Published13 August 2024\nWhat are the 115 charges against Man City?\nMan City are accused of:\n54x Failure to provide accurate financial information 2009-10 to 2017-18.\n14x Failure to provide accurate details for player and manager payments from 2009-10 to 2017-18.\n5x Failure to comply with Uefa's rules including Financial Fair Play (FFP) 2013-14 to 2017-18.\n7x Breaching Premier League's PSR rules 2015-16 to 2017-18.\n35x Failure to co-operate with Premier League investigations December 2018 - Feb 2023.\nThe Times has reported that the actual number of alleged rule breaches is 130. That came after confusion in how the Premier League originally listed the charges in relation to particular seasons, in its February 2023 statement.\nThey are not additional charges, but the Premier League reportedly issued a correction.\nWhen the charges were announced, the club immediately expressed their \"surprise\", referring once again to a \"comprehensive body of irrefutable evidence that exists in support of its position\", and insisting that it would \"look forward to this matter being put to rest once and for all\".\nBut the sheer scale and severity of the charges that City are contesting has inevitably focused questions on a decade in which they won the Premier League three times - alongside other trophies.\nIf the case against them is found proven it will suggest City broke the rules, fastforwarding the foundations for the domination Pep Guardiola masterminded after his arrival in 2016, culminating in the Treble triumph of 2023, and that it may have cost other clubs titles and trophies they would otherwise have won.\nThe prospect of guilty verdict would raise various questions; would Guardiola leave, how would Sheikh Mansour respond having invested so much in the club and in the city of Manchester?\nHow would the UAE - which has faced allegations that City is being used as a sports-washing tool to improve the country's image - handle such a PR disaster?\nWould there be an appeal? Would there be calls for titles and trophies to be re-allocated?\nWould it dent the immense pride that City fans feel for the outstanding teams the manager has produced?\nWho will win?\nIt is impossible to say because there is no precedent for anything quite like this, and sanctions can be applied on a sliding scale depending on whether City are found guilty of any charges.\nThere have been suggestions it will come down to which side has the best lawyers, or what weight is given to whichever documents City have handed over, or whether Pinto provides any more leaked emails.\nCity’s hierarchy - along with Guardiola - have always appeared confident that they will be cleared. In football's extremely tribal world, many others watching on will have reached a different conclusion.\nOn the eve of the trial starting, Guardiola said he was \"happy\" the case was finally being heard, adding: \"It starts soon and hopefully finishes soon. An independent panel will decide and I am looking forward to the decision.\n\"I'm happy it's starting on Monday. I know there will be more rumours, new specialists about the sentences. We're going to see. I know what people are looking forward to, what they expect, I know, what I read for many, many years.\n\"Everybody is innocent until guilt is proven. So we'll see.\"\nUltimately it will be up to the three members of an independent disciplinary commission, a body armed with limitless powers, to decide.\n\"We have a big thick rulebook and part of any sporting competition is a commitment to uphold those rules,\" Masters said, when explaining why such cases had been brought by the Premier League.\n\"While it does create difficulties, there is no happy alternative to enforcing rules… It's important we get those processes correct and people have confidence in them… the Premier League is on the up, we've got a fantastic football competition, we're in growth, we're really well placed to tackle the future. While there are some tough things ahead we will work our way through them.\"\nSome could interpret such comments as evidence that the league wants to be seen to have teeth, and show they are serious about upholding their regulations. Others however are very sceptical that the league would really want its best team kicked out of the competition.\nBut, it should be stressed again, it is the independent panel not the Premier League that decides the punishment, having heard all the evidence and taken representations from all parties throughout the estimated 10-week case.\nSome highly-experienced sources BBC Sport has spoken to have suggested that both sides would be wise to employ mediation to reach some kind of compromise or settlement.\nBoth City and the Premier League - both of whom told BBC Sport that they could not comment specifically on the hearing because they were bound by the strictest confidentiality - have reasons to be both encouraged but also concerned.\nThe fact that Uefa banned City from their own competition leads some to speculate that the disciplinary commission in the current case could settle on an equivalent punishment if City are found guilty; ie a severe points deduction that would mean relegation, or expulsion from the Premier League.\nCity however, can argue that they were ultimately vindicated when Cas found in their favour. But - while either side could appeal and a fresh hearing arranged, going to Cas is not an option with the Premier League case, and nor are there any rules that would allow any breaches to be 'time-barred'.\nThe points deductions handed to Everton and Nottingham Forest last season for PSR breaches will have also troubled many City fans. But they may have then felt emboldened by the Premier League's recent bruising defeat to Leicester City who avoided a points deduction after winning an appeal that they claimed hinged on \"flaws\" in the Premier League PSR rules.\nA watershed moment for the Premier League\nThis has all played out against a backdrop of mounting scrutiny in Westminster over the way the sport is run, and ahead of the expected establishment of an independent football regulator - one that could be given more powers under the new Labour government.\nDefeat in such a landmark case would do little to help the Premier League convince its critics that its standards of governance are fit for purpose.\nAnd, as this saga has progressed, the league has also had to contend with intensifying divisions between its clubs, with disagreement over the level of regulation required to reign in the spending of the richest clubs to protect competitive balance, while at the same time enabling investment and ambition.\nIn recent times the league has found itself embroiled in a slew of disputes; deducting points from some clubs, facing appeals from others, issuing warnings over potential loopholes in its rules, and even being sued by City over restrictions on 'associated party transactions' - the deals conducted with companies linked to club owners.\nAll the time, the legal bills have been mounting, and the stakes have been heightened.\nAnd now the biggest fight of all is about to play out.\nRelated topics\n- Published26 July 2022",
  "word_count": 2774,
  "scraped_at": "2026-02-14T01:54:48.968715",
  "_text_extracted": true
}