{
  "article_id": "a4326b516ce0",
  "url": "https://www.aa.com.tr/en/world/morning-briefing-dec-19-2023/3086478",
  "title": "Morning Briefing : Dec . 19 , 2023",
  "date": "20231219T094500Z",
  "domain": "aa.com.tr",
  "source_country": "Turkey",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Morning Briefing: Dec. 19, 2023\nAnadolu’s recap of top stories from around the globe\nISTANBUL\nHere is a rundown of all the news that you need to start your Tuesday, including the establishment of a mission to counter attacks in Red Sea, the postponement of vote demanding aid access for Gaza by UN Security Council and a cooperation agreement between Hungary and Türkiye.\nTOP STORIES\nThe US announced the creation of a multinational mission on Monday to counter attacks by Yemen's Houthis on commercial vessels in the Red Sea.\nIn a statement, Defense Secretary Lloyd Austin said the escalating attacks by Houthis threaten the free flow of commerce, endanger innocent mariners and violate international law.\nThe mission gathers 10 countries including the UK, Bahrain, Canada, France, Italy, the Netherlands, Norway, Seychelles and Spain.\nIt aims to jointly address security challenges in the southern Red Sea and the Gulf of Aden, along with ensuring freedom of navigation.\nThe UN Security Council decided to postpone until Tuesday a vote on a draft resolution calling for the urgent cessation of hostilities in Gaza to allow unhindered access to deliver humanitarian aid to the besieged Palestinian enclave.\nMember states have not yet reached an agreement on the draft resolution, which was scheduled to be voted on late Monday, according to information obtained by Anadolu from UN sources.\nThe text, which was drafted by the United Arab Emirates (UAE), reaffirmed that all parties to conflicts must adhere to their obligations under international law.\nDuring a visit by Turkish President Recep Tayyip Erdogan to Hungary, the two countries signed a cooperation agreement on Monday to enhance bilateral relations to the level of enhanced strategic partnership.\nThe 17-article agreement was signed in the capital Budapest, where Erdogan and Hungarian Prime Minister Viktor Orban chaired the sixth meeting of the high-level strategic cooperation council between the two nations.\nSeveral high-level and senior officials, including Turkish Foreign Minister Hakan Fidan, Interior Minister Ali Yerlikaya, National Defense Minister Yasar Guler, and Hungarian representatives, were present during the signing ceremony.\nNEWS IN BRIEF\n- Egypt's incumbent President Abdel-Fattah al-Sisi was reelected to a third, six-year term in office till 2023, the country’s electoral commission announced on Monday.\n- At least 19,453 Palestinians have been killed in Israeli attacks on the Gaza Strip since Oct. 7, the Health Ministry said Monday.\n- An Israeli woman who was freed in a recent prisoner exchange between Israel and Hamas said her mother was killed and she was wounded when Israeli forces opened fire on the vehicle in which they were abducted.\n- Egypt has rejected the deployment of a joint Egyptian-Israeli force on the Philadelphia axis near the border with the Gaza Strip, according to Israeli media on Monday.\n- The Biden administration has \"raised our concerns\" with Israel after one of its snipers fatally shot a mother and daughter sheltering in Gaza's only Catholic church, the White House said Monday.\n- Calling the ongoing war in Gaza “genocide,” South Africa’s President Cyril Ramaphosa at a media briefing repeated a call for a permanent cease-fire.\n- Iraqis on Monday returned to the polls for provincial council elections after a decade-long hiatus.\n- At least 118 people were killed in a 6.2-magnitude earthquake in northwestern China, the official Xinhua News Agency reported Tuesday.\n- BioNTech inaugurated its first manufacturing site on Monday for mRNA-based vaccines in Africa in the Rwandan capital Kigali, which could ensure vaccine equity on the continent.\n- The European Commission announced Monday that it has launched a formal investigation against the social media platform X over its compliance with obligations concerning the “dissemination and amplification of illegal content.”\nSPORTS\nThe 2023/24 UEFA Champions League round of 16 draw took place on Monday at the House of European Football in Nyon, Switzerland.\nDefending champion Manchester City have been paired with FC Copenhagen in the last 16 draw.\nThe English football giant qualified for the knockout phase by leading Group G.\nTurkish club Galatasaray will face Czech Republic's Sparta Prague in the knockout round for Round 16 at the UEFA Europa League.\nThe draw for the playoff round was held for the second-tier club organization of European football at the UEFA headquarters in Nyon, Switzerland on Monday.\nBUSINESS & ECONOMY\nOil company BP announced on Monday that it is temporarily pausing all transits through the Red Sea following recent attacks by the Houthi group in Yemen.\n\"In light of the deteriorating security situation for shipping in the Red Sea, bp has decided to temporarily pause all transits through the Red Sea,\" the company said in a statement.\nIstanbul Airport has been voted the “World's Best Airport\" by readers of leading US travel magazine Global Traveler.\nThe mega air hub has also been chosen as \"Europe's Best Airport,\" further cementing its position as a leader in global aviation, according to a statement Monday.",
  "word_count": 809,
  "scraped_at": "2026-02-14T02:17:09.409672",
  "_text_extracted": true
}