{
  "article_id": "a4398d3687ec",
  "url": "https://www.nytimes.com/athletic/6693282/2025/10/06/inside-barcelona-hansi-flick-lamine-yamal/",
  "title": "Inside Barcelona : Hansi Flick plans to fill the leadership void , Lamine Yamal fitness row continues",
  "date": "20251006T131500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to Inside Barcelona, our weekly series to follow La Liga’s defending champions throughout their 2025-26 season.\nEvery edition will bring you our latest information and analysis on the biggest talking points, cutting through the noisy world of all things Barca with reporting you can trust.\nThis week, Laia Cervello Herrero and Pol Ballus discuss the team’s dip in form, the ongoing Lamine Yamal-Spain injury saga, and how Hansi Flick is planning to fill a leadership void.\nAdvertisement\nWhat’s the biggest talking point at Barcelona right now?\nTheir poor performances.\nFlick’s side lost twice in the past week, suffering a late 2-1 defeat to visitors Paris Saint-Germain in the Champions League before being thrashed 4-1 at Sevilla in La Liga on Sunday.\nThe first of those was frustrating. Lamine Yamal had been preparing to return from a groin injury specifically for the match against the European champions. And while he performed well, the second half took a lot out of Flick’s players, who were eventually stunned by Goncalo Ramos’ stoppage-time winner.\nThat was a disappointment, but at least there was some justification in terms of the quality of team they were up against in PSG — there was none for the loss in Seville. Their opponents appeared beatable, but Barca were below-par across the pitch.\nFlick’s team did not put pressure on the hosts, seemed to have few ideas in attack, and Sevilla regularly put goalkeeper Wojciech Szczesny under pressure. Yamal was not present, having suffered a relapse of his groin issue, and the manager was unable to turn to anyone who could change the game.\nAnd while the players are understandably tired after playing seven matches in 22 days since the September international window, far more concerning was their lack of intensity.\nOne statistic that summed it up was Pedri producing 64 touches while playing the full game when he averaged more than 110 per 90 minutes over the season’s first seven league matches. That is not to single out the midfielder, who was one of the few players who showed as bright sparks, but rather the team’s collective failure.\nLast year, Flick bemoaned a “s**t November” in terms of results. In 2025, that tough month might have arrived early.\nWhat happened with Yamal?\nAfter Yamal suffered a setback with his groin problem, Barcelona said they expected him to be sidelined for up to three weeks.\nAdvertisement\nBut before the club had confirmed this latest injury with a statement on Friday, Spain coach Luis de la Fuente announced his squad for the upcoming World Cup qualifiers against Georgia and Bulgaria — with Yamal in it.\nIt was the latest episode in tensions between the club and national team over the management of their players, especially their star No 10.\nSenior sources at Barcelona — who, like all those spoken to for this article, asked to remain anonymous to protect their positions — were confident Yamal would not be called up for the October matches. Sporting director Deco and his Spain counterpart Aitor Karanka held a meeting last week to clear the air. Yamal was the main subject of discussion, and the talks ended with those on the club’s side assuming the teenager would be given a rest.\nSpanish media outlets also reported that De la Fuente and Yamal had a phone conversation on Thursday, in which the manager told the player he was planning to leave him out.\nThis is why the Spain squad was received with shock at Barca.\nMultiple national team sources said Yamal was included as he had featured in his club side’s two games before this weekend, coming off the bench against Real Sociedad and starting against PSG. They assumed that meant he was fit to play and therefore eligible for selection. If the player suffered any physical discomfort after that, Barca would have to submit a report on his condition to the Spanish Football Federation’s medical team, which would then take a final decision.\nOn Friday, Barca announced Yamal’s setback. By the end of the day, Spain confirmed he had been released from international duty because of the injury.\nIt is nothing new. A month ago, Yamal returned from international duty with the groin injury he is still nursing after De la Fuente started him in both World Cup qualifiers in September against Bulgaria and Turkey. Flick was infuriated by how his counterpart had handled the youngster and even revealed Yamal had taken painkillers to play in the latter match.\nAdvertisement\nBarca and Spain will have to keep working together to ensure Yamal fully recovers from this issue. For now, Flick has been unable to confirm whether Yamal will be fit to play in the first Clasico of the season, away to Real Madrid, on October 26.\nDare we ask… what’s the latest on the Camp Nou?\nThe club still need a green light from the city council, which has yet to grant them the licence they need to reopen the refurbished Camp Nou.\nBarcelona’s idea was to return to their iconic home stadium for the start of the season, holding the annual Joan Gamper Trophy friendly in mid-August there with a reduced capacity of 27,000 fans. But without a certificate of completion from the council, this was not possible, and they had to look for alternatives.\nThey ended up playing the first two home matches of the campaign, against Valencia and Getafe, at their 6,000-capacity Estadi Johan Cruyff, next to their training ground, as the Estadi Olimpic Lluis Companys — where they have staged home games for the past two seasons since the work at Camp Nou began — had not been reserved and was being used to host concerts, including one by American rapper Post Malone.\nBut since then, the team have returned to the home of the 1992 Olympics at Montjuic, entertaining Real Sociedad and PSG. It has already been confirmed Barcelona will also play their next Champions League match there, against Olympiacos on October 21. There has been no announcement yet about where their next home game, Girona’s visit in La Liga three days earlier, will take place, but that is likely to be at Montjuic, too.\nWhat might we have missed last week? What’s coming up this week?\nThe concerns last week and now are the same: how much will this international break affect Barcelona and when will their injured players recover?\nFlick has a small squad, partly because of the club’s complicated financial situation. They have been unable to operate normally in the summer transfer market for several years and continue to lose out monetarily through not being able to play home matches at the Camp Nou, even if their circumstances have improved somewhat.\nAdvertisement\nThis, coupled with a talented generation of players graduating from their youth academy, meant a summer in which only goalkeeper Joan Garcia, on-loan Manchester United forward Marcus Rashford and Sweden Under-21 winger Roony Bardghji, 19, arrived. All three have shown promising signs, but the team lack options elsewhere.\nThe main concern now is the lack of experience in defence, with the effects being felt of Inigo Martinez’s unexpected departure to Saudi Pro League side Al Nassr in August. They no longer have an established centre-back pairing and miss Martinez’s leadership. Pau Cubarsi sometimes has to bump over to left centre-back depending on who he is partnered with, which does not play to the 18-year-old’s strengths.\nFlick has challenged Pedri to take charge of the team and become more of a leader, and the 22-year-old is improving a lot in that sense. He has always been a highly respected figure in the dressing room, but the manager thinks he has the potential to be even more influential.\nBarcelona have suffered from injuries during recent international breaks and go into this one with a lengthy list of current casualties: Yamal, Joan Garcia, Fermin Lopez and Raphinha are all out, joining long-term absentees Marc-Andre ter Stegen and Gavi.\n(Top photo: Pedri despairs during Barcelona’s 4-1 loss at Sevilla; by Joaquin Corchero/Europa Press via Getty Images)",
  "word_count": 1339,
  "scraped_at": "2026-02-14T01:49:53.049060",
  "_text_extracted": true
}