{
  "article_id": "a44e704825d4",
  "url": "http://thepeninsulaqatar.com/article/20/02/2024/an-impossible-task-calzona-takes-over-napoli-48-hours-before-facing-barca-in-champions-league",
  "title": "An impossible task ? Calzona takes over Napoli 48 hours before facing Barca in Champions League",
  "date": "20240220T213000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nNapoli's Italian headcoach Francesco Calzona attends a press conference on the eve of the UEFA Champions League last 16 first leg football match between Napoli and Barcelona at the Diego Armando Maradona stadium on February 20, 2024. (Photo by Carlo Hermann / AFP)\nRome: If Francesco Calzona didn’t already know most of Napoli’s players, it might be an impossible task: He became coach of the defending Serie A champion 48 hours before facing Barcelona in the Champions League.\nBut Calzona knows Napoli through and through. He was an assistant to Maurizio Sarri with the Partenopei from 2015-18 and was on Luciano Spalletti’s staff in 2021-22.\nNapoli's Italian headcoach Francesco Calzona attends a press conference on the eve of the UEFA Champions League last 16 first leg football match between Napoli and Barcelona at the Diego Armando Maradona stadium on February 20, 2024. (Photo by Carlo Hermann / AFP)\nUnder Sarri, Calzona was credited with coming up with the idea of Dries Mertens’ highly successful move to a false 9 position. Then with Spalletti, he helped to lay the foundation for Napoli’s run to the Serie A title.\nCalzona left before the title run when former Napoli captain Marek Hamsik - who still holds the club appearances record with 520 - suggested he take over as the coach of Slovakia’s national team.\nIn Calzona's first job as a head coach, Slovakia successfully qualified for the European Championship.\nNow the 55-year-old Calzona will direct a club for the first time and his debut could hardly come in a bigger match, with Barcelona visiting Stadio Diego Armando Maradona on Wednesday in the first leg of the Champions League last 16.\nWhile he was announced on Monday, Calzona’s first training session in charge at Napoli didn’t come until Tuesday.\n\"We don’t have much time, so we’re trying to move along quickly,” Calzona said. \"I told the team that we don’t have any more excuses or alibis. I explained my ideas to the guys and now let’s see if they’ve understood them in a hurry.”\nNapoli's Italian defender #22 Giovanni Di Lorenzo (R) and Napoli's Italian headcoach Francesco Calzona attend a press conference on the eve of the UEFA Champions League last 16 first leg football match between Napoli and Barcelona at the Diego Armando Maradona stadium on February 20, 2024. (Photo by Carlo Hermann / AFP)\nCalzona, who will also continue as Slovakia coach, faces a big challenge with Napoli on a five-match winless run in all competitions - which led to its second coaching change of the season.\nWalter Mazzarri was fired on Monday after only 12 league matches, the same duration that Rudi Garcia lasted at the start of the season.\nHaving spent most of his coaching career under Sarri, whom he met when he was a coffee salesman in Tuscany, Calzona deploys more of an attacking style than Mazzarri.\nThat should be good news for Napoli center forward Victor Osimhen, who is due to return against Barcelona after helping Nigeria reach the Africa Cup of Nations final.\nNapoli's Italian headcoach Francesco Calzona attends a press conference on the eve of the UEFA Champions League last 16 first leg football match between Napoli and Barcelona at the Diego Armando Maradona stadium on February 20, 2024. (Photo by Carlo Hermann / AFP)\nAs under Spalletti, Calzona will likely rely on midfielder Stanislav Lobotka - who also plays under the coach with Slovakia - as the team motor.\nStill, it remains to be seen how Napoli will react under its fourth different coach in nine months - including Spalletti, who left after last season. Mired in ninth place in Serie A, Napoli is on course for one of the worst title defenses in Italian league history.\n\"When the third coach of the season arrives, it means that the situation isn’t great. The squad realizes that and knows it needs to do more,” Napoli captain Giovanni Di Lorenzo said. \"Calzona already knows us and we welcome him. He has immediately transmitted enthusiasm. We still have a lot to play for.”\nCalzona was given a contract only through the end of the season, after which there could be even bigger changes.\nOsimhen, last season’s Serie A scoring leader, has indicated he will leave in June. Midfielder Piotr Zielinski has already agreed on a move to Inter Milan for next season. And goalkeeper Alex Meret could be on the way out, too.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 803,
  "scraped_at": "2026-02-14T02:25:18.564521",
  "_text_extracted": true
}