{
  "article_id": "a45332d0f474",
  "url": "https://www.daijiworld.com/news/newsDisplay?newsID=1093757",
  "title": "Gor Mahia clinch Kenyan football title",
  "date": "20230626T070000Z",
  "domain": "daijiworld.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jun 26: The title fight spilled into the final day of the season with Gor needing to better or equal the result of their main rivals Tusker FC to reclaim the crown they had lost to the latter for the past two seasons, reports Xinhua.\nWith the title rivals separated by a point - 67 against 66 - before the kick-offs of the 34th and final round of play, it was Tusker who edged ahead only three minutes in when Deogratious Ojok gave the brewers a 1-0 lead at Vihiga United in western Kenya.\nIt got better for coach Robert Matano's side when Shami Mwinyi Kibwana extended their advantage to 2-0, with the game in Nairobi between Gor and Nairobi City Stars remaining goalless at halftime.\nAnd to the disbelief of thousands of Gor fans who packed the Kasarani stadium, City Stars shocked the leaders when Samuel Kapen scored two minutes after the break to stun the Green Army into silence.\nWith the title slipping from their grasp, Benson Omalla headed Gor level three minutes later before Peter Lwasa sent the Gor fans into delirium when he put his side 2-1 up in the 62nd minute after turning his marker inside the box before firing into the roof of the net.\nThe title party started in earnest when Austin Odhiambo thumped home a vicious free kick in the 77th minute, with Alpha Onyango adding the gloss to the celebrations when he netted a fourth with a minute to go.\nThat meant a second-half brace from Stewart Omondi for Tusker for a 4-1 win at Vihiga could not deny Gor, with their overjoyed supporters invading the pitch to celebrate their team being crowned champions for the first time since 2021.\nGor will play in the CAF Champions League preliminary rounds next season, with Kenya's other representative in continental football to be identified when Tusker FC play Kakamega Homeboyz in the domestic cup final next weekend.\nThe winner will qualify for the second-tier CAF Confederations Cup.",
  "word_count": 334,
  "scraped_at": "2026-02-14T02:12:52.295302",
  "_text_extracted": true
}