{
  "article_id": "a455267457dc",
  "url": "https://www.france24.com/en/live-news/20230224-bayern-seek-to-stop-the-rot-against-beautiful-underdogs-union",
  "title": "Bayern seek to stop the rot against  beautiful  underdogs Union",
  "date": "20230224T040000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern seek to stop the rot against 'beautiful' underdogs Union\nBerlin (AFP) – Under fire Bayern Munich could not have picked a worse time to face surging outsiders Union Berlin in their surprise Bundesliga top-of-the-table clash on Sunday.\nIssued on:\nThat the German champions' domestic struggles -- Bayern have won just two of their last six in the league -- left the door open should not be surprising, but that underdogs Union took up the mantle as challengers certainly is.\nThe two sides meet in Munich on Sunday locked on 43 points after 21 games, sitting alongside Europe's most in-form side Borussia Dortmund in first place.\nUnion could have made the trip south as outright leaders, but they fluffed their lines against bottom side Schalke on Sunday, playing out a 0-0 stalemate.\nThat will be little consolation to Bayern, who are usually well ahead in the league and focusing on Europe by now.\nClub boss Oliver Kahn on Wednesday accused the team of something not normally associated with the 32-time German champions: a lack of greed.\n\"It's the decisive phase of the season. It must be our goal to constantly deliver top performances,\" the CEO told German sport site Kicker.\n\"It's about readiness, it's about greed, desire and a degree of calm. If we bring that, we're unbeatable.\"\nBayern come into the match without in-form centre back Dayot Upamecano, who is suspended after picking up a red card in his side's 3-2 loss at Gladbach on Sunday.\nManager Julian Nagelsmann will however be on the sidelines against Union after he beat a suspension for his \"spineless\" referee rant after the Gladbach loss. The manager, who apologised for the outburst, agreed to pay a 50,000 euro ($53,000) fine instead.\nUnion boss Urs Fischer, who brought the side up from the second division, showed little disappointment after his team missed their chance to go two points clear on Sunday, reminding his team and the fans how far they have come - and where they are now.\n\"Beautiful tasks ahead,\" the Swiss manager said.\n\"It's great. What more do you want?\"\nOne to watch: Danilho Doekhi (Union Berlin)\nArriving at Union Berlin on a free transfer last summer from Eredivisie side Vitesse, Danilho Doekhi has swiftly become a mainstay in manager Urs Fischer's starting XI.\nFew players embody the no nonsense, effective and efficient style of Fischer’s Union better than the Dutch centre-back.\nSince arriving in Koepenick, four of the five shots on goal Doekhi has taken have gone in - and all with his head.\nIf the underdog side are to snare a point or better against German football behemoths Bayern on Sunday, Doekhi —- half-jokingly referred to by Rani Khedira as \"our saviour again\" after scoring in the Berlin derby -— must play a key role.\nKey stats\n9/18 - With three draws, two wins and one loss, Bayern have picked up nine points from a possible 18 since the winter break.\n18/18 - With six wins from six games in 2023 -- along with victories in the German Cup and the Champions League against Chelsea -- Borussia Dortmund have come from nine points behind to close the gap on Bayern.\n16/18 - Until Sunday’s draw with Schalke, Union Berlin were alongside Dortmund as the only team to have won every game in 2023.\n1/18 - With one draw and five losses, Hoffenheim are the Bundesliga’s most out-of-form team in 2023. Only one other side, last-placed Schalke, is winless in the new year (two losses and four 0-0 draws in succession). Hoffenheim face Dortmund, the league’s most in-form side, on Saturday.\nFixtures (all times 1430 GMT unless otherwise stated)\nFriday\nMainz v Borussia Moenchengladbach (1930)\nSaturday\nHertha Berlin v Augsburg, Hoffenheim v Borussia Dortmund, Cologne v Wolfsburg, Werder Bremen v Bochum, RB Leipzig v Eintracht Frankfurt, Schalke v Stuttgart (1730)\nSunday\nFreiburg v Leverkusen, Bayern Munich v Union Berlin (1630),\n© 2023 AFP",
  "word_count": 652,
  "scraped_at": "2026-02-14T01:55:49.893920",
  "_text_extracted": true
}