{
  "article_id": "a457cd1afdde",
  "url": "https://metro.co.uk/2026/02/01/chelsea-winger-tyrique-george-agrees-move-premier-league-rivals-26653481/",
  "title": "Chelsea winger Tyrique George agrees move to Premier League rivals",
  "date": "20260201T193000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tyrique George is set to move to Everton on loan after the Toffees agreed a deal with Chelsea for the winger.\nThe 19-year-old has been linked with a number of clubs over the last year after emerging as one of the brightest prospects at Chelsea but unable to break into the first team on a regular basis.\nGeorge had agreed a permanent move to Fulham in the summer transfer window last year, but the deal fell apart on deadline day.\nThe teenager is now set for a move to Merseyside, with The Athletic reporting that the clubs have reached an agreement in principle.\nThe deal will see George move on loan for the rest of the season, with Everton having an option to buy him in the summer.\nThe agreement will be a boost for the Toffees, after another loan signing, Jack Grealish, has suffered a possibly season-ending injury.\nThe England international, on loan from Manchester City, is dealing with a stress fracture in his foot and may not play for Everton again.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nDespite a solid season, which sees David Moyes’ side sit ninth in the Premier League, goals have proved difficult to come by.\nAfter a 1-1 draw at Brighton on Saturday, Everton have scored just 26 goals in 24 league games, fewer than the likes of Leeds United in 16th and West Ham in 18th.\nMore Trending\nGeorge has just one Premier League goal to his name in his short career so far, but has shown that he can find the back of the net in other competitions this season.\nThe teenager has scored twice in three Carabao Cup appearances this campaign and also netted in the Champions League when the Blues thrashed Ajax 5-1 in October.\nEverton boss Moyes said on Friday that any incomings were looking unlikely, telling a press conference ahead of the trip to Brighton: ‘We’re certainly looking. It’s not like we’re shying away from it. I would say it’s probably less likely than likely.’\nHowever, it looks like the Toffees have got a deal done ahead of going to Fulham in their next outing on Saturday afternoon.\nMORE: Michael Owen singles out ‘struggling’ Man Utd star for praise after Fulham win\nMORE: Benjamin Sesko praises Manchester United teammate after Fulham win – ‘he’s a legend’\nMORE: Mikel Arteta dealt injury blow as Arsenal star is ruled out for ‘sustained spell’",
  "word_count": 451,
  "scraped_at": "2026-02-14T01:59:36.850105",
  "_text_extracted": true
}