{
  "article_id": "a4865defe198",
  "url": "https://www.caughtoffside.com/2026/02/08/tottenham-dusan-vlahovic-free-transfer/",
  "title": "Tottenham eyeing stunning free transfer of Juventus star Dusan Vlahovic",
  "date": "20260209T021500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham are closely monitoring the situation of Juventus striker Dusan Vlahovic, with reports suggesting the North London club is ready to battle Chelsea for his signature this summer.\nAccording to Foot Mercato, the Serbian marksman is attracting significant interest from the Premier League as his time in Turin draws to a close.\nWhile European giants like Barcelona and Atletico Madrid have previously tracked him, England now appears to be his most likely destination.\nTottenham remain “attentive to his evolution,” viewing the 26-year-old as a potential marquee signing to lead their line for the long term.\nDusan Vlahovic set to leave for free in the summer\nThe alert for Premier League clubs comes as contract talks between Vlahovic and Juventus have completely collapsed.\nThe striker’s current deal is set to expire in June 2026, meaning he will be available as a free agent at the end of the season.\nJuventus had hoped to tie down their star forward to new terms, but negotiations stalled over wage demands, leaving the Old Lady resigned to losing a player they once signed for over €80 million for nothing.\nThis presents a golden market opportunity for Spurs, who could secure a world-class number nine without a transfer fee, though competition for his wages will be fierce.\nThey do face strong competition from Premier League clubs like Newcastle and Chelsea as well as from abroad.\nVlahovic’s excellent goalscoring record\nDespite recent contract distractions, Vlahovic’s pedigree as one of Europe’s most lethal finishers remains undeniable.\nSince exploding onto the scene with Fiorentina, the Serbian international has racked up over 90 Serie A goals, consistently ranking among the league’s top scorers.\nHis record places him in elite company; he is one of the few strikers born after 1999, alongside Erling Haaland, to have breached the 40-goal mark in Europe’s top five leagues so quickly.\nEven in a disrupted 2025/26 campaign, Vlahovic has demonstrated his clinical edge, netting 3 times in 4 Champions League appearances before an adductor injury sidelined him in December.\nSpurs scouts are reportedly convinced that his physical profile, aerial dominance, and lethal left foot are tailor-made for the physicality of the Premier League.\nTottenham need a lethal striker\nSpurs’ interest in Vlahovic is driven by a looming crisis in their attacking department, with a mass exodus expected this summer.\nRicharlison faces an uncertain future, with reports indicating the club is finally ready to cash in on the Brazilian after an inconsistent spell in North London.\nFurthermore, the loan experiment with Randal Kolo Muani appears to have failed. The Frenchman has struggled to adapt to the Premier League and is widely expected to return to PSG once his temporary deal concludes.\nCompounding the issue is the situation of young talent Mathys Tel, who has been heavily linked with a move away in search of regular first-team football.\nWith their current options dwindling, landing a proven goalscorer like Vlahović has become a critical priority for the Spurs hierarchy.",
  "word_count": 491,
  "scraped_at": "2026-02-14T01:53:15.563697",
  "_text_extracted": true
}