{
  "article_id": "a49d9e3acd86",
  "url": "https://tribune.com.pk/story/2443583/messi-eyes-eighth-ballon-dor-crown",
  "title": "Messi eyes eighth Ballon dOr crown",
  "date": "20231029T130000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Messi eyes eighth Ballon d'Or crown\nWorld Cup winner Argentina will face competition from Haaland, Mbappe\nLionel Messi is the favourite to win the eighth Ballon d'Or of his remarkable career when this year's ceremony to crown the planet's best footballer takes place in Paris on Monday, while Spain's World Cup-winning star Aitana Bonmati is tipped to take the women's prize.\nThe prestigious award has been dominated over the last 15 years by Messi and his old adversary Cristiano Ronaldo, who have won it 12 times between them.\nOnly two other players have won the Ballon d'Or since Ronaldo claimed his first in 2008 – Luka Modric won it in 2018 and Karim Benzema was crowned last year following a brilliant season with Real Madrid.\nMessi is set to benefit from a recent change which means the award is now based on a player's record over the last season, rather than over the course of the calendar year.\nLast season saw Messi lead Argentina to glory at the World Cup in Qatar, where he scored seven times and was named the tournament's best player.\nIt was the crowning moment of his astonishing career, and is likely to mean Messi sees off the considerable competition elsewhere among the 30 nominees.\nMost notably, there are seven members of the Manchester City team that won the English Premier League, FA Cup and UEFA Champions League under Pep Guardiola.\nThe obvious candidate among them is Erling Haaland, who scored 52 goals in 53 games and has already won the UEFA Player of the Year award for last season.\n\"I always said that the Ballon d'Or should be in two sections, one for Messi, and after that look for the other one,\" Guardiola said recently.\n\"Haaland should win. We won the treble and he scored, I don't know, 50 million goals.\n\"But of course if you tell me the worst season of Messi, it would be the best season for the rest of the players.\n\"Both deserve it, so what can I say? Selfishly I would say I want it to be Erling because he helped us to achieve what we achieved. I would love it.\"\nMessi's season at club level with Paris Saint-Germain was underwhelming, even if he won Ligue 1 alongside Kylian Mbappe and Neymar.\nHe scored 21 goals for the French club, but was clearly never happy in Paris and was even jeered by his own supporters at times, before moving to Inter Miami in Major League Soccer earlier this year.\nThere is at least a case to say this should be Mbappe's time.\nHe was clearly PSG's most important player last season, scoring 41 goals, and was also the World Cup's top scorer with eight goals after his incredible hat-trick in that epic final.\nThe French lobby is strong in favour of Mbappe, 24, winning a prize organised in France and handed over in Paris.\nAs an example, the manager of leading French club Lens, Franck Haise, last week did not hesitate when asked who he would vote for.\n\"Another Frenchman, Kylian Mbappe,\" he said.\n\"Because he had such a complete season and he is an exceptional player. Even if I think it will be won by a player who won the World Cup, which I would not find jarring.\"\nAlas, the prize is voted for by a jury of one journalist per country from the top 100 nations in FIFA's ranking.\nThe destination of the women's prize seems even more clear cut.\nThe list of nominees features four members of the Spain team that lifted the Women's World Cup in Sydney in August despite off-field turbulence including protests against the Spanish football federation and coach Jorge Vilda.\nAlba Redondo, Salma Paralluelo and full-back Olga Carmona, who scored the winner in the final, are all shortlisted, but Bonmati appears untouchable.\nThe 25-year-old Barcelona midfielder lit up the tournament with her talent having already starred for her club as they won the Champions League.\nSo impressive has she been that Guardiola has likened her to another Barcelona great, Andres Iniesta.\nOrdinarily, the likes of World Cup top scorer Hinata Miyazawa of Japan, or Australia's Sam Kerr, would be credible contenders, but Bonmati's success appears nailed on.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 728,
  "scraped_at": "2026-02-14T02:13:18.803687",
  "_text_extracted": true
}