{
  "article_id": "a4a7008573c7",
  "url": "https://dailynews.co.tz/caf-draw-tplb-cautions-tz-envoys/",
  "title": "CAF Draw : TPLB cautions TZ envoys",
  "date": "20230726T093000Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CAF Draw: TPLB cautions TZ envoys\nTHE Tanzania Premier League Board (TPLB) has urged envoys in CAF Interclub Games to thoroughly screen their revealed preliminary round opponents in order to reach far.\nAccording to a draw conducted at CAF headquarters in Cairo, Egypt on Tuesday, Simba have been exempted from the preliminary round and will instead face the winner between African Stars (Namibia) and Power Dynamos (Zambia).\nOn the other hand, Young Africans will play Asas FC of Djibouti in the preliminary round of CAF Champions League.\nFor the CAF Confederation Cup, Azam are pitted against Bahir Dar Kenema of Ethiopia and the winner will meet Club Africain (Tunisia) whereas Singida Fountain Gate will open their campaign against JKU of Zanzibar and the winner will go head to head against Future FC from Egypt.\nHowever, in his reaction after the draw, TPLB Information Officer Karimu Boimanda said time is here for the teams to go through ample preparations and at the same time, screen them fully.\n“This is the critical stage of the competition whereby teams need to first understand their opponents and thereafter engage in maximum preparations.\n“As TPLB, we are anxious to see that all our representatives make it further into the competition and there is nowhere you can think of becoming a champion if you fail to shine in these preliminary round games,” he said.\nAlso, a well-known sports analyst Jemedari Said remarked that all four Tanzanian envoys have a big advantage to surpass the preliminary round phase.\n“I think Yanga have a big advantage to overcome the Djibouti’s team though they should not underrate them because teams from Djibouti have potential to sign competitive players,” he said.\nHe added that similarly, Azam are better placed to advance over the Ethiopian side basing on the level of investment they have done to acquire good players and boost their technical bench.\nAlso, Said pointed out that Singida Fountain Gate can have a smooth ride against fellow Tanzanian team JKU insisting that Zanzibar football is now fading away in comparison with the past.\n“For Simba who begin in the second preliminary round, I can confidently declare that they will cruise into the group stage of CAF Champions League,” he said.\nHowever, it is another opportunity for any of the envoys to get closer to the prestigious CAF title just like the way Yanga did last season when they narrowly missed the confederation cup crown.\nAn away goal rule shuttered their hopes of becoming the first Tanzanian side to bring home the lucrative silverware after a 2-2 aggregate draw stamped from the two-legged final fixtures versus current holders USM Alger.\nLikewise, Simba have flexed their muscles aiming to achieve success in the Champions League as they eye to make a breakthrough of reaching in the semifinals.\nBasing on the quality of signings they have so far completed, it does not require one to have advanced education to understand that they are targeting to shine in the competition.\nSimilarly, Azam are also leaving no stone unturned as they too intensify preparations to sparkle in the confederation cup.\nTheir massive investment in building a strong team has gone simultaneously with the creation of an admirable technical bench full of experienced trainers who are curious to drive the team to the Promised Land.\nUntil now, the Chamazi-based club who are in Tunisia for preseason rehearsals have played three international friendly matches against Al Hilal, Esperance, and US Monastir.\nFrom the three matches, Azam managed two wins after defeating Al Hilal 3-0 and US Monastir 1-0 and suffered one defeat (3-0) from Esperance.\nHowever, not much is being held about Singida Fountain Gate in terms of sealing transfer deals though they seem ready to withstand the Confederation Cup showdown.",
  "word_count": 625,
  "scraped_at": "2026-02-14T02:20:03.680069",
  "_text_extracted": true
}