{
  "article_id": "a4ab39278a39",
  "url": "https://www.90min.com/arsenal-potential-opponents-2024-25-champions-league",
  "title": "Arsenal potential opponents in the 2024 / 25 Champions League",
  "date": "20240828T104500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal's potential opponents in the 2024/25 Champions League\n- Arsenal are back in Champions League following second-place Premier League finish\n- Gunners in Pot 2 for league phase draw\n- Bayern Munich downed north London club in quarter-finals last season\nAfter enjoying their first taste of Champions League football since 2017 last season, Arsenal are once again a part of Europe's premier club competition in 2024/25.\nThe Gunners fell short in the Premier League title race to perennial victors Manchester City for the second consecutive campaign and have established themselves as one of the continent's most potent outfits without truly stamping their authority in the Champions League.\nMikel Arteta's side, having squeezed past Porto in the last 16, were outmanoeuvred by Bayern Munich in the quarter-finals last time out, succumbing to a 3-2 aggregate defeat.\nThe club's priority remains Premier League glory, but a deep run in Europe would certainly be welcomed. There's scope for this excellent Gunners outfit to make a splash in 2024/25.\nHere's who Arsenal could face in the all-new league phase, with the draw taking place on Thursday.\nWhat 2024/25 Champions League pot are Arsenal in?\nArsenal, as they were on their return last year, are in Pot 2 for the Champions League league phase draw. However, UEFA's decision to switch to a Swiss model format means pots are of little consequence as teams will not be drawn into groups.\nThursday's draw will decide Arsenal's eight league phase opponents. The Gunners will be drawn against two teams from each pot, including Pot 2. Their opponents will be generated at random via AI software once their name is manually pulled out of the hat.\nThe 36 competing teams will then aim to accumulate as many points from their eight games in a bid to reach the knockout rounds. The top eight progress automatically into the last 16, while those who sit between ninth and 24th in the table will participate in a play-off round. Those who finish 25th and below will be eliminated from the competition and will not drop down into the Europa League.\nArsenal's 2024/25 potential Champions League league phase opponents\nArsenal have a long list of potential league phase opponents. However, they cannot be drawn against a fellow Premier League club (Manchester City, Liverpool or Aston Villa) nor face more than two teams from any given league.\nThe Gunners will be drawn against two teams from each pot. Europe's elite largely make up Pot 1, including familiar foes Bayern Munich. The holders and perpetual champions Real Madrid are the team everyone will want to avoid, while Arsenal could also face Serie A winners Inter, Paris Saint-Germain, last season's finalists Borussia Dortmund, RB Leipzig or Barcelona.\nBundesliga champions Bayer Leverkusen, who Arsenal thumped in pre-season, are the highest-ranked outfit in Pot 2, with Atletico Madrid also in the Gunners' pot. Europa League winners Atalanta are in there with Thiago Motta's Juventus and Paulo Fonseca's Milan. Benfica, Club Brugge and Shakhtar Donetsk are the teams Arsenal will be more content with facing.\nThere's still plenty of quality in the remaining pots, although Feyenoord may well be hamstrung by Arne Slot's exit. Sporting CP boast one of Europe's sharpest finishers in Viktor Gyokeres and beat Arsenal on penalties in the Europa League round of 16 two seasons ago. The Gunners could also meet PSV again after their group stage exploits last season, while Celtic are another option from Pot 3.\nThere are a few novices in Pot 4, including Villa, with Arsenal potentially facing Champions League debutants Girona and Brest. Bologna are also appearing in the competition since its 1992 reformatting for the very first time, while Stuttgart are back in the big time following a superb campaign in the Bundesliga last time out. Monaco were semi-finalists in 2016/17 and the highest-ranked Pot 4 outfit having finished second in Ligue 1 last season.\nArsenal's toughest potential 2024/25 Champions League league phase opponents\nThe Champions League's expansion and format change means Arsenal will have to be incredibly unfortunate to endure this scenario. The Gunners will not want to run the gauntlet so early on given their domestic aspirations.\nEveryone will be keen to avoid Real Madrid from Pot 1, although the holders typically save their very best for the latter stages of the competition. Bayern Munich, meanwhile, are the highest-ranked team in the competition based on UEFA's coefficient rankings.\nDiego Simeone's Atleti would be the worst-case scenario from Pot 2 given the make-up of their squad and Champions League credentials. Bayer Leverkusen have retained their title-winning squad for 2024/25 and could emerge as one of the underdogs in Europe this season having been beaten in the Europa League final last term.\nFeyenoord don't seem quite as proficient in Slot's absence but are the highest-ranked team in Pot 3, while Arsenal know all about Sporting CP following their Europa League tie two years ago. Both teams have evolved considerably since that match-up, however.\nMonaco were superb under Adi Hutter last term and are a team to keep an eye on this season. Bologna, though, have been gutted this summer having scaled to new heights under Motta, with Arsenal taking Riccardo Calafiori off their hands.",
  "word_count": 865,
  "scraped_at": "2026-02-14T01:57:35.663469",
  "_text_extracted": true
}