{
  "article_id": "a4f2f91fc76c",
  "url": "https://dailynews.co.tz/azam-coach-highlights-community-shield-as-top-priority/",
  "title": "Azam Coach highlights Community Shield as top priority",
  "date": "20240806T080000Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Azam Coach highlights Community Shield as top priority\nDAR ES SALAAM: AZAM coach Youssouph Dabo has turned the team’s focus to the upcoming Community Shield match against Coastal Union at New Amaan Sports Complex in Zanzibar on Thursday.\nThe two teams will face off in the first semi-final game of the competition before the second semi-final match between Young Africans and Simba at Benjamin Mkapa Stadium on the same day.\nFollowing their 1-0 victory over Rayon Sports in a preparatory match at Amahoro National Stadium in Rwanda over the weekend, Dabo anticipates a challenging game.\nLusajo Mwaikenda secured the only goal of the match in a special encounter held to celebrate Rayon Sports Day.\n“Our attention is now on the Coastal Union game. We need to put in a lot of effort to produce good results as our opponents are equally strong,” Dabo remarked.\nWhen asked if he gleaned valuable insights from the match, he acknowledged that it provided a good test and commended the individual performances of his players.\nALSO READ: BASATA reveals 30 award categories for artists contest\n“The focus was on our performance both with and without the ball… We, along with my colleagues, are pleased with the output from these players. They are performing admirably,” he mentioned.\nRayon Sports coach Roberto Oliveira lamented wastefulness among his players, emphasising the need for improvement to capitalise on the chances they create.\n“We are creating goal-scoring opportunities but fail to convert… I believe we need quality strikers who excel at finishing,” he expressed.\nHe however lauded Azam for their impressive football display, recognising them as a competitive team capable of performing well in the upcoming CAF Champions League (CAF CC).\nRayon’s veteran, Haruna Niyonzima stated that playing against Azam was a valuable experience, insisting that they gained a lot from the encounter.\n“As you are aware, we are still in the process of building a competitive team, given that we have a new technical bench and new players.\nFacing Azam has provided us with a solid test,” said Niyonzima who had previously played for Young Africans and Simba SC in Tanzania.",
  "word_count": 352,
  "scraped_at": "2026-02-14T02:08:01.870480",
  "_text_extracted": true
}