{
  "article_id": "a4fa6f22bf42",
  "url": "https://www.con-telegraph.ie/2024/02/11/erik-ten-hag-says-scott-mctominay-an-example-to-others-after-match-winning-cameo/",
  "title": "Erik ten Hag says Scott McTominay an example to others after match - winning cameo",
  "date": "20240212T013000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag says Scott McTominay an example to others after match-winning cameo\nBy Simon Peach, PA Chief Football Writer\nErik ten Hag praised Scott McTominay as an example for others after the super sub sealed Manchester United’s belief-boosting win at fellow Champions League hopefuls Aston Villa.\nSunday’s clash between fifth and sixth at Villa Park began with Rasmus Hojlund – the winner when these sides met on Boxing Day – scoring in his fifth straight Premier League match.\nUnited lost their way after that 17th-minute opener in a bright start and Villa eventually secured a deserved second-half leveller through Douglas Luiz.\nBut the Red Devils dug deep and McTominay made it 2-1 in the 86th minute after meeting Diogo Dalot’s cross with a powerful header – his fourth Premier League goal this season from the bench.\n“This season, last season as well (McTominay made an impact), so I think he’s an example for many other players nowadays,” Ten Hag said of a player whose overall top-flight goal tally this term is seven this term.\n“There are not many players who can come from the bench and bring this energy. He’s ready for every minute, always contributing to the team. Football is a team sport and we forget that often.\n“But Scott is the example, always giving the spirit, in the week when he is training, doing the right things, working on himself, gives max.\n“He’s ready for one minute, he’s ready for 90 minutes, he’s always ready. I think it’s great to have such a player.”\nUnited rode their luck for large parts and Ten Hag appeared to indicate that Luiz’s shimmy goalscoring celebration fuelled his side in a win that breathes new life into their Champions League hunt.\nThe Red Devils are now five points behind Villa in fifth, and six adrift of fourth-placed Tottenham.\n“I think we can beat any opponent away or home,” the Dutchman said after winning a first Premier League away game to a top-eight side since taking charge.\n“But sometimes away we have to believe it more because then we could have won in Arsenal, where actually we deserved to win.\n“We could have won in Liverpool and it’s about belief and I think this team today believed they could win this game and that’s why I think, in the end, you win the game.”\nAsked about the impact of this result on the race for Champions League football, Ten Hag said: “We have to catch up.\n“We are firstly in February, many games to play, but we are returning. But, still, a long way to go and we have to improve our game.\n“But, of course, we are pleased that we get a series of wins.”\nThis was the first time this season that United have managed to win four consecutive matches in all competitions, while the remain unbeaten in 2024.\nAs for Villa, boss Unai Emery felt hard done by after his side slipped to a third straight home defeat in league and cup.\n“I want to tell you I am very proud of our work,” the Spaniard said. “I’m very proud as everything we planned before we more or less were doing on the pitch.\n“We were focused on a very good opportunity to make a big gap to them, but of course no win (for us).\n“We know how difficult this match was. Manchester United in the moment they are now and the last matches they won being confident.\n“But we had control of the game, we created more chances than them, we deserved it more than them, we conceded less chances than them.\n“They were clinical today, their goalkeeper was fantastic and we weren’t clinical.\n“We played, maybe along with the match against Manchester City here, the best match here this season.\n“Even from when we arrived here today, I think it was one of the best matches we’ve played but the result was not good and we have to accept it.”",
  "word_count": 664,
  "scraped_at": "2026-02-14T01:51:19.064558",
  "_text_extracted": true
}