{
  "article_id": "a50d7238c33f",
  "url": "https://theathletic.com/4538314/2023/05/22/liverpool-europa-league-jurgen-klopp-2/",
  "title": "Jurgen Klopp confident next Liverpool rebuild will not be ruined by Europa League place",
  "date": "20230522T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool’s six-year stay among Europe’s elite is effectively over.\nHaving become accustomed to the riches and the prestige of the Champions League during Jurgen Klopp’s reign, it is back to life in the Europa League next season.\nThere is no sugar-coating it. For the first time since 2015-16 — when Klopp took over from Brendan Rodgers two months into the campaign — Liverpool are set to finish outside the Premier League’s top four.\nAdvertisement\nA season that started with bullish talk of another title challenge will end with them missing out on what Trent Alexander-Arnold rightly described as “the bare minimum” requirement.\nKlopp faced up to that stark reality after Saturday’s emotion-fuelled 1-1 draw with Aston Villa at Anfield.\n“The whole season where for too long we were not good enough or ourselves,” he said.\n“We made it pretty exciting. I didn’t think that was possible seven weeks ago. The boys did really well in that period and our people enjoyed it. You could see they are not angry with us. They are looking forward to a new Premier League season and Europa League season.”\nA late push towards the Champions League spots — Liverpool have taken 23 points out of the last 27 — was always likely to be in vain. They left themselves with too much to do.\nBetween August and April, there were just too many insipid, error-strewn performances, too many injury setbacks, too many occasions they were overrun in midfield and when morale was sapped.\nHowever, what this recent run has done is inject some positivity going into the summer. You could sense that during Saturday’s traditional lap of appreciation following the final home match. It has been a season of frustration and regression but one ending with hope for the future — the faith in Klopp is unwavering.\nMajor changes are coming. Roberto Firmino, who enjoyed the dream farewell as he came off the bench to equalise in front of the Kop, was still signing autographs for fans three hours after the final whistle as he delighted them by stopping his car and getting out on Anfield Road. The long-serving Brazil forward had been reduced to tears by the affection for him.\nEvery angle of Roberto Firmino’s final Anfield goal ✨\nPresented by @Sonos 📽 pic.twitter.com/zVMYask9Ei\n— Liverpool FC (@LFC) May 21, 2023\nJames Milner, Alex Oxlade-Chamberlain and Naby Keita got the send-offs their contributions have merited. Now attention will turn to replacing them, with Brighton’s Alexis Mac Allister the top midfield target. The Argentina international would provide an injection of energy, quality and creativity to Klopp’s engine room.\nAdvertisement\nLiverpool will take a hit financially from missing out on the Champions League, but significant funds will still be made available to the manager. The situation demands it. The quartet who are moving on following the end of their contracts will free up in excess of £500,000 a week in wages.\nA special Anfield farewell ❤️ pic.twitter.com/2BabCYnf7d\n— Liverpool FC (@LFC) May 20, 2023\nKlopp is confident the lure of Anfield is such that potential signings will stomach some short-term pain in terms of no Champions League football in pursuit of long-term gain.\nSo how will he approach the Europa League? “We will make it our competition,” Klopp said.\n“I am not that spoilt. For so long we couldn’t even hear the sound of the Champions League, that’s how far away we were. The Europa League is absolutely fine. Let’s see what we can do.”\nThere is a school of thought that Liverpool, who were eighth in the table in mid-April, would have benefited from missing out on European qualification altogether.\nLess travel, fewer games, more time spent on the training field at their Kirkby training ground, which would have aided the process of new faces adjusting to their new surroundings. Antonio Conte’s Chelsea side won the Premier League title in 2016-17 when they had no continental distractions.\nHowever, Klopp has never seen it that way. For a start, just letting this season fizzle out was unthinkable. He knew the importance of lifting the gloom after such a bleak period and that has been achieved.\nLife in the Conference League would have been difficult to stomach, but the Europa League at least offers Liverpool another potential route back to the Champions League.\nReturning to the Thursday-Sunday cycle of matches isn’t ideal as inevitably you often find yourself playing catch-up domestically. But it does at least mean Liverpool will have fewer of the lunchtime Saturday kick-offs Klopp dreads.\nAdvertisement\nThe group stage is likely to provide opportunities for exciting youngsters such as Stefan Bajcetic and Ben Doak, with Klopp able to rotate and utilise his squad depth. That the 2024 final is in Dublin adds some extra spice given the size of Liverpool’s passionate Irish fanbase.\nEuropean football is part of the fabric at Anfield. Bill Shankly, Bob Paisley and Gerard Houllier all lifted the UEFA Cup and each of those triumphs were cherished.\nIt was the Europa League that launched Klopp’s reign with the run to the final in Basel in 2016, which included the dramatic quarter-final fightback against Borussia Dortmund and the memorable semi-final triumph over Villarreal.\nLiverpool swiftly moved on to bigger and better things. They were crowned champions of Europe in 2019 and reached three finals in the space of five seasons before February’s timid last-16 exit when they were outclassed by Real Madrid.\nNow they are back to where it all began. It is the poor relation, but with his glass half-full, Klopp will make the best of it.\nThey did not deserve to retain their Champions League status and only have themselves to blame — lessons need to be learned.\nA proper summer break and then a pre-season schedule Klopp has carefully constructed should help. So, too, the arrival of some fresh blood. The mission is to ensure Liverpool are well equipped so that their absence from Europe’s elite proves to be a short one.\n(Top photo: John Powell/Liverpool FC via Getty Images)",
  "word_count": 1003,
  "scraped_at": "2026-02-14T02:00:19.994353",
  "_text_extracted": true
}