{
  "article_id": "a50f66f2ede1",
  "url": "https://www.teamtalk.com/chelsea/boehly-primed-devastate-arsenal-plans-again-major-midfield-buy-shove-chelsea-flop-back-former-club",
  "title": "Boehly primed to devastate Arsenal plans again with major buy to shove Chelsea flop back to former club",
  "date": "20230316T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nBoehly primed to devastate Arsenal plans again with major buy to shove Chelsea flop back to former club\nA Chelsea midfielder is ‘likely to leave’ at season’s end and his spot could be taken by a priority Arsenal target the Blues are gearing up to snatch, per reports.\nDespite splashing out over half a billion pounds on new recruits over the last two windows, Chelsea’s squad remains very much a work in progress.\nA new centre-forward is clearly required given the Blues’ profligacy in front of goal this season. Elsewhere, Sky Germany’s Florian Plettenberg reported a new No 6 (central midfielder) is among their ‘top priorities’.\nThat update came when Plettenberg revealed loanee Denis Zakaria is unlikely to see the option in his deal taken up.\nThe Switzerland international, 26, cost £500,000 to sign on a season-long loan from Juventus, with the deal containing an option to buy worth £27m.\nZakaria has looked lively in the engine room when playing, though his chances thus far have been few and far between.\nIndeed, Zakaria has racked up just 526 minutes of action across all competitions for the Blues this season. The January arrival of Enzo Fernandez and imminent return of N’Golo Kante after a hamstring injury will ensure his situation doesn’t improve.\nPlettenberg tweeted Chelsea’s tendency at this stage is not to activate Zakaria’s option. As such, he’s destined to return to Turin when the loan concludes.\nBut despite barely featuring this term, a second Plettenberg update stressed Chelsea want to replace Zakaria with a higher calibre star who’ll make an instant impact in the eleven.\nChelsea bothering Arsenal again\nOn that front, the Sky Germany source added West Ham talisman and priority Arsenal target, Declan Rice, is in Chelsea’s sights.\nThe Athletic previously reported West Ham are internally resigned to losing Rice this summer. The 24-year-old has rejected multiple offers to extend his stay with the Hammers and is desperate to experience Champions League football.\nBarring a late-season surge, Arsenal will be the only club among the two capable of satisfying that demand next season. Man Utd, Man City and Liverpool have all drawn links with Rice, though he’s believed to favour remaining in London.\nFootball London recently reported Arsenal have ‘optimism’ they’ll be the ones to snatch Rice. West Ham value their midfield ace around the £100m mark, though if a bidding war doesn’t ensue, a deal could come cheaper.\nBut per Plettenberg, a bidding war is exactly what’ll transpire. The journalist noted Chelsea are ‘definitely’ in the race for Rice and are ‘highly interested’. He added it’s ‘confirmed’ the Blues will have a say in where Rice ends up.\nChelsea overpowered Arsenal in the January window when blowing them out of the water for Mykhailo Mudryk. The Gunners instead turned their attention to Leandro Trossard in what may wind up being the far savvier deal. Early indications certainly suggest that’s the case.\nThe Blues also muscled in on Arsenal’s pursuit of Moises Caicedo and tabled the higher bids of the two. Ultimately, the Seagulls refused to sell at any price in the winter window.\nRegardless, Chelsea are once again a threat to disrupt Arsenal’s plans in the market, this time over top summer target. Declan Rice.\nREAD MORE: Tottenham tipped to make shock move for senior Chelsea star as Levy prepares for veteran’s departure",
  "word_count": 561,
  "scraped_at": "2026-02-14T01:59:46.886493",
  "_text_extracted": true
}