{
  "article_id": "a511fbf1907c",
  "url": "https://www.geosuper.tv/latest/33458-fifpro-voices-concerns-over-afc-champions-league",
  "title": "FIFPRO voices concerns over AFC Champions League",
  "date": "20240219T131500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nFebruary 19, 2024\nThe global footballers' union FIFPRO said in a report Monday that the current Asian Champions League is \"unsustainable\", accusing the regional governing body of not listening to players and clubs.\nThe continent's top club competition has been in the limelight after Saudi teams roped in the likes of Cristiano Ronaldo, Neymar and Karim Benzema.\nThe round of 16 started on Tuesday last week, three days after the final of the Asian Cup, which was clinched by hosts Qatar.\nThe Asian Football Confederation (AFC) is in charge of both competitions, with teams from Australia to the Middle East and Central Asia.\nThe current Champions League is divided into two zones, \"West\" and \"East\", until a two-legged final home and away.\nDuring the next campaign, there will also be a geographical division at the start of the event, but the quarter-finals, semi-finals and final will take place in Saudi Arabia.\nFIFPRO said this changed version, which will see the winner bag $12 million, was also unsustainable.\nTakuya Yamazaki, FIFPRO's chairman for Oceania-Asia, hopes its report will \"spark meaningful discussions with governing bodies, leagues, clubs and fans\" about the Champions League.\n\"The results indicate that, as anticipated, the merits do not outweigh the drawbacks for most players and clubs, making it an unsustainable system,\" he said in the report.\nFIFPRO accused the AFC of adopting \"a top-down approach that excludes the voices of players and clubs from decision-making\".\nIt called on the AFC to forge \"a genuine partnership with players, clubs and leagues to ensure that the competition delivers for all parties\".\nThe report added that the average quality of teams in the Champions League was lower to the top domestic divisions in Japan, South Korea and Saudi Arabia.\nIt said the average quality of the competition was also on a downward trend.\nFIFPRO also has reservations about the economic cost for teams, bearing in mind long travel sometimes involved, and the effect of travel and match scheduling on players’ workload.",
  "word_count": 334,
  "scraped_at": "2026-02-14T01:48:39.897252",
  "_text_extracted": true
}