{
  "article_id": "a515e26fae85",
  "url": "https://www.arsenal.com/news/fpl-focus-chips-europe-and-form-gunners",
  "title": "FPL Focus : Chips , Europe and in - form Gunners",
  "date": "20251127T154500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Following our fifth victory in as many Champions League fixtures against Bayern Munich, attention quickly returns to the Premier League.\nWith Mikel Arteta’s men preparing to take on second-placed Chelsea at Stamford Bridge this Sunday, Fantasy Premier League is back for Gameweek 13.\nEZE on the charge\nLast Sunday’s 4-1 hammering of Tottenham Hotspur in the north London derby saw numerous Gunners haul with healthy points totals for GW12 - none more so than Ebere Eze.\nOur no.10 delivered for his many managers with a gargantuan 20 points, courtesy of his stunning hat-trick, which saw him become only the fourth-ever player to bag a treble in the NLD.\nConsequently, Ebere now ranks second this week for incoming transfers, with over 300,000 FPL bosses flocking to snap up our England ace, his price now having risen to £7.7m.\nAlmost 200,000 teams have now brought in Jurrien Timber (£6.3m), who has now surpassed the 30% ownership barrier thanks to his 72 points so far this term. Jurrien has added a goalscoring touch to his excellent defensive qualities this year, and headed home the opener against Bayern Munich in the Champions League on Wednesday night.\nSunday’s clash with Chelsea sees multiple success stories from Fantasy Football this season come face-to-face.\nMikel Merino has led the line in recent weeks and is available as a smart differential option, with a price of £5.9m and an ownership remaining at just 1%. Other differentials for the Gunners include Martin Zubimendi, whose defensive capabilities may have seen him overlooked by FPL managers since his arrival - but the Spaniard has now hit 50 points in his debut Premier League campaign, and is owned by fewer than 3% of teams with just a £5.4m price tag.\nFor our opponents in blue, several players have been popular choices for FPL teams all over the world. Leading the way for Chelsea is defender Trevoh Chalobah (£5.1m), whose clean sheet against Burnley in GW12 saw him hit 61 points thus far.\nJust one point below Chalobah is Pedro Neto, who has now hauled 40 points in his last five Gameweeks. Registered in-game as a midfielder, the £7.1m star has scored in each of his last two in the league, and like Chalobah, remains owned by fewer than 10% of Fantasy squads.\nTIME TO PLAY A CHIP?\nEvery week right now appears to present a golden opportunity to play one of your four Chips for the first half of the season.\nThis week, Free Hit and Triple Captain each stand out as potential points-boosters. GW13 could appeal for a Free Hit due to the contrast in fixtures for several clubs over the upcoming two Gameweeks.\nFor instance, you may be unconvinced by your Chelsea assets ahead of our trip to Stamford Bridge, but want them back when they take on Leeds United in GW14. This could then open up an opportunity to temporarily replace them with players from Aston Villa or Brentford, for one week only.\nVilla host winless bottom side Wolves this weekend, but then face a tricky trip to Brighton & Hove Albion in GW14 - the midweek round of fixtures pencilled in for next week. Brentford, whose striker Igor Thiago (£6.5m) is the only man to top Eze for transfers in since GW12, host Burnley this weekend before coming to Emirates Stadium next Wednesday.\nWhile historically the Triple Captain chip has been reserved for the inevitable Double Gameweeks which present themselves later on in the season, the extra TC chip to be played before GW19 essentially provides a roulette spin on treble points for your skipper in a single match before the New Year.\nSome have played the chip already - an overwhelming majority opting for Erling Haaland (£14.9m) when he salvaged a haul with a late brace against Burnley back in September.\nHowever, Haaland and his Manchester City side - aiming to respond to defeats by Newcastle United and Bayer Leverkusen in recent days - host third-bottom Leeds in GW13. If unconvinced due to the fixture pile-up and potential management of minutes, Haaland also has a GW17 fixture at home to West Ham United, whose defensive record is currently inferior to all but Wolves, without another Premier League or European fixture immediately afterwards.\nThiago could be a brave choice for Triple Captain this week, having hit five in as many Gameweeks. The striker’s four-point total against Brighton last time out is somewhat misleading, as his injury-time penalty miss cost him up to nine more points: minus two for the miss, four for the would-be goal, and a likely three bonus points having already scored earlier in the game.\nIf holding out to Triple Captain an Arsenal star before the deadline of GW19, there are seven opportunities remaining to do so. Also make sure to keep your eyes peeled here on Arsenal.com for news of any imminent fitness returns for our Gunners.\nEUROPEAN ROTATION\nWhen planning their squad, some managers may prefer to focus on a rigid starting XI with vaguely-considered substitutes making up the numbers.\nWhile this method usually yields a stronger first XI and likely avoids the agony of leaving a player benched during an unexpected points haul, it comes with a huge asterisk - and that is potential of injury, suspension or rotation. This can often enforce quickfire transfers, some of which will incur a hit of minus-four points.\nAn advisable strategy is to possess 15 players who play as many minutes each Gameweek as possible - though after clubs have been involved in European action, predicting line-ups can be a minefield.\nFor example, Liverpool take on West Ham this weekend and despite the form of the Reds, their prized assets will continue to appeal to many FPL bosses. However, their Champions League contest against PSV Eindhoven on Wednesday means players will be under significant load management with the games coming thick and fast, as is the case with every elite side.\nThe same crucially applies to Aston Villa, Nottingham Forest and Crystal Palace, whose European exploits come on Thursday nights, meaning a shorter turnaround time for a return to domestic football. With Villa hosting Wolves, and Palace and Forest each offering some appealing assets ahead of their respective home showdowns with Manchester United and Brighton, be sure to study your targets’ minutes in Europe before making any sharp commitments - or you may find your most reliable stars rested.\nAs well as ourselves and Liverpool - plus the trio competing in the Europa League and Conference League on Thursdays - Chelsea, Manchester City, Tottenham Hotspur and Newcastle United are also involved in European competition in 2025/26.\nThe transfer and team selection deadline for Gameweek 13 is this Saturday at 1:30pm UK time. Be sure not to miss the cut, and keep an eye out for our next edition of FPL Focus coming early next week before the midweek GW14 action!\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1172,
  "scraped_at": "2026-02-14T02:03:26.521949",
  "_text_extracted": true
}