{
  "article_id": "a521c227ffa4",
  "url": "https://metro.co.uk/2023/03/29/tottenham-who-is-julian-nagelsmann-the-german-manager-linked-with-spurs-18524228/",
  "title": "Tottenham : Who is Julian Nagelsmann ? The German manager linked with Spurs | Football",
  "date": "20230329T163000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Highly-rated German manager Julian Nagelsmann has been linked with the managerial vacancy at Chelsea, who have sacked Graham Potter after less than seven months in charge.\nAccording to reports, Nagelsmann is indeed interested in taking up the reigns at Stamford Bridge, but the Premier League side may have a fight on their hands to convince him to make the move now rather than in the summer.\nThe 35 year-old, who has also allegedly drawn interest from rivals Tottenham, is regarded as one of the most promising young managers around with his energetic and modern style of play.\nBut who exactly is the coach receiving plenty of looks of admiration from the Premier League? Here is everything you need to know.\nWho did Julian Nagelsmann play for?\nHaving grown up in Bavaria, Nagelsmann played youth football for Augsburg and 1860 Munich.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIn the 2006/07 season, Nagelsmann was part of Munich’s second team but he made no appearances due to struggles with injury.\nThe German returned to Augsburg in 2007/08 where he was managed by former Chelsea boss Thomas Tuchel.\nHowever, after injuring his knee and meniscus for the second time, Nagelsmann decided to end his playing career at the age of just 20.\nWhich clubs has Julian Nagelsmann managed?\nHaving retiring as a player, Nagelsmann stayed on at Augsburg as a scout in the first half of 2008.\nAlongside a spell at university studying business administration and sports science, Nagelsmann returned to 1860 Munich as an assistant for the U17 team between 2008 and 2010.\nHe joined Hoffenheim as a youth coach in 2010, where he won the Bundesliga U19 title in the 2013/14 season and earnt the nickname ‘Mini Mourinho’.\nNagelsmann was promoted as Hoffenheim’s manager in October 2015 with his tenure set to begin at the start of the following season, with his appointment at the age of 28 making him the youngest manager in Bundesliga history.\nHowever, Nagelsmann took the reigns earlier than planned after Huub Stevens was forced to resign as manager due to ill health in February 2016.\nUnder his guidance, Hoffenheim won seven of their final 14 games to steer themselves away from relegation danger – finishing just one point above the relegation play-off spot.\nThe team’s strong from rolled over to the following season with a fourth placed finish to qualify for the Champions League for the first time in their history.\nHoffenheim were beaten by Liverpool in the play-off round and they dropped into the Europa League, but a third placed finish in the Bundesliga that season saw them seal a spot straight through to the group stage for the following year.\nAt Hoffenheim, Nagelsmann became the youngest coach to manage in the Champions League aged just 31, but he left the club in 2019 to join RB Leipzig.\nIn his first season, he guided Leipzig into the knockout stages of the Champions League for this first time in their history before being dumped out in the semi-finals to Tuchel’s PSG.\nMore Trending\nBayern Munich poached Nagelsmann from Leipzig for a then world record managerial transfer fee of £22m ahead of the 2021/22 season.\nThe manager won the Bundesliga and German Supercup titles in his first season in charge, although a shock exit to Villarreal in the Champions League quarter-finals took the shine off proceedings, and a second Supercup was duly added at the start of this campaign.\nBut despite reaching the quarter-finals of the Champions League and sitting only one point behind Borussia Dortmund in the Bundesliga, Nagelsmann was sacked during the March international break with the Bayern hierarchy citing inconsistency in performance as the reason behind the dismissal.\nMORE: Alan Shearer slams ‘stupid’ Chelsea transfer policy after Graham Potter sacking\nMORE: Frankfurt boss Oliver Glasner on Chelsea’s shortlist to replace Graham Potter\nFollow Metro across our social channels, on Facebook, Twitter and Instagram\nShare your views in the comments below",
  "word_count": 703,
  "scraped_at": "2026-02-14T02:09:52.187668",
  "_text_extracted": true
}