{
  "article_id": "a52e80075e07",
  "url": "https://www.espn.com/espn/story/_/id/43791213/azeez-osula-tijani-win-big-fa-cup-semenyo-targets-wembley-glory",
  "title": "Azeez , Osula , Tijani win big in FA Cup , Semenyo targets Wembley glory",
  "date": "20250211T091500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "African -- and specifically, Nigerian -- players were at the heart of some of the big FA Cup storylines of the weekend across England, with Muhamed Tijani, Femi Azeez and William Osula all through to the next round.\nThere was also joy for Ghana's Antoine Semenyo, whose opener against Everton halted David Moyes' Goodison Park renaissance in its tracks and has left the Black Star dreaming of Wembley glory.\nThere aren't too many African countries which have produced players who have had as big an impact, as consistently, in the FA Cup as Nigeria. Super Eagles players past and present such as Alex Iwobi, Celestine Babayaro and Victor Moses have got their hands on the oldest club competition in the world, while Daniel Amokachi and Kelechi Iheanacho both made major semifinal contributions en route to Everton's success in 1995 and Leicester City's four years ago.\nJohn Obi Mikel and Nwankwo Kanu, each with three cup wins to their name, are also among the most decorated players in the competition's history.\nIt remains to be seen whether another Nigerian player will add their name to the storied list of Super Eagles winners this term, although already, as we come to the end of the Fourth Round, several players from the West African nation have already left their mark on this year's edition.\nAmong them is towering forward Tijani, who was part of the Plymouth Argyle side who dispatched Premier League leaders Liverpool 1-0 in one of the FA Cup's biggest ever giant-killings.\nThe 24-year-old only arrived in English football on loan from Slavia Prague in July, and has endured a miserable time since joining Plymouth, with a hamstring tear in October limiting him to just four appearances in the Championship.\nFurthermore, the manager who brought him to England -- Wayne Rooney -- was dismissed by Plymouth in December, leaving Tijani facing something of an uncertain future under incoming boss Miron Muslic.\nHis introduction as a substitute, with 72 minutes on the clock of this weekend's meeting at Home Park, was only his fifth outing for the Pilgrims, and only his second since injury sidelined him for the best part of four months.\nOnly last week, the attacker shared a video of his road to recovery on Threads, including clips of him undertaking an MRI scan, hobbling on crutches though a hospital corridor, and working alone on his rehabilitation programme in Plymouth's gym. Against this backdrop, his contribution to a famous victory, albeit in a cameo role, must have tasted sweet.\nTijani even had an opportunity to double the hosts' lead after Ryan Hardie had given Plymouth the lead with a first-half penalty, but showed his ring rust as he failed with an attempted diving header that should have troubled Caoimhin Kelleher.\nNonetheless, the Kaduna-born forward can now look forward to a Fifth Round tie -- and the prospect of further glory -- while Tijani, who has spent the entirety of his playing career to date in Czechia, can begin to prove that he can be the target man Argyle crave to drag themselves out of danger.\n27-year-old Sierra Leone international Mustapha Bundu also featured for Plymouth -- and enjoyed the better of Kostas Tsimikas during some early exchanges -- while Malachi Boateng and Matthew Sorinola also featured for the hosts.\nWhile Mohamed Salah was not included in Liverpool's matchday squad, African youngsters Isaac Mabaya, Trey Nyoni and Trent Kone-Doherty did feature. Will any of them get much more senior playing minutes this term given the Reds' early cup exit? Another Nigerian star strolling into the Fifth Round is Millwall's Femi Azeez, whose double at Elland Road saw the Lions past Championship leaders Leeds United.\nAzeez, the brother of former Arsenal midfielder Miguel, enjoyed his finest showing as a Millwall player following a testing first few months at the Den.\nHe's only scored once in 22 Championship outings before this one, but his double sent the Londoners into the Fifth Round for the first time since 2019 and inflicted a first home defeat on Leeds since September.\nReturning from injury, Azeez picked up possession on the left flank on the half-hour mark, cut inside and sent a right-footed effort - taking a fierce deflection off Josuha Guilavogui - beyond Karl Darlow in the Leeds goal.\nThe wideman's second was a searing left-footed effort -- soon after the restart -- as his powerful effort beat Darlow at his near post.\n\"Femi gives us something we currently didn't have in the side, which is his raw pace in terms of looking to get him behind,\" Millwall head coach Alex Neil told journalists after the match. \"He offers that threat where he can get in behind.\n\"The first one's a bit fortunate, obviously takes a deflection and flips into the far corner, but after I thought he had a really good strong performance.\"\nThe third Nigerian to have stolen the show during Fourth Round proceedings is Newcastle United's Osula, who's been forced to bide his time in the Premier League this term, playing for just 44 minutes across seven league outings under Eddie Howe.\nHe's unlikely to dislodge Alexander Isak any time soon, but his FA Cup showing in the Magpies' 3-2 victory at Birmingham City was evidence of his capabilities, admittedly against third-tier opposition, and demonstrated the versatility that should make him such a valuable asset for the European hopefuls.\nOsula, who plays for Denmark at youth level but remains eligible for Nigeria via his father, carved the Blues open with two assists inside a frantic five minutes at St. Andrew's.\nFirst, in the 21st minute, he sent Callum Wilson's cross back across goal for Joe Willock to equalise at the second attempt. Moments later, the Magpies were ahead, Osula beginning the move by controlling a long ball from Nick Pope with a deft touch before crossing in for Willock. Neither Willock nor Osula could apply the finishing touch, but the wideman's deflected effort fell into the path of Wilson, who made no mistake.\nIt was a truly vibrant display from Osula, who was a threat in the air and whose three created chances weren't bettered by anyone else on the pitch.\n\"I thought he was an outlet for us, his pace and strength and directness was key for us in that first half and us finding our way back into the game,\" Newcastle head coach Howe told journalists.\n\"He's still got some areas of his game that needs development, but he's certainly moving in the right direction and he's unlucky not to score.\"\nWith Miguel Almiron having been sold to Atlanta United during the transfer window, Newcastle may find themselves short in attacking wide areas during the run-in, and on the basis of this weekend's evidence, Osula could well have a role to play as they look to return to the Champions League.\nFinally to Goodison Park, where Everton's fine recent form -- inspired by the excellence of Iliman Ndiaye and Beto -- was stopped abruptly by a business-like Bournemouth who made light work of the hosts.\nAt the heart of their display was Ghana's Semenyo, whose rumoured suitors -- Chelsea, Manchester United, Liverpool -- will surely have been impressed by his latest star showing against the Toffees.\nIt was Semenyo who opened the scoring for the visitors, netting emphatically from the penalty spot beyond England's Jordan Pickford after he had himself been brought down by the out-of-sorts James Tarkowski.\nSemenyo's no-look run-up to score, coupled with his thunderous finish, were evidence of a player at the absolute pinnacle of his game right now.\nThis was one of Tarkowski's poorest performances this season, due primarily to Semenyo's pace, sharp movement and confidence in possession, and it was the Ghanaian -- harassing the centreback after the break -- who forced him into a hurried clearance that was picked up by Marcus Tavernier who played in Daniel Jebbison to kill the contest.\n\"[The FA Cup] would be the cherry on top of the cake for us,\" Semenyo said. \"We know we're doing well this season.\n\"The manager finds [a cup run] very important, all of us as individuals find it important,\" he added. \"It [would] be lovely to reach a semifinal where we're playing at Wembley.\n\"This is a dream of mine personally, and I think for the team, we'd love to have a cup run and see how far we can go. We just have to wait and see.\"",
  "word_count": 1405,
  "scraped_at": "2026-02-14T01:52:15.342361",
  "_text_extracted": true
}