{
  "article_id": "a573710c376d",
  "url": "https://www.90min.com/ange-postecoglou-rages-tottenham-foundations-arsenal",
  "title": "Ange Postecoglou rages at Tottenham  foundation after Arsenal chants",
  "date": "20240515T110000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ange Postecoglou rages at Tottenham 'foundations' after Arsenal chants\n- Tottenham lost 2-0 to Man City on Tuesday\n- Many Spurs fans wanted their own team to lose to help stop rivals Arsenal winning title\n- Ange Postecoglou hinted at his extreme displeasure of this sentiment\nBy Sean Walsh\nFROM TOTTENHAM HOTSPUR STADIUM - Ange Postecoglou said the foundations of Tottenham are 'fairly fragile' following their 2-0 defeat to Manchester City on Tuesday.\nSpurs put up a spirited fight but their hopes of qualifying for the Champions League ended following the loss.\nHowever, they were beaten by reigning champions City, who moved two points clear of Arsenal at the top of the Premier League table with only one round of fixtures remaining.\nThe rivalry between Tottenham and Arsenal saw many Spurs fans claim they would prefer to see their side lose to City in order to spite their neighbours from the Emirates Stadium.\nPostecoglou refuted such a notion in his pre-match press conference, but anti-Arsenal songs were chanted throughout Tottenham's loss to City.\nSpeaking to the press post-match, Postecoglou admitted that the atmosphere was 'different' in spite of a spirited performance from his players.\nWhen it was put to Postecoglou that he could at least see the foundations of what he's trying to build ahead of next season, he grumpily replied: \"No, I think the last 48 hours has revealed to me that the foundations are fairly fragile, mate. That's just what I think.\"\nWhen further pushed on whether he was referring to the atmosphere, he added: \"I just think the last 48 hours have revealed a fair bit to me. That's alright. It just means I've got to go back to the drawing board with some things....outside, inside, everywhere. It's been an interesting exercise.\"\nPostecoglou was grilled by several journalists asking whether he was digging out the players, to which he retorted: \"It's just my observations, mate. I'm not going to tell you, because it's for me. I'm the one who's got to do it. You can make your own assessments of what's happened. I understand. I probably misread the situation as to what I think is important in your endeavour to become a winning team, but that's OK. That's why I'm here.\n\"I'm just not interested [in the Arsenal rivalry] mate. Maybe I'm out of step, but I just don't care, I just want to win. I want to be successful at this football club, it's why I was brought in. So what other people, how they want to feel, and what their priorities are, are of zero interest to me. I know what's important to build a winning team, that's what I need to concentrate on.\"\nAn increasingly annoyed Postecoglou then hinted that he was indeed speaking about the fans when asked if the atmosphere had an impact on the players.\n\"Of course it does,\" he said. \"It is what it is. I can't dictate what people do. They're allowed to express themselves any way they want. But yeah, when we've got late winners in games it's because the crowd's helped us.\n\"I already know what I want to do, it's just I've got to make some adjustments to how I do it.\"\nTo wrap up the press conference, Postecoglou suggested his players' application was not to blame for his foul mood.\n\"Well I think, unless I was watching a different game, we matched it with the best team in the land for the last four years, unless someone saw it differently,\" Postecoglou said.\n\"Why wouldn't I be happy if we've matched the team that is kind of the benchmark? I don't understand. So, yeah I was happy with the application. Of course I was. That was evident.\"",
  "word_count": 621,
  "scraped_at": "2026-02-14T02:25:33.991288",
  "_text_extracted": true
}