{
  "article_id": "a5a28b17cca3",
  "url": "https://www.90min.com/posts/pep-guardiola-injury-updates-key-players-ahead-of-facing-arsenal",
  "title": "Pep Guardiola gives injury updates on key players ahead of facing Arsenal",
  "date": "20240329T213000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola gives injury updates on key players ahead of facing Arsenal\n- Kyle Walker & John Stones ruled out Man City vs Arsenal\n- Both defenders suffered injuries during international break\n- Kevin De Bruyne, Jack Grealish & Ederson could all return\nKyle Walker and John Stones have been ruled out of Sunday's huge Premier League clash with Arsenal, but both Kevin De Bruyne and Jack Grealish could be involved.\nEderson is also expected to return in the Manchester City goal after being ruled out since the 1-1 draw with Liverpool earlier this month. There are no lingering doubts over Manuel Akanji either.\n\"Kyle's [injury is] more tough than John's but they will be out...I don't know for how many games. [Ederson is] much better,\" Pep Guardiola explained at a press conference on Friday.\nHaving led England out as captain for only the second time, Walker had to be substituted after just 20 minutes against Brazil due to a hamstring problem. Stones played the full game but was then an early casualty himself a few days later only ten minutes into the Belgium clash.\nStones has already missed plenty of football this season due to a hip injury at the start of the campaign, but the 29-year-old has started six of City's last eight Premier League games and so his absence against Arsenal comes as a blow for the reigning champions.\nWalker is even more of a miss, starting 25 of 28 Premier League fixtures so far in 2023/24 and taking over the captaincy when De Bruyne was ruled out for five months between August and January.\nDe Bruyne missed the FA Cup quarter-final win against Newcastle United before the international break and then didn't link up with Belgium either. But he trained on Thursday, giving him a few days to build his fitness before the Arsenal game. Grealish was also present on the training pitch, having not been seen since 13 February off the bench in the Champions League against Copenhagen.\nOnly one point separates the entire Premier League top three at this advanced stage of the season. Arsenal lead the way on goal difference from Liverpool, with City a point back in third place. Liverpool are in action against Brighton & Hove Albion earlier on Sunday and will hope to be three points clear by the time kick-off at the Etihad Stadium happens. If Liverpool have won, a draw doesn't really help either City or Arsenal with so few games left and little to no margin for error.\nCity are targeting a fourth successive title, something which has never happened in 136 years of league football in England. Meanwhile, Arsenal want their first title in 20 years.",
  "word_count": 450,
  "scraped_at": "2026-02-14T02:20:27.920042",
  "_text_extracted": true
}