{
  "article_id": "a5f2c209649c",
  "url": "https://www.arsenal.com/news/20-years-henry-becomes-our-greatest-goalscorer",
  "title": "20 years on : Henry becomes our greatest goalscorer",
  "date": "20251019T103000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On October 18, 2005, we travelled to Prague for a Champions League clash that would go down in history as the moment Thierry Henry became our all-time leading goalscorer.\nThe French forward was sitting just one goal behind the legendary Ian Wright before our game against Sparta Prague, but having missed the last seven games with a groin injury, few had pencilled in our trip to the Czech capital as the night for Thierry to write his name into the record books.\nHowever, a double befitting of the forward's ability meant we walked away with more than just three points that night. Here's how it all went down and the reaction to his iconic moment 20 years ago:\nBench Boost\nWe headed to mainland Europe amidst some patchy away form, having let a 1-0 lead slip through our grasp at West Bromwich Albion just three days prior. Seven games had passed since Henry's groin injury; in that time, we had also lost to Middlesbrough and drawn with West Ham United.\nHowever, as our league form stuttered, our Champions League run was just beginning. A dramatic late win over FC Thun and a steely 2-1 victory over Ajax in Amsterdam meant we headed to Prague looking for three wins from three in what would turn out to be a memorable journey to the Champions League final.\nSo it was a welcome boost to the fans who travelled to Prague to see Thierry among the substitutes for the clash. While Arsene Wenger admitted he wanted to give Thierry the final 20 minutes to ease him back in, there was no time for that as 15 minutes into the game, Jose Antonio Reyes was forced off after a late challenge. Enter, Thierry Henry.\nJust six minutes later, the ball was in the back of the net and of course, it was another Henry classic.\nA long ball over the top from Kolo Toure picked out the Frenchman, who brought the ball down beautifully with his right foot, allowing him to turn to face goal before curling his effort with the outside of the boot into the far corner.\nOne down, one to go.\n\"Nobody was expecting me to play\"\n\"Lovely ball for Thierry Henry, this could be the moment... it is! Record breaker, history maker. Thierry Henry is Arsenal's record goalscorer.\"\nThe words of commentator Rob Hawthorne will live long in the memory as Robert Pires' incredible curling ball found the forward, who latched on to the pass before firing his effort beyond goalkeeper Jaromir Blazek.\nThe goal was Henry's 186th for us, taking him above Ian Wright's record, which had stood since September 1997.\nFollowing his milestone moment, Thierry told us back in 2005 that the feeling was unusual, as he hadn't expected to play, let alone break Wright's record.\nHe said: \"The thing that was kind of strange is that I did it the day that no one was expecting me to play or to come on. So, I played, I came on and obviously I did it. I was just over the moon.\"\n\"He'll go down in history\"\nFollowing his 185th and 186th goals for the club, Wenger heaped praise on his forward, who he had helped shape from a winger into a devastating forward.\n\"Thierry didn't expect to break the record tonight and didn't even expect to be on the pitch,\" said Wenger. \"But I felt he wanted so much to score that he tried from everywhere and his class allowed him to score a great first goal.\n\"The record is something exceptional and you have to respect that he beat it in a relatively short time. He was not especially a goalscorer at the start [of his Arsenal career] - he was an all-round player, not hunting in the box for goals. It is nearly inexplicable that a guy who is not really interested only in scoring goals can score so many. He'll go down in the history not only of Arsenal but of football.\"\nShortly after the record-breaking moment, former full-back Lee Dixon compared Wright and Henry, having played with the pair during his time in N5.\nHe told BBC Sport at the time: \"I really didn't think Wright's record would be broken.\n\"When Thierry arrived at Arsenal there was a bit of mystery about where he was going to play. He was playing left wing at Juventus, but we heard rumours that Arsene Wenger was going to play him up front.\n\"Although it took a little time, the boss remained patient and the players did, too. And Thierry exploded into a goalscoring machine. He has become the complete centre-forward — he is unmarkable.\n\"Had they [Henry and Wright] actually played together for the club, there's little doubt they would have become even closer friends. And on the pitch, I'm sure Thierry looked at Wrighty's game and it helped him develop into a better player.\"\nThierry would go on to score 228 times for us over two spells, with his final games - and of course goals - coming during a short loan stint in 2012.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 876,
  "scraped_at": "2026-02-14T01:52:49.022935",
  "_text_extracted": true
}