{
  "article_id": "a5ff93794fe0",
  "url": "https://www.myjoyonline.com/2024-ballon-dor-man-citys-rodri-tipped-to-win-ahead-of-vinicius-jr/",
  "title": "2024 Ballon dOr : Man City Rodri tipped to win ahead of Vinicius Jr . ",
  "date": "20241028T170000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nManchester City midfielder Rodri is widely tipped to win the 2024 men’s Ballon d’Or tonight, beating Real Madrid’s Vinicius Jr. to the award.\nAccording to seasoned football journalist Fabrizio Romano, Real Madrid believes that the award, initially expected by many to go to Vinicius Jr., will instead be given to Rodri.\nRomano shared on his Facebook page, “Vinicius Jr.’s entourage are now convinced that the Real Madrid forward will not be named as Ballon d’Or winner. Everyone in Madrid has this feeling.”\nRomano further noted, “Vinicius Jr will not travel to Paris as he will not win the Ballon d’Or. No one from Real Madrid will attend the ceremony. No Florentino Pérez, no Vini Jr, no Carlo Ancelotti, no Jude Bellingham in Paris today as decided by the club.”\nVinicius Jr. had been viewed by many as a favorite for the award after an impressive 2023-24 season, where he scored 24 goals and helped Real Madrid secure three trophies, including La Liga and the Champions League. He notably scored six goals in the Champions League, including one in the final against Borussia Dortmund.\nIf Rodri secures the Ballon d’Or, it will recognize his exceptional season with Manchester City, where he won his fourth consecutive Premier League, as well as his role in helping Spain capture the UEFA Euro title. He would also be the first Premier League player to win the award since Cristiano Ronaldo in 2008.\nDespite being ruled out for the rest of the season due to injury, Rodri has already arrived in Paris for the ceremony.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n11 seconds -\nAquafresh donates to National Chief Imam ahead of Ramadan\n25 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n27 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n2 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 486,
  "scraped_at": "2026-02-14T02:14:47.092433",
  "_text_extracted": true
}