{
  "article_id": "a60556c740d4",
  "url": "https://www.themag.co.uk/2023/10/3-positives-and-3-negatives-to-take-from-newcastle-4-psg-1-newcastle-united/",
  "title": "3 Positives and 3 Negatives to take from Newcastle 4 PSG 1",
  "date": "20231005T144500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "3 Positives and 3 Negatives to take from Newcastle 4 PSG 1\nWednesday’s match ended Newcastle 4 PSG 1.\nAhead of each match we ask one of our writers to come up with three positives and three negatives following the game.\nA truly remarkable match…\nOn this occasion it is David Punton:\nPOSITIVES\nHistory boys\nA famous win that will live long in the memory and go down in local folklore.\nThe night that we beat Paris Saint-Germain 4-1… and comfortably too.\nIt was a massive occasion and you could sense it in the air all day and as the 8pm kick off loomed large.\nWe’ve defeated stellar opponents. A side boasting the world’s best player in Kylian Mbappe. Not to mention Ramos and Dembele also in the visitor’s front line.\nThey seemed complacent and got caught out big time.\nEvery player in black and white played their part – and we delivered that win despite several players being out injured.\nQuite remarkable. We now top the group and it’s very much game on as to who gets through to the last sixteen.\nFans, manager, players – all magnificent.\nIt was a white hot atmosphere which showcased our club to a global TV audience.\nThe comeback kid\nJamal Lascelles was brilliant last night. From his point of view it couldn’t have gone any better.\nHe’s come back into the side following month after month on the bench and has delivered one of his best performances for the club.\nThis was the Lascelles who flourished under Rafa Benitez.\nHe led that club through some bad times after Rafa quit and he’s had to be patient since the takeover, what with new players arriving.\nFair play to the guy – he did his job last night and that should never be forgotten.\nYou’ll never beat Dan Burn\nOne of the best tweets I saw last night simply said: “They spent so long wondering how Dan Burn would handle PSG that they didn’t stop to consider how PSG would handle Dan Burn.”\nWhat better summary of the man from Blyth, who TNT Sports said was from Ashington.\nBurn is a warrior who has worked his way right up football’s pyramid.\nThat was the pinnacle for him against PSG. His height makes him impossible to mark at set pieces and he’s always likely to get on the end of something.\nA local hero.\nMidfield mastery\nUnited were able to get a grip in midfield.\nBruno was class and then Sean Longstaff did the damage just after half time with that darting run and finish. The power on the shot doing enough to squirm under Donnarumma – one of the world’s best goalkeepers.\n(ED: NB 4 and not 3 positives this time… fair enough!)\nNEGATIVES\nFlashpoints\nSome flashpoints with the PSG fans as they marched to the ground.\nPlaying through\nPSG played through us a bit too easily at times and in the second half we looked out of steam.\nThreadbare\nOur bench looked threadbare.\nNo striker option and the only back up centre back was Paul Dummett.\nStats from BBC Sport:\nNewcastle 4 PSG 1 – Wednesday 4 October 8pm\nGoals:\nNewcastle United:\nAlmiron 17, Burn 39, Longstaff 50, Schar 90+1\nPSG:\nHernandez 56\n(Half-time stats in brackets)\nPossession was PSG 73% (69%) Newcastle 27% (31%)\nTotal shots were PSG 11 (4) Newcastle 12 (8)\nShots on target were PSG 2 (0) Newcastle 8 (4)\nCorners were PSG 8 (4) Newcastle 1 (1)\nNewcastle United:\nPope, Trippier, Lascelles, Schar, Burn, Longstaff, Bruno, Tonali (Anderson 65), Almiron (Murphy 71), Isak, Gordon (Targett 90+3)\nUNUSED SUBS:\nDubravka, Karius, Dummett, Hall, Livramento, L.Miley\n(A thing of beauty is a joy forever – Now, bring on the Germans! Read HERE)\n(Newcastle 4 PSG 1 – Instant NUFC fan / writer reaction – Read HERE)\n(Newcastle 4 PSG 1 – Champions League, we’re having a laugh! Read HERE)\n(Newcastle 4 PSG 1 – Match ratings and comments on all of the NUFC players – Read HERE)\n(Luis Enrique struggling to come to terms with biggest ever(*) PSG Champions League defeat in group stage – Read HERE)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 701,
  "scraped_at": "2026-02-14T02:10:28.713270",
  "_text_extracted": true
}