{
  "article_id": "a65ded5e34db",
  "url": "https://metro.co.uk/2026/02/02/arsenal-agree-surprise-deadline-day-deal-championship-defender-26674631/",
  "title": "Arsenal agree surprise deadline day deal for Championship defender",
  "date": "20260202T213000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have made a transfer deadline day signing as they have snapped up teenage defender Jaden Dixon from Stoke City.\nThe 18-year-old started his career with Tottenham, but moved north to join Stoke in 2023, making his professional debut a year later.\nOpportunities in the first team under Mark Robins have proved difficult to come by, but Dixon has picked up international experience.\nThe defender has been capped up to Under-19 level for England, making his debut for that team last year.\nThe teenager now makes a huge step up to Arsenal, signing a four-year deal with the Premier League leaders.\nTransfer expert Fabrizio Romano reports that the Gunners have paid an initial £3.2m for Dixon, with potential add-ons.\nThere was interest from elsewhere, but Dixon has opted to return to London and join the side which topped the Champions League group stage table.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHe will join the Arsenal academy, hoping to quickly make an impact in the Under-21 side and work his way towards the first team.\nDixon did not take long to make his way through the ranks at Stoke after joining from Spurs as a 16-year-old.\nSpeaking in 2024, he said: ‘My time at Stoke so far has been pretty much perfect. Since I have been here, the love I have been shown is great, this is a real family club.\n‘I feel like they have trusted me and put a lot of faith in me. They did that by putting me into the Under-21s straight away and I’ve just been able to thrive from there.’\nRyan Shawcross is now coaching at Stoke, having been a stalwart of the club’s time in the Premier League, and Dixon has credited the England international centre-back for helping his development.\nMore Trending\n‘It’s great working with Ryan, he’s got amazing experience, and he can tell me how I need to improve from those experiences he has had,’ said Dixon.\n‘That’s from both a defensive and attacking point of view as well, he is a great person to have in your corner.\n‘After games, we will sit through the match and analyse some clips just to see where I can get better and what I am doing well at the moment.’\nMORE: Arsenal lose out on 20-year-old midfield target to Atletico Madrid\nMORE: Manchester United prospect set to join Leeds on permanent deal\nMORE: Bukayo Saka injury update from Mikel Arteta ahead of Arsenal vs Chelsea",
  "word_count": 459,
  "scraped_at": "2026-02-14T01:59:36.848968",
  "_text_extracted": true
}