{
  "article_id": "a66b5d4395c6",
  "url": "https://www.thetelegraphandargus.co.uk/news/25529679.bradford-city-lithuania-inspires-toon-trip-belgium/",
  "title": "Bradford City in Lithuania inspires on Toon trip to Belgium | Bradford Telegraph and Argus",
  "date": "20251010T033000Z",
  "domain": "thetelegraphandargus.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hi, I’m Troy McClu… Nathan Atkinson, and you may remember me from such travel traumas as Toulouse (hole in the plane), Whitehaven (11-hour round trip) and Accrington (embroiled in train beef).\nBut I’m pleased to report that my latest big adventure went without a hitch and even, because they really are massive, ended on a typically Bantams note.\nI’ve had more holidays than Judith Chalmers this autumn, with last week seeing me travel to Brussels, following my beloved Newcastle United for their Champions League fixture with Belgian side Union Saint-Gilloise.\nGiven my last trip to Europe was that insane trip to Toulouse to cover the Bulls in the play-offs two years ago, I was somewhat nervous, but I had to rip off that plaster at some point.\nTravelling down to London from Leeds with my fellow mad Geordie supporter Jill, we headed straight to The Dolphin pub ahead of catching the Eurostar.\nAnd of course we met John Beresford of Entertainers fame outside, because like City, it seems the Toon get everywhere.\nGetting the train to Brussels last Tuesday evening was a good way to avoid the issue of a broken aeroplane, and it was an unsurprisingly raucous ride, with 18 carriages largely populated by Newcastle supporters alongside some slightly nonplussed middle-class travellers.\nI’d encouraged Jill to get us a B&B in Anderlecht, as that’s where the game was being held, but turns out it’s not exactly glamorous there.\nI’m from Boro and she’s from Wallsend though, so we could more than handle ourselves, and despite the area being ‘rough around the edges’ I must say the people were first-class.\nI was actually a little nervous about gameday, because while I might like a drink, I’m not in the same league as most of our hardy travelling fans.\nBut I’d always dreamed of going abroad with the Toon, as I love the idea of British fans travelling to see their side in Europe.\nIt’s why Simon Parker’s Intertoto Cup tales have always been a favourite of mine, notably his piece on City’s trip to Lithuania in July 2000, a successful adventure that saw the Bantams beat FK Atlantas 3-1, Isaiah Rankin, Dean Windass and Robbie Blake all scoring.\nAnd any worries I had about feeling like a fish out of water were quickly blown away once we descended on the 5,000-strong fan zone in Brussels, after a quick brunch and vintage football store stop-off.\nThere was black and white everywhere, but not a hint of trouble, just people enjoying the moment.\nI had more Jupilers than I’d care to remember, but I do recall our friends Lionel and Heather joining us, as we talked away to fellow supporters who we’d met that afternoon.\nI’d gone with the hope of scooping a precious ticket, with there only being around 600 for the away fans, but I quickly realised I wasn’t bothered with thousands of us in the square.\nWe packed out the bars for the match itself, and raucously celebrating our 4-0 success with people who share this passion with me I’ll remember forever.\nNaturally, I unsuccessfully flirted with a couple of bemused young Belgian women, who appeared to have gone out for their usual Wednesday night drinks and come across a scene they had never expected.\nBut they listened and smiled patiently as I explained what was going on, then celebrated with me as Harvey Barnes swept home our fourth goal.\nI don’t remember what time I made it back to the B&B that night, but I certainly remember waking up last Thursday with the worst hangover I’ve had in years.\nGetting the stuffy train out to Heysel was a challenge, as I politely tried to maintain conversation with a couple of friendly Belgians without throwing up.\nA panini, a coffee and a waffle later and I finally felt human, as I took poor Jill (scared of heights) right to the top of the Atomium for an incredible birdseye view of Brussels.\nThat allowed us to see the national football stadium from above, as well as the incredibly constructed mini-village which depicts Europe.\nThe Eurostar back home on Thursday evening was full of Newcastle fans too and while we were all still a bit giddy about what had gone the night before, it was a distinctly quieter trip back, no doubt because of what had gone the night before.\nMy hangover had mercifully gone and I had a lovely catch up with a friend back in London while I had a couple of hours to fill.\nAfter helping a confused southerner on the LNER sort her train out to her gran’s in Castleford (her initial plans required a 40-minute walk through Wakefield), I needed some peace and quiet at 11pm for the last leg home.\nBut as a group of football supporters marched through the station at Leeds going through their repertoire of chants, I realised I wasn’t getting that.\nSeeing the platform direction they had come from, I was confused, neither Manchester United nor Liverpool were playing that night?\nThen I realised they had come back from South Yorkshire to Platform 17 and they were, of course, Bantams fans travelling back from their side’s 2-2 comeback draw at Rotherham.\nI needn’t have worried, as I even had enough energy for a lovely conversation with four of the lads on the train back home, me telling them it was a great point, but they still disappointed not to have got all three, a sign of how far City have come in the last year.\nSporting away days? You can’t beat them, broken planes aside…",
  "word_count": 934,
  "scraped_at": "2026-02-14T01:49:53.047486",
  "_text_extracted": true
}