{
  "article_id": "a6808e09daa2",
  "url": "https://www.teamtalk.com/manchester-city/real-madrid-shadow-to-be-eliminated-man-city-hatch-plan-tie-down-star-guardiola-proud-of",
  "title": "Real Madrid transfers : Los Blancos  shadow  to be eliminated as Man City hatch plan to tie down star Guardiola is  so proud of  ",
  "date": "20241101T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nReal Madrid ‘shadow’ to be eliminated as Man City hatch plan to tie down star Guardiola is ‘so proud of’\nManchester City are ready to act fast to tie down Rodri to a new deal with the Premier League champions said to be increasingly confident of tying the Ballon d’Or winner to a new deal and how they can keep him from Real Madrid’s clutches has also been revealed.\nThe Spanish giants were left upset on Monday and decided not to attend the Ballon d’Or ceremony in Paris on Monday when it became apparent that their star Brazilian forward Vinicius Junior had been beaten to the game’s top individual prize by Man City star Rodri.\nBut Real Madrid could yet have the last laugh on the Cityzens by launching a bid to snatch away the 28-year-old midfielder in a blockbuster 2025 transfer, with the prospect of losing their talismanic star to the Spanish giants said to be of concern to the reigning Premier League champions and with Rodri’s current deal due to expire in summer 2027.\nHowever, according to Cadena SER and journalist Anton Meana, City have already set in motion an ‘anti-Real Madrid plan’ that aims to tie the midfielder down to a blockbuster new deal – are are ‘optimistic’ they can achieve their goal before the end of the current campaign.\nAnd while the ‘shadow’ of Los Blancos remains a concern, Meana claims City believes they can convince Rodri to commit to a new arrangement, citing his Ballon d’Or triumph as merely part of his process to improving even further and with the Premier League side just as well placed as Real to enjoy ongoing success in the years to come.\nSince signing for City in 2019, Rodri has won four Premier League titles, one FA Cup, two Carabao Cups, one Champions League, one UEFA Super Cup and one FIFA Club World Cup. However, the fact that he on Monday became the first Man City recipient of the Ballon d’Or – and the first Premier League winner of the award since Cristiano Ronaldo back in 2008 – has given City a renewed belief they can convince the former Atletico man to stay and eliminate the temptation of moving back to Madrid.\nCity boss Pep Guardiola admits he is ‘super proud’ of Rodri for his success and hopes it fuels him in his recovery from his season-ending ACL injury.\n“What can I say?! First of all, congratulations to Rodrigo and all his family and friends,” Guardiola said. “This is incredible news for him and, of course, for all of us, for all Manchester City and for all our fans! We are so proud of him! I hope this gives him the necessary energy to recover well for the next season and come back to us.”\nREAD MORE ~ Ballon d’Or chief lifts lid on why Vinicius Junior lost out to Rodri amid Real Madrid fury\nGuardiola hopes Rodri award inspires teammates.\nReports on Thursday claimed Real were ready to step up their quest to sign Rodri in 2025 amid claims their president Florentino Perez was losing patience with Aurelien Tchouameni and was looking to offload the France midfielder to the highest bidder.\nRodri is not the only City star being linked with a move to Real Madrid either, with the Spanish giants also continuingly linked with a move for City’s goal machine Erling Haaland.\nGuardiola, though, believes Rodri’s success can only serve as motivation to the likes of Haaland that you don’t need to play for Real or Barcelona to scoop the game’s biggest prizes.\n“For us, last season, Haaland won the treble… scoring more than 50 goals, and I told him: ‘Just for being at the Ballon d’Or you should be very, very happy.’ And I think Rodri went there and all the time I told him the same: ‘If you are among the top two, three, or four, it’s exceptional. That means you have had an incredible year and you should be very, very satisfied,” Guardiola revealed.\nGuardiola also feels Haaland should have won the award last season ahead of Lionel Messi, adding: “Last year Haaland should have won the Ballon d’Or. And should Messi have won as he won? Yes. In the end, that’s not important; what matters is that you represent something in world football because you personally, with your teammates, with your friends, have done something truly good.”\nReflecting on Vini Jnr missing out on the award to Rodri, Guardiola continued: “Should he have won? Maybe, but that’s what happened. It’s the journalists, not a group of elite individuals, who decide what they have to do.\n“This is something that happens worldwide; it’s not a vote from a single country. There are different opinions across the globe. That’s why football is beautiful and everyone talks about it.”\nMan City plot outstanding double deal as part of squad revamp\nMeanwhile, sources have informed us of exciting Guardiola plans to rebuild his midfield next summer as he plots for a new era of domination at the Etihad.\nAnd with Kevin De Bruyne among those making way, we’ve been told that City recruitment chiefs have identified Bayer Leverkusen’s Florian Wirtz as their top target for next summer, with Bayern Munich’s Jamal Musiala also on their shortlist.\nElsewhere, another top City star Ruben Dias is surprisingly being tipped to depart next summer.\nThe Portuguese defender is generating serious interest across Europe – but we understand a move within the Premier League could well be on the cards if City decide to cash in.\nCity are also keeping tabs on a new goalkeeper with Ederson continuing to attract attention from wealthy Saudi Arabian sides.\nAnd were the Brazilian to leave, Guardiola is reported to have identified Porto goalkeeper Diogo Costa as his replacement – though any deal for the Portugal goalkeeper is likely to cost them dear.",
  "word_count": 984,
  "scraped_at": "2026-02-14T01:57:46.235714",
  "_text_extracted": true
}