{
  "article_id": "a68d6f8a868a",
  "url": "https://www.caughtoffside.com/2023/08/26/tottenham-could-offer-versatile-ace-to-sweeten-the-deal-for-25-year-old-target/",
  "title": "Tottenham could offer Eric Dier in a deal to sign Tosin Adarabioyo",
  "date": "20230826T121500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are hoping to sign the Fulham defender Tosin Adarabioyo.\nAs per Football Insider, they could offer Eric Dier in exchange for the 25-year-old along with some cash. Adarabioyo is in the final year of his contract with Fulham and he is expected to move on this summer.\nTottenham need to improve their defensive options and the Englishman could prove to be a quality acquisition. They had a vulnerable defence last year and they conceded 63 goals in the league.\nThey will have to improve defensively if they want to get back into the Champions League. Signing a quality central defender should be a top priority for them.\nSpurs already have Micky van de Ven and Cristian Romero as reliable defenders and they should look to add more quality and depth to the position.\nAdarabioyo is well-settled in the Premier League and he could make an immediate impact at Tottenham if the transfer goes through.\nMeanwhile, Eric Dier is in the final year of his contract with Tottenham as well. The versatile England international can operate as a right-back, central defender, as well as a defensive midfielder.\nSpurs want to cash in on him this summer as opposed to losing him for free next year. If Tottenham can convince Fulham to accept Dier as a part of the deal for Adarabioyo, it would help save them some money while bringing in an upgrade.\nThe 29-year-old Tottenham defender was quite mediocre last season and it makes sense for the north London outfit to cash in on him.",
  "word_count": 257,
  "scraped_at": "2026-02-14T01:56:26.903325",
  "_text_extracted": true
}