{
  "article_id": "a68fc601050e",
  "url": "https://www.hudsonriverblue.com/pascal-jansen-5-things-to-know-about-new-nycfc-head-coach/",
  "title": "5 Things about Pascal Jansen",
  "date": "20250103T173000Z",
  "domain": "hudsonriverblue.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New York City FC looks all set to name Pascal Jansen as the team's next head coach. As we await Jansen's official unveiling as the next NYCFC manager, it seemed like a good time to dive a little deeper into the background and tendencies of a 51-year-old who was born in London, and formed in the Netherlands.\nWe know he's arriving from Ferencváros in Hungary, leaving the team in the middle of their Europa League campaign (and on the cusp of advancing to the knockout round with two group stage games remaining). And we know that he spent parts of four seasons in charge of AZ Alkmaar in the Netherlands, where he had a record of 96W-24D-42L, earning 1.96 points per game.\nBut what else should we know about Jansen before we see him patrolling the sidelines for NYCFC? Below is an attempt to call out and elaborate on five notable things about Pascal Jansen.\n1. Started coaching career as a teenager\nWhat's notable about Jansen is how young he was when he decided to start his push into professional coaching. After years as a player in the academies of AZ Alkmaar and Ajax, Jansen suffered an injury at age 17 that jeopardized his future as a player. Soon after, he would choose to go all-in on coaching and reportedly set his sights on obtaining a UEFA Pro Licence by age 35.\nHe carried a bit of a wunderkind vibe as a result of his early start but he followed through — he earned his UEFA Pro Licence by age 35, which made him at the time (16 years ago) the youngest person to attain that prestigious coaching license. Now at 51, he's got tons of coaching experience at various levels under his belt.\nIn interviews, Jansen has shared a number of his coaching influences, calling out Dutch legends like Johan Cruyff and Rinus Michels (named FIFA's Coach of the Century in 1999), plus Joop Brand, while also naming more contemporary managers like Louis Van Gaal, Pep Guardiola, Jurgen Klopp, and Carlo Ancelotti.\nHis evolution as a coach began mainly with gigs at the youth or academy levels with Haarlem, Vitesse, Sparta Rotterdam, and PSV Eindhoven in the Netherlands before he progressed to assistant manager at AZ Alkmaar under both Arne Slot and John van den Brom. That set the stage for the Head Coach breakthrough with AZ in 2020 when Slot was fired for holding secret talks with rival Dutch club Feyenoord over their manager position.\nJansen stepped up and made a name for himself across his 162 matches at the helm of AZ, which turned him into a popular coaching candidate across Europe by the time he was relieved of his duties in January 2024.\n2. Lengthy list of suitors\nWe know based on the Ferencvàros statement on Jansen's departure that City Football Group paid a significant sum – rumored to be around €1 million – to buy Jansen out of his contract and bring him to NYCFC for the 2025 season, reportedly on a four-year contract.\nIt's a bold move because, in Jansen, CFG has snatched up a coaching talent that has been linked with numerous prominent managerial openings across Europe. Jansen was previously connected with the managerial vacancies at all of the following clubs: Celtic FC and Rangers FC in Scotland; and Norwich City FC, Sunderland AFC, and Everton FC in England. There was also mention of Jansen as a potential candidate at Ajax in the Netherlands.",
  "word_count": 581,
  "scraped_at": "2026-02-14T02:02:19.855047",
  "_text_extracted": true
}