{
  "article_id": "a6b3761fe45b",
  "url": "https://fansided.com/5-players-race-top-scorer-champions-league-2025",
  "title": "The race is on : 5 players in the race for top scorer in this year Champions League",
  "date": "20241216T200000Z",
  "domain": "fansided.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Champions League was born in 1992 as a reformatting of the European Cup, coming to be known for its traditional style of group stages prior to the knock-out rounds. This season, though, the Champions League has been changed and has a league table as part of its new look.\nMany have asked what the need was, if there was any at all, to change the pre-existing format of Europe’s most prestigious competition. There is an argument, though, that lesser teams in the context of European football, from smaller countries perhaps, have a better chance of reaching the knock-out stages with more games within this new format.\nAt the time of writing, there have been six weeks of league games within the Champions League with every team now having two games to play before the competition progresses. Some sides look set to reach the next round automatically, others are seemingly secure within a play-off place and some teams, of varied levels of quality, are so far at risk of not progressing past the competition's first stage. So, at this moment, which five players are in the race to become this year’s top scorer in the Champions League.\n5. Harry Kane\nThe record goalscorer for both Tottenham Hotspur and the England national team much was made of Harry Kane’s failures to win a major trophy during his time in London. It was this desire that spurred him to move away from the club in 2023 when he joined Bayern Munich and moved to the Bundesliga.\nDespite remaining an elite goalscorer, with 64 goals in as many games for the Bavarian giants, Kane is yet to win a major trophy with the club, having lost out domestically last season to Bayer Leverkusen in both the league and cup. This year, with Vincent Kompany at the helm, Bayern are looking to win another Champions League, which would be Kane’s first.\nThe Englishman has played in five Champions League games so far this season, notching five goals, with four of them coming in a 9-2 battering of Dinamo Zagreb. One has to assume that, if Bayern are to advance deeper into the competition, much of it will be through the goals of their talisman.\n4. Vinicius Junior\nA man that many thought should have won the latest Ballon d’Or which, instead, went to Rodri, Vinicius Junior played a crucial role in Real Madrid’s European triumph last season and has enjoyed a strong beginning to this campaign’s competition, despite Madrid’s overall struggles.\nReal have lost three of the six games they have played thus far which has put them at risk of dropping out of the play-off places, let alone automatic qualification to the next stage. Despite this, Vinicius has maintained a decent level in the competition, having scored five goals in as many matches for the club.\nMadrid are due to play Paris Saint-Germain in January and with both clubs hovering around the cut-off point for play-off places, it should prove an intriguing encounter. Given the struggles that Kylian Mbappe has endured so far at the Bernabeu, it would be of no surprise if the pressure falls, once again, on Vinicius’ shoulders to fire Madrid through.\n3. Raphinha\nBrazilian international Raphinha first came to the wider attention of Europe during his stint with Leeds United where, under the management of Marcelo Bielsa, he became a much-sought after player. Eventually, in 2022, Raphinha moved away from Elland Road to join Barcelona.\nThough he showcased his abilities under Xavi’s management, Raphinha could well have been deemed inconsistent in his early days at the Spanish club. This year, though, particularly since the appointment of Hansi Flick as manager, Raphinha has blossomed into one of the world’s best wingers.\nHaving played in all six Champions League games for Barca thus far, sometimes wearing the captain’s armband, Raphinha has notched six goals and two assists in a season where, across all competitions, he has scored 17 and assisted 10 in just 24 games. Should Barcelona progress far into the Champions League this season, Raphinha will no doubt play a leading role.\n2. Serhou Guirassy\nNow approaching the age of 29, Serhou Guirassy has enjoyed an interesting career, one that was fairly nomadic in its infancy. The striker spent time with Laval, Lille and Auxere before a 2016 move to FC Koln, though he returned to France after three years in Cologne. In 2023, after a season on loan with the club, Guirassy joined Stuttgart on a permanent deal.\nAcross 28 games last season, Guirassy scored 28 goals as he helped fire Stuttgart to the Champions League. He departed in the summer for Borussia Dortmund, where the Guinea international’s form has scarcely dropped. Though Dortmund have struggled domestically, the striker has scored six times in just 11 Bundesliga matches.\nOn the continent, Guirassy has retained his form, having grabbed six goals and created two more in the six matches he has played. Dortmund, at the time of writing, are ninth in the table, strongly positioned to potentially finish in the top eight and earn automatic progression to the knock-out stages.\n1. Robert Lewandowski\nThe only player, at the time of writing, to have scored more than six goals in this season’s Champions League, Robert Lewandowski has grabbed seven goals in six appearances for Barcelona and has been a leading contributor, alongside Raphinha in attack, as to why the Catalan side are second in the table.\nThe Polish international, one of the best strikers of his generation, joined Barcelona in 2022 after eight years with Bayern Munich, with whom he won a Champions League in 2020. Such experience could prove crucial for a Barca side that has youth sprinkled throughout it and it helps that the Pole’s form this year is strong, with Lewandowski having netted 16 La Liga goals in 17 games.\nBarcelona’s last Champions League triumph came a decade ago, when they won the 2014-15 edition of the competition. They have primed themselves in this campaign for another attempt to win and with such form in their frontline, perhaps they stand a very real chance.",
  "word_count": 1016,
  "scraped_at": "2026-02-14T02:11:20.839227",
  "_text_extracted": true
}