{
  "article_id": "a6cab1e98beb",
  "url": "https://www.namibian.com.na/battling-bremen-braced-for-bayern-onslaught/",
  "title": "Battling Bremen braced for Bayern onslaught",
  "date": "20260213T124500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Munich’s visit to Werder Bremen’s Weserstadion could not have come at a worse time for the struggling hosts, who have been dragged into a German Bundesliga relegation battle.\nWith 21 games played, Bremen sit in 16th, the relegation playoff spot, trailing Mainz in 15th on goal difference.\nIt is a sad state of affairs for the four-time German champions, the only club to have spent as much time in the top flight, 61 seasons, as Bayern during the Bundesliga era.\nFamous for Beck’s beer and an historic town square, Bremen is not one of Germany’s largest or wealthiest cities but popular Werder have a following which extends far and wide.\nDouble winners in 2004 and 2009 Europa League finalists, Bremen’s decline is similar to that of German giants like Hamburg, Schalke and Hertha Berlin; change-resistant clubs failing to keep up while sleepwalking into a crisis of their own making.\nBefore the season, Bremen sacked coach Ole Werner, who took them to the top-flight and stabilised them in the Bundesliga, after a contract dispute.\nSome at the club were critical of Werner for failing to play Bremen-born and raised forward Nick Woltemade, who moved on a free transfer to Stuttgart before a big-money arrival at Newcastle United.\nBremen took a risk with a season-long loan of Bayer Leverkusen striker Victor Boniface, but it has not paid off, with the injury-prone Nigerian ruled out for the season.\nWerner’s replacement, Horst Steffen, was sacked in February, with replacement Daniel Thioune tasked with avoiding the drop.\nThioune sought to boost his players after losing his first game in charge against Freiburg on Saturday.\n“The last thing I want to see is people dropping their heads,” Thioune said.\n“Those who look down can’t see what lies ahead.\n“I’ve told the players to believe in the path we’re taking and to trust me.”\nThioune promised his side would “work diligently and tirelessly to change our situation,” with the league leaders their next target.\n“In football, you rise to the challenge.”\nOne to watch: Ibrahim Maza (Bayer Leverkusen)\nBayer Leverkusen midfielder Ibrahim Maza has been the standout of around a dozen who signed with the club in the summer, already emerging as a creative force in midfield.\nLaying on assists in back-to-back Champions League matches against Manchester City and Newcastle, Maza has quickly shown his ability on the big stage.\nMaza cites Germany’s 2014 World Cup winner Mesut Ozil as his inspiration, saying “I was still young then but Ozil was ‘wow’ for me.”\nSpeaking to the Bundesliga website on Thursday, Maza said he still tried to keep the fun despite the pressure of top-level football.\n“Always having fun playing, being brave, being cheeky,” Maza said of his game.\n“Sometimes a bit of trickery, having fun and just bringing a bit of cheekiness onto the pitch.”\nKey stats\n8 in 24 – Eight of Harry Kane’s 24 goals this Bundesliga season have come from the spot. The next best Bundesliga scorer this season is Kane’s teammate Luis Diaz, on 13.\n6 and 4 in 5 – Bayern talisman Harry Kane made his Bundesliga debut at Bremen and has chalked up six goals and four assists in five matches against them.\n16 – Michael Olise has 16 assists this season, the most in the league. On Thursday, he was named Bundesliga player of the month for January, the second time he has won the award this campaign.\nFixtures (1430 GMT unless stated)\nFriday\nBorussia Dortmund v Mainz (1930)\nSaturday\nHamburg v Union Berlin, Eintracht Frankfurt v Borussia Moenchengladbach, Werder Bremen v Bayern Munich, Hoffenheim v Freiburg, Bayer Leverkusen v St Pauli, Stuttgart v Cologne (1730)\nSunday\nAugsburg v Heidenheim, RB Leipzig v Wolfsburg (1630)\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 721,
  "scraped_at": "2026-02-14T01:53:15.560480",
  "_text_extracted": true
}