{
  "article_id": "a6d9d3d19622",
  "url": "https://english.aawsat.com/sports/5175598-match-against-ronaldo%E2%80%99s-al-nassr-%E2%80%98once-lifetime-moment%E2%80%99-indian-club-fc-goa",
  "title": "Match Against Ronaldo Al - Nassr  Once - in - a - Lifetime Moment  for Indian Club FC Goa",
  "date": "20250815T184500Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo will travel to India to face FC Goa in an Asian Champions League Two match being hailed as “historic” in the country.\nAl-Nassr of Saudi Arabia and its superstars were drawn Friday against the Indian Super League (ISL) club in Group D of Asia’s second tier club competition, along with Istiklol of Tajikistan and Iraq’s Al-Zawraa. The top two from each of the eight groups advance to the second round.\n“This is truly a once-in-a-lifetime moment for FC Goa,” club CEO Ravi Puskur told The Associated Press. “To host Al-Nassr and Cristiano Ronaldo is arguably the biggest game in Indian club football history.”\nRonaldo, 40, has yet to win a major trophy since signing for the Riyadh club in 2022 and the team is expected to be at full strength when the action starts in September\nAl-Nassr, which finished third in the Saudi Pro League last season, also boasts famous names such as former Liverpool star Sadio Mane and Joao Felix, the Portuguese forward who signed from Chelsea in July.\n“For Indian football, this is historic,” Puskur added. “We are here on merit, and a match like this gives us the chance to show that we can compete on the continental stage, becoming part of the sport’s biggest narratives.”\nPuskur is confident that the excitement will be felt all over the country to give the local game a much-needed boost.\n“It’s a unique opportunity to bring global attention to Indian football and, most importantly, a chance to spark a greater interest in Indian football among fans across the country, giving the game the spotlight it has long needed,” he said.\nThe draw comes with Indian domestic soccer in crisis. The 2025-26 ISL season was due to start in September, but has been suspended due to uncertainty over the renewal of an organizing agreement between the Indian federation and its commercial partner, the Football Sports Development Ltd., pending a Supreme Court order.\nBengaluru FC, Odisha FC and Chennaiyin FC have either suspended salaries or ceased soccer operations until a solution is found.\n“While the financial boost is important, the bigger picture is the opportunity this creates for long-term growth,” said Puskur. “The global attention, sponsorship interest, and fan engagement from a moment like this help strengthen the club’s foundations, allowing us to invest in the future.”",
  "word_count": 387,
  "scraped_at": "2026-02-14T02:11:49.087946",
  "_text_extracted": true
}