{
  "article_id": "a70e238992f3",
  "url": "https://metro.co.uk/2025/04/22/chelsea-will-without-49m-world-class-player-club-world-cup-22949507/",
  "title": "Chelsea will be without £49m  world - class player  for Club World Cup",
  "date": "20250422T110000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea will be without ‘world-class player’ Estevao Willian for the new-look Club World Cup tournament this summer, his agent has confirmed.\nThe Blues announced in June that they’d signed the Brazil international teenager, 17, but he won’t move to west London until the summer of 2025.\nEstevao, who cost €34m (£29.2m) plus €23m (£19.8m) in add-ons, cannot join Chelsea until his 18th birthday passes this week due to current rules.\nIt had been suggested that Estevao could’ve featured for Chelsea at the Club World Cup but that’s now been ruled out by his agent Andre Cury.\n‘He’s arriving (at Chelsea in July) after the Club World Cup,’ Cury told Spanish outlet AS about Estevao, who is currently still at Palmeiras. ‘He’s a world-class player. Very good. A guy who’s going to make history here.’\n‘Estevão is the most expensive transfer in all of Latin America. First, Estevão, second, Vitor Roque, and third, Neymar. I was lucky enough to make all three.’\nChelsea beat Bayern Munich and Paris-Saint Germain in Estevao Willian transfer race\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nCury was then asked about Barcelona’s interest in Estevao, with the Brazilian wonderkid’s agent revealing that Chelsea had beaten ‘several clubs’ to the winger’s signature, including Bayern Munich and PSG.\n‘With Estevão, I had interest from PSG, Bayern Munich, Chelsea… from several clubs,’ Cury added. ‘Negotiating today is very difficult due to the Fair Play issue.\n‘Those who don’t have the money to invest want to do so to get immediate results. Imagine this: Chelsea signed Estevão a year ago; they’ve waited a year to be able to enjoy him now, in July. There’s no money to do this in Spain. They can’t wait.’\nHow good is Chelsea’s new signing Estevao Willian?\nChelsea’s new signing Estevao is the best Brazilian-born player since Neymar, according to Brazil’s World Cup winner Branco.\nNeymar himself has waxed lyrical about Estevao, predicting the teen – already capped four times by Brazil – will prove himself as a ‘genius’.\nChelsea’s current Brazilian star Andrey Santos says Estevao has ‘huge potential’ and is ‘the face of Brazilian football’.\nBrazil legend Ronaldo, meanwhile, believes that Estevao is ‘kind of like’ Barcelona and Spain star Lamine Yamal.\nChelsea superstar Cole Palmer has already reached out to Estevao while the west London club also have immediate first-team plans for him.\nWhy are Chelsea in the Club World Cup and when does it start?\nThe 2025 Club World Cup will take place in the United States from June 14 to July 13.\nMore Trending\nThe tournament has been around for a while but this year’s edition is the first under the new-look expanded format – which features 32 teams.\nFIFA rules state that only a maximum of two teams from the same country can take part.\nChelsea and Manchester City are the two English sides involved for 2025 because they have both won the Champions League in the past four years.\nMORE: Man Utd identify ‘most hidden secret in Europe’ as top target to replace Andre Onana\nMORE: Owen Hargreaves tips Arsenal to sign £70m star to replace Thomas Partey\nMORE: Graeme Souness sends warning to Aston Villa over Marcus Rashford transfer",
  "word_count": 579,
  "scraped_at": "2026-02-14T01:58:31.711214",
  "_text_extracted": true
}