{
  "article_id": "a718c6fd3508",
  "url": "https://www.thisdaylive.com/index.php/2023/02/24/rio-ferdinand-insists-man-utd-need-osimhen-to-become-title-contenders/",
  "title": "Rio Ferdinand Insists Man Utd Need Osimhen to Become Title Contenders – THISDAYLIVE",
  "date": "20230224T103000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nRio Ferdinand Insists Man Utd Need Osimhen to Become Title Contenders\n*The Napoli star listed in UCL Team of the Round of 16\nDuro Ikhazuagbe\nFormer Manchester United centre-back, Rio Ferdinand, has said that the Red Devils can only become title contenders if they sign either Victor Osimhen or Harry Kane in the next summer transfer window.\nThe Nigerian and Napoli striker, Osimhen, scored in Napoli’s 2-0 victory at Eintracht Frankfurt on Tuesday night to take his total goals tally so far this season to 20.\nFerdinand insisted that with Osimhen at just 24 years making such massive impact in Europe, he would rather prefer the Nigerian rather than going for Kane who is nearing his retirement at 29 years.\n“I think if I was talking about investing and looking after my money, I’d probably go for Osimhen,” Ferdinand told BT Sport yesterday. “There’s resale value with his age at 24 years old. It’s gonna be a huge outlay.”\nHowever, the Reds legend did admit that he would be happy with either front-man arriving at Old Trafford, suggesting that they can transform Ten Hag’s side into title challengers.\nOsimhen was named in both the UEFA Champions League Team of the Week and also Team of Round of 16 first-leg, yesterday.\nWhoscored.com, football facts and statistics website, named the red-hot Osimhen in the two lists yesterday and was dully announced on its social media handles.\nHe took his tally for the season to 20 in 24 games in all competitions for the Serie A leaders.\nOsimhen alongside three of his Napoli teammates and Real Madrid’s quartet of Karim Benzema, Eder Militao, Vinicius Junior and Luka Modric, all made the Team of the Week.\nWhile for the Team of first-leg Round of 16, Osimhen was included with the same Madrid players and also three of his Napoli teammates.\nManchester United have been impressive in recent months and are the only side in England still competing on four fronts.\nThe Reds currently sit third in the Premier League table and face Newcastle United in the Carabao Cup final on Sunday afternoon.\nHowever, while Marcus Rashford has been in scintillating form – registering 24 goals and nine assists in 36 appearances – United‘s other forwards have struggled for goals this term.\nFrench striker Anthony Martial has scored just six goals, while loan attacker Wout Weghorst has only found the back of the net on one occasion.",
  "word_count": 404,
  "scraped_at": "2026-02-14T01:55:49.893255",
  "_text_extracted": true
}