{
  "article_id": "a73e9b3e9ae8",
  "url": "https://www.nigerianeye.com/2023/06/fa-cup-man-utd-can-end-man-citys-treble.html",
  "title": "FA Cup : Man Utd can end Man City treble hopes , says Guardiola | Nigerian News , Latest Nigeria In News . Nigeria News . Your online Nigerian Newspaper . ",
  "date": "20230602T111500Z",
  "domain": "nigerianeye.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City head coach, Pep Guardiola has warned his Manchester City stars that their rivals, Manchester United, are capable of wrecking their treble hopes come Saturday.\nCity will travel to Wembley this weekend, aiming to complete the second part of their impressive attempt to win the Premier League, Champions League, and FA Cup in a single season. Guardiola’s team won their fifth Premier League title in six seasons with three games to spare, allowing the City boss to rest key players and refine his tactics for the two matches that will determine their season.\nCity will face their bitter rivals United in the first all-Manchester FA Cup final this weekend, before travelling to Istanbul to play Inter Milan in the Champions League final on June 10.\nGuardiola has been solely focused on United this week, as they stand in the way of City’s attempt to replicate their neighbours’ historic treble triumph in 1999.\nUnited is the only other English club to have won all three major trophies in one season. Inter, who are third in the relatively weak Serie A, will be the underdogs against City in the Champions League final.\nGuardiola is well aware that United will pose a more difficult challenge, and he knows that Ten Hag’s team has enough quality to cause them problems if they are not at their best. Guardiola watched United’s recent 4-1 win over Chelsea, and he is still haunted by City’s 2-1 loss to United at Old Trafford in January.\n“I am more focused on United right now. I saw their game against Chelsea. I was really impressed, and I have started to review a little bit of what they did to us in the game at Old Trafford,” Guardiola said.\n“As in the past, we have to be careful. I would be careful anyway, but after Thursday and their games recently, we are going to prepare the best we can.”\nDespite Guardiola’s caution, City has become the first dynasty in English football since United’s Ferguson era and has every reason to believe that they will win the FA Cup for the second time in Guardiola’s reign. City thrashed United 6-3 in October and won 12 consecutive league games to secure their third consecutive title. Their first loss in 26 games in all competitions came last weekend when they fielded a weakened team against Brentford.\nErling Haaland will be City’s key man at the end of a brilliant first season in England. The Norway striker has scored 52 goals in all competitions, including a single-season record 36 in the Premier League. Haaland scored a hat-trick against United in October, but Ten Hag managed to keep him goalless in their rematch.\nTen Hag’s first season has been impressive, and he ended United’s six-year trophy drought with a League Cup final win against Newcastle in February. He is only the second manager in United’s history to win a major trophy in his first season, and beating City at Wembley would be a significant achievement for him. United, who finished third in the Premier League, are eager to spoil City’s treble hopes, even without the injured Anthony Martial.\n“Of course, we know it’s a big final, a special game. We’ve been the whole year fighting to be in that position to win titles. We will try absolutely everything to try to win,” United keeper David De Gea said.\nClick to signup for FREE news updates, latest information and hottest gists everydayAdvertise on NigerianEye.com to reach thousands of our daily users",
  "word_count": 585,
  "scraped_at": "2026-02-14T01:53:41.891892",
  "_text_extracted": true
}