{
  "article_id": "a787a51164ff",
  "url": "https://www.caughtoffside.com/2025/05/04/arsenal-ready-sign-ousmande-diomande-replace-william-saliba/",
  "title": "Arsenal want Ousmane Diomande to replace William Saliba",
  "date": "20250504T130000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have been linked with a move for the Sporting CP defender Ousmane Diomande at the end of the season.\nThe 21-year-old has established himself as one of the finest young defenders in European football, and a report from Defensa Central claims that Arsenal could look to make a move for him if they lose William Saliba in the summer. The French International has been linked with Real Madrid in recent months.\nIt will be interesting to see how the situation develops.\nArsenal eyeing Ousmane Diomande\nMeanwhile, Diomande is valued at around €80 million, and Arsenal will face competition from Chelsea and Newcastle as well. It remains to be seen whether they can win the race for his signature.\nThe 21-year-old has the potential to develop into a top-class defender, and he could succeed in the Premier League with Arsenal. It remains to be seen whether the Gunners are willing to pay the asking price for him.\nEven though the deal might seem expensive, Diomande has the potential to justify the investment in the long term.\nChelsea and Newcastle keen\nMeanwhile, Chelsea need a quality defender as well. Players like Benoit Badiashile have been linked with the move away from the club, and Chelsea will have to replace them adequately. Diomande could be a quality long-term investment.\nSimilarly, Newcastle are looking to build a squad capable of winning major trophies regularly. They have managed to win the English League Cup this season, and they are pushing for Champions League qualification. They will be looking to bring in a reliable partner for Sven Botman, and Diomande could help them tighten up at the back.\nAll three clubs have the financial muscle to get the deal across the line, and it remains to be seen how the situation develops. The player will certainly be attracted to the idea of playing for big clubs like Arsenal or Chelsea next season.",
  "word_count": 317,
  "scraped_at": "2026-02-14T01:49:39.553589",
  "_text_extracted": true
}