{
  "article_id": "a78bc54de540",
  "url": "https://www.con-telegraph.ie/2025/04/27/oliver-glasner-concedes-palace-can-secure-first-major-silverware-in-fa-cup-final/",
  "title": "Oliver Glasner concedes Palace can secure first major silverware in FA Cup final",
  "date": "20250427T080000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Oliver Glasner concedes Palace can secure first major silverware in FA Cup final\nBy Rachel Steinberg, PA\nOliver Glasner conceded that Crystal Palace were at least mathematically more likely to secure their first major silverware after they booked their place in the FA Cup final with a 3-0 triumph over Aston Villa at Wembley.\nIsmaila Sarr recorded a second-half brace after Eberechi Eze opened the scoring in the 31st minute, though the winning margin could have been even greater had Jean-Philippe Mateta not missed a penalty after the break.\nIt is just the third time the Eagles have reached an FA Cup final in their history – having lost to Manchester United on both occasions in 1989-90 and 2015-2016 – and the Palace boss, who had resisted discussing their trophy chances earlier in the week, remained pragmatic when asked if he could now be more forthcoming about the possibility.\nHe said: “Yes, because it’s the final. We can play the final, so most teams who play the final can win the trophy. So it’s nothing new, I think, (that) I tell you.”\nThe Austrian – in his first full season with the Eagles – gave his players full permission to celebrate their achievement, but resisted busting moves of his own in the dressing room.\n“No. It’s better not to (dance),” he joked. “And with all the happiness and pride, it was not the last step. It was one more step, but an important step. When you play the final, you want to win it.\n“I’m really proud. I’m enjoying walking in front of the stands seeing how happy people are. In the dressing room, it’s a great mood. I think when I started dancing, I (would have) destroyed this moment.”\nGlasner insisted he was not yet thinking about the final, though he was looking forward to finding out their opponents on Sunday afternoon from the comfort of his sofa before they regroup on Thursday.\nHe added: “The players can party tonight and they will, they fully deserve it.\n“They have a few days off, but also that’s regardless of the result today and we will meet on Thursday, and they will prepare for Nottingham and Tottenham (in the Premier League).”\nVilla boss Unai Emery was dealt a blow when he learned he would not have Marcus Rashford at his disposal for the semi-final, though his side were not without their chances to get on the scoresheet.\nTheir focus now also turns back to the Premier League and trying to secure European football next season by another means.\n“I’m sorry for our supporters,” he said. “We have to change again our objective because the Premier League is our priority. Through it we can again play in Europe next year.\n“We lost a possibility to get one trophy in the Champions League and again today, but we have to keep going. Only one team is winning and to play in Europe consistently is the next objective and the priority when I arrived here.\n“This is the message I send always to the supporters: to be consistent in Europe, to try to play for a trophy – we did this year and last year we did as well in the Conference League.”",
  "word_count": 539,
  "scraped_at": "2026-02-14T02:09:01.855944",
  "_text_extracted": true
}