{
  "article_id": "a7a3d6e09602",
  "url": "https://www.yahoo.com/news/seine-concerns-france-biggest-ever-100000543.html",
  "title": "New pollution readings show Seine may yet be clean enough for Olympic events",
  "date": "20240701T144500Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New pollution readings show Seine may yet be clean enough for Olympic events\nThe Paris Olympic Games has been boosted by a major improvement in the water quality of the River Seine that would be sufficient to safely hold both the triathlon and the open-water swimming.\nWith just 25 days until the opening ceremony down the iconic river, it is understood that readings over the past 72 hours have finally produced markers of pollution that would be acceptable for competition.\nThese improvements are expected to be reported officially by the Paris mayor’s office on Friday. It follows a period since mid-June of minimal rain, warmer temperatures and the full working of a new storage basin that can hold 50,000 cubic metres of rain.\nThis, in turn, has followed rainfall during March, April and May that was among the highest on record in Paris and had raised concerns that the Olympic triathlon might be reduced for the first time to a duathlon of only running and cycling.\nFrench authorities have spent €1.4billion trying to clean up the river by improving the Paris sewerage system and building new water treatment facilities but persistent rain, as well as a lack of sunlight, still causes huge difficulty.\nLast Friday, the mayor’s office released readings for June 18 which showed that the levels of E.coli bacteria – an indicator of faecal matter – were around 10 times above the upper limits imposed by sports federations. Although the better news will come as a considerable relief to participants who have spent years planning to peak for a specific date, they also know that further heavy rain could change things again.\nWith a team relay to follow the individual events, Team GB’s triathletes will take a range of risk-mitigation measures. These include the ongoing consumption of food and probiotics high in “friendly bacteria”, preventative antibiotics and stomach medicines, extensive wet-suit disinfection, and hygiene measures that mean no food or drink before major post-race sanitisation. There is even a strategy to minimise the athletes’ exposure to water – and thus risk – by potentially using coaches for the pre-race reconnaissance.\nParis 2024 organisers said that test results were released each Friday by the mayor’s office, but confirmed a delay between when water samples were taken and the results that were published. A spokesperson said: “We are confident that the return of good weather, combined with the excellent work undertaken by the authorities to clean up the Seine, will allow open-water swimming events to take place during the Games.”\nWith under a month until the Olympics start, here is how Paris is shaping up...\nSnap election adds to planning issues\nFrance had already spent years planning for an opening ceremony of unprecedented complexity at a time of unique global and domestic political tension. And then president Emmanuel Macron abruptly announced a snap general election that, in his own words, could spark a “civil war” if either the far-Right National Rally or far-Left France Unbowed prevailed.\nLittle wonder, then, this dramatic gamble should prompt considerable disquiet.\n“I had a very, very hard time with the announcement – why spoil this beautiful moment with this election decided at the last minute, without consulting anyone?” said the Paris mayor Anne Hidalgo. For all the frustration at how politics has come to dominate the national discourse just as a once-in-a-lifetime party is set to begin, there is confidence that seven years of security and counter-terrorism planning will robustly meet the challenge.\nThe first test will perhaps also be the biggest: A floating Olympic opening ceremony up six kilometres of the River Seine during which 45,000 police will be deployed at a ratio of around one to every four or five spectators. Measures will extend to a lockdown and security sweep of a protected loop from Ivry-Charenton to the Pont Gariglian several days in advance. Specialist State forces – expected to include police helicopters, scuba divers and snipers – will be used to secure the river and airspace and there will be around 2,000 private security focused on the lower quays and the Trocadéro.\nIn short, it is the biggest security operation for any event in France’s history.\nAlthough there are contingencies – notably limiting the opening ceremony to the Trocadéro area – Macron has repeatedly stressed that threats and risks should not prevent France from “creating dreams” with its grand opening. Asked about the election impact, a Paris 2024 spokesperson said: “All the major decisions have been taken a long time ago. The State is obviously a key player, but we know that we can count on their full engagement and that of our public services, even in the context of these early elections, to move forward on the remaining issues.”\nGames legacy at stake in river’s role\nWhat is supposed to become perhaps the most enduring legacy of Paris 2024 – the first chance for more than a century for Parisiens to safely swim in the Seine – has sounded almost like a game of dare in recent weeks.\nMacron has long promised to join Hidalgo in the water, but that has been put back now until July 14 after water quality readings stayed stubbornly below the required range.\nTony Estanguet, the president of Paris 2024, did make it in the water at the test event last summer, although his past life as a triple Olympic canoeing champion perhaps helped to allay reservations. “I’m not really objective because I paddle in rivers really more polluted than the River Seine,” he said, before asking, with a smile, about the quality of the River Thames.\nEstanguet acknowledged, however, that the risk both to the triathlon and the open-water swimming events had become one of the biggest challenges. The British team are preparing for an uncertainty that could last until the morning of the race. “We plan for a triathlon — but we have to make decisions on the fly all the time,” said Mike Cavendish, the GB performance director.\nMitigations for the Paris test event last year even included using coaches to swim a recce that would usually take place around 48 hours before a race. “If the water is terrible, no one will swim because health comes first,” Cavendish said. “But we will more than likely say to athletes ‘it’s not worth the risk’ and get a couple of coaches in. The flow rates are very high at the moment because of the rain, so there is a huge amount to be learnt from getting in the water.”\nWater and heat concerns have become increasingly common in the sport and British Triathlon is among the governing bodies that have joined a “clean water alliance” to raise awareness of governments and water authorities. “We have lost way more races than the previous [Olympic] cycle,” Cavendish said. “To think that, potentially in 15, 20, 30 years’ time, we could end up in a scenario where we have to compete in swimming pools, is not something that we really want to consider. As human beings, we need to protect our natural world to continue to do the things we love; that’s not just the water but the climate in general.\n“That is why the fact that Paris are trying to do this in the Seine, as a legacy piece for local people, is hugely important. If the rain holds off, if it’s generally dry from this point, I’d still be relatively confident. If there’s heavy rain between now and then – certainly in the few days before – it’s going to be trickier.”\nTransport challenges spark concern\nPolitics and Euro 2024 might be dominating conversation just now in France but you do not need long in Paris to know that you are in an Olympic city. Queues are forming daily next to the Eiffel Tower to grab a photograph of huge Olympic rings which hang from what is both the city’s most famous landmark and the beach volleyball backdrop. Temporary Olympic venues are visible from the Arc de Triomphe to the Place de la Concorde, while main existing stadiums — such as the Stade de France and the La Defense Arena — have been adapted respectively for athletics and swimming.\nOf the 10 million tickets on sale, 8.4 million have been sold, with the majority of available tickets for football matches in larger stadiums outside of Paris. Organisers are promising a full Stade de France for the athletics\nAside from the French, the best-supported team in Paris will be Team GB, with UK-based fans having bought more than half a million tickets.\nThere are concerns, however, about transport accessibility and the French disability charity AFP France Handicap has hit out at the “scandalous” lack of improvement to the Paris underground. Organisers believe that an overground road network of buses and taxis will operate as a viable option during a period when traffic is down and many Parisians leave the city. They also insist they have learnt from the serious security problems that marred the 2022 Champions League final and that ongoing dialogue with the famously active French unions will dissuade any disruption. “The French people are known for their vibrant and dynamic democracy,” said Etienne Thobois, the Paris 2024 chief executive. “We’ve been working with the unions from day one, and we’re confident that the Games as such will not be targeted.”\nA spokesperson added: “More than ever in this period, we will be committed to making the Games, the Games of all French people, a unifying sporting event. With just a few weeks to go, we’re ready to deliver.”",
  "word_count": 1594,
  "scraped_at": "2026-02-14T02:13:55.805618",
  "_text_extracted": true
}