{
  "article_id": "a7c8da998ba7",
  "url": "https://www.teamtalk.com/manchester-united/marcus-rashford-one-of-12-man-utd-stars-told-its-game-over-ruthless-ratcliffe-tears-squad-apart",
  "title": "Marcus Rashford the big Man Utd name told to leave as ruthless Ratcliffe tells 12 theyll be sold",
  "date": "20240425T134500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMarcus Rashford one of 12 Man Utd stars told it’s game over as ruthless Ratcliffe tears squad apart\nSir Jim Ratcliffe is reportedly set to cut a swath through the Manchester United squad this summer with a dozen players – including high-profile names such as Marcus Rashford and Harry Maguire – told they will be sold.\nThe British billionaire completed his £1.3bn purchase into 27.7% of the Glazers shareholding in February and has wasted little time in both getting his feet under the table and in setting in motion his ruthless ambitions of taking Manchester United back to the very top of English and European football.\nTo to that, Ratcliffe has taken a rigorous approach to the way United are run behind the scenes, with some key changes of personnel.\nIndeed, the departure of CEO Richard Arnold was announced shortly into his reign, with Omar Berrada moving across the town from Manchester City to take his place. Meanwhile, another promiment Man Utd figurehead, accused of wasting £518m, was also shown the door earlier this month. Jean-Claude Blanc, who previously worked for both Juventus and PSG, has also arrived as a director.\nGO DEEPER: The entire Man Utd XI Ratcliffe can brutally axe to cut £85m from wage bill\nHowever, it is the appointment of Dan Ashworth from Newcastle as sporting director and Jason Wilcox from Southampton as technical director which offers United supporters the biggest hope going forwards. Between the pair, with Ratcliffe overseeing both, it is hoped United will start to make some much better decisions on both the transfer front and in how the club is run.\nWilcox’s first mission is to run a critical assessment of Erik ten Hag and decide whether the Dutchman is best equipped to lead the first-team squad or should be replaced by an alternative.\nRashford the headline name in Man Utd firesale\nBut it is on the transfer front that will most fascinate fans and now a report claims that, with the club having to carefully manage FFP regulations, 12 Man Utd stars have now been told they will be sold off this summer.\nTo that end, Ratcliffe has reportedly been hugely critical behind the scenes of some of the recent big-name signings United have made, particularly on players seen to be in the autumn of their careers and who command significant salaries.\nNow according to the Daily Mirror, INEOS will bid farewell to 12 players this summer as the club looks to make wholesale changes to their squad this summer.\nThe biggest of those names will reportedly be Rashford, who Ratcliffe has endured a difficult season under Ten Hag this season.\nHaving scored 30 times last season, the 26-year-old has looked a shadow of himself this term, hitting the back of the net just eight times.\nAs a result, the Mirror claims Ratcliffe has communicated to Rashford that they are willing to listen to offers for him this summer and will listen to offers from £75m for him. Tentatively linked with PSG, who are seeking a successor to Kylian Mbappe, the 60-times capped England international is contracted to Old Trafford until summer 2028.\nHis wages of £300,000 a week, however, do complicate a sale, especially as it has been reported that Rashford is happy where he is.\nMan Utd forward line to be ripped apart\nIf all goes to plan, though, Ratcliffe will bid the forward farewell and it seems he won’t be the only United attacker shown the door either.\nPredictably, the report has confirmed it will be a United farewell to Anthony Martial – out of contract after nine season at the club this summer – and Jadon Sancho, who, one way or another, will be asked to stay away after his very public falling out with Ten Hag.\nThe England winger will hope he can extend his stay with loan side Borussia Dortmund, into this season’s Champions League semi-finals, either on a permanent or another loan basis.\nUnited also plan to cut their losses on Brazilian flop Antony, who has failed to produce anything near his best since a whopping £85m move from Ajax.\nDON’T MISS ~ Man Utd wages: Top 11 earners at Old Trafford revealed as Ratcliffe prepares to shred colossal wage bill\nHis exit will see the Red Devils suffer a major loss – possibly as much as 75% – on their initial investment, with the player now having a valuation at nearer £25m.\nUruguayan winger Facundo Pellistri, currently out on loan with Granada, will also depart.\nThere will also be major changes in defence with Raphael Varane, Victor Lindelof, Aaron Wan-Bissaka and, perhaps most surprisingly, Maguire, also told they are up for sale.\nChanges are afoot in midfield too, with Casemiro told he can move on, while Sofyan Amrabat’s loan deal will not be turned into a permanent deal.\nChristian Eriksen will also be on his way.\nTen Man Utd stars are told they are safe\nOn the flipside, Ratcliffe has reportedly told the United squad that only 10 of their stars and will be exempt from sale this summer as the club looks to build around them.\nAnd one of those, in Mason Mount, will be hoping to prove his worth to the club next season after a very difficult first season at the club, in which he has been restricted to just 17 appearances and one goal.\nAlso safe though ahead of the summer window is his fellow summer 2023 signings Rasmus Hojlund – who overcame a difficult start to score an impressive 14 goals so far – and Andre Onana, who has also looked more settled in recent weeks.\nLisandro Martinez, Diogo Dalot, Luke Shaw and Bruno Fernandes’ places at the club are safe.\nAnd in addition to Hojlund, the club also want to build their side around a number of talented youngsters with Kobbie Mainoo, Alejandro Garnacho and Willie Kwambala seen as playing a huge part in both the club’s rebuild and future.",
  "word_count": 999,
  "scraped_at": "2026-02-14T01:51:24.791562",
  "_text_extracted": true
}