{
  "article_id": "a7d18ffc49f0",
  "url": "https://punchng.com/messi-at-psg-time-for-world-best-to-move-on/",
  "title": "Messi at PSG : Time for world best to move on ? ",
  "date": "20230603T094500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionel Messi arrived in France to a hero’s welcome, seen as the man who would deliver the Champions League for Paris Saint-Germain.\nTwo years on, the Argentinian is set to depart without having achieved that aim and having only produced his brilliant best in flashes.\nIt is difficult to qualify Messi’s time at PSG as a success, even if the move to the French capital helped set him up for the crowning glory of his career at last year’s World Cup and did no harm to the Qatar-owned club as a sporting brand.\nAt his unveiling in Paris in August 2021, Messi said winning the Champions League for the fifth time in his career was his “dream” and that he was in “the ideal place” to do it.\nThat was seductive talk for PSG president Nasser al-Khelaifi, sat next to him, and for fans of the club who were desperate to see their team win European football’s greatest prize for the first time.\nThe previous season they had lost to Manchester City in the semi-finals, having been beaten by Bayern Munich in the 2020 final. Messi looked like the final piece in the jigsaw.\nHowever, PSG has gone backwards with Messi. They were beaten in the Champions League last 16 by Real Madrid last season with Mauricio Pochettino in charge and suffered the same fate this year at Bayern’s hands with Christophe Galtier on the bench.\nThere must be a reason why Pep Guardiola did not push to bring an ageing Messi to City, despite his former coach at Barcelona often describing him as the best player of all time.\nGuardiola’s side are through to this season’s Champions League final and playing at a level PSG could not currently hope to match, despite having Messi, Kylian Mbappe and Neymar in the same side.\nHaving to accommodate those three attacking superstars has weakened PSG overall as a team.\nNow they must try to build a more balanced side without a player who turns 36 this month and has been costing an estimated annual salary of 30 million euros ($32.1 million) after tax.\nEarly 2023, Messi was jeered at by some supporters at the Parc des Princes.\nThat was before he skipped training for an unauthorised trip to Saudi Arabia to fulfill commitments as a tourism ambassador for the Gulf state.\nA one-week suspension followed, and there was no prospect of Messi signing a new deal in Paris after that.\nMessi had 32 goals in 74 games for PSG before Saturday’s final match this season against Clermont.\nHis first season in France was difficult as he struggled to settle having been uprooted from Barcelona.\nHe has sometimes struggled with the physical nature of the French league, but this season has been more memorable.\nThe seven-time Ballon d’Or winner developed a fine understanding with Mbappe, appearing to accept that the younger French star was the focal point of the team.\nMessi has scored 16 Ligue 1 goals and set up 16 goals this season, comfortably the most assists of any player in France’s top flight.\nHe leaves having added two Ligue 1 title winner’s medals to his collection.\nAfter all he won at Barcelona, and his World Cup triumph with Argentina, the French league may not mean that much to Messi when he looks back on his career.\nAs Vincent Duluc noted in France’s leading sports daily L’Equipe: “PSG have not been better than they were before because of him…and he seemed to have as much desire to play in Ligue 1 as he did to go to the dentist.”\nNevertheless, Messi has still left his mark on those who have worked with him and come up against him.\nHe was nominated for this season’s French player of the year prize, even if he missed out on the award to Mbappe.\n“I have had the privilege to coach the best player in the history of football,” said Galtier this week.\n“This year he has been an important part of the team. I have never thought that the criticism of him was justified at all, when he is 35 and there is a World Cup in the middle of the season and yet I think he has scored or set up more than 40 goals in all competitions.\n“It has been a great privilege not to coach him but to accompany him throughout the season.”\nNow it is time for Messi and PSG to move on.\nAFP",
  "word_count": 743,
  "scraped_at": "2026-02-14T02:07:02.905842",
  "_text_extracted": true
}