{
  "article_id": "a7df712db949",
  "url": "https://avenuemail.in/jamshedpur-fc-take-on-mumbai-city-seeking-group-stage-spot-in-afc-champions-league/",
  "title": "Jamshedpur FC take on Mumbai City seeking group stage spot in AFC Champions League",
  "date": "20230403T170000Z",
  "domain": "avenuemail.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There’s unfinished business with Mumbai: Aidy Boothroyd\nJamshedpur, April 3: Jamshedpur FC head coach Aidy Boothroyd remained confident of the team’s chances of success as the Men of Steel prepare to take on Mumbai City FC in the Hero Club Playoffs to decide India’s representative at the 2023-24 AFC Champions League.\n“Very much so”, Aidy said, when asked about whether he was looking forward to the game.\nThe Hero Club Playoffs between Jamshedpur FC and Mumbai City FC will be played in Manjeri, Kerala on 4th April, 2023.\n“The players have been training really hard on their fitness. We’ve had a couple of games, we’ve managed to get the players back to where they were physically and everybody’s very positive and looking forward to this one. We’ve hit a really good patch of form in the last half of the Hero ISL season and we want to keep that momentum going into the next few games starting with Mumbai.”\nThe AFC Champions League is an international football tournament hosted by the Asian Football Confederation (AFC) and is played among the top teams of the continent of Asia. For their upcoming season, AFC allotted a total of 3 slots to India — one in the AFC Champions League Group Stage, one in the AFC Cup Group Stage, and one slot for the AFC Cup Qualifiers. The qualifying games for these spots will be played between April 4th and 3rd May, 2023.\nAfter the Men of Steel clinched the club’s first ever silverware in their record-breaking 2021-22 season, the Hero ISL’s League Winners Shield, they took one step closer to Asia’s most prestigious competition.\nLater in the 2022-23 season, Mumbai City FC also secured their chance to play in their second AFC Champions League Group Stage as they went on to end a triumphant season as the Hero ISL League Shield Winners.\nOn April 4, 2023, the league toppers from the seasons 2021–22 and 2022–23 (Jamshedpur FC & Mumbai City FC respectively) will be battling it out in the Hero Club Playoffs which will guarantee a spot in the AFC Champions League Group Stage for 2023–24.\nThis fixture will be a one-off qualifying game between these two representatives of the Hero Indian Super League and is scheduled to be played in between the Hero Super Cup.\n“It’ll be a tough game because they’re a really good team, Shield Champions, but we’re really looking forward to the game”, Boothroyd said.\n“We feel there’s a bit of unfinished business with Mumbai. We played really well at their place and came away with a draw and our game at home we lost in the dying minutes to a mishit cross so we felt a bit aggrieved about that but that’s football, ” Boothroyd added.\nSony Sports Network and Fancode to broadcast match on April 4\nJamshedpur FC’s upcoming crunch Hero Club Playoffs encounter against Mumbai City FC to decide India’s representative at the AFC Champions League 2023-24 Group Stage will be broadcast live on Sony Ten Sports 2 and Fancode on April 4, the club can confirm.\nThe all-important clash will take place at 8.30 PM IST on Tuesday in Manjeri, Kerala between the League Shield Winners of the 2021-22 season and the 2022-23 season.\nJamshedpur FC were crowned League Shield Winners during the 2021-22 Hero Indian Super League campaign, while Mumbai City FC similarly reigned supreme in the 2022-23 season.\nPer the AFC slot system, a playoff has been scheduled between the League Shield winners of the aforementioned seasons to ascertain the team that will head to the group stages of the highest level of club competition in Asia.\nThe match has been scheduled for April 4, which falls a few days before the Hero Super Cup tournament to be held in Kerala, and will hence be played at Manjeri.",
  "word_count": 636,
  "scraped_at": "2026-02-14T02:09:52.184596",
  "_text_extracted": true
}