{
  "article_id": "a835f5e0fabf",
  "url": "https://metro.co.uk/2025/03/07/cody-gakpo-injury-update-arne-slot-ahead-liverpool-vs-southampton-22686671/",
  "title": "Cody Gakpo injury update from Arne Slot ahead of Liverpool vs Southampton",
  "date": "20250307T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cody Gakpo remains a doubt for Liverpool’s Premier League clash with Southampton on Saturday, Arne Slot confirmed.\nGakpo missed Liverpool’s fixtures with Wolves and Aston Villa after picking up a knock in the Merseyside derby earlier in February.\nThe Dutch forward returned to the squad shortly after and made two cameo appearances off the bench in Liverpool’s wins over Manchester City and Newcastle.\nHowever, having travelled to Paris with the squad for their Champions League last-16 first leg, Gakpo watched from the stands after a recurrence of his ankle injury.\nAnd having not training on Thursday when the squad returned to Melwood, Slot admitted that Gakpo’s availability for Saturday’s clash with Southampton remains up in the air.\n‘He didn’t train yesterday so let’s see if he can train today,’ Slot said in his pre-match press conference on Friday.\n‘Again, it will be a close call – it’s not a long-term injury but he still had a bit of pain yesterday so he didn’t train.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Let’s see where he is today, but I can’t give you a definitive answer.’\nLiverpool face a hectic fixture schedule prior to the international break as they host Paris Saint-Germain in their Champions League second leg just three days after facing Southampton at Anfield.\nMore Trending\nThe Reds must then turn their attention to the Carabao Cup final that Sunday as they look to win their first trophy of Slot’s tenure.\nGiven that intense run, Slot hinted that he could be forced to rotate his side to keep key players fit and sharp.\n‘If there was three, four, five days in between the last game and this one I would have probably started the same 11 again, even if there was only two days in between for the next one,’ he said.\n‘Since there is only two days in between and we had to fight really hard and it’s not the first game after being out for three or four weeks, it’s probably the 50th game in three months – I don’t know how many – so you take that into account but you take the quality from the team you face, you take the form of the players, how fit they are, which players fit best together.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Eddie Howe provides Alexander Isak injury update ahead of West Ham vs Newcastle\nMORE: Gary Lineker wants one thing sorted about Arsenal youngster Ethan Nwaneri\nMORE: Kaoru Mitoma injury update issued by Fabian Hurzeler ahead of Brighton vs Fulham",
  "word_count": 487,
  "scraped_at": "2026-02-14T02:02:35.610492",
  "_text_extracted": true
}