{
  "article_id": "a84bf2a717cd",
  "url": "https://www.masslive.com/tv/2024/12/los-angeles-chargers-vs-kansas-city-chiefs-watch-free-live-steam.html",
  "title": "Los Angeles Chargers vs . Kansas City Chiefs : Watch free live steam",
  "date": "20241209T003000Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The top two teams in the AFC West meet for the second time this season on Sunday, Dec. 8 when the Kansas City Chiefs welcome the Los Angeles Chargers to GEHA Field at Arrowhead Stadium in Kansas City, Mo.\nThe game is scheduled to start at 8:20 p.m. EST and will be broadcast on NBC. Fans looking to watch this NFL game can do so by using FuboTV, which offers RedZone and $30 off on your first month, or DirecTV Stream, which offers a free trial and RedZone. SlingTV has promotional offers available, and NFL+ airs all local market games. Additionally, games on NBC can be watched on Peacock.\nThe 11-1 Chiefs had some extra rest heading into this game after picking up a 19-17 win on Black Friday against the Las Vegas Raiders.\nThe Chargers are 8-4 and in strong position to earn the top wild card spot in the AFC, especially if they can avenge their 17-10 loss to Kansas City from earlier this season.\nWho: Los Angeles Chargers vs. Kansas City Chiefs\nWhen: Sunday, Dec. 8 at 8:20 p.m. EST\nWhere: GEHA Field at Arrowhead Stadium in Kansas City, Mo.\nStream: fuboTV (free trial); or Sling; DirecTV Stream (free trial); or NFL+ or Peacock\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers $30 off the first month for new customers.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is SlingTV?\nSlingTV offers a variety of live programing ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancelation.\nWhat is NFL+?\nNFL+ and NFL+ Premium allow fans access to the most NFL content available online. From game replays, coaches film and all-22 field angles of the games to NFL Network original programing, NFL+ and NFL + Premium allow fans to stay fully locked in with every NFL team no matter where you are in the country.\nWhat is Peacock?\nPeacock is the home to the Premier League, Sunday Night Football, exclusive college football games, WWE premium live events and the Olympics, as well as programing across the NBCUniversal networks.\nMore College Football\n- 2026 CFP National Championship: Watch Miami vs. Indiana for free tonight\n- Where to watch Miami vs. Indiana National Championship free stream today\n- Ticket costs surge for Miami vs. Indiana college football championship game\n- Where to watch Oregon vs. Indiana Peach Bowl free stream today: College Football Playoff Semifinal\n- Where to watch Oregon vs. Indiana in Peach Bowl for free tonight\nRELATED CONTENT:\nNFL’s next coaching cycle will feature an impressive list of candidates: Analysis\nBy ROB MAADDI AP Pro Football Writer\nOn Football analyzes the biggest topics in the NFL from week to week. For more On Football analysis, head here.\n___\nThe next NFL coaching cycle will feature an impressive list of candidates ranging from proven champions to up-and-coming coordinators.\nSix-time Super Bowl winner Bill Belichick heads the list of well-known names that includes 2021 AP Coach of the Year Mike Vrabel. Don’t count out Pete Carroll, and Robert Saleh could get another chance quickly.\nLions offensive coordinator Ben Johnson, Buccaneers OC Liam Cohen, Bills OC Joe Brady and Eagles OC Kellen Moore are among a lengthy list of young offensive-minded coaches who will garner plenty of interest. Lions DC Aaron Glenn, Dolphins DC Anthony Weaver, Chargers DC Jesse Minter and Panthers DC Ejiro Evero are among the coaches on the other side of the ball who’ll receive attention.\nSeveral former head coaches currently serving as coordinators also should be in the mix, including Chiefs defensive coordinator Steve Spagnuolo, Steelers OC Arthur Smith, Vikings DC Brian Flores, Broncos DC Vance Joseph and Commanders OC Kliff Kingsbury.\nPotential college head coaches who could jump to the NFL include Notre Dame’s Marcus Freeman and USC’s Lincoln Riley. Of course, most college coaches say they’re not going anywhere. Riley made that known Wednesday. Deion Sanders already said he’s not leaving Colorado but never say never.\nThe Jets, Saints and Bears already fired their coaches. More teams will make a change. Since 2019, there have been 43 coaching changes. Sixteen of those coaches have already been fired, one retired and a few more could be on their way out.\nOf the 43 hired over the past six coaching cycles, 10 previously were NFL head coaches and two were college head coaches. Of the remaining 31 hires, 25 were coordinators. Jerod Mayo (inside linebackers coach), Dan Campbell (tight ends coach), David Culley (passing game coordinator) and Zac Taylor (quarterbacks coach) made the leap from an assistant role. Antonio Pierce went from linebackers coach to interim coach to head coach in Las Vegas.\nEight teams hired new coaches after last season. The three teams who chose guys who were previous head coaches are currently sitting in a playoff position. Jim Harbaugh and the Los Angeles Chargers (8-4) hold the fifth seed in the AFC. Dan Quinn and the Washington Commanders (8-5) have the seventh spot in the NFC. Raheem Morris and the Atlanta Falcons (6-6) are tied for first in the NFC South with Tampa Bay but hold the tiebreaker because of a season sweep.\nRookie head coach Mike Macdonald has the Seattle Seahawks (7-5) sitting in first place in the NFC West.\nThe remaining first-year coaches are struggling. Pierce, Mayo, Brian Callahan (Titans) and Dave Canales (Panthers) are 11-38 combined.\nA closer look at one coach from each category:\nFormer coach\nBelichick is the biggest name of all, and drew headlines Thursday with news that he interviewed with the University of North Carolina for its coaching vacancy. Though he’ll turn 73 before the start of the 2025 season, he’s eager to get back on the job. Belichick needs to win 27 more games to break Don Shula’s record for most regular-season victories. He’s 15 wins away from passing Shula for all-time victories, including the postseason. Belichick only interviewed with the Falcons last cycle after leaving the Patriots. The main issue would be how much control he’d be willing to cede to the general manager. Belichick has stayed in the spotlight working in the media. He’s showing a different side of his personality that could help him this time around. The Giants could be a fit if they fire Brian Daboll. Keep an eye on the Eagles should the team falter again down the stretch. Nick Sirianni just keeps winning but anything less than a Super Bowl in Philadelphia won’t be considered a success.\nOffensive coordinator\nJohnson will likely be the most coveted young coach again this cycle. He has already interviewed with seven teams (Chargers, Colts, Commanders, Falcons, Panthers, Seahawks and Texans) over the past two seasons but chose to stay in Detroit to finish the job after the team fell short in the NFC championship game. The Lions lead the conference at 12-1 and are first in the NFL in scoring at 31.9 points per game. The Bears need a coach to help develop franchise QB Caleb Williams so they’re an obvious landing spot. Another team that ends up with a pick to land a top QB in the draft would also have to be in the mix. It’s going to be up to Johnson. His options will be unlimited.\nDefensive coordinator\nMinter followed Jim Harbaugh to the NFL from Michigan and has guided the league’s stingiest defense. The Chargers are giving up just 15.7 points per game. Minter previously served as an assistant under John Harbaugh in Baltimore so he has been mentored by well-respected winning coaches.\nCollege coach\nIs it time for Prime Time? Sure, Sanders insists he’s staying put. But suppose the team that drafts Shedeur Sanders to be its franchise QB offers a father-son opportunity. Or, maybe Jerry Jones calls the Hall of Fame cornerback who helped the Cowboys win their last Super Bowl title.\nThe Associated Press contributed to this article",
  "word_count": 1410,
  "scraped_at": "2026-02-14T02:05:30.915262",
  "_text_extracted": true
}