{
  "article_id": "a860f799314f",
  "url": "https://punchng.com/chelsea-in-trouble-before-my-appointment-potter/",
  "title": "Chelsea in trouble before my appointment",
  "date": "20230224T193000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Under-pressure Chelsea boss Graham Potter claims the problems derailing his struggling team had already taken root well before his arrival at Stamford Bridge.\nChelsea are languishing in 10th place in the Premier League, 23 points behind leaders Arsenal, ahead of Sunday’s London derby at Tottenham.\nPotter, appointed as Chelsea manager in September, splashed out more than £315 million ($376 million) during the January transfer window.\nBut the new-look Chelsea still lost 1-0 to bottom-of-the-table Southampton last weekend, with Potter enduring jeers from frustrated fans amid mounting talk that he could face the sack.\nHowever, former Brighton boss Potter is adamant he is still trying to resolve issues that long pre-date his appointment, while also bedding in his young crop of new recruits.\n“It’s really tough. I’ve said this is the toughest job in football. There are lots of factors for that,” Potter told reporters on Friday.\n“The club invested a lot of money in the squad, which (raises) the pressure, the expectation, the noise.\n“But the players that we’ve got, they’re not 28-year-old, 400-game Premier League players. They’re young players that need time to adapt.”\nChelsea sacked Thomas Tuchel in September, fewer than seven weeks after the team returned from touring the United States.\nPlayers had their professionalism questioned publicly by Tuchel after a chastening friendly defeat by Arsenal.\nChelsea’s new co-owner Todd Boehly soon lost faith in the German, even though the coach had won the Champions League just a year previously.\n“We had a sub-optimal pre-season, speaking to our experienced guys, they thought it was the worst they’d ever had,” Potter said.\n“That’s not to blame anybody. It happened. Organisationally, the tour didn’t work as well as they’d like.\n“I wasn’t there, I can’t say. Then there was a manager change, old players have left, new players have come in.\n“Then I turn up in the middle of the Champions League, (playing) Saturday-Tuesday, Saturday-Tuesday. We had the most unprecedented injury situation in that period.”\nChelsea have won just twice in their last 14 games, and have scored a single goal at home in 2023, with Potter accepting fans won’t have much sympathy for the squad’s problems.\n“I don’t think anybody is really bothered,” he said. “That’s the truth. Because I’m the manager of Chelsea. I’ve been asked for four months about pressure. When the results are what they are, you accept them.\n“Supporters are entitled to be angry. My response is there are things that are contributing factors to that result (against Southampton).\n“I’m not here to convince them (with words). My actions have got to convince them. We’ve got to win matches. There’s nothing I can say.”\nAFP",
  "word_count": 441,
  "scraped_at": "2026-02-14T01:55:49.891838",
  "_text_extracted": true
}