{
  "article_id": "a866577e05f1",
  "url": "https://www.masslive.com/tv/2025/04/how-to-watch-national-championship-free-live-stream-caitlin-clark-on-bird-taurasi-show-south-carolina-vs-uconn.html",
  "title": "How to watch National Championship free live stream : Caitlin Clark on Bird & Taurasi Show , South Carolina vs . UConn",
  "date": "20250406T173000Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For the second time in four years the South Carolina Gamecocks will play the UConn Huskies in the NCAA Women’s Basketball National Championship, and on Sunday, April 6 at Amalie Arena in Tampa, Fla. the game will take place.\nThe game is scheduled to start at 3 p.m. EDT and will be broadcast on ABC and ESPN. Fans looking to watch this college basketball game can do so by using FuboTV, which offers a free trial and up to $25 off your first month, or DirecTV Stream, which also offers a free trial. SlingTV doesn’t offer a free trial but does have other promotional offers available. ESPN+ plans are currently at $11.99 a month or $16.99 a month if you bundle with Hulu and Disney+.\nIn addition to watching the game with the standard broadcast, ESPN allows the opportunity to watch with a couple of UConn legends on the call as The Bird & Taurasi Show continues after happening for the Final Four matchups on Friday. Sue Bird and Diana Taurasi will welcome guests, including former Iowa star and now WNBA All-Star for the Indiana Fever, Caitlin Clark, to talk about the game and whatever else comes up.\nThe game itself is a rematch from a matchup in February in which UConn went on the road and beat South Carolina 87-58. However, the Gamecocks still hold the distinction of being the only team to defeat UConn in a national championship game. South Carolina is looking to become the first repeat national champions since UConn won four straight titles from 2013-2016 and the Huskies are looking for their first title since 2016.\nWho: UConn Huskies vs. South Carolina Gamecocks\nWhen: Sunday, April 6 at 3 p.m. EDT\nWhere: Amalie Arena in Tampa, Fla.\nStream: FuboTV; Sling; DirecTV Stream; ESPN+\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $25 off the first month for new customers.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is SlingTV?\nSlingTV offers a variety of live programing ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancelation.\nWhat is ESPN+?\nESPN+ is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programing like NFL Primetime, Dana White’s Contender Series and The Breakdown with Peyton and Belichick. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nRELATED CONTENT:\nDawn Staley has South Carolina one win away from a 3rd NCAA Tournament title in 4 years\nBy DOUG FEINBERG AP Basketball Writer\nTAMPA, Fla. (AP) — Dawn Staley and South Carolina are one win away from joining an elite group of programs in women’s basketball history with a third national championship in four seasons.\nOnly two other schools have accomplished that feat: UConn and Tennessee.\n“It’s hard to break into what Pat Summitt and Geno (Auriemma)” have done for women’s basketball, Staley said. “It’s really hard to even be mentioned in that air. ... Anything that you do and you have sustained success is really, really, really hard.\n“But once you are able to understand what it takes to succeed there, it’s a little easier because you know.”\nAuriemma and the Huskies stand in the way with the teams set to play Sunday for the NCAA title. It’s been nine years since Auriemma’s team won the championship, which capped off a run of four consecutive titles from 2013-16.\nThat win was the most recent of the record 11 national titles that Auriemma has won in his four decades at the school.\nUConn has only reached the title game once since 2016, and during that drought has come up on the short end of heartbreaking last-second losses in the Final Four on buzzer-beaters. The Huskies’ lone title appearance in the past nine years came in 2022 when Staley’s team beat UConn to start the Gamecocks’ current run of success, a game that ended Auriemma’s perfect record in title games.\nAuriemma has a healthy respect for Staley, knowing the South Carolina coach from her playing days at Virginia to her time with USA Basketball. She was an assistant coach for him during the 2016 Olympics before she became the national team’s head coach.\n“To be where she is right now and to have done it in the way that she’s done it, I have a lot of respect for her,” he said. “I have tremendous respect for her knowing how she grew up and how hard she fought to get to where she is today. ... You don’t get here by accident. You get here by being committed and true to who you are. And she doesn’t try to be anything she’s not.”\nAfter losing in the 2023 Final Four to Caitlin Clark and Iowa, the Gamecocks had an undefeated season last year to the school’s third title since 2017.\nThe only UConn player that saw significant time in the title game three years ago against South Carolina was Paige Bueckers. She’ll be playing in her final game for UConn hoping to leave the school with a championship, joining many other Husky greats that have played for Auriemma.\n“I think everything in life has kind of taught me not to take things for granted,” she said. “Being in the national championship game, it’s extremely hard to get to and extremely rewarding to be a part of. And just how much we need to play 40 minutes and how connected we need to stay throughout the game. It’s going to be a game of runs. It’s extremely high stakes.”\nThe teams met earlier this season and UConn stunned South Carolina with a 29-point victory that ended the Gamecocks’ 71-game home winning streak, winning 87-58 on Feb. 16.\nNeither team puts much stock in that game, although BetMGM has the Huskies as 5.5-point favorites despite being the lower-seeded team.\nStaley wants South Carolina’s accomplishments equally acknowledged\nWhile Staley complimented what Bueckers has accomplished for UConn and women’s basketball during her career, she also believes her team’s dominant run over the past few years merits equal recognition.\nWhen the Gamecocks went undefeated en route to their championship last year, the major storyline was Clark, one of greatest college basketball players trying to capture a national title in her final game.\n“Sometimes we create these narratives about great players,” Staley said. “Caitlin was one of them; Paige is one of them right now, and we tend to forget the narrative about what our kids have been able to do.”\nStaley sees a similar sentimental narrative unfolding around Bueckers, who like Clark, has accomplished just about everything at the college level outside of a title.\n“She’s a great player but just because you’re a great player doesn’t mean you need to win the national championship to legitimize it,” said Staley, who led Virginia to three Final Finals, but never won a NCAA title. “Paige is legit. She was legit from the moment she stepped on this stage.”\nStaley’s seniors are also legit. Sania Feagin, Bree Hall and Raven Johnson each will be going for their third national championship in four seasons.\n“I want the sentiments to be about our players and what our players have been able to do — equally, because there’s room to do both,” Staley said. “We can raise Paige up because she deserves that and raise our players up because they deserve that. And that’s not talked about enough. There’s room for it in our game.”\nAnother meeting of the top 2 AP preseason teams\nThis is the seventh time The Associated Press preseason Nos. 1 and 2 teams will play in the women’s NCAA championship game. The 2022 meeting was the previous time it happened and South Carolina kept the top team unbeaten in those matchups.\nThe Associated Press contributed to this article\nMore sports, gear and tickets\n- Where to stream Rising Stars Challenge and HBCU Classic live today\n- Where to watch NBA Celebrity All-Star Game today free\n- How to buy tickets to NBA All-Star Weekend: Celebrity Game, Rising Stars Challenge, All-Star Saturday Night, NBA ASG\n- Where to watch USA women’s hockey game today free\n- 2026 Olympics: How to stream Canada men’s hockey game today live",
  "word_count": 1561,
  "scraped_at": "2026-02-14T02:11:32.321052",
  "_text_extracted": true
}