{
  "article_id": "a875df9ac99e",
  "url": "https://www.barcablaugranes.com/2024/4/27/24142709/will-xavi-regret-staying-at-barcelona",
  "title": "Will Xavi regret staying at Barcelona ? ",
  "date": "20240427T194500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A lot changed for Barcelona over the past few months.\nWill Xavi regret staying at Barcelona?\nA risky move for a manager who had the chance to leave on his own terms\nThe team was in disarray to start the year. We shouldn’t forget that.\n2023 ended with Barcelona on a steep decline, struggling for a result against every opponent across all competitions.\nAntwerp got the better of them, winning 3-2 to close out the Champions League group stage.\nThey crashed out of the Spanish Supercopa after a 4-1 shocker by Real Madrid.\nIn the Copa del Rey, they limped past teams no one has ever heard of. Barbastro? Unionistas? Finally, they were knocked out by cup winners Athletic Club in the quarterfinals.\nDomestically, they dropped points to bottom of the table teams in Villarreal and Granada, and barely got past last place Almeria.\nLet’s not even talk about the December friendly against Club America (they lost 3-2).\nWhy bring all that up now?\nBecause it’s easy to forget the whole picture in the world of professional football that is such a short-term memory.\nWhen Xavi announced he would step down at the end of the season, criticism of the manager in the media, and among many fans, was reaching a fever pitch.\nFrom Xavi’s perspective, I don’t think he was trying to pull some genius mind game with his players. I think his intention really was to walk away. From a footballing point of view, the writing was on the wall.\nBarcelona may be experiencing one of the most difficult periods in its storied history, but it’s still a giant of the game full of pride, with hopes of regaining their rightful place at the top sooner rather than later.\nExpectations were always going to remain high. And any manager to step in was going to have a monumental, if not impossible task, of meeting them.\nAt the time of announcing his intentions to depart, it was a win-win situation for Xavi.\nOption one. Things don’t turn around on the field, but he looks gracious and humble with the gesture. He leaves the job on good terms with the club and the fanbase.\nOption two. Things do turn around on the field. The news gives the team a jolt, breaks the tension and pressure that had been building, and they find their way back into the season. Xavi still leaves at the end of the season, but with his head held just a bit higher.\nIn the end, option two did play out. The team regained their confidence and their form, and in both the Champions League and La Liga, there was something to fight for.\nAnd in the interim we learned a few things.\nFirst, it’s not easy to replace a coach. As Joan Laporta said, stability matters. You can’t just go around sacking managers, treating them like scapegoats, and expecting the decision to be a magic bullet to cure the club’s problems.\nAs an extension of that, we learned that the president really has become fond of the manager. In spite of the continued bad, and unacceptable results, Laporta never put it all on Xavi.\nThat speaks volumes of the leadership at the top.\nSecond, we learned that Xavi never lost the locker room. In fact, the players responded by taking accountability, not making excuses, and finding a way collectively to start winning when it mattered.\nRobert Lewandowski, who Xavi has stood behind for better and for worse (just ask Vitor Roque), finally started hitting his stride.\nRaphinha too.\nThese were Xavi’s men.\nAnd they were joined by the young players from the academy who were also given their big opportunities by the manager.\nPau Cubarsí and Lamine Yamal have become stars in the making.\nFermin Lopez and Hector Fort put in shifts in their limited roles.\nFrom the perspective of Joan Laporta, retaining Xavi was a no brainer. Yes, this season has been a big disappointment, but clearly there was more at play than a poor job done by the manager.\nWhere did it all go wrong?\nPerhaps it was when Gavi, the team’s heart and soul, went down on November 23d while on international duty for Spain.\nOr was it when Iñaki Peña stepped in for months in place of the injured Marc-André ter Stegen, the team’s backbone?\nOr does it go back to the summer, with Ousmane Dembele’s unexpected departure a week before the season began? The Frenchman was the engine that Xavi’s attack ran through.\nOr the multiple of other injuries to key characters. Too many to count.\nXavi was dealt a hand most managers would run away from.\nAnd yet, we also know, as fans who watch every game closely, that the manager made plenty of unforced errors along the way that he had no excuse for. He certainly showed his inexperience on many occasions.\nBut now, it seems clear to most of us that bringing back Xavi, on the final year of his contract, is in the best interest of Barcelona as a club, and at the team level.\nThere was no one better out there, especially considering the financial constraints.\nTactically, he still has a lot to learn. Not just in game, but in the greater strategy he implements from the beginning.\nAnd maybe expectations are more realistic now, and he can manage accordingly.\nBy all signs, he won’t get a lot of help in the transfer window. He’ll have to rely mostly on familiar faces.\nBut those familiar faces have proven they will fight for him.\nAnd that’s where Xavi has been at his best. He is a leader of men. He doesn’t give up. He continues to fight himself.\nBut the big question for me is whether staying is in Xavi’s best interest.\nIt’s rumored that he did have other options, with Manchester United and Ajax showing interest.\nPart of me worries if there may be a bit of a martyr complex going on. He shouldn’t be expected, or encouraged, to sacrifice everything personally and professionally for the club he loves.\nWhat if he has another season without trophies?\nRealistically, will Barcelona be able to compete with a Real Madrid team looking to bring in Kylian Mbappe? And, gasp, with the ambition to steal away Erling Haaland too?\nNext year, it’s important to know what the expectations are.\nWe want to see Barcelona compete for La Liga and the Champions League.\nIn doing so, however, we should also appreciate the challenge that Xavi is taking on.\nHe should clearly define what he means by this “project not being finished yet.”\nBecause in a way, he looks like a glorified caretaker manager now. Maybe the best caretaker you could ask for.\nBut fans and the media will not be patient, or so understanding, with the games coming thick and fast.\nWill Xavi come to regret this decision?\nIt’s a gamble he seems willing, and for the moment, excited to take.",
  "word_count": 1161,
  "scraped_at": "2026-02-14T01:56:51.542392",
  "_text_extracted": true
}