{
  "article_id": "a87b90fd56a0",
  "url": "https://www.orlandosentinel.com/2025/07/14/club-world-cup-marked-by-empty-seats-searing-heat-weather-delayed-matches-and-chelsea-victory/",
  "title": "Club World Cup marked by empty seats , searing heat , weather - delayed matches and Chelsea victory",
  "date": "20250715T014500Z",
  "domain": "orlandosentinel.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By RONALD BLUM and JAMES ROBSON\nAssociated Press\nAn expanded Club World Cup marked by empty seats, slashed ticket prices, searing heat, weather-delayed matches and a criticized field surface ended in a surprise victory by Chelsea, the fourth-best team in the Premier League.\nAmong the lasting lessons was FIFA’s decision to dramatically drop ticket costs as some kickoff times approached, which could impact decisions by fans thinking of attending next year’s World Cup. FIFA lowered the cost to attend the Chelsea-Fluminense semifinal at MetLife Stadium in East Rutherford, New Jersey, to $13.40 from $473.90, then dropped the Chelsea-Paris Saint-Germain final from $330 to $199.60.\nThere will be 104 matches at next year’s expanded 48-nation World Cup and many are likely to be on weekday afternoons. FIFA has not said whether it will use dynamic pricing and refused to comment on discounting.\nThe 63 matches drew 2.49 million, about 62% of the listed capacity. FIFA refused to disclose tournament capacities of venues, focusing on tickets sold rather than about 1.5 million unfilled seats, and would not address price cuts.\nFIFA president Gianni Infantino assessed the expanded tournament he championed, saying: “It is already most successful club competition in the world.”\nFormer Liverpool manager Jürgen Klopp was less enthusiastic, telling the German newspaper Welt am Sonntag it was “the worst idea ever implemented in football” because of demands on players as a result of the extended season.\nPSG played its 65th competitive match and Chelsea its 64th since starting in mid-August. Each team will have 33-35 days off before 2025-26 openers.\n“I told my players that I had the feeling that this competition will become just as important or even more important than the Champions League,” Chelsea manager Enzo Maresco said.\nMaresca called the heat dangerous. Borussia Dortmund coach Niko Kovač said the grass at MetLife Stadium, site of next year’s World Cup final, was so short “it’s more a golf green, so you can putt here.”\nTiny US television audience\nThe streaming service DAZN bought world rights and sublicensed 24 of the 63 matches to TNT Sports, which averaged 418,000 viewers for the first 23 matches with English-language commentary on TNT, TBS and truTV. Seventeen matches sublicensed to TelevisaUnivision with Spanish commentary averaged 551,000.\nBy comparison, NBC’s networks averaged 510,000 viewers per match window for the Premier League in 2024-25, regular-season Major League Baseball is averaging 1.841 million this year on Fox and 1.74 million on the cable network ESPN. The NFL averaged 17.5 million during the 2024 regular season.\nDAZN has not yet released figures but says it will during the week.\nHot seat\nThe temperature was over 90 degrees Fahrenheit for many matches, with humidity that made it feel more than 100.\n“Honestly, the heat is incredible,” Chelsea midfielder Enzo Fernandez said. “Playing in this temperature is very dangerous.”\nSix games were delayed by weather for a total of 8 hours, 29 minutes, raising questions over the suitability of the U.S. for next year’s World Cup during a time of global warming. Only four of the 11 U.S. World Cup venues have roofs, including one that isn’t temperature-controlled.\n“Players have played in these conditions before, but I think it doesn’t make it easy and it doesn’t make it as enjoyable, for sure,” said former Wales captain Gareth Bale, a DAZN commentator who attended the semifinals and final. “It’s one of those things and there’s no real way around it.”\nAt the 1994 World Cup in the U.S., just seven of 52 games had night local time starts in order to broadcast matches during evenings for Europe television.\nMissing champions\nWhile FIFA hyped the tournament as a competition of the best teams in the world, it didn’t include the current champions of England (Liverpool), Spain (Barcelona), Italy (Napoli), Portugal (Sporting Lisbon) and Austria (Sturm Graz) among the dozen European clubs in the 32-nation field.\nLionel Messi’s Inter Miami got an invite even though it has never won the MLS title.\nPlayer welfare\nFor the top players, the Club World Cup meant they likely faced three consecutive years of summer tournaments, following the European Championship and Copa America last year and leading to the World Cup for national teams in 2026.\nManchester City manager Pep Guardiola said the impact of the new tournament might not be known until midway through next season.\n“I may say: ‘So listen, we are a disaster. We are exhausted. The World Cup destroyed us,’” he admitted.\nBayern Munich and Germany star Jamal Musiala likely faces months out of action after sustaining a fractured fibula and broken and dislocated ankle in his team’s quarterfinal defeat to PSG.\nA global game\nFIFA wanted the Club World Cup to help grow the sport globally and shine a light on teams outside of Europe’s most popular leagues.\nBrazilian teams excelled, with all four entrants advancing to the knockout stage. Botafogo produced one of the upsets of the tournament by beating PSG in the group phase while Fluminense reached the semifinals.\nSaudi Arabia’s Al Hilal advanced to the quarterfinals and eliminated Manchester City.\nMessi led Inter Miami to the round of 16, including Major League Soccer’s first competitive win against European opposition, defeating Porto in the group phase.\nThe other U.S. teams — the Seattle Sounders and Los Angeles FC — were less impressive, with both teams exiting winless at the group stage.\nNew Zealand’s Auckland City lost 10-0 to Bayern while a game between South Africa’s Mamelodi Sundowns and South Korea’s Ulsan drew just 3,412 fans.\nA question of quality\nMessi produced moments of magic, but a bout of acute gastroenteritis limited Kylian Mbappe’s involvement.\nWhile many matches in the group stage, in particular, were competitive, only a few games will be remembered for iconic moments.",
  "word_count": 956,
  "scraped_at": "2026-02-14T02:18:43.324695",
  "_text_extracted": true
}