{
  "article_id": "a888ca618a85",
  "url": "https://www.teamtalk.com/news/everton-eye-club-record-signing-english-winger-wolves-battle-tottenham-cast-off",
  "title": "Everton eye club - record signing of English winger as Wolves battle for Tottenham cast - off",
  "date": "20230429T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Everton eye club-record signing of English winger as Wolves battle for Tottenham cast-off\nEverton are embroiled in a transfer battle with Wolves to offer Sporting CP winger Marcus Edwards a second chance in English football, according to reports.\nEdwards came through the Tottenham Hotspur system but was sold by Spurs in 2019 after just one appearance for the first team. He has since revived his career in Portugal, initially with Vitoria De Guimaraes and currently with Sporting.\nThe winger is now enjoying the most prolific season of his career to date. Edwards has scored 12 goals in 46 games in his second campaign as a Sporting player. He even scored against former employers Tottenham in the Champions League.\nThanks to his form, Edwards has earned some attention back in his native England. There have been suggestions of Tottenham taking him back, but an update from Record has revealed two prime candidates to offer him a new opportunity in the Premier League.\nAccording to the Portuguese outlet, Edwards has become a target for Everton and Wolves. Either of them might break their transfer record on him if Sporting get their way.\nIndeed, Edwards currently has a €60million (£53m) release clause in his contract in Lisbon. That figure would make him a record purchase for either Everton or Wolves, but he could yet cost even more.\nRecord claims that Sporting want to raise Edwards’ exit clause to €80m (£71m). They are actually open to selling the 24-year-old this summer, but would want to maximise their potential earnings.\nREAD MORE: Arsenal ‘ready to move’ for gettable Wolves star after Arteta greenlights fresh bid\nMarcus Edwards discussing contract extension with Sporting\nEdwards’ current contract with Sporting is due to last until 2026. Yet negotiations are ongoing over a renewal whereby his release clause could increase.\nThe likes of Everton and Wolves appear to be undeterred with their interest in Edwards. Just because he has a high release clause doesn’t mean that is the price they will have to pay for him.\nEven so, Sporting will have a strong negotiating stance. It will take a major effort for either Everton or Wolves to sign him – especially given that neither of them will have European football on offer next season.\nEverton even remain in danger of relegation to the Championship, since they are currently in the bottom three. Clearly, going down a division would negatively impact their chances of being able to afford or appeal to Edwards.\nBut they might be in with a chance of signing him if they can remain in the Premier League, even if the asking price still seems to be beyond their means.\nEdwards has most commonly played on the right wing this season, although he has also found some opportunities up front. Therefore, he could be a useful reinforcement for either Sean Dyche or Julen Lopetegui’s sides.\nWhether he will be willing to sacrifice involvement in UEFA competitions, though, is something he will have to weigh up.\nREAD MORE: Top Everton earner set to be axed by Sean Dyche with summer exodus incoming as relegation looms",
  "word_count": 517,
  "scraped_at": "2026-02-14T01:55:54.924874",
  "_text_extracted": true
}