{
  "article_id": "a8e19361a426",
  "url": "https://metro.co.uk/2025/03/12/liverpool-vs-newcastle-carabao-cup-final-team-news-predicted-lineups-injuries-22716083/",
  "title": "Liverpool vs Newcastle : Carabao Cup final team news , predicted lineups and injuries | Football",
  "date": "20250312T174500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool and Newcastle United head into Sunday’s Carabao Cup final with injury concerns for both sides.\nArne Slot’s side saw their treble hopes go up in smoke on Tuesday night after they were dumped out of the Champions League on penalties against Paris Saint-Germain.\nWhile the Premier League title appears to be in their grasp, they are likely to be without Trent Alexander-Arnold at Wembley this weekend.\nThe England international was forced off midway through the second-half at Anfield against PSG, appearing to jar his knee as he slid in on Portuguese midfielder Vitinha.\nAlexander-Arnold was replaced by Jarrel Quansah shortly after with Slot admitting post-match his right-back is likely to miss out against Eddie Howe’s side.\nTo compound their problems at right-back, Alexander-Arnold’s regular deputy Conor Bradley is also still sidelined having been left out of the Northern Ireland squad for upcoming games against Switzerland and Sweden.\nWith Joe Gomez also absent, it could see Quansah fill in at right-back with doubts also emerging over the fitness of Ibrahima Konate.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThey centre-half hobbled off the pitch during extra-time but Slot suggested post-match his issue was fatigue rather than a fresh injury problem.\nElsewhere, Cody Gakpo returned from his knock at the weekend and could come back into the side ahead of Diogo Jota and Darwin Nunez.\nNewcastle fell short in their last Carabao Cup final against Manchester United two years ago and are chasing their first major domestic trophy since 1955.\nEddie Howe will be without Anthony Gordon with the former Everton winger suspended as a result of the red card he was shown in the FA Cup defeat to Brighton.\nLewis Hall meanwhile has been ruled out for the rest of the season following foot surgery with Sven Botman absent once again, requiring yet more knee treatment.\nAlexander Isak has been in incredible form this season but injury concerns have never been too far away. The Sweden international started in last Monday’s Premier League game against West Ham United but came off in the 79th minute for Callum Wilson.\nHowe eased any fresh injury concerns over the striker, however, insisting Isak came off because ‘he was tiring’ with ‘no fresh issues’.\nPredicted Liverpool XI to face Newcastle\nAlisson, Quansah, Konate, van Dijk, Robertson, Gravenberch, Mac Allister, Salah, Szoboszlai, Gakpo, Diaz\nPredicted Newcastle XI to face Liverpool\nPope, Trippier, Schar, Burn, Livramento, Guimaraes, Tonali, Joelinton, Murphy, Isak, Barnes\nWhere to watch Carabao Cup final? Kick-off time and TV channel\nLiverpool vs Newcastle kicks off at 4:30pm on Sunday 16 March.\nMore Trending\nLive coverage will be available on ITV1, Sky Sports Main Event and Sky Sports Premier League. You can also stream the match via ITVX, the Sky Go app and NOW TV.\nMORE: Mikel Arteta reveals return plan for Bukayo Saka ahead of Real Madrid showdown\nMORE: Ruben Amorim names three things he loves about youngster Man Utd pinched from Arsenal\nMORE: Leicester vs Man Utd: Latest team news, predicted lineup and injuries",
  "word_count": 549,
  "scraped_at": "2026-02-14T02:02:35.607552",
  "_text_extracted": true
}