{
  "article_id": "a8fd2f8b6928",
  "url": "https://963kklz.com/2024/01/29/journey-changes-dont-stop-believin-lyrics-during-nfl-halftime-show/",
  "title": "Journey Changes  Dont Stop Believin  Lyrics During Halftime Show",
  "date": "20240130T124500Z",
  "domain": "963kklz.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Journey Changes ‘Don’t Stop Believin” Lyrics During NFL Halftime Show\nJourney did a little adlibbing during their halftime performance at the NFC championship game last night (Jan. 28) between the Detroit Lions and the San Francisco 49ers. The game took…\nJourney did a little adlibbing during their halftime performance at the NFC championship game last night (Jan. 28) between the Detroit Lions and the San Francisco 49ers.\nThe game took place at Levi's Stadium in Santa Clara, Calif., the home field of the 49ers. Per Ultimate Classic Rock, when Journey performed \"Don't Stop Believin',\" they changed a notable lyric. Instead of singing, \"Just a city boy/Born and raised in South Detroit,\" Arnel Pineda sang, \"Just a city boy/Born and raised in San Francisco.\"\nUnderstandably, Journey, who formed in the '70s in San Francisco, didn't want to appear to be cheering for the away team. In addition to \"Don't Stop Believin',\" Journey's halftime performance setlist also included \"Separate Ways (Worlds Apart),\" \"Be Good to Yourself\" and \"Any Way You Want It.\"\nIt seems as though the 49ers took the advice of Journey and really believed in themselves in the second half of the game. After being down 24-7 at the half, they staged a massive comeback, defeating the Lions 34-31. The 49ers will face off against the Kansas City Chiefs on Feb. 11 at the Super Bowl, which will be a rematch of the Super Bowl in 2020.\nJourney to Play the Super Bowl?\nJourney's latest NFL gig reminds us of previous comments keyboardist Jonathan Cain made in August 2022. At the time, Journey was announced to be headlining the 2022 Concert for Legends as part of the Pro Football Hall of Fame's \"Enshrinement Week\" where it inducts the latest class of football greats.\nCain told Ultimate Classic Rock that he would love if Journey could parlay that gig into an appearance during the Super Bowl Halftime show. He said, in part, \" ... I’m secretly hoping they might put two and two together and say, 'Wait a minute, maybe Journey and the Super Bowl.'\"\nSports Anthems: It's amazing how they can move thousands and thousands of people all at once. Without a doubt, at least some of these songs on this list will be played at some point during MLB's Opening Day.\nMost sporting events without music nowadays just fall flat. An appropriate soundtrack is practically essential. Now, different sporting events often have different vibes. This can vary by the sport itself, the level of said sport or the region in which the sport is being played.\nWith this in mind, this list was crafted to have some surprises, yet also be overall universal. It's trying to walk a very particular line of mass appeal and unexpectedness. Truth be told, this list of the best sports anthems walks that line rather brilliantly.\nA general view during the 2023 Opening Day game between the Philadelphia Phillies and the Cincinnati Reds at Citizens Bank Park on April 07, 2023 in Philadelphia, Pennsylvania. (Photo by Tim Nwachukwu/Getty Images)\nHow This Best Sports Anthems List Was Determined\nThis author has been to her share of sporting events over the years. Regardless of the sport, there are just certain songs that are ubiquitous at sporting events. Whether it's high school, minor leagues or the pros, these 25 songs deliver on at least one over more of these levels:\n-Does the song help hype up a crowd?\n-Does the song add a new, appropriate level of emotion to a sporting event?\n-Does the song have a unique tie to a team/athlete, but can also transcend it?\n-Does it have a universally recognizable hook?\n-Has it been used in a sports movie, thus, increasing its reach to the general public?\nLook, this list is far from scientific, but it sure is a lot of fun, which is the whole point of any list like this. Frankly, it was a lot of fun to put together. It's even more fun to revisit when major sports events appear on the calendar, from Opening Day to the Super Bowl and everywhere in between.\nFrom rock to hip hop to EDM to pop, here are the 25 best sports anthems, ranked.\n25. Kesha - ‘Blow’\nHere’s the beginning of a theme that’s going to run through this entire list. A great sports anthem needs a killer hook that’s going to pump up the crowd. Whether you’re a Kesha fan or not, the thumping chorus of “Blow” never fails to get people going regardless of how much you might want to deny it.\n24. DJ Khaled - ‘All I Do Is Win’\n“And every time I step up in the building, everybody hands go up/And they stay there.”\nPeople love a victory song, and they also love to do synchronized movements together with hordes of other fans. This is why DJ Khaled’s “All I Do Is Win” is so perfect. Sure, he’s a selfish, greedy lover, but the dude knows how to put out bangers.\n23. Naughty By Nature - ‘Hip Hop Hooray’\nNaughty By Nature’s “Hip Hop Hooray” was seemingly tailor-made for sports arenas. A simple chorus will do that, not to mention everyone rocking and swaying during the chorus in the music video. It’s been an arena classic since it first dropped in 1992. Plus, it’s funny seeing people trying to rap along with Treach and Vin Rock on the verses.\n22. Europe - ‘The Final Countdown’\nSynth riffs rule! If you say they don’t, it must be exhausting kidding yourself so much. “The Final Countdown” has been a sports anthem for decades, especially in the United States. However, the Swedish band wasn’t really aware of it until the 2000s.\nEurope singer and “The Final Countdown” songwriter Joey Tempest said in a 2005 interview, “I did an interview about a year ago with a newspaper from America and they talked about how much it's been used in sports in America… which I didn't know so much about. Apparently, it has been used a lot, and it was nice to hear.”\n21. Tag Team - ‘Whoomp (There It Is)’\nSome acts are here for a fun time, not a long time. While Tag Team was a one-hit wonder with “Whoomp (There It Is),” that hit has massive staying power thanks to its use in a number of movies – from D2: The Mighty Ducks to Elf – and countless time outs at sports events. Can you dig it? We can dig it!\n20. Ozzy Osbourne - ‘Crazy Train’\nJust going to say what we’re all thinking: Randy Rhoads’ classic guitar riff is so powerful and transcendent it could get a funeral hyped up. (Someone try it and report back!) Facetiousness aside, “Crazy Train” has been whipping sports fans into a frenzy for decades. There’s truly no stopping this locomotive beast any time soon.\n19. The Rolling Stones - ‘Start Me Up’\nThe only thing that’s going to outlive Keith Richards is the way people pop as soon as they hear the iconic opening riff to “Start Me Up.” It’s a jolt and the perfect song to play if an arena crowd has lost a bit of energy when their team is trailing. Seriously, the next time you're at a sporting event and the crowd is a bit \"meh,\" it's only a matter of time before you hear that opening riff.\n18. Metallica - ‘Enter Sandman’\n“Enter Sandman” is one of a few tunes on this list that’s both a universal anthem and also uniquely associated with a specific team or athlete. In this case, it’s hard not to imagine legendary closer Mariano Rivera jogging from the bullpen to the mound when hearing “Enter Sandman.”\nFun fact: The unanimously-elected Baseball Hall of Famer doesn’t actually like Metallica. He told MLB Network in January 2019, “With all due respect to the guys, I’ve never been to one [of their concerts]. As a Christian, with all due respect to Metallica, I don’t listen to that kind of music.”\n17. Ramones - ‘Blitzkrieg Bop’\n“Hey! Ho! Let’s go!”\nIt doesn’t take a genius to realize why this Ramones classic is an outstanding sports anthem. Sure, Tommy and Dee Dee Ramone probably didn’t have sports fans in mind when they wrote the song, but it’s another example of songs taking on different meanings after they’re released.\n16. Village People - ‘Y.M.C.A’\nYoung man, are you listening to me? People love simple dances. If you can do the dance after a couple (or a lot) of overpriced beers, that’s even better. Try and deny it all you want, but “Y.M.C.A.” will live forever and will get people moving whether you’re at a sporting event, a wedding, a bar/bat mitzvah or whatever you feel.\n15. Zombie Nation - ‘Kernkraft 400’\nIt took a bit, but techno has finally made its way into this list. You may not recognize the artist or title of this song, but if you’ve attended a sporting event in the past two decades, you most definitely have heard “Kernkraft 400.” Jump to the 1:55 mark in the video below, and you’ll likely say out loud, “Oh! This song!”\n14. Journey - ‘Don't Stop Believin'’\nWhen Steve Perry, Jonathan Cain and Neal Schon wrote “Don’t Stop Believin’,” they probably had no idea how big of an impact the song would make in the sports world. Perry likely didn’t think it would become a rallying song for the 2005 Chicago White Sox and would lead to him being invited to watch the team win the World Series, let alone get to party with them in the locker room and attend the championship parade. The track is also important to Perry’s hometown team, the San Francisco Giants, who play “Don’t Stop Believin’” during the 8th inning of every home game.\nLastly, Detroit Red Wings fans have screamed “born and raised in south Detroit” at home games for years when the song plays at the end of a winning home game. Sure, there is no “South Detroit,” and geographically speaking, south of Detroit is Windsor, Ontario, Canada, but it’s all in good fun.\n13. Eminem - ‘Lose Yourself’\n“If you had one shot, or one opportunity/To seize everything you ever wanted/One moment/Would you capture it or just let it slip?”\nIt’s the kind of tension any athlete or sports fan has felt in a pivotal moment in an important game/match/bout/etc. Some songs just have the ability to connect with the masses on a magical level. “Lose Yourself” is one of those songs. It’s timeless and also mind-blowing to realize it came out in 2002.\n12. Darude - ‘Sandstorm’\nYou’re about to enter a trance, and by “trance,” we mean the EDM subgenre where “Sandstorm” still reigns as one of its most popular hits. The Darude track is closely tied to Gamecocks football at the University of South Carolina. (ESPN.com has a fantastic deep dive about the song’s history with the school’s football program.) Even outside the SEC, “Sandstorm” is still a go-to song to fire up fans the world over.\n11. Neil Diamond - ‘Sweet Caroline’\nSome Boston Red Sox fans love “Sweet Caroline”; others would seemingly rather drink their own urine than hear the song in the middle of the 8th inning at Fenway, according to a 2017 Boston.com feature. Regardless, the song has wormed its way into the realm of sports, likely due to its fun sing-along chorus and the “ba ba baaa” of it all. Depending on how much you’ve had to drink, it could be really fun or really awful for nearby sober people. Either way, it’s here to stay.\n10. Steam - ‘Na Na Hey Hey Kiss Him Goodbye’\nSteam is one of many one-hit wonders in music history, but they certainly made that hit count with 1969’s “Na Na Hey Hey Kiss Him Goodbye.” The track topped the Billboard 100 and is the universal theme song to sing when your team knocks an opposing team out of the playoffs. It can also emotionally wreck you if you happen to be revisiting the 2000 Disney film Remember the Titans.\n9. Survivor - ‘Eye of the Tiger’\nWithout Queen, we may not have Survivor’s “Eye of the Tiger.” Sylvester Stallone originally wanted to use “Another One Bites the Dust” as the theme to Rocky III, but Queen turned Sly down.\nIn a piece for The Tennessean, Survivor keyboardist Jim Peterik said Stallone then reached out to him to see if he could write a song for the latest Rocky movie after hearing the Survivor song “Poor Man’s Son.” Peterik and guitarist Frankie Sullivan were then allowed to see a rough cut of the film, and the rest is history. So, thanks to Queen, who we’ll see a bit later in the list.\n8. 2 Unlimited - ‘Get Ready For This’\nFact: ‘90s dance music just hit differently. 2 Unlimited’s “Get Ready For This” is a prime example of this. The song’s hook is insanely catchy and so energetic it could revive a corpse. It’s not surprising it’s been a sports arena mainstay for decades.\nNaturally, some may hear the track and can only think of two words: “Spirit Fingers.” In response, we say this song’s the poo, so take a big whiff.\n7. AC/DC - ‘Thunderstruck’\nFrom Angus Young’s opening riff to the repetitive group vocal of “ah-ah ah ah ah-ah ah ah,” AC/DC’s “Thunderstruck” has been riling up crowds and teams since the band released the track in 1990.\nWhen hearing the song today, it’s hard not to think about a very hungover West Canaan High School football team getting rocked on the field in 1999’s Varsity Blues. It’s also hard not to think about the “Thunderstruck” drinking game.\n6. Alan Parsons Project - ‘Sirius’\n“Sweet Caroline” is to the Boston Red Sox as “Sirius” is to the Chicago Bulls. The Alan Parsons Project instrumental has been used by many other teams since and in a variety of ways, but it’ll forever be tied to the Bulls. Its original version clocks in at under two minutes, but what a powerful, inspiring and sweeping two minutes it is.\n5. Blur - ‘Song 2’\n“Woo-hoo!” That’s it. What other explanation for “Song 2” do you need, really? The descriptions of some of these songs really don't have to be complicated, much like this Blur megahit.\n4. House of Pain - ‘Jump Around’\nAs we stated at the beginning of this list, hooks were going to be important, and there are monster hooks in “Jump Around.” It’s pretty clear why this hip-hop tune is here. (It came to get down, obviously.) Thanks to the likely drunk University of Wisconsin-Madison students in sections O & P at Camp Randall Stadium, the rowdiness of “Jump Around” will live forever.\n3. Guns N' Roses - ‘Welcome to the Jungle’\n“You know where you are?/You’re in the jungle, baby/You’re gonna die!”\nIt may have been released in 1987, but “Welcome to the Jungle” still sounds as fresh as ever. Its sentiment in relation to sports will endure forever. The fire, the hunger, the rage. “Welcome to the Jungle” has all of that and then some.\n2. The White Stripes - ‘Seven Nation Army’\nThe global impact “Seven Nation Army” has had on sports is almost too grand to express. That song’s minimalist riff has woven its way into so many sports leagues from the UEFA Champions League to the NFL to MLB to even the WWE at WrestleMania 38.\nIn a 2014 appearance on Conan, Jack White said of the sports popularity of “Seven Nation Army,” “People come up to me all the time, and they think it makes me mad for some reason. As a songwriter, that’s the greatest thing that could ever happen. It becomes folk music, because the people take it over. I don’t know of many songs where they’re not chanting words; they’re chanting a melody.”\n1. Queen - ‘We Will Rock You/We Are the Champions’\nPlenty of people may argue about the order of this list, but it’s going to be pretty hard to argue against #1. And yes, they may be separate tracks, but “We Will Rock You” and “We Are the Champions” truly belong as one cohesive opus.\nWe’ve all done the *stomp, stomp, clap* too many times to count, both in and out of sports arenas. If you’ve been lucky enough to see your favorite team clinch a championship, you’ve likely sung “We Are the Champions,” and there was no other glory quite like it. That euphoria is part of the draw to any sport. Fortunately, there’s one hell of a soundtrack for it.",
  "word_count": 2772,
  "scraped_at": "2026-02-14T01:48:39.898635",
  "_text_extracted": true
}