{
  "article_id": "a909948d8906",
  "url": "https://www.geosuper.tv/latest/23384-borussia-dortmund-focus-on-cologne-as-bayern-showdown-looms",
  "title": "Borussia Dortmund focus on Cologne as Bayern showdown looms",
  "date": "20230317T140000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By AFP\nMarch 17, 2023\nBERLIN: With the ´'Klassiker' clash against Bayern Munich on the horizon, Borussia Dortmund will want to avoid a loss of focus against Cologne on Sunday with a title on the line.\nWhile Dortmund have had their share of woes against better sides in recent years, their title challenges have truly come undone in poor performances against the league's outmatched but spirited underdogs.\nLed by pugnacious manager Steffen Baumgart, often seen on the sideline sporting just a flat cap and a t-shirt in the German winter chill, no club embodies the underdog spirit more than Cologne.\nDortmund have stuttered after their barnstorming start to 2023 of 10 wins in 10 matches came to an end with a 2-0 defeat at Chelsea, resulting in elimination from the Champions League.\nThat loss was followed by a 2-2 draw at struggling Schalke, as an outgunned but dogged home side equalised twice.\nA return to winning ways by Dortmund on Saturday would lift them a point clear of Bayern Munich atop the Bundesliga table, for at least one night.\nBayern travel to Xavi Alonso's unpredictable Bayer Leverkusen on Sunday.\nDortmund's next match after Cologne is against Bayern.\nDortmund have not won a league match in Munich since the 2013-14 season, when Jurgen Klopp was still in charge, one reason they have been perennial German football bridesmaids since their last title in 2012.\nWhen Dortmund visited Cologne in October they had a chance to go top but, despite taking an early lead, lost 3-2.\nThat result was in Dortmund boss Edin Terzic's mind on Thursday when he said \"we have been warned enough\" about Cologne\nCologne are on a run of poor form but know another result against a title challenger could put them back on course.\nAfter starting 2023 with a five-match unbeaten run, including a draw at Bayern, Cologne have lost three of their past four without scoring, giving rise to fears the 12th-placed side may be drawn into a relegation battle.\nBaumgart said his side partied a little too hard during Cologne's famous Carnival celebrations in February and are paying the price.\n\"I don't want to offend anyone, but I have now had my experience with the carnival,\" the manager, who joined Cologne during the Covid pandemic, said on Thursday.\n\"That wasn't good for us.\n\"In the future, I will try and do things differently.\"\nThe France international defender's recent turnaround has mirrored that of his club, who now sit two points clear at the top of the Bundesliga.\nBayern stumbled after the winter break but have now re-established their dominance in the league and in Europe.\nAfter scoring his second in Bayern's 5-3 win over Augsburg — his first brace in professional football — Pavard faced the stands and tapped his badge, a sight unthinkable in January when rumours swirled that the World Cup winner wanted out.\nPavard confirmed his commitment in early March, saying Bayern \"can achieve great things this season\" and \"I'm not leaving the ship in the middle of the journey\".\n6 — Bayern Munich's Sadio Mane has had six goals ruled out for offside this season, the most of any player in the top five European leagues.\n0 — Hoffenheim were the only club in the bottom five to lose last round and are dead last on 19 points.\n6/7 — Bayern have won six of their last seven against Leverkusen, a run of victories that includes the 2020 German Cup final.\nFriday\nBorussia Moenchengladbach v Werder Bremen (1930)\nSaturday\nAugsburg v Schalke, Hoffenheim v Hertha Berlin, Stuttgart v Wolfsburg, Bochum v RB Leipzig, Borussia Dortmund v Cologne (1730)\nSunday\nUnion Berlin v Eintracht Frankfurt, Bayer Leverkusen v Bayern Munich (1630), Mainz v Freiburg (1830)",
  "word_count": 622,
  "scraped_at": "2026-02-14T02:19:40.794197",
  "_text_extracted": true
}