{
  "article_id": "a90ebee04303",
  "url": "https://metro.co.uk/2024/09/26/manchester-united-40-000-000-flop-struggling-adapt-new-club-21681045/",
  "title": "Manchester United £40 , 000 , 000 flop  struggling to adapt  to new club | Football",
  "date": "20240926T203000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s £40,000,000 flop Donny van de Beek is ‘struggling to adapt’ to his new club Girona, according to reports.\nThe Red Devils splashed out a huge fee to sign the Dutch midfielder from Ajax in 2020 but he massively struggled before United sold him in a permanent transfer.\nVan de Beek made a total of 62 appearances for United, producing just two goals and two assists in what was a hugely underwhelming spell in England.\nUnited offloaded him to Spanish side Girona in July, but even after stepping down to a smaller club, Van de Beek is still having a hard time getting back to his best.\nThat’s according to Spanish outlet Sport, who report that Van de Beek arrived ‘blighted by physical problems’ due to his lack of game time at Old Trafford.\nVan de Beek’s issues are not just physical, though, with the player also ‘having problems adapting’ to the tactics of his new manager Michel.\nThe 27-year-old has made four appearances across all competitions for Girona to date, three of which saw him come on as a substitute in La Liga.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nVan de Beek was also handed a start in the Champions League against Paris-Saint Germain, playing for 58 minutes before he was taken off.\nMeanwhile, speaking earlier this month, Marco van Basten criticised Van de Beek’s agent for allowing the midfielder to join United in 2020.\nMore Trending\n‘His manager was a bad advisor in that. That step was much too big,’ Van Basten said of Van de Beek’s move to United.\n‘As an agent, you have to be able to decide – I’m sending him to that club, because that’s where he’s going to play. He went to two clubs and didn’t play a match.’\nFrank de Boer added: ‘It’s actually crazy, idiotic and strange that such a player has barely played football for two years. Sometimes you have to join a club that suits you.\n‘At Manchester United I saw him pick up balls on the left wing. I say… ‘you shouldn’t be doing that, you have to go for that goal’.’\nMORE: Arsenal fans claim former star has ‘disappeared’ after being exiled by Premier League club\nMORE: Spanish football president criticises own player for speaking out against racist abuse\nMORE: Barcelona youth prodigy tipped to be Cesc Fabregas’ successor at Arsenal retires at 34",
  "word_count": 446,
  "scraped_at": "2026-02-14T01:49:08.093033",
  "_text_extracted": true
}