{
  "article_id": "a9183a28b393",
  "url": "https://www.espn.com/soccer/blog-the-match/story/4905344/man-united-seize-on-fulham-indiscipline-in-fa-cup-quarterfinal",
  "title": "Man United seize on Fulham indiscipline in FA Cup quarterfinal",
  "date": "20230320T200000Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MANCHESTER, England -- Manchester United booked a record 31st FA Cup semifinal appearance with a dramatic 3-1 win over Fulham at Old Trafford on Sunday.\nFulham looked on course to cause a shock when Aleksandar Mitrovic put the visitors ahead early in the second half before a chaotic five-minute spell saw referee Chris Kavanagh show three red cards to the London side. Willian was sent off for a handball on the line, which gave Bruno Fernandes the chance to equalise from the spot, while Marco Silva and Mitrovic were both shown red cards for their protests.\n- Report: Man United beat nine-man Fulham to reach FA Cup semis\nUnited took advantage of their two-man advantage to score again just 90 seconds later through Marcel Sabitzer, with Fernandes adding a third deep in stoppage time to set up a Wembley semifinal against Brighton.\nRapid reaction\n1. Match turns in United's favour once Fulham lost their cool\nFulham deserved their lead when Mitrovic put them ahead early in the second half, but the game was turned on its head by serious indiscipline just as it looked like an FA Cup shock might be brewing.\nWhen Jadon Sancho's shot was blocked on the line by Willian, Kavanagh was sent to the pitchside monitor by VAR Neil Swarbrick to have another look at the incident. But before he could even watch a reply, he had to send off Silva for his protests on the touch line and then, after deciding Willian had deliberately stopped Sancho's effort with his hand, awarded a penalty and showed another red card to Willian. Kavanagh's card was barely back in his pocket before Mitrovic charged towards him, making it a hat trick of red cards in a matter of minutes.\nFernandes scored the penalty to make it 1-1 and two minutes later Fulham, playing with nine men and no manager, conceded again when Sabitzer turned in Luke Shaw's cross.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nThe visitors looked in control for most of the first 70 minutes, but cost themselves a chance of an FA Cup semifinal through their lack of discipline. Even with 10 men and level at 1-1, there was a chance they could still go through, but Mitrovic, in particular, ended any hope of that by seeing red.\n2. Man United survive without Casemiro, but only just\nIf there was any doubt about how important Casemiro is to this United team, then there shouldn't be now. Serving the first game of his four-game ban following his red card against Southampton, the hole in the centre of the midfield was obvious from the first minute as Fulham dominated the start of both halves.\nIt was a surprise that Erik ten Hag picked both Sabitzer and Scott McTominay while leaving Fred on the bench. Sabitzer and McTominay haven't had a lot of football recently, and they looked rusty against Fulham's midfield three of Andreas Pereira, Joao Palhinha and Harrison Reed. Pereira, who left United for Fulham in the summer, saw a lot of the ball in the spaces Casemiro would have been occupying, and United also seemed to miss the Brazilian's calmness of the ball when they were trying to play out from the back.\nThere was more than one occasion in the second half when Harry Maguire took an eternity to play the ball into midfield because of a lack of options, and the game might have had a different outcome if Fulham hadn't imploded. Casemiro will also miss Premier League games against Newcastle, Brentford and Everton before he returns and Ten Hag will have to rethink how best to cope without him.\n3. Ten Hag's cup decisions pay off\nIt would have been easy for Ten Hag to decide at the start of his first season in charge that he'd prioritise a quick return to the Champions League, but he has fielded strong teams in the cup competitions and overseen 10 straight wins in the Carabao Cup and FA Cup. Victory over Fulham means United are two games away from a domestic cup double -- something even Sir Alex Ferguson never achieved. They are also still alive in the Europa League despite a gruelling campaign that has already included 10 games and could yet mean five more.\nTen Hag says his aim since he arrived at Old Trafford has been to set a \"winning culture\" and that's manifested in a genuine effort to win every game regardless of the competition. He has managed his squad so well that United are on course to comfortably finish in the top four and qualify for the Champions League while also adding silverware. The Carabao Cup is already in the bag and Brighton stand in the way of a first FA Cup final since 2018.\nTen Hag has been brave with his team selections in the domestic cups and it has paid off.\nBest and worst performers\nBEST\n- David De Gea, GK, Man United: The Spaniard kept United in it with key saves before Fulham's five minutes of madness.\n- Antony, FW, Man United: Came on early in the second half and helped turn the game in United's favour.\n- Harrison Reed, MF, Fulham: Caused United problems down their left and was key to Fulham's good start.\nWORST\n- Aleksandar Mitrovic, ST, Fulham: He put Fulham in front, but his red card in the aftermath of the penalty incident cost his team any chance of winning the game.\n- Harry Maguire, DF, Man United: Making consecutive starts for the time since August, he looked like a weak link in United's defence.\n- Willian, FW, Fulham: The Brazilian winger will regret his decision to handle Sancho's shot on the line, a choice that triggered Fulham's meltdown.\nHighlights and notable moments\nThis is how to score at Old Trafford! Mitrovic put Fulham on the board first from this set piece...\nMitrovic puts Fulham 1-0 ahead of Man United in the FA Cup! 😱 pic.twitter.com/j9pLwtULyE\n— ESPN FC (@ESPNFC) March 19, 2023\n... and then came the chaos! Willian's handball on the goal line earned him an obvious red card, but Mitrovic and manager Marco Silva soon joined the Brazilian in the locker room.\n72' - 🟥 Willian\n— ESPN FC (@ESPNFC) March 19, 2023\n72' - 🟥 Mitrovic\n72' - 🟥 Marco Silva\nFULHAM GOT A TRIPLE RED IN 60 SECONDS 😱 pic.twitter.com/gCITmlkl66\nPlaying against nine men was certainly going to make Man United's task easier, and two goals in two minutes promptly put them in the FA Cup semifinals.\nTWO GOALS IN TWO MINUTES TO GIVE MAN UNITED THE LEAD! 😮 pic.twitter.com/aapVSChl52\n— ESPN FC (@ESPNFC) March 19, 2023\nAfter the match: What the players/managers said\n\"A massive win. We wanted to go back to Wembley; we did it. 1-0 down it was hard and tough, but we came back and won it. We were concentrated, focused until the end. I think it was a deserved win. We came back and that's the important thing.\" -- Manchester United midfielder Marcel Sabitzer\n\"Let's talk about all the game and not just one moment. Until the penalty we were clearly the best team of the pitch -- clear. The [red card] was a decision that VAR can make. What is difficult for us to understand is why the two moments in their box in the first half: one of them is a clear penalty on Mitrovic, and no one checks, no one wants to see anything. ... I would like to know what the referee will write [in his report] about what I said to him. -- Fulham manager Marco Silva\nKey stats (provided by ESPN Stats & Information)\n- Aleksandar Mitrovic: second goal in seven career games vs. Man United in all competitions (first since 2016 with Newcastle). Man United is the third of the Big Six clubs against which he has scored multiple goals (two vs. Arsenal, two vs. Liverpool)\n- Willian: third career red card in all competitions. It was his first since March 2014 for Chelsea and first straight red card since April 2007 (Corinthians vs. Náutico)\n- Aleksandar Mitrovic: eight career red cards in all competitions -- all of them straight reds\n- Bruno Fernandes scored his 10th goal of the season across all competitions. He joins Marcus Rashford (27) as the only Manchester United players in double figures, and joins Lionel Messi as the only players from Europe's top five leagues with at least 10 goals and 10 assists in each of the past three seasons (all competitions)\n- Man United: seventh win this season in all competitions when trailing at any point. They have come back to win three of their past four matches when trailing\nUp next\nManchester United: Ten Hag & Co. face a busy week after the international break, with three league fixtures in a week. First comes a trip to Newcastle (April 2) before back-to-back home games with Brentford (April 5) and Everton (April 8).\nFulham: After the break, the Cottagers travel to Bournemouth (April 1) in the Premier League before a home date with fellow London club West Ham on April 8.",
  "word_count": 1524,
  "scraped_at": "2026-02-14T01:48:06.479197",
  "_text_extracted": true
}