{
  "article_id": "a935bda58386",
  "url": "https://www.justarsenal.com/arsenal-hot-faves-to-top-our-group-after-stylish-start-to-our-champions-league-campaign/349287",
  "title": "Arsenal hot faves to Top our Group after stylish start to our Champions League campaign",
  "date": "20230921T170000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal’s dominant return to UCL football\nAfter seven long years, Champions League football returned to The Emirates on Wednesday night and what a return it was. Arteta and his team proving exactly why they deserve to be back in this competition. With a complete show of dominance throughout the entire game, Arsenal returned to the Champions League in style.\nAs the lads walked out onto The Emirates on Wednesday night, the atmosphere was electric, a fully sold-out crowd and the sense of pure excitement around the stadium. Seven long years Arsenal fans have waited to be back in Europe’s biggest competition and as that well known anthem ended, a huge roar of “the Champions” surrounded The Emirates.\nArsenal started the match looking confident and it took just 8 minutes to mark our return to The Champions League, when PSV’s keeper saved a shot from Odegaard but just couldn’t keep a hold of it, and there was Saka, in the right place at the right time to bury the ball into the bottom left-hand corner of the net, scoring his first ever Champions League goal and putting Arsenal in front after 2388 long days out of the competition.\nIt didn’t take long for Arsenal to score a second, with Gabriel Jesus on the counterattack slips through the backline of the PSV defence, passing to Saka for support who dribbled his way to the edge of the box, dropped his shoulder and passed the ball to a completely unmarked Trossard on the edge of the box, who thumps one into the bottom-right hand corner and putting Arsenal 2-0 in front after just 20 minutes.\nEven at 2-0 up Arsenal didn’t sit back at all, continuing to push forward and press hard when off the ball. It didn’t take long for another goal, with a perfect cross in the 38th minute from Trossard to the feet of Jesus, who fired a rocket into the back of the PSV net. Walking down the tunnel at half time, 3-0 up and confident.\nComing out for the second half the pressure didn’t stop. Sitting comfortably at 3-0 meant Arteta was able to look to his bench and make some changes, with the London Derby this weekend, rotation was key and after such a dominant first half, Arteta was able to look to his bench with confidence.\nIn the 70th minute Captain Odegaard sealed off the game with a fantastic finish for the edge of the box, sending the crowd at The Emirates wild and marking off a perfect return to Champions League Football. Walking away with all three points and putting Arsenal in prime position to top the group. After a long journey back, Arsenal and Arteta proved why they deserve to be competing at the highest level.\nWith lowly Lens grabbing a surprise draw at Sevilla in in the other Group Game, Arsenal are now in pole position to top the Group and progress to the knockout stages in style.\nHere are the rest of our ECL fixtures so far…..\nWhat was your thoughts on the game Gunners? How happy are you with our start in the UCL?\nDaisy Mae",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:20:10.965729",
  "_text_extracted": true
}