{
  "article_id": "a9a460f4595b",
  "url": "https://toffeeweb.com/season/24-25/comment/general/46245.html",
  "title": "Nations League Semi - Finals",
  "date": "20250606T214500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Season › 2024-25 › General Forum\nNations League Semi-Finals\nReader Comments (57)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 04/06/2025 at 20:03:05\n2 Posted 04/06/2025 at 20:13:57\nWoltemade is absolutely massive!\n3 Posted 04/06/2025 at 20:17:56\nI hope the krauts don't win. Can't wait… 😀\n4 Posted 04/06/2025 at 20:21:09\n5 Posted 04/06/2025 at 20:31:33\n6 Posted 04/06/2025 at 20:39:30\nThen they have 40-year-old CR7 up front doing his best Brian Glover in Kes impression.\n7 Posted 04/06/2025 at 21:13:06\n8 Posted 04/06/2025 at 21:13:42\n9 Posted 04/06/2025 at 21:22:05\n10 Posted 04/06/2025 at 21:26:02\nIs it just me or does this 6 6in giant not want to challenge for a ball in the air?\n11 Posted 04/06/2025 at 21:34:13\nDoesn't seem to be anything special about him. So, if he wants to join a Champions League club, then they're welcome to him.\n12 Posted 04/06/2025 at 21:34:58\n13 Posted 04/06/2025 at 21:35:50\nNo doubt he'll get the winner 🤣\n14 Posted 04/06/2025 at 21:37:21\n15 Posted 04/06/2025 at 21:37:55\n16 Posted 04/06/2025 at 21:38:44\n17 Posted 04/06/2025 at 21:39:10\n18 Posted 04/06/2025 at 21:56:54\n19 Posted 04/06/2025 at 21:58:06\n20 Posted 04/06/2025 at 21:58:07\nI thought we were already paying?\n21 Posted 04/06/2025 at 22:01:29\n22 Posted 04/06/2025 at 22:06:13\nGermany looked really poor and on this showing they can forget the World Cup next year.\n23 Posted 04/06/2025 at 22:06:40\n24 Posted 04/06/2025 at 22:31:57\nSly he say Yo!!!😀\n25 Posted 04/06/2025 at 22:47:15\nI'm not sure of the spelling but I think he's called Helmut shown...😀\n26 Posted 05/06/2025 at 06:55:46\nFour times World Cup winners, 3 times European Championship winners.\nEngland still dine off 1966 and a few near misses.\nFrance v Spain should be an entertaining one this evening. I'll watch that one.\n27 Posted 05/06/2025 at 08:41:24\nThat's some transition.\n28 Posted 05/06/2025 at 13:04:12\n1. If Liverpool want to spend pds100mil on Wirtz then let them waste their money, cos IMO he's not even worth 30mil.\n2. I hope we stay clear of Waltemade because he looks like an extremely lazy version of Beto. So, sooner keep Beto.\nGlad Portugal won because they were the most inventive team.\n29 Posted 05/06/2025 at 13:15:37\nHe is a clone of Tommy Smith and a lot more.\n30 Posted 05/06/2025 at 13:19:47\n31 Posted 05/06/2025 at 20:14:59\nSome attacking talent on display\n32 Posted 05/06/2025 at 20:26:57\nBrilliantly worked goals\n33 Posted 05/06/2025 at 20:30:51\n34 Posted 05/06/2025 at 20:38:25\nOr is there a secret link?\n35 Posted 05/06/2025 at 20:46:04\n36 Posted 05/06/2025 at 20:47:58\n37 Posted 05/06/2025 at 21:13:37\n38 Posted 05/06/2025 at 21:15:15\nNow it's 4 - destroyed.\n39 Posted 05/06/2025 at 21:16:18\n40 Posted 05/06/2025 at 21:17:50\n41 Posted 05/06/2025 at 21:20:07\n42 Posted 05/06/2025 at 21:27:36\n5 - 1\n43 Posted 05/06/2025 at 21:28:05\n44 Posted 05/06/2025 at 21:31:08\n45 Posted 05/06/2025 at 21:39:22\n46 Posted 05/06/2025 at 21:39:48\n47 Posted 05/06/2025 at 21:43:57\nGame on!\n48 Posted 05/06/2025 at 21:44:25\n49 Posted 05/06/2025 at 21:54:32\n50 Posted 05/06/2025 at 21:56:53\nSpain better side by far but France could actually have scored 8!\n51 Posted 05/06/2025 at 21:57:10\nDeffo, Liam. Unai Simon in the Spain goal made several good saves.\nNobody else been watching this? Missed a cracker if they haven’t. Probably still arguing over whether we should sign Grealish or not? 😁😁😁\n52 Posted 05/06/2025 at 23:00:17\n53 Posted 06/06/2025 at 06:29:22\nWell done France for the comeback but Spain deserved the win overall.\n54 Posted 06/06/2025 at 06:43:27\n55 Posted 06/06/2025 at 06:58:51\nColin @27. Germany last won the World Cup 11 years ago. England? Their only one came nearly 60 years ago.\n56 Posted 06/06/2025 at 08:05:05\nEven though England are superior to Germany and have been for some time. You set a very low bar when you use them as a yardstick.\nThe Germans are no longer a power in in international Football. They had their day when Mechanical football ruled. Having quite possibly the greatest one touch finisher the game has ever seen helped, of course, but the game has moved on. The cream generally rises to the top these days.\nWhile the REAL focus in England is on club football -Despite what you hear from the England fans in Stoney Stratford, Rutland and the rest of middle England. This is where England absolutely Muller's (no pun intended) It's German counterparts.\nThere is an awful lot to learn from other nations around the world at the moment. But nobody will learn anything from this current German generation\n57 Posted 06/06/2025 at 21:01:44\nAlthough the academy system hasn't delivered a right lot to Everton, it is now (after years of investment by other clubs) delivering the most consistent output of Champions League quality English players I've ever seen (I go back as far as Italia 90).\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 895,
  "scraped_at": "2026-02-14T01:52:26.343814",
  "_text_extracted": true
}