{
  "article_id": "a9c872ac643c",
  "url": "https://www.mirror.co.uk/money/shopping-deals/watch-aston-villa-rb-leipzig-34276640",
  "title": "How to watch Aston Villa vs RB Leipzig in the Champions League for free tonight",
  "date": "20241210T104500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How to watch Aston Villa vs RB Leipzig in the Champions League for free tonight\nUnai Emery will be hoping for a third consecutive win as his side travel to Germany on Tuesday for their latest European fixture\nAston Villa are in Germany tonight (December 9) for their UEFA Champions League clash with RB Leipzig. The two sides will meet in Leipzig’s Red Bull Arena on the back of Villa’s two consecutive Premier League wins.\nUnai Emery’s side have already faced tonight’s opponents this year in a pre-season friendly in New Jersey back in August, which ended in a 2-0 defeat to the Bundesliga team. Villa were reduced to 10 men late in the first half when Diego Carlos was shown a second yellow card following an altercation with Leipzig striker Lois Openda.\nThe Villans will likely be without winger Leon Bailey on Tuesday after the Jamaican was taken off in the first half after picking up a hamstring injury. Speaking to Birmingham Live’s John Townley after the game, Emery said: “I think he will be out, hopefully not a lot of weeks but Tuesday I don’t think he will be available. We have to try and use our other players and give them chances. It’s a hamstring issue.\nREAD MORE: Apple TV+ just found a new home in surprise Amazon move\nREAD MORE: TopTech: Sky finally shakes up its deals with new TV package and mobile data this Christmas\nBoth sides have enjoyed similar starts to their respective domestic seasons, with Leipzig sitting fourth in the Bundesliga with seven wins. Villa are currently sixth in the Premier League after seven wins, including their 1-0 win against Southampton on Saturday (December 7).\nIn Europe, Villa are currently ninth in the Champions League table after holding Juventus to a 0-0 draw in the previous fixture, which came after a 2-0 defeat to Club Brugge. Leipzig are trailing in 34th with the German side yet to pick up a single point in the competition.\nSo as both sides gear up for their latest European fixture, here’s how you can watch RB Leipzig vs Aston Villa absolutely free.\nWhen is RB Leipzig vs Aston Villa?\nRB Leipzig vs Aston Villa is scheduled to kick off at 8pm on Tuesday, December 10, with Gabby Logan leading the coverage from 6.30pm alongside Josephine Henning, Roberto Martinez and Thomas Hitzlsperger. Commentary comes from Jon Champion and Alan Shearer.\nHow to watch RB Leipzig vs Aston Villa for free\nRB Leipzig vs Aston Villa will be broadcast on Amazon’s Prime Video and can be streamed free with an Amazon Prime subscription or by signing up for an Amazon Prime 30-day free trial. Prime Video is broadcasting one Champions League match every game week free for Prime members.\nPrime Video will also air this year’s Premier League Boxing Day round of fixtures on December 26-27, including Newcastle United vs Aston Villa. Every Champions League and Europa League game is also available on TNT Sports, which costs £30.99 on a rolling monthly plan with Discovery+ Premium.\nTNT Sports also broadcast NBA, Premiership Rugby, MotoGP, UFC, Boxing and WWE. For football fans looking to catch the latest domestic action, Sky Sports is home to the Premier League, EFL and more, and the broadcaster has just unveiled a major overhaul of its TV packages with the launch of the new Essential TV and Sky Sports bundle.\nFor £35 a month, this includes more than 100 Sky channels like Sky Atlantic and nine dedicated Sky Sports Channels, plus subscriptions to Netflix and Discovery+.",
  "word_count": 591,
  "scraped_at": "2026-02-14T02:20:49.375545",
  "_text_extracted": true
}