{
  "article_id": "a9deaa332de4",
  "url": "https://www.irishecho.com/2025/8/2025-s-top-four-tipped-again",
  "title": "2025 top four tipped again",
  "date": "20250814T233000Z",
  "domain": "irishecho.com",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This time last year people were hesitant about betting against Pep Guardiola. It had been seven years since the name of any club other than his Manchester City or Jurgen Klopp’s Liverpool had been etched onto the Premier League trophy. Sure, it was close in 2024: Arsenal were just two points behind with an identical goal difference. But the first ever four-in-a-row in top-tier history was impressive. Many thought, “Five? Why not?”\nThe Reds had won it in the season of empty stadia, 2020, and were deemed in 2024 to be in transition with Klopp’s shock early retirement. Our Liverpool fan pundits were content to give Arne Slot a year to adjust to the Premier League; only Echo editor Ray, a Manchester United fan, predicted this year’s title win. Meanwhile, Arsenal’s Scott and James, our Evertonian, did impress by naming the top four teams, if not in the correct order — the Reds, the Gunners, City and Chelsea.\nOf course, nobody dares count Liverpool out of the mix this time. They’ve spent a ridiculous amount of money and Slot will want to prove he can win it again in his second season in the league. And as mentioned below, the players will have added motivation in remembering the late Diogo Jota, a star who was universally well-liked and admired within the world of football.\nFew would be shocked, on the other hand, if either Arsenal or 2017 winners Chelsea made the early running and stayed the course until the end. They both have what it takes, or as the TV commentators like to say, they have “that extra bit of quality.” As do City. Nor can one rule out Newcastle making a serious bid, following up on the first domestic silverware since the FA Cup in 1955 — the League Cup, defeating Liverpool 2-1 at Wembley on March 16. And Aston Villa won’t lack for motivation having been deprived of the final CL place on the last day in what they see as the cruelest of circumstances.\nWhat’s surprising here is how few rate Manchester United, a team that was third, albeit a distant third, as recently as 2023. Eventually, you’d think, they’re going to have a team like one of those managed by Fergie.\nThe story of Alex Ferguson and his Six Permanent Successors has become a little like that of Henry VIII and his Six Wives, except that it’s not a case of divorced, beheaded, died; divorced, beheaded, survived — severance, for Moyes, Van Gaal, Mourihno, Solskjær and Ten Hag, came via some variation of “mutual consent.”\nWill Ruben Amorim survive like Catherine Parr? That would, of course, require thriving in the short term. Certain things are aligning — the young Ivorian star Amad Diallo is back from injury; Bryan Mbeumo has signed from Brentford, for whom he scored 20 Premier League goals in 2024-25; they won’t be distracted by European games, nor burdened by huge expectations after the 15th-place finish last season. Something just might click.\nI agree with my fellow Liverpool fans that they will follow up with another title. Overall, one imagines it will be very close in the top third of the table. However, if the Reds have a significant advantage late on, their main rivals might not see a CL place as motivation enough and instead concentrate their energies on European glory in the here and now. Top Four: 1. Liverpool 2. Manchester United 3. Aston Villa 4. Nottingham Forest. (See also Colum McCann's essay on his team in the 2nd-tier Championship.)\nPaul Galligan, labor attorney, Leeds United\nSo, will Leeds break the run of teams promoted going straight back down? Weighing heavily against optimism are the bare and brutal facts that the last six promoted teams have been relegated after only one season in the EPL and it was not even close. However, there are reasons to be optimistic and that we will survive by finishing 16th or 17th if everything goes right. So far, Leeds have bought well in the inflated transfer market, buying physically bigger players and a goalie so we can win games 1-0, like Leeds teams of old. Leeds should be able to compete in midfield, with the acquisitions of Longstaff and Stach, but they look a little slow up front and Farke has started to grumble. There are a few teams that look like they could struggle having lost good players, such as Everton, Palace, Brentford, West Ham and Wolves. And maybe United and Spurs continue to be horrible. Top Four will probably be same old same old, Citeh, Pool and the Gunners, with Chelsea sneaking into 4th.\nJames Rogers, New York Evertonians\nThis season is a momentous one for Everton. After bidding an emotional farewell to Goodison Park, their home for 133 years, this campaign will take place at the club’s new state-of-the-art stadium on the banks of the Mersey.\nWith a stunning new home and after surviving the relegation battles of the last few years there is a sense of optimism among Evertonians. After returning to the club where he made his name, David Moyes guided Everton to safety and a 13th-place finish last season. The cloud of uncertainty over the club’s ownership was also lifted last season when the Houston-based Friedkin Group completed its Everton takeover.\nSet against this backdrop, Everton’s long-suffering fan base is hopeful that Moyes can build on last season and push the club into the top half of the table. But, in some ways this could be a transitional season as Everton adjust to their new surroundings at the Hill Dickinson stadium. A decent cup run would be welcome, though - Moyes is, after all, the last manager to take Everton to a cup final (way back in 2009 when they were defeated by Chelsea in the FA Cup final).\nAs for key players - the arrival of Jack Grealish on loan from Man City has generated plenty of excitement among Everton fans. Grealish’s signing also marks something of a coup by Moyes, who earned a reputation for canny recruitment during his previous Everton stint.\nJordan Pickford, whose heroics helped keep the club in the Premier League in recent years, will once again play an important role. In front of him, great things are expected from towering centre-back Jarrad Branthwaite, whose performances last season cemented his status as a defensive star. News that Branthwaite had signed a new five-year contract with Everton this summer was music to the ears of Evertonians and a clear statement of intent from Moyes about his prized assets.\nTalismanic midfielder Iliman Ndiaye is expected to work his magic again. Capable of turning on a sixpence, the Senegal international bamboozled plenty of defenders last season and ended the season as Everton’s leading goal scorer. Top four: 1. Chelsea 2. Liverpool 3. Arsenal 4. Manchester City.\nChristine Kinealy, historian, Liverpool\nWhat a roller coaster this season has been. Unfortunately, this year’s predictions start on a sad note due to the deaths of Diogo Jota and his brother, André Silva. Go raibh siad ar dheis Dé—May they be at the Right Hand of God. Jota will be missed in Liverpool for multiple reasons.\nBeing champions of the Premier League last season is a tough record to equal. The victory was all the more remarkable given it was Arne Slot’s first year at the club and he was filling some very big shoes. For much of the season also, there was uncertainty regarding the future of three key players. In fairness though, Liverpool’s success was helped by an off-form Manchester City and an inconsistent Arsenal.\nThe summer transfer window has been marked by big spending, which generally means big expectations too. The new names include, Hugo Ekitike, Jeremie Frimpong, Milos Kerkez, Giorgi Mamardashvili, Ármin Pécsi, Florian Wirtz, Freddie Woodman (free) and Will Wright. Frimpong and Kerkez will offer pace and acceleration on the right and left respectively. Hopefully, Conor Bradley will remain fit and fill the hole left by Trent Alexander-Arnold’s departure. However, as the 2014-2015 season demonstrated (following the sale of Luis Suarez), multiple expensive signings do not always lead to an improved squad. In 2015, we finished 8th in the League. Also, these experienced players will be competing with each other to start, and also competing with Liverpool’s impressive range of youth players.\nLiverpool player Diogo Jota, right, and his brother were killed in a car crash in Spain on July 3. He was pictured with Burnley and Ireland’s Josh Cullen while playing for Portugal in a friendly game in June 2024. [Inpho/Bryan Keane]\nSome departures were surprising, others, not so much. Caoimhín Kelleher will be missed, but his reasons for leaving are understandable. While writing this piece, news came through that Darwin Nunez will be departing for Al-Hilal. This is my favorite transfer of the season. His departure will allow Liverpool to recruit an attacker who can be a starter—and who understands the off-side rule.\nWho will be the stand-out performers? Florian Wirtz, who was probably the best player in the Bundesliga, comes to Liverpool with a range of skills that include a potential leadership role. The latter is especially valuable given the departure of Trent, who was the team’s vice-captain. Playing centrally, he could quickly establish himself as part of a new “fab four.” It is also exciting to see if teenagers, Rio Ngumoha and Will Wright, can maintain their summer form.\nWho will be the top four? Liverpool will either be champions, or come fourth. And depending on how they do: Arsenal Manchester City (assisted by their best new signing, Pep Lijnders), Chelsea. As usual, the season will bring many twists and turns, countless thrills and spills, and unbounded joy and despair. And that is why we love the beautiful game.\nKieran Quilligan, Yonkers resident, West Ham United\nI’m expecting a mid-table finish for West Ham, and I’ll be looking out for the performances of Jarrod Bowen, El Hadji Malick Diouf, Callum Wilson and Crysencio Summerville, and expect all to impress. Top Four: 1. Liverpool, 2. Arsenal 3. Man City 4. Chelsea.\nDom Stingas Paczko, Burton-on-Trent resident, Tottenham\nThis season is likely to see Spurs showcase the paradox of modern football, where a better placed league position and no silverware will be seen as progress. We owe Ange Postecoglou a huge amount of thanks for giving us fans the best night we've had in two generations when we lifted the Europa League trophy, but that can't gloss over the fact domestic performances were beyond poor with defeats at home against both Ipswich and Leicester as particularly low points.\nThomas Frank seems to be a solid appointment. Proven Premier League experience at Brentford, a clear track record of improving players and an analytical mind towards football, which will be a stark contrast to the “It's who we are mate” of the last two years. While I don't expect silverware, a league finish in one of the European places should be achievable.\nThis season will be the first in my boy’s 10-year existence without the presence of a global superstar in Son, and with the captaincy likely to land on the arm of Christian Romero, it will be a very big season for him. The arrival of Palhinha in the No.6 role should also help strengthen a midfield that got picked off and pulled apart so easily last season.\nInjuries continue to plague us, Maddison looks likely to miss the whole season, Kulusevski and Udogie look likely to be out until Christmas, while Solankie has only played about 10 minutes of pre-season, so I think we are in for a slow start.\nA big one to watch for me continues to be Lucas Bergvall. I've been telling anyone who'll listen that he'll become the next Luca Modric, and I wholly expect him to play for Real Madrid in the next 5 years.\nIt's hard to see the Top 4 be anything but Liverpool, Arsenal, Manchester City and Chelsea - probably in that order. With Liverpool's summer spending likely to smash through the £300m mark I can see them winning the league at a canter.\nScott Silver, freelance designer, Arsenal\nAfter finishing second again, it seems Arsenal will never win the premiership. They really have to stay healthy, be a bit lucky, and have one of the other bigs falter. It’s hard to see Liverpool taking a step back from last season, when they literally had it wrapped up in March.\nCity, Chelsea and possibly a few others will be hungry to get back into the top few, and hopefully the Gunners have done enough to fend them off. Who knows, maybe half the City squad will be hurt and Liverpool distracted with their European adventures.\nWe did help ourselves by raiding Chelsea of Noni Madueke, a good young winger, and Viktor Gyokeres is already fitting in nicely.\nArsenal star forward Bukayo Saka playing for England against Ireland in a September 2024 Nations League game.\nAn all-Scandinavian midfield is comprised of Martin Odegaard, recently signed Viktor Gyokeres and Christian Norgaard can keep us on the front foot. We just need somebody to do the finishing work, without relying on Declan Rice’s magic.\nAs of press time, I believe we are also close to sigining Eberechi Eze to help do just that. Throw in one of the best players in England (Saka) and once again, a top-two finish, and Champions League knockout stages. Top Four: 1. City 2. Arsenal 3. Liverpool 4. Chelsea.\nJoe Behan, Florida resident, Manchester United\nThey won’t be relegated, too much quality on any given day, but those any given days are far and few between. Still woeful to watch. While expecting better consistency shouldn’t be too hard to achieve based on last year’s lackluster effort. Because United is below par we get to see more of the opposition, whereas before it was all United. Teams like Villa and Newcastle will also prove tough to beat, never mind Top Four. Those days are gone. Best to keep expectation level headed. A mid-table finish.\nEach and every player has to do well at the Theater of Dreams. However some more players need to exit as it is not going well for them. Fernandes needs to step up every week but some sides are just too good. Still he’s one of United’s better players. Amad Diallo can show up and adds injection on the wing. Top Four: 1. Liverpool 2. Arsenal 3. Chelsea 4. Man City.\nJay Mwamba, Irish Echo, Manchester City\nAn injury-induced aberration or is Manchester City’s incredible dynasty really over? That’s probably the question millions of EPL fans the world over are asking as the 2025-2026 beckons. Although they rallied late to finish a respectable third behind winners Liverpool and runners-up Arsenal, last season was one to forget for Pep Guardiola’s side.\nAt one point, City, who’d come off an unprecedented fourth straight PL title [and sixth under Guardiola] the previous year, could only manage one win in 13 games. That included a string of five consecutive losses – a dubious first for Guardiola in his illustrious coaching career. Champions League, PL and FA Cup treble winners in 2023, City’s lone hope for glory came in the FA Cup where they were consigned to defeat by Crystal Palace.\nThe general consensus is that City’s awful campaign was as a result of a double whammy: Father Time and injuries to key players.\nThe latter started with the loss of influential linkman and 2024 Ballon d'Or winner Rodri to a ruptured ACL in September. Skipper and playmaker Kevin De Bruyne, defenders Ruben Dias and Nathan Ake; Phil Foden, and even their free-scoring giant of a striker Erling Halaand, all spent long periods out with injury. Father Time, meanwhile, seemed to descend on several veteran players at the same time, including the aforementioned De Bruyne, Bernardo Silva, Ilkay Gundogan, and Kyle Walker [later loaned out], leaving City to flounder.\nYet there were brief moments even before the injuries struck when City struggled to break down opponents with that possession football ingrained in Pep’s DNA.\nThe arrival of midfielder Nico Gonzalez from Porto, Egyptian forward Omar Marmoush and two young defenders, Abdukodir Khusanov and Vitor Reis, in January was supposed to address some of the club’s personnel issues. Marmoush made an impact and helped drag City up the standings in late spring.\nWhere to now for the most successful English club of the last decade? More reinforcements arrived over the summer, most notably hitherto Wolves left fullback Rayan Aït-Nouri, highly regarded Dutch midfielder Tijjani Reijnders and French attacker Rayan Cherki.\nStill, there’s a feeling by this writer that this new infusion of blood aside, Guardiola, with a rep as one of the best managers in history, will need to reinvent himself in order for City to maintain its dominance in the PL.\nIndications are that the other clubs have figured out City’s game and that it’s time for City to make adjustments and play a little more direct.\nThey are still good enough to compete in the top four and should have company there this season in the form of defending champions Liverpool, Arsenal and Chelsea. Expect one of that quartet to be crowned English champions come May 2026.\n[Jay Mwamba is author of “Crash of the Buffalo,” an account of the 1993 plane crash that wiped out Zambia's national soccer team and how a nation responded.]\nJohn Spinks, visual artist, Newcastle United\nWe finished fifth last season in spite of losing at home to Everton in the final fixture. We got to the Champions’ League through the back door thanks to the Man United’s defeat of Aston Villa. The Isak dilemma is a betrayal and undermines the stability of the squad. Newcastle are touted as “the wealthiest club in the world,” but they are constrained by financial rules and the harsh truth that Saudi largesse has turned frugal. Communication between the executive level and squad management has declined since the departure of Amanda Stavely and her husband.\nThe mood is not buoyant – but. On we go! Reasons to be cheerful! We beat Liverpool in style to win the Carabao Cup. We have a midfield trio as exciting as any in Europe. Two cutting edge Brazilian Geordies and an Italian who has the edge of a reformed gambler: Guimarães, Joelinton and Tonali. Tonali is my favorite. Fabian Scharr, a defender with vision and flair. Anthony Gordon, gifted but not the finished article, he has yet to find himself. There’s talk of him playing in a center forward role. Stranger things have happened. Joelinton was a striker and was redefined by Howe’s coaching. I was amazed to see that we paid only £36 million for him in the days of Steve Bruce. Livramento and Dan Burn will return from their tutelage under Tomas Tuchel with the England squad. Harvey Barnes still blows hot and cold, another unfinished product.. The Academy could yield a surprise prospect; I don’t know enough about the simmering potential of youth at Newcastle, but it’s there. I’m excited about the promotion of Leeds and Sunderland to the Premiership. It should provide some toothsome fixtures. Short commutes for away fans makes for spirited support. Prediction for Newcastle: above the middle of the table. Top Four: 1. Liverpool, 2. Chelsea, 3. Arsenal, 4. Villa.\nRay O’Hanlon, Irish Echo, Manchester United\nUnited enjoyed a good summer tour of the U.S. with Summer League wins over West Ham and Bournemouth in Met Life Stadium in New Jersey, and Soldier Field in Chicago respectively. The Red Devils drew with Everton in Atlanta. This was all to the good but it could also serve to raise expectations for the new season with all the attendant pressure on Ruben Amorim and his men. That said, Amorim will start the season with at least four new summer signings, a clutch of young up and coming players, and a core of experienced first teamers led by the ever vital Bruno Fernandez. United will open their new season on Sunday, August 17 with a home game against Arsenal. This is no easy prospect, but being a real challenge this game should give United fans an early telling look at the very outset of the campaign. United scored 44 goals in their 38 games last season. Clearly that total will have to be significantly exceeded in 2025-26 if United hope to challenge for a top four position at season’s end. So, top four? Well, that would be a long way up from United’s 15th place finish back in May. You have to believe that United will finish higher next May. But the question is how high? And the fact that there is a question at all says much about the current state of affairs at Old Trafford. We shall see. Top Four: 1. Arsenal 2. Liverpool 3. Chelsea 4. Man City.\nMichael O’Sullivan, Jesuit priest, Liverpool\nWhen asked for “current favorite player” last year, I named Diogo Jota. A big question concerning Liverpool now is how they are going to react to his untimely and tragic death. Will grief and deep questions about what is life all about going to affect the performance of the players and club in ways that will make it difficult to retain their Premier League title? Or will the players respond by doing it for Jota? I also find it hard to know how Liverpool will do this year because of the comings and goings in the transfer market. It is still unclear who will form the first team this year.\nChelsea have bought big and will be buoyed up by winning the FIFA Club World Cup. However, their efforts in doing so may also impact the team's capacity to keep going at the top as the season goes along. Man City are in transition and Arsenal still have to convince that they have the strength to meet the pressure when the going gets really tough.\nI will be interested to see how the new players blend in with the rest of the Liverpool squad. Will Bradley tie down what had been Trent-Alexander's position? Will an aging Salah continue to produce at the highest level? Will Liverpool's new no. 2 goalkeeper do as well as Kelleher when called upon, which could happen more than might be expected given Alisson's increasing susceptibility to injury? I said last year that Slot might get the best out of Gravenberch because of the national connection between them, and that certainly happened. It looks like Nunez will move on and if Liverpool get a forward who can be relied upon to score more frequently than Nunez did, then that would be a great boost to Liverpool's hopes of retaining their title.\nMy heart does not allow me to look beyond Liverpool for the title with the hope, too, that they will play with the desire in their heart, head, and limbs, to do it together for Jota, and so I will go with them over Chelsea, whom I expect to be their main challenger despite the fatigue factor they may be affected by after the club world cup as the rigors of the season take their toll. Top Four: 1. Liverpool; 2, Chelsea; 3. Arsenal; 4. Manchester City.\n[Michael O’Sullivan recently told his story of going back to Chile 41 years after he was forced to leave by the Pinochet dictatorship on this podcast]\nLiam Ó Conghaile, Garda, Manchester United\nManchester United enters the season with a lot to prove. Ruben Amorim has received strong backing from the owners, with over £200 million spent on an attacking lineup that includes two proven Premier League players, Cunha and Mbeumo, along with the exciting and much-needed striker, Benjamin Sesko. If this trio can score a combined total of 40 goals in the Premier League this season, United could secure a top-six finish. Not being in Europe, United can concentrate fully on the league and have an outside chance of top 4 if they bring the work rate and energy that’s been lacking for years.\nSo players to watch for: Sesko, who can help make Amorim's first full season as club manager; Kobbie Mainoo, a young midfielder who has the potential to be a leader already; Cunha, whose Brazilian magic can win us games alone.\nManchester United defender Harry Maguire. [Inpho/Evan Treacy]\nLiverpool have so many outstanding attacking options that it is hard to see them stopped unless the new signings don’t gel; then Arsenal have a chance to pip them with a new quality striker finally in tow. But I think the tragic loss of Diogo Jota will galvanize the Liverpool squad to do something special this season in his memory. Top Four: 1. Liverpool 2. Arsenal 3. Chelsea 4. Man City.\n[Liam Ó Conghaile is from the village of An Trá Bháin on the Gaeltacht coast. He spent the past 12 months as a McCabe scholar at John Jay College of Criminal Justice.]\nJim Rogers, writer, Tottenham\nI think we'll battle for a Europa League spot. But that is dependent upon some decent signings to bolster the squad. Of the current players, I’m excited about Bergvall. I think he will have a fantastic season. At the top, I’m expecting a repeat of last season, except that City will be 2nd and Arsenal 3rd.\n[Jim Rogers, as James Rogers, is the author of the novel “Flight of the Eternal Emperor.”]\nStephen Boland, retired UPS worker, Liverpool\nArne Slot won the title with basically a Klopp team. That definitely wasn’t expected. This year the team is more to his liking. Caoimhin Kelleher is going to start for Brentford. It’s win-win for him. As good a goalkeeper as he is, he was never going to replace Alisson. I think Slot might concentrate a lot more on the Champions League this year; he’s just won the Premier League. PSG were the better team last year, but I think the CL is wide open for him. But I do think they want to win the Premier League as well. The players to watch out for are all the new signings. Florian Wirtz, if he fits in, will be excellent. Before the end of the transfer window, they might bring in Isak from Newcastle and they need a replacement center-half, although I really like Konate beside van Dijk. Top Four: 1. Liverpool 2. Arsenal 3. Manchester City 4. Chelsea.\nNiall O’Leary, architect and Irish-dance teacher, Manchester United\nManchester United have just had their worst season in over 50 years. Enough already! Sometimes you have to get worse before you get better. Anyone can have an off-day, or in this case an off-season; actually, we might as well call it an off-season, since the original meaning of the term has evaporated due to all the meaningless gallivanting around Asia and the Free World in the summer months.\nWell now, Man United have just signed Benjamin Šeško, the best striker in the world who is under the age of 23 — note Erling Haaland is now 25 and Rasmus Højlund is 22, and sadly he is more in the running for worst striker in the world of any age.\nIn tandem with the signings of Cunha and Mbeumo, this represents a completely different attacking threat than at any time in the last 10 years. Lazy Rashford is now gone, and if Man U. decide to rest Bruno Fernandes, we can now field a really strong team where every player's surname ends with a vowel. This is even without Bomb Squad outcasts Sancho, Garnacho and Malacia. As one of the many Irish whose surname begins with a vowel, this has turned my world upside down, and that is what I forecast for Man U this season — 15th at the end of last season, I predict 5th at the end of this season.\nRuben Amorim has brought in his own cookbook and, now that he has his own ingredients, the team will fizz and sizzle and excite once again!\nAm I grasping at straws, paper straws?! Enough of papering over the cracks, this is our first proper rebuild in years, we are due some luck, and I am an optimist!\nTop four: 1. Liverpool 2. Chelsea 3. Man City 4. Arsenal, and 5. Manchester United, back in the Champions' League!\n{For more about Niall O’Leary, go to www.nialloleary.com.]\nPaul Finnegan, former IBO president, Chelsea\nThis time last year, there weren't many predicting that Liverpool would be the champions. But that's how it turned out. Among the few who did, it should be noted that the Echo's Ray O'Hanlon was among them. An act of bravery on Ray's part, which has given me the fortitude to predict that Chelsea will lift the trophy this time around.\nThese are not the mad ravings of a lifelong Chelsea supporter, delusional on the crest of victory in the Club World Cup, a fan whose life began even before the Blues languished for years on the muddy battlefields of the old Second Division. No, they come from a reasoned assessment of a key indicator. Namely, Chelsea have regained their mojo. I've seen this story before, several times since their star began to ascend in the late 1990s, even before Abramovich, a story that has always led to trophies.\nLast year I backed Chelsea to finish in the Top 4, which they did. I was in the minority on that one, wasn't I? It's a slow burn, but they are building something solid, a different model under their new ownership. And exciting. Long term contracts for some real talent. The midfield is really strong with Caicedo and Hernandez. Their defense is improving rapidly, and they seem to have a real striker now in yet another purchase from Brighton, João Pedro. And Rory Delap's boy, Liam. And what about that Cole Palmer? Enough said. Top Four: 1: Chelsea 2: Liverpool 3: Arsenal 4: Man City.",
  "word_count": 4984,
  "scraped_at": "2026-02-14T01:52:36.775521",
  "_text_extracted": true
}