{
  "article_id": "a9f55a31906d",
  "url": "https://www.fourfourtwo.com/features/arsenal-vs-fulham-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match",
  "title": "Arsenal vs Fulham live stream , match preview , team news and kick - off time for this Premier League match",
  "date": "20230825T153000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal vs Fulham live stream, match preview, team news and kick-off time for this Premier League match\nFind a Arsenal vs Fulham live stream for this Premier League clash\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nArsenal vs Fulham live stream and match preview, Saturday 26 August, 3pm BST\nArsenal vs Fulham live stream and match preview\nLooking for a Arsenal vs Fulham live stream? We've got you covered. Arsenal vs Fulham is not being shown in the UK. Brit abroad? Use a VPN to watch the Premier League with your subscription from anywhere.\nArsenal have kicked off their season strongly with two wins, though both performances could have been improved. Mikel Arteta will certainly want more from his players if they are to challenge for the Premier League title again, but six points from six is all that matters.\nFulham, meanwhile, impressed with an away victory at Everton on the opening day, but couldn't keep up that level of performance as they welcomed Brentford to Craven Cottage last weekend. A 3-0 loss means Marco Silva will be demanding they recover quickly, though doing so at the Emirates could prove a tall order.\nKick-off is at 3pm BST. Make sure you know how to watch the Premier League wherever you are.\nTeam news\nArsenal are without new signing Jurrien Timber for a number of months, though the full extent of his knee injury isn't yet known. Gabriel Jesus will be out until at least September. Takehiro Tomiyasu is also suspended after being sent off against Crystal Palace on Monday night.\nFor Fulham, Tim Ream is in the same situation as Tomiyasu, after getting a red card against Brentford last weekend. Willian is not fit enough to return and misses out.\nArsenal XI: Ramsdale; Partey, White, Saliba, Kiwior; Odegaard, Rice, Havertz; Saka, Trossard, Martinelli.\nFulham XI: Leno; Tete, Diop, Bassey, Robinson; Palhinha, Lukic; Reid, Andreas, Wilson; Jimenez.\nForm\nArsenal: WW\nFulham: WL\nReferee\nPaul Tierney will be the referee for Arsenal vs Fulham. His assistants will be Neil Davies and Scott Ledger, with Thomas Bramall the fourth official. Darren England is the VAR, with Dan Cook the assistant VAR.\nStadium\nArsenal vs Fulham will be played at the Emirates Stadium in London, which has a capacity of 60,704.\nKick-off and channel\nArsenal vs Fulham kick-off is at 3pm BST on Saturday 26 August in the UK. The game is not being shown live in the UK.\nIn the US, kick-off time is 10am ET / 7am PT. The match will be shown on NBC in the US. See below for international broadcast options.\nVPN guide\nUse a VPN to watch Premier League football from outside your country\nIf you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit.\nA Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result.\nThere are plenty of good-value options out there. For the Premier League, FourFourTwo currently recommends:\nExpressVPN including a 30-day, money-back guarantee\nFourFourTwo’s brainy office mates TechRadar love its super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS5 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Go get it!\nInternational Premier League TV rights\n• UK: Sky Sports and TNT Sports are the two main players, but Amazon also have a slice of the pie in 2023/24.\n• USA: NBC Sports Group are the Premier League rights holders, with the Peacock Premium streaming platform showing all 380 games in the season. A fuboTV subscription also lets you watch every game.\n• Canada: The way to watch Premier League football in 2023/24 is fuboTV, which has exclusive rights to all the action.\n• Australia: Optus Sport will screen every game of the Premier League season.\n• New Zealand: Sky Sport are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 937,
  "scraped_at": "2026-02-14T02:29:25.739358",
  "_text_extracted": true
}