{
  "article_id": "aa0dc893ac81",
  "url": "https://www.winnipegfreepress.com/business/2025/04/14/denver-nuggets-boss-josh-kroenke-says-firings-of-coach-and-gm-were-months-in-the-making",
  "title": "Denver Nuggets boss Josh Kroenke says firings of coach and GM were months in the making – Winnipeg Free Press",
  "date": "20250414T204500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "Canada",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Denver Nuggets boss Josh Kroenke says firings of coach and GM were months in the making\nAdvertisement\nDENVER (AP) — Denver Nuggets boss Josh Kroenke said Monday that he twice balked at firing the winningest coach in franchise history and the general manager who connected the final pieces of the team's only championship puzzle before finally canning them last week with just three games left in the season.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nDENVER (AP) — Denver Nuggets boss Josh Kroenke said Monday that he twice balked at firing the winningest coach in franchise history and the general manager who connected the final pieces of the team's only championship puzzle before finally canning them last week with just three games left in the season.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 14/04/2025 (305 days ago), so information in it may no longer be current.\nDENVER (AP) — Denver Nuggets boss Josh Kroenke said Monday that he twice balked at firing the winningest coach in franchise history and the general manager who connected the final pieces of the team’s only championship puzzle before finally canning them last week with just three games left in the season.\nKroenke held off in November to give the team time to jell and an eight-game winning streak heading into the All-Star break tempered his desire to part ways in February with coach Michael Malone and GM Calvin Booth.\nKroenke finally fired both men last week in a move that stunned the league because the Nuggets had already secured a seventh consecutive playoff berth and were less than two years removed from the city’s first NBA championship parade.\n“So, what would be crazier, me doing what I did last week or doing it on an eight-game winning streak?” Kroenke asked.\nOnly one of those eight wins leading into the All-Star break came against a team that would make the playoffs, the Orlando Magic, the No. 7 seed in the East.\n“I think that those eight games masked a trend that was going on behind closed doors that ultimately started to really affect the end of our season,” Kroenke said.\nKroenke said he also seriously considered a change around Thanksgiving with the Nuggets off to a so-so start and “I was really feeling like things weren’t headed in the right direction.” But he said he held off then to give the team time to settle in.\nDespite leading Denver to its first title in 47 years, Malone and Booth long clashed over roster philosophies, a discord that led to a toxicity in the organization that began to affect the team’s fortunes and which led Kroenke to fire them both.\nThe Nuggets won all three games under interim coach David Adelman to secure a third consecutive 50-win season and the fourth seed in the West, where they’ll open at home Saturday against the fifth-seeded Los Angeles Clippers.\nKroenke said he’ll commence a search for both positions after the season but he demurred when asked if he wanted to have a GM in place before hiring a head coach: “My thoughts aren’t there because this season’s not over.”\nKroenke also announced he’d promoted Ben Tenzer to interim GM for the playoff run.\nKroenke began his nearly 30-minute news conference, his first since the firings, by praising Malone and Booth: “I want to start off by initially just staying thank you to both Calvin and Coach Malone … And to be frank, neither one of them deserved it, so for that I apologize.”\nKroenke said he ultimately made the decision to move on from both men “with the hope of kind of rejuvenating the energy of the group and re-establishing some positive thoughts before the playoffs. I think we did that over the last three games … still have a long way to go.”\nJoker considerations\nNikola Jokic is the gemstone of the Nuggets’ roster and the changes at the helm were driven in part by the desire to capitalize on whatever prime playing years the three-time MVP has remaining.\n“You have a responsibility when you have a player like that, especially, obviously, in his prime,” Kroenke said. “But I feel an even greater responsibility to the person. … I’d be the dumbest guy in basketball if I wasn’t asking him for his opinion on certain things. But it’s my responsibility to make those decisions for the best of the organization and I think Jokic understands and respects that.”\nMizzou meddling?\nKroenke debunked the notion that he was unwilling to trade anyone not named Jokic, including fellow Missouri alum Michael Porter Jr., following reports that he nixed a deal for the long-range sharp-shooter at the trade deadline.\n“If it wasn’t such a serious accusation, I would probably laugh a little harder,” Kroenke said. “I’d say any kind of report that we’re not open to trading everybody possible to improve the team is completely false.”\nHe added: “I’m certainly not going to be green-lighting any trades around here when I don’t see complete organization cohesion and we’re not maximizing the group we got.”\nMixed emotions\nKroenke noted that he couldn’t always be on hand at Ball Arena to police the winning culture that had started to ebb with Malone and Booth at odds.\n“I have a wide array of responsibilities across our businesses at this point,” Kroenke said of the family’s sports empire, which includes the Los Angeles Rams, the Colorado Avalanche and English soccer club Arsenal.\n“I mean, last Tuesday was the craziest Tuesday that I could have ever imagined. I had the worst morning that I’ve had in over 10 years with the Nuggets followed by the most amazing afternoon I could have ever asked for with the Arsenal Football Club,” Kroenke said. “We beat Real Madrid 3-0 in the quarterfinals of the Champions League … On a human level, that was a rough Tuesday for me. It was all over the place.”\n___\nAP NBA: https://apnews.com/nba",
  "word_count": 1185,
  "scraped_at": "2026-02-14T02:26:33.613000",
  "_text_extracted": true
}