{
  "article_id": "aa17b14c96f8",
  "url": "https://www.90min.com/posts/virgil-van-dijk-reveals-liverpool-approach-facing-chelsea-carabao-cup-final",
  "title": "Virgil van Dijk reveals Liverpool approach to facing Chelsea in Carabao Cup final",
  "date": "20240223T131500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Virgil van Dijk reveals Liverpool's approach to facing Chelsea in Carabao Cup final\n- Van Dijk expected to captain Liverpool in Sunday's Wembley showdown\n- Dutchman no stranger to finals & assumed captaincy after Jordan Henderson exit\n- Liverpool billed as favourites despite mounting injury problems\nLiverpool captain Virgil van Dijk says it's business as usual as the club prepare to take on Chelsea in the Carabao Cup final.\nThe Dutchman will skipper the Reds for the first time in a major final, having taken over the captaincy after Jordan Henderson's departure, though he does have plenty of experience of playing at Wembley.\nVan Dijk was part of the Liverpool side that beat Chelsea in the Carabao Cup final two years ago - a game settled after an epic penalty shootout - and he was also a key figure in previous Champions League, FA Cup, Super Cup and Club World Cup successes.\nLiverpool's preparations have been hampered to key personnel - Trent Alexander-Arnold, Alisson, Dominik Szoboszlai, Diogo Jota, Curtis Jones and Thiago are injured and doubts remain over the fitness of Mohamed Salah and Darwin Nunez - but Jurgen Klopp's charges are viewed as favourites against Mauricio Pochettino's inconsistent Chelsea.\nSpeaking to club media channels, Van Dijk insisted that Liverpool's players are remaining focused on what they can do - a practice the 32-year-old abides by at all times.\n\"The thing is, and I think how we always have been in our success and in our focus, is that we focus on ourselves,\" he said. \"Obviously they have their goals but I want to look at our goals, I want to achieve our goals that we have and we want to go out there and win the final.\n\"We know it's going to be a tough game because Chelsea is a very good team with very good individual players that can make a difference.\nWATCH 90MIN'S FULL CARABAO CUP FINAL PREVIEW ON YOUTUBE!\n\"So, we have to be very good but I am definitely looking forward to the final and hopefully we can make it a proud Liverpool day and get our first trophy.\"\nOn the occasion itself and having the chance to lead Liverpool out at Wembley, he continued: \"It's a special feeling.\n\"Playing finals for this football club is something out of this world and obviously you don't want to lose finals first and foremost, but it is always a special thing and it is the first chance for silverware.\n\"Hopefully, if it happens, it will give us a massive boost for the last part of the season. It's amazing and we all should enjoy the occasion, but definitely be out there and show the quality that we have.\"\nVictory on Sunday would keep Liverpool on course for an unprecedented quadruple, with Premier League, Europa League and FA Cup glory all a realistic possibility in what is Klopp's final season in charge.",
  "word_count": 484,
  "scraped_at": "2026-02-14T02:13:34.144680",
  "_text_extracted": true
}