{
  "article_id": "aa576b1acf0b",
  "url": "https://www.africanexaminer.com/slot-wary-of-premier-league-dangers-despite-big-man-city-win/",
  "title": "Slot Wary Of Premier League Dangers Despite  Big  Man City Win",
  "date": "20250224T073000Z",
  "domain": "africanexaminer.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Slot Wary Of Premier League Dangers Despite ‘Big’ Man City Win\nLatest Headlines, Sports News Monday, February 24th, 2025(AFRICAN EXAMINER) – Liverpool boss Arne Slot said the depth of quality in the Premier League means his side can take nothing for granted despite opening up an 11-point lead with a 2-0 win against Man City on Sunday.\nSecond-placed Arsenal have a game in hand on the leaders, but Slot’s men took a giant stride towards a record-equalling 20th English top flight title thanks to their first league win at the Etihad Stadium for a decade.\nCity have dominated English football during Pep Guardiola’s time in charge, including an unprecedented run of four consecutive titles in the past four seasons.\nHowever, they have been a diminished force this season and now find themselves 20 points behind Liverpool down in fourth.\n“If you play away at the Etihad, if you win there, it’s always a big win, no matter what the league table looks like,” said Slot.\nThe travelling Liverpool support sang “we are going to win the league” as City ran out of ideas in their forlorn pursuit of a way back into the game after Mohamed Salah and Dominik Szoboszlai struck in the first half.\nSlot, though, remains cautious after suffering a shock FA Cup exit to second-tier Plymouth Argyle earlier this month and being pushed all the way by relegation-threatened Wolves in a 2-1 win last weekend.\n“The fans can sing whatever they want, I think they’ve been singing it quite long already. But we know as a team how hard we have to work for every single win,” added Slot.\n“So in every other league, having a lead like this would be very comfortable, except for this one, because in this league, every single game gives you a lot of challenges.\n“Even Plymouth Argyle gave us a lot of challenges.”\nCity’s defence of their title was realistically ended long ago when Guardiola’s men suffered a miserable run of one win in 13 games between October and December.\nAfter a chastening Champions League exit to Real Madrid in midweek, City were far more competitive against the Premier League champions-elect.\nThe home side enjoyed 66 percent possession and had 16 shots on goal to Liverpool’s eight.\nBut City were missing the talismanic presence of Erling Haaland through injury, while Liverpool could rely on Salah for inspiration in the final third.\n“I think (Jeremy) Doku and Savinho played an incredible game and got to the by-line a lot but then just from there we missed the magic,” said Guardiola.\n“We played really good so I have no regrets. The chances in the final third, when we want to shoot and cross, for the amount we arrived there, we did not create much.”\nCity have by Guardiola’s own admission looked an ageing team at times in their fall from grace this season.\nBut the Catalan coach saw signs of rejuvenation as three of his January signings, Omar Marmoush, Nico Gonzalez and Abdukodir Khusanov, started along with the likes of Doku, Savinho, Rico Lewis and Phil Foden.\n“I saw a bright future. Other than Kevin (De Bruyne) and Nathan (Ake), they are the future of this club in the next years, with others who will come in future windows.”\nRelated Posts\nShort URL: https://www.africanexaminer.com/?p=100983",
  "word_count": 551,
  "scraped_at": "2026-02-14T02:14:59.449645",
  "_text_extracted": true
}