{
  "article_id": "aa627d33f876",
  "url": "https://www.caughtoffside.com/2024/12/13/tottenham-working-sign-defender/",
  "title": "Tottenham working to sign a central defender in January",
  "date": "20241213T124500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are looking to sign a quality central defender when the transfer window reopens in january.\nAccording to former Premier League scout Mick Brown, Tottenham are working to get a deal done for a quality central defender and it is likely to cost them a substantial amount of money.\nBrown said to Football Insider: “Tottenham’s biggest problem is their instability in defence.\n“After these injuries they’ve suffered, I’m told they’re already working on identifying players who they could sign in the transfer window.\n“The problem is, there isn’t an excessive amount of available defenders mid-way through the season.\n“Spurs want to sign a top-class defender who can step in and make a difference, but that will cost big money in January.”\nSpurs need defensive additions\nThe North London club are lacking in depth when it comes to the defensive unit and it is no surprise that they are looking to sign a quality central defender. Cristian Romero, Micky van de Ven and Radu Dragusin are the only reliable central defenders at the club right now. Romero and Van de Ven have had their fair share of injury problems and Tottenham need more depth in the side.\nFurthermore, Romero has been linked with an exit from the club as well.\nIt will be interesting to see if they can bring in the right additions during the January window.\nTottenham have had a mediocre start to the season so far and they will be desperate to secure Champions League qualification for the next season. They must look to bring in quality additions in January in order to bounce back strongly and finish high up the table.\nApart from a quality defender, they should bring in a versatile forward and a defensive midfielder as well. They need to add more goals to the side and they need someone who will protect the defensive unit from the midfield and allow the creative players to operate with more freedom.",
  "word_count": 325,
  "scraped_at": "2026-02-14T01:58:00.751346",
  "_text_extracted": true
}