{
  "article_id": "aa7d029d1471",
  "url": "https://impactnottingham.com/2025/03/champions-league-quarter-finals-preview/",
  "title": "Champions League Quarter - Finals Preview - Impact Magazine",
  "date": "20250315T141500Z",
  "domain": "impactnottingham.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sam Bunce\nThe Champions League is heating up with the Round of 16 matches now decided. Ultimately, those that had the firepower advanced, while those that faltered at the final stages were knocked out. The first legs of the quarter-finals for this year’s competition will take place on Tuesday 8th April and Wednesday 9th April and the second legs for each tie will commence a week later.\nBayern Munich vs Inter Milan\nSimone Inzaghi’s Inter Milan will travel to the Allianz Arena with only one singular goal conceded in their eight league phase matches, which came in their away loss to Leverkusen, and then they let in one penalty against Feyenoord in the last 16.\nInter have returned to their intimidating defensive Italian outfit\nWith a playing career with his focus firmly set on goalscoring, the managerial career of Inzaghi has turned this on its head with immense efficacy. Inter have returned to their intimidating defensive Italian outfit they had been renowned to be against some of the best in Europe this term.\nIt is another tight domestic league title race in Italy with Napoli and Atalanta breathing down the neck of Inter, who are the reigning Serie A champions, and took the trophy last season with just 2 losses while accumulating 94 points.\nMarcus Thuram has been a standout performer, producing a precisely curled effort into the top corner against Feyenoord in their last 16 contest. Before taking on Bayern Munich on the 8th April, Inter go to Atalanta, and then AC Milan, who they have failed to win against at the San Siro in the three occasions they have faced one another this season.\nBayern Munich, the powerhouses of German football, lost in the semi-finals last season as Joselu’s late brace for Real Madrid brutally dumped them out, and crushed their hopes of a place in Wembley’s final.\nLeverkusen also went unbeaten in a record-breaking season, and in Vincent Kompany’s third roll of the dice in management at one of the biggest jobs in the world, he is on course to decisively dethrone Bayer Leverkusen, led by Xabi Alonso.\nThey did just that in the Round of 16 with a 5-0 aggregate score across the two legs over Leverkusen, so that they could reach the quarter-final stages for a sixth consecutive time and pursue their seventh Champions League trophy.\nIt was far from smooth sailing for The Bavarians up until that point however, as losses to Barcelona, Aston Villa, and Feyenoord away from home left them clinging on to qualify.\nIn typical Bayern Munich fashion though, in the knockout play-offs, Alphonso Davies snatched a late win against Celtic, since he remained alert to a rebound in the final minute in the second leg at the Allianz Arena, where they have been unconquerable in Europe’s most gruelling sporting competition.\nThey also have Bundesliga top scorer, and the Bundesliga’s most expensive signing in history, Harry Kane, at their disposal. They are so often reliant on their marksman’s moments of quality, not simply in goalscoring, but equally in assisting and bringing others into play.\nEngland’s all-time leading goalscorer has 10 goals to his name in the Champions League this season, and he will need to produce something of note to stand tall against the fortified Italian block, especially when they travel to Milan for the second leg.\nBarcelona vs Dortmund\nThis clash has goals written all over it as both teams led the way in the number of goals scored in the Champions League’s league phase.\nNiko Kovac’s men currently sit in 10th place in the Bundesliga, and they are the lowest domestically placed side of all those left in the Champions League. It has been far from progress and they have lacked consistency, but this competition leaves anything up for grabs regardless.\nDortmund were finalists at Wembley last season and have that confidence behind them to build upon. Serhou Guirassy is one to watch for Dortmund with 10 goals in the Champions League in this breakout season for the Guinea international, who could have caught the eye of other European giants come the end of the season if Dortmund continue experiencing difficulties in the league.\nThe two sides met on Matchday 6 in December with Barcelona edging it 3-2 with Guirassy scoring a double that night. Ferran Torres ensured Barcelona secured the three points with a brace after Raphinha got himself on the scoresheet for the opener. The Brazilian winger is the Champions League’s top scorer with 11 goals and he has the most assists with 5.\nRaphinha’s ability to find the net is the best in this competition right now\nConsidering the Champions League top-scorer had 8 goals last campaign, Raphinha’s ability to find the net is the best in this competition right now and it is one of the best individual performances across this prestigious European spectacle that we have seen for some time.\nBarcelona finished 2nd in the league phase, with only Liverpool better than them. Barca scored the most goals in the league phase with 28, but they will need that attacking firepower to offset some of their defensive concerns, which could keep them from getting over the line, as they let in 13 goals.\nThey remained unbeaten after the opening defeat to Monaco which saw Eric Garcia pick up an early red card. In their Round of 16 match against Benfica, who they narrowly defeated in the league phase with a Raphinha goal in the pouring rain, Pau Cubarsi also got a first half red card to put his side at a disadvantage yet again.\nRaphinha stepped up in the first leg so his team could take a one goal lead back to Catalonia, which they utilised and held onto with a 3-1 win in Barcelona.\nBarcelona or Dortmund could possibly collide with Bayern Munich in the semi-final. Therefore, Hansi Flick could face his former club where he won the Champions League, or it could be an all-German showdown.\nArsenal vs Real Madrid\nOn the other side of the draw, the current second placed teams in the Premier League and La Liga will battle it out.\nThe Gunners only conceded three goals in the league phase and they finished in third to automatically qualify for the Round of 16. A 2-0 win at home against PSG on Matchday 2 epitomised their solid performances across their eight games.\nKai Havertz and Bukayo Saka both scored under the lights at The Emirates, but now they are both injured and leave Mikel Arteta light on attacking options. They have seen a significant dip in their Premier League results as Liverpool continue to extend their gap out of the reach of Arsenal, with Mikel Merino and Ethan Nwaneri now inserted into the front line.\nHowever, they did manage to win 7-1 away at PSV, making them the first team to score seven goals away from home in a Champions League knockout tie. There was a variety of goalscorers and it did not look like Arsenal had any problems. It was a performance of one of the best sides in Europe. The second leg allowed Arteta to field a less strong side, and the pressure was off for once going into a game for Arsenal.\nThe only time Arsenal have played Real Madrid in the Champions League came in the 2005/06 campaign, before they moved into The Emirates. Thierry Henry made it 1-0 to the Arsenal at the Bernabeu with a tenacious and driving dribble before slotting past Iker Casillas.\nAt Highbury in the second leg, it was a 0-0 deadlock as Arsenal restricted the likes of Ronaldo, Zidane and Raul to five shots on target. Arsene Wenger’s side then eventually progressed to the final that season where they lost 2-1 to Barcelona.\nReal Madrid have had cracks in their results\nA performance of a similar nature will certainly be needed, but Arsenal’s deteriorating squad depth is poised to be punished against the 15-time Champions League winners. Real Madrid have had cracks in their results as they finished in the knockout phase play-off places after they lost to Lille, AC Milan and Liverpool.\nThe knockout play-offs saw them go to the Etihad to face Manchester City who they have been put up against in the last four seasons.\nJude Belingham’s last gasp effort took a 3-2 lead to Madrid, where Kylian Mbappe would score his third Champions League hat-trick to sink the struggling Citizens.\nIn order to conclude who would reach the quarter-finals, a serious local rivalry unfolded between Atletico Madrid and Real Madrid, which lit up the Spanish capital.\nIt was 2-1 to Real Madrid in the first encounter earlier this month but Atletico got the overall scoreline back to 2-2 with Conor Gallagher. He snuck into the box to tap home less than a minute after kick-off as Diego Simeone’s side came sprinting out the blocks at the Metropolitano Stadium.\nThe match was decided by a penalty shootout and Real Madrid claimed victory, as Julian Alvarez’s goal was controversially written off as he knocked the ball from one foot to the other as he struck the ball, and Antonio Rudiger forced his penalty through the palms of Jan Oblak to put Los Blancos through. The reigning champions have reached the semi-finals in the last four seasons, and it seems unlikely that Arsenal will make them stumble.\nPSG vs Aston Villa\nCould this finally be the year they win it? The only thing that has come to matter from the PSG supporters to the ownership is taking home the Champions League. They are runaway leaders in the French top flight once again and it has always been the question as to if they could take the next step against the best in Europe.\nIt feels like a long time since their loss to Arsenal on Matchday 2, and they did go on to lose against Atletico Madrid and Bayern Munich in the league phase. Yet, after the defeat to Bayern Munich they went more than three months before losing again.\nDespite Liverpool’s 1-0 steal in Paris through substitute Harvey Elliot, the Parisians went to Anfield and Ousmane Dembele and Gianluigi Donnarumma delivered with a goal and crucial penalty saves respectively in a massive statement win.\nWorld Cup winner Ousmane Dembele is on course for a stunning season with 20 goals in Ligue 1, stepping out of the shadow of Kylian Mbappe previously. He now has one of the best conversion rates in the Champions League and is acclaimed as one of the best in the world right now.\nMeanwhile, Unai Emery is a manager who has guided a team to the Champions League semi-finals. In the 2021/22, he was at the helm of Villarreal’s European underdog story, and provided great service to the Yellow Submarine with a Europa League win in the season before. As soon as he came in to replace Steven Gerrard in October 2022, Aston Villa resurrected themselves with only Arsenal, Manchester City, Liverpool and Man United earning more points in the Premier League since Emery took charge of Villa.\nVilla faced Club Brugge in the Round of 16, winning 6-1 on aggregate\nThey now find themselves fighting for European places in the Premier League once again and they just about secured an automatic qualification place in the UCL. Villa faced Club Brugge in the Round of 16, winning 6-1 on aggregate with Marco Asensio making a significant difference. The three-time UCL winner with Real Madrid signed on loan to Aston Villa from PSG at the end of the January transfer window.\nIt would be a consequential miss if he could not start, however, fortunately UEFA rules permit players on loan to play against their parent club.\nUnai Emery will be facing his former club and he could be on the cusp of making more history. But, PSG stand firmly in the way and they have been tipped by many to go all the way as they knocked out one of the strongest contenders, Liverpool, earlier this week.\nSam Bunce\nFeatured image courtesy of Janosch Diggelmann via Unsplash. Image use license found here (Unsplash). No changes were made to this image.\nIn article image 1 courtesy of @championsleague via Instagram. No changes were made to this image.\nIn article image 2 courtesy of @433 via Instagram. No changes were made to this image.\nFor more content including uni news, reviews, entertainment, lifestyle, features and so much more, follow us on Twitter and Instagram, and like our Facebook page for more articles and information on how to get involved.\nFor further sports content and ways to get involved, follow @ImpactSport on Twitter and Instagram, and like the Impact Sport Facebook page!",
  "word_count": 2114,
  "scraped_at": "2026-02-14T02:18:17.725981",
  "_text_extracted": true
}