{
  "article_id": "aabc10159e1b",
  "url": "https://www.90min.com/explained-new-uefa-womens-champions-league-europa-cup-formats",
  "title": "Explained : New UEFA Women Champions League and Europa Cup formats",
  "date": "20241224T104500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Explained: New UEFA Women’s Champions League and Europa Cup formats\n- UEFA have confirmed all the dates and details for the reformatted Women’s Champions League\n- A new secondary competition will be introduced from next season\n- 90min looks at the new formats and key dates ahead of 2025/26\nWomen's European football is set for a major shake-up next season with the Champions League undergoing a reformat and the introduction of a new competition, the Europa Cup.\nThe changes mark a significant evolution for the women's game and echo the structure seen in men's European competitions, which also underwent a revamp from the start of the current campaign. The UEFA Women’s Champions League, which began as the UEFA Women’s Cup in the 2001/02 season, will adopt a new format that aims to expand its competitiveness, while the Europa Cup provides an additional platform for clubs across the continent to test themselves on the big stage.\n90min takes a closer look at the revamped format of each competition, the key changes fans need to know, and the crucial dates to mark in their calendars for the 2025/26 season.\nWomen’s Champions League format\nFrom next season, the Champions League will have expanded entry and an 18-team league phase that will replace the group stage format. Teams will no longer play three opponents twice and will instead face six different teams in a league, playing half of their games at home and half of them away.\nThe six opponents will be determined by a draw, with each team ranked in three different seeding pots based on their latest club coefficient ranking. Each team will be drawn to play two opponents from each pot, playing one match from each home and away.\nResults from these matches will determine the ranking in the league phase, and it is hoped this new format will increase the competitiveness right until the end of the round, rather than groups being decided with numerous games left to play, as is currently the case. The top four teams out of the 18 will automatically qualify for the quarter-finals, while those placed fifth to 12th will compete in a two-legged knock-out play-off to book their place in the last eight.\nThose who automatically qualify for the quarter-finals will be seeded and will play the second leg at home. From that point onwards, the competition will follow the existing format leading to the final.\nIn terms of qualification, the previous season’s winners automatically qualify, as well as the domestic champions of the six top-ranked national associations. The runners-up of associations one and two will also progress directly into the league phase, with the remaining places to be determined by the qualifying path.\nIn 2025/26, the champions and runners-up of France and Germany will automatically qualify for the league stage, along with the champions of Spain, England, Portugal and Italy.\nWomen’s Champions League key dates\nQualifying\n- 16 June - First and second qualifying round draw\n- 30 July - 2 August - First qualifying round (one-venue mini-tournaments)\n- 27 August - 30 August - Second qualifying round (one-venue mini-tournaments)\n- 1 September - Third qualifying round draw\n- 11 September - Third qualifying round first leg\n- 18 September - Third qualifying round second leg\nLeague phase\n- 19 September - League phase draw (date still TBC)\n- 7/8 October - Matchday one\n- 15/16 October - Matchday two\n- 11/12 November - Matchday three\n- 19/20 November - Matchday four\n- 9/10 December Matchday five\n- 17 December - Matchday six\nKnockout rounds\n- 19 December - Knockout phase draw (date still TBC)\n- 11/12 February - Knockout phase play-off first leg\n- 18/19 February - Knockout phase play-off second leg\n- 24/25 March - Quarter-final first leg\n- 1/2 April - Quarter-final second leg\n- 25/26 April - Semi-final first leg\n- 2/3 May - Semi-final second leg\n- 22, 23 or 24 May - Final at Ullevaal Stadion in Oslo\nEuropa Cup format\n13 teams will enter the newly-formed Europa Cup directly, this being the third-placed teams in the domestic league from associations ranked 8-13 and the runners-up of associations ranked 18-24. The Europa Cup will also offer a second chance to clubs eliminated in the third qualifying round, as well as the runners-up and third-placed teams from the second qualifying, of the Champions League.\nThere will be no league phase or group stage in the Europa Cup as it will be a straight knockout that will run in parallel with the Champions League. Six rounds in total will be played, starting with the first and second qualifying rounds and concluding with a two-legged final at the end of the season.\nWinners of this competition will automatically qualify for the third qualifying round of the champions path of the following season's Women's Champions League, meaning they will have just one round to negotiate for a place in the league stage of the primary tournament.\nEuropa Cup key dates\nQualifying\n- 8 August - First qualifying round draw\n- 10/11 September - First qualifying round first leg\n- 17/18 September - First qualifying round second leg\n- 19 September - Second qualifying and knockout round draw\n- 7/8 October - Second qualifying round first leg\n- 15/16 October - Second qualifying round second leg\nKnockout rounds\n- 11/12 November - Round of 16 first leg\n- 19/20 November - Round of 16 second leg\n- 11/12 February - Quarter-final first leg\n- 18/19 February - Quarter-final second leg\n- 24/25 March - Semi-final first leg\n- 1/2 April - Semi-final second leg\n- 25 or 26 April - Final first leg\n- 2 or 3 May - Final second leg",
  "word_count": 950,
  "scraped_at": "2026-02-14T02:11:20.838575",
  "_text_extracted": true
}