{
  "article_id": "aad830ac9928",
  "url": "https://www.cornnation.com/2025/1/30/24355052/thursday-flakes-john-cook-retires-dani-busboom-kelly-hired-and-nebrasketballs",
  "title": "Thursday Flakes : John Cook Retires , Dani Busboom - Kelly Hired , and Nebrasketballs",
  "date": "20250130T170000Z",
  "domain": "cornnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Here on my famous-as-me recliner of solitude, I’m officially pouring one out for the end of the John Cook era at Nebraska. Man, what a spectacular 25 years it has been with him at the helm of Nebraska volleyball. 4 National Titles, 12 Final Fours and 14 Conference Titles. He’s coached more wins than anyone else in those 25 illustrious years. He’s the man responsible for having the most attended volleyball games per season and all-time. His vision will carry on a legacy throughout the volleyball world. Thanks for everything Coach Cook, you will be sorely missed. Here are your flakes...\nThursday Flakes: John Cook Retires, Dani Busboom-Kelly Hired, and Nebrasketballs\nDon’t forget the joke of the week...\nNEBRASKA:\nNebraska Volleyball: John Cook Announces Retirement - Corn Nation\nDani Busboom Kelly is named the 4th head coach of Nebraska Volleyball\nDani Busboom Kelly named head coach of Nebraska volleyball | NCAA.com\nFormer Nebraska volleyball star and Louisville head coach named successor to John Cook.\nHow to Watch Nebraska Women’s Basketball at Purdue: Preview, Breakdown, TV Channel\nThe Huskers look to rebound in West Lafayette after seeing their five-game winning streak snapped by No. 12 Ohio State.\nHow to Watch Nebraska Men’s Basketball vs. No. 17 Illinois: Preview, Breakdown, TV\nThe Huskers aim to ends their nightmare run of six-straight losses by taking down a ranked Illinois team at home.\n“OTHER” FOOTBALL:\nChampions League draw: Why Man City can face Bayern, Real Madrid - ESPN\nThere is going to be a blockbuster Champions League knockout playoff round tie between Manchester City and Bayern Munich or Real Madrid. Here’s why.\nUEFA Champions League highlights: Man City advances, Liverpool holds onto top spot | FOX Sports\nHere are the live results and standings for Champions League Matchday 8.\nWho could Liverpool, Arsenal, Aston Villa, Man City and Celtic face in UEFA Champions League play-offs and last 16? - Eurosport\nHow does the UEFA Champions League play-off draw work? When is it? Who could British teams face?\nROUNDBALL NEWS:\nNBA commissioner Adam Silver raises possibility of league moving to 10-minute quarters - Yahoo Sports\nSilver floated the idea of 40-minute NBA games — but did not commit to it — in an interview on Wednesday.\nReport: Reggie Miller joining NBC as lead NBA analyst - ESPN\nHall of Famer Reggie Miller will join NBC Sports as its top color commentator when the NBA returns to the network later this year, Front Office Sports reported Wednesday.\nHawks’ Jalen Johnson (shoulder) out for season | NBA.com\nAtlanta’s high-flying forward reportedly will miss the rest of 2024-25 because of a left shoulder injury.\nPUCK LUCK:\nNHL Power Rankings: Jets Force Their Way Into First Place After Canes’ League-Altering Trade - The Hockey News\nThe Winnipeg Jets lead the NHL power rankings for the first time since November, but it’s tight at the top. Plus, the blockbuster Rantanen trade has another big winner.\nUtah hockey team name: What are the final 3 options? – Deseret News\nSmith Entertainment Group is conducting a second survey to determine the new name of its NHL franchise.\nBAESEBALL:N\n“Opportunistic” Cubs Still Hanging Around in a Handful of Pursuits, Including Alex Bregman - Bleacher Nation\nThe Cubs keep getting mentioned together with Alex Bregman.\nMLB The Show 25 cover athletes revealed: Paul Skenes, Elly De La Cruz, and Gunnar Henderson – PlayStation.Blog\n3 of the best young stars get their shots on the cover\nENTERTAINMENT:\n’Little House on the Prairie’ Series Reboot Set at Netflix\nNetflix has greenlit a new TV adaptation of “Little House on the Prairie,” the beloved book series written by Laura Ingalls Wilder.\nJOKE OF THE WEEK:\nI’m thinking about removing my spine...I feel like it’s only holding me back.\nMost Popular\n- Nebraska’s Young Players Waiting in the Wings\n- Nebraska Baseball vs UConn - Live Discussion!\n- Nebraska Baseball Weekend Preview: MLB Desert Invitational\n- HUSKERS SOFTBALL Recap - It’s Tennessee & Pickens Again: #2 Tennessee 4 - #8 NEBRASKA 1\n- Five Heart Podcast: The Moos Fallout, Husker Hoops, and Breakfast Pizza",
  "word_count": 676,
  "scraped_at": "2026-02-14T02:18:11.283128",
  "_text_extracted": true
}