{
  "article_id": "ab1b355d66da",
  "url": "https://www.arsenal.com/news/every-word-renees-pre-man-united-presser-0",
  "title": "Every word of Renée pre - Man United presser",
  "date": "20250509T201500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ahead of our final game of the Barclays Women's Super League season, Renée Slegers has held her pre-Manchester United press conference.\nOur head coach was asked about tomorrow's opponents, bouncing back from defeat and Alessia Russo's contribution this season.\nHere is everything she had to say:\non how important the game is tomorrow…\nYes, very important. Of course, we're going to try and secure second place in the table. But there's so much motivation for us tomorrow, coming from different directions. We're going to put everything into that game tomorrow, because from a table perspective, it's very important. We'll have so many fans backing us and we want to deliver our best possible product to the fans as well. And then we want to show ourselves at our best again for ourselves, coming off of last week.\non building momentum ahead of the Champions League final…\nI think we need to be levelled and mentally strong anyway. But of course, a good game, a good performance, that can create momentum. That will be very positive for us. But first and foremost, it's a game against United tomorrow. That's very important for us. But we've been talking about creating momentum and doing positive things, positive behaviours, positive actions that can create that. It's in our control and it's what we're going to try to do tomorrow.\non how concerned she has been by the past two games…\nTwo different games. I think the first one you see clearly that we come away from mental, physical, and emotional investments and short-term travelling. So we understand where it comes from, but then, we're still learning how to do better in those moments. The second game is different.\nI think we created a lot. I think what Brighton does really well is find the right moments in the game to score their goals. So I think they're very different. Of course, we've been looking at it and what we want to do better and what the big learnings are for us. But we also know that we can get back to our best and we're at our best.\non whether our recent departures will feature tomorrow…\nWe have a very big squad and a lot of players available at the moment. There is a lot at stake. I'm only thinking about the game and the result we need tomorrow. So I'm planning accordingly.\non Alessia Russo’s contribution this season…\nThe obvious one is of course, her goal-scoring contribution, which has been great and very important for us. But all the things you see in the background, the way she trains, the way she treats people. She’s always respectful and always wants to learn. I believe that you're more likely to get the best out of yourself like that and that's what she's been doing consistently. So I'm very impressed with Alessia and it's a privilege to work with her.\non player availability for tomorrow…\nSo we have three players not available and that's Daphne van Domselaar, Lina Hurtig and Katie Reid. Everyone else is in contention.\non whether Beth Mead and Victoria Pelova’s contract status…\nI think we don't discuss contracts in the press conferences.\non finding a balance between being open to transitional attacks and breaking down low blocks…\nDefinitely. For us, it's all about how we want to invest numbers and we want to have freedom, but there are a couple of principles that we also always need to stick to. And whoever that player is, we can lead through it and rotate. But whoever the player is in the final third needs to play that role for us. And we're very aware and aligned on how we want to organise ourselves. It's a lot about, of course, the reactions when you lose the ball. And it's about how you position yourself to go to the key areas. We try to find the right balance.\non starting our season later if we finish second…\nYeah, it would be very good. It would give us a good start for next season. Knowing that a lot of players will be active in the summer at the Euros and other international windows. That will be very good for us. So that's really what we're going for tomorrow, but of course, we’re really happy to secure Champions League football next season.\non whether our squad needs to improve consistency…\nI think we've been very consistent over long periods of time. Of course, there's the Aston Villa game after Lyon. And then we get the second one against Brighton, which for me is a different game. We don't accept us conceding so many goals, so that's the starting point. But we don't see that we lack consistency in that sense. I think we have a great foundation and we believe in what we're doing. And, again, if we perform at our best, we are very, very good. I think we’ve proven that, going through to the Champions League final. But, of course, we want to get back to winning games.\non whether her messaging has changed in light of the defeats…\nI think what’s key for us is staying level, keeping your processes the same, regulating your emotions and staying balanced. But, of course, in those moments, it's important to find the keys moving forward. And that's what we've tried to do.\nAnd we've been able to do that with the players. I think it's been a good process. Again, as a staff, working really hard to find those keys and get clarity, and again, together with the players, hearing how they want to move forward. It's been a really good process and I think coming out of this, there are so many learnings. It's brought us closer together as well.\non tackling Manchester United’s defence…\nYeah, I know they have a very impressive record. So, very well done by them as a team. The way they set up and, of course, a great goalkeeper as well. We see opportunities, of course, like any other team we play against, so I won't share those details right here, right now.\nBut I think we are really good at finding ways to score goals. Systematically, but also with individual qualities. And we've shown that against Lyon, for example, who had conceded very little before. But we know it's going to be hard work tomorrow to find those opportunities. And we respect their defence.\non what we’ve learnt from our defeats…\nI think it's very important to learn from victories as well, by the way. Because that's when your team is positive and in a positive momentum. So that's also where you have a little bit of room.\nBut otherwise, staying in the same process, as I said, it's really important for us. And like I just said, us coming close together at all times. I want to include the rest of the club and the fans as well. They've been there for us and they've pushed us back into the games or into competitions. We're doing it all together and that's really what I feel at the moment.\nIt's been very constructive. So yes, you have a phase of reflection, but then you go and you're constructive about what you want to do to move forward.\non potential gaps to fill in the transfer market…\nI don't think so far ahead. This was two games. We don't believe that that is us, because we've shown such a high level for such a long time. And that hasn't changed just because of two games. So we are at a very high level.\nIt's very competitive in the squad. We've reached the Champions League final. So I don't think we should doubt ourselves because of these last two games. But there are definitely warnings for us that we need to stay consistent.\non what the biggest lessons are from our victories…\nYes, I think in the way we play in victories, I think we create some kind of flow. Fluidity in our games. We dominate in a certain way and that's where I think when the players are in that state and create momentum, I think they find new solutions that we haven't seen before and that's what you can build on.\nThat's their learnings. But also, you do concede a couple of moments, of course, when you want to get your detail even better on the ball. And that's what you can analyse.\non regulating emotions and how to train that…\nYes, what we say is when we focus on the task, both staff and players on the pitch, when we're task-focused, the emotions don't take control of us because we know what we need to do in that moment. And we’re focused on the action we want to execute. And that's what we train in training. But me, personally, I believe I can train my brain as well with mindfulness exercises, for example, to keep my attention on the right things.\non how important it was to instil confidence in the players…\nWell, they are all great people and great players. So making them see that, feel that, empowering them in the right moments and trying to put them into positions that can get the best out of them. That's part of the process. And, yeah, that's going to be important tomorrow, coming away from these two games. But the way we've been constructive. We had a tough day, of course, the day after Brighton, which we had to get through together as well.\nBut going from there and today, the positivity and constructive communication, smiling faces, we put some music on, we watched our goals back from the games we've played at the Emirates, for example, to get back into the momentum as quickly as possible. So confidence is important.\non closing out the WSL season at Emirates Stadium…\nI don't know how many we've sold, between 45 and 50,000, I think. So it's going to be amazing. It's always an honour and privilege to be part of this and get to play a game at the Emirates with so many fans in such a great setting. I think it's going to be beautiful weather tomorrow, so I think it has all the elements for a fantastic day. And we know it's on us to deliver the product that we can.\non Russo’s continued development…\nI think she came in as a quality player. She's improved during the season because of her mindset and I think there's more to come.\nThere are still things that she's working on and wants to do better. So that's the exciting part with Alessia as well. I think all the potential that we still see. She's on such a high level already. She has the mindset and even more potential to become even better.\n[I think you need that mindset]. You can't do it without improving at the highest level. There are so many quality players and the women's game is growing now as well. So to be able to get the absolute best out of yourself and having that winning character and a good mindset, I think you need it.\non what we’re expecting from Manchester United…\nI think they're a good squad, a good group. Like we just touched upon, they've conceded very little this season. I think they're very proud with the development they've had and being so high up on the table. So I think, especially their defensive record and the way they use their players and a couple of players being really good individually this season as well, I think it's impressive. So they've done a really good job.\non United reaching the FA Cup final…\nThat's impressive. That's well done by United, but I'm sure they'll have to focus on the game.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 2003,
  "scraped_at": "2026-02-14T02:26:38.642168",
  "_text_extracted": true
}