{
  "article_id": "ab239a2d6c4e",
  "url": "https://www.90min.com/features/nicolas-jackson-first-50-games-chelsea-compared-didier-drogba",
  "title": "Nicolas Jackson first 50 games at Chelsea compared to Didier Drogba",
  "date": "20241015T013000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nicolas Jackson's first 50 games at Chelsea compared to Didier Drogba\n- Jackson and Drogba both arrived at Chelsea with high expectations\n- Drogba ended his career with a swollen trophy cabinet and legendary status at the club\n- The young striker has endured some criticism since joining the Blues in 2023\n\"You cannot compare [Nicolas] Jackson now with Didier Drogba,\" Mauricio Pochettino warned during the new striker's first season at Chelsea.\nWhile the departed Argentine coach would be right to avoid judging Jackson by the lofty standards of Drogba's entire Chelsea career, the two characters enjoyed and endured similar starts to life in west London. Both arrived as exciting centre forwards tasked with immediately transferring their goalscoring feats on the continent to the Premier League.\nJackson is at an earlier stage in his career compared to late-blooming Drogba, who joined the Blues more in his prime years as one of the most expensive strikers in the world in 2004. But the 23-year-old Senegal international certainly left his mark on the Blues during an eventful debut campaign.\nHere's how the two strikers fared across their opening 50 games for Chelsea.\nGoals\nBoth Jackson and Drogba struggled in front of goal immediately after landing in London. Chelsea's modern-day forward earned his first Premier League suspension for an accumulation of yellow cards before he scored his second goal in the competition.\nDrogba only netted once across his first five appearances for the Blues before bagging a brace on his Champions League debut for the club. The 2004 recruit was at his best in Europea during the early stages of his career in English football - which is unsurprising given his experience on the continent with a Marseille side that made it to the UEFA Cup final shortly before Drogba was sold.\nThe Ivory Coast international reflected on the criticism - from home and opposition fans - which came his way at Chelsea. \"As soon as I miss a chance it's: 'Why did they spend so much money on him?'\" Drogba told the BBC in January 2005, six months after his arrival. \"There's even a song about it. But I like that. It motivates me.\"\nJackson's finishing has also left plenty to be desired. The unrefined forward, who spent no time in any recognised footballing academy, can be incredibly erratic in front of goal. Only two Premier League players missed more of what Opta define as 'big chances' during his debut campaign, while his tally of 14 top-flight goals was significantly lower than the xG figure of 18.6.\nAssists\nDrogba's Chelsea career was 15 minutes old when he provided his first assist in a blue shirt. Afforded oceans of space in front of Manchester United's skittish rearguard, the towering forward flicked a header into the stride of Eidur Gudjohnsen to score the only goal of the game. That victory served as a marker for Jose Mourinho's new title challengers and offered the first hint of Drogba's aerial artistry.\nThe physically imposing striker was just as deft with his forehead as most players are with their feet. Frank Lampard became a chief beneficiary of Drogba's unrivalled hold-up play, bursting from midfield onto the array of knockdowns.\nAfter the duo combined during a famous Champions League triumph over Bayern Munich in 2005 - which a suspended Mourinho watched from a laundry basket - Drogba told UEFA: \"[Lampard] knows that when I jump, I always try to find someone from my head. He's smart, and this isn't the first time he's scored this kind of goal. He knows my game.\" The pair would go on to become one of the most prolific scoring duos in Premier League history, teeing each other up for 36 top-flight goals.\nJackson has found his version of Lampard in the form of Cole Palmer. Almost a third of the forward's goals have been created by Chelsea's talisman, while all but three of Jackson's assists have landed at Palmer's feet. If the modern-day duo continue to combine at the same frightening rate, they are on course to surpass the haul amassed by Drogba and Lampard.\nTrophies\nWhile Jackson is yet to lift his first piece of silverware with Chelsea, Drogba had already hoisted aloft three trophies after his first 50 games for the Blues. The Ivorian undoubtedly benefitted from arriving in London in the early stages of Chelsea's Roman Abramovich era, joining a side funded by unrivalled riches and led by one of the greatest managers of all time.\nHowever, Drogba established his lofty reputation as the ultimate 'big-game player' six months into his Chelsea career. After Mourinho had been banished to the stands for taunting Liverpool's supporters as the 2005 League Cup final entered extra time, the coach's marquee summer arrival managed to scramble Glen Johnson's long throw over the line to put the Blues 2-1 up in a showpiece they would eventually win 3-2.\nOvercome by the emotion of the occasion, Drogba celebrated by ripping off his number 15 shirt - the same set of digits which Jackson would inherit two decades later.\nNicolas Jackson stats compared to Didier Drogba\n\"It was a little bit difficult at first,\" Drogba explained at the end of his debut season at Chelsea, as quoted by Sky Sports, \"because when I first came to London, I was very, very tired.\" The accomplished forward claimed that injuries and fatigue limited him to \"60%\" of his potential at first, before he grew into the role.\nJackson couldn't blame any fitness concerns, but followed the same learning curve as Drogba. The pair even recorded exactly the same number of goals (21) across their first 50 games in blue.\nChelsea's current number 15 insisted at the start of the 2024/25 campaign that he is \"still in the learning process\". The future looks increasingly bright for the hungry young forward who has enjoyed a prolific start to the new season, but Drogba's Chelsea career shows that no development is a straight line. The club icon only scored 22 goals across his next 50 games for Chelsea.",
  "word_count": 1007,
  "scraped_at": "2026-02-14T01:51:57.647124",
  "_text_extracted": true
}