{
  "article_id": "aba3dd31baf8",
  "url": "https://theathletic.com/4520799/2023/05/16/xavi-barcelona-la-liga-champions/",
  "title": "Barcelona is the perfect place to fail as a manager . Xavi is navigating through it all",
  "date": "20230516T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A year and a half into Xavi’s reign at Barcelona, he and his team are celebrating their first big success having been crowned La Liga champions.\nEarlier this season, if you’d told the group this would happen, not many would have believed you.\nOn Monday, October 17, Barca’s players and staff arrived for training in a downbeat mood. Over the previous week, they’d suffered two big blows.\nAdvertisement\nA dressing-room source — who, like all those cited in this article, preferred to speak anonymously to protect their position — described the situation as “the worst moment of our season”.\nBut it also marked one of the campaign’s biggest turning points — one where the influence of Xavi was key.\nThat week, Barca had failed to beat Inter Milan at home in the Champions League, a result that left them all but eliminated from a competition in which they so desperately needed to perform. They then lost 3-1 at Real Madrid in the season’s first Clasico, falling three points behind their rivals at the top of La Liga.\nOn the following Monday, as was now usual according to the strict rules Xavi re-imposed on the team when taking over in November 2021, Barca’s players arrived 90 minutes before training was due to begin.\nIt soon became clear that day would be different. Club staff let them know they were all required to attend an unplanned team meeting. Xavi wanted to take the lead and speak.\n“Spirits were so, so low,” says another source from the club.\n“There was the feeling that a lot of things were already lost. That’s why he decided to act.”\nA first-team player describes what was said: “Xavi wanted to make clear we still had many things to fight for.\n“At that moment, it was not so easy to see. We were all down, the Champions League exit hurt us a lot as a club. He lifted the spirits and made us realise things some of us probably couldn’t see.”\nThat following week, the players showed their response in a 3-0 home victory over Villarreal. Then Athletic Bilbao were beaten 4-0 as a new tactical system was tested, with Xavi switching to a line-up that featured four in midfield. This formation would, after the World Cup break, become Barca’s plan A, one that addressed problems exposed in that key October week.\nAdvertisement\n“I understood we needed more control and to be more dominant instead of an end-to-end style of game,” Xavi said on Sunday, answering a question from The Athletic on that tactical change in his post-match press conference after the title-deciding win over Espanyol.\n“We felt better dealing with possession in the opposition’s half of the pitch, so I gave priority to the footballers who do not lose the ball. At the end of the day, that’s how I see football. For me, football belongs to midfielders, or to the guys who don’t lose possession.”\nThat tricky spell in October was not the only tough period of the season. Barcelona are at the best of times a difficult club to manage and this season’s La Liga triumph has to be judged not just through the prism of what’s happened on the pitch. The club still faces financial uncertainty and then there is the developing scandal over payments to a former referee’s chief.\nGO DEEPER\nBarcelona charged with corruption over payments to former referees chief\nAll this, around a team whose fans can quickly turn against you if the titles do not come, makes Barcelona possibly the perfect place to fail as a manager. But somehow, Xavi is navigating through it all and doing it quite successfully.\nSpeaking with a wide variety of club sources about the work Xavi has done, there is a certain reluctance to compare him to Barca’s great managers of the past, such as Pep Guardiola — and in any case, they feel it’s unfair to place that kind of pressure on him.\nBut they all agree there are not many better figures to be leading the team right now.\nOne of the reasons for this is the power of his name. Xavi is a legend at the Camp Nou. As a player, he was seen as the very personification of how Barcelona should aspire to approach football: possession-based superiority with the midfield dictating the game.\nGO DEEPER\nCelebrating Sergio Busquets - the invisible genius impossible to ignore\nThat hasn’t given him a free pass, but it certainly gives him more credit than was afforded to some of his predecessors. Fans demand wins and the media will keep pushing — but if your name is Xavi, everyone is going to be more patient with you. It’s a situation that frustrated Ronald Koeman, who was sacked to make way for him.\nAdvertisement\n“I was not given the same amount of time as Xavi at the club, it’s still painful for me,” the Dutchman said in March last year in an interview with the newspaper Algemeen Dagblad.\n“(Club president Joan) Laporta told me 1,000 times that Xavi would not be his manager as he was not experienced enough.”\nXavi’s name is sung at every game at the Camp Nou, especially from the loudest section of the stadium at the bottom of the Gol Nord stand, and his opinions come with extra weight. His words aren’t just those of the Barcelona manager, they have a wider and more powerful impact. When he speaks, he does so with expert knowledge of a context that is particular to Barcelona: the ‘entorno’.\nThe Spanish word ‘entorno’, literally translated as environment or surroundings, was coined by Barca legend Johan Cruyff, back when he was the manager in 1992, to describe the noise that is constantly generated around the club — the media, the fans, the politics of its executive board, or other major figures across the city and wider Catalonia region.\nThere are not many professionals in the industry as protected from this as Xavi, but he has also shown he knows which battles are worth fighting and how to win them.\nIn January, he had to deal with Barcelona selling Memphis Depay to Atletico Madrid and the club ignoring his requests to bring in a replacement. The money wasn’t there and Barca are still working on how to comply with the financial rules of La Liga. Until they are met, they won’t be able to register any new signings.\nGO DEEPER\nBarcelona's €200m problem: Gavi's contract, La Liga conflict and a damaged brand\nOn that occasion, Xavi didn’t make a fuss. But two weeks ago, before the league game against Real Betis and amid rumours over which players might be sold this summer to reduce the wage bill, Xavi was asked about Andreas Christensen.\nThe 27-year-old, who has had an excellent debut season, has been considered by some figures inside the club as a player who could attract big offers from around Europe.\nAdvertisement\n“His signing was a personal request from myself,” Xavi said. “I have a lot of faith in him and we missed him when he was injured. I don’t know if he’s as valued as he should be on the outside, but in the dressing room we really rate him very highly.”\nMessage sent; message received at Barca’s senior offices.\nThere have been positives and negatives in Xavi’s role in Barcelona’s season. It’s fair to state, given the outcome of winning the league title, that the positives are more plentiful, but let’s take the full picture.\nHis team has tightened up significantly at the back. They’ve conceded just 13 goals from 34 games in La Liga this season — an average of 0.38 goals per match. They have kept 25 clean sheets — the competition record for a single season is 26.\nThen there is the pressing system. No La Liga side has completed more high turnovers (possession won 40 metres from the opponent’s goal) than Barcelona and it has helped decide crucial wins when the team have otherwise been unable to find a breakthrough. The move to focus on this has seen Barca recover one of the most basic principles of their football identity, too: the urgent need to regain possession as soon as they lose the ball.\nEverything Xavi wants to achieve as a manager can be seen in the 3-1 victory over Real Madrid in the final of the Spanish Super Cup in January. The way they dominated their opponents through possession and superiority on the ball still remains the reference point for what this Barcelona team can do. But it is also true to say that, despite winning the league with four matches still to play, the team has rarely clicked so effectively since.\nSources close to backroom staff point to injuries to important players suffered at key moments of the season. It is certainly true they were missing personnel when taking on Manchester United in the Europa League — and it was also true in the autumn when they were knocked out of the Champions League.\nAdvertisement\nWhen they lost 4-0 to Madrid at the Camp Nou in their Copa del Rey semi-final second leg in April, they were without Ousmane Dembele, Christensen, Pedri and Frenkie de Jong.\nBut still, it has to be said that Xavi did receive substantial backing in the summer to build a squad with deeper options. The club essentially gambled on its long-term future to fund the signing of eight new players, raising hundreds of millions in a series of asset sales that came to be known as ‘pulling financial levers’.\nXavi has undoubtedly helped several of the players he inherited to progress and find their place in the complex Barcelona universe, where some had struggled.\nA clear example is Uruguayan centre-back Ronald Araujo, who despite the arrivals of Jules Kounde and Christensen has evolved into the most important figure in Barca’s backline.\nThe 24-year-old, who is described as an obsessive learner — something The Athletic will detail in a separate in-depth article later this week — has so impressed Xavi and his team-mates that he is in contention to become a club captain next season.\nPedri has benefitted from being moved further up the pitch. One of the biggest goals the backroom staff had at the start of the season was for him to be more involved in attack. Xavi’s move to a four-midfielder system has seen him placed at the centre of everything.\nGO DEEPER\nHow Barcelona won La Liga: Old-school rules, new hunger and a changing of the guard\nDembele, if it wasn’t for Xavi, probably would not be a Barcelona player right now. The Frenchman has been protected by his manager despite some executives pushing to sell him. As exasperating as he can be at times for fans, Dembele has produced his best form in a Barca shirt this season.\nSimilar can be said of De Jong, who was struggling to find his place at the club and has now discovered a role in which he can thrive. He was another the club wanted to sell in the summer.\nAdvertisement\nGavi and Alejandro Balde can be added to this list — especially Balde — but the same can’t be said for Ansu Fati or Ferran Torres. Their underachievement helps frame one of the biggest flaws of Barca’s season: their fluency in attack.\nXavi’s team have won a joint-record 11 La Liga matches by a 1-0 scoreline — not something you would expect from a Barcelona team that has been crowned champion.\nBarca remain — like Xavi as a manager — a work in progress. Sources close to the coaching staff see this coming transfer window as crucial in completing the rebuilding job they began last summer. Even then, Xavi was pushing to have two starters fighting for each spot in the line-up.\nHis desire to have a long squad contrasts with what Guardiola, forever a benchmark at Barcelona, always favoured.\nGuardiola preferred quality over quantity in part because he found a group easier to manage if each member was content with their playing time. Xavi is not afraid of managing a big squad — but he has certainly faced challenges in keeping them all happy.\nJordi Alba and Franck Kessie have both held personal meetings with the manager over the season to complain about their lack of minutes.\nDuring a March home match against Valencia, Alba spent a large part of the second half warming up. Xavi then decided not to involve him in the game. The 34-year-old was not impressed and the pair exchanged words in the dressing room in front of the whole team.\nXavi decided not to get into a bigger argument in the heat of the moment. Instead, he decided to give Alba a proper reply and reaffirm his authority the day after at the club’s training ground.\nIn Kessie’s case, the Ivorian felt extremely disappointed that he did not start the league Clasico at the Camp Nou on March 19 – where he eventually scored the injury-time winner that effectively decided the title.\nAdvertisement\nKessie, 26, was partly motivated to join Barca by conversations he had with Xavi. The manager, who is personally involved in the club’s recruitment strategy, explained how he envisaged his role at the club.\nWhen they spoke in March, Xavi reflected on Kessie’s frustration by saying how he himself had to spend multiple seasons as a backup option before establishing himself in the first team.\nBack in 1999, at the age of 19, Xavi himself was close to a departure from Barca. An offer from AC Milan came in and, with Guardiola ahead of him in the starting XI, the club saw fit to accept. The decision was set for everyone, except one person: Xavi’s mum.\n“I threatened my husband I’d ask for divorce if we moved Xavi to Italy,” she joked years later. His family were all Barcelona fans.\nThe 16 years at Barca that followed formed the great part of Xavi’s playing career. There’s no other manager in the world with a similar background to him in that regard — and his status at the club means he will always be afforded a little more time than most. That is an extremely valuable position to be in in football management.\nWhen he took over the Barca manager’s role, he inherited an ageing squad. Standards had dropped and morale was low.\nMore than a year and a half later, the backroom staff believe they are still short of the talent required to compete on the European stage, but domestically, the league title is theirs for the first since 2018-19 and that represents a significant moment.\nXavi’s current deal runs up to the end of June 2024. Talks are progressing over an extension and are now expected to be concluded successfully.\nOn Sunday evening, Laporta burst into the dressing room to take his place among the rejoicing group after the decisive 4-2 win at Espanyol, more than relishing his spot in the limelight as he was doused in cava.\nBut life can change very quickly at Barcelona — and Xavi knows that more than anyone.\nThat is why, despite the crescendo of celebration among the entorno this week, he will already be thinking about what comes next.\nAdditional contributors: Mark Carey and Thom Harris",
  "word_count": 2551,
  "scraped_at": "2026-02-14T02:00:19.998112",
  "_text_extracted": true
}