{
  "article_id": "abaa2392d3c5",
  "url": "https://jezebel.com/nebraska-volleyball-womens-team-attendance-record-1850794016",
  "title": "Nebraska Volleyball Team Breaks Women Sports Attendance Record",
  "date": "20230831T221500Z",
  "domain": "jezebel.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "College Volleyball Game Breaks World Record for People Going to a Women’s Sports Event\nStudents got the day off from classes and the Cornhuskers ran onto a football field through a laser-and-smoke-filled tunnel.\nEntertainmentEntertainmentIn the middle of the week, in the middle of the U.S., a world record was set for the most attendance at a women’s sporting event in the history of humanity at a…non-championship college volleyball game. *Hums to the tune of that kid’s “It’s Corn” song*: They have the juice!\nSpecifically, 92,003 fans poured into Memorial Stadium, where the football team plays, in Lincoln, Nebraska, on Wednesday night to watch the University of Nebraska-Lincoln Cornhuskers win 3-0 in their match against the University of Nebraska-Omaha Mavericks. The record-breaking attendance was announced after the Cornhuskers—who are five-time NCAA champions—won the first two sets.\nStudents from Lincoln got the day off from class after school officials dubbed it “Volleyball Day in Nebraska,” and in an entrance typically expected of a Super Bowl—or, at the very least, a play-off game—the players ran onto the field after an intimidating walk through a laser-and-smoke-filled tunnel. “It’s incredible. I don’t have enough words to describe it,” Andi Jackson, the Huskers’ middle blocker, told ESPN.\n“We took a chance by playing in Memorial Stadium, and to go for the record and break it. … I don’t think anybody could have envisioned that when this whole thing started,” John Cook, the Huskers’ coach, told the Associated Press. “It feels like a great accomplishment for this sport called volleyball played by women. It’s a state treasure. We proved it.”\nBefore Wednesday, a Champions League soccer game in Spain last year between FC Barcelona and Wolfsburg held the record for women’s sport attendance, with 91,648 fans inside Camp Nou stadium. In the U.S., the previous record was set at the 1999 Women’s World Cup final between the U.S. Women’s National Team and China (the game with the infamous Brandi Chastain photo), with 90,185 fans packed into the Rose Bowl in California.\nBeyond that, the Huskers also broke the school’s football attendance record, which was previously set during the football team’s win over Miami in 2014 with 91,585 fans. And it’s barely even worth mentioning, but they more than septupled the record for a crowd at a women’s NCAA volleyball match—which was set in 2021 with 18,755 fans who watched Wisconsin beat Nebraska (sad!) in the national championship game in Ohio at Nationwide Arena.\n“I’ve been saying it’s so huge for little girls to get to see a women’s sport and volleyball being played on this big of a stage and having so many people invest in it,” Lexi Rodriguez, a junior and libero on the Huskers, told ESPN. “When you’re little, you have big dreams and big goals. Having this to look up to is something that a lot of little girls will keep in the back of their mind when they’re pursuing the sport of volleyball.”\nOrdering my Huskers volleyball merch and learning the lingo as we speak.",
  "word_count": 502,
  "scraped_at": "2026-02-14T02:13:11.418888",
  "_text_extracted": true
}