{
  "article_id": "abb1cc9e28ab",
  "url": "https://www.justarsenal.com/next-season-in-phase-5-arsenal-will-complete-their-rise-to-the-top/370335",
  "title": "Next season in Phase 5 , Arteta and Arsenal will complete their rise to the top",
  "date": "20240701T003000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal head coach Mikel Arteta’s project for Arsenal was in the fourth out of five phases last year, and these are the gains we made:\nThe top players chose Arsenal because they believed in coach Mikel Arteta.\nDeclan Rice was determined not to join Manchester City or Bayern Munich with Arsenal in his transfer race because he believed in coach Mikel Arteta’s plan for him.\nKai Havertz declined to return to Germany and join Bayern Munich or move to Spain and join Real Madrid because he was completely convinced by coach Mikel Arteta.\nJurrien Timber, a highly regarded Eredivisie defender, turned down offers from other clubs like Manchester United because he believed coach Mikel Arteta would help him reach his full potential.\nEthan Nwaneri, the next outstanding English prospect, decided to dedicate his future to Arsenal despite receiving interest from a number of large clubs, including Chelsea.\nAfter falling behind early in the 2022–23 title race, our Gunners last season improved; they carried the title battle to the final day of the season, losing by only two points. Arsenal also participated in the Champions League for the first time under Arteta last season, and they did reach the quarterfinals, though they lost the quarterfinal to Bayern Munich by a single goal in a game that, with more precision, would have advanced us to the semi-finals.\nUltimately, with better-quality stars infused into the club, Arsenal may be better placed next season, allowing them to perform at their peak and ushering the project into phase 5.\nIn phase 5, there is much to look forward to, such as winning the league and competing for Champions League football as the club re-establishes itself as a European powerhouse.\nDarren N\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 360,
  "scraped_at": "2026-02-14T01:57:18.875908",
  "_text_extracted": true
}