{
  "article_id": "abb24f88db5c",
  "url": "https://www.teamtalk.com/news/six-signings-inter-can-make-serie-a-winners-champions-league-challengers",
  "title": "Six signings Inter can make to go from Serie A winners to Champions League challengers",
  "date": "20240425T190000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Six signings Inter can make to go from Serie A winners to Champions League challengers\nOn Monday April 22, Inter Milan claimed their 20th Scudetto in their history and the way they secured it could not have been a more satisfying one.\nFacing bitter rivals AC Milan away at the stadium they both proudly call home in the San Siro, Inter prevailed as 2-1 winners following goals from Francesco Acerbi and Marcus Thuram, ensuring Fikayo Tomori’s late goal did not affect the result.\nManager Simone Inzaghi has led Inter to a truly memorable season, losing only once in the entire Serie A campaign at this stage which occurred all the way back in September 2023 when they fell to a 2-1 defeat at home to Sassuolo.\nOnly a narrow penalty shootout defeat against Atletico Madrid was enough to knock them out of the Champions League in the Round of 16 this season after they fell at the last hurdle to Man City in the final last campaign.\nFollowing the Nerazzurri’s successful season, planning will already be taking place to strengthen key areas and ensure that they are able to go further in the Champions League next season.\nHere are six players Inter can sign to turn their Serie A success into a Champions League challenge.\nPiotr Zielinski\nPolish international midfielder Piotr Zielinksi has spent his entire professional footballing career in Italy ever since joining Udinese in July 2011 but has been starring for Napoli since August 2016.\nZielinksi was a part of the squad that guided Napoli to their first Serie A title in 33 years and has since played over 350 times in all competitions for I Partenopei.\nHowever, his time in Naples is likely to come to an end following the completion of this latest Serie A season, with his contract set to expire at the end of June.\nThis will not be news to many clubs around the world, with Inter being no different, as Fabrizio Romano has already confirmed that the 88-cap Polish international has already agreed to a long-term contract to switch from Napoli to Inter.\nWith Davy Klaassen and Stefano Sensi struggling to pick up any meaningful minutes this campaign, a place in Inter’s midfield seems to be up for grabs, which Zielinski will certainly grasp with both hands.\nHakan Calhanonglu has excelled in his new deeper role in the middle of Inter’s 5-3-2 shape and extra competition for minutes will only be a good problem for Inzaghi to contend with.\nKim Min-Jae\nFrom one soon-to-be-former Napoli player to a current former Napoli player in South Korean stalwart Kim Min-Jae.\nKim joined Bayern Munich in the summer for €50million (£42.8million) from Napoli after helping guide the club to a first league title in 33 years alongside Zielinksi.\nThe South Korean’s stay in Naples was only a short one after joining the Serie A club from Turkish side Fenerbahce the summer before.\nThis season, Kim has been a part of the Bayern squad which has failed to win the Bundesliga title for the first time in 11 years after the emergence of a resurgent and seemingly unbeatable Bayer Leverkusen.\nBayern still remain in the Champions League though, after knocking Arsenal out in the quarter-finals, they will face Real Madrid in the semis with this being their last chance of winning any silverware this campaign.\nIf Bayern fails to win any silverware, Kim’s head may turn and Inter will be ready waiting in the wings. However, he won’t come cheap, with him still having four years remaining on his current deal in Bavaria.\nBento\nBrazilian goalkeeper Bento has, up until this stage, spent his entire career in his native Brazil with boyhood club Athletico Paranaense, but could make the switch to Europe this summer with both Chelsea and Inter interested in the 24-year-old.\nBento has already played 150 times in all competitions for Paraenense and has even been capped twice for the Brazilian national team as Man City and Liverpool number one’s Alisson and Ederson and himself jostle for the starting berth in the Selecao net.\nCurrent Inter shot-stopper Yann Sommer is now 35 years old and Bento will be seen as the heir to the Inter goalkeeping throne should he switch to Milan.\nValued at around £13million, Bento would come relatively cheap and still has ample time to improve into one of the best goalkeepers in the world in the future.\nThough Inter will have to move quickly, as neither Dorde Petrovic nor David Sanchez has been able to impress in the Chelsea net, which may force Todd Boehly to enter his deep pockets again sooner rather than later.\nAnthony Martial\nOnce upon a time, Anthony Martial had the world at his feet. His €60million (£51million) move to Manchester United from Monaco in September 2015 was one that brought huge excitement in the footballing world.\nAlmost nine years on from his switch from the French coast to the Northwest of England, things haven’t exactly panned out the way that many expected.\nThe 28-year-old has appeared over 300 times in all competitions for Man Utd, scoring 90 goals and assisting a further 47 in the process, though it could have been so many more if injuries hadn’t disrupted his playing time.\nMartial’s contract in Manchester is set to expire at the end of this season, with it already being confirmed that he is to leave the club upon its expiry.\nInter therefore have put their name in the hat for Martial’s signature, alongside an array of Saudi clubs and Turkish giants Fenerbahce.\nMarko Arnautovic, Alexis Sanchez and Henrikh Mkhitaryan are all 35 years old now and not getting any younger and adding Martial, who is seven years their junior, would add a bit more youth to their attacking options as well as experience.\nMichael Kayode\nItalian right-back Michael Kayode is enjoying a breakout campaign in Serie A with Fiorentina since emerging into contention at the beginning of the season, displacing £12.5million signing Dodo in the starting XI.\nKayode had never previously played top-flight football before this campaign yet doesn’t look out of place defending against some of the best wingers in the world.\nThe 19-year-old has already seen himself linked with the likes of Arsenal and Man City due to his performances, though Inter could yet thrust themselves into contention.\nMatteo Darmian has provided impressive competition to Denzel Dumfries on the right flank, though at 34 years old, they will have to think about replacing him sooner rather than later and Kayode would prove to be a youthful and exciting addition.\nMehdi Taremi\nIranian striker Mehdi Taremi has already agreed a move to Inter this summer following the expiry of his contract at FC Porto.\nThe 31-year-old only moved to Europe for the first time in 2019, joining Portuguese side Rio Ave, where he scored 21 goals and assisted five in 37 appearances in his solitary season at the club before switching to his current club Porto the following summer.\nTaremi has scored 88 goals and assisted a further 57 in 177 appearances for Porto and will link up with Inter in the summer where he will provide competition for Lautaro Martinez and Marcus Thuram.\nWith the Italian side not paying a fee for him and Taremi unlikely to demand to start every game, the Iranian provides a cheap and reliable option for Inter next season.\nREAD MORE – 10 Serie A talents who could be on the move in the summer – including Man Utd, Arsenal striker target",
  "word_count": 1253,
  "scraped_at": "2026-02-14T01:51:24.791171",
  "_text_extracted": true
}