{
  "article_id": "abbae84dc5bf",
  "url": "https://theboar.org/2025/08/lionesses-retain-euros-crown-with-dramatic-penalty-shootout-victory-over-spain/",
  "title": "Lionesses retain Euros crown with dramatic penalty - shootout victory over Spain",
  "date": "20250805T083000Z",
  "domain": "theboar.org",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionesses retain Euros crown with dramatic penalty-shootout victory over Spain\nThe England women’s national team secured their second consecutive European Championships title on Sunday evening by defeating world champions Spain 3-1 on penalties.\nThe final was the third occasion this summer that the Lionesses were forced into deciding affairs in extra time or later, after Alessia Russo had cancelled out Mariona Caldentey’s first-half strike early in the second period.\nArsenal forward Chloe Kelly held her nerve to once again provide the winning touch in a European final by converting the decisive penalty, but it was goalkeeper Hannah Hampton who stole the show after a full 120 minutes wasn’t enough to separate the two sides.\nThe Chelsea stopper denied Caldentey and the current Ballon d’Or Féminin holder Aitana Bonmatí during the shootout, allowing Kelly the opportunity to smash home the winning spot-kick.\nWiegman will be glad that her star striker forced her way back into her plans\nThe pair were perhaps unlikely heroines, with Kelly struggling for game time at former club Manchester City in the early stages of last season and Hampton not even being considered England’s first-choice keeper until late.\nKelly, who famously netted the winner in England’s triumphant 2022 final against Germany, was originally left out of head coach Sarina Wiegman’s opening Nations League squad just a few months ago, only to be drafted days later when Arsenal teammate Beth Mead withdrew through injury.\nOnly thanks to her late-season resurgence, which saw her lift the Women’s Champions League with the Gunners, did she truly regain her place, but Wiegman will be glad that her star striker forced her way back into her plans.\nIt seemed that the Lionesses were crumbling under the pressure of being holders and favourites as the tournament kicked off\nOn the flip side, the spotlight was well and truly on Hampton from the get-go in Switzerland, after former Lionesses number one Mary Earps retired from international football just weeks before the tournament got underway. Hampton had certainly started to stake her claim as Wiegman’s first choice in the build-up to this summer, but few would’ve expected her to prove so inspirational so early in her England career.\nIn fact, it seemed that the Lionesses were crumbling under the pressure of being holders and favourites as the tournament kicked off a month ago. An opening-day defeat to France was the worst possible way to begin the defence of their crown, but a commanding 4-0 victory in their second group outing over the Netherlands went some way to calming nerves.\nEngland eased into the knockouts with a 6-1 win over Euros debutants Wales, but once again, it looked as if their tournament would be ending prematurely. The Lionesses found themselves 2-0 down to Sweden at half-time in the quarter-finals, only to be rescued by late goals from Lucy Bronze and Michelle Agyemang.\nA first penalty-shootout triumph of the tournament punched England’s ticket to the final four and a meeting with this summer’s surprise package Italy where more late heroics from Agyemang were needed to send the game to extra time.\nThis time, a shootout was averted through Kelly’s last-gasp winner, but England were forced to repeat their trick yet again after drawing level in the final.\nRemarkably, Sunday’s triumph marked back-to-back-to-back European Championship titles for Wiegman, who previously won the 2017 edition with her native Netherlands before taking the helm for the Lionesses.\nAlso securing her third piece of silverware as England head coach, Wiegman will have the chance to add another title to her and her team’s ever-growing collection in the second edition of the Women’s Finalissima next year.\nIn 2027, Wiegman’s side will then have the chance to make it second time lucky at the Women’s World Cup in Brazil.",
  "word_count": 626,
  "scraped_at": "2026-02-14T02:02:51.939286",
  "_text_extracted": true
}