{
  "article_id": "abd09e67093a",
  "url": "https://www.the42.ie/arteta-arsenal-real-madrid-6679472-Apr2025/",
  "title": "Arteta says Arsenal  mindset is to win , to be brave  in Madrid",
  "date": "20250416T091500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MIKEL ARTETA INSISTS a ‘bold and brave’ Arsenal do not fear Real Madrid and wants his side to secure their place in the Champions League semi-finals by beating the Spanish giants in their own back yard.\nArsenal will take on Carlo Ancelotti’s team in the second leg of their quarter-final at the Bernabeu tonight with a three-goal advantage following Declan Rice’s remarkable free-kick double at the Emirates Stadium last week.\nHowever, the 15-time European Cup winners have a habit of impressive turnarounds – against the might of Manchester City, Chelsea, Paris St Germain and Bayern Munich – all in recent seasons.\nSpeaking prior to Arteta, England international Jude Bellingham said the buzz word in the Real dressing room ahead of Wednesday’s fixture is “comeback”.\nBut responding to Bellingham’s comments, Arteta said: “We have the same mindset.\n“The mindset is to win, to be brave, to be bold, dominant, to be determined and to have the conviction that we can be better than them and win the game.\n“That is the message I have conveyed to the players. They did that in London and now we have to do it in a different context tomorrow.”\nPut to Arteta that the suggestions in Spain are that Arsenal are fearful of a comeback, the Spaniard continued: “I wouldn’t use that word.\n“Respect and admiration for what they’ve done in the competition as a club over the years, and the history they have, and the values that they defend is unbelievable.\n“It is amazing and an inspiration for any coach, any manager, any team. But after that is the competition. It’s what we are going to face tomorrow, an opposition that we know very well, and that we are determined to go out there and try to win the game.”\nArsenal have not conceded three times in a match since a 4-3 win against Luton 16 months ago, and they have not lost by a four-goal margin since they suffered a 4-0 defeat against Liverpool at Anfield in December 2021.\nArteta added: “We have to do it again. And we have to prove it now in this context. And that’s the beauty of it. That’s the challenge and that’s the great thing about sport.\n“We’ve shown that we are capable of doing it, and that has to give us reassurance and confidence that we can do it. But now, let’s talk on the pitch, do it on the pitch, and that’s the only thing that matters.”\nArteta revealed that midfielder Thomas Partey – a doubt after he was substituted with 20 minutes remaining in Arsenal’s 1-1 draw against Brentford – is available.\nDefender Ben White is also fit to play but midfielder Jorginho, who suffered a rib injury at the Emirates on Saturday, has not travelled to Spain.\nArsenal have only reached the semi-finals of the Champions League on two previous occasions, in 2006 and three years later, and have never won the competition.\nGoalkeeper David Raya said: “The mood is great. The feeling is not nerves, it’s confidence, it’s being able to replicate what we did in the first game and come here for the win.\n“We have the momentum. We are here to create our own history, to win the game and that’s the most important thing.”",
  "word_count": 545,
  "scraped_at": "2026-02-14T02:26:33.611709",
  "_text_extracted": true
}