{
  "article_id": "abe6105fcb41",
  "url": "https://www.theguardian.com/world/2024/apr/22/first-edition-soundscapes-nature-sounds",
  "title": "Monday briefing : The sounds of birdsong and nature are disappearing – here what that means |",
  "date": "20240422T084500Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning.\nWaking up to birdsong is one of life’s small joys. But what if one day you woke up and heard nothing at all? This is a possible future ahead of us, as our growing biodiversity crisis means the sounds of nature are fading away. In some places they have already disappeared.\nThere is no shortage of alarming data on biodiversity loss. Over the last 50 years, the Earth’s wildlife populations have plunged by 69%, according to leading scientific assessment. Despite the mounting evidence and increasingly dire warnings, communicating the depth of the world’s biodiversity crisis to the public and to governments has been difficult for researchers, conservationists and journalists.\nThe Guardian’s Soundscape series is a different way of communicating the effect of nature loss by allowing the natural world to speak for itself. It takes a look at what the disappearance of natural sounds tells us about the health of the environment.\nFor today’s newsletter, I spoke with Guardian biodiversity reporter Phoebe Weston about what the project has found. That’s right after the headlines.\nFive big stories\n-\nNHS | The amount of time doctors have to spend doing compulsory training will be cut as part of an NHS drive to improve medics’ working lives, the Guardian can reveal. Concern that doctors have too heavy a burden of mandatory training has prompted NHS England to commission a review, which it is expected to announce imminently.\n-\nIsrael | Benjamin Netanyahu has said he will fight against any efforts to impose sanctions on Israeli military units, amid reports that an Israel Defense Forces battalion is facing US sanctions over its treatment of Palestinians in the occupied West Bank.\n-\nRwanda bill | Rishi Sunak is under pressure to make last-minute concessions today to secure the passage of the Rwanda deportation bill by allowing exemptions for Afghans who served alongside UK forces. The prime minister is facing calls from Conservative MPs and opposition parties to offer assurances that Afghans, including special forces veterans, will not be flown to Rwanda should they arrive in the UK across the Channel.\n-\nDrugs | Lethal synthetic opioids linked to more than two deaths a week in the UK have been advertised for sale in thousands of posts on social media, an investigation has found.\n-\nEverest | 100 years after British mountaineer George Mallory and his colleague Sandy Irvine disappeared as they attempted to reach the summit of Everest in 1924, digitised copies of many of Mallory’s letters, in particular those exchanged with his wife, Ruth, are to be made public by his alma mater, Magdalene College, Cambridge.\nIn depth: ‘It’s a silent alarm bell of what’s to come’\n“We spoke to acoustic ecologists who have been working in this area for decades, and they repeatedly told us that the sounds of various habitats are in decline in terms of the intensity and the diversity of sounds,” Phoebe says. Put simply, natural sounds are disappearing and becoming increasingly homogeneous.\nThis problem is closer to home than many realise: walking through her local park in south London, Phoebe recorded the birdsong and found there were only two species, blackbirds and robins, in the wooded area. “The issue of course is the sliding baseline. The disappearance of soundscapes is happening so quickly that lots of people aren’t even noticing it,” Phoebe says. “You can’t mourn something that you never knew was there. These acoustic records are a reminder of a loss that most people wouldn’t be able to identify.”\nRapidly developing technology has meant that researchers are able to measure biodiversity through sound. In a particularly moving piece for the series, Phoebe spoke to soundscape recordist Bernie Krause, who has been recording the natural world for three decades. He returned every year to one particular spot in Sugarloaf Ridge state park in California to tape the sounds, but last April, for the first time ever, it was silent. There was no birdsong or noise from animal movements at all. “I’ve got an hour of material with nothing, at the high point of spring,” Krause told Phoebe.\n“I remember when Krause first sent me the audio files and I listened to this park fall silent – I felt it in my heart,” Phoebe says. “It’s not an academic understanding of what’s happening – it’s a much more emotional, visceral feeling that you have when you listen to that sound disappearing.”\nWhy are the sounds of nature disappearing?\nThe main driver of natural sounds disappearing is habitat loss driven by agricultural expansion. Almost 90% of critically endangered mammal species, and more than 80% and 70% of the critically endangered amphibian and bird species, cannot live on agricultural land – and the problem becomes even more acute for large species and species that are used to living in specialised habitats.\nPollution, resource extraction, the climate crisis and invasive species are also driving factors in the decline of acoustical diversity in nature. The climate crisis is becoming a more prominent part of this problem, as sensitive environments change due to global heating.\n“Climate change is making even good habitats turn bad because it’s altering a very finely tuned environment that these animals have survived and evolved in,” Phoebe says. It’s also reducing species complexity: “we’re seeing that specialist species are losing out to generalist species as the climate crisis changes their habitats. It’s effectively homogenising the wildlife that we see in ecosystems.”\nAll is not lost\nBiodiversity is not necessarily irreversible – there are big opportunities for people to work towards ecological recovery in their local areas. In Wellington, New Zealand, residents introduced pest controls and other conservation efforts and watched certain species flourish again. “It’s amazing how quickly nature comes back if you create conditions in which it can do well,” Phoebe says.\nBut that example is but one, small local effort. Wildlife is disappearing at an alarming rate all over the world and more structural solutions that address global problems in the industrial agricultural industry are needed to reverse this trend.\n“There’s a book called Silent Spring which was written in 1962, which warned that if we continue damaging the environment the sounds of nature would disappear,” Phoebe says. “We’re now in this dire situation where somewhere in California can actually have its own silent spring. It’s a silent alarm bell of what’s to come.”\nWhat else we’ve been reading\n-\nCaroline Lucas kicks off Goodbye to all that, a new Guardian series of exit interviews with Westminster MPs standing down at the next election (whenever that may be). The longtime sole Green MP talks to John Harris about her career wins, losses – and what’s next. Charlie Lindlar, newsletters team\n-\n80% of US elections are run by women – and they face the brunt of the harassment levelled at government workers. Rachel Leingang takes a look at the individual and societal impact of misogynist attacks and the repercussions on democracy. Nimo\n-\nThe Guardian’s Phil Daoust is on a quest to live to 100 – and he won’t get there without fixing his insomnia. In this piece, Phil searches for an answer to his sleeplessness, and it turns out it might be surprisingly simple … Charlie\n-\nThere seems to be a growing fixation among younger generations on ageing and how to slow it down. Sarah Marsh spoke to experts to find out the economic and psychological driving factors behind this growing obsession. Nimo\n-\nThe caesar salad is meant to be a solid staple – so why are modern restaurants suddenly so obsessed with updating a classic? Ellen Cushing investigates “an age of unchecked Caesar-salad fraud” for the Atlantic. Charlie\nSport\nFootball | Manchester United won a truly remarkable FA Cup semi-final against Coventry. After leading 3-0 the Premier League giants were pegged back to 3-3, the tie went to extra time, the Championship side had what looked to be a winner ruled out by VAR before losing the penalty shootout 4-2. In the Premier League, Liverpool kept their title chances alive with a 3-1 win over Fulham. And in the WSL, Arsenal guaranteed a Champions League place with 3-0 at the Emirates against Leicester.\nAthletics | Kenyan runner Peres Jepchirchir won the women’s race at the London Marathon in a new women’s-only world record of 2hr 16min 16sec. That record, which applies to races without a male pacemaker, is nearly five minutes behind the official women’s record set last year. The men’s race was won by another Kenyan, Alexander Mutiso Munyao, and there was an unexpected surprise as two British men finished in the top four for the first time since 1988.\nFormula One | Max Verstappen won the Chinese GP with another dominant drive, extending his title advantage over teammate Sergio Pérez, who was third, to 25 points.\nThe front pages\nOn the Guardian’s front page the headline is “PM faces calls to put Afghan concession in Rwanda bill” as Rishi Sunak comes under pressure to exempt Afghans who served alongside UK forces. The Telegraph has “PM refuses to back under-fire Met chief” after an officer suggested that being “openly Jewish” was a provocation to pro-Palestinian protesters. The controversy leads the Mail too with the headline “Jewish leaders call on Met chief to quit”. In the Times it’s a different look at officers with “Voters put police in the dock”, as the paper covers a YouGov survey on confidence in police.\nThe Financial Times has the Ukraine war headlined with “Kyiv has no time to lose in deploying US weapons cash, Zelenskyy warns” after the US House passed a long-awaited aid package. In the i it’s “Tories face new pay clash with public sector workers before autumn election”, reporting that Labour could be on course to inherit talks if they win. In the Mirror, the headline is “Together for Stephen” as the paper says that Keir Starmer has promised to honour Stephen Lawrence’s legacy as it approaches 31 years since his murder.\nAnd in the Sun, “Russia Hacks Brit Hol Jets” as the paper reports that holiday flights are being hit by electronic hacks.\nToday in Focus\nWhere does the Cass review leave trans teenagers?\nDr Hilary Cass’s review of NHS gender identity services has been published. Hannah Moore speaks to Amelia Gentleman about what it means for children at the centre of it all.\nCartoon of the day | Edith Pritchett\nSign up for Inside Saturday to see more of Edith Pritchett’s cartoons, the best Saturday magazine content and an exclusive look behind the scenes\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nHeard about “straw wrinkles” yet? Emma Beddington has, to her regret. However, she has also decided the idea you should worry about crinkling your face while drinking belongs on her list of wellness trends you really don’t need to worry about.\nAlso making the list: sitting down too much, giving up fruit (“have a word with yourself”) and … fretting about where to park your super yacht.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 1871,
  "scraped_at": "2026-02-14T02:07:51.321263",
  "_text_extracted": true
}