{
  "article_id": "abea80b9a68c",
  "url": "https://www.teamtalk.com/chelsea/graham-potter-sack-latest-chelsea-bite-bullet-two-trusted-sources-reveal-todd-boehly-decision",
  "title": "Graham Potter sack latest : Chelsea bite the bullet after two trusted sources reveal Boehly decision",
  "date": "20230219T004500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nGraham Potter sack latest: Chelsea bite the bullet after two trusted sources reveal Boehly decision\nBen Jacobs has echoed the claims of David Ornstein, with both trusted journalists in agreement over whether Chelsea will sack under-fire manager Graham Potter.\nChelsea’s ailing season sunk to new depths on Saturday upon falling to a 1-0 home defeat to Southampton. The manager-less Saints were led by interim boss Ruben Selles for the trip to Stamford Bridge. Southampton entered the day rock bottom in the table having lost 10 of their last 11 in the league.\nHowever, another fantastic James Ward-Prowse free-kick proved the difference in the tie, with the visitors breathing new life into their campaign at Chelsea’s expense.\nThe defeat means the Blues have won just twice across their last 14 league encounters. They’ve also exited both the FA and EFL Cups on Potter’s watch and will take a one-goal deficit into the second leg of their Champions League Round of 16 clash with Borussia Dortmund.\nAll in all, Potter’s spell thus far has been nothing short of disastrous despite boasting one of the most expensively-assembled squads of all time.\nIndeed, Potter’s win percentage following the Saints loss slipped to a measly 36 percent. For reference, former Blues boss Thomas Tuchel was sacked despite registering a winning percentage of exactly 60.\nPotter and his team were heavily booed at the full time whistle on Saturday. Clearly, many of Chelsea’s match-going fanbase would like to see Todd Boehly pull the trigger.\nHowever, the Athletic’s David Ornstein recently reported that despite the dismal run of results, Boehly and co. do not intend to sack Potter.\nHis report – that was produced prior to the Dortmund and Saints defeats – stressed Potter was ‘under no pressure’.\nWhat does Boehly see in Potter?\nExplaining why, the journalist noted Chelsea’s hierarchy believe Potter should be judged on a basis of years and not months.\nFurthermore, they’ve looked across London and view the success Arsenal are experiencing under Mikel Arteta as a template from which they can follow.\nArteta endured a rocky ride during the early days as Gunners boss. However, Arsenal showed patience and in his third full season at the helm, are reaping the rewards.\nOrnstein also added failure to qualify for next season’s Champions League won’t be fatal for Potter.\nSecond source echoes Ornstein despite latest defeats\nIn the aftermath of the Dortmund and Southampton losses, many Blues fans may be hoping for a change of heart from Boehly. However, reporter Ben Jacobs has doubled down on Ornstein’s claim Potter is safe.\nJacobs tweeted on Saturday evening, “Big test now of the ownership’s backing in Graham Potter.\n“Message has always been he’ll be judged long-term based on “years not games”. But it’s a terrible run. One win in 10 in 2023.”\nIn a second tweet, Jacobs added: “It is not thought the losses to Dortmund and Southampton will change Chelsea’s faith in Graham Potter.\n“Ownership are still invested in him long-term despite the poor run of form.”\nRightly or wrongly, Chelsea’s board appear dead set on biting the bullet and showing faith in the man they chose to succeed Tuchel.\nIn other words, they hope it’s a case of short-term pain for long-term gain.\nGraham Potter responds to Chelsea boo boys\nThe subjects of Chelsea’s poor form and the negative response of the fans towards Potter and his team were broached during his post-match media duties.\n“After a 1-0 defeat at home, any criticism you get is understandable,” said Potter (via Football London).\n“I think we’ve had a tough period and I think we’ve had lots of challenges in terms of integrating young players into the Premier League. While results don’t go your way it can be tough, that is how it is.\n“I’m sure there will be people out there that think I’m the problem, absolutely. I don’t think they’re right but I’m not arrogant enough to say their opinion isn’t worth articulating.\n“My job is to help the team, keep working through a team period, we’ve had to make some changes today and the truth is we took a step back in our performance in the first half.\n“The response in the second half was good, but it wasn’t good enough.”",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:37:06.172346",
  "_text_extracted": true
}