{
  "article_id": "abf8c544c897",
  "url": "https://theathletic.com/4248055/2023/02/25/newcastle-carabaocupfinal-saudiarabia-manchesterunited/",
  "title": "Newcastle need the money that follows on - field success to overhaul  Big Six  ",
  "date": "20230225T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The anticipation is heavy and nerves are already frayed. Newcastle United’s first final for a generation is a day away and there is little point downplaying the sense of occasion that builds before facing Manchester United at Wembley.\nThe emotional attachment to Sunday’s match is acute. This is a rare opportunity for Newcastle fans to see a trophy lifted, a chance to cradle silverware for the first time since winning the Inter-Cities Fairs Cup in 1969. It will not matter that it is the Carabao Cup, a competition facing a fight for its very existence.\nAdvertisement\nNewcastle are on the cusp of winning a trophy earlier than most forecasted when the club was taken over by the controversial Saudi Arabia Public Investment Fund (PIF) in October 2021.\nAs well as the chance to create memories that last a lifetime, this also presents an opportunity for Newcastle to plant their flag in the ground.\nEnglish football knows that Newcastle have stirred in the last 16 months and the remainder of this season offers the chance for the project’s pace to be accelerated. Silverware and European qualification were always PIF’s aims and delivering both this season would see Newcastle begin to reel in the clubs they are trying to catch.\nFor all their obvious financial support — £250million ($300m) has been spent in PIF’s three transfer windows — Newcastle need success to follow. Financial fair play (FFP) rules have already inhibited manager Eddie Howe’s plans to strengthen and without revenue streams widening, the wealth of the club’s majority shareholders will not be as potent.\nAnd that is why these moments — cup finals and key games — matter.\nNewcastle are at the start of a journey to catch up on the ‘Big Six’ and need success to accelerate this process. They might have sneaked into Deloitte’s Football Money League in 20th place, but they still trail West Ham United, Leicester City, Leeds United and Everton for annual revenue.\nNewcastle’s turnover in 2021-22, reported by Deloitte as £179.8m, was half that of Arsenal — the worst financially performing of the Big Six sides last season.\nThat did not stop the north-east club from matching the Premier League leaders for money spent in the transfer market this season, propelled by enormous owner investment, but that cannot be legitimately sustained without off-field growth.\nNewcastle are playing catch up and nowhere is this more apparent than with their commercial income. Just £29m was generated through sponsors and partners last season, a figure that broadly put them on par with Wolverhampton Wanderers and Southampton.\nAdvertisement\nThat will rise this season with the first partnerships predictably struck with Saudi companies, including the PIF-owned Noon.com, Saudia Airlines and Saudi Telecom Company, but success for Howe’s side will bring tangible financial benefits.\n“The more that comes into Newcastle equals the more money that can go out,” says Kieran Maguire, host of the Price of Football podcast and senior lecturer at the University of Liverpool.\n“Commercial revenue is an area where they’ve got to grow. There’s a natural ceiling for matchday income because St James’ Park sells out anyway.\n“It’s £25m a year from matchday and that is fine, but Spurs put out their results last week and it was £106m. Manchester United is £110m. If Newcastle have got matchday income at £25m, it’s a bit like doing a 1,500-metre race and everyone starting a lap ahead of you. There is a hell of a lot of catching up to do.\n“Broadcast income is ultimately determined by the Premier League and UEFA. They can’t grow that, all they can do is perform better and get better results there. Let’s say £120m from the Premier League plus another £30m to £40m if you get into the Europa League and do well. You can double that if you get into the Champions League.\n“Commercial is the one area in which the club has a greater degree of control and opportunity to grow. That should be where they are focusing on.”\nMike Ashley, the club’s former owner, never did. Newcastle’s commercial revenue stood at £26m in 2008 and scarcely climbed in the years that followed. Tottenham Hotspur, by comparison, went from £39m to £184m in the same period.\nNewcastle’s commercial income represented just 15 per cent of their overall turnover last season. According to Deloitte, the average for the top 20 richest clubs was 41 per cent. “The Mike Ashley years were a disaster (commercially)… Newcastle have a lot of opportunity,” adds Maguire.\nAdvertisement\nNewcastle’s owners were soon made aware of the club’s off-field shortcomings after a £330m takeover led by PIF was ratified by the Premier League in late 2021. Chief executive Darren Eales dubbed it a “130-year-old start-up”, with just four permanent staff employed in the club’s commercial department at the end of 2021. Some rivals have over 200.\nPeter Silverstone, formerly Arsenal’s chief commercial officer for seven years, was appointed in the same role at St James’ Park in October and pledged to “deliver the commercial success vital to power the fans’ and the club’s ambitious growth plans”.\nNewcastle have already begun to address their self-inflicted restrictions. A front-of-shirt sponsorship deal with the Chinese betting firm Fun88 had been due to run until 2025 but was terminated in October to end an agreement worth £7m a year.\nThat was among the least financially lucrative deals in all of the Premier League and was dwarfed by Liverpool’s partnership with Standard Chartered, worth about £50m a year.\nNewcastle’s other primary partner, kit supplier Castore, is another deal that has left them lagging behind the Premier League’s biggest clubs. That is said to be worth just £5m a year and, as yet, there has been no break agreed.\nNewcastle’s next likely shirt sponsor, Noon.com, part-owned by Newcastle’s majority shareholders PIF, became the sleeve sponsor last summer and is thought to be paying a sum of £7.5m. Sleeve sponsors for clubs outside the Big Six are typically no higher than £2m.\nAny assessment of Newcastle’s commercial future is not complete with acknowledgement of the obstacles in their way. In the weeks that followed the Saudi-led takeover, the Premier League introduced a new ruling to govern related-party transactions amid concerns that distorted commercial deals would bring unfair advantages.\nAdvertisement\nIt means any sponsorship arrangement worth more than £1m a year has to be cleared by the Premier League to ensure it was agreed at a fair market value. Clubs are obliged to disclose the financial details of these sponsorships, with an assessment including the verdict of an independent expert.\nNewcastle will therefore have to persuade the Premier League that any major front-of-shirt sponsorship deal with a Saudi-based firm was not inflated for their benefit. Reaching Europe and winning trophies would help any case to be stated.\nThe search for a new primary partner has been complicated by other clubs, such as Manchester United and Chelsea, being in the market before 2023-24, but a successful season would undeniably strengthen Newcastle’s position.\n“The Premier League’s Fair Value panel was set up to try and take Newcastle out with a reducer,” says Maguire. “It’s an issue for the club but if they are in Europe and winning silverware, they can point to benchmarks for others in that position of competing in Europe.\n“We know where the sponsors will broadly be based and those sponsors are willing to pay as much as they think the Fair Value panel will allow.”\nThere is no direct financial incentive for winning the Carabao Cup final. Prize money to the winners was last season set at £100,000 (the FA Cup by contrast offers just short of £4m) but the indirect benefits would be obvious.\nNewcastle would guarantee themselves, at worst, a place in the Europa Conference League next season, before the season’s final 15 games offer the chance to upgrade that to either the Europa League or Champions League. A top-four finish would bring entry to the elite competition for the first time since 2003. “The eyeballs for the Champions League are huge,” says Maguire. “That’s where there’s always huge interest.”\nWith Premier League payments up in a new TV cycle, this is already guaranteed to become a record-breaking year for turnover at St James’ Park. This weekend, though, presents the opportunity to take the next step in an evolution driven by Saudi investment.\n(Top photo: Stu Forster/Getty Images)",
  "word_count": 1395,
  "scraped_at": "2026-02-14T01:55:49.887716",
  "_text_extracted": true
}