{
  "article_id": "abfb10bedebd",
  "url": "https://news.tuoitre.vn/barcelona-fight-back-to-draw-six-goal-champions-league-thriller-with-inter-103250501115126773.htm",
  "title": "Barcelona fight back to draw six - goal Champions League thriller with Inter",
  "date": "20250501T084500Z",
  "domain": "news.tuoitre.vn",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Denzel Dumfries scored twice for Inter, who led 2-0 and then 3-2, while Barca's 17-year-old starlet Lamine Yamal dazzled with a brilliant individual effort to kickstart the hosts' fightback.\nAfter a see-saw encounter that showcased Inter's clinical finishing and set-piece threat as well as Barca's attacking strengths and defensive vulnerabilities, the result leaves everything to play for in the return leg at the San Siro next Tuesday, as both teams seek a place in the final in Munich against either Arsenal or Paris St Germain.\nInter Milan made an explosive start, opening the scoring with 30 seconds on the clock courtesy of a cheeky back-heel from Marcus Thuram, the quickest goal in a Champions League semi-final.\nThe visitors extended their lead in the 21st minute with Dumfries finding the net with an acrobatic volley from a corner.\nHowever, an electrifying Yamal led Barcelona's fightback, unleashing a superb strike from inside the box after a clever run from the right, to reduce the deficit three minutes after Inter's second goal.\nPlaying his 100th game at 17 years and 291 days old, Yamal became the youngest player to score in a Champions League semi-final, surpassing Kylian Mbappe who was 18 when he did it in 2017.\nYamal went close again, hitting the post from close range before Ferran Torres levelled the score in the 38th minute with a first-time finish after a darting run to latch on to a Raphinha knock-down.\nDespite Barcelona's dominance, it was Inter who regained the lead in the 64th minute when Dumfries headed home from a corner. The hosts responded immediately, as Raphinha's thunderous strike from outside the box hit the woodwork before ricocheting off the back of Inter keeper Yann Sommer and into the net to restore parity.\n'Duty to win'\n\"When you play at home like we did, the sensation is that we should have managed to earn a better result,\" Raphinha told Movistar Plus.\n\"We can't concede that many goals, especially at home. Sure, you have to give praise to our opponents who are strong and played well tonight but we are Barca and it's our duty to win at home, that's how it is.\n\"But the result is not that bad and it leaves it all open for the return leg in Milan so we will try to correct the mistakes so we can go there and grab the win that will take us to the final.\"\nIn a riveting encounter, Inter were clinical with their finishing and withstood Barcelona's relentless attack while capitalising on counter-attacks and set-pieces. Sommer was instrumental in securing the draw for Inter with a series of impressive saves.\nBarcelona, fresh from their thrilling 3-2 victory over arch-rivals Real Madrid in the Copa del Rey final last Saturday, appeared to be feeling the effects of that gruelling, ill-tempered 120-minute match.\nThe team, already without striker Robert Lewandowski, suffered a further blow when French fullback Jules Kounde was forced off in the first half with a suspected leg muscle injury.\nInter also had injury concerns, with star striker Lautaro Martinez unable to return for the second half due to a hamstring issue, having already lost Benjamin Pavard to an ankle injury.\nBarcelona's Yamal was seemingly unstoppable and twice hit the frame of the goal, including with a late chip following a brilliant run, while Henrikh Mkhitaryan thought he had scored Inter's fourth on another quick counter, but the VAR replay showed he was offside by the tip of his boot.\n\"The match was beautiful and entertaining, even from the pitch we experienced it well, facing players of crazy calibre,\" Inter defender Alessandro Bastoni told Sky Sport.\n\"We are happy with the result, we could have avoided some mistakes with a bit more attention but we give credit to Barcelona. Now it's back to 0-0 again and whoever wins goes to the final so let's do it.\"",
  "word_count": 646,
  "scraped_at": "2026-02-14T01:52:20.882757",
  "_text_extracted": true
}