{
  "article_id": "ac00553897a1",
  "url": "https://www.chroniclelive.co.uk/whats-on/food-drink-news/delicious-new-food-newcastle-fans-32382292",
  "title": "The delicious new food Newcastle fans can now enjoy at St Jame Park as matchday menu revamped",
  "date": "20250830T194500Z",
  "domain": "chroniclelive.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United revamp match day menu as new food put on menu at St James' Park\nFootball fans attending Newcastle United matches at St James' Park can tuck into some delicious new additions to the matchday menu\nWith Premiership and Champions League football on the menu for Newcastle United this season, there is plenty of food for thought for Magpies fans. And that's not just restricted to the football pitch either, as the matchday menu at St James' Park has been revamped to include some delicious new additions.\nEddie Howe's preparations for the 2025/6 season certainly weren't without their challenges, as he saw transfer targets like Hugo Ekitike and Benjamin Sesko slip away and striker Alexander Isak refuse to play, as he continues to stand firm on wanting a move away from the club. Back on the field, United started the new campaign with a 0-0 draw away at Aston Villa, before losing 2-3 at home to Liverpool in the dying moments on Monday.\nOn the same day they signed forward Nick Woltemade from Stuttgart for a club record £65 million, NUFC had a tricky teatime trip to Leeds to contest on Saturday, with a 0-0 draw taking their tally for their first three games to just two points out of a possible nine, going into the international break.\nFans now know that Newcastle will face Barcelona, Union SG, Benfica, Athletic Club, Marseille, Bayern Leverkusen, PSV Eindhoven and Paris St Germain in the league phase of the Champions League, after the draw was made on Thursday evening. Fans will still have very vivid memories of the great night under the lights at St James' in October 2023, when United beat PSG 4-1 and, as well as some spicy clashes in the Premier League and Europe in store this season, there's some tasty things going on in the concourses of SJP.\nFans can look forward to bold new additions including the delicious Hot Honey Chicken Burger £8, fiery Fire Fries £5, and Loaded Hotdogs £7.50. Following the huge popularity of last season’s loaded fries, the club are also bringing back the fan favourite Salt & Pepper Chicken, and expanding the menu with mouth-watering new toppings: pulled pork and a cheeseburger option, all priced £8.90.\nAs well as kiosk food options, fans can elevate their matchday experience with Wings Hospitality, Newcastle United’s premium offering located behind the Leazes End goal. Guests are treated to a modern three course bistro style menu featuring seasonal dishes. Players including Bruno, Dan Burn, and Nick Pope have stepped into the kitchen as part of the club’s Wingin’ It cooking challenge, swapping boots for aprons to showcase their culinary skills.\n.We have a dedicated newsletter for What’s On news and reviews. It’s free and you can sign up to receive it here. It will keep you up to date with all the latest updates on food, drink, entertainment and events in and around the North East.\nChronicleLive has created a dedicated WhatsApp community for What’s On news and updates. You can join this WhatsApp community here. It will keep you up to date with things to do around the North East and breaking gig announcements, sent directly to your phone.",
  "word_count": 533,
  "scraped_at": "2026-02-14T01:58:57.501826",
  "_text_extracted": true
}