{
  "article_id": "ac166afed7c2",
  "url": "https://www.cityam.com/sheffield-united-cut-ties-with-data-firm-over-takeover-bid-for-rivals-wednesday/",
  "title": "Sheffield United cut ties with data firm over takeover bid for rivals Wednesday",
  "date": "20260114T083000Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sheffield United cut ties with data firm over takeover bid for rivals Wednesday\nSheffield United have terminated their consultancy contract with Short Circuit Science after the data company was named the preferred bidder of rivals Sheffield Wednesday last month.\nThe business founded by former professional poker player James Bord had been advising Sheffield United on new signings and recommended the recruitment of Ruben Selles as manager last summer, but is now in the process of attempting to buy city rivals Wednesday and was named preferred bidder by administrators from Begbies Traynor on Christmas Eve.\nBord is part of a three-man consortium behind the Sheffield Wednesday bid along with associates Felix Roemer and Alsharif Faisal Bin Jamil, who has been lined up as the club’s new chief executive.\nShort Circuit’s work for Sheffield United was controversial and played a role in the departure of Chris Wilder at the end of last season due to his reservations about the use of AI in their transfer model, although he has since returned to Bramall Lane in place of Selles.\nSheffield United are attempting to offload many of the players signed by Selles, with the loan agreements for Ben Godfrey and Louie Barry set to be terminated and Swedish defender Nils Zatterstrom to be sent out on loan.\nA source close to Short Circuit Science told City AM that the contract was cancelled by mutual agreement.\nCarabao semis face uncertain future\nThe future of the Carabao Cup’s two-legged semi-finals, which began last night and continue tonight, is expected to have a central role when the Independent Football Regulator finally opens formal negotiations between the Premier League and the EFL over a much-delayed new financial settlement.\nPremier League clubs would like the Carabao Cup to move to a single semi-final to ease fixture congestion, which has been magnified by the expansion of the Champions League to encompass two extra midweek dates in January. While the EFL is willing to negotiate, it will not cut its flagship knockout competition without a significant increase in funding from the top flight.\nUnder the terms of its current TV contracts the EFL is committed to retaining two-legged semis until 2029, and that three-year buffer could suit the league. The IFR’s first responsibility after being formed last year is to complete a State of the Game review, meaning formal talks over a new deal, which has been on the agenda for six years, are unlikely to begin until 2027, at which point the EFL will be preparing to go to market with a new TV tender.\nWith the clock then ticking on its media rights auction, the EFL will be able to present the Premier League with a deadline for making an increased offer in return for dropping one semi-final from 2029 onwards, particularly as the IFR has been given backstop powers to impose a financial settlement if the two leagues are unable to agree.\nWhile it will not say so publicly, the EFL also finds scheduling Carabao Cup ties a logistical challenge, as was shown earlier this week when it announced that next season’s first round will take place before the league has kicked off over the weekend of 7 to 9 August due to the scarcity of midweek dates during the season.\nTNT’s LIV Golf pledge\nTNT Sports is planning to send production teams and commentators to all 14 LIV Golf events it will broadcast live this year after picking up the UK and Ireland rights last week.\nLIV is not believed to have charged a rights fee for the fifth season of its global tour, but has secured a commitment that TNT will invest significantly in on-course production.\nTNT appears to have learned lessons from its recent coverage of the Ashes, which was widely criticised for a hybrid approach which involved having only one commentator live at the ground in Australia with another working from a studio in London.\nIronically TNT’s biggest faux pas of the series came from commentator at the Sydney Cricket Ground, Rob Hatch, who wrongly told viewers that Ben Stokes had been run out in England’s second innings based on a TV replay of Jamie Smith’s earlier dismissal by Marnus Labuschagne.\nStokes had faced just three deliveries when Hatch exclaimed: “It’s happening again, it’s happening again! Stokes goes, two run outs in two overs, England are imploding!” before quickly correcting himself following the intervention of Alastair Cook. “Well thankfully someone’s looking out the window of the box, and it’s Alastair Cook!,” Hatch said drily.\nThe first event of the LIV Golf seasons takes place in Riyadh on 4 February, with TNT due to announce its commentary and presentation teams imminently.\nTennis shorts in fashion\nShort-form tennis is emerging as one of the biggest growth areas in sport, with the first One Point Slam taking place ahead of the Australian Open this week and the owners of the Tie Break Tens format in talks with several Masters tournaments about signing partnership agreements.\nIndian Wells will stage another Tie Break Tens event in March, featuring eight mixed doubles teams competing in 10-point matches, after Taylor Fritz and Elena Rybakina won a trophy christened the Eisenhower Cup last year.\nThe format in Melbourne is even shorter and simpler, with 24 amateurs and celebrities invited to play a single point against top players including Carlos Alcaraz, Jannik Sinner and Iga Swiatek, with A$1m (£490,000) on offer if they win it.\nWSL wheeler-dealing\nThe Premier League transfer market may be deathly quiet to date, but there has been a flurry of activity in the Women’s Super League where free-spending clubs are set for a record-breaking January window.\nAfter the £1m barrier was broken by Arsenal and London City Lionesses last summer it is the quantity of transfers that is likely to set records this month, with the current total of 16 permanent moves and 17 loan signings both the most ever recorded at this stage of a winter window.",
  "word_count": 991,
  "scraped_at": "2026-02-14T02:09:43.009254",
  "_text_extracted": true
}