{
  "article_id": "ac261dc2bfd4",
  "url": "https://www.geosuper.tv/latest/24163-qatari-sheikh-jim-ratcliffe-submit-final-offer-to-buy-manchester-united",
  "title": "Qatari Sheikh , Jim Ratcliffe submit final offer to buy Manchester United",
  "date": "20230429T194500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nApril 29, 2023\nQatar's Sheikh Jassim bin Hamad Al Thani and Jim Ratcliffe have submitted their final offers to purchase Manchester United.\nThe Glazer family, the current owners of the Premier League club, have been in talks with both parties, with Sheikh Jassim appearing to be Ratcliffe's main competition.\nSheikh Jassim's latest bid is reportedly over £5 billion ($6.2 billion), while Ratcliffe's improved offer has not been made public yet. However, sources suggest that Sheikh Jassim's bid comes with a promise of significant additional funding for transfers and infrastructure, including renovating Old Trafford Stadium and the club's training facilities. Moreover, his bid promises to wipe out Manchester United's $620 million debt, which would surely endear him to the club's supporters.\nOn the other hand, Ratcliffe, the founder of INEOS chemical company, wants a controlling stake of more than 50% in the club, which would allow the Glazer family to retain a 20% stake. The move has raised concerns among a fanbase that is tired of the Americans' controversial reign.\nThe Glazers reportedly want a record-breaking £6 billion fee for a sports club before they agree to sell Manchester United. This asking price raises the possibility that they may not accept either Sheikh Jassim's or Ratcliffe's offer.\nSince the Glazers' leveraged takeover of the club in 2005, they have been deeply unpopular with supporters, who are in dire need of new investment. Private equity firms such as Elliot Investment Management and The Carlyle Group are among the parties in the market for a minority stake, which could allow the Glazers to retain control and provide funding for investment in the club's infrastructure.\nThe Manchester United Supporters' Trust (MUST) has called for a swift conclusion to the process to allow new owners to be in place for the summer transfer window. The fans' group is believed to be planning a protest against the Glazers ahead of Sunday's match with Aston Villa at Old Trafford.\nUnder the Glazers' ownership, Manchester United has been in steady decline both on and off the field over the past decade. The Red Devils have not won the Premier League title since former manager Alex Ferguson retired in 2013. Additionally, the club's revenue has fallen behind local rivals Manchester City and Liverpool due to a lack of regular Champions League football and a failure to modernize Old Trafford.\nHowever, under Erik ten Hag's management this season, Manchester United is enjoying a renaissance. They ended a six-year trophy drought by lifting the League Cup in February and are set to face Manchester City in the FA Cup final on June 3.",
  "word_count": 435,
  "scraped_at": "2026-02-14T01:55:54.923072",
  "_text_extracted": true
}