{
  "article_id": "ac328a8c989b",
  "url": "https://www.con-telegraph.ie/2023/02/24/senior-chelsea-players-tell-graham-potter-last-pre-season-was-worst-theyd-had/",
  "title": "Senior Chelsea players tell Graham Potter last pre - season was worst theyd had",
  "date": "20230224T213000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Senior Chelsea players tell Graham Potter last pre-season was worst they’d had\nBy Robert O'Connor, PA\nGraham Potter has revealed some senior Chelsea players told him that last summer’s pre-season preparations under his predecessor were the worst they had ever experienced.\nThe club sacked former boss Thomas Tuchel in September less than seven weeks after the team returned from touring the US, a turbulent two-week trip during which the German’s relationship with the Blues’ ownership began to break down.\nPlayers had their professionalism questioned publicly by the manager after a chastening friendly defeat to Arsenal, with co-owner Todd Boehly quickly losing faith in the coach that won the Champions League just a year previously.\nTuchel’s removal marked the end point of a rapid decline following victory in the final against Manchester City in Porto, that came amidst an unprecedented turnover of personnel on and off the pitch after the club’s sale to Boehly’s Clearlake Capital consortium.\nPotter, who was appointed as Chelsea’s new manager six league games into the season, has inherited the fallout from that overhaul, with his new-look side’s struggle to find form culminating in a chastening 1-0 defeat at home to the Premier League’s bottom side Southampton last Saturday.\nPlayers signed during the January transfer window at a total cost of more than £315million are yet to make a decisive impact on improving the team’s fortunes.\n“It’s really tough,” said Potter, whose 10th-place side travel to face Tottenham on Sunday. “I’ve said this is the toughest job in football. There’s lots of factors for that. We had a sub-optimal pre-season, speaking to our experienced guys, they thought it was the worst they’d ever had. That’s not to blame anybody. It happened.\n“Organisationally, the tour didn’t work as well as they’d like. I wasn’t there, I can’t say. Then there was a manager change, old players have left, new players have come in. Then I turn up in the middle of the Champions League, (playing) Saturday-Tuesday, Saturday-Tuesday. We had the most unprecedented injury situation in that period.\n“Then the club invested a lot of money in the squad, which (raises) the pressure, the expectation, the noise. But the players that we’ve got, they’re not 28-year-old, 400-game Premier League players. They’re young players that need time to adapt.”\nPotter was subject to a small number of supporters at Stamford Bridge calling for him to leave following defeat to Saints, with attacks on social media becoming increasingly personal.\nHis team have won just twice in their last 14 games, and have scored a single goal at home in 2023.\nHe admitted pressures of the job were compounded by the reaction of a minority of fans, but acknowledged little sympathy for his situation exists in the media and amongst supporters.\n“I don’t think anybody is really bothered,” he said. “That’s the truth. Because I’m the manager of Chelsea. I’ve been asked for four months about pressure. When the results are what they are, you accept it.\n“It’s fascinating to see the process play itself out. I’ve sat here for four months and answered questions about pressure, about time, have you spoken to the owners. It’s the same questions every week.\n“The mood (with reporters) has always been relatively positive and respectful. But it’s not to say it’s easy. Your family life suffers, your mental health suffers. Your personality. It’s hard. (The media) are not really bothered. That’s how it is.\n“Supporters are entitled to be angry. My response is there are things that are contributing factors to that result (against Southampton). I’m not here to convince them (with words). My actions have got to convince them. We’ve got to win matches. There’s nothing I can say.”",
  "word_count": 615,
  "scraped_at": "2026-02-14T01:55:49.890047",
  "_text_extracted": true
}