{
  "article_id": "ac57a824d8c5",
  "url": "https://www.teamtalk.com/news/arsenal-hijack-liverpool-move-real-madrid-midfielder-eduardo-camavinga",
  "title": "Arsenal transfers : Andrea Berta to launch spectacular hijack of Liverpool signing target as Zubimendi upgrade earmarked",
  "date": "20260201T090000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal to launch spectacular hijack of Liverpool signing target as Berta pinpoints elite Zubimendi upgrade\nA fresh report from Spain claims that Arsenal are ready to go toe-to-toe with Liverpool, amongst other Premier League clubs, when it comes to securing the signing of an elite Real Madrid star considered an upgrade on summer signing Martin Zubimendi.\nDespite being in a strong position in both the Premier League and Champions League this season, with Mikel Arteta’s men favourites to win both competitions, plans for summer signings are already taking shape – just two days out from the January window signing.\nArsenal secured an elite signing of their own on Friday when they managed to secure the long-term future of incredible teenage talent Max Dowman, but sporting director Andrea Berta is not done when it comes to bolstering a Gunners first-team squad that is already bursting with talent.\nAnd now the latest reports from Spain suggest that a ‘bidding war’ is on the cards for Real and France midfielder Eduardo Camavinga, a battle that the north London side are very much in the midst of.\nThe report by Spanish outlet Fichajes, an outlet known for being on the speculative side, states that the Spanish giants could be willing to offload Camavinga for a figure of around £60million (€69m / $82m), which does seem on the low side for a player who remains under contract until 2029.\nIt’s claimed that Arsenal’s interest in the 23-year-old is ‘concrete’, although he’s not the only Real Madrid star on their radar, with eyes also on Turkish playmaker Arda Guler.\nHowever, in terms of a move for Camavinga, which would not come until the summer, it’s stated that Arteta loves the player’s profile of being able to fill multiple roles, although it’s as a defensive midfielder where he is at his best.\nThe report goes on to add that Camavinga’s potential departure is one that Madrid are looking to do in their bid to freshen up a squad that has largely underperformed this season, and will need to get past Jose Mourinho’s Benfica to reach the last 16 of the Champions League in a two-legged play-off.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nCamavinga to potentially leave Zubimendi out in the cold\nIt’s claimed that Arsenal view Camavinga as an upgrade of Zubimendi, who arrived in a £60m deal from Real Sociedad, having also had long-standing interest from Real Madrid.\nWhile more of a physical box-to-box midfielder than Zubimendi, Camavinga is also more than capable of playing the holding role at the base of Arteta’s engine room – as he has done on 11 occasions for Real so far this season.\nThere is also a general consensus that Camavinga’s game is well-suited to the physical nature of English football and that he would be a big hit in the Premier League, hence Liverpool’s strong interest in the player.\nOur sources actually reported back in December that the Reds hold a genuine interest in Camavinga, that’s despite the player himself not actively to quit Real.\nHowever, he may have little option but to move on, if Real feel that an overhaul of their current squad is necessary to compete with a Barcelona side that appears to be going from strength to strength in Spain, alongside the dominance of Premier League teams in Europe.\nTo that end, a major battle could be set to take place for Camavinga this summer, one which Arsenal look very much set to be embroiled in.\nDON’T MISS: All the done deals by Premier League clubs in the January 2026 transfer window\nMore Arsenal news: Real target Gunners star; explosive winger chase\nIronically, Real Madrid are interested in signing an Arsenal player who has fallen out with Mikel Arteta and did not start against Leeds United, according to a speculative report in the Spanish media.\nElsewhere, Arsenal are preparing to rival Manchester United and Liverpool for a top RB Leipzig attacking star, according to journalist Christian Falk.\nFinally, Arsenal are preparing to escalate their interest in Atletico Madrid forward Julian Alvarez, TEAMtalk understands with sources indicating the Gunners are willing to include first‑team players in a potential summer swap that could help them steal a march on several European rivals.",
  "word_count": 724,
  "scraped_at": "2026-02-14T01:59:36.850763",
  "_text_extracted": true
}