{
  "article_id": "ac5feff0d5f3",
  "url": "https://www.themag.co.uk/2025/04/st-james-park-awaits-newcastle-v-brentford-preview-newcastle-united-premier-league/",
  "title": "St Jame Park awaits - Newcastle v Brentford preview",
  "date": "20250402T120000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "St James’ Park awaits – Newcastle v Brentford preview\nWelcome to the Newcastle v Brentford preview.\nWednesday 2nd April – 7.45pm kick-off.\nCarabao Cup winners Newcastle United host Brentford on Wednesday night, hoping to go on and cement their place as Champions League contenders with a view to achieving the most successful season in living memory.\nStanding between us and three more points is a Brentford team who have already beaten the Toon in the League this season and have an outside chance of European football themselves.\nCurrently in eleventh place and six points behind United, although Eddie Howe’s side do have a game in hand.\nBrentford have been put to the sword once this season at St James’ Park in the League Cup quarter-final and a repeat of that 3-1 success would do very nicely indeed.\nForm\nNewcastle have won three and lost three of their past six Premier League matches with wins over West Ham, Nottingham Forest and Southampton being cancelled out by defeats to Liverpool, Man City and Fulham.\nWe’ve also played four cup games during this time, losing to Brighton after beating Birmingham in the FA Cup, but gloriously enjoying well deserved victories over both Arsenal and Liverpool, on the way to winning our first domestic trophy for seventy years.\nWe’re approaching a period in the season where form is absolutely crucial, the last ten matches of the campaign offering thirty points and the Toon will need to win the majority of them to finish in the top five and qualify for the lucrative Champions League. With only five points separating seven teams, we’ll finish this set of midweek fixtures between fourth and tenth in the table.\nBrentford have won three, drawn one and lost two of their past six matches, beating Bournemouth, Leicester and West Ham all away from home, they drew with Everton but lost to Aston Villa and Tottenham Hotspur. They’ll finish this set of fixtures tenth, eleventh or twelfth.\nLast time out\nNewcastle players and fans certainly enjoyed their last match.\nThe Toon marched to Wembley and put the mighty Liverpool to the sword in a match that will go down in history!\nHaving lost the last five finals we’d appeared in, the Toon were desperate for a victory and things felt different from the off. Newcastle were by far the better team all match but had to wait forty five minutes for the opener when local hero Dan Burn powered a Kieran Tripper corner into the back of the net.\nThings got even better for the travelling Toon fans at the start of the second half when Alexander Isak confirmed his status as the hottest prospect in world football by smashing home a brilliant second. With NUFC 2-0 up and looking menacing, we were in dream land. Not even a late Liverpool consolation could spoil the mood as the final whistle sent Newcastle United into ecstasy! Parties broke out all over London, Newcastle and pretty much everywhere in between, as Mags from all four corners of the globe celebrated a truly monumental result as we lifted our first trophy in a generation.\nBrentford were also celebrating that weekend having enjoyed a fine win away in the Premier League over high flying Bournemouth. A 2-1 success for the Bees was achieved despite going behind early on. This was their fifth away victory in a row, here’s hoping they don’t achieve the half dozen at St James’ Park.\nStat attack!\nNewcastle have won two and drawn one of the three premier league meetings between the sides at St James’ Park.\nBrentford haven’t won at St James’ for ninety years.\nNewcastle have won eight of the last nine home matches with Brentford.\nNewcastle have scored nine goals in their past three Premier League home games with Brentford.\nThe two sides have met seven times in the Premier League with United winning five, drawing one and losing just once, earlier on this season.\nMemorable match\nIn 2022, Brentford visited Newcastle and came bearing gifts!\nThe scoring was opened after just twenty one minutes when Bruno buried a header from a short corner routine to give United the lead. Seven minutes later the advantage was doubled when a poor back pass was intercepted by Callum Wilson who unselfishly rolled the ball to Jacob Murphy, giving him the simplest of tasks to tap home into an empty net. With the score 2-0 at half-time, fans were confident of further scoring for the black and whites.\nThings are never that simple for NUFC and the next goal came from former Toon man Ivan Toney who netted a penalty at the Leazes End to half the arrears. Thankfully, two minutes later Bruno settled any nerves by running at the Brentford defence and smashing home a glorious third. Newcastle would go on to score two more, another loose back pass led to a Toon goal when Almiron was able to round the ‘keeper and make it 4-1, then a Brentford defender defected a cross into his own net to make it five. This was a fine win for Newcastle United but it’s safe to say three of our five goals were gifted by our very generous visitors. Final score Newcastle 5-1 Brentford.\nPlayed for both\nSir Les Ferdinand – A little known fact is that Toon royalty Sir Les played three times for Brentford on loan from Queens Park Rangers back in 1988. The legendary striker failed to find the net and returned to QPR before signing for NUFC in 1995. The rest, as they say, is history. Two years, fifty goals, two second place Premier League finishes and many happy memories. His sale to Tottenham in 1997 remains one of the worst footballing decisions of NUFC in living memory.\nCarl Cort showed early promise when signed by Sir Bobby in 2000. The England under 21 striker took just four minutes of his home debut to find the net with a powerful header in a 3-2 victory over Derby County. Unfortunately, his time at the Toon was plagued with injuries and we never really saw the best of him. My personal highlight of Cort’s time at Toon is an often-overlooked cracker at home to Everton when he volleyed home with the outside of his foot at the Gallowgate End in a fabulous 6-2 win. He played thirty one matches for Brentford between 2009-2011 scoring six goals.\nIvan Toney began his career at Northampton Town before signing for the Toon in 2015. He struggled to break into the first team. After a number of loan moves, he signed for Peterborough and then Brentford, scoring sixty seven league goals for the Bees before moving to the Saudi Pro League last summer.\nManagers\nEddie Howe after an historic 2-1 Wembley victory over Liverpool:\n“When we came here [to replace Steve Bruce] we were fighting relegation so job number one was to try and stay in the league, after that we knew we were under pressure to win. Everyone’s rewarded with this day; I’m just so pleased for the supporters and what they’ve given me personally and the team this year. It’s been a long wait for a trophy and no-one deserves it more than them. It had a different feel. We have won the game and everything will be reviewed positively but we prepared well and I was very confident the players would perform. We were well aware of the history and we wanted to do the club proud. We wanted to score, we wanted to perform and we wanted to win. We are breaking new ground. I thought we were magnificent today. I am very, very emotional and have been all day, which is unlike me.”\nThomas Frank after a 2-1 away win at Bournemouth:\n“I thought it was a very good game, especially in the first half. Second half I thought Bournemouth started better. We scored a great, ugly goal from a long throw that won us the game. It’s a fantastic record, unbelievable. Now we just need to keep the away record and hopefully add five home wins.”\nCharity\nNewcastle United fans food bank will once again be collecting opposite the Gallowgate end and gratefully receiving food, money and toiletries for those in need. Of particular interest are non-perishable food and drink items (such as noodles, pasta, rice, canned food, soup, cereal, cordial, long life milk etc) as well as toiletries such as shower gel, shampoo, toothpaste and sanitary products. Please give whatever you can, any donation is very much appreciated.\nFor further info and/or to donate online go HERE.\nPrediction\nSt James’ Park will host an absolutely incredible celebration this Wednesday night as fans and players gather for the first match since gloriously lifting our first major trophy for fifty six long years. This promises to be a really special occasion.\nConfidence on Tyneside is sky high at the moment and the Toon have the opportunity to carry on the party.\nIf NUFC can take the momentum from the Cup Final into this match then a very welcome three points will be the outcome. Newcastle 2-0 Brentford.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1532,
  "scraped_at": "2026-02-14T02:28:37.520098",
  "_text_extracted": true
}