{
  "article_id": "ac714307f894",
  "url": "https://www.teamtalk.com/news/every-transfer-that-broke-world-record-last-30-years",
  "title": "Every football transfer that broke the world record over the last 30 years",
  "date": "20240724T214500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every transfer that broke the world record over the last 30 years, featuring FIVE Real Madrid signings\nIt has now been seven years since Neymar became the most expensive player in football history with his 2017 transfer to Paris Saint-Germain. And there is little sign of a deal on the horizon that could eclipse the Brazilian’s mega-move to Ligue 1.\nBut over the last 30 years, the world transfer record has been broken 13 times, with clubs from England, Spain, Italy and France all taking turns to outspend each other for the game’s biggest stars.\nHere’s every world-record move of the last three decades.\nRonaldo to Barcelona – £13.2 million – 1996\nUnless an avid viewer of Dutch football or a subscriber to World Soccer magazine, the average football fan might not have been aware of Ronaldo when, aged just 19, he became the world’s most expensive player in the summer of 1996.\nThe young striker had scored 54 goals in 57 games for PSV after moving to the Eredivisie club from Corinthians in 1994. Already a regular starter for world champions Brazil, he was a fast-rising star of the global game.\nBarcelona paid £13.2 million to take Ronaldo to the Camp Nou in July ’96 and they didn’t regret it. Although they finished only second in the table, two points behind Real Madrid, their prized centre-forward scored 34 La Liga goals in 37 games, winning the European Golden shoe.\nAlan Shearer to Newcastle – £15 million – 1996\nIf Ronaldo was a still-emerging superstar in the summer of 1996, Alan Shearer was very much the man of the moment.\nThe Blackburn Rovers striker had starred in England’s run to the semi-finals of the European Championship on home soil after a third successive 30-plus-goal season in the Premier League.\nHe was a man in demand, too. Manchester United and Real Madrid both made moves to sign Shearer that summer, but the prolific scorer chose to join Newcastle United, his boyhood club, in a £15 million deal that set a new world transfer record just six weeks after Ronaldo’s move to Barca.\nWhile Shearer was never able to help the Magpies claim a first major trophy since the 1960s, he etched a legacy as a club legend, becoming Newcastle’s all-time leading scorer with 206 goals in 405 games.\nGO DEEPER – The biggest transfer after every European Championship since Euro 96\nRonaldo to Inter Milan – £19.5 million – 1997\nNot to be outdone, just a year after he was quickly usurped as the world’s most expensive player, Ronaldo set a new high mark with a £19.5 million move to Inter Milan.\nThe Brazilian icon had enjoyed a frankly staggering season at Barcelona under Bobby Robson, scoring 47 all-competitions goals in just 49 games, winning the UEFA Cup Winners’ Cup and the Copa del Rey.\nHe was just 20 years old yet had firmly established himself and by far the best player in the world, showcasing electric pace, spellbinding skill, unerring finishing and the ability to conjure goals from almost any situation.\nThe move to Inter made Ronaldo the first player to twice break the world transfer record since Diego Maradona. The Brazilian initially maintained his otherworldly performance levels in Italy, claiming his first Ballon d’Or at the end of 1997 as well scoring 34 goals and winning the UEFA Cup in his first season with the Nerazzurri.\nA succession of near-career-ending knee injuries then blighted his young career, though, ultimately leading to his glorious redemption at the 2002 World Cup.\nDenilson to Real Betis – £21.5 million – 1998\nIn a deal that had been agreed a year in advance, 21-year-old Brazil winger Denilson signed for big-spending Real Betis shortly after helping the Selecao reach the World Cup final in 1998.\nThe move instantly made the stepover-happy wide player one of the most talked-about players in Europe. He’d played almost 200 games and scored 26 goals for Sao Paulo in Brazil prior to his switch to Spain, impressing with his dribbling ability and speed.\nDenilson was never able to live up to his hefty price tag in La Liga, though, scoring just 14 goals across six seasons with Betis. By the time Los Mejores won the Copa del Rey in 2004 he was only a bit-part player and he left to join Bordeaux a year later.\nChristian Vieri to Inter Milan – £32 million – 1999\nSerie A was Europe’s richest and most glamorous league for much of the 1990s. In the last summer of the decade, Inter splashed the cash to sign of Italy’s finest goal-scorers.\nChristian Vieri had played for six different clubs in his homeland by the time he earned a first Azzurri call-up after a string of impressive displays for Juventus in the 1996-97 season. But those performances didn’t stop the Old Lady from cashing in on the powerful centre-forward, selling him to Atletico Madrid for £12.5 million in 1997.\nAfter 29 goals in 32 games for Atleti and four goals for Italy at the 1998 World Cup, Lazio paid £17.5 million to take Vieri back to Serie A. And just one year later, Inter smashed the world transfer record to become Vieri’s ninth club in as many seasons, forking out £32 million.\nThe vagabond centre-forward made a home for himself at the San Siro, scoring 123 goals in 190 games over six seasons with Inter.\nHernan Crespo to Lazio – £35.5 million – 2000\nSerie A saw another record deal a year after Vieri moved to Inter. And it was one of the Italian striker’s (many) former clubs who set the new high mark.\nLazio were consistently among Europe’s biggest spenders over the late 1990s and early 2000s, but few of their moves made headlines in the way their £35.5 million capture of Hernan Crespo from Parma did.\nCrespo had spent four prolific seasons with Parma after leaving River Plate in his homeland in 1996, scoring 80 goals in 151 games. In the summer of 2000, the Argentinian striker was coming off the best season of his career to date, netting 22 times in Serie A. And the year before, he’d helped fire Parma to a Coppa Italia and UEFA Cup double.\nIn reality, less than half of the sum Lazio stumped up for Crespo was cash, with a £16.5 million fee augmented by Matias Almeyda and Sergio Conceicao moving the other way.\nCrespo finished as Serie A’s top scorer in his first season at the Stadio Olimpico, scoring 26 goals. But just two years after his record transfer, he was on the move again, sold to Inter to replace Real Madrid-bound Ronaldo.\nLuis Figo to Real Madrid – £37 million – 2000\nIn a move that shook the football world, Real Madrid triggered the release clause in Luis Figo’s Barcelona contract to sign the Portuguese superstar from their bitter rivals in the summer of 2000.\nLess than two weeks after Crespo had become the world’s most expensive player, Figo took his crown as Madrid spent £37 million on the former Sporting CP player.\nFigo was a hit in Madrid, winning the Ballon d’Or in 2000 and named the FIFA World Player of the Year in 2001. He went on to win two La Liga titles and one Champions League over five seasons at the Bernabeu.\nZinedine Zidane to Real Madrid – £46.6 million – 2001\nThe seismic signing of Figo had ushered in the ‘Galacticos’ era at Real Madrid, with the club from Spain’s capital spending big on one of the top names in the game each summer for most of the 2000s.\nAnd there was no bigger name in the summer of 2001 than Zinedine Zidane. After guiding France to World Cup and European Championship glory in 1998 and 2000 respectively, the classy midfielder was widely regarded as the best player in the world.\nMadrid forked out a staggering £46.6 million to sign Zidane from Juventus, a record that would stand for eight years. The Frenchman justified that outlay by winning a La Liga title, a Champions League and his third FIFA World Player of the Year award during five seasons at the Bernabeu.\nKaka to Real Madrid – £56 million – 2009\nWhen Zidane’s price tag was finally topped, it was again Real Madrid who set a new record. And once again it was via a superstar signing from Serie A.\nKaka was 27 years old, a Ballon d’Or and Champions League winner and well established as one of the best players in the world when Madrid made a £56 million move to sign the Brazil attacker from AC Milan in 2009.\nBut Kaka’s Madrid switch was eclipsed by another Los Blancos signing the same summer – more on that later – and through a combination of injuries and underperformance, he was never able to replicate his Milan form in Madrid.\nAfter 29 goals and 32 assists in 120 appearances over four seasons, Kaka returned to the San Siro in 2013.\nCristiano Ronaldo to Real Madrid – £80 million – 2009\nIn one of the most extravagant summers of spending ever embarked upon by a single club, as well as also signing Karim Benzema for £35 million, Real Madrid broke the world transfer record again after buying Kaka in 2009.\nLos Blancos had tried to sign Cristiano Ronaldo a year earlier, but Manchester United had held firm and convinced the Portuguese superstar to stick with them for one more year. When Madrid finally got their man, they had to pay a whopping £80 million for the privilege.\nBut while Kaka struggled to justify his costly transfer, Ronaldo had no such issue. He became the club’s all-time highest scorer over nine seasons at the Bernabeu, netting a staggering 450 goals in 438 games. In that time, he won two La Liga titles, four Champions Leagues and took his Ballon d’Or tally from one to five.\nGareth Bale to Real Madrid – £86 million – 2013\nFour years after signing Ronaldo, Madrid were at it again. A new world transfer record was set with their £86 million purchase of Gareth Bale from Tottenham in 2013.\nThe Welsh winger had won the PFA Players’ Player of the Year award for the second time after scoring 26 goals in 46 games in his final season with Spurs. Manchester United wanted to sign the former Southampton star, but it was Madrid who won the race for the then-24-year-old.\nBale remained a Madrid player for nine years, and while his time at the Bernabeu petered out somewhat amid injuries and a loan back to Tottenham, he delivered 106 goals in 258 games, three La Liga titles and five Champions Leagues.\nPaul Pogba to Manchester United – £89 million – 2016\nIt was a blockbuster summer at Old Trafford in 2016. Jose Mourinho was hired to replace Louis van Gaal as manager, Zlatan Ibrahimovic arrived on a free from Paris Saint-Germain and – as part of a £150 million spending spree – Paul Pogba returned to the club in a record £89 million deal.\nSpending big to try to bring the glory years back to the red side of Manchester after Sir Alex Ferguson’s 2013 retirement was not a new idea for the Red Devils. Two years earlier, they’d broken the British transfer record to sign Angel di Maria from Real Madrid for £59.7 million and in 2015 over £100 million was splashed on an array of incomings headlined by Memphis Depay and Anthony Martial.\nBreaking the world transfer record for a player who’d just won four successive Serie A titles with Juventus and was wanted by Madrid and Barcelona, however, felt like new ground for United.\nBut while Pogba occasionally dazzled with creative flair and spectacular goals, the uber-gifted French midfielder never consistently lived up to his billing with the 20-time champions. After six seasons back at Old Trafford, he left the club on a free for a second time, re-joining Juventus in 2022.\nNeymar to Paris Saint-Germain – £198 million – 2017\nIt’s hard to imagine a bigger financial flex than the one Paris Saint-Germain pulled off in the summer of 2017.\nNot only did the French side trigger the supposedly prohibitive £198 million release clause in Neymar’s Barcelona contract but they also agreed an initial loan deal for Monaco’s Kylian Mbappe that included an obligation to buy the teenage sensation outright a year later for £160 million.\nWithin a matter of weeks, PSG had tied up the two most expensive transfers in football history. And seven years on, neither deal has been surpassed.\nWhether either move was ultimately worth it is debatable. Neymar stayed in Paris for six seasons, scoring 118 goals and providing 77 assists in 173 games and winning five Ligue 1 titles. But he only once played more than 30 all-competitions games in a campaign and was never able to deliver the Champions League triumph the club continues to crave.\nAt least with Neymar PSG were able to recoup a significant transfer fee when he left, with Saudi side Al Hilal paying around £75 million for the then-31-year-old superstar in 2023. Mbappe stuck around at the Parc des Princes a year longer, picking up an extra league title.\nBut he left this summer to join Real Madrid as a free agent, meaning PSG lost arguably the best player in the world for nothing.\nREAD MORE: Kylian Mbappe tops list of most expensive signings that later left their clubs for free",
  "word_count": 2247,
  "scraped_at": "2026-02-14T02:08:01.872276",
  "_text_extracted": true
}