{
  "article_id": "ac86203ccbb7",
  "url": "https://metro.co.uk/2026/01/19/mikel-arteta-confirms-arsenal-trio-champions-league-clash-inter-milan-26392930/",
  "title": "Mikel Arteta confirms Arsenal trio are out of Champions League clash with Inter",
  "date": "20260119T204500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has confirmed that Piero Hincapie, Riccardo Calafiori and Max Dowman are all unavailable for Arsenal’s upcoming Champions League clash with Inter Milan.\nHincapie – who joined Arsenal on loan from Bayer Leverkusen last summer – has been absent for the club’s last three matches with a groin injury.\nFellow defender Calafiori has not featured since the Gunners’ 1-1 draw with Crystal Palace on December 23, forced to sit out seven games in all competitions due to a muscle problem.\nTeenage sensation Max Dowman, meanwhile, has been out of action since suffering ankle ligament damage in an Arsenal Under-21 friendly at the start of last month.\nWhile there are hopes Hincapie, Calafiori and Dowman could return to the fold before too long, the trio are yet to join up with first-team training again – and all three have been left out of the trip to Italy.\nHowever, facing the media this evening, Arteta revealed that Kai Havertz and Christhian Mosquera were both fully fit and available for Tuesday’s heavyweight group-stage contest at the San Siro.\nAsked whether he had any further fitness updates to provide, Arteta replied: ‘No, that’s all.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Arsenal boss reassured supporters that his side enter every match with the intention of ‘winning the game’, irrespective of how many injuries the squad are dealing with at any particular moment.\n‘It’s very particular for every game I’m afraid because every game has a different situation,’ he added.\n‘The players are in different stages as well and, yeah, we will prepare the game with the line-up and the finishers in the best possible manner to win the game.’\nInter brought Arsenal’s unbeaten run in Europe to an end when the two teams met in the League Stage last season, with Hakan Calhanoglu scoring what proved to be the winner from the penalty spot.\nBut the Serie A leaders have since changed their manager and Arteta has been impressed with what he has seen from Simone Inzaghi’s replacement Cristian Chivu.\n‘A very similar context to last year. Obviously, where the two teams are at the moment is a bit different,’ Arteta, whose side sit top of this year’s League Stage, explained.\n‘They have a new manager as well and I think he has given them some other things in their identity and the way they play.\n‘But obviously we know that they are a super competitive team, a team that is dominating their league, and it is going to be a really tough game.’\nAsked about the ‘importance’ of Tuesday’s clash as a means of building momentum, Arteta went on: ‘Every game in the Champions League, when you have the opportunity to achieve something, you have to grab it.\n‘Tomorrow, we’re really going to have to earn it against a top, top side. We know that.\n‘We prepare every game, obviously, to win it and it’s going to be the same again tomorrow.’\nMore Trending\nIt proved another tough day at the office for Viktor Gyokeres at the weekend as the Gunners were held to a goalless draw away to Nottingham Forest in the Premier League.\n‘I think it goes for all the number nines in the Premier League and how difficult it is to play in that position nowadays, with the physicality and the dominance of the centre-backs and the quality of them,’ Arteta said of Gyokeres’ struggles.\n‘Also, the lack of space as well in most of the times during the match for them to exploit.\n‘But that’s about consistency, it’s about going again. We know his work-rate, he’s really trying to give his best and we need to continue to work.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Manuel Akanji aims dig at Arsenal over ‘best team in Europe claim’ ahead of Inter clash\nMORE: Marc Guehi explains decision to snub Arsenal and Liverpool transfers to sign for Man City\nMORE: Arsenal eye move for Real Madrid defender after Gunners miss out on £56m Chelsea target",
  "word_count": 729,
  "scraped_at": "2026-02-14T02:12:22.660202",
  "_text_extracted": true
}