{
  "article_id": "acafdfcb0d78",
  "url": "https://www.bbc.com/sport/football/articles/cn8vz41ejp2o",
  "title": "Marcus Rashford : Striker feels it unlikely he will play for Manchester United again under Ruben Amorim",
  "date": "20250423T131500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rashford doubts he will play for Man Utd again under Amorim\n- Published\nMarcus Rashford feels it is unlikely he will play for Manchester United again under Ruben Amorim, but will not be rushed into making a decision about his future.\nRashford scored his fourth goal since joining Aston Villa on loan in February during their 2-1 loss at Manchester City on Tuesday.\nThe striker's loan deal at Villa Park expires at the end of the season.\nBut while his United contract is due to run until 2028, and it is not completely out of the question Rashford might return, sources close to the player do not see an obvious way back into the Old Trafford fold.\nRashford was exiled by Amorim from the first team in December, then, aside from the home defeat at Newcastle on 30 December when he was an unused substitute, did not pick him in his matchday squad again.\nIn the wake of the Villa move, Amorim said: \"I couldn't get Marcus to see the way you're supposed to play football and to train the way I see it.\"\nIt means United will have to decide whether to sell the 27-year-old or let him move away from the club on another loan deal this summer.\nAs United - and Amorim - are trying to juggle their finances in order to reshape a squad so it fits with the former Sporting boss' preferred style of play, having clarity over one of their most highly paid players would be beneficial.\nHowever, that is unlikely.\nRashford has ruled out the possibility of moving to London, and ideally would join a club that has qualified for the Champions League.\nSources close to the player are adamant Rashford is yet to have talks about his future and is not planning to do so until the middle of June.\nHowever, it is understood he has no interest in being part of a swap deal - after recent speculation around United's interest in Crystal Palace forward Eberechi Eze.\nRashford is a more attractive proposition for potential suitors than he was when he joined Villa on 2 February.\nWhile four goals in 17 games could not be regarded as prolific, his overall contribution - including six assists - to the Villa cause has been significant.\nIt earned Rashford a recall to the England fold and has kept fellow international Ollie Watkins frustrated on the Villa substitutes bench.\nSaturday's FA Cup semi-final meeting with Crystal Palace and a continuing battle for a Champions League place, after his excellent performance against Paris St-Germain last week, is a far more positive position than United's ongoing struggles.\nAs one of United's highest earners, the number of clubs who could meet Rashford's salary is not extensive.\nHowever, United did fund part of his wages to push the Villa move through and the feeling around the Rashford camp is there is likely to be significant interest in him in the summer, which is when he wants to assess his options.\nVilla boss Unai Emery has been cautious about discussing Rashford's future at the club.\n\"I am so happy with him,\" said Emery after Villa's defeat by City. \"He is performing very well. His adaptation has been quick and his commitment to the process is really important for us and for him.\n\"He needs to keep going and on Saturday, hopefully he can help again.\"\nRelated topics\n- Published26 July 2022",
  "word_count": 571,
  "scraped_at": "2026-02-14T01:52:20.892162",
  "_text_extracted": true
}