{
  "article_id": "acaf69f6d77b",
  "url": "http://thepeninsulaqatar.com/article/08/05/2025/dozens-arrested-three-hurt-by-car-in-paris-after-psg-win",
  "title": "Dozens arrested , three hurt by car in Paris after PSG win",
  "date": "20250508T101500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nParis Saint-Germain (PSG) supporters run after police used tear gas to disperse them after a group of supporters blocked the highway near the Parc des Princes Stadium in Paris on May 7, 2025. (Photo by Geoffroy Van Der Hasselt / AFP)\nParis: French police arrested 47 people in the capital and three others were injured by a car after football club Paris Saint-Germain defeated Arsenal to reach the Champions League final, authorities said Thursday.\nRaucous celebrations erupted in Paris after PSG beat their English rivals 2-1 Wednesday night to advance to the May 31 final and a shot at the club's first Champions League title.\nThree people were injured when a Mercedes crashed into a group of pedestrians near the capital's iconic Champs-Elysees avenue as PSG fans celebrated, police said, adding the \"circumstances... remain unclear at this stage\".\nOne of those injured, a minor, was in critical condition in hospital, prosecutors said.\nThey said they had opened an investigation for assault, fleeing the scene and failure to assist a person in danger.\nPolice said the driver tried to flee in the car, but was unable to get through the dense crowd of supporters.\nThe driver and a passenger then ran away on foot, \"abandoning their car to the fury of the crowd. It was burned and completely destroyed,\" police said.\nRowdy groups clashed with officers, pelting them with objects, police said.\nFour vehicles were reported damaged.\nAFP journalists saw two burned-out vehicles near the Champs-Elysees.\nParis had deployed more than 2,000 police and emergency workers for the match, which fell the day before a public holiday to mark the 80th anniversary of the defeat of Nazi Germany in World War II.\nThousands of fans without tickets massed outside the Parc des Princes stadium during the match.\nPolice intervened to restore the flow of traffic after rowdy celebrations erupted, but reported \"no major incidents\" outside the stadium.\nIn the nearby town of Fontainebleau, police said they had used tear gas to break up an unruly crowd of around 500 people.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 407,
  "scraped_at": "2026-02-14T02:11:36.685393",
  "_text_extracted": true
}