{
  "article_id": "acb8dcb42b50",
  "url": "https://www.teamtalk.com/news/eddie-howe-accelerate-plans-sign-gladbach-star-impact-liverpool-jude-bellingham-transfer-plan",
  "title": "Newcastle accelerate plans to sign Gladbach star to impact Liverpool plans for Jude Bellingham",
  "date": "20230226T123000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle accelerate bid to sign Gladbach star to impact Liverpool plans for Jude Bellingham\nNewcastle United are plotting a summer move for a Borussia Monchengladbach star which could have some implications on Liverpool’s pursuit of Jude Bellingham.\nThe Borussia Dortmund midfielder is one of the world’s most sought-after stars. After moving to BVB as a 17-year-old from Birmingham in 2020, he has taken his game to brilliant new heights in Germany. Now regarded as one of the world’s elite stars, Dortmund look ready to cash in on their prized asset this summer.\nThat chase is seemingly led by Liverpool, who are desperate to rebuild their midfield. On that front, Jamie Redknapp absolutely torched a Liverpool man, whose presence in midfield once again let Jurgen Klopp down at Crystal Palace on Saturday.\nHowever, any deal for Bellingham will not come cheap. The Bundesliga side are reportedly demanding a fee of around £132.9m (€150m), which would comfortably shatter a whole manner of transfer records.\nLiverpool, though, are far from alone in the chase for Bellingham. Indeed, Manchester United, Manchester City and Real Madrid will all be serious contenders for his signature.\nHowever, it is the Merseysiders who lead the pursuit. And according to German journalist, Christian Falk, even a lack of Champions League football will not hinder Liverpool’s hopes.\nWith Borussia Dortmund seemingly willing to cash in, the Bundesliga side are reportedly considering Bellingham’s replacement.\nAnd the Bundesliga side are famed for not just cashing in on their prized assets, but for also bringing in quality stars as replacements.\nA perfect example came last summer when Erling Haaland moved to Manchester City and they replaced him with Karim Adeyemi.\nNewcastle target move for Dortmund’s dream Bellingham replacement\nAs such, it comes as no surprise to learn Dortmund have four targets in mind to step into Bellingham’s shoes.\nAnd according to Sport1, that list is currently headed up by Kouadio Kone of Borussia Monchengladbach.\nThe 21-year-old moved to Gladbach in January 2021 in a switch from Toulouse. And while he was allowed to remain with the Ligue 1 side until the end of that season, he has since made a big impression during his 18 months in Germany.\nIndeed, he has just surpassed 50 appearances for Gladbach, scoring four goals in that time.\nA tigerish midfielder, Kone has also clocked up 18 yellow cards during his time in the Bundesliga.\nHowever, their efforts to bring him to the Westfalenstadion are seemingly coming under threat from Newcastle.\nEddie Howe’s side, according to multiple reports, have tracked Kone for some time. Indeed, they reportedly saw a firm offer to sign him in January batted away by the Bundesliga side.\nBut the Carabao Cup finalists will reportedly try again in the summer – and this time Gladbach are seemingly ready to cash in.\nAnd were Newcastle to win the race for his signature, it could put Bellingham’s move to Liverpool at some risk. That’s because BVB are keen to ensure Bellingham’s replacement has already been lined up, prior to sanctioning his sale.\nDortmund, could of course, turn to the other players reportedly on their shortlist of course. To that end, Real Madrid’s Eduardo Camavinga is another star they are reportedly considering too.\nHowever, Kone is their top target and they will be eager to secure his signing ahead of Newcastle.",
  "word_count": 554,
  "scraped_at": "2026-02-14T01:55:49.884451",
  "_text_extracted": true
}