{
  "article_id": "ace32be22ffa",
  "url": "https://www.teamtalk.com/leeds-united/whites-transfers-junior-firpo-homecoming-close-truth-ethan-ampadu-announcement-revealed",
  "title": "Leeds transfers : Junior Firpo homecoming  close  as truth on Ethan Ampadu announcement revealed",
  "date": "20250506T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United\nPremier League • England\nJunior Firpo’s Leeds exit ‘close’ as truth on Ethan Ampadu announcement revealed\nLeeds United are on the cusp of losing Junior Firpo to Real Betis – and sources have revealed just how close they were to extending his stay and why the left-back is ultimately likely to decide that the time for a change is now.\nThe Whites spent Bank Holiday Monday celebrating their Championship triumph, joined by approximately 350,000 jubilant fans who lined the streets. However, one announcement they may have preferred to avoid was about Junior Firpo.\nEthan Ampadu announced to the crowd that his teammate could be leaving the club this summer to join Real Betis, a move Firpo has been interested in for some time, and as exclusively first revealed by TEAMtalk in September.\nSources have confirmed that Betis have been in talks to secure Firpo’s signature, and the deal is close to completion.\nLeeds have tried to retain him, with sources stating they remain keen, and have done for some time now, to sign him to a new contract for their return to the Premier League. However, it is challenging to prevent him from moving to a club with which he has such an emotional connection.\nWhat’s more, Firpo is understood to have simply wanted to fulfil his four-year contract at Leeds since his arrival, something he has now done, while he feels leaving at this point – with promotion secured and his reputation at Leeds fully restored – means the timing is now right to move on.\nThe defender made 43 appearances for Betis between 2017 and 2019 before sealing a move to the Nou Camp, where he called the iconic Lionel Messi a teammate for two seasons before moving on to Leeds.\nFirpo came through the academy at Betis and has been open about his attachment to the club and his desire to return one day. Betis are aware of this and are eager to bring him in on a pre-contract deal to bolster their squad.\nDON’T MISS: Leeds United most expensive signings: Top 10 revealed before crucial summer spending\nFirpo deal not yet done as drunken Ethan Ampadu spills beans\nAs TEAMtalk have revealed, Firpo has previously indicated to Leeds that he is open to signing an extension to his current contract but wants to first understand the club’s intentions and ambitions before committing.\nNothing is entirely decided yet, but sources in Spain suggest that Betis hold a strong emotional pull for Firpo, making the move a more appealing prospect than playing in another relegation battle. Betis, for their part, could offer Champions League football next season.\nFirpo was annoyed by Ampadu’s comments – which did initially come about after the Leeds captain saw a Betis shirt in the crowd. Despite that, talks are ongoing with Betis, and anything that could jeopardise the deal would be viewed negatively by the full-back and his camp.\nMore pics from a brilliant parade #LUFC pic.twitter.com/badCDXAqQ7\n— James Marshment (@marshyleeds) May 5, 2025\nThe left-back appeared to tell Ampadu he “shouldn’t have said that” after the Welsh international shouted “Real Betis! Betis! Betis! Betis!” and pointed in his direction. Some other Leeds stars seemed to shake their heads, too.\nFurthermore, with the party going on late into the night, a video uploaded by Jayden Bogle also saw the full-back urge his teammate to hang around and sign an extension, to which Firpo stated: ‘Paraag (Marathe, Leeds chairman) send me the ting.’\nFirpo has thrived since recovering from an injury earlier this year and now boasts 11 assists across the calendar year for club and country. He remains a hugely-popular player for the Whites.\nLeeds round-up: First three exits named\nThere will inevitably be turnover now that Leeds are in the Premier League. Reports suggest that Patrick Bamford and Josuha Guilaovogui are likely to leave, while Illan Meslier is a doubt to pick the No.1 spot back up.\nTEAMtalk also understands that offers will be listened to for Joe Gelhardt and Sam Greenwood, while Sam Byram is likely to depart as a free agent.\nIn terms of incomings, the Whites could make Sean Longstaff one of their first signings, with Newcastle expected to sanction his exit for around £10million.\nTEAMtalk is also aware that Troy Parrott, Evan Ferguson and Cameron Archer are being tracked by Leeds.\nWhat’s more, a move for departing Leicester icon Jamie Vardy is a possibility for both them and Burnley.",
  "word_count": 743,
  "scraped_at": "2026-02-14T02:02:47.557511",
  "_text_extracted": true
}