{
  "article_id": "acf6058bd9a7",
  "url": "https://www.the42.ie/ireland-france-analysis-4-6162910-Sep2023/",
  "title": "Stephen Kenny Ireland tenure beginning to feel doomed",
  "date": "20230908T100000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NINE TIMES out of 10 in football, the team with the better collection of players wins and that is exactly what happened in Paris last night.\nThe statistics paint a damning portrait.\nFrance had 68% possession and 25 shots compared to Ireland’s six.\nThe match felt all over after Marcus Thuram’s 48th-minute goal and with the exception of a counter-attack that ended with Chiedozie Ogbene’s header forcing a good save from Mike Maignan, France coasted to victory in the second half once the two-goal margin had been established.\nThe Irish could barely get near France and were made to really feel the intense evening heat thanks to their opponents’ supreme efficiency with the ball. It all too often had the look of an FA Cup game where a Championship side just cannot get to grips with their Premier League opponents.\nWhereas Ireland could easily have nicked something from the reverse fixture in Dublin were it not for Maignan’s late heroics to keep out Nathan Collins’ bullet header, there was more of a resigned air to Thursday night’s proceedings.\nBoth RTÉ’s Player of the Match Ogbene and Stephen Kenny admitted afterwards that they were essentially outclassed by the team widely considered the best in Europe.\nOften, when a manager is under pressure to keep his job, there is a spikiness in his media dealings and a perceived sense of injustice with how the situation is panning out.\nYet rather than denial, there was acceptance in Kenny’s post-match comments.\n“They were too good for us and really are a fantastic team,” he told RTÉ.\nThe 51-year-old should not be judged too harshly for being unable to inspire his men to a major upset in the Parc des Princes. Pep Guardiola, Jurgen Klopp or any other manager in the world would surely have struggled to avoid a similar outcome were they coaching the Irish team on Thursday, such was the chasm in quality between the two sides.\nThe problem for Kenny is that these caveats won’t necessarily be considered too carefully when it comes time for the FAI board to decide his future.\nOf the 25 competitive matches he has presided over, the unflattering record reads: won five, drawn eight and lost 12.\nThe victories have come against Luxembourg, Azerbaijan, Scotland, Armenia and Gibraltar.\nLast night in isolation was not by any means egregious, but the cumulative effect of all-too-regular defeats are bound to impact the squad’s morale going forward.\nIt also leaves Ireland in an extremely difficult position going into Sunday’s clash at the Aviva.\nWhereas their confidence will inevitably be low, the Dutch will be on a high following Thursday’s comprehensive 3-0 win over Greece, a team Ireland struggled badly against.\nMoreover, like France, the Netherlands have many world-class players with an abundance of Champions League experience behind them.\nAnd even if Ireland do pull off a shock win, it won’t necessarily leave them in a particularly healthy position.\nWith four games remaining in the group, 15 is the maximum number of points Kenny’s side can achieve.\nThe Dutch currently sit on six points with five games to play and a perfect record would see them finish on 21.\nFrance, meanwhile, are now on 15 points and so are guaranteed to finish above Ireland — even if Les Bleus lose all their remaining matches and the Boys in Green win their last four fixtures, the World Cup runners-up will end the table in a better position due to their superior head-to-head record.\nSo second spot is now the best Ireland can hope for, and even that seems fanciful as it stands.\nA defeat by the Dutch on Sunday will all but end their hopes of qualifying, while even a draw would leave them hanging by a thread.\nVictory, meanwhile, would still mean plenty of work to do — Ireland also almost certainly would need at least a draw when the sides meet again in Amsterdam on 18 November, as well as obviously picking up six points against Gibraltar and Greece, which is far from a given.\nConsequently, fans might already have to start hoping Ireland become eligible to compete in the Nations League playoffs and qualify via the backdoor route, which depends on an array of complex factors outlined in detail here.\nWere that scenario to play out, it would require the element of luck that has consistently deserted Kenny during his Ireland tenure thus far.\nLosing arguably his best and most important player, Evan Ferguson, for this pivotal international window is just the latest example of the recurring ill fortune that has beset the ex-Dundalk boss.\nRecall the early days of his reign when the squad was regularly decimated by Covid and injuries, in addition to the two late Cristiano Ronaldo goals that denied Ireland a famous win away to Portugal as well as the nightmare draw he was handed in this campaign.\nIf it doesn’t work out ultimately, perhaps Kenny may rue the Nations League games, which could have ensured a higher seeding and a favourable draw for Ireland, more than anything else.\nThe Dubliner’s reign has been characterised by hard-luck stories and despite all the positive aspects of his time in charge — the encouraging home attendances, handing debuts to 19 mostly young players and overseeing a much-needed squad overhaul, encouraging a more progressive playing style than previous managers and his general decency as an individual that has made fans route for him arguably more than any previous incumbent — the succession of unfortunate results are increasingly difficult to ignore.\nNo Ireland manager has ever survived three successive qualification failures and an FAI board who were fairly ruthless in choosing not to extend Vera Pauw’s contract recently are unlikely to be more charitable when it comes to their verdict on Kenny.\nWhether they will even have the patience to let him see out the campaign and potentially qualify through the backdoor should Ireland taste defeat on Sunday is far from certain — an Irish Times report in June suggested Kenny needs at least two points from this window to save his job.\nA win over a Dutch side that includes players of the calibre of Virgil van Dijk, Nathan Ake, Frenkie de Jong and Cody Gakpo is the only possible riposte to the storm clouds that are brewing, but on the evidence of everything that has transpired in the campaign so far, such a scenario feels like wishful thinking from an Irish perspective.",
  "word_count": 1075,
  "scraped_at": "2026-02-14T01:48:28.235819",
  "_text_extracted": true
}