{
  "article_id": "ad4445475d8b",
  "url": "https://www.meathchronicle.ie/2024/07/09/good-is-not-good-enough-erik-ten-hag-wants-man-utd-to-raise-their-standards/",
  "title": "Good is not good enough – Erik ten Hag wants Man Utd to raise their standards",
  "date": "20240709T194500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good is not good enough – Erik ten Hag wants Man Utd to raise their standards\nBy Damian Spellman, PA\nManchester United boss Erik ten Hag has told his players “good is not good enough” as he attempts to return the club to domestic and European prominence.\nThe Dutchman signed a two-year contract extension after guiding the club to FA Cup final glory against Manchester City at the end of last season, the second trophy of his reign.\nAs he gets back to work under new co-owner Sir Jim Ratcliffe with sporting director Dan Ashworth now on board, Ten Hag has set his sights on the Premier League title and Champions League success.\nAsked if there was anything different he wanted to do in an interview with MUTV, he said: “A lot because we won an FA Cup, we won a Carabao Cup, but also we have high expectations from ourselves.\n“We know it doesn’t come overnight; we have to work for it. We are highly ambitious, so we have to raise our standards day by day, and improve every day.\n“Every time, we have to live with the line in our head – good is not good enough. We have to do better.”\nUnited had gone six years without a major trophy before they beat Newcastle to lift the Carabao Cup in February last year, but even May’s 2-1 victory over neighbours City at Wembley, which he said showed the club can “compete with the best”, has not quenched Ten Hag’s thirst for tangible success.\nThe club won the last of their 13 Premier League titles – they have been English champions 20 times in total – 11 years ago, while they last reached the pinnacle of European football in 2008.\nTen Hag said: “United didn’t win, for over six years, a trophy. Now we’ve won two, but we are up for more and for higher titles, like the English title and even more, like going into Europe.\n“That’s a process that takes time, and we’ll work on it. But I know with the set-up at the club, with the changes to the structure, and the changes to infrastructure here around Carrington, we will be ready for the future. We will improve.\n“You feel it here, it gives a new energy, it gives a new dynamic and that will help us to achieve our targets. In the short-term, it stays the same: we want to win every game, and we have seen we are capable of beating everyone.”\nThe changes in infrastructure involve an ongoing £50million redevelopment of the club’s Carrington headquarters, to which the first players returned on Monday to be greeted by a challenge from Ten Hag.\nHe said: “In every season after a break, you will have surprises. We’re looking forward, we’re so curious: who is it this season, the surprise who can contribute to our team?\n“Like last year, Kobbie Mainoo, Alejandro Garnacho coming up and playing a big role. They are the two goalscorers in the final. Today, we started, but which player is there who can do the same?”\nIn the meantime, Mainoo and club-mate Luke Shaw will head into Euro 2024 semi-final battle with Ten Hag’s native country in Dortmund on Wednesday evening.\nAsked if he had spoken to the pair, he said: “Yeah, sure. Of course, it’s a fantastic game coming. Both sides are playing in the semi-finals, at the highest level. I think everyone is really excited.\n“Football is so important in culture in England, as it is in Holland. It will be a great match – let the best win!”",
  "word_count": 601,
  "scraped_at": "2026-02-14T02:08:01.882310",
  "_text_extracted": true
}