{
  "article_id": "ad4addaf7a2a",
  "url": "https://dailynews.co.tz/dust-dreams-and-drama-east-africas-chan-2024-tourney-to-kick-off-with-fire/",
  "title": "Dust , dreams and drama : East Africa CHAN 2024 tourney to kick off with fire ? – Daily News",
  "date": "20250727T111500Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dust, dreams and drama: East Africa’s CHAN 2024 tourney to kick off with fire?\nTANZANIA: East Africa is about to catch a football fever so contagious, even the cows in Arusha are mooing in formation.\nFrom the sun-kissed shores of Dar es Salaam to the hilltop buzz of Kampala and the matatu-blaring rhythm of Nairobi, a rare spell is sweeping through the region.\nThis isn’t your usual football hype. No, sir. This is the TotalEnergies African Nations Championship (CHAN) 2024.\nIt will be rolling into town like a visiting in-law who insists on staying for a whole month, except this one is actually welcome.\nFor once, the spotlight isn’t on Europe’s usual suspects flying in business class with designer headphones and TikTok endorsements.\nCHAN is proudly different. It’s raw, it’s homegrown, and it’s gloriously chaotic in the best possible way.\nThink of it as Africa’s grassroots answer to the Champions League, but with more dust, drama, and vuvuzelas.\nThis is a tournament where legends are made from Sunday league obscurity and where every match feels like your cousin’s wedding—high stakes, slightly disorganized and everybody’s uncle has a strong opinion.\nAnd for the first time in history, CHAN is being co-hosted by three neighbours who normally compete for everything from Nile water rights to the best chapati recipe.\nKenya, Tanzania, and Uganda are holding hands and opening their stadiums to the continent in a kind of sporting polyamory that’s so rare it might just cause a CAF administrator to break into spontaneous prayer.\nThese three musketeers, who were already picked to cohost AFCON 2027, have been handed CHAN 2024 as the warm-up act.\nThe action kicks off on August 2nd and will stretch all the way to the 30th, giving us nearly a month of football.\nThat is, flag-waving, overanalysis, heartbreak and sudden bursts of national unity that often disappear once penalties are missed.\nUnlike AFCON, CHAN has one beautifully stubborn rule: only players who play in their domestic leagues can participate.\nThat’s right. No Salahs, no Osimhens, no Achrafs.\nJust the best from your local league, some of whom still live with their mothers and miss training because they’re stuck in traffic caused by a boda boda protest.\nBut don’t let that fool you. This is where the future lives. This is where tomorrow’s African stars come wrapped in yesterday’s jerseys, hungry to prove that talent doesn’t need a European passport to shine.\nCAF, ever the master of timing and political chess, awarded the tournament to East Africa in December 2023.\nPlus, a clear message: “If you want to host the continental party in 2027, let’s see if you can set the table properly first.”\nAnd so, the three hosts rolled up their sleeves, checked their stadium lights and started praying their national teams wouldn’t embarrass them in their own backyard, because nothing stings like hosting a party and getting kicked out of your own living room.\nThe lineup this year reads like a spicy African menu.\nThere’s defending champions Senegal, who walk into any tournament like they’ve already won it.\nMorocco, who haven’t seen a trophy they didn’t want to adopt.\nDR Congo, the two-time champs who bring flair, unpredictability, and at least one player who will try a bicycle kick from the halfway line.\nNigeria, who always look fantastic until the semi-finals when someone forgets to score.\nZambia, the continent’s favourite wildcard – brilliant one day, baffling the next.\nAnd let’s not forget the hosts, Kenya, Tanzania, and Uganda who have all actually qualified to play, not just set up tents and hand out water bottles.\nEven Central African Republic are making their debut. Welcome to the party.\nLibya, bless them, bowed out after a scheduling mess that probably involved someone forgetting they had a wedding that month. It happens. But their exit didn’t dent the flavour.\nThe tournament still boasts a juicy 19-team lineup, and the groups? Oh, the groups are so spicy they could be bottled and sold as pilipili sauce.\nMatches will be held across five stadiums that are either state-of-the-art or currently praying to survive the crowd surge.\nBenjamin Mkapa Stadium in Dar, with its 60,000-capacity and tendency to vibrate like a drum during big matches, will lead the Tanzanian charge.\nNairobi will split duties between the Moi International Sports Centre and Nyayo Stadium, depending on who forgot to pay the lighting bill.\nKampala’s Mandela National Stadium will offer its political gravitas, where even the referees might get summoned to Parliament if they get a call wrong.\nZanzibar’s Amaan Stadium is the wildcard, a 15,000-seater that combines coastal charm with fans who scream like they’re auditioning for a Nollywood horror film.\nBut beyond the venues, beyond the kits, beyond the sudden appearance of new patriotic songs with questionable lyrics, CHAN represents something deeper.\nIt’s a football mirror, held up to East Africa’s ambitions. It’s a dry run for the big show in 2027, yes, but it’s also a love letter to African football’s working class.\nIt’s for the guy who tapes his shin guards with newspaper.\nFor the player who can’t afford a sports drink but plays like he’s on Red Bull. For the coach who draws tactics on the back of a maize sack.\nMost importantly, CHAN 2024 isn’t just about who wins the trophy.\nIt’s about who breaks through. Who earns a call-up. Who gets spotted by a scout wearing sunglasses and chewing gum like a villain in a Nigerian movie.\nFor every star that emerges from this tournament, there’s a village somewhere that will erupt into a week-long celebration, complete with chicken sacrifices and three-hour WhatsApp voice notes.\nIt’s also about fans – the unshakable believers, the armchair analysts, the drunk uncles who suddenly remember they played for Yanga in 1983 but “injured their knee.”\nIt’s about the boda boda rider who turns his bike into a national team shrine.\nThe market mama who insists on listening to match commentary even if she doesn’t understand offside.\nIt’s about everyone who believes, against all odds, that this could finally be their country’s year.\nAlready, the buildup has included its share of plot twists.\nUp in Karatu, a sleepy town near Arusha that is better known for giraffes than group stages, a CHAN warm-up mini tournament was being held at the Black Rhino Academy playground.\nWhat began as a friendly tune-up between the three hosts soon morphed into an episode of Footballers of Our Lives.\nCongo Brazzaville pulled out due to logistics. Senegal stepped in like the cool cousin who brings actual drinks to the barbecue.\nKenya pulled out mysteriously in the final hour, no press release, no explanation, just vibes.\nStill, Tanzania and Uganda soldiered on. Taifa Stars coach Hemed Suleiman Ali, fresh from a training camp in Egypt, said the warm-up helped test his lads.\nUganda’s Geoffrey Massa echoed him, saying it’s all part of the mission to fine-tune before the big kickoff.\nCECAFA’s Yusuf Mossi kept the ship afloat, calmly adding that Senegal’s arrival spiced things up. Spice, indeed. So, here we are. CHAN 2024.\nA tournament that may not have the AFCON glitter or the World Cup fanfare, but which carries something far more powerful: soul.\nThis is football before the agents, before the endorsements, before the Instagram deals.\nThis is football in its purest, dustiest, most beautiful form.\nAnd East Africa, for once, is not just watching. It’s hosting. It’s playing. It’s believing.\nIn the coming week, there will be glorious goals, catastrophic errors, memes born in real time, and at least one coach who blames the pitch for everything, from his defence to his marriage.\nThere will be sudden heroes, unexpected villains, dubious red cards and a goalkeeper who tries to dribble past a striker and pays dearly.\nALSO READ: CAF thumbs up CHAN preps\nBut above all, there will be stories. The kind that become folklore. The kind that makes kids start kicking plastic bottles in alleyways with new dreams in their eyes.\nSo, when that final whistle blows on August 30th, and the trophy is lifted somewhere between Kampala and Zanzibar, CHAN 2024 will leave behind more than just results.\nIt will leave behind belief.\nThat East Africa, this noisy, chaotic, passionately dysfunctional region, can rise not just as hosts, but as contenders.\nThat football here is more than a game. It’s a language. A religion. A revolution waiting to be televised.\nAnd whether the world is watching or not, we’ll be here. With radios blaring, jerseys soaked in sweat, and hearts wide open.\nBecause this is CHAN. This is us. And we’re just getting started.",
  "word_count": 1431,
  "scraped_at": "2026-02-14T02:09:18.635351",
  "_text_extracted": true
}