{
  "article_id": "ad6a9c0af801",
  "url": "https://www.thisdaylive.com/2025/10/19/rivers-utd-slip-in-maputo-remo-lay-ambush-for-mamelodi-in-abeokuta/",
  "title": "Rivers Utd Slip in Maputo , Remo Lay Ambush for Mamelodi in Abeokuta – THISDAYLIVE",
  "date": "20251019T033000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nRivers Utd Slip in Maputo, Remo Lay Ambush for Mamelodi in Abeokuta\nDespite losing 1-0 to Mozambican champions Black Bulls in Maputo on Saturday evening, one of Nigeria’s entrants in the CAF Champions League, Rivers United stand the chance of upturning the defeat in the second leg, second round reverse fixture in Uyo.\nBlack Bulls had their breakthrough five minutes after the first half break when Moctar Diallo pounced to slot home for the hosts, after breaching Rivers United’s defence line.\nDespite late pressure from the Nigerian side, Black Bulls held firm to protect their narrow advantage, giving themselves a crucial edge ahead of the return leg.\nRivers United will now need to overturn the deficit when the teams meet again in Uyo where a win by at least two clear goals will be required to advance to the group stage of Africa’s premier club competition.\nToday in Abeokuta, Nigeria’s other entrants, Remo Stars will be hoping to benefit from the significant injury concerns ravaging South African giants, Mamelodi Sundowns in the first leg of their CAF Champions League second-round fixture.\nThey will be without one of their most versatile players, Thapelo Morena, who suffered an injury in the 35th minute of Bafana Bafana’s crucial 3-0 FIFA World Cup qualifying victory over Rwanda earlier in the week.\nMorena, known for his pace and flexibility as both winger and fullback, limped off and was later confirmed to be unavailable for the weekend’s continental assignment.\nAdding to the team’s worries is striker Iqraam Rayners, who has reportedly been withdrawn from the squad for medical reasons. Rayners, one of the club’s dependable attacking options, was expected to provide additional firepower in the forward line, but his absence leaves a void that coach Rulani Mokwena must quickly address.\nThere are also concerns about residual fatigue among several first-team players who featured heavily during the just-concluded international window. With South Africa’s World Cup qualification now secured, many Sundowns players have had little rest before returning to the rigours of continental club football.\nAnother long-term absentee is Themba Zwane, the influential playmaker whose creativity and experience have been sorely missed.",
  "word_count": 356,
  "scraped_at": "2026-02-14T02:12:04.351595",
  "_text_extracted": true
}