{
  "article_id": "ad6d67ae44b7",
  "url": "https://talksport.com/football/1290446/scott-parker-club-brugge-next-manager/",
  "title": "Scott Parker goes from being sacked by Bournemouth to Champions League manager following appointment as new Club Brugge boss in Belgium",
  "date": "20230101T093000Z",
  "domain": "talksport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Scott Parker goes from being sacked by Bournemouth to Champions League manager following appointment as new Club Brugge boss in Belgium\nScott Parker has returned to management after being axed by Bournemouth to take control of Champions League side Club Brugge.\nThe 42-year-old had been without a job since being relieved of his duties by the Cherries at the end of August.\nA 9-0 defeat against Liverpool proved to be the end for Parker after Bournemouth lost three out of their opening four Premier League matches.\nBut it was his outspoken attitude about transfers and a perceived lack of respect that cost him his job.\nAnd though he has a new job, given the Cherries are under new ownership, you have to wonder if he regrets his outbursts.\nAnd for the first time in his career as a player or manager, Parker has decided to test himself abroad after taking the reins at Belgian side Brugge.\nBrugge parted ways with previous head coach Carl Hoefkens earlier in the week with the club sitting fourth in the Belgian Pro League table.\nHoefkens had only taken charge in the summer, but has lasted just six months - despite guiding Brugge into the knockout stages of the European Cup for the first time in their history.\nThe Bruges outfit, who have won the top flight title for the last three seasons, announced Parker as their next boss on Saturday afternoon.\nA statement revealed that the ex-Tottenham and Chelsea midfielder will officially be presented next week.\nIt read: \"Scott Parker succeeds Carl Hoefkens as head coach of Club Brugge.\n\"In February 2018, Parker became head coach at Craven Cottage.\n\"In 2020 he secured promotion to the Premier League with the Londoners. After his spell at Fulham, Parker joined Bournemouth.\n\"Parker was also able to force promotion to the Premier League with The Cherries.\n\"Scott Parker will be presented next week at the Belfius Basecamp.\"\nBrugge's next match is a clash away at league leaders Genk next Sunday, who are 12 points ahead in the table.\nGenk have lost just two out of their opening 18 matches, and boast the best defensive record in Belgium.\nParker will certainly be relishing the challenge of his first Champions League game, with Brugge to face Benfica in the Round of 16 on February 15.\ntalkSPORT BET OFFER OF THE DAY\nGet up to £25 in free bets + 25 free spins* - CLAIM HERE\n18+ New customers only. Opt in, bet up to £25 (min. £10) on selected events at odds of 2.00+, in 7 days. Get up to £25 in free bets on selected events + 25 Free Spins on D10S Maradona slot. Bonuses expire in 7 days. Card payments only. T&Cs apply, see below. begambleaware.org | Please gamble responsibly",
  "word_count": 463,
  "scraped_at": "2026-02-14T02:16:35.986758",
  "_text_extracted": true
}