{
  "article_id": "ad766e7aceaa",
  "url": "https://www.france24.com/en/live-news/20230420-milan-and-inter-preparing-for-fireworks-with-champions-league-derby",
  "title": "Milan and Inter preparing for fireworks with Champions League derby",
  "date": "20230420T113000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Milan and Inter preparing for fireworks with Champions League derby\nMilan (AFP) – The Milan derby will return to the centre stage of European football when the Italian city's two giant clubs meet in what promises to be a fiery Champions League semi-final.\nIssued on:\nThe prospect of two matches full of colour and pageantry between local rivals who between them have been crowned kings of Europe 10 times will dominate discussion in Milan, and remind fans when Italian football had a legitimate claim to call itself the world's best.\nBefore the draw for the 2005 Champions quarter-finals former AC Milan managing director Adriano Galliani was desperate to not be drawn with another Italian team.\nGalliani, who was Silvio Berlusconi's right-hand man during Milan's golden years, had already been through one derby in Europe's top club competition two years previously when a star-studded outfit squeezed past Inter in the last four on away goals.\nBut even though Milan then went on to beat Juventus and lift the trophy for the sixth time in 2003, Galliani had no desire to repeat that experience.\n\"Above all I don't want Inter because for those of us who live in Milan it would be hell,\" he said.\n\"I can remember the weeks leading up to those two derbies in 2003 and they were the worst of all for the level of pre-match tension.\"\nIn the end Galliani's wish was not granted and that year's last eight was the scene of possibly the most notorious derby of all, one which took on a hellish landscape in the second leg after Milan won the first 2-0.\nAndriy Shevchenko effectively closed the tie in the 30th minute, but an Esteban Cambiasso goal being disallowed late on sparked fury among Inter fans, who launched a barrage of flares onto the pitch with one striking Milan goalkeeper Dida.\nThe players were ordered back into the dressing rooms and what became known as the \"Derby of Shame\" ended up being awarded 3-0 to Milan, who went through to the semis 5-0 on aggregate before eventually being beaten by Liverpool in one of the most thrilling Champions League finals of all time.\nA new era\nA footballing epoch has passed since those days, with both Milan clubs spending years in the doldrums at home and abroad until they won the two most recent Serie A titles between them.\nLast season Milan dethroned Inter in an enthralling title race which went down to the final day, and while both teams are miles off this year's runaway league leaders Napoli, the derby semi-final has two of Europe's grand old clubs back at the continent's top table.\n\"For us, this derby is a chance of revenge, a revenge of history and revenge also for last year,\" said Inter chairman Steven Zhang after Wednesday's straightforward passage past Benfica.\n\"It means a lot because when we started our players didn't have experience in the Champions League and had never won any trophies.\n\"But now we are full of winners and full of players and staff who are aiming to go all the way, it means tons for all of us.\"\nInter have had the better of the three derbies played so far this season, losing a thriller 3-2 in September but hammering Milan 3-0 in January's Super Cup in Saudi Arabia and then beating them 1-0 in the league the following month.\nAnd while this year's league campaign has been a huge disappointment, with 11 defeats in 30 matches, Simone Inzaghi's side have shown time and again that they can turn it on for the pressure games.\nMeanwhile after a dismal post-World Cup slump Milan are looking more like the swashbuckling team which won the Scudetto last May and will be buoyed by getting past Italy's champions-elect Napoli.\n\"We've seen in these last two years, we've played lots of matches with Milan and they are a very good team,\" said Inzaghi.\n\"It all depends on what form each team is in coming into the match.\"\n© 2023 AFP",
  "word_count": 672,
  "scraped_at": "2026-02-14T02:06:55.006119",
  "_text_extracted": true
}