{
  "article_id": "ada5b0088299",
  "url": "https://www.france24.com/en/live-news/20240426-victor-boniface-leverkusen-boss-alonso-makes-you-up-your-game",
  "title": "Victor Boniface : Leverkusen boss Alonso makes you  up your game  ",
  "date": "20240426T074500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Victor Boniface: Leverkusen boss Alonso makes you 'up your game'\nLeverkusen (Germany) (AFP) – Bayer Leverkusen and Nigeria striker Victor Boniface said Xabi Alonso has a particular advantage over other coaches on the training pitch.\nIssued on:\n\"Imagine you're training and your coach is doing better than you,\" Boniface told AFP in an interview.\n\"Then you want to step up your game.\n\"For him to be involved in training gives us a boost,\" Boniface said of Alonso, who \"has won everything that can be won in football\".\n\"Sometimes he tells me of players he played with, with similar abilities to me. He tries to improve me in my weakest areas.\"\nLeverkusen host third-placed Stuttgart on Saturday knowing they are four games away from becoming the first team to go through a Bundesliga season unbeaten.\nTheir runs to the German Cup final, where they face second-division Kaiserslautern, and Europa League semi-finals, where they take on Roma, mean they have gone a record 45 games unbeaten in all competitions this season.\n'I love penalties'\nBoniface, 23, was born in the southern Nigerian city of Akure and told AFP he was \"always\" a football fan.\nEarlier this month, he coolly dispatched a penalty to open the scoring in the 5-0 home rout of Werder Bremen which made Leverkusen Bundesliga champions for the first time.\nLeverkusen had never previously won a league title in their 120-year history.\nThe club's record of second-placed finishes -- often somehow snatching defeat from the jaws of victory -- saw them tainted with the unwanted 'Neverkusen' moniker, but Boniface said he was not nervous when he took the spot-kick.\n\"No. To be honest, I didn't feel pressure. We're football players.\n\"Moments like this -- I took the responsibility to help the team. That's why I'm here. I love penalties.\"\nThe pressure of a spot-kick pales in comparison with some of the struggles Boniface has already endured in his young career.\nHe moved from Nigeria to Norway at 18, signing with Bodo/Glimt.\nDespite playing a part in the club's first-ever Norwegian title in 2020, he tore his ACL twice and later said he considered quitting the game.\nAfter a successful stint with Union Saint-Gilloise in Belgium, he moved to Leverkusen last July, receiving his first Super Eagles call-up earlier this season, which he called \"a dream come true\".\nHe scored 16 goals in his first 23 games but was then injured again while preparing for the Africa Cup of Nations with Nigeria, missing four months including his country's run to the final, where they lost to hosts Ivory Coast.\n\"It was really difficult when I got injured. When I got injured, in my head I said 'OK, I'm missing AFCON, I'm going to miss a lot of games for Leverkusen.'\n\"During that time it was difficult for me, but I have my teammates and a club which takes care of me.\n\"It's difficult but at the same time it's just football. There are good moments and bad -- it's just how you take it.\"\n'With this team we can do something'\nMany have tipped Boniface for the top and he does already have one essential ingredient: a signature celebration.\n\"To be honest, it doesn't mean anything,\" Boniface said of his swaggering, finger-pointing celebration.\nAfter scoring an equaliser in Belgium, he was being chased by a teammate and the striker \"was just trying to do something really funny\".\n\"I saw the clip and thought -- this is nice. It's a funny celebration.\"\nBoniface was seen partying alongside his teammates well into the night after wrapping up the title, but also took the time to tell thousands of fans gathered on the stadium grass the season was not over.\n\"Sometimes it's difficult to switch out of party mood,\" Boniface said, admitting \"the guys who were drinking, I think some of them had a little bit of a tough day the next day at training.\"\nBoniface said confidently \"with this team, we can do something\", but refused to look past the next challenge.\n\"Right now, I don't think anyone is talking about Roma in the dressing room. We are focus on the game on Saturday.\n\"After the Stuttgart game, we can focus on Roma.\"\nBoniface, who admits to being a childhood Arsenal fan, said he was not thinking longer term either.\n\"Right now my full focus is on Leverkusen and being ready to try and achieve more good things with the club.\"\nHe does however look forward to playing in the Champions League with Leverkusen, saying \"it will be one of the proudest moments for me.\"\n© 2024 AFP",
  "word_count": 766,
  "scraped_at": "2026-02-14T02:07:51.318847",
  "_text_extracted": true
}