{
  "article_id": "ade4d2d09ceb",
  "url": "https://thepeoplesperson.com/2023/12/26/manchester-united-interested-in-transfer-for-e40m-rated-psv-eindhovens-johan-bakayoko-273461/",
  "title": "Manchester United interested in transfer for €40m - rated PSV Eindhoven Johan Bakayoko - Man United News And Transfer News",
  "date": "20231226T141500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are one of the parties keen on completing a transfer swoop for PSV Eindhoven star Johan Bakayoko.\nIt’s understood that Erik ten Hag is keen on acquiring attacking reinforcements.\nTo say the United forwards have struggled to put the ball into the back of the net this season would be a massive understatement.\nUnited have scored the second least goals in the Premier League – only 18.\nThe Red Devils have failed to score in their last four matches. The last time this happened was in the autumn of 1930.\nIn particular, the right-wing position has been a major area of weakness all term. Antony has yet to register a goal or an assist this campaign.\nWith each passing game, the Brazilian appears to be a big-money flop United could find themselves stuck with.\nCompound this with the fact that Jadon Sancho has missed months of football due to suspension and it’s clear Ten Hag has a problem on his hands.\nMarcus Rashford has previously been tasked with playing in that position but just like Antony, struggled to have an impact.\nTen Hag’s last remaining hope may likely be Amad Diallo who recently made his return to team training after picking up an injury during pre-season.\nAccording to SPORT1 journalist Christopher Michel, the 20-time English champions are interested in Johan Bakayoko.\n“Manchester United have their eye on Johan Bakayoko. The 20-year-old has impressed on the right wing in Eindhoven and has strong stats with four goals and 13 assists in 27 competitive matches.”\n“His market value is estimated at 40 million euros.”\nNews #Bakayoko: Manchester United have their eye on Johan Bakayoko. The 20-year-old has impressed on the right wing in Eindhoven and has strong stats with four goals and 13 assists in 27 competitive matches. His market value is estimated at 40 million euros. #MUN @SPORT1\n— Christopher Michel (@CMoffiziell) December 26, 2023\nDuring Arsenal’s clash vs. PSV Eindhoven in the Champions League, Bakayoko did well and was a constant headache for the Gunners’defence.\nThe 20-year-old’s strengths lie in his incredible dribbling ability and knack for fashioning chances for others on the pitch.\nHe boasts of an amazing pace and a wonderful left foot. Bakayoko is also very technically gifted and can hold up the ball well if required.",
  "word_count": 382,
  "scraped_at": "2026-02-14T01:56:38.138076",
  "_text_extracted": true
}