{
  "article_id": "adf07e1d1dd8",
  "url": "https://ianslive.in/dortmund-sign-carney-chukwuemeka-from-chelsea-on-permanent-transfer--20250826183650",
  "title": "Dortmund sign Carney Chukwuemeka from Chelsea on permanent transfer",
  "date": "20250826T134500Z",
  "domain": "ianslive.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dortmund, Aug 26 (IANS) Borussia Dortmund have announced the signing of forward Carney Chukwuemeka from Chelsea.\nThe 21-year-old midfielder, who spent the second half of the 2024/25 campaign on loan with BVB, has put pen to paper on a five-year deal at Signal Iduna Park.\n\"It feels really good to now be an integral part of BVB. I've gotten to know this club, the coach, my teammates, and the fans over the past few months, and I'm just happy that Borussia Dortmund is now my new footballing home. I will give everything I can to ensure that we achieve our goals as a team,\" Chukwuemeka said in a statement.\nSigned from Aston Villa in August 2022, Chukwuemeka made 32 first-team appearances and scored two goals for Chelsea.\nThe 21-year-old featured five times for Chelsea last term, with his most recent outing coming in their UEFA Conference League win over Astana.\nThe England Under-21 international spent the second half of the 2024/25 campaign on loan at Dortmund, where he made 17 appearances, including four at the Club World Cup, where Chelsea were victorious.\nIt has certainly been a busy day at Dortmund after having already announced the extension of head coach Niko Kovac contract until June 30, 2027.\nThe 53-year-old and his coaching staff took over in January this year when BVB were 11th in the Bundesliga on an 18-month deal.\nKovac, who won the DFB-Pokal, Bundesliga and Club World Cup as a player and has domestic and international experience as a head coach, produced a hugely impressive conclusion to the campaign to secure another season of UEFA Champions League football for the Dortmund.\nFor Chelsea, Chukwuemeka is just one of many players they would like to offload before Monday's transfer deadline, including forwards Nicolas Jackson, Christopher Nkunku and Tyrique George, winger Raheem Sterling and defender Ben Chilwell.\n--IANS\naaa/ab",
  "word_count": 309,
  "scraped_at": "2026-02-14T01:58:57.510720",
  "_text_extracted": true
}