{
  "article_id": "ae0bd56fd719",
  "url": "https://timesofindia.indiatimes.com/city/kolkata/east-bengal-fcs-brave-fight-in-afc-champions-league-2-preliminary-qualifier/articleshow/112536516.cms",
  "title": "East Bengal FC : East Bengal FC Brave Fight in AFC Champions League - 2 Preliminary Qualifier |",
  "date": "20240815T001500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- News\n- City News\n- kolkata News\n- East Bengal go down fighting\nTrending\nEast Bengal sparkled, took the lead, had a goal disallowed and fought tooth and nail before going down 2-3 to Turkmenistan’s Altyn Asyr FC in the AFC Champions League-2’s one-off preliminary qualifier.\nThe city side is now slated to play in the Challengers Cup, the third tier of the AFC tournaments.\nWhen David Lalhlansanga gave the home team a seventh-minute lead, the stage looked set for East Bengal to script another odds-defying tale. But the visitors from Turkmenistan showed why they are a regular in Asian football, Myrat Annayev (18) and Nurmyradov Selim (27) scoring in quick succession to go into the break with a 2-1 lead.\nThey swelled the lead further soon after the break, Annayev laying it for Mihail Titov to tap in and make it 3-1 in the 52nd minute.\nGame over? No way. Saul Crespo produced a moment of magic, dodging past three rivals before beating the rival goalkeeper with a sumptuous finish to reduce the margin to 2-3.\nThe arrival of Dimitrios Diamantakos and Cleiton Silva injected more firepower in East Bengal’s ambitions and when Cleiton pushed the ball in after Altyn goalkeeper Batyr Babayev failed to control the ball properly, Australian referee Alexander King found East Bengal’s Brazilian forward to have made a foul on the custodian.\nEast Bengal kept fighting on but the Turkmenistan side’s ability of taking advantage of the home team’s yet-to-be-organised backline early on made the difference.\nWe also published the following articles recently\n'Underdogs' East Bengal look to defy odds against Turkmenistan challengers\nEast Bengal FC, under coach Carles Cuadrat, faced Turkmenistan's Altyn Asyr FC in the AFC Champions League preliminary play-off. Cuadrat acknowledged East Bengal as underdogs due to their inexperience in Asian competitions. Despite challenges, including injuries and pre-season preparations, Cuadrat emphasized their 'never-say-die' attitude and aimed to raise their competitive standards.\nEast Bengal FC, under coach Carles Cuadrat, faced Turkmenistan's Altyn Asyr FC in the AFC Champions League preliminary play-off. Cuadrat acknowledged East Bengal as underdogs due to their inexperience in Asian competitions. Despite challenges, including injuries and pre-season preparations, Cuadrat emphasized their 'never-say-die' attitude and aimed to raise their competitive standards.\nIndia defender Anwar Ali signs for East Bengal\nAnwar Ali, the India defender, has signed a long-term deal with Emami East Bengal FC after leaving Mohun Bagan SG. He arrived in Kolkata to a grand welcome from fans. Anwar is expected to be unveiled during East Bengal's sports day ceremony. His participation in the Durand Cup remains uncertain pending team progress and PSC's final verdict.\nAnwar Ali, the India defender, has signed a long-term deal with Emami East Bengal FC after leaving Mohun Bagan SG. He arrived in Kolkata to a grand welcome from fans. Anwar is expected to be unveiled during East Bengal's sports day ceremony. His participation in the Durand Cup remains uncertain pending team progress and PSC's final verdict.\nAnwar returns to Delhi, gets PSC nod to join East Bengal\nThe AIFF's player status committee granted Anwar Ali an NOC to return to Delhi FC after he terminated his loan agreement with Mohun Bagan Super Giant. Anwar sought a permanent deal but faced resistance from Bagan. He aims to transfer to East Bengal, but his participation remains subject to final committee orders.\nThe AIFF's player status committee granted Anwar Ali an NOC to return to Delhi FC after he terminated his loan agreement with Mohun Bagan Super Giant. Anwar sought a permanent deal but faced resistance from Bagan. He aims to transfer to East Bengal, but his participation remains subject to final committee orders.\nEnd of Article\nFOLLOW US ON SOCIAL MEDIA",
  "word_count": 616,
  "scraped_at": "2026-02-14T01:51:48.876756",
  "_text_extracted": true
}