{
  "article_id": "ae2c9ed2cad1",
  "url": "https://www.teamtalk.com/liverpool/transfers-arne-slot-tells-fsg-striker-explode-signed-before-rivals-swoop",
  "title": "Liverpool transfers : Arne Slot tells FSG striker whod explode in Prem if signed before rivals swoop",
  "date": "20240601T210000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool transfers: Arne Slot tells FSG striker who’d explode in Prem if signed before rivals swoop\nLiverpool head coach Arne Slot has advised the club’s decision makers that Feyenoord striker Santiago Gimenez has the potential to follow him to the Premier League – but interest from two other English clubs could cause concern for the Reds.\nSlot is getting to work ahead of his first pre-season in charge of Liverpool after leaving Feyenoord and replacing Jurgen Klopp. Simultaneously, Richard Hughes is ready to oversee the summer transfer window for the first time on Merseyside.\nOnly time will tell how much influence Slot has on transfers within Liverpool’s new structure, but one player he appears to have recommended is Gimenez.\nReaders of TEAMtalk will be aware that the Mexico striker is a top target for Tottenham Hotspur after some developments in their striker search this week.\nBut Liverpool could also be contenders for Gimenez after Caught Offside revealed that Slot had mentioned the 23-year-old in talks with his superiors.\nIt’s claimed that Slot has told members of the Liverpool board from their owners at Fenway Sports Group that, of the players he has left behind at Feyenoord, Gimenez is one with clear Premier League potential.\nLiverpool are currently considering their options up front after another inconsistent season by Darwin Nunez. They have been linked with a few other strikers, such as Aston Villa’s Ollie Watkins.\nBut it may make sense for Slot to reunite with Gimenez – a striker he got 49 goals out of at Feyenoord in his first taste of European football – if the price is right for Liverpool.\nLiverpool rival four suitors for Santiago Gimenez\nFurthermore, they will have to fend off competition from other interested parties. As mentioned, Tottenham have placed Gimenez high on their wish list, but there is also interest from Arsenal (who admittedly aren’t prioritising the Argentine-born ace as much as some other striker targets).\nAlternatively, if Gimenez wants to remain in mainland Europe but step up to a more competitive league than the Eredivisie, he could be receptive to interest from Serie A giants AC Milan or LaLiga contenders Atletico Madrid.\nAs with Arsenal, though, Gimenez is not the main target in his position for either of those clubs. Therefore, Tottenham seem to be the club to take most seriously in the race for the former Cruz Azul star, depending on how significant Liverpool’s plans for him are.\nGimenez is still under contract in Rotterdam until 2027. Feyenoord can expect to make a significant profit on the €6m they paid for him two years ago.\nOne way or another, he seems ready to step up to a more consistent Champions League contender after making four appearances in UEFA’s top competition during the 2023-24 group stage.\nREAD MORE: Liverpool ‘seriously considering’ accelerated move for ideal Mo Salah replacement",
  "word_count": 480,
  "scraped_at": "2026-02-14T02:10:54.439378",
  "_text_extracted": true
}