{
  "article_id": "ae2e0f07aae3",
  "url": "https://punchng.com/aboniki-helped-me-stay-warm-in-europe-aremu/",
  "title": "Aboniki helped me stay warm in Europe – Aremu",
  "date": "20230901T023000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kaiserslautern’s new signing, Afeez Aremu opens up on his experience playing in Norway, how he survived and his dreams in this interview with JOHNNY EDWARD\nWhy did you opt to stay in the Bundesliga 2 despite offers from teams in Europe’s top division?\nI decided to stay in Germany because I’ve settled in well and my family is here now with me. My dream has always been to play for the big teams in Europe and also feature in the UEFA Champions League, Europa League but since there were no concrete offers from those teams I decided to move to Kaiserslautern where I could also make an impact. Hopefully, I can help the team with my qualities and gain promotion.\nWhat are you hoping to bring to Kaiserslautern this season?\nI hope to help the team get better and win something this season or gain promotion. Kaiserslautern is a big team in Germany and I’m happy to be with them.\nWhat attracted you to your wife, and has she been supportive to your career?\nIt was her attitude that attracted me. I met her at a supermarket on the Island in Lagos. Actually, she’s just a sister to Kenneth Omeruo’s wife. We got talking and became friends and the rest is history as they say.\nYou could not help St Pauli gain promotion to the elite division, how difficult is the Bundesliga 2?\nIt was sad I could not help them but I gave it my best before I left the club. It’s a tough league and most of the teams have great qualities but I believe it can happen here if we don’t lose our focus.\nGerman fans are known for racially abusing blacks, have you ever suffered abuse from fans on and off the pitch?\nAt the moment here, I have not been racially abused. I also don’t go to where I’m not welcome. I always stay indoors watch YouTube, Netflix or just take a walk around my house.\nYou’ve been in Europe for five years, what’s the experience like playing in Norway and Germany?\nVery interesting journey so far, because arriving in Norway as a teenager was difficult for me. My first year was very tough. But I managed to get through that year in Norway and I’m happy I helped the team gain promotion to the first division before I left despite the tough moments.\nThe first time you saw snow, how did you react?\nIt was an amazing feeling for me, the first time I saw snowfall; a young boy from Nigeria who had never seen such before.\nMy first snow experience happened minutes after we landed in Oslo. I wore a Nigerian wooded cloth and just after I was cleared by the immigration, a lady asked me if I wanted to fall sick or get myself killed and I asked how?. She replied with what I was wearing.\nAfter that, I felt a cold suddenly after the wind blew me as I walked towards the exit of the airport. I ran back to the airport. I had to call my agent to tell the club driver to come to the airport with a jacket because right from that moment at the airport I was already freezing. My debut was similar too. After 20 minutes I could not move well on the pitch. My feet were frozen and I had to be replaced.\nSo how did you cope playing with the harsh weather conditions?\nAfter serious deliberations with my agent, I called a senior colleague (Sylvester Igbonu) to ask for his advice because he played in one of the coldest regions in Russia. He laughed at me when I told him and I was angry because my career in Norway was on the line and I didn’t want to go back to Nigeria. He then suggested that I buy a bigger football boot that had some space around my toes as that would make me run better and also get balm or ‘Aboniki’ to rub on my body each time I get on the pitch.\nAnd did this trick work?\nIt did. Aboniki helped me stay warm on the pitch.\nHow easy was it easy settling down in Europe in terms of the food and the environment?\nIt was rough at the start because I could only find burgers around where I live and eating that was going to affect my fitness level. The only place I could get good Nigerian food was in Oslo which was three hours away from where I stayed. But luckily, I met some Naija friends who showed me shops where I could get soup ingredients to cook.\nAll my years in Nigeria, I never cooked before. So I had to call my sister to give me tips on how to cook so I could survive in Norway. I even tried Youtube videos to learn how to cook but my first meal turned out very bad but eventually, I got it right. Now I can prepare some good soups to go with my amala.\nRegarding language I had a translator who helped me and in the area where I stayed most people spoke English so it was a bit easy interacting.\nWhat has been your best moment and worst so far in your career?\nMy best moment was when I knew I was going to sign for a European team and also help my former team in Norway, IK Start seal promotion to the Norwegian Eliteserien. We suffered a 4-3 defeat to Lillestrom SK in the second leg of their playoffs clash, but it was enough to guarantee promotion to the elite division after IK Start won the first leg 2-1, which proved vital in the promotion race. It was a night I cannot forget in my life.\nMy worst moment was when I played for the Super Eagles B team at the WAFU Cup tournament and we lost 4-1 to Ghana in the final. That was my first ever chance to win something with my country but it did not happen. I cried so much that night but I thank Allah that my effort was not in vain as I moved to Ik Start months later.\nWho will you pick as Nigeria’s greatest player?\nFor me, it has to be Jay-Jay Okocha. He was so good while he was active. I hope to emulate some of his qualities like his passing range and short dribbling skills.\nWhat are your ambitions?\nI want to win trophies before the end of my career and play for one of the top European clubs as well as feature in the UEFA Champions League and hopefully get a chance to play for the Super Eagles at the 2026 World Cup.\nDo you think we stand a chance of qualification with South Africa, Lesotho, Benin Republic and Rwanda?\nOf course we do but we must ensure we win our games. We have the qualities to achieve\nthat.",
  "word_count": 1162,
  "scraped_at": "2026-02-14T02:13:11.416628",
  "_text_extracted": true
}