{
  "article_id": "ae408b138ebd",
  "url": "https://metro.co.uk/2023/10/10/euro-2028-stadiums-venues-cities-host-games-19637543/",
  "title": "Euro 2028 stadiums : Which venues and cities will host games ? | Football",
  "date": "20231010T104500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The full schedule for Euro 2028 has now been confirmed, but three of the Premier League’s most iconic venues will not be in use for the tournament.\nA total of nine stadiums will host games at Euro 2028, which is taking place in the UK and Ireland across June and July.\nBut Old Trafford, Anfield and the Emirates will not be opening their doors to fans in three years’ time, with the homes of Manchester United, Liverpool and Arsenal left off the final list.\nThe four home nations will play all of their group games in front of their own supporters – assuming they qualify – but for fans of England, they will not be given the opportunity to cheer on the team at three of the stadiums most synonymous with English football.\nWhy Old Trafford, Anfield and the Emirates are not hosting games\nOld Trafford has not been included due to the uncertainty around Manchester United’s stadium plans.\nUnited, who announced earlier this year they are intending to build a brand new 100,000 seater venue, could not guarantee that Old Trafford would be available for use in 2028 back when the stadium shortlist was being finalised in 2023.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThis is because United, at the time, had been considering redeveloping Old Trafford instead of building a new stadium away from the existing site.\nAnfield, meanwhile, is playing no part in Euro 2028 because the pitch is too small.\nUEFA’s guidelines state that ‘the field of play must have the standard dimensions of 105m by 68m’, with Anfield’s hallowed pitch falling just shy at 101 metres.\nThis ineligibility also extends to the Champions League and Europa League, with Anfield also unable to host the finals of UEFA’s two biggest club competitions.\nThe Emirates is also due for a quiet summer in three years’ time, with Wembley and the Tottenham Hotspur Stadium chosen as London’s venues instead of Arsenal’s home.\nThe Gunners are also said to be exploring the possibility of redeveloping their home of 19-years, with plans reportedly being considered which would lift the existing 60,700 capacity to a figure over 70,000.\nAs such, not hosting games in 2028 gives Arsenal more flexibility over the timeframe of any redevelopment work, should they indeed choose to go ahead and make changes to the Emirates.\nConfirmed stadiums and host cities\nWembley (London) – eight games\nWembley will host the final on July 9, having had the same honour for the showpiece games at Euro 96 and Euro 2020.\nShould England qualify, the Three Lions will play their final two group games at the stadium, whilst the home of English football will also host the two semi-finals.\nEtihad Stadium (Manchester) – five games\nManchester City’s home is currently undergoing development with a third tier being added to the North Stand, which will take the stadium capacity to over 60,000 once it is completed later this season.\nEngland are scheduled to play their first game of Euro 2028 at the Etihad.\nHill Dickinson Stadium (Liverpool) – five games\nEverton’s 52,769-capacity new home opened its doors this year, becoming the eighth largest football stadium in England.\nThe ground will be known as ‘Everton Stadium’ for the tournament due to a ban on sponsor’s names, and it’s five games includes hosting one of the Round of 16 clashes.\nSt James’ Park (Newcastle) – five games\nNewcastle’s iconic stadium was one of the venues used during the Euro 96 tournament – the last time the UK exclusively held a major international competition.\nShould England top their group, they will play their Round of 16 game in the North East.\nTottenham Hotspur Stadium (London) – five games\nSpurs’ new home since 2019, the stadium is the biggest club venue in London and features a retractable pitch with a synthetic surface situated underneath which is used for NFL games.\nThe stadium is scheduled to host one Round of 16 game, alongside four group matches.\nVilla Park (Birmingham) – four games\nAston Villa’s 52,190 seater stadium played host to four fixtures at Euro 96, including two of Scotland’s group games and one quarter-final.\nThe venue also hosted matches at the 1966 World Cup, with the likes of Spain, Argentina and West Germany turning out in Birmingham.\nPrincipality Stadium (Cardiff) – six games\nThe Principality will be the second-largest venue in use at Euro 2028 with a capacity of 74,500, and will host the opening game on June 9.\nWales will have extra-motivation to qualify for the tournament, given they would be involved in the opening game of Euro 2028 in front of their own fans.\nHampden Park (Glasgow) – six games\nScotland’s national stadium hosted four games at Euro 2020.\nIn the event Scotland qualify, the team will play all three of their group games in front of the Tartan Army in Glasgow.\nAviva Stadium (Dublin) – seven games\nThe Dublin venue, which holds over 51,000 people, regularly hosts Republic of Ireland football matches and those of the Ireland rugby union team, along with high-profile Gaelic sports.\nThe stadium had been due to host games at Euro 2020 but was withdrawn from the final list by UEFA over issues with the Covid-19 pandemic.\nFull schedule\nGroup Stage\nFriday, June 9: A1 vs A2 – Principality Stadium, Cardiff\nSaturday, June 10: B3 vs B4 – Aviva Stadium, Dublin\nSaturday, June 10: A3 vs A4 – Hampden Park, Glasgow\nSaturday, June 10: B1 vs B2 – Etihad Stadium, Manchester\nSunday, June 11: D3 vs D4 – Hill Dickinson Stadium, Liverpool\nSunday, June 11: C3 vs C4 – Villa Park, Birmingham\nSunday, June 11: C1 vs C2 – Wembley Stadium, London\nMonday, June 12: E1 vs E2 – Aviva Stadium, Dublin\nMonday, June 12: E3 vs E4 – St James’ Park, Newcastle\nMonday, June 12: D1 vs D2 – Tottenham Hotspur Stadium, London\nTuesday, June 13: F1 vs F2 – Hampden Park, Scotland\nTuesday, June 13: F3 vs F4 – Etihad Stadium, Manchester\nWednesday, June 14: A1 vs A3 – Principality Stadium, Cardiff\nWednesday, June 14: A2 vs A4 – Hill Dickinson Stadium, Liverpool\nWednesday, June 14: B1 vs B3 – Wembley Stadium, London\nThursday, June 15: C2 vs C4 – St James’ Park, Newcastle\nThursday, June 15: B2 vs B4 – Villa Park, Birmingham\nThursday, June 15: C1 vs C3 – Tottenham Hotspur Stadium, London\nFriday, June 16: E1 vs E3 – Aviva Stadium, Dublin\nFriday, June 16: D2 vs D4 – Etihad Stadium, Manchester\nFriday, June 16: D1 vs D3 – Wembley Stadium, London\nSaturday, June 17: F1 vs F3 – Hampden Park, Scotland\nSaturday, June 17: F2 vs F4 – St James’ Park, Newcastle\nSaturday, June 17: E2 vs E4 – Hill Dickinson Stadium, Liverpool\nSunday, June 18: A4 vs A1 – Principality Stadium, Cardiff\nSunday, June 18: A2 vs A3 – Tottenham Hotspur Stadium, London\nMonday, June 19: B2 vs B3 – Aviva Stadium, Dublin\nMonday, June 19: B4 vs B1 – Wembley Stadium, London\nTuesday, June 20: D2 vs D3 – St James’ Park, Newcastle\nTuesday, June 20: C4 vs C1 – Etihad Stadium, Manchester\nTuesday, June 20: C2 vs C3 – Hill Dickinson Stadium, Liverpool\nTuesday, June 20: D4 vs D1 – Villa Park, Birmingham\nWednesday, June 21: F2 vs F3 – Principality Stadium, Cardiff\nWednesday, June 21: E4 vs E1 – Aviva Stadium, Dublin\nWednesday, June 21: F4 vs F1 – Hampden Park, Scotland\nWednesday, June 21: E2 vs E3 – Tottenham Hotspur Stadium, London\nRound of 16\nSaturday, June 24: 1A vs 2C (match 37) – Principality Stadium, Cardiff\nSaturday June 24: 2A vs 2B (match 38)- Hill Dickinson Stadium, Liverpool\nSunday, June 25: 1B vs 3A/D/E/F (match 39) – St James’ Park, Newcastle\nSunday, June 25: 1C vs 3D/E/F (match 40) – Etihad Stadium, Manchester\nMonday, June 26: 1F vs 3A/B/C (match 41) – Hampden Park, Glasgow\nMonday, June 26: 2D vs 2E (match 42) – Tottenham Hotspur Stadium, London\nTuesday, June 27: 1E vs 3A/B/C/D (match 43) – Aviva Stadium, Dublin\nTuesday, June 27: 1D vs 2F (match 44) – Villa Park, Birmingham\nQuarter-finals\nFriday, June 30: W39 vs W37 (match 45) – Wembley Stadium, London\nFriday, June 30: W41 vs W42 (match 46) – Aviva Stadium, Dublin\nSaturday, July 1: W44 vs W43 (match 47) – Hampden Park, Glasgow\nSaturday, July 1: W40 vs W38 (match 48) – Principality Stadium, Cardiff\nMore Trending\nSemi-finals\nTuesday, July 4: W45 vs W46 – Wembley Stadium, London\nWednesday, July 5: W47 vs W48 – Wembley Stadium, London\nFinal\nSunday, July 9 – Wembley Stadium, London\nFollow Metro across our social channels, on Facebook, Twitter and Instagram\nShare your views in the comments below\nMORE: Ole Gunnar Solskjaer reveals why his £73m Manchester United signing ‘really struggled’\nMORE: Pierre-Emerick Aubameyang tells Arsenal fans why he made massive Chelsea mistake\nMORE: Graeme Souness hails Man Utd legend but ‘turns sound down’ on other pundits",
  "word_count": 1530,
  "scraped_at": "2026-02-14T02:10:28.712141",
  "_text_extracted": true
}