{
  "article_id": "ae6045f7005e",
  "url": "https://www.arsenal.com/news/invincibles-week-comeback-beat-city",
  "title": "Invincibles this week : A comeback to beat City",
  "date": "20230828T141500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Each week, we'll reminisce about our incredible Invincible season 20 years on by looking back at what was going on at the club on and off the pitch, as well as remembering key news stories and the pop culture buzz at the time.\nThe previous week, we had beaten Middlesbrough and Aston Villa to move to the top of the table ahead of a visit to a new venue, while encountering some familiar faces…\nSetting the scene\nWith three wins from our opening three league matches, we headed into our clash against Manchester City top of the table, level on points with their neighbours United but with a better goal difference.\nIt would be our first visit to the City of Manchester Stadium, but we would have to find a way past David Seaman to get the three points, who had linked up with his former England boss Kevin Keegan at City after departing Highbury in the summer following 13 years of service.\nWenger’s words\nThe boss was thrilled with the good start to the campaign, but was quickly playing down expectations. “I'm happy with having maximum points,” he said. “It seems that two weeks ago everybody was writing us off, but now we are favourites again! It just shows how quickly things change but really it's too early to be talking about the title.\n“We started well last season too but I don't think there is a danger of peaking too early. The way I explain it is that at the beginning of the season, all the pitches are very good and fast, and that suits our style of football.\n“Through the winter, we sometimes suffer because our game is based on quick passing and movement and when the pitches are not as good we can struggle a little bit.”\nFrom the dressing room\nWith Sol Campbell suspended for the trip to City, 37-year-old Martin Keown stepped into the heart of our defence alongside Kolo Toure. Despite losing his spot to the Ivorian and with teenager Philippe Senderos also recently acquired, when asked if helping their development was a conflict of interest when he too wanted minutes, the veteran was very diplomatic.\n\"These players are the future of Arsenal Football Club and it would be wrong of me not to give them every bit of help I can give them,” he said.\n\"I've always believed that if you're chosen to play it's because you're the best for the job and if young players are playing really well and getting their place on merit, they deserve to be in the side, that's how football should work.\n\"As far as imparting your knowledge onto others, I noted as a younger player that some older pros would give you as much help as possible while others would be more reticent. I always vowed to myself that when I got into that position, which I am now, I'll be as honest and as helpful as I can.\"\nOn the pitch\nGAME 4: MANCHESTER CITY 1-2 ARSENAL\nAugust 31, 2003\nWe came back from conceding an extraordinary own goal that threatened to overshadow Seaman's first appearance in goal against his former club.\nCity's goal was as incredible as it was unexpected. Lauren swept the ball into his own net as he tried to withstand the pressure from Trevor Sinclair as a simple situation turned into a nightmare for the Cameroon defender.\nWe collected ourselves and set about attacking the goal in which our legendary former 'keeper stood guard, but at the other end a forceful run by another former Gunner in Nicolas Anelka finished with him stinging the hands of Jens Lehmann with a drive which was parried out for a corner.\nFreddie Ljungberg was then denied by Seaman who touched over a rasping shot by the Swede. Once again, however, it wasn't until the second half that the Gunners picked up the pace and with it a stranglehold in the game.\nWe equalised on 47 minutes when Sylvain Wiltord found space after some clever inter-play by Robert Pires and Ashley Cole, and finished calmly when presented with an opportunity by nutmegging Seaman.\nOur team spirit was in full view as we began to realise that with Manchester Utd losing the same day a victory would see us begin September with a three-point advantage, and with 18 minutes left Ljungberg grabbed a chance presented to him by some slack defending by scoring his first goal of the season.\nLine-up: Lehmann, Lauren, Toure, Keown, Cole, Ljungberg (Parlour 75), Vieira, Gilberto, Pires (Edu 83), Wiltord (Bergkamp 75), Henry. Subs not used: Taylor, Cygan.\nWenger post-match verdict was: \"Manchester City surprised us today. We decided to play a more direct game in the second half. I asked my players to give more and in the last 10 minutes we created many dangerous situations.\"\nWhat the press were saying\n\"It has been a better start to the season than Wenger dared to expect.\" The Times\n\"It was a profitable day for Wenger's team, particularly as they had been woken in the early hours by a fire alarm at their hotel in Manchester.\" The Guardian\n\"The sign of a great side is winning when you do not play well and that is what Arsenal did. It was a big opportunity lost for City, who could have topped the table themselves with victory.\" The Sun\nAlso this week\nWe were drawn alongside Inter Milan, Lokomotiv Moscow and Dynamo Kiev for the Champions League group stage, with the Italian giants first up on September 17.\nOn transfer deadline day, Francis Jeffers departed to his former club Everton on loan until the end of the season. He would score just twice in 22 appearances for the Toffees.\nUSA under-19 international Danny Karbassiyoon signed from Roanoke, while fellow striker Michal Papadopulos arrived on a one-year loan deal from Czech side Banik Ostrava.\nImage of the week\nThierry Henry poses for a photo for the official Arsenal magazine on the Highbury pitch. The striker had signed a new deal earlier in the year to remain in north London. \"I've spoken to several players who have left here and they wish they hadn't,\" he told the publication. \"They realise too late what a great club this is.\"\nUK number ones\nTop 40: Breathe - Blu Cantrell feat. Sean Paul (third week at No.1)\nAlbum chart: American Tune - Eva Cassidy\nBox office: American Wedding (second week at No.1)\nIn the news this week\nFans are shocked when Madonna shared kisses on stage with Britney Spears and Christina Aguilera during the trio's performance at the MTV Video Music Awards,\nOn its first day, Skype is downloaded by 10,000 people. Within a couple of months, it had one million users making high-quality calls to each other anywhere in the world for free.\nScientists warn an asteroid around two-thirds of a mile wide could hit Earth in March 2014 and was classified as \"an event meriting careful monitoring\" by astronomers.\nDiscover where our season would go next as we headed into a clash against Portsmouth two weeks later\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1207,
  "scraped_at": "2026-02-14T01:50:52.141290",
  "_text_extracted": true
}