{
  "article_id": "ae63ef82d101",
  "url": "https://toffeeweb.com/season/24-25/comment/fanscomment/46548.html",
  "title": "Perhaps we can now escape the dark shadow of Anfield ? ",
  "date": "20250817T121500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "You can try to find the updated link in the article archive.\nReader Comments (81)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 17/08/2025 at 09:40:09\nIf (massive 'if') I wasn't absolutely obsessed with Everton, I wouldn't bother at all with the Premier League.\nAnd it's mid-August – no football should start until September. I've quoted in part Bobby there and I have to say, I agree with every word he says.\n2 Posted 17/08/2025 at 10:23:14\nI came up with a working title but let me know if you think of something better.\n3 Posted 17/08/2025 at 10:33:25\n4 Posted 17/08/2025 at 10:39:17\n5 Posted 17/08/2025 at 10:39:29\nIt's 5 weeks until we play them and I hadn't given it a moments thought until now as, like most of us, I'm more focused on us dismantling Leeds tomorrow night.\nIn fairness to Bobby, I kind of get what he's saying. It's one of the reasons why we need to retire that ‘Grand Old Team' song as even that references them.\n6 Posted 17/08/2025 at 10:58:02\nThe rot started in the early 70’s with the mental decline of Harry Catterick, continued with the hopeless Billy Bingham, had a short lived up tick with the gormless Gordon Lee. A bright, brilliant moment under Howard and ever since, just a slow, steady decline.\nI don’t know if TFG will get us back to where we belong. It’s not just splashing the cash, as Moshiri found out, but changing the mentality at everyone at BMD.\n7 Posted 17/08/2025 at 10:59:56\nBut perhaps we need to use those 5 weeks to totally change the mindset in the club and go there on the back of a fantastic start to the season! Yeh!!!\nI shall send this to David Moyes so he can pin t up in the changing room…\n8 Posted 17/08/2025 at 11:06:26\nIt was an off the cuff post in which I threw out a handful of many Everton related frustations that have been rattling around in my head for a while. The post may or may not adequately convey my thoughts.\nIn the main, I feel there has been a fairly obvious decades-long cultural malaise at Everton. The derby is the best example of it.\nYour first paragraph is juvenile and utterly deluded, by the way. Check our post-Shankly record in the fixture.\nThe problem of rank defeatism and an inherent loser culture is undeniable. The evidence is irrefutable. It exists in respect of all fixtures. In relation to everything. We have become a club that when the pressure is on, we fold. We are \"Spursy\". In fact, we are way more Spursy than Spurs.\nWhat I want to do is highlight it and establish how we can change it.\nUntil we accept how far we have fallen, how deep the rot is, we can never recover. It's better than people deluding themselves that the malaise is only \"supposed\" to exist and everything is ok, a la Kenwright.\nHistorically, it is generally the arrival of one man with immense the drive and zeal who changes things. (Busby Shankly,Clough, Pep, Jose etc and yes I know they all had money as well).\n9 Posted 17/08/2025 at 11:20:46\nPeople who are genuinely going to be leaders in their craft. Medical excellence, talent spotters, academy coaches, coaches that tactically see the game differently and are able to squeeze every last drop out of the players.\nDelivering this on a long term basis is also the challenge. Brighton have signed brilliantly, but post the inevitable sale of Mitoma, Mintah & Baleba, I think they're done. Similar with Brentford losing Wissa, Mbeumo & Toney. You can outperform for a period, but someone richer will always copy or steel that IP at some point.\nCredit therefore is probably looking at Forest and Villa. I won't be a lonely in disliking the Greek owner, but he's recruited top people in the background and on the pitch. Villa have also done well, but they seemingly lack top sparkle after missing on champions league and psr issues. Both will remain in the top 10, challenging the so called top 6 with Newcastle.\nFor Everton it will be years before we see real change. The player quality scouted has been improved. Getting them over the line has been a challenge, but let's be honest, evertons name has been mud after the financial mismanagement, psr issues, brushes with organisations like 777, dyer football from poor players & coaches. Selling on the back of thst is not an overnight thing.\n12 months time the new structure will be in place & settled. Moyes will have them comfortably mid table, playing better football than we've seen in person since early Silva. The academy is now begining to pick up promising kids, with the offer that there is a pathway for the best. Thats a long time since that's been in place. Ive told the story before of the academy telling the parents that evertons biggest success was selling their players. Hopefully that's now cone to an end, and that mentality has been shown the door.\nPatience is short at Everton, and its hard to ask fans for more. But if we can give it 3 years to allow green shoots to form, I do think we can break the cycle of the last 10 years. Whether that means ever challenging and winning titles is impossible to know. But it's a start.\n10 Posted 17/08/2025 at 11:26:33\n11 Posted 17/08/2025 at 11:26:36\nNew badge. Don't even ask the fans. Just do it.\nHammer Elton John's I Guess That's Why We Call it the Blues. Which we should sing. A lot. We won't, of course, as many of our fans are obsessed with \"kopite behaviour\".\nThis is the point. We have become so spooked by them, so determined to only define ourselves as the opposite of them, that we have lost our identity and become...nothing.\nIn the 90's When Skies are Grey -which I used to love btw - even used to discourage the wearing of colours and a \"kopite-esque show of wool\" (scarfs ffs). In other words, supporting!\nWe turned in on ourselves. We became insular and perverse. Weird and quite honestly small time. We drove ourselves into a cul de sac from which we are yet to escape.\n12 Posted 17/08/2025 at 11:36:11\nThe change thats needed isn't a new badge a new song a new manager, its about bringing in quality players. That means starting at youth level which we seem to have ignored for decades, where many like our neighbours have made an absolute fortune of selling local boys brought through their academy or youngsters that they brought to their academy by buying them from other clubs. I believe their sales this summer brought in over £100m excluding Diaz and those players cost them £600,000 thats where we need to start,\n13 Posted 17/08/2025 at 11:39:54\nBobby, I'm 53, approaching 54 and have witnessed more derby defeats than victories. Ironically, a lot of my best derby memories have come at Anfield, not Goodison.\nIt has become a mentality thing, but for some strange reason, it's never got to me. I don't go into any derby fearing them or being submissive. Why should we?\nI will comment on them as much as I will any other team, but tend to leave the derby in the build up to the match itself.\n14 Posted 17/08/2025 at 11:45:01\nPlayers always talked about how difficult it was coming to Goodison and how loud and intimidating the crowd was. Dan Meis even made much noise about trying to replicate that at Bramley Moore. I must admit that such comments always surprised me as my own experiences are that our support is quite brittle. We start out loud but swiftly go quiet if things aren’t going our way, often being outsung by visiting fans.\nI remember Sylvester Stallone trying to whip the fans up at half-time (against Coventry, I think) so that he could record it and use it in one of the Creed movies. In typical Evertonian style, we weren’t having any of it cos we’d been shite in the first half, and the resultant ‘cheers’ were half-arsed and quite embarrassing really.\n15 Posted 17/08/2025 at 11:46:35\nColin too, apart from these words\n\" not the fans who have accepted continued mediocrity\".\nHere I'd have to disagree. Its clear that the vast majority were not bothered about anything other than Premiership status for way too long.\nLong gone were the expectations for silverware. Long gone any knowledge of european football. Long gone any hope of any challange other than struggle.\nAcceptance that the crooks in charge, right back to our most successful era, took cash out via their holdings, failing to put cash in or an input that wasnt free, season after season.\nThe lowering of acceptable performance off the pitch and most certainly on it. Reducing quality of players everywhere. Selling assets off to recruit dross (via certain favoured self interested agents) bred mediocrity and mindsets. Fans were enshrined into a programme where success was never going to happen. Because of falsely inflated hardship, lies and self centred power mongering, deceiving the blue world into believing he was looking for investment year after year, decade after decade. To the detriment of everything Everton. Without a care, cutting off communication to those who asked. That fat false smugness. The worst owner, chairman, in the clubs history. Best narcissist. When open wounds fester without treatment or being completely severed all that is inevitable is death.\nSo many trusted. So many accepted. And the rot started years before that dreadful man. He just took advantage.\nRecovery ?\nSo long as the past 4 decades + are held up as a continual reminder of the sickness and disease that those with power infected the club with.\nIts tougher than ever to recover.\nThere is a hardcore caucus of clubs that have gripped the domestic and european golden goose for that long no one can get past their shields of unfairness and inequality.\nRules have changed everywhere to benefit them\nFifa, uefa, PL all want the same thing. A league of elite.\nEverton are not considered and any thought that we might be, evaporated way before several generation of incredible blues fans were even born.\nOur only way to the top is usurping the barbed wire bureaucracy designed to keep us well away, by reinventing the game of football. Smash the indoctrinated coaching badge way. And for that we need a regime change from grass roots where the failings are still endemic, up to and including the players, manager and TFG.\nThis will take time.\nWhether it will be done, we shall see.\nCOYB\n16 Posted 17/08/2025 at 11:47:19\nBusby developed his academy players. Shanks drilled into his team a winner’s mentality and Cloughie, well he won the title with Derby bloody County and Nottingham sodding Forest. Two footballing nobodies.\nYes they spent money in later years but they all started from a very low base and it was shrewd buying and selling and player development which made them successful.\n17 Posted 17/08/2025 at 11:50:11\n18 Posted 17/08/2025 at 11:52:11\nPlus hard bastard discipline and a simple approach.\n19 Posted 17/08/2025 at 11:54:58\nI've no idea how decent a player Ben Doak is. He's being touted for £25M. He played once or maybe twice for Celtic, the same for that lot. Decent spell at Boro in the Championship. £25M.... if I didn't dislike them so much, I'd applaud them.\nStill, we may get a Lucky Bag and a bottle of Tizer as a sell-on fee for Broadhead going to Wrexham.\n20 Posted 17/08/2025 at 11:55:09\nIt's an incredible, and extremely unlikely achievement to have been such a poorly run club over a period of 35 years and remain at the top table; no one else has come close! Unfortunately, our unlikely survival served only to maintain the status quo.\nWe can only hope that our new ownership will finally break the cycle; too early to tell yet. I can't see how they can fail to be an improvement on what has come before, though.\nIt's not about psychology and mindset, it's about professionalism at all levels of the club that has been sadly lacking for decades. Songs and badges are as irrelevant as our neighbours.\n21 Posted 17/08/2025 at 12:07:27\nWhy? Because we had people within the club who wanted to emulate them, and because these people had been winners themselves in their playing career, they knew just how to do it.\nThe only other time we have got under their skin was in the mid-nineties. Why? Because we had a scouse manager who also knew how to win, and more importantly he knew them better than they knew themselves.\nFuck Liverpool — concentrate on Everton, which is why Tarkowski's \"ask no fucking questions\" tackle on Mac Alister is hopefully going to be the start of us having a completely different attitude against whoever we play in the future.\nWhilst I would never want to be them, it doesn't mean that they are not the yardstick, because anyone who knows anything about winning knows that you don't get anywhere if you haven't got the desire and an attitude that means that you don't give a fuck for anyone who is going to try and stop you winning.\nA great post, Bobby, and also one that didn't really need to mention those bastards, because football is just like life and the most important thing we can do is get our own house in order first before we can hopefully (my predictive text just wrote hopelessly🤷♂️) move on to better things.\nEvertonians have been complicit, Colin (the acceptance of Kenwright, that allegedly transparent vote, where the majority voted to go to Kirkby) and we are a completely different set of fans from the ones that used to throw the cushions onto the pitch when I first started attending Goodison Park.\nWe accept not being ready for the start of the Premier League season as if it's normal, even though it's totally unprofessional and not befitting of the club we once were. No wonder we don't win anymore.\n22 Posted 17/08/2025 at 12:09:16\nTFG appear shrewd business people, running the club on a sound operating model. Bottom line will be key for any owner. Your in business to be profitable. Whether they share the same views as us fans wanting to win trophies, remains to be seen.\nGoing back to cultural and mindset changes, that is something that TFG will need to install over time.\nTo date, and just in my opinion, only the Moores family have set the bar high in the time i've supported this club, but no surprises they also had involvement across the park as well in that time. Vested interest in both club perhaps.\n23 Posted 17/08/2025 at 12:42:30\nAnyone born post 1990 has never experienced a successful Everton team (and I'm not talking a measly FA Cup win) so of course they have been accustomed to mediocrity.\nI honestly believe this generation are our most loyal fans. Who else would put up with this crap? Hats off to any and every Everton fan under the age of 30.\nIf I was 5 again today, I don't know if I would choose Everton to be my team.\n24 Posted 17/08/2025 at 12:49:44\nAll the other posters have mentioned things I would have done. However, only two things to note.\nIn this para 'No one appears to have twigged that the '09 defeat appears to have irreparably damaged morale regarding the fixture. We have barely won one since, even at home where we are 10 years without a win.'\nIs that the 2012 semi-final defeat?\nDidn't we win 2-0 at Goodison in 2024?\nWe need to at least celebrate some victories.\n25 Posted 17/08/2025 at 12:52:16\nI think Everton have missed a trick by not employing some of these winners in some capacity in the past, a la Reid, Southall and, in modern times, Rooney.\nTalking about Rooney, he may be painful to watch as a TV Pundit but he had a winning mentality. Although his managerial career is suspect, surely his experience as an attacker could be put to use as a Specialist Attacking Coach.\n26 Posted 17/08/2025 at 13:04:15\nI think it has to start on the field.\n27 Posted 17/08/2025 at 13:17:05\nCareful, strategic recruitment and tons of patience required. I just hope this is not another false dawn.\n28 Posted 17/08/2025 at 13:17:25\nLike Bobby says, it's in the fabric of this club and the we appoint a “knives to a gunfight” loser Moyes mentality again to this club. I had hoped he'd be gone in the summer but here we go again with another loser.\nWest Ham European Conference League win apart, he's won fuck all for us or any other club he was with. He got lucky once… never to be repeated.\n29 Posted 17/08/2025 at 13:18:58\nI should have stated that, “by those who should have known better”, with regards William, and it's why I try and educate as many young people as possible about the dangers of a government that wants to do away with cash and have total control with digital currency!\nI often think that Wayne Rooney is a waste to football by taking the easy option and earning his money by talking about rather than still being involved in the grind of day-to-day football, Steve.\nRooney hasn't been a very good manager, but neither was one of his earliest mentors, Colin Harvey. Harvey was by all accounts an outstanding football coach, something I think Rooney would also be if he still had the desire and the inclination.\nIf I was David Moyes, I'd have been on the phone to Rooney the minute I got the Everton job because he his a born winner and also an Evertonian who comes from a family of Evertonians.\n30 Posted 17/08/2025 at 13:26:03\nOur manager got us the whole-season equivalent of 62 points last year and (in my view) we played much more attacking football. All this was managed with the same players (plus Alcaraz) that Dyche had. How about a bit of positivity for once and actually getting behind our manager and players (whoever they are)?\nYou never know, we might actually win on Monday night and our new players may perform. We may also sign a few more players before the window closes and make some progress up the table this season. Glass half-full for me at this stage! Let's see if it is still the case on Monday night.\n31 Posted 17/08/2025 at 13:33:35\nDerby days I can't relax. I hate the Red Shite with a venomous passion. I need help!!\n32 Posted 17/08/2025 at 13:35:26\nI shook my head and told a Liverpudlian that he didn't know much about football when he gave me that standard bollocks about the Premier League needing Everton. Barring injury to Branthwaite, I think we are a mid-table team, and I think Moyes has already proved this since he took the job.\nCan we go higher? With the right signings, then I'm confident the answer will be Yes.\n33 Posted 17/08/2025 at 13:40:07\nSome great posts on here from Everton fans who love Everton, but a fighting Everton who believe they are going out to win not just there as fodder for their opponents.\nWinners, managers and players who truly who have the guts to get out there and have a professional attitude in trying to win in every game not just against Liverpool, fuck them, who are they! should be the attitude which the way it was under Catterick, Kendall/ Harvey and Royle who took great pleasure in winding the bastards up, before, during and definitely after the game.\nIt will take a few years, which has already been said, but it can happen —if we have the winning personnel on and off field let’s see how these owners shape—- they are here to make money — I hope they make brewsters while making us happy following a team that fears no one.\n34 Posted 17/08/2025 at 13:43:58\nAs for Moyes, he has 2 years left on his contract. I expect that he will stabilise us more on the pitch and we will be knocking on the door of Europe, if not qualifying, in that time.\nI would think by then we will be a much more attractive proposition and we will get a new manager then. We could (and should) be doing far better than this, though, and I fully expect us to do so in the next few years.\nI want my two lads to see us win something soon – both in their mid-twenties and never seen the glory years!\n35 Posted 17/08/2025 at 13:56:36\n36 Posted 17/08/2025 at 13:59:14\nThat post sits well with me, Dave @33. We shouldn't be afraid of anyone and they are just another team we have to face in a league of 20. Increased rivalry? Yes, but I leave that for derby day.\nWe won't win every game, but the is no excuse for going out with a desire to win, whoever the opposition are.\n37 Posted 17/08/2025 at 14:15:22\nI don't think most of us have a losers mentality, but wishing for something doesn't make it happen — it takes much more than that.\nI think we all know why the Reds' squad is better than ours so I won't go into all the historic and recent reasons.\nSuffice to say it's very very difficult to come from where we are now to reach the top and stay there.\n38 Posted 17/08/2025 at 14:34:04\nFunny, this thread is practically entirely anti-Moyes. Yet, the reason Martinez was sacked for the 'lowly position of 12th' was because it was so far below the standards that Moyes had achieved with no backing whatsoever.\n39 Posted 17/08/2025 at 16:07:24\nWe beat the RS 2-0 in April 2024 under Sean Dyche.\n40 Posted 17/08/2025 at 16:22:00\nDid anyone see that headband Gordon was wearing yesterday?\nAbsolutely embarrassing.\nHe’s one helmet.\nI agree about the mentality towards that lot.\nBut why? Just go out there and give them a game.\nMake sure they can’t walk after the game.\nThe Tarkowski challenge on that home alone gobshite was a great example off how to stick it on them.\nFear no team. Especially those media darlings.\nDo us fans fear their fans? Definitely not.\nThe same applies to the club/team.\nThey’re disgusting human beings who everyone wants to beat.\n41 Posted 17/08/2025 at 16:40:10\nThe semi-final surrender against L'pool was in 2012.\nAnd yes we have won a colossal one home derby match in the last 10 years, in 2024. WOW!\nSo well done to you, John Raferty #39\nInstead of being a smart-arse, address the substance of the matter.\n42 Posted 17/08/2025 at 17:03:55\n43 Posted 17/08/2025 at 17:20:28\n44 Posted 17/08/2025 at 17:21:13\nThat whole Club professionalism has been sadly absent from our Club and we have got to face up to the consequences that for most part we have been a basket case. Whether things will change now with the new owners and the new ground who knows ? But the collective consequences is that the Liverpool squad is by every measure considerably better than ours. It's a far cry from my school days when as kids we picked our Everpool or Liverton teams which always consisted of 5 or 6 players from each team.\nAs we approach our first game tomorrow we don't look like the team is in great shape so another year of struggles looks likely. Hopefully things will get better but our recent recruitment process still looks patchy and for another year at least we will, I expect, finish a long way behind our neighbours.\n45 Posted 17/08/2025 at 17:29:06\nI commented on here around that time that a \"cowards mentality runs through the club\". It wasn't just that we lost, it was the way we knuckled under and surrendered a great chance.\nWe crumbled, not under the weight of the opposition, but under the pressure of being favourites and in the lead.\nWe're fine at Goodison, we could use the crowd to get us over the line but away from home we were helpless.\nI still think about that game sometimes, it really left a mark on me, but 2016 was even worse. We were well on top against United and clearly the better team in the second half but still found a way to lose.\nWe even went 1 up away at City in the LC semi final and managed to mess that up too! Two semi finals in the same season and two great chances squandered.\n46 Posted 17/08/2025 at 19:01:26\nThere is only one reason for that. Mr Bill Shankley\nLiverpool were shite at that time, really shite. The culture, players, apathy, everything was wrong\nShankley went in and binned all the crap, forced the Club to change and more important changed the mindset and mentality of every person at that club\nHad Shankley not been appointed those arseholes would have been on par with Sheffield Wednesday\nBut typical of that club, when Shankley had made them what they are, a worldwide franchise, he, was binned.\nThere’s a surprise!\n47 Posted 17/08/2025 at 19:36:52\nNo-one outside the playing staff can state there is a decades long ‘cultural’ root cause to the poor record against them.\nYou are ignoring some important factors.\nIn the time scale you have chosen they have broadly been one of the most consistently successful clubs in the country (Europe, the world, etc). To help supercharge that extended period of success they have obviously massively drawn away from us financially in the Premier League era.\nDerbies generally come with extra pressure, especially on a club that has been recently overshadowed.\nAnxiety is the most likely emotion that gets transmitted from the fans to the players. Fans may feel their ‘noise’ can only ever be inspiring but it can also make players too hyped up and frantic. Therefore, the derby games become harder to succeed in.\n‘Luck’ is a tricky subject. To say you make your own is a bit too simplistic. It is fairly evident that not all referees are as resistant to confirmation bias as they need to be.\nYes, the club has fallen well behind our traditional rivals in a number of ways that all add up to us being the under-dog when we play them.\nTo say it is simply a ‘loser’s mentality’ ingrained in the club that has infected every player we’ve subsequently had is a gross oversimplification, in my opinion, as I very much doubt a player’s psyche is that easily influenced.\nHowever, winning mentality is probably something only certain managers can easily spot and those players who definitely possess it are probably rare and costly.\n48 Posted 17/08/2025 at 19:43:17\nThey improved under Shankley definitely but it wasn’t ‘til they gave him what they had never given to any other Liverpool manager —- money—that they were able gain promotion with the signings of Ian Saint John and Ron Yeats along with Gordon Milne being the catalyst for future success, after promotion they made another great signing Stevenson the ex Rangers player quickly followed by Thompson from Preston, Shankley promoted a lad from the reserves who had been there for a while Gerry Byrne, Morrissey would have followed if we hadn’t stepped in and stole him for buttons Roger Hunt and The Flying Pig, Tommy Lawrenson were already there along Alf Arrowsmith who scored plenty before injury ruined his career, Everton matched them while Catterick, every bit as good as Shankley, was manager until ill health spoiled that spell.\nPaisley took over from the Scotsman and many Liverpool fans from that era will tell you he was a better manager than the man he helped to start the reformation at Anfield, he certainly won more than the Scotsman.\nSadly we never carried on the excellent work started by Sir John Moore’s who helped both clubs financially and some of his relations took over Liverpool while some would have absolutely nothing to do the man who bought Everton and didn’t have a clue how to progress them but knew how to keep ownership and we all, well a lot of us, regret the day he ever darkened our doors.\n49 Posted 17/08/2025 at 20:44:16\nNo, Danny, I’m sure you don’t, BUT I bet you DO see it as a free hit as we’re not likely to beat them?\nI hate derbies but the last couple of seasons, as bad as we’ve been, I’m astounded how that lot have become viewed as from another planet. They’re really not. They are beatable if teams start treating them as just another team. We don’t!\nI know a lot of “kopites” down here and they can’t understand how I just will not accept that they are a better side. I’ll never admit that to a bloody Kopite!\nOne of them today was trying to be nice and said we’ll be ok because we’re better than Leeds, Sunderland, etc. I said, “and Liverpool, we’re better than that shite” and they laughed and tried to argue.\nBut I’ll never admit it. Not to them!\nI wish the manager and the players would do the same!\nFcuk them!\n50 Posted 17/08/2025 at 21:56:29\nI agree about our fans maybe creating that extra pressure, although the obvious contradiction is that we have done a lot better against them at Goodison, rather than Anfield.\nWhen I said that Joe Royle, knew them better than they know themselves, it was because of how easy he found it to get under their skin, because he knows how bitter they are, imo.\nThe more they wanted to beat us, I think the harder they found it to do so, is how I remember the derby games under Joe Royle, and it was why I felt confident when we last beat them under Dyche.\nWe had just beat Forest, which meant that the pressure had suddenly come off our supporters because our team was suddenly safe from relegation, and I believe this took a lot of nervous energy out of our fans?\n51 Posted 17/08/2025 at 22:09:19\nIt would end up getting boring but I’d honestly play them every week, especially if I was lucky enough to be on the pitch.\nThe term free hit is normally associated with losers, so whenever we play Liverpool, one thought that never comes into my own personal mind, is that it’s a free hit, although in the game I mentioned above, I was glad that this is how our crowd seemed to approach that particular game, and it didn’t half seem to take the pressure out of the stadium, imho!\n52 Posted 17/08/2025 at 22:10:11\nTony, that’s an interesting perspective and I thought we looked quietly confident and assured in that 2-0 win. They missed a few glorious chances so perhaps there is something in what you say,\n53 Posted 17/08/2025 at 22:17:00\nAnd the irony of them waving half Everton-half-Liverpool scarves at us.\n54 Posted 17/08/2025 at 22:20:56\nWe are embarking on a journey in a stadium built on the breathtaking banks of the river.\nWe'll fecking build a team to match.\n55 Posted 17/08/2025 at 22:26:38\nI remember talking to a few of my American relatives from my mother’s side, at a family funeral. They had been to Anfield, for the fa cup game, when Pickford dropped another last minute clanger, allowing Van Dyke, to get in front of him and score a last minute winner in that cup tie.\nI didn’t know they were reds, but they said the highlight of the game for them all was when Sigurdson equalised for Everton, because they had never seen a crowd celebrate a goal, with such joy in their lives. Google it, it definitely shows you what it is to be a blue!\n56 Posted 17/08/2025 at 22:30:54\n57 Posted 17/08/2025 at 22:32:29\nIt’s much more of a leap to say there must be an endemic mind-set problem at the club coming from the hierarchy especially given certain managers have had teams that clearly didn’t have an inferiority complex, and the ownership of the club has switched a number of times over the decades implicated.\n58 Posted 17/08/2025 at 22:34:07\nThe 70s, like a decade, that's hardly over night..\nWe start clawing our way back on Monday, we do it 1 game at a time and if it takes a decade then it takes a decade - but we do it.\n59 Posted 17/08/2025 at 22:41:09\nI’m not so tentative with regards our mindset, I remember coming out of the stadium of light when we had just secured a semifinal against Liverpool at Wembley, and to this day,I genuinely think it was the finest support I think I’ve ever seen an Everton team receive.\nEvery single Evertonian in the crowd seemed to be rejoicing even more because we knew we had got a chance to beat Liverpool, in a massive game, and the only picture I had in my head was of the old Guinness advert of the time, that used to have a big harp, with the words “Believe” running through it.\nI asked my mate to ask his good mate Alan Stubbs, if he would ask our manager if I could do the teamtalk, because I had an opinion that the only thing that could beat us was fear, and that’s what I personally thought beat us in the end.\nKendall and Royle, are the only two managers that didn’t seem to fear Liverpool, imo, plus Carlo Ancellotti, who didn’t wait around for long. Who else have I missed from that list?\n60 Posted 17/08/2025 at 22:49:47\nI don’t think we have anything like enough information to make any conclusions about that.\n61 Posted 17/08/2025 at 22:58:28\nToo many of our fans accept a draw or a close defeat against that shower of fcuking bile because “we” (not me) accept were beneath them.\nWe should be the proverbial thorn in their side. We should go into every derby with a superiority complex. We should Fcuk the cnuts. They really are NOT all fcuking THAT!\nWe are too fcuking afraid of them.\nAnd they, should be afraid of US!\nThey’re cnuts.\nTheir fans are cnuts.\nTheir players are cnuts.\nTheir TV pundits and biased press corp are cnuts.\nAnd we should treat them like the cnuts they are and twat them every game instead of giving them the respect the cnuts don’t deserve.\nAs Tommy said, we are too subservient to the CNUTS!\n62 Posted 17/08/2025 at 23:31:31\nYou heard it here first.\n63 Posted 17/08/2025 at 23:38:47\n64 Posted 17/08/2025 at 23:39:27\nI was, until recently, a reliable, agricultural left back, finally finishing competitive footy at 66.\nAnd I could still replace Chris fcuking Woods at centre forward for Forest.\nHe is absolutely shite BUT gets clear chances in the box.\nDefenders should be ashamed of themselves!\n65 Posted 17/08/2025 at 23:56:28\n66 Posted 18/08/2025 at 00:22:38\nThey are cnuts!\nHave been since 1985.\nBefore that they were our neighbours and rivals.\nSince then, they are c**ts!\nKagsefoot\n67 Posted 18/08/2025 at 05:11:35\nAnd that's why it would never happen. Remember, it was Bobby Brown Shoes who invited HK to Finch Farm - his first visit. Moyes never wanted any ghosts of success anywhere near him.\nBack to Bobby's excellent post - the mentality across the park pervades top to bottom. How many times have they gone into the last 5 minutes of games losing, even injury time - and turned it around? The 2nd leg against Barcelona. Truly depressing.\nThe trouble is their fans truly believe \"it's our year\", or \"we'll do this\" - we call them delusional, but the reality is they've seen it before. As much as we have with late capitulations etc; they expect their outcome as much as we expect ours.\nDespite the occasional bell-endry behaviour of supporters (see the recent case in point versus Bournemouth - because the fan has been identified, operation Brush it Under the Carpet is in full swing), neutrals seem to love them, whereas the prospects for us in pre-season predictions? \"Maybe this will be the year the turd flushes\".\nTourist FC now have fans in the city who are unable to afford to go to the game (this is a general issue). But they are consoled by watching on TV a winning team. We have fans that bemoan the cost of tickets, the overall increase in costs associated with the new stadium, etc. Fuck it I've had to sign up for the Forever Blue thing (£60 or 2 minutes of Grealish's wages) just so I stand a chance of getting a ticket on my twice yearly visit to the UK!\nThe club needs to change from top to bottom, that includes all of us.\n68 Posted 18/08/2025 at 08:51:25\n69 Posted 18/08/2025 at 10:38:37\nThere can be many reasons for this but ultimately only really one true answer, FEAR ALWAYS COMES FROM WITHIN.\nGreat post Matt, I hadn’t read it before I replied to Si, but I totally agree that our club, has got to change from top to bottom, and the whole fabric and current demeanour has got to change.\nI wouldn’t want to be them I say, but it doesn’t mean that they shouldn’t be the yardstick, I also say. They win because they hate losing, and the last time I can remember Everton having a player who truly hated losing, was a very long time ago.\nPeter Reid, went awol, rather than get on a coach with Liverpool, after we inexplicably lost the double to them in 1986, but Peter Reid, demanded everything, and was such an ultra competitive footballer, who had an inbuilt desire TO FUCKING WIN\n70 Posted 18/08/2025 at 11:05:37\nI saw a comment from Neville Southall recently despairing about an attitude that regarded avoiding relegation, finishing in the top half etc as an achievement. Nev’s view was that every player should start pre-season focused on winning things - if not why bother?\n71 Posted 18/08/2025 at 11:30:56\nThe first was from his second debut when he scored the winner versus Stoke, which was played on a very warm day.\nWith Everton winning, Leighton Baines, got kicked with a few minutes left and he got straight back up to try and run it off. Rooney shook his head and was telling Leighton to go down, which is just basic professionalism, when you’re trying to see a game out.\nThe other story that was told, was that he went into FinchFarm on the Monday before we played Liverpool (the beginning of Derby Week) and he said the place was like a morgue.\nI’ve said I was made up with Tarkowski’s tackle at Anfield, and the first thing I thought when he flew in like a lunatic, was what Carragher, had said about the Everton players, of his generation.\nThey wanted to talk to us and be our mate, before the game? (If this isn’t showing fear, then it’s definitely not how Carragher allegedly felt) Not no fucking more hopefully and not just against Liverpool, because this should apply to every single game that we play.\n72 Posted 18/08/2025 at 11:51:22\nSo I can't work out whether Bobby Thomas agrees with my point or not? The one about being ruthless and rediscovering the club's identity by playing to win. Not to exist and be fucking nice and rolling over.\nRooney also said the attitude of the club was lacking – when he joined Man Utd and they drew a game, he asked where they were going out and got a bollocking. No more being also-rans.\n73 Posted 18/08/2025 at 12:23:23\nJoe Murray, another Everton fanatic, although born in Dublin, telling Jim Pearson after a Derby game: “ What the fuck was you doing coming on the pitch laughing and talking with those bastards? You'd never play for Everton again if I was in charge of the team!”\nSadly, Joe is no longer with us but what a true genuine Bluenose he was.\n74 Posted 18/08/2025 at 12:28:56\nAre they taking the piss? Seriously, £25M for someone who may have only played one or two Carabao Cup games for them???\nOh, it's okay, he played for Liverpool, so he must be good!!\n75 Posted 18/08/2025 at 12:34:37\nPlay off the shoulders of the centre-backs and get them turning and running towards their own goal.\n76 Posted 18/08/2025 at 12:37:41\n77 Posted 18/08/2025 at 12:37:56\n78 Posted 18/08/2025 at 12:42:37\nI couldn’t believe we got a draw, when we were robbed of a trip to Wembley, by that horrible welsh twat Clive Thomas, (they were my own thoughts at seven years of age!) because after listening to you slagging Pearson, it sounded like we would have been better starting the game with ten men!\nWe have seen some shite down the years, maybe we need to lighten the mood and all start picking our worst ever Everton eleven!\nOn second thoughts, nobody would agree and it would just lead to a load of arguing!\n79 Posted 18/08/2025 at 12:50:53\nI could carry on but I'm shaking my head like a Polaroid picture!\n80 Posted 18/08/2025 at 13:44:19\nChance will occasionally play a significant part but in the long run the players are either winners at heart or they are of a calibre that is more likely to break under pressure (which can come from a variety of sources).\n81 Posted 18/08/2025 at 15:55:33\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 7055,
  "scraped_at": "2026-02-14T02:09:18.616245",
  "_text_extracted": true
}