{
  "article_id": "ae88c948369f",
  "url": "https://www.justarsenal.com/full-review-of-arsenals-2022-23-season-month-by-month/341285",
  "title": "Full Month by Month Review of Arsenal 2022 / 23 season",
  "date": "20230602T120000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal Review – See how our season progressed month by month in 2022/23 by Dan Smith\nJune 2022\n9 players are released, including the end of Lacazette’s 5 year stay in North London.\nEddie eventually agrees a new deal with his salary and shirt number causing a debate among the fanbase.\nOur first signings of the summer were Marquinhos, Vieira and Turner. After months of speculation out of France, William Saliba does return to his parent club for pre-season after three seasons out on loan.\nJuly 2022\nWinning experience is added to our team with the arrivals of Champions Jesus and Zinchenko. As expected, Marseille triggers their option to make Guendouzi’s loan permanent. The midfielder publicly pleads for Saliba to do the same. We do continue our working relationship with the French side by loaning them Tavares.\nThe much-anticipated Amazon ‘All or Nothing’ Series is released, essentially documenting our failure to return to the Champions League. Arteta and Xhaka both come across well.\nOur manager does well to not become more mocked for preparing for a trip to Anfield by playing YNWA out of loudspeakers set up on the training pitch.\nSad to hear Vinai Venkatesham call 5th place a success.\nArsenal won every single pre-season tour game, and the Emirates Cup.\nAugust 2022\nFor the second season running the Gunners had the honour of kicking off the season on the Friday Night, winning 2-0 at Crystal Place, Saliba impressing on his debut.\nJesus got a brace in his Emirates debut in a 4-2 victory over Leicester.\nWins at Bournemouth (the debut of several songs) and a late win over Fulham (who we had just sold Bernd Leno) meant the Gunners had won their first 4 League matches for the first time since the 2004-05 campaign.\nWhat was apparent against the Cottagers, was the home crowd stayed with the players and were not downbeat despite conceding first.\nOff the pitch, Torreira was sold to Galatasaray while Balogun, Mari, Runarsson and Pepe were all loaned out. Pepe became the latest big money signing our manager has been allowed to just wash his hands of.\nSeptember 2022\nThe Gunners clearly wanted a DM to replace an injured Elneny as they submitted rejected bids for Douglas Luiz who had scored against us the night before in a 2-1 defeat at the Emirates.\nInstead, our only activity on transfer deadline day would be loaning out Maitland Niles and ripping up the contract of Hector Bellerin. Having played 239 times for us and won three FA Cups, the defender deserved to leave with more fanfare.\nSome Gooners were left worried if we had left ourselves enough experienced cover?\nWe lose our first game of the season at Old Trafford.\nOctober 2022\nWith the atmosphere the best it’s maybe ever been at the Emirates, Arsenal beat Spurs and then Liverpool, only the fourth time we have ever been able to win eight out of our first nine League fixtures.\nBack in Europe and playing twice a week, there were signs in the second half at Southampton that fatigue was setting in.\nIn our 5-0 rout over Forest the squad paid tribute to Pablo Mari by holding up his shirt post-match and after scoring. The defender had been stabbed in a supermarket, while on loan in Italy.\nNovember 2022\nA win at home to FC Zurich meant the Gunners won their Europa League group, meaning they advanced to the last 16.\nDomestically, wins at Chelsea and Wolves meant the Premiership was paused with us having a 5-point lead at the top of the table.\n10 Gunners were called up for the World Cup.\nDecember 2022\nOnly one Gunner got past the QF stage of the World Cup. William Saliba’s France reached the Final although the defender only played approx. 60 minutes in Qatar.\nIt meant that the majority of our squad actually got a rest in December that they wouldn’t have any other year. The biggest blow for Arsenal coming out of the tournament was an injury to Jesus.\nIn his absence, Eddie Nketiah has scored in the last two matches as had Saka who continued his international form domestically. The Gunners went into 2023 7 points clear of Man City.\nAny team who has had this many points after 16 games in the Prem Era has gone on to be Champions.\nJanuary 2023\nA day after City lost the Manchester Derby, Arsenal win in the League at the Lane for the first time since 2014 to go 8 points clear at the top of the table.\nOff the pitch Shakhtar Donetsk have suggested that Edu was in constant dialogue with Mudryk, our sporting director believing we were his first choice, to the point he could haggle over the asking price.\nMeanwhile Moises Caicedo released a statement online pleading with Brighton not to price him out of a move to the Emirates.\nSome Gooners therefore felt it was an anti-climax when we ended up with Trossard and Jorginho.\nThe Italian though offered much needed leadership to a young dressing room, with it noticeable how he would instruct his peers.\nTrossard meanwhile would record 11 assists compared to Mudryk’s 2 at Chelsea.\nFebruary 2023\nThe Gunners drop serious points this month, but more concerning are the performances. We don’t show up in Sean Dyche’s first game as Everton boss, are out of sorts in a 1-1 draw at Brentford (although we get an apology from those at Stockley Park forgetting to draw lines to see that Toney was offside for his equaliser. They forgot simply because …. they just forgot to do their job, and then we let the second half at home to Man City pass us by.\nAnything we psychologically lost during this spell we got back with the nature of our win at Villa Park. We were seconds away from more dropped points and a chance for Man City to overtake us when Jorginho’s long range strike in added time bounced off the bar, into Martinez’s head and into the back of the net.\nMarch 2023\nArsenal win their much talked about game in hand to go five points clear of Man City with both having played 25 games.\nSimilar to our win at Villa Park, Reiss Nelson’s winner against Bournemouth, in a game we were trailing 2-0, was seen as a moment where titles are won and lost.\nThe likes of Gary Neville accused Arsenal of playing with too much emotion, saying it’s a worrying sign with the months to come. The pundit also predicts that Man City are capable of putting a huge winning sequence together and that Arsenal will drop silly points\nTrossard gets a hat trick of assists at Craven Cottage.\nRamsdale is beaten from the halfway line leading to Sporting Lisbon to win the first ever penalty shoot-out at the Emirates. Tomiyasu and Saliba are injured this evening and don’t play again this season.\nSome Gooners feel with now just the league to focus on this could give us an advantage over Man City who are still fighting on three fronts.\nApril 2023\nArsenal starts the month going 8 points clear at the top of the table, they end it only two points above Man City, having played two more games than the Champions and our destiny no longer in our own hands.\nIn the first half at Anfield and the London Stadium we play some of our best football of the season racing into 2 goal leads. Both times we almost find it too easy and therefore can’t respond when the opposition pull a goal back.\nSaka misses a spot kick against the Hammers, Partey gives the ball away on the edge of his area to Rice, Ramsdale passes the ball to Alvarez for Southampton’s opener, Zinchenko doesn’t follow Walcott’s run. All these mistakes were clear evidence that mentally the title run in was too big a step.\nMay 2023\nOdegaard is sensational in wins over Chelsea and Newcastle. Victory over the Toon in particular a sign of maturity.\nWe fail to put Man City under any pressure though when we lose 3-0 at home to Brighton, a performance Arteta apologises for.\nOur shell-shocked manager then tries an experimental back 4 at the City Ground. A 1-0 defeat means Man City are champions and leaves question marks over the team’s mentality and leadership qualities.\nA 5-0 win over Wolves gives us our highest points total since we last won the Championship.\nNext season will see us back in the Champions League for the first time in 6 years.\nDan\nVideo – Alfie and Rob are back for the summer transfer window\nHere is their first analysis of the summer, where Alfie and Rob discuss and predict every single possible Arsenal incoming and outgoing this summer, including fees and potential destinations for outgoings.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 1497,
  "scraped_at": "2026-02-14T02:00:19.985990",
  "_text_extracted": true
}