{
  "article_id": "aec16870b1ad",
  "url": "http://www.geosuper.tv/latest/38783-uefa-to-honour-ronaldo-as-champions-league-all-time-top-scorer",
  "title": "UEFA to honour Ronaldo as Champions League all - time top scorer",
  "date": "20240827T171500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nAugust 27, 2024\nCristiano Ronaldo will be receiving an award from UEFA president Aleksander Ceferin as the all-time top-scorer of the Champions League, the European football governing body confirmed on Tuesday.\nRonaldo, 39, made history in Europe as he bagged 140 goals in 183 matches while playing for Manchester United, Real Madrid and Juventus and also lifted the elusive title five times, which is the second most by any player.\nThe 39-year-old lifted the title four times with Real Madrid (2014, 2016, 2017, and 2018) and once with Man Utd (2008). He is also the only player to score in three different finals (2008 against Chelsea, 2014 against Atletico Madrid and 2017 against Juventus).\nThe Portuguese great will be honoured at the 36-team league phase draw ceremony in Monaco on Thursday.\n“Cristiano Ronaldo, the all-time leading goalscorer in the UEFA Champions League, will be honoured with a special award from UEFA President Aleksander Ceferin in recognition of his remarkable legacy in the world’s most prestigious competition,” UEFA said in a statement.\n“Ronaldo’s achievements in Europe’s premier club competition – accomplished over the course of more than 18 years – will be recognised during the inaugural 2024/25 UEFA Champions League 36-team league phase draw ceremony, which will take place on Thursday 29 August at the Grimaldi Forum in Monaco.”\nRonaldo finished as the Champions League top-scorer in seven different seasons. He also holds the record for most goals in a single season, when he netted 17 goals during Madrid’s historic Champions League win in the 2013/14 season.\n\"Cristiano Ronaldo is one of the brightest stars in the UEFA Champions League constellation,\" Ceferin said in a statement.\n\"His extraordinary goal-scoring achievements in the competition seem destined to stand the test of time, posing a remarkable challenge for future generations to surpass.\"",
  "word_count": 302,
  "scraped_at": "2026-02-14T01:51:48.868721",
  "_text_extracted": true
}