{
  "article_id": "aef259fa2c92",
  "url": "https://www.fourfourtwo.com/features/most-expensive-british-transfers-ever-highest-fee-signing",
  "title": "Ranked ! The 10 most expensive British transfers ever",
  "date": "20230201T201500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! The 10 most expensive British transfers ever\nAlexander Isak became the most expensive British transfer of all time following his £130m move to Liverpool – these are who he beat to top spot\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nAlexander Isak is the most expensive signing in British football history following his £130 million transfer from Newcastle United to Premier League champions Liverpool.\nWith a great price tag comes great responsibility - but it doesn't mean it always works out, which is what Newcastle fans will be hoping after the summer's off-field drama. Some of the most expensive transfers in Premier League history were flops. Here, we've listed the top 10 all-time most expensive British transfers and explained how things went for the man in question.\nJust to be clear: these are the British record transfers, but they don't have to be British players; merely the highest fees paid for any player by a British club.\n10. Antony (Manchester United, 2022) - £85m\nManchester United were chasing Antony for months before finally tying him down to a contract, with former club Ajax playing hardball over the cost of their Brazilian winger. Eventually the fee stood at £80.75m, with £4.25m available in add-ons.\nAntony struggled to live up to his price tag at Old Trafford under Erik ten Hag and ultimately spent the second half of 2024/25 on loan at Real Betis, seemingly unfancied by Ruben Amorim.\n9. Mykhailo Mudryk (Chelsea, 2023) - £88.5m\nMudryk initially cost Chelsea £62m, with a further £26.5m added to his figure by former club Shakhtar Donetsk in add-ons and clauses. The Blues winger has just five goals and six assists in over 50 Premier League outings but won't be making an appearance any time soon.\nThe Ukrainian was provisionally suspended by the FA in December 2024 after failing a drugs test and could face a ban of up to four years. He remains contracted at Stamford Bridge until 2031 and has not played since November 2024.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n8. Paul Pogba (Manchester United, 2016) - £89m\nPogba's arrival at Old Trafford in 2016 remains arguably the most galactico moment in Premier League history.\nThe Frenchman had turned his back on United's academy to join Juventus as a 19-year-old. In Turin, he quickly evolved into one of the most coveted box-to-box midfielders in Europe. His flair, eye for a pass and bankability made him an obvious fit at Old Trafford, and the Premier League giants made the difficult decision to buy their former player back for a world record fee in 2016.\nIt hasn't always been plain sailing. Pogba repeatedly clashed with Jose Mourinho, while rumours were abound for years about his impending exit from the club. Finally, he left in the summer of 2022, re-joining Juventus - for free - once again.\n7. Romelu Lukaku (Chelsea, 2021) - £97.5m\nLukaku re-joined Chelsea for a massive fee in the summer of 2021, after two superb years in Italy with Inter Milan, but the Belgian struggled to live up to the price tag and eventually moved back to Inter on a season-long loan.\nMid-season grumblings certainly didn't help his cause, while interviews conducted to Italian media ensured former Chelsea boss Thomas Tuchel left him out of squads, seeing Lukaku tumble down the pecking order.\nThe £97.5m fee fell just short of the British transfer record, but made the striker the player with the largest total transfer value of all time, as a combined £290m has been spent on him by various clubs over the years.\n6. Jack Grealish (Manchester City, 2021) - £100m\nGrealish arrived in Manchester after a summer in which he was possibly England's most adored player en route to the Euro 2020 final, even though he only made one start during the tournament.\nHaving appeared close to signing for rivals Manchester United in the past, there will be no sense that he has joined for the love of the club – a heartfelt letter to Villa fans upon his departure shows where his affections lie – but a determination to win trophies.\nWhile he initially struggled to adapt to Pep Guardiola's methods, Grealish has now started playing back to his best. He has already added medals to his collection, too, with more likely on the way.\n5. Declan Rice (Arsenal, 2023) - £105m\nDeclan Rice swapped West Ham for Arsenal in 2023 and has wasted no time in making himself a fan favourite at the Emirates' Stadium. In 2024/25, Rice scored a pair of free-kicks in a 3-0 Champions League win over Real Madrid, etching his name into Arsenal folklore.\nThe England international is a future Gunners skipper in the making.\n4. Enzo Fernandez (Chelsea, 2023) - £107m\nAfter a drawn out transfer saga in the January 2023 window, Chelsea eventually met Benfica's £107m release clause inserted into Fernandez's contract, ensuring he would move to Stamford Bridge just six months after joining the Portuguese giants for less than £15m from River Plate.\nHe excelled at the World Cup with Argentina, though, winning the tournament and the Young Player award, too.\n3. Moises Caicedo (Chelsea, 2023) - £115m\nCaicedo was at the centre of a transfer tug-of-war between Liverpool and Chelsea back in the summer of 2023, one which the Blues eventually won. Brighton received an initial fee of £100 million, potentially rising to £115 million with future add-ons and performance clauses.\nThe Ecuadorean has made himself a stalwart of the Chelsea midfield since arriving at Stamford Bridge and is continuing to thrive under Enzo Maresca.\n2. Florian Wirtz (Liverpool, 2025) - £116m\nThe Germany international hadn't made an appearance in English football before becoming the most expensive player ever signed by an English club earlier this summer. Liverpool made Wirtz their first statement signing of 2025, before adding Eintracht Frankfurt's Hugo Ekitike (£79 million) later in the window and finishing with no.1 in this list.\nWirtz wears the No. 27 shirt for the Premier League champions.\n1. Alexander Isak (Liverpool, 2025) - £130m\nIsak's Liverpool move only went through on transfer deadline day after a protracted pursuit by the Reds.\nNewcastle weren't willing to sell their prized asset, but the Swedish international dug his heels in releasing a statement outlining his relationship with the club was irreparably severed. Isak eventually got his move, much to the delight of Liverpool fans, supplementing an already formidable strike-force.\nEd is a staff writer at FourFourTwo, working across the magazine and website. A German speaker, he’s been working as a football reporter in Berlin since 2015, predominantly covering the Bundesliga and Germany's national team. Favourite FFT features include an exclusive interview with Jude Bellingham following the youngster’s move to Borussia Dortmund in 2020, a history of the Berlin Derby since the fall of the Wall and a celebration of Kevin Keegan’s playing career.\n- Joe DonnohueSenior Digital Writer\n- Ryan DabbsStaff writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1286,
  "scraped_at": "2026-02-14T01:59:41.726194",
  "_text_extracted": true
}