{
  "article_id": "aefc0b2ea1f2",
  "url": "https://www.empireofthekop.com/2025/02/12/lineker-richards-klopp-slot-debate/",
  "title": "Gary Lineker and Micah Richards would rather play for Klopp than Slot",
  "date": "20250212T193000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have been blessed to have Jurgen Klopp and Arne Slot as their two most recent managers (or head coach in the Dutchman’s case), with the duo both receiving plenty of well-deserved plaudits for their work at Anfield.\nThe Reds were a lowly 10th in the Premier League when the German took charge in October 2015 – within five yeards he’d turned them into English, European and world champions, with three domestic cups added to the CV thereafter.\nThe 57-year-old left the club in a rude state of health when handing over the reins to the ex-Feyenoord boss last summer, with the incumbent head coach on track to plausibly win the top-flight title and the Champions League in his first season in charge.\nPundits ponder difficult Klopp/Slot question\nIn the latest episode of The Rest Is Football podcast, Gary Lineker and Micah Richards were asked which of Klopp and Slot they would prefer to play under, if given a choice between the two. Neither pundit found it a particularly easy question to answer, but both eventually opted for the German.\nThe ex-Manchester City defender replied: “I’m gonna say Klopp because he’s got to three Champions League finals, the high energy, winning the Premier League. I don’t mind a bit of tough love as well and I think Klopp’s got that, so I’m gonna say Klopp.”\nThe Match of the Day host concurred: “I always said I’d love to play for Klopp because of his dynamic high-grade football, the gegenpress, created a lot of chances, scored a lot of goals, but I’ve enjoyed Slot’s game.\n“I’d probably say Klopp, only because of the amount of time that he’s served. Ask me again in three years’ time and we might be saying that Slot is the absolute best, but they’ve certainly got two exceptional coaches there.”\nLiverpool have been blessed with both Klopp and Slot\nWith little transfer activity either into or out of Anfield last summer, everyone in the current Liverpool squad except for Federico Chiesa will have had experience of working under both Klopp and Slot, and their opinions on the two coaches would be compelling to hear.\nWhat can’t be disputed is that both men have proven more than up to the challenge of leading one of the biggest clubs in world football, with the German transforming the Reds’ fortunes and the Dutchman hitherto making light work of the unenviable task of living up to his illustrious predecessor.\nIt’s still much too early to make a definitive judgement on the current boss, who’s yet to complete a full season at Anfield whereas the previous manager was there for eight-and-a-half years.\nHowever, should Slot go on to win the Premier League and Champions League by the end of May, he’d already be well on his way to potentially emulating Klopp’s legacy at Liverpool, no easy feat considering the impact that the 57-year-old had on Merseyside from an emotional point of view as well as the results he achieved.\nWhen you look at some of the ill-fated managerial appointments at other ‘big 6’ English clubs over the past few years, we can be grateful that FSG got it so right with the last two men they hired for that job in L4. We’d be more than happy to play under either of them, if hypothetically we had that opportunity!",
  "word_count": 558,
  "scraped_at": "2026-02-14T01:58:05.351810",
  "_text_extracted": true
}