{
  "article_id": "aeff7076cf3c",
  "url": "https://www.ariananews.af/ronaldo-v-messi-the-last-dance-in-saudi-arabia-or-a-fresh-start/",
  "title": "Ronaldo v Messi : the last dance in Saudi Arabia or a fresh start ? ",
  "date": "20230119T170000Z",
  "domain": "ariananews.af",
  "source_country": "Afghanistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sport\nRonaldo v Messi: the last dance in Saudi Arabia or a fresh start?\nThe rivalry between Lionel Messi and Cristiano Ronaldo dominated football for more than a decade and the world will on Thursday get the chance to see another contest between the Portuguese and Argentine, which may not be the last time they face each other.\nAfter 20 years in Europe’s top leagues, Ronaldo has taken his talents to Saudi Arabian side Al-Nassr after his contract with Manchester United was terminated and ironically his first match in the Middle East will be against his age-old rival, Reuters reported.\nMessi’s Paris St Germain take on a combined Al Hilal-Al Nassr team in an exhibition match, giving Ronaldo and Messi a chance to rekindle their old ‘El Clasico’ rivalry when they played for Real Madrid and Barcelona, respectively.\nWith nothing for Messi left to prove in Europe or on the international stage, there is also speculation that Al Hilal want to bring the 35-year-old to Saudi Arabia when his PSG contract expires at the end of the season, Reuters reported.\nMohammed Al-Jadaan, Saudi Arabia’s Minister of Finance, had recently indicated that the door was open for moves by Saudi clubs to try and sign both of soccer’s biggest stars.\n“Well we talked about that before and the quality of life is a critical part of the 2030 vision and quality of life in Saudi has improved, sports is a significant part of that,” he told CNBC when asked about Ronaldo or Messi moving to the country.\n“The young population of Saudi watch sports and perform sports and anything we can do to enhance this industry will pay back and improve the quality of life not only for our people but for the working people from outside.”\nMessi and Ronaldo won every Ballon d’Or award from 2008-2017 until Real Madrid midfielder Luka Modric broke their hegemony and the Argentine has since won two more to lead 7-5 over his Portuguese rival in the race to be the world’s best player, Reuters reported.\nWhen the pair first faced off in 2008 as young upstarts looking to make their mark, Manchester United and Barcelona played out a 0-0 draw in the Champions League.\nSince then they have never both been involved in a goalless draw for their clubs and national teams in memorable matches with millions tuning in to witness the greats in their prime.\nThe spotlight was on the pair at the World Cup in Qatar last year but whereas Ronaldo faded and was left out of Portugal’s starting lineup in the knockout stages as they were eliminated in the quarter-finals, Messi went on to lift the trophy.\nMessi became the first player ever to score in every round at a World Cup and finished with seven goals as he completed his trophy collection and was named player of the tournament, Reuters reported.\nShould the Argentine move to Saudi Arabia, Thursday’s encounter between the sport’s two biggest stars of the modern era could signal the dawn of a new age in Asian football.\nSport\nWinter Olympics 2026: Wednesday brings records, first-ever golds and thrilling action\nAudiences in Afghanistan have been able to follow all the action live, as ATN holds exclusive broadcast rights to the Winter Olympics, with events aired nationwide on Ariana Television.\nWednesday’s competitions at the 2026 Winter Olympics in Milan-Cortina delivered a packed schedule of medal events, record-breaking performances, and historic firsts, keeping fans on the edge of their seats.\nAcross speed skating, biathlon, luge, figure skating, and other winter disciplines, the day showcased the depth and diversity of talent at the Games.\nSpeed Skating Record\nIn one of the standout moments of the day, Jordan Stolz of the United States captured gold in the men’s 1,000m speed skating, setting a new Olympic record. Stolz’s performance marked a breakthrough on the world stage and established him as one of the sport’s emerging stars.\nHistoric Luge Gold for Italy\nOn home ice, Italian duo Andrea Voetter and Marion Oberhofer made history by winning the first-ever women’s doubles luge gold medal. Their victory delighted local fans and added a memorable chapter to Italy’s Olympic story, highlighting the host nation’s strength in sliding sports.\nBiathlon Brilliance\nFrench athlete Julia Simon claimed gold in the women’s 15km individual biathlon, demonstrating remarkable accuracy and resilience in challenging snow conditions. Her performance underscores France’s continued strength in Nordic disciplines and sets the stage for further excitement in upcoming biathlon events.\nFigure Skating Excellence\nIn ice dance, France’s Laurence Fournier Beaudry and Guillaume Cizeron claimed the top podium spot, while American favorites Madison Chock and Evan Bates earned silver in a tightly contested free dance final. Fans were treated to a display of precision, artistry, and athleticism, reflecting the high level of competition in this marquee Olympic sport.\nWednesday also featured intense competitions in alpine skiing Super-G, Nordic combined, women’s moguls, and doubles luge, keeping spectators engaged across multiple venues. Each event underscored the Olympics’ commitment to showcasing a broad range of winter sports and the exceptional skill of the athletes representing their nations.\nExclusive Coverage in Afghanistan\nAudiences in Afghanistan have been able to follow all the action live, as ATN holds exclusive broadcast rights to the Winter Olympics, with events aired nationwide on Ariana Television. This allows Afghan viewers to witness key moments, record-breaking performances, and historic wins as they happen, bringing the excitement of the Games directly to homes across the country.\nAs the Milano-Cortina Winter Olympics continue, fans can expect more thrilling stories, emerging stars, and unforgettable moments, with each day adding new highlights to a Games already rich in drama and achievement.\nSport\nAFC U17 Men’s Asian Cup Saudi Arabia 2026 Draw sets stage for continental showdown\nThe final draw for the AFC U17 Men’s Asian Cup Saudi Arabia 2026 took place today, Thursday February 12, confirming the group-stage line-up for Asia’s premier youth football tournament and setting the stage for a highly competitive continental battle.\nSixteen teams have been drawn into four groups of four, with each side aiming not only for continental success but also qualification for the FIFA U17 World Cup Qatar 2026. The top two teams from each group will advance to the quarterfinals and secure their places at the global showpiece.\nHosts Saudi Arabia headline the tournament as top seeds, joined by Asia’s leading youth football nations and several emerging teams that impressed during the qualification phase. The draw balanced traditional powerhouses with ambitious newcomers, promising closely contested matches throughout the group stage.\nScheduled to take place from May 5 to May 22, 2026, the 21st edition of the AFC U17 Men’s Asian Cup will once again serve as a key platform for the continent’s brightest young talents to showcase their potential on the international stage.\nWith the groups now confirmed, preparations intensify as teams turn their focus toward tactical planning and squad development ahead of what is expected to be a thrilling tournament in Saudi Arabia.\n- Group A: Saudi Arabia, Tajikistan, Thailand, Myanmar\n- Group B: Japan, Indonesia, China, Qatar\n- Group C: South Korea, Yemen, Vietnam, UAE\n- Group D: Uzbekistan, Australia, India, North Korea\nSport\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\nFollowing two consecutive losses, Afghanistan currently sit third in Group D with a net run rate of -0.555.\nAfghanistan’s campaign in the ICC Men’s T20 World Cup has taken a serious hit after suffering back-to-back defeats, leaving fans concerned about the team’s chances of progressing to the semi-finals.\nFollowing two consecutive losses, Afghanistan currently sit third in Group D with a net run rate of -0.555.\nNew Zealand and South Africa lead the group standings with four points each from two matches.\nWith four matches scheduled per team in the group stage, only the top two sides will advance to the next round.\nDespite the setbacks, Afghanistan have not yet been eliminated from the tournament. However, their path to qualification has become significantly more complicated.\nTo secure a place in the Super 8 stage, Afghanistan must win their remaining two matches against the United Arab Emirates and Canada — and do so by substantial margins to improve their net run rate. At the same time, they will need either New Zealand or South Africa to suffer heavy defeats in their remaining group fixtures.\nIf these conditions are met, Afghanistan could still break into the top two based on a superior net run rate. While the scenario is challenging, qualification remains mathematically possible — keeping Afghan hopes alive in the tournament.\n-\nSport5 days ago\nChampions League Elite action continues as qualification race tightens\n-\nInternational Sports4 days ago\nIPL 2026: Franchise sales gather pace as global investors circle teams\n-\nSport5 days ago\nEarly medal leaders emerge as Winter Olympics continue in Italy\n-\nLatest News5 days ago\nTerrorist activities observed along Afghanistan borders, says Lavrov\n-\nLatest News5 days ago\nPakistan president claims situation in Afghanistan is ‘similar to or worse than pre-9/11’’\n-\nSport2 days ago\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\n-\nBusiness4 days ago\nUzbekistan approves feasibility study agreement for Trans-Afghan Railway\n-\nBusiness3 days ago\nAfghanistan signs 845MW Power deal with Azizi energy; Baradar meets company Chief to advance investment plans",
  "word_count": 1549,
  "scraped_at": "2026-02-14T02:16:35.982099",
  "_text_extracted": true
}