{
  "article_id": "af070d163360",
  "url": "https://www.themag.co.uk/2023/03/eddie-howe-wants-scott-mctominay-and-at-least-four-other-summer-signings-report-newcastle-united-manchester-united/",
  "title": "Eddie Howe wants Scott McTominay and at least four other summer signings - Report",
  "date": "20230322T031500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe wants Scott McTominay and at least four other summer signings – Report\nNewcastle United are now targeting Scott McTominay ahead of the summer transfer window.\nReported as an ‘Exclusive’ by The Telegraph, they say that Newcastle first expressed an interest in the midfielder in January after hearing the Scotland international was concerned about how little time on the pitch he is getting under Erik ten Hag.\nThis new exclusive / report saying that Eddie Howe is now determined to go back in for Scott McTominay once the summer window opens.\nThe midfielder was getting progressively more game time at Manchester United before ten Hag’s arrival.\nThese past three full seasons, had seen Scott McTominay start 20 Premier League matches in 2019/20, then 24 PL starts in 2020/21, with 28 Premier League starting elevens last (2021/22) season.\nHowever, the new manager has only started McTominay seven times this season in the Premier League and only one of those in these past five and a half months, since 2 October 2022. The writing is clearly on the wall, Scott McTominay only starting once this season in the Europa League as well.\nBruno Fernandes, Casemiro, Christian Eriksen and Fred are all obviously ahead of him in the pecking order now. With Erik ten Hag even bringing in January loan signing Marcel Sabitzer to play ahead of Scott McTominay, whose last PL match was back in January.\nThe Telegraph say that their information is that Eddie Howe sees Scott McTominay as a player he can further improve and that the midfielder has the physical attributes to succeed in his preferred system at Newcastle United.\nThe report saying that the NUFC Head Coach sees the 26 year old as somebody able to play the defensive midfield role, which would then allow Bruno to play further up the pitch in more dangerous areas.\nThe exclusive stating that Scott McTominay has actually been on the NUFC wish list for this past year, with Eddie Howe, Chief Scout Steve Nickson and Sporting Director Dan Ashworth all in agreement that he would be a great addition.\nIn the summer, the Scotland international will have two years left on the five year Man U contract he signed back in 2020.\nThe Telegraph also report that as well as Scott McTominay, Eddie Howe wants to add at least another four or five new signings on top of the Man U midfielder, especially with almost certainly European football as well to play next season.\nThe Telegraph name Arsenal left back Kieran Tierney as another on Eddie Howe’s target list this summer.\nHe is also in the right age range, set to turn 26 in June. Plus he isn’t, the same as Scott McTominay, getting much game time.\nTierney was available for 24 Premier League matches last season and started 20 of them, on the bench the other four. This season he has also fallen out of favour and despite having been available for every Premier League match, has started only four and been named 24 times on the bench, with Zinchenko now first choice.\nAs to just how ambitious overall, Eddie Howe and the Newcastle United owners will / can be, much will depend on what kind of European competition they will be involved in. Champions League will of course lead to a massive increase in cash directly (prize money etc) and indirectly (sponsorship deals etc), plus make the club even more attractive to new signings.\nShadow plans / ideas currently getting put in place but it will be May when these will be firmed up and Newcastle United then will start going after the preferred targets.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 621,
  "scraped_at": "2026-02-14T01:48:06.477435",
  "_text_extracted": true
}