{
  "article_id": "af16c8d72ed2",
  "url": "https://metro.co.uk/2025/09/26/enzo-maresca-sends-message-axel-disasi-chelsea-return-amid-injury-crisis-24273219/",
  "title": "Enzo Maresca sends message to Axel Disasi over Chelsea return amid injury crisis",
  "date": "20250926T184500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Axel Disasi will not be considered for selection and will remain frozen out of the Chelsea squad despite their injury crisis in defence.\nThe Blues suffered an early blow to their plans for their season when they lost Levi Colwill to a major knee injury in August with the England international expected to miss most of the season.\nAhead of a crucial run of games starting at home to Brighton on Saturday, Chelsea will be without Tosin Adarbaioyo and Wesley Fofana with the pair also set to miss the Champions League game against Benfica midweek and the trip to Liverpool next weekend.\nFofana is not available for 12 days with Chelsea following concussion protocols following his head injury in the Carabao Cup win over Lincoln City on Tuesday.\nTosin meanwhile is nursing a calf injury which rule him out until after the October international break.\nAnother centre-half in Benoit Badiashile is still to play this season, back in training after injury but still not fit to return to action.\nTrevoh Chalobah has been in impressive form this season while 19-year-old Josh Acheampong is expected to be available tomorrow after missing the Lincoln game through illness.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nDisasi, a player Chelsea signed for £39million from Monaco just two years ago, spent the summer exiled from the first-team, part of the club’s ‘bomb squad’ deemed surplus to requirements.\nWhile Chelsea were able to move on a number of players not part of their plans, Disasi and Raheem Sterling remain in west London after they were unable to secure moves away.\nMore Trending\nMaresca has not seen or spoken to either player this season and both have been kept entirely separate from the team, training and eating alone and at different times to the rest of the squad.\nEven with four centre-halves unavailable for a crucial week, there are no plans for Disasi’s situation to change.\n‘There is not any information from the club to consider that, so at the moment he is not an option,’ Maresca told a press conference on Friday when asked about the possibility of the Frenchman returning to the fold.\nDisasi spent the second-half of last season out on loan at Aston Villa but despite interest from other Premier League sides failed to secure another move away from west London in the summer transfer window.\nMORE: £71m Man Utd star warned Brentford clash will be ‘unenjoyable’ for him\nMORE: Mikel Arteta speaks out on shocking Billy Vigar tragedy\nMORE: Amad Diallo to miss Manchester United clash vs Brentford after death in family",
  "word_count": 477,
  "scraped_at": "2026-02-14T02:26:56.620759",
  "_text_extracted": true
}