{
  "article_id": "af173784d7bd",
  "url": "https://www.manutd.com/en/news/detail/former-man-utd-goalkeeper-edwin-van-der-sar-receives-prestigious-eredivisie-award",
  "title": "Former Man Utd goalkeeper Edwin van der Sar receives prestigious Eredivisie award",
  "date": "20240903T134500Z",
  "domain": "manutd.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Van der Sar honoured with prestigious Eredivisie award\nManchester United legend Edwin van der Sar was honoured with the Eredivisie Oeuvre Award on Monday, recognising his services to Dutch football.\nVan der Sar, 53, had a decorated career spanning 21 years - six of which were spent at United - and moved into Ajax's marketing department after retiring, one year after he hung up his gloves.\nEdwin progressed to become the CEO of the Amsterdam club in 2016 and enjoyed further success in that role as the club dominated the Eredivisie.\nVan der Sar received his special award at a ceremony in Utrecht on Monday and the four-time Dutch Goalkeeper of the Year was honoured with a special video, featuring the likes of Sir Alex Ferguson and Ruud van Nistelrooy, who issued heartfelt messages to the legendary shot-stopper.\nEredivisie CV director Jan de Jong said: \"Edwin van der Sar is a proven winner. His trophy cabinet is bursting with silverware and is the envy of many a collector, jeweller and museum. He has always epitomised a down-to-earth, ‘just act normal’ mentality. He certainly didn’t achieve what he has without hard work; he fought incredibly hard to reach the very top and remain there for so long.\n\"Last year, he was hit by major sporting and physical setbacks [when suffering a brain haemorrhage]. Thankfully, he seems to have made a miraculous recovery, one that typifies Edwin’s character. He has a warm personality and is genuinely interested in other people. Simply put, he is a great sports executive. Yet he is always ice cool under pressure, a mentality that enables him to remain calm and in control. Edwin assumed and carried the responsibility of running one of the biggest clubs in Europe, while devising sky-high ambitions when others dared not to.\n\"He never took the easy option of watching from the sidelines; he fought from the heart of the Arena to transform the culture of the club. Edwin didn’t have to do this. He wanted to. Having worked so hard to achieve this change, he nearly paid a very heavy price.\"\n\"As well as being a fantastic keeper, he is, above all, a gem to be cherished and an incredible ambassador for Ajax, the Dutch national team and the Eredivisie. He helped put Ajax back on the world football map, first in the 1990s and, then again, in recent years when they reached the semi-final of the UEFA Champions League.\n\"He is a world-famous figure and a legend of the beautiful game. He is able to kick down barriers that remain closed for others. As an accomplished diplomat, he helped ensure that, in the best interests of Dutch football, the UEFA Europa Conference League was launched. Partly thanks to his efforts, the Netherlands currently stands sixth in the UEFA rankings. This illustrious background, as well as the huge number of prizes he’s won, make Edwin a deserved winner of the Eredivisie Oeuvre Award.\"\nCongratulations, Edwin. You deserve it!",
  "word_count": 496,
  "scraped_at": "2026-02-14T02:08:12.430950",
  "_text_extracted": true
}