{
  "article_id": "af3ab3e82798",
  "url": "https://www.teamtalk.com/news/arsenal-tormentor-radar-man-utd-aston-villa-threat-ucl-side-rises-rapidly",
  "title": "Arsenal tormentor on radar of Man Utd , Aston Villa as threat to UCL side rises rapidly",
  "date": "20240225T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal tormentor on radar of Man Utd, Aston Villa as threat to UCL side rises rapidly\nManchester United, Aston Villa and West Ham have all reportedly joined the Premier League sides that are interested in Alan Varela after he tormented Arsenal in the Champions League.\nVarela’s stock is rising rapidly mid-way through his first season in Europe. The Argentine played over 100 games for Boca Juniors before making the move to Porto for approximately £9million in the summer.\nThe holding-midfielder is a useful defensive asset, while also possessing good ball-playing qualities, and he’s also adding an attacking element to his game.\nIndeed, he’s scored twice and assisted twice in 27 games for Porto, putting him on the same amount of goals he scored for Boca, and just two assists below his tally for them, despite having played 84 games fewer.\nVarela’s performance against Arsenal in the Champions League round of 16 put him on the map.\nIndeed, the Gunners made it to the knockouts for the first time since 2016/17, but were stopped from having a single shot on target in their first game back there.\nPorto’s Varela won man of the match for his role in keeping the proficient Gunners attack at bay.\nHe’s got some big sides sniffing around him as a result of his useful Champions League knockout debut.\nDON’T MISS: Man Utd in pole position to sign quality Tottenham, Aston Villa target after star is put up for sale\nMan Utd, Villa after Varela\nIndeed, according to Record (cited by One Football) Aston Villa are locked in a three-way battle for the midfielder.\nIndeed, they state Manchester United and West Ham are both interested in the 22-year-old.\nVilla’s only genuine holding-midfielder is Boubacar Kamara, who’s suffered two big injuries since joining the club, and that might lead them to be wary about his long-term fitness.\nFor United, Casemiro is regularly linked with a move away from Old Trafford, meaning a spot in the midfield could open up.\nEither of those sides would seem to have a better chance than West Ham of securing the transfer, so if they both go for him, it’ll be interesting to see who comes out on top, especially as he reportedly has a £60million release clause, meaning if both trigger it, the decision could come down to Varela himself.\nVilla are fourth in the Premier League and might be able to offer Champions League football next season, while United are a historically big side who seem to be back on their way up, so there is an appeal to both clubs.\nPrem giants previously linked\nBoth Liverpool and Manchester City have also been linked with Varela previously.\nIndeed, it was said in January that the Reds had ‘opened talks’ with Porto over the signing for the summer, while Pep Guardiola was reported to be looking at him as a replacement for Kalvin Phillips, who looks as if he has no place at the Etihad.\nIf both of those sides remain interested come the summer, there could be a battle for Varela’s signature.\nThe £60million release clause means sides will have to hope the midfielder is inspired by the project and the personal terms that are offered to him.\nREAD MORE: Major Aston Villa star’s time is up, with exit decision made for understandable reason",
  "word_count": 553,
  "scraped_at": "2026-02-14T01:56:44.618502",
  "_text_extracted": true
}