{
  "article_id": "af6db6f24d77",
  "url": "https://www.namibian.com.na/spanish-great-iniesta-leaves-indelible-legacy-after-retirement/",
  "title": "Spanish great Iniesta leaves indelible legacy after retirement",
  "date": "20241009T001500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Andres Iniesta scored the most important goal in the history of Spanish football, winning his country the World Cup for the first time in 2010.\nThe playmaker called time on a sensational career on Tuesday aged 40, most of which he spent pulling the midfield strings for Barcelona’s most decorated side.\nAdmired and adored in Spain, even by fans of Barca’s fiercest rivals, for many Iniesta will go down as the country’s finest player.\nHe was a key figure in the La Roja generation which won two European Championships, either side of their World Cup triumph.\nIniesta came through Barcelona’s feted La Masia youth academy, joining the club aged 12, departing 22 years later, shining brightly across 16 seasons with the Catalan giants’ first team.\nThe midfielder, who formed a midfield trio with Xavi Hernandez and Sergio Busquets for a significant part of that spell and linked brilliantly with Lionel Messi, won four Champions Leagues, nine La Liga titles and six Copas del Rey among 32 trophies with Barca.\nAfter finishing at Camp Nou with a domestic league and cup double, Iniesta joined Japanese side Vissel Kobe.\nThe playmaker won the J1 League in 2023 as well as two other trophies, before spending last season at Emirates in the United Arab Emirates.\nIniesta was liked for his humility but above all, the elegance, creativity and magic he was capable of on the pitch.\nDespite not being a great goalscorer, the largely selfless midfielder scored a handful of great goals, the most memorable being his World Cup-winning strike against the Netherlands in extra time in Johannesburg.\nFour minutes before the showdown would have gone to penalties, Iniesta controlled Cesc Fabregas’ pass and as the ball sat up nicely for him, smashed it past Dutch goalkeeper Maarten Stekelenburg.\nIniesta ripped off his shirt in celebration, revealing a handwritten tribute on his vest to the late Dani Jarque, Espanyol’s captain and a close friend of his, who died of a heart attack aged just 26 in August 2009.\nAnother Iniesta strike which lives long in Barca fans’ memories was his drive from outside of the box against Chelsea in the 2009 Champions League semi-finals.\nWith Barcelona trailing by a goal in the second leg, Iniesta sent a spinning effort into the top corner from outside the area, sending Pep Guardiola’s team into the final.\nLegacy in football\nThe Catalans went on to win the Champions League to complete the first treble in the club’s history — eventually it was a sextuple.\nIniesta’s goal helped Barcelona become a team some consider the best ever, arguably helping to change the future of the sport itself, given that side’s significant legacy.\n“You’re going to retire me, but he’s going to retire us all,” Guardiola told a young Xavi after watching an even younger Iniesta, just 15, at a youth tournament.\nThe midfielder played nearly 700 matches for Barcelona and in the latter stages of his time in Spain was applauded at away grounds across the country.\nIniesta helped Barca conquer another treble under Luis Enrique in 2015, with the coach comparing the playmaker to the boy wizard Harry Potter.\n“One, two, three and whoosh… he’s past the player, it’s like he has a magic wand,” said the former Barca and current Paris Saint-Germain manager.\nIt was not a trouble-free ride to the top for Iniesta, born in the province of Albacete, who had to battle homesickness after joining La Masia around 500 kilometres away. He cried daily and wrote in his book “The Artist” that he felt “abandoned”.\nIniesta battled demons with the help of psychologists after Jarque’s death and some troubling injuries, admitting he had “lost the will to live”.\nHowever he came back from the brink and continued to delight La Liga fans until departing for a new, lucrative adventure in Japan in 2018.\n“For me Andres is the most talented player in the history of Spain — he has a spectacular amount of talent,” wrote Xavi in an open letter to Iniesta when he left Barcelona.\n“If we talk about the person, I wouldn’t know where to start.\n“He is admirable in all senses, an example for others and the personification of a team player.”\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 806,
  "scraped_at": "2026-02-14T02:08:12.416431",
  "_text_extracted": true
}