{
  "article_id": "af75978a9500",
  "url": "https://www.france24.com/en/live-news/20230415-aston-villa-trounce-newcastle-to-close-on-premier-league-top-four",
  "title": "Aston Villa trounce Newcastle to close on Premier League top four",
  "date": "20230415T161500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa trounce Newcastle to close on Premier League top four\nBirmingham (United Kingdom) (AFP) – Aston Villa blew the race for a top-four finish in the Premier League wide open as Ollie Watkins scored twice in a convincing 3-0 win over Newcastle on Saturday.\nIssued on: Modified:\nJacob Ramsey was also on target as sixth-placed Villa closed to within six points of Newcastle in third thanks to a seventh win in eight games.\nThe Magpies first defeat in six games means Tottenham can move level on points should they beat Bournemouth later on Saturday, ahead of a clash between the sides next weekend.\nBut Unai Emery's men are the form side in the battle for a place in next season's Champions League after taking 22 points from the last possible 24.\n\"It was a really, really fantastic day,\" said Emery.\n\"Our progress is clear, trying to be comfortable here (at home), trying to be consistent here. We did our game plan for 90 minutes, focusing and keeping our good individual performances like we need.\"\nJust staying in the Premier League was Emery's first task when he was appointed in October with Villa just one point above the relegation zone.\nThe former Arsenal and Paris Saint-Germain boss has inspired an incredible turnaround and Newcastle never recovered from an explosive start by the home side at Villa Park.\nVilla have scored in all 20 games under Emery and could have been three up inside 15 minutes.\nJust 28 seconds were on the clock when the in-form Watkins sprinted behind the Newcastle defence and hit the inside of the post.\n'Great run'\nWatkins was the creator when Villa's start did get the goal it deserved on 11 minutes.\nThe England international headed John McGinn's cross back into the path of Ramsey to drill into the bottom corner.\n\"We're on a great run,\" said Watkins. \"Newcastle are a great side and didn't have many chances today, which showed the level we are at.\n\"We are really enjoying it at the moment. Everyone knows what they are doing.\"\nNewcastle had won their last five games to close in on a return to Champions League football after 20 years.\nEddie Howe's men briefly threatened a revival once Callum Wilson was paired alongside Alexander Isak in attack.\nWilson forced Emi Martinez into a save with his first touch, albeit from an offside position, before Isak stung the palms of the Argentina number one.\nHowever, the visitors greater attacking intent was also leaving Villa gaps to exploit on the counter-attack.\nWatkins was denied his goal as a VAR check ruled him offside after finally getting the better of Nick Pope.\nBut he had his 10th goal in 12 games 25 minutes from time as he spun onto Alex Moreno's cross and left Pope with no chance.\nNo player has scored more than Watkins 12 Premier League goals since the World Cup. He pounced once more seven minutes from time after Ramsey turned Emi Buendia's cross into his path.\n© 2023 AFP",
  "word_count": 504,
  "scraped_at": "2026-02-14T01:50:29.485344",
  "_text_extracted": true
}