{
  "article_id": "af8862aa1edd",
  "url": "https://www.abc.net.au/news/2023-07-19/matildas-wwc-group-b-preview/102597306",
  "title": "Matildas Group B Preview : What you need to know about Republic of Ireland , Nigeria , and Canada",
  "date": "20230718T231500Z",
  "domain": "abc.net.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Matildas Group B Preview: What you need to know about Republic of Ireland, Nigeria, and Canada\nCan the Matildas win the 2023 Women's World Cup?\nIt's the aspirational question on many people's minds as the co-hosts prepare to kick off their campaign at Stadium Australia on Thursday night.\nAnd for good reason: The team is coming into the tournament in some of their best ever form under head coach Tony Gustavsson, they're spear-headed by one of the best strikers in history in Sam Kerr, they have a squad that is as deep as it is versatile, and they'll have a sell-out home crowd at their backs for every game they play.\nOn and off the field, the team are riding a wave of confidence and composure, especially following their 1-0 win over world No.5 France in Melbourne last week.\nIt didn't always feel this way, though. Barely a year ago, faith that the Matildas were capable of going far in their home World Cup seemed to be at its lowest ebb.\nSince taking over at the start of 2021, Gustavsson oversaw a run of painful defeats as he threw his team into the deep end against some of the world's best sides: Germany, the Netherlands, Denmark, Sweden, Japan, USA, Canada, Spain.\nBy mid-September 2022, Australia had recorded 13 losses and five draws in 26 games. Two consecutive losses to Olympic gold medallists Canada was enough for some to start calling for Gustavsson's sacking.\nBut the next month, something changed: the Matildas clicked. October saw the start of a seven-match winning streak that included statement results over Denmark, Sweden, and Spain, as well as winning the inaugural Cup of Nations tournament in February.\nThis run coincided with Gustavsson narrowing down the squad he believed would represent Australia at the upcoming World Cup, with several of the players he'd blooded at the beginning — Kyra Cooney-Cross, Charlotte Grant, Cortnee Vine, Clare Hunt, as well as the resurgence of Katrina Gorry and Mackenzie Arnold — all hitting the best form of their careers.\nAnd while their streak was broken by a stubborn Scotland in April, the Matildas then posted arguably their best result of the Gustavsson era after defeating European champions and World Cup heavyweights England 2-0 a few days later.\nAided by the timely return of key players such as Ellie Carpenter, Alanna Kennedy, Mary Fowler, Tameka Yallop, Kyah Simon, and Teagan Micah from injury, the final 23-player squad selected earlier this month has an overarching sense of steadiness to it.\nThe settled nature of the team, and the confidence of the football they've been playing on the field, arguably reflects their comfort off it. In contrast to all three of their group-stage opponents — each of whom is dealing with a particular drama off the field — the Matildas are sailing into their home tournament on a current of good vibes all around.\nIt's a stark contrast to their last World Cup campaign in 2019, when the team was consumed by chaos following the abrupt sacking of former head coach Alen Stajcic five months beforehand.\nBut before we can start to genuinely consider whether Australia can win the whole damn thing, they first have to navigate a tricky, unpredictable Group B that includes Republic of Ireland, Nigeria, and Canada.\nSo what can they expect?\nHere's everything you need to know about the Matildas group-stage opponents.\nRepublic of Ireland\nFIFA ranking: 22\nTournament appearances: Debut\nBest finish: 0\nHead coach: Vera Pauw\nLast 5 results: DLLWD\nGroup games: Australia (July 20), Canada (July 26), Nigeria (July 31)\nThe Republic of Ireland (ROI) are one of several newcomers to this year's World Cup, having qualified for the tournament for the first time ever after defeating Scotland in last year's European play-offs.\nIn fact, this is the first major competition that the country has ever qualified for, including European Championships and Olympic Games. As such, there are few expectations on the ROI to make it out of Group B against the co-hosts, the Olympic champions, and Africa's most successful nation.\nHowever, having nothing to lose also means they have everything to win. ROI are a team that embraces their underdog status, which we saw when they defeated Australia 3-2 back in October of 2021, and with several of its players starting regularly for the world's biggest clubs, there is the possibility they could cause an upset or two.\nROI have a few major challenges, though. They are not a prolific team when it comes to scoring goals, having won just two of their past 15 games by more than a goal, and the lack of a consistent, clinical striker is partly to blame.\nThe team's current highest goal-scorers are Arsenal winger and captain Katie McCabe and North Carolina Courage midfielder Denise O'Sullivan, who will be crucial to ROI's chances of squeezing past their Group B opponents.\nThe inclusion of American-born Sinead Farrelly, who spent eight years away from the game, during which she was at the centre of the NWSL's investigations into abuse allegations, before switching allegiances last year.\nThey will rely heavily on set pieces to sneak a goal or two, especially against stronger teams, before defending in deep blocks like their lives depend on it. They're anchored at the back by WSL regulars Louise Quinn, Megan Connolly, and Niamh Fahey, with stand-out goalkeeper Courtney Brosnan — who won ROI's most recent Player of the Year award — the last line of defence.\nGiven they lack big-tournament experience, their opening match against the Matildas in front of a home record crowd at Stadium Australia — where almost 80,000 people are expected to attend — could overwhelm them.\nROI's recent results have potentially deflated the side, too, losing four of their past five games, including a tournament warm-up against France earlier this month. Last week, the team had to abandon a friendly against Colombia after the game became \"overly physical,\" with O'Sullivan reportedly taken to hospital following a heavy challenge.\nFurther, how head coach Vera Pauw rotates her squad to keep up with the intense physical demands of tournament football will also affect how far they can go, and given ROI's squad is not particularly deep, they could risk losing key players, as the O'Sullivan news attests to.\nPauw herself comes into the World Cup under a microscope after reports recently surfaced regarding her treatment of players in her former teams, allegations that Pauw denies. Whether the past few weeks of chaos distracts the head coach and her players from the task at hand remains to be seen.\nNigeria\nFIFA ranking: 40\nTournament appearances: 7th\nBest finish: Quarter-finals (1999)\nHead coach: Randy Waldrum\nLast 5 results: LLWWW\nGroup games: Canada (July 21), Australia (July 27), Republic of Ireland (July 31)\nAs they did at the 2019 edition, Nigeria come into the World Cup under a dark cloud of off-field drama.\nLast week, head coach Randy Waldrum publicly criticised the Nigerian Football Federation (NFF) for their ongoing lack of support for the team's tournament preparations, calling out administrators' dictatorial approach to squad selection, cancelled training camps, and chronic late or missing payments for staff and players.\nSo broken has the relationship become that Waldrum faced the sack on the eve of the tournament and rumours swirled that the players could boycott their first game against Canada on July 21.\nThis context is crucial in order to understand Nigeria's recent history on the field. Late last year, they lost the Women's African Cup of Nations title — a competition that they had monopolised for decades — after losing to Morocco and South Africa, before ultimately finishing fourth behind Zambia.\nAll three of these nations, who also qualified for the World Cup, have been slowly making up ground as Africa begins to take women's football more seriously.\nResults have not been promising for Nigeria since then: they lost five straight games after being bundled out of WAFCON, including twice to tournament favourites USA, but secured some much-needed wins against Costa Rica, Haiti and New Zealand in February and April.\nIt's a shame, really, because Nigeria have a number of world-class players who deserve the opportunity to shine. Barcelona striker Asisat Oshoala is one of them: the 28-year-old is currently at the peak of her powers and coming off her best ever season with the UEFA Women's Champions League winners.\nShe's joined by players such as Atlético Madrid’s Rasheedat Ajibade, Saint-Étienne’s Esther Okoronkwo, and Leicester City's Ashleigh Plumptre, as well as rising stars Gift Monday (UD Granadilla Tenerife) and Deborah Abiodun (Rivers Angels).\nThey're also captained by 40-year-old Onome Ebi, who could become the joint-top Women's World Cup appearance holder alongside Brazil's Marta if she takes the field for her sixth tournament.\nGiven their tumultuous build-up and the uncertainty surrounding staff and players, there is little expectation that Nigeria will be able to go much further than they have in the past. While they have the talent to make a real run towards the quarter-finals, talent alone might not be enough to stay competitive.\nCanada\nFIFA ranking: 7\nTournament appearances: 7th\nBest finish: Semi-finals (2003)\nHead coach: Bev Priestman\nLast 5 results: LLWLL\nGroup games: Nigeria (July 21), Republic of Ireland (July 26), Australia (July 31)\nLike Nigeria, Canada enter the 2023 Women's World Cup in deep tension with their governing body.\nAfter winning the country's first ever football gold medal at the Tokyo Olympics, the national team returned to a federation that claimed they were broke. In response, Canada's players threatened to boycott the SheBelives Cup earlier this year to highlight the significant budget cuts Canada Soccer had made over the past year, despite being one of the most successful years for the men's and women's teams in their history.\nTraining camps were cut, squad and staff sizes were reduced, payments to players were delayed, and there was no progress being made on a new collective bargaining agreement in which minimum standards were to be enshrined.\nCanada Soccer threatened to sue the players, forcing them to play the SheBelieves Cup effectively under financial duress, leading them to wear purple shirts reading \"enough is enough\" during the first game's anthems. Other national teams, including the Matildas, wore purple wrist-bands in solidarity with them during their own respective tournaments.\nWhile progress has been made between the players and federation since then, including the resignation of president Nick Bontis and a government inquiry into their finances, the off-field chaos has undoubtedly affected the players, whose performances on the field have suffered. They've won just one of their past five games — a 2-0 win over Brazil — and haven't played a public friendly since April.\nAdditionally, they've lost two important members of their squad to injury: Experienced forward Janine Beckie and rising centre-back star Jade Rose, who put on a masterful performance against Australia during Canada's two-game clean-sweep last October.\nDespite all that, Canada have retained much of the same squad that won gold in Tokyo, and arguably have one of the deepest benches of this World Cup. They are a typically defensive side, absorbing pressure before scoring goals on the counter.\nThey have one of the greatest defensive units including players like Ashley Lawrence (PSG), Vanessa Gilles (Olympique Lyonnais), Kadeisha Buchanan (Chelsea), and Jayde Riviere (Manchester Untied), as well as one of the tournament's most in-form goalkeepers in Kailen Sheridan.\nFurther up the field, they boast the likes of Adriana Leon (Man United), Jordan Huitema (OL Reign), Julia Grosso (Juventus), Jessie Fleming (Chelsea), and rising college star Simi Awujo.\nLed by the greatest international goal-scorer of all time, Christine Sinclair, who's scored 190 goals in over 300 games, this is a Canada side in the best possible position to make a deep World Cup run. Their final match against the Matildas will almost certainly determine who finishes first and second in Group B, and therefore which side they'll face come the round of 16.\nWhat happens next?\nThe winner of Group B will face the second-placed team from Group D in the round of 16, while whoever finishes second in the group will face Group D's winner.\nGroup D consists of European champions England, Denmark, China, and tournament debutants Haiti.\nWhoever progresses from that round of 16 clash will make it to the quarter-finals, where they will face whoever emerges from Groups H (Germany, Colombia, South Korea, Morocco) or F (France, Brazil, Jamaica, Panama).\nMake it past all of those, and then we can seriously start asking the question: Can the Matildas win the 2023 Women's World Cup?",
  "word_count": 2089,
  "scraped_at": "2026-02-14T02:00:36.696924",
  "_text_extracted": true
}