{
  "article_id": "af9b475c1cc3",
  "url": "https://www.teamtalk.com/news/klopp-demands-three-big-signings-before-agreeing-real-madrid-deal",
  "title": "Klopp demands three big signings before agreeing Real Madrid deal",
  "date": "20250418T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Klopp demands three big signings before agreeing Real Madrid deal\nJurgen Klopp will ask for guarantees over three big signings before agreeing to manage Real Madrid amid strong reports Carlo Ancelotti will be sacked later this month.\nReal Madrid were humbled in the Champions League, bowing out to Arsenal via an eye-opening 5-1 aggregate scoreline. Los Blancos have fared little better on the domestic scene either, with the club trailing bitter rivals Barcelona by four points in LaLiga.\nReal Madrid have advanced to the final of the Copa del Rey, though the imposing figure of Barcelona – who’ve beaten Real Madrid by an aggregate scoreline of 9-2 in their two matches this season – awaits.\nAnd according to Sky Sports, the Copa del Rey final will be the final stand for manager Carlo Ancelotti who’ll be relieved of his duties shortly after.\nAncelotti isn’t expected to be out of work for long, with the Brazilian national team job already lined up. Back at the Bernabeu, the expectation was Xabi Alonso of Bayer Leverkusen would replace Ancelotti when the time came.\nHowever, reports from UOL and then Sport claimed Real Madrid are pivoting to Jurgen Klopp.\nThe legendary former Liverpool boss is currently unhappy in his role as Head of Global Soccer with Red Bull and weighing up a return to management.\nKlopp would reportedly only return to the stresses and strains of management for two jobs – Brazil or Real Madrid.\nAnd with Sport stating Real Madrid president Florentino Perez is cooling on Alonso, along with Klopp reportedly being ‘willing’ to negotiate, the 57-year-old could be back in the dugout at the Bernabeu before the season is out.\nNow, a fresh update from Defensa Central has shed new light on Klopp to Real Madrid.\nThey state Klopp’s name is ‘gaining momentum’ in the Spanish capital, though ‘he would come with a series of conditions that would need to be accepted.’\nThe report then claimed the conditions relate entirely to transfers and regard Real Madrid’s leaky defence specifically.\nDefensa Central continued: ‘He would ask Florentino Perez for the arrival of a right-back, who will be [Trent] Alexander-Arnold, a left-back, and a centre-back.’\nDemanding a triple coup will NOT be a deal-breaker for Real Madrid and his requests are said to ‘align with what the sports management proposes’ anyway.\nWhat about Xabi Alonso?\nIt was only a few weeks ago that Alonso – who starred for Real Madrid during his playing days between 2009-14 – looked a shoo-in to replace Ancelotti.\nSpeaking on his YouTube channel, transfer guru Fabrizio Romano declared: “The top target remains absolutely only Xabi Alonso. For Real Madrid it is going to be Xabi Alonso when they part ways with Ancelotti.”\nAlonso is by no means out of the equation, though a handful of factors do appear to be working against the Spaniard.\nSport claimed the scale of Real Madrid’s implosion this season is prompting Perez to seek a more experienced campaigner.\nAlonso is widely regarded as one of the best young managers in world football, but he’s exactly that: young.\nKlopp, meanwhile, has overseen well over 1,000 games in senior management and proved at Liverpool he can lift the game’s biggest honours.\nHis record in the Champions League – three finals with Liverpool and one with Borussia Dortmund – is also stellar.\nFurthermore, BILD state Leverkusen will demand a substantial payment of around €10m before letting Alonso leave. Alonso is under contract with Leverkusen until 2026.\nLatest Real Madrid news\n⚪️ Senior Real Madrid star turns on Ancelotti after UCL exit as sack date set\n⚪️ Arsenal ‘open’ to £86m-rated star’s exit if Real Madrid hand over quality duo\n⚪️ Liverpool put Real Madrid in their place with TWO stars staying\nJurgen Klopp’s managerial career so far",
  "word_count": 630,
  "scraped_at": "2026-02-14T01:58:31.722077",
  "_text_extracted": true
}