{
  "article_id": "afa31a548605",
  "url": "https://playingfor90.com/2023/04/11/europa-league-budapest-within-reach/",
  "title": "UEFA Europa League Quarterfinals : Budapest within reach",
  "date": "20230412T060000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Europa League returns with intriguing quarterfinal match-ups\nThe 2022/23 UEFA Europa League has reached the business end of the competition as eight teams remain on the Road to Budapest.\nFive of the clubs left have won this competition before, two in the Europa League era. It will be a thrilling round of football as eight teams will be halved after next week Thursday.\nHere is a preview of the matches that will take place in the Europa League quarterfinals. Along with that, there will be a prediction for each tie.\nFeyenoord vs AS Roma\nIn what has to be considered the clash of the round, Feyenoord and Roma will renew pleasantries, less than a year after the pair met in the inaugural Europa Conference League final. The Italians prevailed on that occasion, but they will have all the pressure on them this time.\nTwice winners of the UEFA Cup – the Europa League’s predecessor – Feyenoord has been in red-hot form. Last week’s elimination in the KNVB Beker to rivals Ajax was their only competitive defeat since late October. It should therefore be no surprise that Arne Slot’s men are atop the Eredivisie table. The only issue the Rotterdam-based club has not done well of late is keeping clean sheets. They have not kept the opponent from scoring in their last seven games. Still, there is no reason to believe they cannot finally get the better of Roma this time around.\nJosé Mourinho’s Giallorossi have had an up-and-down season so far. Back-to-back victories against Sampdoria and Torino have brought Roma up to third spot in the Serie A. Funny enough, Roma’s last Europa League foray saw them defeat Ajax at this stage en route to their semifinal exit to Manchester United. The 1990/91 UEFA Cup finalists are looking for their third appearance in the final four of the Europa League.\nWhat a great matchup this will be. Back in 2014/15, Roma defeated Feyenoord in the Round of 32 in this very competition. Times are a-changing though, and the Dutch side looks well-equipped to finally inflict defeat on Roma. Having already eliminated Lazio in the group stage, I think this is now Feyenoord’s time. I am going to go with them ending Roma’s run here. It will be a very close tie, as all of their previous meetings have been.\nManchester United vs Sevilla\nIt seems like Manchester United cannot avoid Spanish teams in Europe. Since 2020/21, they have met Spanish opposition on eight separate occasions. This will be a ninth encounter in that period for the Red Devils. Once more, they face off against Sevilla, a side they have never beaten.\nErik ten Hag’s United sits fourth in the Premier League, winning their last two. That leaves them going into this clash in good form. Winners of the Europa League in 2016/17, this is the fourth straight appearance in UEFA’s second tier competition where United has at least reached the quarterfinals. On each previous occasion, they progressed from this stage. This time, however, the challenge will be even greater.\nAs things stand, Sevilla is the only one of the eight Europa League sides left to not be sitting in a European spot domestically. In what has been a substandard campaign for the Andalusians, adding a seventh UEFA Cup/Europa League trophy to their cabinet would help their cause. Record winners of this competition, Los Rojiblancos have gone on to win the Europa League on each occasion where they have reached this stage.\nIn their previous three meetings, Sevilla has come out on top. The pressure is on them to win this tournament and return to the Champions League in the fall. While United could do a unique treble (potentially winning the FA Cup, EFL Cup and Europa League), I do not see that happening. Sevilla is their bogey team, and although the Spaniards have not been fantastic this season, it is hard to look past them this late into the competition. Sevilla to move on for me.\nJuventus vs Sporting CP\nFive years on from their Champions League group stage meetings, Juventus and Sporting meet each other once again. This time, it is win or go home. Much will be on the line between these two.\nDocked 15 points in Serie A, Juve’s title ambitions have gone by the wayside. Top four is still achievable, but they are currently on the outside looking in. In this year’s Europa League, they have won three of four games since dropping out of the Champions League. I Bianconeri are in a place to advance to their first Europa League semifinal since 2013/14. That was also their most recent appearance in this competition, where they lost to Sporting’s local rivals Benfica at the penultimate hurdle.\nFellow Champions League dropouts Sporting CP clawed their way past Premier League leaders Arsenal on penalties in the last round. Losing the 2004/05 UEFA Cup showpiece in their own stadium, Verde e Brancos will be competing in their first European quarterfinal since 2017/18. Back then, they fell to eventual champions Atlético Madrid in an all-Iberian clash. Fourth in Portugal, Sporting will likely need a Europa League triumph on 31 May to play Champions League football in the fall.\nIn their only previous tie, Juve won 2-1 away, while drawing the home match 1-1 in the 2017/18 Champions League group phase. I feel that this tie will also go the Bianconeri’s way. They will have their hands full though; Sporting has not lost in two months. Although Juve is the favorite in this meeting, they can seldom afford to rest on their laurels against the Portuguese side.\nBayer Leverkusen vs Union St. Gilloise\nWe end with the tie that might be overlooked. The 1987/88 UEFA Cup winners Bayer Leverkusen will face continental debutants Union St. Gilloise. In what has been contrasting European performances for both sides this campaign, it will be an intriguing matchup.\nLeverkusen could not come into this tie in better form. Die Werkself have won seven straight and eight of nine. Unbeaten in that stretch, they are now sixth in the Bundesliga. After an underwhelming Champions League showing in the fall, Leverkusen has sprung to life in 2023. A pair of 2-0 victories over Ferencvaros in the last round sent them to their sixth quarterfinal in the UEFA Cup/Europa League. Since losing the Champions League final 21 years ago, the German side has not reached a European semifinal.\nCompeting in their maiden season in Europe, things could have hardly gone better for Union St. Gilloise. Karel Geraerts’ side is unbeaten in their last seven outings, winning five. Chasing their first top flight title since 1934/35, Union sits second in the Jupiler Pro League, 2 points behind Genk. This will be Les Unionistes‘ third encounter with German opposition in this season’s Europa League. Having twice faced Union Berlin, USG holds a 2-1-1 record across the four games.\nThis will be a fascinating match, seeing that both teams go into this encounter on a lengthy unbeaten streak. While both also have their domestic duties to consider, the tie has to be considered a fantastic opportunity for the clubs. I like Union in this pairing. I think this is a better matchup for them with their style of play. Seeing Leverkusen could not beat a poor Club Brugge side earlier this season, I feel they will fail to do better against this Union St. Gilloise team.",
  "word_count": 1235,
  "scraped_at": "2026-02-14T02:09:52.177332",
  "_text_extracted": true
}