{
  "article_id": "afc7431036f6",
  "url": "https://www.easternriverinachronicle.com.au/story/8556293/laliga-reports-deplorable-racist-chants-at-vinicius/?cs=6364",
  "title": "LaLiga reports  deplorable  racist chants at Vinicius",
  "date": "20240314T200000Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Spanish soccer league will report the \"deplorable racist chants\" aimed at Vinicius Junior by Atletico Madrid fans to the nation's legal authorities.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Real Madrid forward was again the target for abuse by Atletico fans before their Champions League last-16 match against Inter Milan on Wednesday night.\nThe Brazil forward has called on UEFA, which runs the Champions League, to issue sanctions.\nEuropean football's governing body is understood to be reviewing the official match report before making any decision on disciplinary action, but LaLiga has acted already even though the match was not under its jurisdiction.\n\"LaLiga will report the deplorable racist chants against Vinicius Jr before the UCL match between Atletico de Madrid and Inter Milan to the Hate Prosecutor's Office, regardless of the fact it was played in another competition and the chants took place outside the stadium,\" a league statement read.\n\"La Liga is wholeheartedly committed to making football a hate-free space and will continue to work relentlessly to crack down on racism, homophobia, violence and hatred... whatever the competition.\"\nVinicius replied to a post on X, formerly Twitter, about the chanting and wrote: \"I hope you have already thought about their punishment @ChampionsLeague @UEFA.\n\"It's a sad reality that even happens in games where I'm not present!\"\nVideos circulating on social media appeared to show some Atletico fans engaged in chants which referred to Vinicius as a \"chimpanzee\".\nAtletico fans have engaged in racist chants towards Vinicius in the past, including at a Madrid derby in 2021.\nSupporters of other clubs in LaLiga have also directed abuse at the 23-year-old previously, including Valencia and Sevilla.\nLast May, LaLiga president Javier Tebas apologised for suggesting Vinicius was being \"manipulated\" when the Brazilian called out racism he had suffered in Spain.\nTebas subsequently said racism could be wiped out from his competition in six months with the correct legal framework in place.\n\"What we want is the power to do more things. With the power we are convinced within months this would be solved,\" Tebas said.\n\"We are going along the legal route and I think in six months' time this will be at zero and we will be the best league in the world.\n\"The competencies we want are for those intolerable behaviours - racism, homophobia.\"\nFIFA president Gianni Infantino wants football to adopt \"new, stricter\" measures worldwide to tackle racism when national associations gather for FIFA's Congress in Bangkok in May.\nAustralian Associated Press",
  "word_count": 419,
  "scraped_at": "2026-02-14T01:48:46.206416",
  "_text_extracted": true
}