{
  "article_id": "b0022909e830",
  "url": "https://www.lbc.co.uk/article/liverpool-ekitike-champions-league-5HjdFn2_2/",
  "title": "Liverpool end four - match losing streak with stunning 5 - 1 Champions League victory",
  "date": "20251023T000000Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool end four-match losing streak with stunning 5-1 Champions League victory\nFrance international Hugo Ekitike struck after 35 minutes against his former club to cancel out Rasmus Kristensen’s opener.\nHugo Ekitike scored on his return to Eintracht Frankfurt as Liverpool ended their four-match losing streak with a confident 5-1 victory in Germany.\nListen to this article\nThe France international, who scored 26 times in 64 matches for the Bundesliga side before a £69million summer move, struck the crucial blow which got his new team back into the match after they had conceded for the eighth game in a row.\nHe outshone British record signing Alexander Isak, who still looks short of sharpness, with the duo paired together for the first time as head coach Arne Slot opted for something different in an attempt to change their fortunes.\nBut the win came at a cost as Alexander Isak and Jeremie Frimpong suffered injuries.\nHead coach Arne Slot is hoping his £125million striker – who started alongside fellow number nine Hugo Ekitike for the first time – is not too badly affected as only last week he vowed the Sweden international could now be judged fairly after missing pre-season.\n“Let’s hope it’s not that bad, but he had to go off because he felt his groin,” said the Reds boss.\nPremier League rivals Chelsea were similarly dominant as Brazilian teenager Estevao provided further evidence of his scintillating talent in a 5-1 demolition of Ajax at Stamford Bridge.\nThe visitors were up against it from the 17th minute when captain Kenneth Taylor was sent off for serious foul play.\nAnd goals from Marc Guiu and Moises Caicedo either side of Wout Weghorst’s penalty and successful spot-kicks from Enzo Fernandez and Estevao had the Blues 4-1 ahead at the break before Tyrique George added a fifth.\nMeanwhile, injury-hit Tottenham needed a string of fine saves by keeper Guglielmo Vicario to claim a 0-0 draw at Monaco, while Czech champions Slavia Prague collected their second point of the campaign after a goalless draw at Serie A Atalanta.\nIn other Champions League games, England captain Harry Kane scored his 23rd goal in 15 games for club and country this season as Bayern Munich cruised to a 4-0 Champions League victory over Club Brugge.\nSeventeen-year-old Lennart Karl became the youngest Bayern player to find the back of the net in the Champions League when he opened the scoring with a stylish long-range strike.\nKane then registered for the eighth successive game in club football for the first time in his career before Luis Diaz and substitute Nicolas Jackson wrapped up a comprehensive win.\nMeanwhile, Jude Bellingham’s first goal of the season extended Real Madrid’s 100 per cent start to their Champions League campaign as Juventus were beaten 1-0 at the Bernabeu Stadium.\nBellingham’s 57th-minute strike was enough to clinch victory for the 15-times winners and leave the Igor Tudor’s men with just two points from their opening three games.\nGorka Guruzeta scored twice as Athletic Bilbao bounced back to beat Qarabag 3-1 and belatedly open their account.Leandro Andrade had given the visitors a first-minute lead, but Guruzeta levelled before the break and, after substitute Robert Navarro had given the hosts the lead, he cemented victory with his second two minutes from time.\nVictor Osimhen helped himself to a double to help ease Galatasaray to a 3-1 home win over Bodo/Glimt while second-half goals from substitutes Geny Catamo and Alisson Santos handed Sporting Lisbon a 2-1 comeback win over Marseille, who had Emerson sent off.",
  "word_count": 587,
  "scraped_at": "2026-02-14T01:52:49.018721",
  "_text_extracted": true
}