{
  "article_id": "b003961f0dac",
  "url": "https://news.yahoo.com/germanys-m-ller-hopes-really-085831361.html",
  "title": "Germany Müller hopes for  really good football festival  at Euros",
  "date": "20240104T093000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Germany's Müller hopes for 'really good football festival' at Euros\nGermany forward Thomas Müller hopes that this year's European championships on home ground will be as magical as the 2006 World Cup in the country, and that the team can impress in a similar way as well.\n\"It would be cool if we as a nation managed to look forward to this great football tournament in our own country,\" Müller said in his newsletter, looking ahead at the June 14-July 14 tournament.\n\"We have the chance to present ourselves as great hosts and celebrate a really good football festival together.\"\nThere is so far not much enthusiasm in Germany which also to do with the modest results of the team that has not done well at recent big events and won only three of its 11 games in 2023.\nMüller expressed hope that like in 2006, when Germany reached the semi-finals, the team could deliver when it matters, with the help of the fans.\n\"Maybe we can start the tournament on a positive note - like in 2006 - and then grow with the support of the German public,\" he said, naming the 2006 World Cup \"absolutely magical.\"\nThe 126-times capped Müller remains part of the Germany squad and recently also extended his contract at Bayern Munich, where the 34-year-old has spent his entire career, until 2025.\n\"It is liberating for me that my sporting future is already clear and I can focus fully on football. I love the competition and the will to win is just as strong as it used to be,\" he said.\nA big motivation to continue is also that the 2025 Champions League final is in Bayern's home stadium - where they lost the 2012 decider against Chelsea on penalties, and Müller scored in regulation.\n\"With the Bayern soul, that's a dream and also a realisable one,\" Müller said.",
  "word_count": 314,
  "scraped_at": "2026-02-14T02:07:39.578272",
  "_text_extracted": true
}