{
  "article_id": "b01c4a4694d5",
  "url": "https://menafn.com/1108838195/Fabinho-Its-not-nice-playing-against-my-good-friend-Bobby-Firmino-but-Ill-do-everything-to-make-sure-Al-Ittihad-beat-Al-Ahli-in-Derby-Week",
  "title": "Fabinho : It not nice playing against my good friend Bobby Firmino – but Ill do everything to make sure Al Ittihad beat Al Ahli in Derby Week",
  "date": "20241101T023000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fabinho: It’s not nice playing against my good friend Bobby Firmino – but I’ll do everything to make sure Al Ittihad beat Al Ahli in Derby Week\nBoth Brazilian stars moved to their respective Jeddah clubs in the summer of 2023 after enjoying years of success at Liverpool, including winning the Champions League and Premier League.\nBut they’ll be on opposite sides for the Sea Derby, with Fabinho confessing that he even had to apologise to his good friend Firmino after an overzealous tackle in a corresponding fixture last season.\nAl Ittihad go into the derby in second place, with their local rivals 11th in the Roshn Saudi League table. The Sea Derby, which kicks off at 9pm local time at King Abdullah Sports City, is part of the Roshn Saudi League’s innovative Derby Week, which is taking place in Matchweek 9 of the 2024/25 season.\nThe new Derby Week addition to the Saudi Arabian top flight also features Ronaldo’s Al Nassr versus champions Al Hilal, with Neymar at No.10, at Al Awwal Park in the Capital Derby in a mouthwatering match up on Friday. The Eastern Derby between Al Ettifaq, managed by Liverpool legend Steven Gerrard, and Al Qadsiah, who welcomed Real Madrid hero Nacho into their ranks in summer, is on Saturday.\nQuotes from Fabinho are below:\nOn the derby\n“For us it is a really important game, the team is in a really good moment. We are second in the league just behind Al Hilal and we want to be at the top, so we have to win this game. This will be my third derby, the first two were not very good for us. We lost both of them, so it is an opportunity to give a nice result to our fans. The fans they are asking for us to give everything to win this game.”\nAl Ittihad form this season\n“I think the players that arrived [in the transfer window] are playing really well. Moussa Diaby, Houssem Aouar, all the players who arrived have really integrated into the team and adapted to the team and the way we play.\n“I think some key players are finding their best football again, so this is very important for us. The new coach and his staff arrived as well, and we know the ideas they have and how they want to play football. What everybody expects from us is to fight for the league, it’s not a big surprise. We have to do everything to reach the top.”\nOn facing Roberto Firmino\n“It is not nice! Bobby is one of my good friends that I have made in football, he is a very good player, so I never like to play against him. Last season when we played against them, I made a hard tackle on him and after the game he sent me a photo of his ankle! I said: ‘Sorry, Bobby!’ After the game we can talk but, in the game, I will fight for my side and my team. It’s nice to be in the same city as him, to see him off the pitch often. Our families also are in contact, and he is a very good friend, but on the pitch and in the derby, I am with Al Ittihad and he is with Al Ahli.”\nOn living in Jeddah\n“My good friend Hélder Costa played here for one season, so I talked to him, because I wanted my family to be comfortable in the city. Coming to Jeddah it was a very good surprise to see how nice the city is. We have adapted to the city, and we love to live in Jedda. We’re very happy to be here.”\nFollow all the latest Roshn Saudi League developments on X at @SPL_EN (, on Instagram at @SPL_EN (, and on TikTok @spl (@spl) or visit the website for more information and updates.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 706,
  "scraped_at": "2026-02-14T01:57:46.235837",
  "_text_extracted": true
}