{
  "article_id": "b0204a44438b",
  "url": "https://www.france24.com/en/live-news/20240317-ac-milan-consolidate-second-spot-as-juve-s-woes-continue",
  "title": "AC Milan consolidate second spot as Juve woes continue",
  "date": "20240317T171500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AC Milan consolidate second spot as Juve's woes continue\nMilan (AFP) – AC Milan consolidated second place in Serie A on Sunday by beating Verona 3-1 after Juventus were held to a goalless draw by Genoa.\nIssued on:\nGoals shortly before and after half-time by Theo Hernandez and Christian Pulisic put Milan two ahead before Samuel Chukwueze volleyed the away side out of sight with 11 minutes remaining.\nSunday's win moved Milan three points ahead of third-placed Juve in the race for Champions League football.\nStefano Pioli's team trail runaway league leaders Inter Milan by 13 points, however they are all-but guaranteed a spot in next season's revamped edition of Europe's top club competition.\nMilan sit 14 points above fifth-placed Roma who host Sassuolo later, and with Italy favourites for an extra place in the Champions League next term the seven-time European champions have a massive cushion with nine fixtures remaining.\nVerona put on a good show and Tijjani Noslin's unstoppable strike in the 64th minute gave the hosts hope they could pull off another good result after winning their previous two matches.\nInstead, Verona stay two points above the relegation zone with a potentially huge clash at fellow strugglers Cagliari coming up after the international break.\nJuve meanwhile continued their poor run of recent form with a largely uninteresting goalless draw with Genoa in Turin.\nMassimiliano Allegri's side were league title contenders in January but one win in their last eight matches has left them 16 points behind Inter.\nInter host Napoli in Sunday's late match, searching for one of the five wins they need to secure a 20th Scudetto.\nJuve were frustrated by their stubborn opponents and were booed off by home fans at both half-time and the final whistle.\nHowever, the hosts could have claimed the win despite their underwhelming display as Dusan Vlahovic twice went close with second-half headers while substitutes Samuel Iling-Junior and Moise Kean both had efforts strike the woodwork.\nVlahovic was sent off in stoppage time for dissent meaning he will miss Juve's next fixture against Lazio.\nA big draw for promoted Genoa put Alberto Gilardino's side 10 points above the relegation zone.\n© 2024 AFP",
  "word_count": 363,
  "scraped_at": "2026-02-14T02:20:27.923374",
  "_text_extracted": true
}