{
  "article_id": "b0238c98a5ac",
  "url": "https://www.thescore.com/chlg/news/2631244/real-madrid-punish-wasteful-chelsea-to-reach-champions-league-semis-again",
  "title": "Real Madrid punish wasteful Chelsea to reach Champions League semis again",
  "date": "20230418T224500Z",
  "domain": "thescore.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid punish wasteful Chelsea to reach Champions League semis again\nRodrygo scored twice as Real Madrid cruised into the Champions League semi-finals on Tuesday, completing an emphatic 4-0 aggregate win against Chelsea that ends a disastrous season for the London club.\nThe home team, with Frank Lampard back in the dugout for a second spell, came into the match at Stamford Bridge with form and history against them.\nThey started brightly but rued a number of huge missed chances that would have heaped pressure on the defending champions.\nThe Spanish giants made Chelsea pay for their profligacy when Rodrygo scored in the 58th minute after a speedy counter-attack and he made it 2-0 with 10 minutes to go.\n\"We suffered a lot and helped us stay at 0-0 at the end of the first half,\" Real Madrid boss Carlo Ancelotti told BT Sport.\n\"Second half we were much better and scored the two goals. We are happy to have qualified.\"\nChelsea, the 2021 European champions, have now lost all four of their matches since Lampard returned to the club as caretaker boss earlier this month in place of the sacked Graham Potter.\nLampard, who also managed the club from 2019 until early 2021, bemoaned his team's profligacy.\n\"We played really well for 60 minutes,\" he said. \"We created chances but you have to take them.\"\nThe former Chelsea midfielder said his men must find motivation from playing for the club as they contemplate a bleak final few weeks of the season.\n\"You're playing for Chelsea,\" he said. \"So regardless, every game you play you have to give everything. I won't let anyone off the hook and we have to show. That standard cannot drop.\"\nAncelotti stuck with the same team that won the first leg 2-0 last week while Chelsea caretaker boss Lampard restored Reece James, Mateo Kovacic and N'Golo Kante to his line-up.\nRoared on by an expectant crowd despite their current woes, the home side made a good start against the 14-time winners.\nChelsea chances\nThey had a glorious chance to take the lead but Kante skewed his left-foot shot wide from about 12 yards.\nThe visitors, content to bide their time, looked sharp on the break.\nMidway through the opening period Rodrygo created space for himself and thumped an effort against the outside of the post from an acute angle while Luka Modric tested Kepa.\nBut Chelsea should have been ahead on the stroke of half-time when James fizzed a ball across the box from the right and it fell to Marc Cucurella at the back post.\nThe defender took a touch and shot but Thibaut Courtois came flying out of his goal to save.\nKante had another golden opportunity to take the lead early in the second half but his close-range effort hit Eder Militao and deflected away to safety.\nReal took the wind out of Chelsea's sails with just over half an hour to go, when Rodrygo scored from close range after an assist by Vinicius Junior.\nLampard made a number of attacking substitutions, bringing on Raheem Sterling, Joao Felix and Mykhailo Mudryk in a desperate bid to get back into the match.\nBut Rodrygo found the net again in the 80th minute, tapping home after a clever assist from Federico Valverde.\nReal Madrid will likely play Manchester City in the semi-finals, with Pep Guardiola's team 3-0 up against Bayern Munich after the first leg of their last-eight tie.\nFormer Chelsea boss Ancelotti is chasing a record-extending fifth win as a coach in the tournament.\nBut Chelsea, used to winning silverware over the past two decades, are contemplating the final stretch of a horrendous campaign despite a staggering spend of more than £500 million ($621 million) in the first year of the club's new ownership.\nTrophyless this season, they are languishing in 11th in the Premier League and look unlikely to qualify for European football next season.\nHEADLINES\n- UCL draw: Real Madrid get rematch with Benfica, Mourinho in playoffs\n- Infantino toasts end to Super League plot: 'Football wins when we unite'\n- Arsenal on cusp of Women's Champions League quarterfinals\n- Super League saga over after Real Madrid become last club to back out\n- Spurs sack Frank after miserable 8-month reign",
  "word_count": 710,
  "scraped_at": "2026-02-14T02:06:55.007908",
  "_text_extracted": true
}