{
  "article_id": "b044574a5055",
  "url": "https://www.france24.com/en/live-news/20230326-conte-s-turbulent-spurs-reign-ends-in-familiar-fashion",
  "title": "Conte turbulent Spurs reign ends in familiar fashion",
  "date": "20230327T010000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Conte's turbulent Spurs reign ends in familiar fashion\nLondon (AFP) – Antonio Conte's volatile Tottenham reign came to an almost inevitable end on Sunday as the intense Italian parted ways with the club \"by mutual agreement\" after 16 months in charge.\nIssued on:\nConte, 53, arrived to take charge of the under-achieving Premier League outfit in November 2021.\nAfter spending much of his time making veiled complaints about chairman Daniel Levy's failure to back him sufficiently in the transfer market, it already seemed certain Conte would depart when his contract expired at the end of this season.\nBut the Italian appeared to make his position less tenable with an astonishing rant at his players after Tottenham blew a two-goal lead in a damaging 3-3 draw at bottom club Southampton earlier this month.\nAlthough they remained fourth in the Premier League after that debacle, Spurs are in serious danger of missing out on Champions League qualification -- fifth-placed Newcastle are two points behind, with two games in hand.\nLevy reportedly became concerned about Conte's mood swings this season. There were claims the squad were tired of their manager's acerbic tongue, while fans bemoaned his perceived negative tactics.\nThe chairman would surely have preferred to keep Conte to avoid the upheaval triggered by a coaching change at such a critical time of the season.\nBut the manager's stinging criticism of his underachieving stars made his relationship with Levy more tricky.\nTo some, it appeared Conte was so fed up with Tottenham's inconsistency that his remarkable rant was an act of self-immolation designed to force his exit.\nThe club were dumped out of both the FA Cup and Champions League earlier this month as Conte's problems spiralled.\nHe had only recently returned to the touchline after a spell back in Italy recovering from gallbladder surgery and his patience ran out after Tottenham threw away a 3-1 lead with just 13 minutes remaining at Southampton.\n\"It's the right moment to speak because for me this is unacceptable,\" Conte said. \"For another time we showed we are not a team.\n\"I see selfish players, I see players that don't want to help each other and don't put their heart in.\"\nAlarm bells\nTottenham have been regarded as English football's biggest underachievers for decades and Conte failed to break the cycle of frustration and recrimination.\nWithout a major trophy since the 2008 League Cup and not crowned champions of England since 1961, Spurs remain flawed even in a period in which they have benefited from the presence of the club's record goalscorer, Harry Kane.\nWhen pushed on the reasons for the club's continued failure to succeed under a string of different managers, Conte was scathing.\n\"Tottenham's story is this,\" he said. \"Twenty years there is the owner and they never won something.\n\"Why? Because they are used to it here. They don't play for something important. They don't want to play under pressure.\"\nConte arrived at Spurs with a well-earned reputation as a serial winner.\nThe former Italy coach won three Serie A titles as Juventus boss, led Chelsea to their most recent Premier League crown in 2017 and ended Inter Milan's 11-year wait to become Italian champions in 2021.\nInitially the signs were encouraging for Conte, and for Tottenham as well.\nHe guided them to an impressive top-four finish last season, coming from behind to pip north London rivals Arsenal to Champions League qualification.\nBut familiar alarm bells started to ring during the summer transfer window, when Conte bemoaned Levy's preference for signing younger players with sell-on potential.\nLong-time Conte watchers have grown accustomed to the Italian's habit of blaming his employers for his teams' problems.\nDespite his success, his spells at Chelsea and Inter ended over transfer rows.\nAt Tottenham, there was not even any silverware to make his rants more palatable.\n© 2023 AFP",
  "word_count": 641,
  "scraped_at": "2026-02-14T01:53:35.632527",
  "_text_extracted": true
}