{
  "article_id": "b04a3098cb96",
  "url": "https://punchng.com/aina-still-on-crutches-doubtful-for-everton/",
  "title": "Aina still on crutches , doubtful for Everton",
  "date": "20250410T041500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Super Eagles defender Ola Aina remains on crutches and is doubtful for Nottingham Forest’s Premier League clash against Everton on Saturday, as he continues to recover from a calf injury sustained during last week’s match against Manchester United.\nThe 27-year-old shared a photograph on his official Snapchat showing that he is still unable to walk without the aid of crutches, raising concerns about his availability for the crucial home fixture at the City Ground.\nThe Nigeria international was forced off in the 39th minute of Forest’s 1-0 victory over Manchester United last Tuesday, with the early diagnosis suggesting a calf-related injury that prompted manager Nuno Espirito Santo to reshuffle his tactics, switching to a back five for the remainder of the match.\nWhile some reports had claimed that Aina would be back for the Everton clash, his latest social media update suggests that might be a long shot, dealing a significant blow to Forest’s aspirations for Champions League football.\nForest are capable of winning without some of their top stars, as demonstrated by their victory over Manchester United without Callum Hudson-Odoi and Chris Wood. However, Aina’s absence is particularly concerning given his importance to the team’s playing style.\nThe former Chelsea Academy graduate has been one of Forest’s standout performers this season, starting all 30 Premier League matches contested by the club prior to his injury, scoring two goals and providing one assist.\nAina also leads the league among outfield players in goal-line clearances with three this season, without all three, Forest would have lost six points in the top-four race.\nAina’s consistent performances have put him in contention for Forest’s Player of the Year award, with impressive numbers including 64 dribbles, 53 tackles and 87 clearances in the Premier League this campaign.\nAfter hosting Everton on Saturday, Forest will face Tottenham on Monday, April 21, with both matches crucial in their quest for European qualification.",
  "word_count": 316,
  "scraped_at": "2026-02-14T01:55:09.084344",
  "_text_extracted": true
}