{
  "article_id": "b0729f202be7",
  "url": "https://toffeeweb.com/season/24-25/comment/talkingpoints/45630.html",
  "title": "End This Nonsense , Now !!! ",
  "date": "20250105T141500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "End This Nonsense, Now!!!\nHistory tells us that the most bizarre comments are normally made towards the very end of a manager's tenure at football clubs. If that is the case, then \"We've had so many draws, it's not a bad run if you add wins to it\" is right up there with the very best of them.\nFor anyone who hasn't guessed who uttered that comment, it was Sean Dyche's response to a question by a journalist immediately after Everton's latest horror show at Bournemouth.\nLet's get one thing straight: this team is not going to improve under Dyche. After 19 games, there are no green shoots of revival in evidence, none whatsoever, if there was, we would have seen some proof of it by now. We can't even claim the team has been unlucky in recent games.\nIt was more of the same old, same old, on Saturday afternoon: a team with little or no personality, no evidence of a game plan, or any semblance of a threat towards an opponent's goal. The players looked jaded, even the effervescent Iliman Ndiaye looked frustrated and wearied by it all.\nMeanwhile, the consistently poor performers – Doucoure and Mykelenko – continue to stink the place out, whilst the hapless manager continues to persevere with them, week after week.\nUp front, any combination of Calvert-Lewin, Beto or our most recent great white hope, Armando Broja, run around like headless chickens , wondering if they will ever be presented with an opportunity to get on the end of a decent cross (remember them?), or a defence-splitting pass, or even – god forbid – a 6-yard tap-in.\nWe know his hands are tied with the limitations of the current squad, but his team selections and tactics are dreadful. The team is floundering all over the pitch, and no-one is throwing them any lifebelts. Just 3 wins in 19 games was enough for Benitez to get the sack, so who is going to call time on this guy?\nI don't dislike Dyche as a person, but his 'blindness' to the current situation is bordering on the insane; how can anyone not see that a team who have zero shots on target are going absolutely nowhere fast???\nThe team have most definitely 'stopped listening' to their manager, the fans too have had enough. Going to Goodison now is like self-flagellation – we do it because we have to, but it's a painful experience nevertheless.\nSomething has to give, because relying on three teams being worse than us will most certainly end in relegation. At the moment, we are sleepwalking into the Championship. Can anyone honestly see this team putting a run of results together before the end of the season?\nOver to you, TFG.\nReturn to Talking Points index : Add your Comments »\nReader Comments (72)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 05/01/2025 at 12:28:47\nIt is a difficult situation for TFG but the result of doing nothing before it is too late doesn't bear thinking about either and will cost more than it is worth. I know that change doesn't always work but I can't see that doing nothing will either.\nGardening leave for Mr Dyche as soon as a replacement has been sourced.\n2 Posted 05/01/2025 at 12:36:11\n3 Posted 05/01/2025 at 12:43:22\nThese lads have played in the top division in England, Italy, France and Germany. They've played International football, and a couple of the older ones have even played Champions League football. Yet we serve up the most dismal football I've ever seen.\nA better manager would get more from this squad, let's just hope we find him sooner rather than later.\n4 Posted 05/01/2025 at 12:50:51\nThose others at the bottom are probably relishing the Everton problems whilst not overlooking their own.\nIt's so sad we are facing this situation again after what went on in previous seasons.\nIt's easy to say ''oh, there's a long way to go yet'' but whilst no changes are made how can we be optimistic.\nA poor result against Peterboro may just be the nail in Dyche's coffin.\n5 Posted 05/01/2025 at 12:54:42\n6 Posted 05/01/2025 at 12:59:20\nDyche's tactics are without a doubt stinking the place out and, yes, it is out of a sense of duty that we still turn up at Goodison to watch this dreadful stuff, but we haven't replaced Richarlison, or Digne, or Gordon, or Sigurdsson, or even Iwobi or Onana with anyone even approaching their level of ability. Meanwhile the best full-backs in the squad are approaching free bus-pass age.\nAt this stage, the best I can offer is that sacking Dyche will probably make no difference to whether we go down or stay up, Our fate lies in the hands of Leicester and Ipswich.\n7 Posted 05/01/2025 at 13:02:28\n- Managerial appointment\n- Thelwell contract extention/New DoF\n- Players out of contract\n- Identifying new players to bring in during the summer\nAll this together with transitioning to the new ground. There is alot lot going on here and the work needs to begin now.\nSeperately, I feel the Goodison send off won't be a joyful one but more likely a nervy one.\nI just wonder how key those last two home games against Ipswich and Southampton will be crucial to our survival.\n8 Posted 05/01/2025 at 13:03:54\nManager Discusses Saturday's Opponents……..\n\"Their manager has done a good job because he's managed to change their style. I respect that. They've got much more straight forward in their football. They've got players with quality, players with energy and they're forming a unit, which has been successful so far this season.\"\nIf you’ve noticed this in other managers, Dyche, then why the fuck can’t you change your/our style, instead of sticking with the same old shit? Against the likes of Arsenal, Chelsea and Man City, your system was perfectly executed, and a system most of us would accept. However, your system against the likes of Southampton, Forest and Bournemouth we simply do not accept.\nWe all accept that we lack quality in some players, but with the right coaching surely that could improve to a certain degree? You’re supposed to have “Earned” (😂😂😂😂) your coaching badges, so coach, and change things around now and then, instead of sticking to the same old shit, otherwise, what’s the point of you having coaching badges? What you do, anyone of us on here could do, without the aid of coaching badges.\n9 Posted 05/01/2025 at 15:04:41\n\"I don't dislike Dyche as a person\" — I ask myself, \"Is there really anything about him that is likeable?\"\nIt's lacking in class to make it personal but this is our club and he is an affront to everything we should stand for. And there's that £5M a year…\n10 Posted 05/01/2025 at 17:31:01\nA little contradictory I agree re Dyche, but as I've got older I'm trying to be a bit 'kinder' where personalities are concerned.\nIn fact, the only recent Everton manager I've disliked to any degree was Koeman. Arrogant beyond belief, and not half as talented as a manager as he was a player. He honestly believed he was much too good to be manager of Everton.\nI know for a fact he was first away from Finch Farm at the end of training, only to be seen a few hours later, in Alderley Edge in a restaurant with his entourage. Not a nice person.\n11 Posted 05/01/2025 at 20:56:58\nOn top of that, Dyche has not had the players' ear this season right from the start and set up a system as a result that attempts to control the players rather than develop their strengths. He also decided he had no scorers in the team and set up for anyone to have a potshot. Those that suck up in training are selected, and those that are not aren't.\nDyche is not managing the team – he is trying to control it to keep his high wages, with the advantage that, if it does not work out, he gets a big payoff anyway.\nAllowing Dyche to use the club this way is not on.\n12 Posted 05/01/2025 at 21:17:37\nIn saying this, I actually think Dyche will be hard to replace right now – a club in freefall isn't the most attractive proposition although the money will be!\n13 Posted 05/01/2025 at 21:26:23\nWhether Dyche goes tomorrow or stays until the end of his contract make's no difference whatsoever to the amount of money he receives from EFC.\nIf. however, he keeps Everton up but is let go anyway he will at least have enhanced his reputation as a relegation battler. If we go down with him at the helm he's probably finished as a Premier League manager.\nDyche is as invested in Everton's future as anyone.\n14 Posted 05/01/2025 at 23:02:10\nI wish that was true and I respect your opinion, but I am a bit more sceptical. Controlling the players rather than managing them is a good fit when you really look at what is going on, Brendan.\nI agree he will get the same money whether he stays or goes. The big layout referred to the sums involved.\nI think a new manager is needed to remotivate the players and the matchgoing fans. Both are essential if Everton are to progress this season. This is now not going to happen under Dyche.\nI really expected Dyche to kick on this season but from pre-season it has not happened. I also thought that new owners would provide a boost, but that hasn't happened either. The above is what I think the problem is on both counts.\n15 Posted 06/01/2025 at 01:07:11\nI didn't mind the cost or travel under Silva or Allardyce… but not now.\nDyche must be ousted and we come up with a replacement. Not Potter. Not Moyes. For me, it should be Carsley. Bring him in on the understanding he keeps us up until the summer to get the role permanently.\nI wouldn't be that bothered if they went with Moyes but I suspect that was an obsession only our deceased former Chairman had. As for Potter, I have no idea. Brighton are run like clockwork and he crashed and burned at Chelsea, who have ruined the reputations of many elite coaches.\nCarsley is an intelligent man and would hopefully bring players through the youth academy instead of them going off to prosper elsewhere.\nIt's got to be better than this nonsense.\n18 Posted 06/01/2025 at 01:23:22\nColeman and the players themselves take on the task of planning for the next game. This would include tactics and team formation.\nMy wish for 2025 is the eventual appointment of a new manager.\n19 Posted 06/01/2025 at 02:40:35\nPeter #1... I would assume that the people who matter are listening very closely indeed. All of Friedkin's many successful business endeavors -- cars, resorts, movies, golf courses -- depend on an acute awareness of the customer's response to the product. Just because they haven't taken action or made public statements (they generally don't until it's time) doesn't mean they haven't heard the fans. They may simply not agree, at least about the urgency of the situation.\nOliver #12, they will assuredly have had communication with not only potential managers but candidates for the CEO and DoF positions. They may even have made selections and are negotiating right now. We will never know until it happens. As you saw in the negotiations to buy the club, Friedkin doesn't tip his hand, ever. Remember, he walked away from Moshiri in July -- end of story. And we knew nothing of his coming back in until we heard his chips hit the table.\n20 Posted 06/01/2025 at 02:45:19\nPersonally, I'd bring in Davide Ancelotti with a few loans from dad at Real Madrid till the end of the season.\n21 Posted 06/01/2025 at 02:50:11\n22 Posted 06/01/2025 at 06:26:01\nEmbarrassing that Dyche hasn't been sacked yet. The Posh might be the final nail\n23 Posted 06/01/2025 at 06:27:03\nTo the person above who said the only manager they didn't like in recent years was Koeman, I am staggered. You are clearly a more rounded person than I as I couldn't stand quite a few of them! Benitez, Allardyce, Koeman and now SD, awful.\nPlease can we get a progressive and forward thinking manager. Its early days but Vitor Pererra's (sp?) start at Wolves may show us up further when recalling the \"Lampard in\" moment. Jeez we've had some duds.\nI like the call for Davide Ancellotti, he is highly thought of, I like Carsley too. Both are a risk at this stage but one I would like to see us take. Just get this ape gone please.\n24 Posted 06/01/2025 at 06:34:19\nAshley Young has had a very good season for a 39 year old. But that's as far as I'll go with the praise. As an individual he's an absolute credit to himself. As a regular Premier League selection he's an embarrassment. Dixon is now 20 (and had a really exciting debut). Patterson is now 23. You'd think one of them might have had a few run-outs to see if they could offer more than a defender who has to stay at home for obvious reasons. My conclusion is that Dyche has decided that he doesn't need alternatives. Young does what he needs and the immediate future of the club isn't his problem.\nYou could repeat similar statements all over the pitch.\nIs there someone who can play number 10 better than Doucoure? No-one knows, because Doucoure does exactly what Dyche needs in a number 10 (he chases and defends). Who cares about replacing him? It won't be Dyche's problem. Could Ndiaye have an impact in a free role? Not under Dyche he couldn't - we need him defending next to Mykolenko.\nCould DCL find his previous form? No-one knows, he'll leave at the first chance he can get after doing his job and being Dyche's first line of defence.\nDyche has got people convinced that the players can't offer anything going forward simply because they currently don't offer anything going forward. Well that's not exactly a reasonable position to take.\nAs for his character I got pelters on here for comments I made about him in his first month or two. I still believe he's a weirdo, a conman, and a coward. I can't think of a single good thing he brings to the club? At 5M a year!\n25 Posted 06/01/2025 at 06:52:17\nWe are stepping into the dark here. Despite Mike Gaynes's assurances that the new owners have a CEO/manager etc. lined up, and his confident predictions, he knows nothing about what matters except his repeated assurances that they are top-notch capitalists and business men - Roma fans might not agree.\nThis next appointment is so crucial it's scary. The new owners have to get it right and how the feck can we be sure they will with their track record in Rome? All we can do is hope and the time to judge them is not now. We are dangling on a thread at their mercy. All fingers and toes tightly crossed.\nBut do remember Ernie you fecking unbeliever that our top hard-boiled egg told us a few days ago that 'we' - the hard-boiled eggs collective - have made the players ten times better .\n26 Posted 06/01/2025 at 07:02:36\n27 Posted 06/01/2025 at 07:10:05\nBroja, Harrison, Lindstrom and Mangala. No more permitted.\n28 Posted 06/01/2025 at 07:25:17\n29 Posted 06/01/2025 at 07:27:51\nWas revealing about James. And the time is more than past for him to get out of his dad's shadow. Good shout PH.\n30 Posted 06/01/2025 at 07:41:33\nBoth have to be on board for Everton to progress.\n31 Posted 06/01/2025 at 07:49:20\nI thought only a total of four loans permitted in one season.\n32 Posted 06/01/2025 at 07:55:35\nI'm hoping the new owners have the sense to understand that this situation can't continue, but also that we're not in a position to appoint someone. So an interim manager is the only one that makes sense.\nYou're dead right that the next appointment is huge. But the due diligence can't have been done for a permanent appointment – who would have done it? Thelwell? Is he even going to be around? Why would he be choosing the next manager until the club decides whether he's wanted in that role?\n33 Posted 06/01/2025 at 07:57:16\nThe fans should have been a real weapon this season. It's incredible that the club doesn't see that.\n34 Posted 06/01/2025 at 08:14:09\nExactly. Gaynes thinks of these new owners as some sort of Yank - surprise, surprise - business / capitalist saviours when in reality his views on them and Roma reveal his lack of understanding. But fuck me he can reel off stats.\n'Due diligence' is your key term Ernie. The Yanks have shown a complete lack of that in Rome. They pick by noise. Thelwell, as part of the ancien regime, is, I hope, toast this summer.\nGreat call, Ernie, who the fuck is doing it?\nWe can but hope, mate.\n35 Posted 06/01/2025 at 08:32:46\nPrecisely the point I have asked in a couple of other posts. You call it due diligence perfectly accurately – I called it recruitment responsibility. Thelwell? or AN Other. I am not seeing anybody right now who could be tasked with that insofar as the manager job goes.\nThey (TFG) need to get their fingers out and make some decisions. It's not going to happen overnight and January will be gone before we know it. I fear that we may just be stuck with the current ensemble stumbling through to the season's end the way things seem to be going.\n36 Posted 06/01/2025 at 08:54:52\nWe got the customary historic club/great fans stereotypical drivel but silence since.\nLet's hope that Gaynes is right.\nThe silence since that first message is deafening.\nCompletely agree Kim that the real realistic fear is a not much-happened-January.\nBut then, according to Gaynes, the vast majority of posters on here laugh at me and ignore me and have done so for years - apart from him - so what the fuck do I know, since my first game at age 2?\n37 Posted 06/01/2025 at 09:11:47\nTotally frustrated and disillusioned fans.\nA manager that has got zero confidence that his squad of players\ncan sustain attacking any team.\nDyche has got us over the line twice. Can the new owners take that gamble\nhe can do it a third time?\nI agree, end this nonsense now.\n38 Posted 06/01/2025 at 09:13:28\nI keep hearing TFG have built their reputation on listening very carefully, but who are they listening to ?\nDyche has many friends in the media who see him as some sort of miracle worker. If TFG group are listening to them. They are being lead up the garden path.\nIf they are looking at demands for tickets. They will assume the fans are happy.\nIf they are asking people who are already inside the club, they all seem thick as thieves and will rally around Dyche.\nI am pretty certain they are not reading Everton forums like this, because Dyche would have been toast weeks/ months ago.\nGiven the size of this investment. I totally believe they are listening very carefully But who to ?\nI think he's staying\n39 Posted 06/01/2025 at 09:19:29\n40 Posted 06/01/2025 at 09:32:30\n41 Posted 06/01/2025 at 09:37:10\nIf they change him and we go down they’ll be remembered as the ownership that made the decision that relegated us, if they do nothing and we go down, well, that’s their fault too. I think Dyche knows this and doesn’t care, he’d rather go now so he can say he did his job and he gets the same money anyway, while the ownership are hoping he’ll want to preserve his ‘firefighter’ reputation and keep us up. It’s a Mexican stand-off and a catch 22 all at once.\n42 Posted 06/01/2025 at 09:44:48\nWarning signs surely was he was sacked 15 April and had won just 4 games from 30!\n43 Posted 06/01/2025 at 09:52:20\nI think it's exactly as you describe it a Mexican Stand-off, Dyche doesn't appear to have any solutions, save to say, once the players are on the pitch, there's nothing he or any other manager can do.\nDyche has looked disinterested for some time now, whilst making some strange comments along the way, and that's the main reason that I fear for Everton if he remains in post for very much longer.\nIf TFG can't or won't appoint a replacement for him then it would be far better for them to make an interim change by appointing people from within the club, like Baines et al and put the three-boiled eggs on gardening leave, at least that might give the fans and possibly the players a much needed boost.\nWhatever happens doesn't guarantee Everton Premier League football next season, but TFG doing nothing might be viewed as playing Russian Roulette.\n44 Posted 06/01/2025 at 09:55:43\nI neither laugh at you (unless it’s funny) or ignore you. In fact I look for your messages every morning when I tune in.\nBUT.\nWe all say daft things and we all get irritated with other peoples daft things, but we move on.\nYou’ve moved on from “daft” things I’ve said, that Paul H has said, that Don Alexander, wait, ok, maybe not him….\nBut you have moved on.\nMike G is sound - I’ve met him - and he said a daft things.\nLet it go.\nPlease?\nAll the best PF and regards to your Bryan - best lead vocals ever!\nUTFT\n45 Posted 06/01/2025 at 10:08:26\n46 Posted 06/01/2025 at 10:26:05\nI think it just shows how traumatised we have become as apart from the odd boo at half time or full time no real demonstration to get rid of Dyche. Burnley left it to late in sacking him to avoid relegation, Everton make sure you don't make the same mistake.\n47 Posted 06/01/2025 at 10:31:34\nBig area the South of England mate but if your anywhere near West Sussex (Horsham) and get the chance of a ticket for any game soon give me some prior warning and I'll drive you there.\nUTFT\n48 Posted 06/01/2025 at 10:50:17\n\"I don't dislike Dyche as a person\" — I ask myself, \"Is there really anything about him that is likeable?\"\nIt's lacking in class to make it personal but this is our club and he is an affront to everything we should stand for. And there's that £5M a year…\nWhat a terrible response from our 'editor'. \"Is there really anything about him that is likeable'' ????\nLacking in class written all over that statement Mr K - very poor from someone in a position who should know better.\n49 Posted 06/01/2025 at 11:02:54\nAny manager who brings on Patterson and moves Young further forward in front of him, is having a laugh. Keep Young at RB and play Patterson as RM. That one change cost us the match as neither of them was in the picture, when Kerkez crossed to Brooks.\nPS: Why did Branthwaite duck. The more I look at what he did, the less it makes sense, Unless he thought Pickford would get it, otherwise he must have thought sod it. Whatever it was it was very peculiar.\nPPS: Mark Murphy Top Man.\n50 Posted 06/01/2025 at 11:20:42\nOn the due diligence question, I would expect every director of football to have a succession list for the manager role. Otherwise, they wouldn’t be doing their job.\nNor would TFG if they spent several months on an acquisition and didn’t make plans for the senior roles on the executive, operations or football side.\nIt will come down to an assessment of risk for them whether they act or not.\n51 Posted 06/01/2025 at 11:21:40\n52 Posted 06/01/2025 at 11:26:58\nBut I don't think the FA Cup tie this week will be critical to his future. The following two home league game against Villa and Spurs will be. If we continue the \"Everton Nil\" trend, then it's time for goodbyes.\nHopefully TFG have someone lined up: plan A for the summer, plan B for later this month.\nI cannot see Dyche here next year under any circumstances (and he knows it) and that probably explains why he's lost the plot this season.\n53 Posted 06/01/2025 at 11:35:20\nAdd to those stats that this season we rank:\n19th for goals scored\n17th for shots on target\n19th for goals per shot\n19th for attempted passes\n19th for completed passes\n20th for completed through balls\n17th for touches in opposition box\n20th for carries into opposition box\nOur attacking prowess and/or intent under Dyche is about as limited as it can be and surely impossible for anyone new to come in and cause to deteriorate.\nThe only thing we do with any degree of competency is defend doggedly, but any solidity shown is not achieved with the aid of a splash of secret sauce that only Sean Dyche knows the ingredients of. We basically get 10 men behind the ball, work hard, aim to deny space and stifle.\nIt’s the exact same way a lower league manager would historically set up a team to combat classier opposition half a century ago. The most basic form of ‘all hands on deck’ defending and it’s been around forever, from the first moment a football manager mouthed ‘fuck me’ and felt his ball sack shrivel at the sight of coming face to face with far superior opposition. Except, more often than not, we tend to try and perform the same trick whoever we come up against and then hope that what is now the oldest team in the league don’t get tired legs and can nick a goal from a set-piece now and again.\nIt’s not a tactic that couldn’t be easily replicated if a new guy decided he ever wanted to run with it, is it? Hopefully though they would look to achieve a balance Dyche hasn’t seemed that bothered with attaining and realise that employing such a rudimentary method almost exclusively (in tandem with the hoof forward to no fucker) is a faster, more effective and horrifying means of neutering all potency than Lorena Bobbit saying ‘morning, love’ while stood over the bed with a meat cleaver and (large) hot dog bun.\n54 Posted 06/01/2025 at 11:45:14\nWe are the lowest scoring team out of the entire 92 in the leagues in 2024. Quite why we aren't seeing empty seats at every home game is beyond me, and how we sell out every away game is even more beyond me. Our fans are loyal to the point of insanity, but this is unwatchable shite that's being served up to us.\n55 Posted 06/01/2025 at 11:50:02\n56 Posted 06/01/2025 at 11:52:26\n57 Posted 06/01/2025 at 11:53:52\n58 Posted 06/01/2025 at 11:59:53\n\"we are dangling on a thread at their mercy\" I'm not sure that crossing \"all fingers and toes tightly\" is the most effective response, Mr Ferry.\n59 Posted 06/01/2025 at 12:06:30\nI was for Dyche staying until the end of the season, however, I think he should go now.\nColeman needs to get the whole overpaid shower in and tell them the facts of life\nLetting Coleman, Baines or the tealady take the team until the end of the season cannot be any worse than what we are getting now\n60 Posted 06/01/2025 at 12:12:41\nIf what I read on here is the case for the prosecution, I'm not sure he will need a defence.\nPerhaps a bit more emphasis on the NOW!!!!!! when demanding his dismissal...Or maybe a few more stats that everyone was already aware of ?\nHe'll stand or fall on results. He may get away with not beating Posh. He may even get away with not beating Villa, but I cant see him getting away with not beating either.\nFailing that. We could always hurry it up by posting \"Has he gone yet ?\"\n61 Posted 06/01/2025 at 14:47:02\n\"Down with this sort of thing, if that is OK?\" 🤣🤣🤣\nPS What board?\n62 Posted 06/01/2025 at 14:51:10\n63 Posted 06/01/2025 at 14:53:28\nThere is a text flying around “X” right now and it is saying that Dyche has tendered his resignation but the club are trying to talk him out of it.\n64 Posted 06/01/2025 at 14:58:01\nMaybe we should start crucifying junior admin staff until we work up to the actual playing staff!?\nOr even take all the players lockers away..?\nSomething really drastic. Even harshly worded post-it notes left around Finch Farm maybe?\n65 Posted 06/01/2025 at 14:59:21\nDoesn't make sense to me, especially when he has been so defiant in the past?\n66 Posted 06/01/2025 at 14:59:44\n67 Posted 06/01/2025 at 15:01:34\nSurely if Dyche tended his resignation, then he would cease receiving money from Everton, whereas if he waited to be sacked he'd be paid off as per his contract?\nI can't imagine the Blues, as inept as we've been on and off the pitch for many years, letting him sign a contract that lets him resign and get the same benefits as being canned.\n68 Posted 06/01/2025 at 15:04:48\n69 Posted 06/01/2025 at 15:05:08\nFormer Burnley boss suggested his side's recent run of one win in 12 games \"doesn't look bad on paper, if there had been a few wins\".\nErm, well erm yeah, 'cos genius you pick up three points if you win a game. If you sit back and go for 0-0 then when your gameplan fails, you get nothing\nA bit like saying, \"If only I had been a lot wealthier and better looking, then I could have shagged Kylie Minogue.\"\nI was a fan of his but this season is awful and he really doesn't look like he cares anymore…\n70 Posted 06/01/2025 at 15:13:14\n71 Posted 06/01/2025 at 15:16:24\nI wouldn't read too much into the shite that often bounces around the cesspit that is X. I doubt the new owners would be fighting to keep him in lieu of his current form.\n72 Posted 06/01/2025 at 15:24:14\nI think Tony is passing on a joke\n73 Posted 06/01/2025 at 17:02:39\nOi, Alan, easy — that's my Mum!\n74 Posted 06/01/2025 at 18:31:16\nLast Season at Goodison and a New Stadium, New Professional Owners, Surviving in the Premier League with a chance to progress.\nOn all these count as opportunities that have been missed to harvest the new found optimisom.How may years have Evertonians waited to get so many positives.\nBut Dyche has turned in on himself obsessed with control and fear of losing.He is apart from the players and fans. They are craving something that they can get behind and play the part of the 12th man, but Dyche appears to be oblivious and unable to harness the positives.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 5283,
  "scraped_at": "2026-02-14T01:55:04.578380",
  "_text_extracted": true
}