{
  "article_id": "b0a166865586",
  "url": "https://www.geo.tv/latest/498875-fifa-bars-saudi-club-al-nassr-from-making-new-signings-over-ahmed-musa-deal",
  "title": "FIFA bars Saudi club Al - Nassr from making new signings over Ahmed Musa deal",
  "date": "20230712T193000Z",
  "domain": "geo.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "July 12, 2023\nFootball's governing body FIFA has banned Saudi club Al-Nassr from making any new signings over the club's failure to pay add-ons owed to the 2016 Premier League champions Leicester City under the Ahmed Musa deal.\nMusa, 30, joined Al-Nassr in 2018 for a £14 plus add-ons fee and left the club after two years in 2020 after appearing in 50 matches and scoring nine goals.\nAn official ruling from FIFA claims that the Saudi side have failed to pay €460k (£390k) plus interest in performance-related add-ons.\nThe ruling was released in 2021 by FIFA making it clear that the Saudi side will be banned from registering new players if they fail to Leicester the required amount, which would apply on both domestic as well as international transfer meaning Al-Nassr wouldn’t be able to register superstars they’ll sign from Europe.\nEarlier, Al-Nassr appointed Luis Castro as a new manager. The 61-year-old Portuguese replaced Rudi Garcia, who was sacked by the Saudi club due to their frustrating finish in the 2022-23 league campaign.\nAccording to multiple reports, it was said that Cristiano Ronaldo — who made a sensational move to Al-Nassr in January 2023 — was heavily involved in the decision-making over a new manager.\nMarcelo Brozovic was announced as a new signing for Al-Nassr.\nThe Saudi club acquired the services of the Croatian — after a long battle with the Spanish club FC Barcelona, in a £15 million deal.\nBrozovic spent eight years with Inter Milan, being one of the key players, he also started the Champions League final in June, which they lost against Manchester City in Istanbul.\nMaking 330 appearances for the Italian club, he scored 31 goals during his time in Italy, winning Serie A once and lifting the Coppa Italia on two different occasions.\nIt must be noted that the Saudia Pro League have taken the football world by storm in the last seven months.\nEver since Ronaldo made his move to the Middle East, we have seen names like Karim Benzema, Roberto Firmino, N’golo Kante and many others following in the footsteps of the five-time Ballon d’Or winner.",
  "word_count": 355,
  "scraped_at": "2026-02-14T02:24:50.289570",
  "_text_extracted": true
}