{
  "article_id": "b0ae671a8c38",
  "url": "https://www.bbc.co.uk/sport/football/66018062",
  "title": "Ilkay Gundogan : Man City confirm captain has joined Barcelona on free transfer",
  "date": "20230626T113000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ilkay Gundogan: Man City confirm captain has joined Barcelona on free transfer\n- Published\n- comments\nIlkay Gundogan says it has been a \"total privilege and pleasure\" to play for Manchester City after joining Barcelona on a free transfer.\nGundogan was offered a new deal by City but will instead move to the Spanish champions on a two-year deal, with the option to extend for another year.\nThe 32-year-old's contract with City expires at the end of June.\n\"Manchester has been my home and I have felt part of a very special family at City,\" the Germany midfielder said. , external\nGundogan played 51 games in 2022-23, scoring 11 goals, as he played a key role in City winning the Treble.\nHe scored six goals in his final seven games - including a double in the FA Cup final win over Manchester United.\nGundogan's contract with Barcelona has a buyout clause of 400m euros.\nHe joined City from Borussia Dortmund for a reported £20m in 2016, and was manager Pep Guardiola's first signing for the club.\nGundogan went on to make 304 appearances, scoring 60 goals, and won 12 major trophies - five Premier League titles, one Champions League, two FA Cups and four Carabao Cups.\nHe said he had experienced \"hundreds of unforgettable moments\" with City and captaining the side to the Treble was the \"greatest experience\" of his career.\nHe added: \"First, I would like to thank Pep. To have been able to play under and learn from him for so long has been something I will never forget.\n\"I would also like to thank all my team-mates - past and present - who have all played such a special part in making my time here so amazing.\n\"Furthermore I would like to thank the incredible City fans. They have supported me from the moment I arrived, and I owe them all so much for their support.\"\nCity director Txiki Begiristain praised Gundogan's \"intelligence, leadership and commitment\" to the club and said those qualities had been an \"inspiration to everyone\".\n\"Ilkay has truly cemented his place in the history of Manchester City and we all wish him well in the next chapter of his career,\" said Begiristain.\n\"And he leaves us knowing that he will always be welcomed at this football club.\"\nGundogan's departure follows City agreeing a deal worth up to £30m with Chelsea to sign Croatia midfielder Mateo Kovacic.\nOur coverage of Manchester City is bigger and better than ever before - here's everything you need to know to make sure you never miss a moment",
  "word_count": 430,
  "scraped_at": "2026-02-14T01:56:02.421201",
  "_text_extracted": true
}