{
  "article_id": "b0c2107d01f5",
  "url": "https://www.themag.co.uk/2025/11/win-the-fa-cup-unless-we-could-win-the-champions-league-newcastle-united-fans/",
  "title": "Win the FA Cup , unless we could win the Champions League ! ",
  "date": "20251115T194500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Win the FA Cup, unless we could win the Champions League!\nWe wanted to get a snapshot of how Newcastle United fans are thinking.\nThree months into the season and 17 matches played so far across three competitions.\nNow in the November international break and Newcastle United fans seeing their team win eight games, draw three, lose six.\nThose results summing up a start to the season with plenty of ups and downs.\nPlenty to talk about as we ask a number of Newcastle United fans, who are regular/irregular contributors to The Mag, to give us their views on the season so far, plus what will happen as we move forward.\nNext up is Matt Busby said to Joe Harvey… answering the questions.\nThree words to describe how you currently feel as a Newcastle fan?\nFabulous – new signings have strengthened the squad, Champions League football is back at SJP and another Wembley appearance is on the horizon\nFrustrated – with the poor league form and FFP more generally\nFearful – for the ordinary fan, with too many being priced out, the ballot process opaque and tickets available to the likes of schools in Dundee.\nThree words to describe Newcastle United now?\nTransformed – on the pitch we are light years from the Mike Ashley days when ambition was stifled and finishing 17th was the main objective. Our first domestic trophy in 70 years evidence of the turnaround.\nShambolic – behind the scenes we’ve seen senior personnel leave and it’s taken an age for them to be replaced. There’s been recent talk of appointing a technical accountant to navigate our way through the FFP minefield, surely 4 years too late for such an appointment?\nCorporate – with every passing day, we hear stories of more folk being priced out with ticket prices soaring.\nAlexander Isak – Time to forgive and forget…? Please discuss.\nForget, yes. Forgive, not on your nelly.\nQuite how, in a matter of months, a bloke can go from scoring the winning goal in helping secure the club’s first domestic trophy to being vilified and reviled by most folk on Tyneside is simply unbelievable. His legacy is forever tarnished and it didn’t have to be like that. I hope his career stagnates and he wins nothing at Anfield.\nIf you had to choose. A win against Sunderland but lose to Fulham in Carabao Cup quarter-final, or lose to Sunderland and go through to Carabao Cup semi-finals?\nIf you can let me know what happens in the semi-final and the final (depending on what happens in the semi-final of course), I’ll get back to you.\nWould winning the Carabao Cup again this season BUT finishing outside the Premier League top six, be success or failure?\nUnbridled success. Winning trophies is what it’s about as far as I’m concerned.\nHand on heart, what is your best estimate (not hope!) of where Newcastle United will end up this season in the Premier League, the Champions League, FA Cup and League Cup, how well they will realistically do in each of them?\nI think we will win one of the cup competitions and finish in the top ten. As above, that would be success in my view.\nIn order, which six NUFC players have been the most impressive so far this 2025/26 season?\nTonali\nWoltemade\nThiaw\nGuimaraes\nBarnes\nMurphy\nIn order, by the end of the 2025/26 season, which six NUFC players do you think will have proved the top performers?\nTonali\nWoltemade\nThiaw\nGuimaraes\nWissa\nGordon\nEight months ago, Eddie Howe banked the first trophy for Newcastle in 56 years, then two months later secured a second Champions League qualification in three years. Some Newcastle fans appear to be questioning his position now. What are your thoughts on Eddie Howe and how much more time has he earned to get the league position sorted and beyond that, or not?\nThe bloke walks on water if you ask me. Totally secure.\nWhat do you think about how the summer transfer window was conducted by Newcastle United?\nIt appeared unedifying and shambolic at times and it seemed to me that Eddie Howe was left on his own to front the Isak business. Whether it was like that in reality, who knows? Despite the lure of Champions League football, we struggled to sign players who ended up elsewhere, so maybe the blocker is our wage structure or a lack of awareness of the club, the region or our fanbase?\nHow much do you think Newcastle United having no CEO or Sporting Director contributed to the fact NUFC signed only one player (Elanga) who had a proper pre-season?\nIt’s got to be a big factor, surely? As above, the club doesn’t appear to be run very professionally.\nIn the future after they have all finished their Newcastle United careers, what is your guesstimate on how the six summer signings will each be assessed. In each case – Thiaw, Ramsdale, Ramsey, Woltemade, Elanga and Wissa to be seen as one of these three choices – A success, Done OK, Failure.\nBased on what I have seen, I think the German pair, Woltemade and Thiaw will be a huge success. I’m hoping the same for Wissa, but obviously haven’t seen him in action yet. I think with the others it’ll be a case of done okay. Elanga hasn’t set the heather alight so far and has been pretty disappointing really. He has got to do better and maybe will if Tino gets back in the side and he has Wissa to hit in the middle. Ramsey I wasn’t that sure about in any event (Morgan Rogers would have been a better signing) and Ramsdale is unlikely to feature enough?\nWhat do you see as three positive things for Newcastle United so far this season?\nProgression in the league cup. Only Man Utd have beaten us in this completion in 90 minutes for a few years now and I’d love to see us make the trophy our own.\nWinning Champions League matches. After being pitched into the group of death in the season before the Swiss model replaced the previous format, it’s clear to see that when Newcastle United are paired against the best of the rest, we are more than capable. Remember, the two sides that progressed from the group of death made the semi-finals, with Dortmund finishing runners up.\nWoltemade’s goals. Signed very late in the window and pitched in at the deep end because of injury to Yohan Wissa, the German hasn’t disappointed.\nWhat do you see as three negative things for Newcastle United so far this season?\nDismal league form. We cannot buy an away win and let’s face it, it’s been a poor start to our Premier League campaign.\nInjuries to Wissa, Livramento and Hall (plus a few others). I don’t think we’ve fielded our strongest eleven yet and whilst the bench is more resilient, the games are coming thick and fast and we could really do with the walking wounded returning to first team action.\nConceding goals in injury time. This is of course, linked to my point above concerning dismal league form. We’ve lost two games in injury time at SJP that we should have at the very least drawn. Very disappointing.\nSunderland are now back in the same division and at this moment ahead of NUFC, your thoughts?\nOnly a fool claims having them in the same league means six easy points. Given their home form and our away form, I’m not looking forward to the derby at their place. Having said that, I expect them to hit a sticky patch at some point and over 38 games, I have no doubt that we’ll finish above them.\nWhat would represent success in the 2025/26 season for Newcastle United?\nAnother trophy. Whilst I’m not sure that feeling last March when the ref blew for time can be properly replicated, I’d love to experience a repeat performance.\nWhat do you see as the minimum to achieve this coming season?\nA trophy or Champions League qualification.\nPredict the top six in the Premier League (in order) and which three clubs will be relegated.\nMan City, Arsenal, Chelsea, Liverpool, Man Utd, Aston Villa\nLeeds, Burnley, Wolves\nWith NUFC now having won a trophy…has that changed your priorities at all with the club now balancing getting Champions League football on a regular basis, compared to try and win cups?\nNo. It’s the exact opposite. Winning trophies is what it’s about. In fact, I’d have rather qualified for the Europa League this season as I think we would have won that. Last year, Spurs finished 17th and won a European trophy, whilst Aston Villa gave the eventual winners of the Champions League their toughest assignment, yet exited from the Champions League at the Quarter Final stage. I know what I would have preferred.\nNext three seasons, would you rather finish top four all three seasons BUT win nothing, or finish mid-table all three seasons AND win the FA Cup in one of the three?\nWin the FA Cup, unless we could win the Champions League!\nWhat are your thoughts on the fact that we are now more than four years after the takeover and still no plans announced on a new training ground, nor a far bigger capacity stadium (either brand new one, or an increased capacity St James’ Park)?\nConcerned. As above, the club doesn’t seem to be run on a professional basis, but is becoming more and more corporate, so to speak. If we stay at St James’ Park, it needs significant investment to expand but no formal announcements make you wonder whether the new owners want to increase the capacity, whether there or elsewhere? It’s still three years until the Euros, where SJP will host five matches, so whilst I can understand why there’s not going to be any construction work being undertaken at the existing stadium anytime soon, that doesn’t prevent an announcement on expansion plans or a brand new stadium surely?\nIf Newcastle United were to look to the transfer market to strengthen the team/squad in January, what do you see as the priority (or priorities…)?\nMore creativity in the centre of the park. Younger legs at the back, another prolific striker and a top, top keeper.\nWould you say winning the Carabao Cup last season has made you more content, or now more desperate to get the next one?\nI’m greedy. I want more and more. As a football club, Newcastle United has massively under achieved in my lifetime (born in ’69). If you convert those ‘near misses’ since the Fairs Cup triumph, I estimate we’d have a roll of honour that would boast 2 Premier League titles, 3 FA Cups, 3 League Cups and a couple more European trophies across my lifetime. Not too shoddy eh? Back to reality though and Newcastle United must not waste any time between the 2025 League Cup win and its next trophy.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1844,
  "scraped_at": "2026-02-14T02:03:26.530341",
  "_text_extracted": true
}