{
  "article_id": "b0d65b0251a1",
  "url": "https://punchng.com/i-hope-osimhen-moves-to-epl-mikel/",
  "title": "I hope Osimhen moves to EPL Mikel",
  "date": "20250429T070000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Chelsea midfielder John Obi Mikel has expressed his desire to see Super Eagles striker Victor Osimhen make a move to the English Premier League but has ruled out Manchester United as a potential destination if they fail to qualify for European competition.\nSpeaking on beIN SPORTS during Soccer Sunday Live, Mikel made it clear that Osimhen’s European ambitions would likely prevent him from joining the Red Devils should they miss out on continental football next season.\n“If that’s the case, then he doesn’t go to United,” the former international teammate of Osimhen said when asked whether a club not playing in Europe next season could rule them out of signing the player.\nThe 26-year-old striker, currently on loan at Turkish champions Galatasaray from Napoli, has played in either the Champions League or Europa League every season since signing for Lille in the summer of 2019.\nMikel also revealed that Osimhen wants to play for Chelsea but stopped short of predicting which team the striker will join next season.\n“I hope somewhere in the Premier League,” he said before adding when pressed further, “I don’t know; we wait and see.”\nThe ex-Chelsea star suggested his former club could easily revive their interest in the Nigeria international, claiming insider knowledge of previous negotiations.\n“I know where we (Chelsea) stopped in terms of the contract, I know where we are,” Mikel said.\n“It’s an easy fix. We did all the hard work last summer. It’s so easy to just pick it up.”\nWhen pushed further during the programme, he conceded that he would definitely need help from Chelsea to make the move happen for his compatriot. However, if that transfer did not materialise again, he agreed that United would be in the frame or Arsenal.\nOsimhen has been in sensational form for Galatasaray this season, scoring 21 goals in just 25 league games while also registering four assists.\nHis performances have attracted interest from several top European clubs, but Napoli’s reported €100m asking price has already seen Juventus withdraw from the race, according to Tuttosport.\nThe steep valuation has potentially opened the door for Premier League clubs, with Manchester United manager Ruben Amorim reportedly keen on the striker to solve his team’s goal-scoring woes.\nThe Red Devils have netted just 39 times in the Premier League this season, making them the fifth-worst attacking side in the division.\nHowever, Saudi Pro League giants Al-Hilal have now emerged as serious contenders for Osimhen’s signature, with Italian journalist Nicolo Schira reporting that the club has already opened talks with the striker’s representatives.",
  "word_count": 427,
  "scraped_at": "2026-02-14T01:52:20.886508",
  "_text_extracted": true
}