{
  "article_id": "b0f068dc41e6",
  "url": "https://www.france24.com/en/live-news/20230812-rows-and-refuseniks-spain-defy-turbulence-to-make-world-cup-semis",
  "title": "Rows and refuseniks : Spain defy turbulence to make World Cup semis",
  "date": "20230812T031500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rows and refuseniks: Spain defy turbulence to make World Cup semis\nSydney (AFP) – Spain were plunged into turmoil when 15 players refused to feature under coach Jorge Vilda, but less than a year later they are in the Women's World Cup semi-finals for the first time.\nIssued on:\nIt is a remarkable turnaround for Vilda and a squad that is not even at full strength in Australia and New Zealand because of the very public disagreement.\nMoreover, there were hints even coming into the World Cup that all was still not well in the Spain camp. Perhaps they are still not.\nBut Vilda's side stuck together to defeat the 2019 runners-up the Netherlands 2-1 in extra time and will face Sweden in the last four on Tuesday.\nEven on the eve of Friday's game against the Dutch in Wellington there was no escaping the turmoil which had threatened to torpedo Spain's World Cup in the past year.\n\"The team is united,\" Vilda said, asked by a Dutch journalist to comment.\n\"We have a group that competes and they are all fighting for the same objective, and they are very motivated.\"\nRow explodes\nDiscontent between players on the one side and the Spanish football federation (RFEF) and Vilda on the other had been brewing for some time.\nIn September 2022 the situation exploded -- 15 of the squad emailed the RFEF to say they did not want to be considered for selection, citing their \"emotional state\".\nThey were unhappy with numerous things: the atmosphere around the camp, Vilda being too strict and the team's lack of success under the coach since his reign started in 2015.\nThe players also objected to travel arrangements and organisation behind the scenes, but the bulk of their complaints were aimed at the 42-year-old Vilda.\nThe RFEF backed the coach however and he omitted the protesting players for friendlies against Sweden and the United States, which Spain drew and won respectively.\nIndeed, including at this World Cup, Spain have lost just twice in 17 matches since the mutiny broke out, validating the RFEF's stance and strengthening Vilda's position.\nWhen Vilda named his squad for the World Cup, three of the 15 protesting players were selected -- Aitana Bonmati, Mariona Caldentey and Ona Batlle, all at Barcelona.\nThey had stepped down from their position, ostensibly satisfied that sufficient improvements had been made in the areas the players demanded.\nBut the absence of another Barcelona trio in Patri Guijarro -- who struck twice as they won the Champions League -- Mapi Leon and Sandra Panos were all expected to hurt Spain.\nIn the build-up to the World Cup, Vilda said that the conflict was \"practically resolved\".\nBut refusing to return, Mapi Leon said: \"I can't go back, there has to be changes.\"\n'Total confidence'\nIt is testament to Spain's depth of talent that at this World Cup they have shrugged off the loss of some top players, and a 4-0 defeat in the group stage to Japan, to reach the last four.\nEven more so because two-time Ballon d'Or winner Alexia Putellas has barely made any impression at the tournament as she struggles to recover form and fitness following a serious knee injury.\nThe likes of Jennifer Hermoso, Alba Redondo and Bonmati have all excelled, while teenager Salma Paralluelo showcased her talent with her classy winner against the Netherlands after coming off the bench.\nVilda has made full use of his 23-player squad, ensuring there is fierce competition for places while also keeping players fresh as they get towards the business end of the tournament.\nAhead of their quarter-final with the Netherlands, a second Dutch journalist attempted to poke Vilda and captain Ivana Andres into a reaction.\nThe reporter put it to Andres that a strength of the Netherlands team was that the players liked their coach Andries Jonker and asked if she had the same fondness for Vilda.\nAndres and Vilda had a brief chat away from the microphone -- probably to ensure she had understood the translation of the question correctly -- and smiled.\n\"We have an excellent relationship with Jorge, we have total confidence in him,\" she answered.\n\"I believe we are a team -- not only the players, but the technical staff.\n\"We all have shared responsibility: if we win, we all win, and if we lose, we all lose.\"\n© 2023 AFP",
  "word_count": 730,
  "scraped_at": "2026-02-14T02:00:36.675746",
  "_text_extracted": true
}