{
  "article_id": "b13719e6908e",
  "url": "https://dailynews.co.tz/jkt-queens-seek-cutting-edge/",
  "title": "JKT Queens seek cutting edge - Daily News",
  "date": "20251114T064500Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JKT Queens seek cutting edge\nDAR ES SALAAM: JKT Queens head coach, Kessy Abdallah says his side must sharpen their finishing as they prepare for tomorrow’s decisive CAF Women’s Champions League group stage encounter against TP Mazembe.\nSpeaking after Wednesday’s 1–1 draw with ASEC Mimosas of Ivory Coast at the Suez Canal Stadium in Ismailia, Egypt, Abdallah acknowledged that while his players started strongly and grabbed an early lead, they struggled to capitalise on several promising chances.\n“We created enough opportunities to win the game but didn’t take them,” Abdallah said.\n“My players know their roles, and we are working together to ensure we convert our chances. We’ll return to training to work on our finishing so that every chance counts in the next match.”\nThe Tanzanian champions have drawn both of their opening group fixtures—0–0 against Gaborone United of Botswana and 1–1 with ASEC Mimosas—leaving them with two points and in need of a victory against the defending champions TP Mazembe to secure a semi-final berth.\nALSO READ: JKT Queens in crucial CAF duel\nAbdallah said his technical team would also focus on improving the team’s balance between defence and attack, enhancing transitions, and maintaining composure in possession.\n“Our focus is on refining all aspects of our game—from structure to transitions and attacking play,” he said.\n“The morale remains high, and the players are confident and motivated. We know what’s at stake and are determined to get the result we need.”\nVictory against Mazembe would send JKT Queens into the knockout stage for the first time, a feat that would underline the rapid progress of Tanzanian women’s football on the continental stage.",
  "word_count": 273,
  "scraped_at": "2026-02-14T02:09:38.464882",
  "_text_extracted": true
}