{
  "article_id": "b14b24dcd560",
  "url": "https://www.caughtoffside.com/2024/07/25/newcastle-transfer-news-jean-clair-todibo/",
  "title": "  Paul Mitchell led talks  for Newcastle target Jean - Clair Todibo last week",
  "date": "20240725T190000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United’s new sporting director Paul Mitchell is believed to be a big fan of Nice’s Jean-Clair Todibo and the Englishman led talks for the defender last week but a deal is unlikely to happen.\nThe Premier League club are in the market for a new centre-back this summer as Sven Botman is set to miss the start of the 2024/25 campaign with an ACL injury. The Tyneside club have already signed Lloyd Kelly on a free transfer but Eddie Howe wants another.\nAccording to journalist Graeme Bailey, Mitchell wanted to bring Todibo to Newcastle this summer but the French star has his heart set on a move to Italian giants Juventus.\nBailey spoke to Geordie Boot Boys about Newcastle’s approach for Todibo last week, saying: “Paul Mitchell led talks with Jean-Clair Todibo’s agent last week.\n“They made an approach, but it has not progressed. The player wants to go to Juventus.\n“At Newcastle’s end, not everyone at the club wants to sign Todibo. Paul Mitchell was the one pushing for him.”\nNewcastle hoping to bring AC Milan’s Malick Thiaw to St James’ Park\nHaving failed to convince Todibo to move, Newcastle hope to get a deal done for AC Milan star Malick Thiaw over the coming weeks. The German defender is the leading candidate to arrive at St James’ Park for the centre-back role and would be a great addition to Howe’s squad.\nAccording to Gazzetta dello Sport via TBR Football, the Magpies are believed to be weighing up whether to make a £25m bid for the Milan star or not.\nThiaw experienced an injury-hit campaign last time around but still managed to feature in 30 matches for AC Milan.\nThe centre-back has been with the Serie A giants since 2022 having joined from Schalke 04 and is contracted at the San Siro until 2027. Newcastle scouts have watched the player a lot in recent years and it is said that they have been impressed by Thiaw’s performances in the Champions League.\nIt remains to be seen if the Premier League club can get a deal done, but the German is certainly a player Howe needs.",
  "word_count": 357,
  "scraped_at": "2026-02-14T02:01:23.788929",
  "_text_extracted": true
}