{
  "article_id": "b17a87c243d6",
  "url": "https://metro.co.uk/2025/04/23/psg-break-33-year-european-record-ahead-champions-league-semi-final-arsenal-22955772/",
  "title": "PSG break 33 - year European record ahead of Champions League semi - final against Arsenal | Football",
  "date": "20250423T080000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris Saint-Germain warmed up for their mouth-watering Champions League semi-final against Arsenal by breaking a European record that had stood for over 30 years.\nPSG were held to a 1-1 draw by Nantes on Tuesday night but the stalemate extended the club’s remarkable unbeaten record in Ligue 1.\nLuis Enrique’s side remain unbeaten in the league with just four games remaining, having clinched the French title with over a month of the season to spare.\nPSG were on course for a 25th win from 30 league games after Vitinha’s first-half opener but Douglas Augusto earned relegation-battlers Nantes a crucial point with a late equaliser.\nWhile PSG were frustrated not to secure yet another win, they still broke a long-standing European record for the most consecutive league games without a defeat.\nThe Nantes draw was their 39th successive unbeaten league game, ensuring PSG broke AC Milan’s 38-game unbeaten streak under Fabio Capello in 1993.\nParis Saint-Germain have in fact not lost a league game away from home in over two years, their last defeat coming against Monaco in February 2023.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nReacting to the Nantes draw and PSG rewriting the history books, Enrique told the club’s official website: ‘First of all, I think we should be happy because we broke this incredible record held by Milan.\n‘It’s very difficult to achieve that kind of record because you need to play very consistently across the seasons and playing away is a different challenge.\n‘It’s always difficult to play away from home, especially in a stadium like here in Nantes, with a great atmosphere.\n‘We’re happy, but at the same time, we made a few mistakes and Nantes took advantage to score their goal. In the end, it’s a draw and we have to keep going.\n‘I think we controlled the match, we managed to contain their counter-attacks and we dominated the game while creating some chances.\n‘We now we need to rest and focus on Friday, as that will be a completely different match.’\nPSG midfielder Joao Neves added: ‘I think it was a very tough match. We did everything we could to go for the win, but there are still things we can improve.\n‘It’s a match to learn from and to grow. I’m very happy to be part of this Paris Saint-Germain team that holds the record of 39 unbeaten away games. I’m really proud of that and we’ll keep going.’\nEnrique’s team face Nice on Friday night before attentions turn to an intriguing Champions League semi-final against Arsenal.\nMore Trending\nPSG scraped past Aston Villa to reach the last-four, while Arsenal stunned defending champions Real Madrid to edge closer to their first ever Champions League trophy.\nLa Liga leaders Barcelona face Serie A giants Inter Milan in the other Champions League semi-final.\nReacting to Arsenal eliminating Madrid, Enrique said: ‘We are in the last four, against one of the best teams in Europe.\n‘It’s a team that has had a very good evolution with Mikel Arteta over the last few seasons and they’re performing very, very well.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Manchester United ‘reach basic agreement’ to sign £64m Chelsea transfer target\nMORE: Ollie Watkins handed Arsenal transfer advice after being dropped for Aston Villa\nMORE: Louis Saha names ‘favourite’ to win Premier League next season",
  "word_count": 618,
  "scraped_at": "2026-02-14T02:09:01.864191",
  "_text_extracted": true
}