{
  "article_id": "b18c36f4e0f7",
  "url": "https://metro.co.uk/2025/03/06/paul-merson-explains-thomas-tuchel-leave-arsenal-superstar-first-england-squad-22678873/",
  "title": "Paul Merson explains why Thomas Tuchel should leave Arsenal  superstar  out of first England squad | Football",
  "date": "20250306T121500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Merson says Arsenal wonderkid Ethan Nwaneri can be ‘superstar’ for both club and country, but should be left out of Thomas Tuchel’s first England squad.\nNwaneri became both Arsenal and the Premier League’s youngest ever player when he came on as a late substitute in the side’s 3-0 win over Brentford back in September 2022, aged just 15 years and 181 days old.\nBut this season the teenager, who soon turns 18, has well and truly announced himself as one of the most exciting young players in European football with a string of magnificent performances for Mikel Arteta’s Gunners.\nWith Bukayo Saka still yet to return from injury, and both Kai Havertz and Gabriel Jesus ruled out for the remainder of the campaign, Nwaneri has shone on the right of a new-look Arsenal attack alongside Leandro Trossard and Mikel Merino.\nNwaneri’s latest exceptional display, which came in Arsenal’s thumping Champions League last-16 first leg win over PSV Eindhoven, amplified calls for the England Under-19 international to be fast-tracked straight into Tuchel’s senior squad.\nThe Three Lions kick off their World Cup qualifying campaign with two home matches against Albania and Latvia later this month and Tuchel is expected to named his group for the double-header next Thursday.\n‘He’s a very good player. He’s a superstar,’ former Arsenal and England midfielder Merson said of Nwaneri’s meteoric rise on Sky Sports News.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘You’ve got to take into consideration how old he is.\n‘He comes into the Premier League and plays at a top team like Arsenal and the pressure is on from the word go.\n‘He’s a top player and he will be a superstar if he keeps his feet on the ground and keeps on working hard.’\nSpeaking after Nwaneri’s emphatic strike against PSV, Joe Cole called for the teen to skip the Under-21s and ‘go straight in with Tuchel’ for this month’s World Cup qualifiers.\nBut Merson hopes England take a more cautious approach with Nwaneri and allow the Arsenal starlet the time and space he needs to develop at his own pace.\n‘I hear about him being in the England squad, this and that, but I’m not sure about that at the moment if I’m being honest,’ Merson added.\n‘I watched him against West Ham two weeks ago and he never kicked the ball, he never touched it.\n‘At this age his games are going to be like that. They’re going to be up here and they’re going to be down there.\n‘It’s only when he gets a little bit older that they will be consistently seven and eights [out of ten] every week.\n‘He hasn’t played in the England Under-21s so I think sometimes we have this thing with England where a player plays and couple of games and then they should be playing for England.’\nMerson – who was capped 21 times by England – is hopeful Nwaneri will go on to earn upwards of 50 caps for the Three Lions.\n‘There’s a lot of talent going forward in the England team that have been around for a while so I’d put him in the Under-21 team first if I was the manager,’ he continued.\n‘But he will be a talent and will, hopefully, go on and get 50 or 60 caps at least.’\nMerson believes his former club can ‘have a right go’ at Manchester United at Old Trafford on Sunday now that Arteta’s men have all but confirmed their spot in the Champions League quarter-finals.\n‘Arsenal have got to go and beat Manchester United now,’ he went on.\nMore Trending\n‘They’re through to the quarter-finals of the Champions League so they can go there and have a right go.\n‘Then they can start resting players if they beat Manchester United. It’s a lovely game if Saka can come back for the second leg and get 30 minutes or 25 minutes under his belt because, as I say, the game is over.\nBut it’s not good for Manchester United this weekend, knowing that Arsenal haven’t got to concentrate on next Wednesday’s game against PSV.]\n‘They can have a right go at Manchester United.’\nShould Tuchel name Nwaneri in England's squad?\n-\nYes\n-\nNo\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Former Man Utd star called an ‘absolute weasel’ for defending Glazers’ ownership\nMORE: Man Utd vs Arsenal: Latest team news, predicted lineups and injuries\nMORE: AC Milan make decision over permanent Joao Felix transfer deal with Chelsea",
  "word_count": 812,
  "scraped_at": "2026-02-14T02:02:35.611045",
  "_text_extracted": true
}