{
  "article_id": "b19d8266511f",
  "url": "https://www.themag.co.uk/2025/03/newcastle-united-official-announcement-devastating-news-on-lewis-hall/",
  "title": "Newcastle United official announcement - Devastating news on Lewis Hall",
  "date": "20250305T124500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United official announcement – Devastating news on Lewis Hall\nLewis Hall missed the Brighton match on Sunday.\nEddie Howe after the match revealing that Lewis Hall had picked up an ankle problem following the Liverpool game last Wednesday.\nThe Head Coach (see below) also stating that Lewis Hall had been for a scan on the ankle before then seeing a specialist.\nEarlier today we reported on a media exclusive from The Mail, where they said that their information was that whilst the full extent of the injury was not known yet, that Eddie Howe and the club had accepted there was no chance of Lewis Hall playing in the Carabao Cup Final in 11 days time.\nSadly, now an official Newcastle United announcement (see below) has now revealed the full extent of the injury, with surgery needed and Lewis Hall to miss the rest of this season.\nAbsolutely gutted for him.\nThe lifelong Newcastle United fan has been brilliant this season and along with Alexander Isak has been one of United’s best two players.\nWe can only wish him the very best of luck on a swift recovery and here’s hoping he will back for the start of next season and in the kind of form shown this current season.\nA massive future lies ahead for both Newcastle United and England, Lewis Hall has a great career and still only 20. Difficult to find positives in such a difficult moment but here’s hoping the rest of the NUFC squad can supply Lewis Hall with a League Cup winners medal AND Champions League football to look forward to when he returns next season. Also, thankfully not a major tournament this summer, so Lewis Hall can be playing for England at the 2026 World Cup Finals.\nNewcastle United official announcement – 5 March 2025:\n‘Lewis Hall will miss the rest of the 2024/25 season after sustaining an injury to a bone in his foot.\nFollowing a scan and advice from a specialist, Lewis will undergo surgery before a period of rehabilitation with the club’s medical team.\nWishing you all the very best for your surgery and recovery, Lewis.’\nEddie Howe on the Lewis Hall injury – Sunday 2 March 2025:\n“It is an ankle problem that Lewis Hall picked up after the Liverpool game.\n“He didn’t really recover well.\n“He felt pain.\n“So he had a scan and now he has been to see a specialist.\n“We are awaiting further news.”\nUpcoming Newcastle United fixtures:\nMonday 10 March – West Ham v Newcastle (8pm) Sky Sports\nSunday 16 March – Newcastle v Liverpool (4.30pm) Carabao Cup final Sky Sports\nWednesday 2 April – Newcastle v Brentford (7.45pm)\nMonday 7 April – Leicester v Newcastle (8pm) Sky Sports\nSunday 13 April – Newcastle v Man U (4.30pm) Sky Sports\nWednesday 16 April – Newcastle v Palace (7.30pm)\nSaturday 19 April – Villa v Newcastle (5.30pm) Sky Sports\nSaturday 26 April – Newcastle v Ipswich (3pm)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 507,
  "scraped_at": "2026-02-14T02:02:35.611738",
  "_text_extracted": true
}