{
  "article_id": "b19ddcf64a5a",
  "url": "https://www.meathchronicle.ie/2023/08/11/eddie-howe-says-newcastle-cannot-slap-money-on-table-in-pursuit-of-signing/",
  "title": "Eddie Howe says Newcastle cannot  slap money on table  in pursuit of signing",
  "date": "20230811T194500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe says Newcastle cannot ‘slap money on table’ in pursuit of signing\nBy Damian Spellman, PA\nNewcastle boss Eddie Howe has admitted he cannot just “slap money on the table” as he attempts to find the last piece of his jigsaw for the new season.\nThe Magpies, backed by their majority owners, Saudi Arabia’s Public Investment Fund, have invested a net £95milion in Sandro Tonali, Harvey Barnes and Tino Livramento at the expense of the departed Allan Saint-Maximin this summer but Howe is keen to add one more player to his resources, with central defence a remaining focus.\nHowever, the 45-year-old knows the club may have to be “creative” to get another deal over the line in an attempt to plot a path through Financial Fair Play regulations, with loans and staggered payments among the options.\nAsked what that meant on the eve of the new Premier League season’s opener against Aston Villa, Howe said: “It means we can’t just go out and slap money on the table and buy a player. We don’t have the resources to do that at the moment with FFP restrictions.\n“It’s about trying to find a different way rather than paying money in the here and now.”\nNewcastle have strengthened their squad significantly after last season’s top-four finish, which secured a return to Champions League football, but Howe is hopeful there is another deal to be done.\nHe said: “I’d love one more player, that’s what I’d love personally, and I think then we’d have the ideal depth at this moment with the injuries that we currently have.”\nThe Magpies’ surge back into the upper reaches of the league table came less than two years into the new ownership’s reign and took many by surprise, despite the £250million spending spree which helped to fuel it.\nThey were able to take advantage of below-par showings from the likes of Liverpool, Tottenham and Chelsea, and are likely to face a tougher challenge this time around with TV pundits Gary Neville and Jamie Carragher predicting they will not even make the top six this season.\nAsked if that provided added motivation, Howe brushed that aside and said: “Ultimately people will always write us off, and I urge us all to come together and to fight tooth and nail to prove people wrong – and in my job you have to prove people wrong every single day.\n“I have said my ultimate emotion that I use is fear of failure. Some people might see that as negative, but it’s fuelled me all my career and to work as hard as I can to make sure we don’t suffer that experience.”\nHowe could hand Tonali, Barnes and Livramento competitive debuts against Villa, while defender Fabian Schar is back in contention after a thigh injury.\nHowever, midfielder Joe Willock is likely to be missing until the middle of next month with the hamstring problem he suffered last season.\nHowe said: “I think we’ll probably miss him for the first group of games before the first international break.”",
  "word_count": 508,
  "scraped_at": "2026-02-14T02:00:36.683354",
  "_text_extracted": true
}