{
  "article_id": "b1c0a389884e",
  "url": "https://www.justarsenal.com/deadline-day-priorities-arsenal-liverpool-villa-and-every-premier-league-side/399211",
  "title": "Deadline Day Priorities : Arsenal , Liverpool , Villa and Every Premier League Side",
  "date": "20250831T164500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nHaving spent over 250 million on seven new faces and learnt from January that it is better to have too many options than too few, it would be greedy to demand any more signings this week. Andrea Berta has earned his money with his recruitment policy this summer but now our Director of Football needs to try and offload some fringe talent. Even if Mikel Arteta was happy to keep some of them, a few are just so far down the pecking order.\nThe problem is some of our peers are aware of this and will take advantage. Let us use Fabio Vieira as an example. Why would a club pay a huge fee when they can call Arsenal’s bluff, loan the midfielder and get him off the wage bill or keep him and pay him to sit at home. Lokonga, Nelson and Zinchenko are in the same situation so expect loan deals or reduced fees. We have to get out of this bad habit.\nAston Villa\nYou may have heard that Aston Villa feel there is a glass ceiling because of FFP rules. They clearly feel it is unfair that they have to sell academy graduates like Ramsey not to breach regulations, the only issue is they go on and on about it. Just because you disagree with the laws does not give you a free pass to make mistakes.\nNo one forced the club to create a wage structure where their wage to salary revenue is over 90 percent. At the Emirates, Old Trafford and Spurs it is approximately 50 percent. In other words, at Villa Park they are paying Champions League salaries for a Europa League squad. Hence why at various times this summer big earners like Ollie Watkins and Martinez could not rule out leaving Birmingham. That is why there is a feeling the team has stood still. With only one new signing they look weaker than last season. In January loans for Rashford and Asensio lifted the club. Is Unai Emery waiting for the last day of the window to do something similar?\nCherries\nHaving grown up in the area, watching the club play in League 2 while buckets went round the stadium asking for donations to keep the Cherries alive, it is crazy to think the likes of Liverpool, Real Madrid and PSG are buying their players. That is a huge compliment to how far Bournemouth have come.\nIt also means they started the season without four of last year’s first choice back five. Iraola was always going to be allowed to spend the money recruited but number wise he probably needs one more defender. Logically it will take time for Truffert, Diakite and Amine Doak to settle but you trust this manager when it comes to his recruitment.\nBrentford\nIn one summer the Bees have lost their manager, captain and top scorer while Yoane Wissa refused to train during pre season. For a club their size there was always going to be a year where it caught up with them.\nYet their owner has to make a choice. Sell Wissa and you have made a lot of money which compensates relegation if the worst were to happen or trust him to stay and score the goals to keep you safe. You sense the whole club needs a lift.\nBrighton\nFor years their recruitment team have been the envy of the rest of the division. They intentionally did their business early this summer knowing Pedro was joining Chelsea. You can never rule out the Seagulls finding another gem at the last moment even if he is a long term prospect.\nThe biggest compliment you can give those working at the Amex is they are always on guard for someone to make a late bid for one of their talents such as Carlos Baleba or Matt O’Riley.\nBurnley\nHaving spent over 80 million on 13 players Scott Parker has made it clear it is more likely the Clarets will reduce rather than increase the size of their squad before Monday. That would mean they rely on their organised defence to stay in the division. The temptation could be in the final hours of the window to see if they can improve their goal scoring threat at Turf Moor. Most likely it would be some sort of loan.\nChelsea\nHave not been given enough credit for recouping over 250 million this summer. Despite that they still have members of their bomb squad, Sterling, Chilwell, Nkunku and Jackson, they want off the wage bill. So if they want to, they have the funds at Stamford Bridge to do something big.\nThey assumed that player would be Simons but it could now be Garnacho. With Man United desperate to get the Argentine off their books the Blues might wait till the last hours of the window to call United’s bluff.\nCrystal Palace\nCould be one of the busiest clubs in the next few days and if they want Oliver Glasner to think about extending his contract they might have to be. You can understand why Steve Parish wanted to see what happened to Eze and Guehi before investing in players but now that he has money for at least one of them, the Eagles owner needs to help a small squad who will struggle to balance a European schedule with a domestic one.\nHis manager is clearly shocked this is how his boss would prepare for their first ever campaign in Europe. The Austrian will not tolerate Guehi leaving Selhurst Park without a replacement. The English defender can leave without a fee next summer so Palace have to weigh up if any sum of money in the next few days is worth costing them an adventure in the UEFA Conference.\nEverton\nIf Everton are not one of the busiest teams in the next few days it will not be for the want of trying. While pace has gathered since David Moyes questioned his recruitment team, he is still short of numbers but admits the Toffees have struggled to get numerous deals over the line.\nOne of many clubs who could be waiting to see where the dominoes fall to get value. I can see them making a lot of late deals on Monday. The likes of Arsenal, Chelsea and Man United all have deadwood that could be of interest.\nFulham\nOne of the quietest teams in the market in the sense of incomings and outgoings, there is a fear at the Cottage that the club is standing still. Not that Marco Silva is content with admitting that his squad are short in numbers. With less than a year left on his contract the manager might look elsewhere if he feels his employers cannot match his ambitions.\nAll summer there have been rumours of loans for Reiss Nelson and Raheem Sterling, two players who want to remain living in London. The type of deals that have led to accusations that the owners now have priorities beyond football.\nLeeds\nHave spent nearly 100 million so are another team who might see which clubs are desperate to loan players out to get them off the wage bill. Deals such as Calvert Lewin on a free transfer. Keep an eye on the profile of any talent they bring in. They seem to be playing Moneyball at Elland Road, only recruiting those over six foot.\nWill Kalvin Phillips make an emotional return home.\nLiverpool\nWe all know the Isak saga will dominate the headlines in the next few days. Do not be surprised if the champions wait till an hour is left of the window to call Newcastle’s bluff with an improved bid.\nLiverpool hold all the cards. They can offer 130 million for an unhappy player or come back in 12 months time and buy the striker for lower value. If they do get the Swede does that mean they cannot pay over the odds for Guehi. Ironically they need a centre back at Anfield more than an attacker.\nMan United\nKnocked out of the Carabao Cup by a League 2 side, Amiron’s body language at Grimsby and comments since, the final days of the market will remind everyone the mess the club is in. You cannot accuse Sir Jim Ratcliffe of not investing in the team’s attack this summer but if he is trying to save costs in all departments, he will not want to carry on paying the likes of Garnacho, Sancho and Hojlund to sit at home.\nThe problem is, like at Arsenal, no one is paying massive fees on top of wages if they do not have to. So United have to accept loans just to reduce the wage bill or selling under value just to move on. They must find money for a keeper. If they do not it will cost them.\nMan City\nLike their neighbours is there a temptation to get another keeper. That might all depend if Ederson leaves but in truth if Pep Guardiola trusted James Trafford enough to bring him back to the Etihad he cannot lose faith after two games.\nCity of course have the resources to find the money if something huge became available but their manager prefers working with a smaller squad and is believed to be content as long as no one leaves.\nNewcastle\nIn a sport where everyone talks off record do not be shocked if Liverpool and Newcastle agreed to get Monday’s fixture out of the way before finding a solution on Isak. The Magpies originally wanted a striker to replace Callum Wilson so Nick Woltemade rumoured arrivals does not mean they are still not in the market.\nThe 25 year old would not be the first or last to compromise with his employers and agree to stay for 12 more months at which point he will not be priced out of a move. Yet he lives in one of the few cities where that might not be enough, even if he scores instantly. A lot of Geordies are really offended by the Swede’s stance and the dressing room seemed wound up the other night.\nThe player of course would know this beforehand and surely would not have burnt bridges with the Toon Army unless his agent had been told a second bid is coming. It would be a huge gamble to turn down over 110 million for someone saying he does not want to be there anymore. Eddie Howe knows him as a person. Would he be professional enough to not let performance levels fall.\nNotts Forest\nNuno Santos clearly feels he needs a bigger squad to juggle a European schedule with a domestic one. You can never accuse his boss of not investing but are manager and owner in agreement on the recruitment policy. Nuno says where last season he spoke daily with his employer, communication has now changed.\nIt begs the question is Edu bringing in what the head coach really wants.\nSunderland\nHave signed 11 players so if they do no business in the next few days you cannot accuse the Black Cats of not giving this window a proper go. More outgoings are likely than incomings.\nIf there is to be one more new face at the Stadium of Light it will be John Lucml although Bologna are standing firm.\nSpurs\nWhile there has been a lot of banter from Gooners about how we stole Eze under their noses, in all seriousness Simons is a quality signing. We know at one point they had activated Gibbs White’s release clause, had a medical booked for Eze and believed that Man City were open to selling Savinho. So we know Spurs are still in the market.\nWith long term injuries to James Maddison and Dragusin, Thomas Frank needs more.\nWest Ham\nOf all clubs in the division I do not think there are a set of supporters more disillusioned than Hammer fans. That is because David Sullivan has put himself back in charge of transfers and they do not trust their owner to do what is best for the squad above finding a cheap deal. Not what the Irons need when their midfield needs freshening up.\nIn fact some supporters are worried about the club letting Paquetta.\nWolves\nEven though you know the transfer market is going crazy when Wolves are rejecting approximately 50 million for Strand Larsen, the club had to reject it. Earlier in the window they might have said yes but to agree this late in the month would essentially be accepting relegation.\nJulen Lopetegui once left because he doubted the ambition of the owners at Molineux. They need to get to Monday night with Larsen still at the club. Ideally bring in some creativity to help him.\nDan Smith\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 2206,
  "scraped_at": "2026-02-14T01:52:36.764149",
  "_text_extracted": true
}