{
  "article_id": "b1e488147787",
  "url": "https://www.themag.co.uk/2024/12/i-was-asked-hypothetically-what-if-eddie-howe-did-leave-newcastle-united/",
  "title": "I was asked hypothetically - What if Eddie Howe did leave Newcastle United ? ",
  "date": "20241211T074500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I was asked hypothetically – What if Eddie Howe did leave Newcastle United?\nI was asked for my thoughts on who I would like to see installed as Newcastle United manager, whenever Eddie Howe eventually leaves.\nIt was a typical hypothetical run of the mill boozer type conversation, that was no doubt instigated by some of the recent discontent within the ranks of some of our support.\nI have said for weeks that at this time I believe Eddie is irreplaceable but that doesn’t mean he is infallible.\nFootball is a results business and the more you win the better you feel. The prestige that goes with being a successful product is ultimately why the Saudi Arabia PIF are on board at Newcastle.\nThat along with the fact that purchasing a majority shareholding in a massively supported Premier League club was obviously a sound investment.\nAnyhow, I went away and thought about the question that I had been asked.\nI must admit that I don’t know a lot about some of the managers and head coaches on the continent that some of those on The Mag comments section, such as Barry and Mavis, refer to.\nSo I am just going to make a few observations on managers I currently admire in this country.\nUnai Emery was United’s first choice to replace the hapless and hopeless Steve Bruce after the takeover in 2001.\nThis was probably the right job at the wrong time for Emery. His current club at the time Villarreal, had just won the first trophy in their history, the Europa League.\nThey were then playing in the Champions League in 2021/22 where they would go on to reach the semi-finals.\nAmbitious Aston Villa would become the Frenchman’s next part of call and so far he has done a bloody good job, apart from when they play us like.\nVilla are flying in this season’s Champions League campaign, under a successful tried and tested manager on the European circuit.\nI think Emery is trying to build something at Villa Park and will be there for the long haul. I think he is loyal and has integrity, just like Eddie Howe, the things every club should savour.\nAnother bloke I like a lot is Brentford’s Thomas Frank.\nHe has been in the Brentford hotseat since 2018 and led the Bees to promotion to the top flight of English football for only the second time in their history.\nHe plucked Ivan Toney from Peterborough United and turned him into an England international.\nHe has an unbelievable eye for a player and Brentford now have quality Premiership performers in the likes of Bryan Mbeumo and Yoan Wissa, as well as Kevin Schade who Frank signed from Freiburg\nThe Dane is modest, polite and articulate, handles the media very well.\nBrentford have never really looked out of place in the EPL,and I believe that Thomas Frank will eventually end up at a bigger club.\nI wouldn’t be averse if that was us at some stage.\nNuno Esperito Santo did a grand job at Wolverhampton Wanderers before an ill-fated spell at Tottenham Hotspur.\nThe very likeable ‘Portu-geezer’ is currently restoring his reputation at a rejuvenated Nottingham Forest.\nHe’ll not end up at Newcastle though, that’s for sure.\nSpaniard Antonio Iraola is beginning to make his mark at Bournemouth. After a topsy turvy couple of seasons after the departure of Eddie Howe in 2020, the Cherries have become a hard team to beat.\nThis is down to Iraola’s shrewd counter-attacking tactics based around hard graft in defence and in midfield.\nBournemouth are a well run club and Iraola is in a good place with his stock relatively high.\nGerman coach Fabian Hurzeler is the youngest boss in the EPL aged only 31.\nHaving replaced the outgoing Roberto De Zerbi at Brighton and Hove Albion in June of this year, Hurzeler has already won an EPL Manager of the Month award.\nBrighton have become an established Premier League club under owner Tony Bloom.\nHurzeler is definitely one to look out for in the future.\nThere are no English managers on my potential shortlist.\nIf, and it’s a big ‘IF’, Eddie Howe is relieved of his duties anytime soon, I wouldn’t want Newcastle to be linked with out of work English bosses Gareth Southgate or Graham Potter.\nIt is now Eddie Howe and his coaching staff’s job to quickly reignite the spark and mood Newcastle United.\nThings have stagnated, turned stale, but I believe Eddie still retains the backing and support of the Saudis and the Reubens.\nThe next few weeks are going to be crucial as to how things pan out over the rest of this season.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 795,
  "scraped_at": "2026-02-14T01:54:53.690169",
  "_text_extracted": true
}