{
  "article_id": "b1ef5c29a476",
  "url": "https://theathletic.com/4428393/2023/04/23/manchesterunited-realmadrid-championsleague-ronaldo/",
  "title": "Manchester United and Real Madrid titanic Champions League tussle 20 years on",
  "date": "20230423T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There are nights when the Champions League feels close to sporting perfection. There is something alluring about the knockout stages in the spring, when the cathedrals of European football shimmer in the early evening twilight and then, as the stakes are raised and darkness falls, it is time for the stars to shine.\nAdvertisement\nDid the stars ever shine brighter than at Old Trafford on the evening of April 23, 2003? Even sitting in the press box as the action unfolded, it felt like a night for the ages: two of the great teams of their era, Sir Alex Ferguson’s Manchester United and Vicente del Bosque’s Real Madrid, trading punches and showcasing their talents: on one side, Roy Keane, Ryan Giggs, Ruud van Nistelrooy and (eventually) David Beckham; on the other, Roberto Carlos, Luis Figo, Zinedine Zidane and Ronaldo.\nIt was one of the great Champions League nights. Not for drama, perhaps, but for what it represented: the essence of European football as it was at that time. United’s have-a-go heroes, Real’s ‘galacticos’ relishing the freedom of expression, Figo and Zidane weaving their magic, Beckham wrestling with Ferguson’s authority and the growing weight of his celebrity… and Ronaldo — the original, irresistible Ronaldo — bringing an away stadium to its feet.\n“It was the first time I had ever seen a whole crowd clap a player who was coming off for the other side,” former United defender Wes Brown tells The Athletic. “He’d had all his injuries by then, but to come to Old Trafford and score a hat-trick — with ease — I felt like I wanted to applaud him myself, even though I was playing directly against him.”\nOthers remember it with the same dewy-eyed fondness.\n“Sometimes football happens,” says former Real midfielder Steve McManaman. And 20 years ago today, Champions League football certainly happened.\nIt was always fascinating to see Ferguson up close at the business end of the season.\nIn that spring of 2003, he was in a permanent state of psychological warfare, his every press conference built around a certain message, whether for referees, his own players, their rivals or indeed their rivals’ upcoming opponents. His every public utterance was laced with intent, which is why it is so strange looking back at some of the things he said before facing the mighty Real Madrid.\nAdvertisement\nWhen the draw for the last eight was made, Ferguson suggested Real “must have picked it themselves”, given Del Bosque had said he hoped to avoid a fellow Spanish team, and that UEFA “don’t want us in the final, that’s for sure”. He was fined 10,000 Swiss francs (£8,944; $11,147) for his trouble.\nFerguson also urged FIFA to ban Carlos for months for barging the referee during a Brazil vs Portugal international, saying that “it shows you the power of Real Madrid when a decision hasn’t been made already”. One of the Madrid sports papers responded with a front-page headline of “Hooligan Ferguson”.\nThe first leg at the Bernabeu saw a Real masterclass. They won 3-1 thanks to two goals from Raul and one from Figo, and there were times when Keane and his team-mates, dragged this way and that, looked like bulls being tormented by a prize matador. Four United players were booked, with Paul Scholes and Gary Neville ruled out of the second leg as a result. The latter likened it to “facing the Harlem Globetrotters. They were passing it about and we couldn’t get near them”.\nBut Ferguson had a different spin on it. Speaking to reporters before the second leg, he suggested Figo’s first-leg goal was an overhit cross and Real’s performance had been overhyped based on “the 10-minute period when they did the sand-dancing”. At another point, he likened Real to “performing seals”, such was their penchant for eye-catching tricks.\nWhen he spoke of “sand-dancing”, he had one particular player in mind. “Zidane does all these fancy tricks without really hurting you,” the United manager said.\nThere were occasions Zidane’s breathtaking technique was not matched by an end product — it would not be sacrilege to suggest there were periods during his time in Madrid when he and his team-mates failed to make the most of their sublime gifts. But in trying to demystify Real’s team of many talents, Ferguson ran the risk of being made to look rather silly.\nAdvertisement\nDel Bosque, usually so reserved, appeared affronted by the suggestion of style over substance. “We are a proper team,” he said. “We like to entertain when we can, but first and foremost we like to fight for the result. We know if we have to play hard, then we can do that. We are enough of a team to perform.”\nTwo months had passed since the incident that briefly brought United to a standstill.\nAfter an FA Cup fifth-round defeat at home to Arsenal, Ferguson had angrily kicked a stray boot across the dressing room and it struck Beckham in the face, cutting his eyebrow.\nIt made front-page headlines: “Fergie decks Becks”. It was even a lead item on ITV’s News At Ten. Since his marriage to Spice Girl Victoria Adams in 1999, Beckham’s celebrity far transcended his status as a high-class midfielder for United and captain of the England national team.\nMaybe it would have been a storm in a teacup had it happened a couple of years earlier. But by early 2003, Beckham’s relationship with the United manager was increasingly strained. Ferguson felt the player had taken his eye off the ball and was at risk of being “swallowed up by the media or publicity agents”. Negotiations over a new contract had reached an impasse and there were growing murmurs that a summer transfer to Real Madrid might suit everyone.\nA flurry of headlines about Beckham appeared in the Madrid sports press in the build-up to the first leg. “This only happened when the draw came out,” Ferguson said. “Shortly after this game, it will vanish.”\nBut Ferguson knew it was more than smoke and mirrors. He had already told United’s board they should sell Beckham that summer if the right offer came in. More immediately, Beckham’s place in the starting line-up was under threat, with Ole Gunnar Solskjaer impressing on the right wing in crucial league matches at Newcastle and Arsenal.\nAdvertisement\nJust before training on the eve of the second leg, Ferguson told Beckham he would only be on the bench. Solskjaer would return on the right-hand side and, even with Scholes suspended, Nicky Butt and Keane would be joined in the middle of the park by Juan Sebastian Veron, who was returning after a seven-week injury absence.\nIn his autobiography My Side, Beckham likened it to “being hit between the shoulder blades. It suddenly felt as if the whole of the season had been about him building up to him doing this to me. I was on the outside, looking in”.\nBy the spring of 2003, McManaman was nearing the end of his time in Madrid, having already won the Champions League twice. Unlike so many English footballers abroad, he had immersed himself in the experience. “Loved it,” he says.\nHis fourth and final year was a struggle, though. Over time, with the arrivals of Figo, Zidane and Ronaldo, not to mention Claudio Makelele and Flavio Conceicao, the former Liverpool winger had been marginalised. Turning down a move to Inter Milan had irked the Madrid hierarchy and an Achilles tendon injury made things worse. By the time the second leg against United came around, he had started just three league games all season and one in the Champions League. He hadn’t played at all for two months.\nFerguson had an inkling Del Bosque might do something different for the second leg. He volunteered that “someone very close to Real Madrid” had told him they were going to switch to a three-man central defence and that, even with Raul forced out by illness, they might “leave out Zidane or Figo or even Ronaldo”. Wishful thinking, as it turned out.\nIn fact, the card Del Bosque had up his sleeve was McManaman, brought in from the cold to start at Old Trafford. For all of Ferguson’s conjecture, it ended up being a straightforward horses-for-courses selection.\nMcManaman was a highly popular figure among Real’s players and supporters. Among United’s fans? Not so much, given his Anfield connections. “I was getting dog’s abuse from the crowd,” he recalls.\nAdvertisement\nDel Bosque played him on the left of midfield. “McManaman played a fantastic game,” the coach says. “He was also very well whistled at Old Trafford.”\nFrom the kick-off, every time Real touched the ball, they were booed by the crowd, who cheered when Butt challenged Zidane from behind after 18 seconds and Makelele then passed the ball straight into touch. By far the biggest jeers were reserved for McManaman. “My Spanish team-mates were asking me what they were saying,” he says. “I couldn’t tell them. I always took it with a pinch of salt and a smile.\n“I always enjoyed going back to Old Trafford. We had been there a few years earlier and got a result (at the same stage in the 1999-2000 Champions League). They were great occasions. I can remember a lot of it. But what stands out in everyone’s mind is Ronnie’s hat-trick.”\nWell, yes, absolutely. But let’s not get ahead of ourselves.\nBefore we reach that, there is an incident that warrants revisiting. As United tried to knock Real’s players out of their stride, with Butt staying close to Zidane, something remarkable happened. John O’Shea nutmegged Figo.\nOver a professional career spanning two decades, in which he won the Premier League five times, the FA Cup once, the League Cup twice, the Champions League once, the Club World Cup once and played 118 times for the Republic of Ireland, O’Shea came to be regarded as a solid, dependable type for United and later Sunderland. He had some memorable moments — not least scoring a winning goal against Liverpool at Anfield — but he tended to leave the fancy stuff for others.\nBut in that 2002-03 breakthrough season, O’Shea was a galavanting right-footed left-back. Not quite the inverted full-back of the modern day, but still quite a revelation. There was a reason United’s fans sang — and occasionally still do sing — “When Johnny goes marching down the wing”.\nAdvertisement\nOn that particular night, he went marching like never before, taking Butt’s crossfield pass on his chest, controlling it with his left foot and then using his right to nudge it through Figo’s legs before carrying on as if this was the most natural thing in the world. If it happened now, it would be the stuff of a million memes.\nSadly, when contacted by The Athletic, O’Shea said he was a little too preoccupied with his coaching responsibilities with Stoke City of the Championship and the Republic of Ireland national team to talk.\nBut he did speak about it a few years ago in an interview with Irish football media outlet Off The Ball. “It was just the game itself,” O’Shea said. “I tried it the odd time in training and things like that, but (it was) just the way the opportunity presented itself.”\nThe way Figo dived in? “Exactly,” he said, “thinking, ‘This fella’s not up to much … .’”\n“Ronaldo was the one I always used to watch when I was growing up,” Brown says. “He was a few years older than me. ‘El Phenomenon’, we used to call him.\n“I wasn’t star-struck by many people, but I loved Ronaldo. Everyone wants to be a centre-forward and score great goals, don’t they? And he made it look easy. This was before Ronaldinho and some of the other Brazilian stars. Ronaldo was doing all these crazy runs and mad tricks when we were younger. And then you’re thinking, ‘OK, I’m playing against him today…’. You do think that way. You wouldn’t be human if you didn’t.”\nIt is easy to forget just how far Ronaldo fell in the years between his spectacular breakthrough at PSV Eindhoven, his unstoppable, unplayable brilliance during his peak years with Barcelona, Inter and Brazil and his triumphant re-emergence at the 2002 World Cup.\nFrom the moment he ruptured a tendon in his right knee when playing for Inter in November 1999, it was one career-threatening setback after another. In his final three years at San Siro, he made just 24 appearances. His call-up to the Brazil squad for the 2002 World Cup seemed to be part charity, part desperation on the part of coach Luiz Felipe Scolari.\nAdvertisement\nRonaldo’s redemption at that tournament was one of the great sporting comeback stories and it led Real president Florentino Perez, quite typically, to devote the rest of that summer to trying to add him to the star-studded team that had just won the Champions League, his €46million (£40m/$50m at today’s conversion rates) capture proved the logical next step in the club’s ‘galacticos’ project.\nA risk? “When he signed the agreement with us, he promised that if he got a knee injury, we wouldn’t have to pay his wages,” former Real sporting director Jorge Valdano recalls. “But then everything went as we expected: for the best.”\n“We all had our doubts about Ronaldo but he was an effective player. He was always brilliant,” Del Bosque says.\nRonaldo scored 30 goals in his first season in Madrid, including two against Athletic Bilbao in the victory that secured the club’s 29th league title, but his hat-trick at Old Trafford is remembered most fondly of all.\nHis first goal came in the 12th minute. One moment United were camped in the Real penalty area. Fifteen seconds later the ball had been swept down the pitch — Carlos to Zidane to McManaman to Figo to Zidane to Guti, in ever-increasing amounts of space — and Ronaldo was streaking through the middle, away from Rio Ferdinand, and shooting past Fabien Barthez at the Stretford End to give his team a 4-1 aggregate lead.\n“Heartbreaker,” yelled ITV commentator Clive Tyldesley. “Ronaldo with a blow to the heart of Manchester United’s hopes. Ruud van Nistelrooy’s away goal has been cancelled out by the pace and the brilliance and the big-match man: Ronaldo.”\nUnited struck back just before half-time with a poacher’s goal from Van Nistelrooy, raising hopes of a comeback as the two teams returned to their dressing rooms with the noise of the home crowd ringing in their ears.\nAdvertisement\nBut Real’s lead was never really under threat. “I felt we were very comfortable as soon as Ronnie had scored his first goal,” McManaman says. “That effectively killed the game. United had a mountain to climb. We had a great team.”\nAnd a coach who knew had to get the best out of them.\n“He didn’t say much,” McManaman says of Del Bosque. “But we had a great group of players and professional lads who didn’t need telling. The mindset was, ‘This is what we need to be successful’. He was never a shouter or screamer. Even when we lost home and away to Bayern Munich the previous season, he was very calm. His man-management was excellent. With Fernando Hierro, the captain, and Raul as his No 2, he knew we could govern ourselves.”\nAnd they could play. For all the “performing seals” talk, some of their football was devastatingly incisive. Their second goal that night was a wonderful illustration of their patience and quality in possession.\nIt began with Zidane sashaying through the middle, away from Giggs. Figo turned Butt inside-out and almost caught out Barthez again with a cross-shot that glanced the far post. McManaman retrieved the ball from the right-hand side and Real started building up again: Carlos, Zidane, Carlos, Ronaldo — like a hot knife through butter, 2-1 on the night and 5-2 on aggregate.\nUnited responded quickly this time, Veron’s shot being unwittingly deflected in by Ivan Helguera. The aggregate score was now 5-3, but Real had two away goals, so the now-scrapped away-goals rule meant they would proceed to the semi-finals unless United got at least another three.\nFerguson’s team tried to force the issue, Solskjaer and Veron forcing Iker Casillas into smart saves, but just before the hour mark came Ronaldo’s piece de resistance, receiving a pass from Figo and threatening to run at Brown before moving infield and lashing a swerving, dipping shot past Barthez from 25 yards. “He’s unreal, isn’t he?” said Tyldesley’s co-commentator, former United manager Ron Atkinson.\n“I was the closest to him and I can remember him running at me and thinking, ‘He’s not going to shoot from there, is he?’,” Brown recalls. “But he did. I remember sliding in, trying to get my foot in the air to block it, and getting nowhere near it. Barthez was nowhere it either. And you’re just thinking, ‘Oh… my… god!’”\nAdvertisement\nHis job done, Ronaldo left the stage on 67 minutes and, as he walked off, making way for Santiago Solari, a ripple of applause went through the home crowd and quickly grew into a resounding ovation — followed by tongue-in-cheek chants of “Fergie, sign him up”.\n“I was watching from the directors’ box,” Valdano says. “What impressed me was that Ronaldo was applauded not only by the Old Trafford stands but by the box. It was unthinkable in Spain. And they did it out of sincere admiration for Real Madrid and Ronaldo.”\n“In football, when you have stars, you know these are the players who make the difference in the end,” says Ricardo, then United’s backup goalkeeper. “A Cristiano Ronaldo, a Ronaldo — at that time Ronaldinho also. These are the games that are decided by the stars. In this case, it was Ronaldo, who won it on his own. Old Trafford applauded and it was wonderful. The fans knew how to reward him.”\n“He was on fire that night,” Brown says. “I’ve spoken to older players since then and asked them to name the best player they ever faced. So many of them say R9 (Ronaldo) because, on his day, if he wants to turn it on, there’s nothing you can do. And that’s what happened to me — and us — that night. Special players do that, don’t they?”\nThere is an alternative view of the Ronaldo hat-trick. It can be seen in the fact that Barthez never played for United again after that night.\nAfter a highly impressive first season (2000-01) in Manchester, France’s World Cup ’98-winning goalkeeper became more erratic in year two and by the final months of 2002-03 there were whispers that Ferguson had lost patience with him and was actively looking for a replacement.\nBarthez had a few eccentric moments in the first leg, besides being beaten by Figo’s floating cross-cum-shot for the opening goal. Four days before the return, he came off at half-time against Blackburn Rovers, replaced by Ricardo, who recalls his colleague “lying there, sort of injured” but says he is unsure whether he was substituted “because of the injury or because Ferguson wanted to change him”.\nBarthez kept his place for the second leg, but it was not a happy experience for him.\nAdvertisement\nA few years ago, Ferdinand revisited this match for BT Sport. The former United centre-back has been known to laud Ronaldo as one of the greatest players in football history but going through the footage again, he felt each of the Brazilian’s goals was avoidable — blaming himself but also, in particular, Barthez.\nThe first? “It’s not a great goal,” Ferdinand said. “It ain’t. I don’t care. Zidane plays into Guti. What a run from Ronaldo. He’s running across there, he shoots an angle, he knows he can’t get away from me there. He knows he’s got to take it early. Barthez, he can only go in the near post. I’ve got him where I want him, going away from goal. He can only go near post…\n“Fabien? Fabien, man! (Calls to someone off-camera for comic effect.) Have you got Fabien’s number? Can we get it? We need to go back over this…”\nThe second goal is a wonderfully worked move from a Real perspective, but Ferdinand winces at the defending — not least his own. There is a lack of awareness. He and Butt are the two players alert to Carlos’ run, but Ferdinand fails to cut out Zidane’s pass while Mikael Silvestre, his centre-back partner, is dawdling on the edge of the penalty area when Ronaldo scores, unmarked, from seven yards out. Only Brown and O’Shea, both playing at full-back, react in the slightest.\n“Let’s dissect this goal,” Ferdinand said. “He’s in the six-yard box. There’s no defender within touching distance. But I could have stopped it at the source. My fault, man. I take that. It was me. I take that.”\nThe third goal? “We’re dropping off. I’ve got to get up. I’ve got to squeeze the play a bit,” Ferdinand says. “But… Fabien, what are you doing?!”\nFerguson was not happy either, dropping Barthez for the Premier League title run-in — and for Roy Carroll, not Ricardo.\nBut as Ferdinand pointed out, it wasn’t just Barthez. Ferdinand had struggled against Raul in the first leg and he certainly struggled against Ronaldo in the second. This was the first season after his £30million transfer from Leeds United, which made him the most expensive defender in world football at the time. It was arguably not until his fifth season, once he had settled into a formidable partnership with Nemanja Vidic, that his performances reached the highest level. “I wasn’t the same player,” he said. “I wasn’t the player that I became.”\nAdvertisement\nAnd Ronaldo? “A pleasure to be on the same pitch as the great man,” Ferdinand said. “But he’s getting a standing ovation, look. The opposing striker is getting a standing ovation at our own ground. Unheard of. Nah, I was embarrassed, man. I was so embarrassed.”\nThis was not how Beckham had imagined it, sitting and watching, powerless, as his team were put to the sword. As for proving a point to Ferguson or indeed his admirers in the Real hierarchy, how could he do that from the bench?\nBeckham finally got the nod from Ferguson’s assistant Mike Phelan, replacing Veron shortly after Ronaldo’s third goal. “I was desperate to be out there,” he writes in his autobiography. “Not to make my point now, but just to be involved in an amazing game of football.”\nHe recalled the atmosphere when he went on as “a bit eerie… as if the cheer I would usually get stuck in some people’s throats” because his tension with Ferguson was impossible to ignore, as were the doubts over his long-term commitment. “It was uncomfortable,“ Beckham said. “But the uncertainty in the crowd just made me all the more determined to make a mark in the time we had left.”\nThree of Beckham’s first passes, two of them sprayed long, went straight to an opponent, no doubt to Ferguson’s irritation, but he soon made his mark. On 71 minutes, he stood over a free kick just outside the Real penalty area. It was around 10 yards right of centre, not the best position for a right-footer, but he was determined to give it a go.\nWhat followed was, he said, “my best free kick ever in a Manchester United shirt”, curled around the wall and in off the crossbar. Game on? Probably not. But if there was one United player who looked like he believed they could score three more, it was Beckham.\nAnd then “all of a sudden”, he recalls in his autobiography, “Madrid players were coming up to me and having a chat while the football — this incredible match — was cracking on around us. First, Guti ran alongside me and asked if we could swap shirts at full-time. Then, Roberto Carlos was grinning at me again: ‘Are you coming to play for us?’. Ten minutes left and it was Zidane’s turn: ‘David? Your shirt?’.”\nAdvertisement\nGamesmanship? An attempt to throw him off his game. Beckham felt they were “just stone-cold sure they could beat us all night long, (so) why not sort out the formalities now?”\nThings briefly threatened to get a little hairy for Real when Beckham reduced the aggregate deficit to 6-5, bundling home from close range after a loose ball ricocheted off Hierro. “We want six!” the fans chanted. But even that would not have been enough. Under the away goals rule, United still needed another two.\nBeckham produced a typical cross to pick out Solskjaer for a free header, but it went wide. The crowd held their collective breath when Beckham stood over another free kick on 89 minutes. But this one sailed over — and United’s chances went with it.\nBeckham felt deflated at the end — another year of frustration for United in the Champions League — but then, “elation washed over me. The reception I got after the final whistle was better than any I could remember at Old Trafford”.\nHe walked off the pitch with the shirts of both Guti and Zidane and he recalls Ferguson congratulating him on his performance. He also told waiting reporters, quite pointedly it seemed, that “I’m not allowed to talk”.\nBeckham left the stadium to meet his agent, Tony Stephens, and a Pepsi executive for dinner in Manchester. “They must have thought I was on something, I was that high,” he said. “I wanted to talk about the game, about my goals, about the crowd, about Ronaldo and the rest of them. I had a grin on my face all evening.”\nWhen he got home, too wired to sleep, he rewatched the whole game. And he says it was when he got to that second free kick, the one that missed the target, that he saw Ferguson’s reaction on the touchline and felt his relationship with the United manager was over.\n“My blood ran cold,” Beckham said. “His face told me everything I needed to know. He reacted as if I’d just lost us the game — as if, in that moment, I’d just got us knocked out of the Champions League. The gaffer had had enough. I’d grown up as a person and he didn’t seem to like what I’d become.\nAdvertisement\n“I already knew that, deep down. His face in the seconds after I’d missed that second free kick made me feel like a door had just been slammed in mine. ‘It’s over. He wants me out’.”\nFerguson had a very different perspective on the collapse of their relationship, saying that Beckham “fell in love with Victoria and that changed everything”, that he remains a “wonderful boy” but that his priorities had changed and that, rather than being forced out, the player wanted to move to Spain.\nTwo months later, Beckham was a Real Madrid player. If you can’t beat ’em, join ’em.\nReal looked on course to retain their Champions League title, but they were stunned by Juventus in the semi-final second leg in Turin. Their coveted ‘Decima’ — a 10th European crown — would not arrive until 11 years later. Perez seemed certain of the brilliance of his star-focused policy, but Beckham was one superstar too many for a midfield that was unbalanced by the sale of Makelele to Chelsea.\nThat night in Manchester was perhaps the last time the first wave of galacticos were viewed with a sense of awe before their mystique, as a group, began to fade.\nFor United, another disappointment in the Champions League — beaten three times in the quarter-finals and once in the semi-finals after their treble triumph in 1999 — convinced Ferguson of the need to rebuild. As well as Barthez and Beckham, others, including Keane, were moved on over the years that followed.\nNot until 2007-08, with a new team built on a formidable defence and featuring the outstanding young talents of Wayne Rooney and Cristiano Ronaldo, would United conquer Europe again.\nThere is another post-script.\nAmong the crowd that night was a 36-year-old Russian who, as far as anyone can recall, was attending his first Champions League match: Roman Abramovich, who sat alongside the Israeli football agent Pini Zahavi in an executive box.\nAdvertisement\nNobody else knew who he was. That included former Liverpool captain and then-Blackburn manager Graeme Souness, who had somehow found himself chauffeuring Abramovich to Old Trafford as a favour to Zahavi. A few months later he realised that the guy who had just bought Chelsea was one of the four Russians he had picked up from Manchester Airport along with Zahavi.\nSouness spent the journey trying to talk football, only to be given short shrift by Abramovich, who presumed him to be a chauffeur rather than a European Cup-winning captain and reigning manager of a Premier League club.\nBut by all accounts, Abramovich enjoyed his evening. It went a long way to convincing him, after all the promptings from Zahavi and friends in high places in Russia, that he should add a leading football club to his investment portfolio. As far as Chelsea fans are concerned, the rest is history.\nElsewhere, though, it might be seen as the end of one era and the beginning of another, heralding the arrival of the billionaire-owner model and all the financial upheaval and political entanglements that would come with it.\nCall it the end of innocence if you like. But that night in Manchester, Abramovich was left spellbound, like the rest of us, by the splendour of the occasion, the bravado of Beckham and of course, above all, the brilliance of Ronaldo.\n“Everybody was standing,” Ronaldo told Sky Sports years later. “I really wasn’t expecting that. I was very surprised by the spontaneity of the moment from a rival crowd. It was a truly magical moment for me, one of the most important in my life.”\nBut let’s finish with Del Bosque, a man of few words, but all of them well judged.\n“I always say Ronaldo was a happy player who transmitted that happiness to everyone else,” the former Real coach says. “Football is not about suffering. It’s about having fun. Ronaldo reflected perfectly why he was in football. He was happy.”\nAdditional contributor: Guillermo Rai\n(Main graphic — photos: Getty Images/design: Sam Richardson)",
  "word_count": 5062,
  "scraped_at": "2026-02-14T01:50:29.474320",
  "_text_extracted": true
}