{
  "article_id": "b1fdd7ab765e",
  "url": "https://www.90min.com/barcelona-confirm-club-legend-coaching-capacity",
  "title": "Barcelona confirm return of club legend in coaching capacity",
  "date": "20240717T143000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona confirm return of club legend in coaching capacity\n- Thiago Alcantara returns to Barcelona to gain coaching experience\n- Spanish midfielder recently retired after injury-hit spell at Liverpool\n- Thiago played under new manager Hansi Flick at Bayern Munich\nBarcelona have confirmed former midfielder Thiago Alcantara will spend time at the club learning under new manager Hansi Flick.\nThe ex-Spain international confirmed his playing retirement earlier in July after an injury-affected spell at Liverpool. He previously starred for Barcelona and Bayern Munich before making his first and only foray into the Premier League.\nIt was soon reported that Thiago was being eyed by the Catalan giants for a coaching role and the club has now confirmed he will be part of Flick's staff for the summer as he trains as a coach.\nA statement reads: \"Having recently called time on his playing career at the age of 33, Thiago Alcantara is set to spend the coming weeks as part of Hansi Flick's staff in order to train as a coach. The former player is expected to remain with the men's football first team squad for the entire summer, and therefore, will be on the US tour.\n\"The midfielder came through La Masia and he and the new blaugrana coach formed a close relationship during the single season that both were at Bayern Munich, when they won the treble.\"\nThiago returns to Barca 11 years after his departure as a player. He won four La Liga titles and the 2010/11 Champions League during his time at Camp Nou before leaving for Bayern, where he became a key player under Pep Guardiola having initially struggled with injury.\nHe won the Bundesliga in each of his seven seasons in Bavaria, with his best campaign coming in 2019/20 as he helped Bayern win the treble.\nSport recently revealed Thiago has been playing a key role for Flick as a multilingual speaker, helping communicate the new manager's ideas to the playing squad.",
  "word_count": 328,
  "scraped_at": "2026-02-14T02:01:23.790656",
  "_text_extracted": true
}