{
  "article_id": "b21580334e1f",
  "url": "https://www.caughtoffside.com/2024/08/15/collymores-column-todd-boehly-hasnt-got-a-clue-man-citys-title-to-lose-ten-hag-under-pressure-and-more/",
  "title": "Collymore column : Todd Boehly hasnt got a clue , Man City title to lose",
  "date": "20240815T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In his exclusive column for CaughtOffside, former Aston Villa attacker Stan Collymore discusses some of football’s biggest talking points, including why the Todd Boehly has been a disaster at Chelsea, why Man City are still favourites for the Premier League, why Erik ten Hag is the manager that’s already most under pressure and much more.\n—\nSaudi’s €350m per season offer to Vini Jr is ridiculous\nIt’s hard to wrap your head around the numbers coming out of the Saudi Pro League. I mean, €350m a year to effectively buy yourself a poster boy for potentially the 2034 World Cup is ridiculous.\nThey could be putting that €350m into Saudi grassroots football and infrastructure, but maybe this is the way that they’re going to go if they want to create a football environment and a football culture in Saudi Arabia.\nI just think that top players can earn top money in Europe, plus win the Champions League, the Premier League, La Liga… and they know that they could still go to Saudi aged 32/33 and pick up the kind of money that Ronaldo, who is no spring chicken and whose output isn’t as good as it was, is getting at the moment.\nIf the Saudi’s had offered five or six of the best young, up and coming players a contract, and spread their hires over the top few clubs in the Pro League, they wouldn’t have had to go to Ronaldo and offer him a ridiculous amount.\nWhy don’t the Saudis just spend their money on fast tracking young talent? Saudi success in a World Cup to be determined by revolutionising their youth system with pathways for players and coaches. Get U17, U18 and U19 coaches working with their young talents, because if Saudi were to get to a semi final or final, that will have 10 times the impact as is any marquee player going there now.\nInward investment in their own football for that kind of money will get them some sort of success with the Saudi national team.\nI’m not even convinced that Vini Jr, if he went there for the kind of money that’s being put on the table, would be half as big a name as Ronaldo.\nThe amount of money… it makes no sense, but the Saudi’s aren’t looking for it to make sense. They’re looking to make an immediate impact on football, like they’ve done with LIV golf, and like they’ve done with boxing.\nIt’s just completely, completely bonkers.\nCan’t look past Man City for the title again\nIn terms of the Premier League, I did my league table and to be honest, I went through it on the basis of what teams have bought, what teams already had etc., and unless Pep isn’t as intense as he normally is – which he certainly isn’t showing any signs of at the moment – then Manchester City will win the league.\nThen it’s Arsenal, a very good debut season for Arne Slot with Liverpool finishing solidly in the Champions League positions, and I’ve swapped out Villa with Man United fourth, Spurs fifth, Newcastle sixth, Chelsea seventh, Villa eighth, West Ham ninth and Brighton 10th. There are not going to be many wild fluctuations next season.\nTeams that are in Europe will find that that does have an impact.\nI like West Ham’s spending and I think that they’ve made some very, very solid signings that will give Lopetegui more tactical flexibility and more options, so they’ve had a very good window.\nI really like the signing of de Ligt too for Man United, and it will be interesting to see what kind of role he plays there. There have been questions of ‘why was he got so cheap? Was he carrying an injury?’ but I think if they’re getting de Ligt at his very best, he will add to Man United.\nAt the other end of the table it’s going to be fascinating to see what Crystal Palace do.\nObviously, they’ve lost Olise and there are rumours of bids of Mateta and Guehi, so that would clip their wings from the high water point of last season, which would be a shame because they were fantastic.\nIt’s Everton’s last season at Goodison and that will mean they’ll want to go out with a bang, and Bournemouth losing Solanke is going to be very interesting.\nWill Ivan Toney be switched on and happy just to be at Brentford, or has his head been turned for good now, and he wants out? I think they could struggle. Forest will be down near the bottom again but I don’t think they’ll go down, though I also don’t think they’ll majorly kick on either.\nI think all three of the teams that have come up will end up going straight back down.\nLeicester have lost players like Dewsbury-Hall and fans can’t yet see what Steve Cooper’s trying to do. Southampton like to get the ball down and like to play through the lines but I haven’t seen enough of them play a system whereby they’re going to be under major pressure for large chunks of games, and whether they can they came out on top. Can they duke it out with teams physically?\nIpswich have a tactical flexibility of being able to get in teams faces, to be able to sit a little bit deeper and to be able to play, but I just think that where they lose points is the fact that just haven’t got very much Premier League experience.\nChelsea’s transfer fiasco proves Todd Boehly hasn’t got a clue\nI think that when Todd Boehly first came in at Chelsea I might have written in this column that the Blues now had a guy with money, wanting to organically grow a football club, that Chelsea will compete, they’ll win the league within two or three years, and they know what they’re doing.\nI’ll scrap that.\nI am happy to admit when I’m wrong, and what we’ve got is, apparently, someone who took his football advice from James Corden.\nUnder Todd Boehly’s reign, which is only two years and two months old, Chelsea have spent the 10th largest amount of money in the Premier League’s entire 32-year history.\nYou’ve got to expect there is a direct correlation between what you spend and what you get in the Premier League. Leicester City were outliers, Villa last season were outliers, but for the most part, if you spend the most money, you’re going to win the title.\nNews that the club want to bring back Joao Felix smacks of the economics of the mad house, and it’s the recruitment of a mad man.\nI genuinely thought this guy would come in as a big hitter, big businessman, lot of money, huge backers, and know what he’s doing, but I’m going to say that Todd Boehly just doesn’t have a clue.\nAs we’ve also seen with Conor Gallagher and Trevoh Chalobah, making them train with the U21s and what have you is an utter disgrace, and it’s something that I would like to see outlawed in football.\nPlayers that go into work and that aren’t wanted by their club is fair enough, but if you’ve been through the system at Chelsea since you’re eight or nine and you’ve been bombed out when you’ve not done anything particularly wrong is an antiquated, disgraceful way of treating professional men.\nWe talk about why footballers don’t have a lot of loyalty, but when you see home grown players being treated like dirt, is it any wonder.\nIt will have an impact in the dressing room too. It’ll ripple through the Cole Palmers, the Sterlings, the coaching staff… and then you end up with a club that just becomes basically a mercenary base for anybody and everybody.\nChelsea, the Saudi Arabia of Europe.\nTen Hag under the most pressure as new season gets underway\nErik ten Hag is the manager under the most pressure this season.\nHe was given a contract extension at Man United not because he’s done well, but on the basis of ‘let’s make him feel a little bit calmer, a little more comfortable. We want to give him the benefit of the doubt.’\nOf course, United won the FA Cup against Manchester City, and if they hadn’t, ten Hag wouldn’t have kept his job.\nIf my punditry and other people’s punditry – that has Manchester United back into the top four – is correct, but then they fizzle out, I think that ten Hag would find himself right on the edge.\nI don’t think there’s anything to worry about with West Ham’s Julen Lopetegui despite all of the new signings needing to gel, for the simple fact that he’s a good enough manager for that size of club and he will be able to get them to where they want to be; in the next two or three seasons getting into European football on a regular basis and maybe winning a domestic cup.\nI don’t think anybody would be tremendously shocked by that, so it should be a realistic aim for Lopetegui.\nHe’ll have a bit of pressure yes, but I don’t think it’ll be anywhere near the same as the sort of glaring spotlight that’ll be on ten Hag at Manchester United.\nIn terms of Arne Slot, I think Liverpool fans never really drive a manager out.\nThey’ve had some managers there that didn’t work, Roy Hodgson being the most notable example, but the Liverpool faithful respectfully held their noses so to speak at that time.\nIt’s massively unknown what’s going to happen, because they’ve just said goodbye to a really big personality, a big character and a leadership figure that everybody walked alongside.\nSo from that perspective, Slot would only really be under pressure if the Reds were marooned in 14th or 15th in the table. Even then, I think that Liverpool would leave things to the end of the season before sacking him.\nUSMNT job is a brilliant move for Pochettino\nI like Mauricio Pochettino and him landing the USMNT job is a great move. The reason why is that they’ve got a half decent team now.\nOf course, they’re looking forward to the 2026 World Cup which is going to be in Mexico, the States and Canada, so I think that Poch will have a high profile prep going all across the world, and in the same way that Emma Hayes’s CV has been done no harm by winning the Olympic gold medal with the US women’s team, I actually do think this is a good job.\nI was impressed with the US at the last World Cup. A bit naive, but they’ve got some talent there, some good young players.\nI think that in a couple of years, if the USMNT were to get to a quarter final or beyond that would be an amazing success for them, and then I think Poch can come back two years wiser, two years older, to a big European job – or even the England job if it’s available.\nLee Carsley has got the nod temporarily, and I think it’s effectively his job as long as he navigates through the results, but there’s nothing to say that it’s nailed on.\nSo for me, if Poch does well in the World Cup, who knows?\nRight job, right time, right man, he can put his Chelsea nightmare behind him now and I wish him all the best.",
  "word_count": 1918,
  "scraped_at": "2026-02-14T02:08:01.868377",
  "_text_extracted": true
}