{
  "article_id": "b2202ef2a221",
  "url": "https://www.nytimes.com/athletic/6415554/2025/06/12/arsenal-transfers-rodrygo-williams-gordon/",
  "title": "Rodrygo , Nico Williams , Anthony Gordon : Analysing Arsenal wide attacker options",
  "date": "20250612T054500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal’s attack needs refreshing. Much of the focus regarding their summer transfer window has understandably been on the centre-forward position, but there is also a clear need to improve manager Mikel Arteta’s options in wide areas if the club are to mount a serious challenge for silverware next season.\nAdvertisement\nBukayo Saka is Arsenal’s star player out wide, but has been relied upon for years. This was highlighted by The Athletic as early as the 2020-21 season, when at 19, he was the club’s third-most-used outfield player behind Granit Xhaka and Hector Bellerin.\nIt was on his 250th Arsenal appearance in December that Saka suffered his first major setback, a three-month hamstring injury — a fate subsequently replicated by fellow forwards Kai Havertz and, to a lesser extent, Gabriel Martinelli.\nAt the start of last season, they would have been Arteta’s ideal starting trio up front. Looking ahead to when the games begin again in August, Saka’s place in the team may be the only one of the three to be considered safe as Arsenal look to significantly enhance their options.\nThe Athletic has reported their interest in Rodrygo and Nico Williams, as well as Newcastle United’s Anthony Gordon. Here, we assess what each of those players could offer Arteta’s side and how they compare to the attackers already at his disposal. Arsenal were also strong contenders for Leroy Sane, but on Wednesday, we reported the Germany forward is looking for a new challenge at Galatasaray in Turkey once his Bayern Munich contract expires at the end of this month.\nRodrygo\nWith over 250 Real Madrid appearances to his name, Rodrygo is the most high profile of these three prospective signings.\nArteta and his coaching staff are fans of the player, who has three years left on his existing contract. The Brazil international is still yet to speak to new Madrid manager Xabi Alonso about his situation, but, per sources who wish to remain anonymous to protect relationships, he wants to feel important wherever he plays.\nJust six months older than Martinelli, the 24-year-old has scored 13 and assisted nine goals in all competitions so far in Madrid’s season. In the Spanish league, he scored six and assisted five. He registered 10 La Liga goals in 2023-24, but his best league campaign for goal involvements was a year earlier, when he scored nine and assisted eight.\nRodrygo has played across Madrid’s front line in their current campaign, but is most comfortable playing on the left or more centrally rather than on the right. That preference for the left side can be seen in that it’s where he tends to create the most, with the left half-space a particularly productive area.\nOf the three players we are looking at in this article, Rodrygo ranks highest in chances created with 2.40 per 90 minutes, followed by Gordon on 1.99 and then Williams on 1.80. The high quality of his team-mates is an important factor in that, but the variation in the types of opportunities he produces for others will be viewed as a bonus.\nAdvertisement\nRodrygo has managed to combine with Kylian Mbappe and Vinicius Junior with shorter passes in congested areas, like the left half-space, which, based on much of the 2024-25 season, would benefit Arsenal hugely. As they often face mid or low blocks in the Premier League, a player with more invention in tight spaces would help unlock tricky defences with more ease, as seen here:\nThe Brazilian is also able to provide crosses from wider areas and create chances for himself by running with the ball, albeit less often than both Williams and Gordon.\nNow into his mid-twenties, Rodrygo has hit an age range Arteta has liked when recruiting key signings in the past. Havertz and Declan Rice were also 24 when they signed for Arsenal in 2023, while Gabriel Jesus and Oleksandr Zinchenko were both 25 when they moved to the Emirates the previous summer.\nAs a two-time Champions League winner, Rodrygo would represent a similar ceiling-raising shift for Arsenal as Jesus and Zinchenko were when they joined from then Premier League champions Manchester City.\nNico Williams\nArsenal have a longstanding interest in Williams. His most recent contract extension at La Liga’s Athletic Club came in December 2023 and runs until June 2027. Barcelona failed in a pursuit of the Spain international winger last summer, while Aston Villa showed interest back in January 2023.\nWilliams has since played a vital role in Spain’s European Championship triumph last July, scoring against England in the final, and helped his Bilbao-based boyhood club reach this year’s Europa League semi-finals. He scored 11 goals and assisted seven in all competitions in 2024-25, with five of each coming in La Liga. His most fruitful top-flight season was a year earlier, when he scored five and assisted 11.\nWhere a player who turns 23 on July 12 stands out compared to other wingers is in his willingness to dribble. While Rodrygo attempts a similar amount of take-ons to Saka per 90, only Jamie Gittens of Borussia Dortmund, Barcelona’s Lamine Yamal and Jeremy Doku of Manchester City had more than Williams in their domestic leagues last season.\nDespite having a lower success rate than those players, his style would bring a different dynamic to the way Arsenal attack on the wings. Primarily playing off the left, he would provide an interesting contrast to both Martinelli and Leandro Trossard, who each attempt at least half as many take-ons as he does.\nAdvertisement\nThe sheer volume of dribbles in comparison to Rodrygo can be seen in how often Williams carries the ball five metres or more before either creating a chance or shooting, as evidenced by his 2023-24 numbers:\nAs is the case with his dribble success rate, there is clear room for improvement in converting those chances and shots into goals. Nonetheless, Williams causes major issues for opposition defences, and here are two examples of how he does that when running with the ball.\nThe first is from a second leg win over Roma in the Europa League round of 16 in March, when Athletic came back from a 2-1 first leg defeat in Italy to advance.\nInitially, Williams pops a smart pass into midfield to keep play moving before receiving the ball again inside the box. The defender is expecting him to go around the outside, but he shifts the ball inside with his left foot, touches it past another opponent and dinks a finish over the goalkeeper.\nThat was his second goal of the game. For the first, he arrived at the back post to apply a finishing touch, which is a theme of his wing play and which has helped him score important goals for both club and country — the Euro 2024 final included.\nFor a more blatant example of Williams’ dribbling prowess, however, below is one of his goals in a 7-1 win over Real Valladolid in February.\nHere, he receives the ball on the touchline and immediately drives at his full-back. He takes a touch inside and bursts in between four defenders (two at a time), leaving one on the floor. Instead of swiping at the ball as soon as he is past them, he takes another touch around the final defender before reversing his finish past Arsenal loanee Karl Hein.\nWhile these examples show him cutting inside, many of the chances Williams created last season came from cutbacks after driving to the byline. One reason why the Roma defender mentioned earlier may have expected him to take the ball on the outside is because that is how most of his dribbles in 2024-25 panned out.\nEven so, the ability to go both ways at pace is something Arsenal could use. Trossard has a nice change of direction in close quarters but lacks pace, whereas Martinelli is quick but can sometimes be caught before finding a pass.\nAdvertisement\nWilliams has been reluctant to entertain the notion of leaving Athletic over the years, but The Athletic reported last summer that his release clause is in the region of €55million ($59m; £47m).\nCompared to Rodrygo, he would represent a different type of signing. He is also slightly younger than the Brazilian and previous Arsenal summer transfers. That would suggest an element of adaptation, but he would also represent a clear gear shift in their wide attacking style.\nNico Williams with an absolute beauty 🤩\nHe has been brilliant this tournament so far 🌟#Euro2024 | #ESPGEO pic.twitter.com/npe7dEXHrH\n— ITV Football (@itvfootball) June 30, 2024\nAnthony Gordon\nGordon has repeatedly punished Arsenal since signing for Newcastle United two and a half years ago. The winger scored a controversial winner in a 1-0 victory at St James’ Park in November 2023, assisted an Alexander Isak winner in a match that ended with the same scoreline in October last year and scored in both legs of their Carabao Cup semi-finals meeting in January.\nOverall, the 2024-25 season was not his strongest. Gordon contributed nine goals and six assists in all competitions, with six goals and five assists in the league. Compare that to his 2023-24 campaign, where he scored 11 and assisted 10 in the Premier League alone — and that in a side who struggled to cope with the demands of balancing Premier League and Champions League football.\nHailing from Merseyside, the former Everton man was unsettled when a potential move to Liverpool collapsed last summer, but in October signed a new contract until 2029. Even so, his and Harvey Barnes’ futures at Newcastle are uncertain, and even with Champions League qualification for next season, potential sales could help Newcastle from the perspective of the Premier League’s profit and sustainability rules (PSR).\nLike Rodrygo and Williams, Gordon brings his own set of skills to the table that set him apart as a left-winger. He likes to create from the left half-space and inside the box, but his threat comes more from runs in behind.\nLike Williams, Gordon represents a stylistic shift to the type of off-ball runs that Arsenal currently deploy.\nAdvertisement\nWhile they already have players who make a fair amount of overlapping runs and runs to receive crosses, in 2024-25, Arteta’s side did not have as many running in behind or ahead of the ball.\nWhile Rodrygo’s short passing and quick feet could disrupt mid or low blocks, runs in behind from Gordon could see Arsenal break before teams settle into a defensive shape. That would make Arsenal more direct than they have been in recent years, but having more than one way of playing would surely be beneficial in a title race.\nRodrygo, Williams and Gordon all have distinctive qualities that could be of use to Arsenal, but landing on which style suits them best may not be an obvious choice.\nCould the decision they take regarding a new striker impact the type of winger needed to best complement that player? Possibly.\nEither way, high-quality wide options do seem to be emerging as the summer transfer market gathers pace.\n(Top photos: Getty Images)",
  "word_count": 1842,
  "scraped_at": "2026-02-14T01:52:26.332938",
  "_text_extracted": true
}