{
  "article_id": "b2374ce1c694",
  "url": "https://www.caughtoffside.com/2025/07/02/alexander-isak-to-liverpool-claim-made/",
  "title": "Liverpool remain interested in signing Alexander Isak this summer",
  "date": "20250702T160000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool remain interested in signing Newcastle United attacker Alexander Isak.\nWith the Premier League champions looking for a new striker to lead their attack due to the uncertain future of Darwin Nunez at Anfield, Isak is their dream transfer target.\nHaving already completed the signings of Jeremie Frimpong, Florian Wirtz and Milos Kerez, the Reds are refusing to stop their summer transfer business.\nArne Slot is eyeing domination in English football in upcoming seasons, he is ready to make a statement this summer by adding more quality to his squad.\nAlexander Isak to Liverpool?\nIsak has established himself as one of the best attackers in the world, not just in the Premier League.\nHe helped the Magpies in their Carabao Cup success and contributed to their qualification to the Champions League next season.\nCommentator Ian Darke has discussed the possibility of Isak signing for the Merseyside club.\nHe told Liverpool News:\n“I mean, you could say there is no smoke without fire, I would think, although he could never say it publicly, I don’t think there are many players lurking around in Europe who wouldn’t be interested in the idea of playing for Liverpool.\n“I would think Isak is probably no exception. I think it would have been a different kettle of fish if Newcastle had not made the Champions League on the last day last season.\n“But they did, it looks like a long shot from where I am sitting, I don’t know what type of discussions have been going on behind the scenes, but you can just imagine there would be riots on Tyneside if Newcastle sold Isak.”\nReds may find it difficult to finance Isak deal\nTo spend around £150 million to sign Isak this summer may not be financially feasible for Liverpool this summer having seen them spend a lot of money on new players already.\nThey may have to come up with a creative solution, one that involves players going in the other direction to St. James’ Park.\nAs it stands, Newcastle United have no intention of letting their star player leave the club and the Reds might have to consider other options in the market.\nWith Champions League football on offer next season, Isak would prefer to stay at Newcastle at the moment to continue his progress and development.\n£85million Premier League star ready to take pay-cut in order to join Liverpool",
  "word_count": 398,
  "scraped_at": "2026-02-14T01:58:41.940215",
  "_text_extracted": true
}