{
  "article_id": "b24f6f3c2e9d",
  "url": "https://www.90min.com/posts/man-utd-5-best-players-february-ranked",
  "title": "Man Utd 5 best players in February",
  "date": "20240301T004500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd's 5 best players in February - ranked\n- The Red Devils won five of their six games in February but struggled with performance levels\n- Erik ten Hag buoyed by upturn in form but key players inconsistent\n- United pushing for top-four finish and Champions League qualification\nIt's been a funny old month at Manchester United.\nThe Red Devils won four Premier League games in a row, propelling themselves back into the mix for a top-four finish, but were also desperately disappointing in defeat against Fulham and also limped over the line against Nottingham Forest in the FA Cup.\nA number of United's key players - Marcus Rashford, Harry Maguire and Casemiro - struggled for form and consistency, but there were plenty of bright sparks to keep things ticking over for Erik ten Hag.\nHere's 90min's five best United players, based on our player ratings metrics.\n90min Man Utd WhatsApp channel\nLooking to keep up to date with everything happening at Old Trafford? Click this link or scan the QR code below to follow 90min's Man Utd WhatsApp channel and turn on notifications to receive all the latest news!\n5. Scott McTominay\nAppearances: 4\nAverage rating: 6.6 (6,7,6,6,8)\nPlayer of the Match: 0\nThere were genuine fears that Scott McTominay was done at Manchester United once his 'McFred' partner (yep, Fred) scuttled off to Turkey to join Fenerbahce.\nBut the Scot has been a goal threat all season long, arriving late in the area to score a number of decisive goals, and he was at it again in February to down UEFA Champions League-chasing Aston Villa.\n4. Bruno Fernandes\nAppearances: 6\nAverage rating: 6.6 (8,6,6,6,7,7)\nPlayer of the Match: 0\nThe artist formerly known as Bruno Fernansch continues to polarise football fans across the United Kingdom.\nIf you're a United fan, you probably love the captain's on-field antics. If you're not, there's every chance you despise Bruno. And while his performances are still not at the standard some would demand of him, it's clear Erik ten Hag still has the back of his skipper.\n3. Andre Onana\nAppearances: 6\nAverage rating: 6.6 (7,8,5,7,7,6)\nPlayer of the Match: 0\nThe pressure is beginning to ease on United goalkeeper Andre Onana, owing to a string of far improved performances.\nOnana has been pretty busy in goal, making far too many saves for Ten Hag's liking, and he's singlehandedly kept United in games at times. Five wins out of six attests to how important he's been.\n2. Kobbie Mainoo\nAppearances: 5 (+1 N/A late sub appearance)\nAverage rating: 6.6 (9,7,5,6,7)\nPlayer of the Match: 1\nThe future of Manchester United's midfield is in safe hands if Kobbie Mainoo sticks around for the foreseeable.\nMainoo, who could be involved in an international tug of war between England and Ghana, scored one of the goals of the season in United's thrilling 4-3 win over Wolves at Molineux, weaving past a number of players before arcing a superb effort into the corner of Jose Sa's goal.\nHis level dipped a little thereafter, but the teenager still performed well in each of United's Premier League wins.\n1. Rasmus Hojlund\nAppearances: 4\nAverage rating: 8 (8,7,8,9)\nPlayer of the Match: 1\nThere can only be one Manchester United player of the month for February and that's unsurprisingly Rasmus Hojlund.\nThe Dane averaged 8/10 in the four games he played before a unwelcome muscle injury ruled him out of United's games against Fulham (a Premier League defeat) and Forest (a late FA Cup win).\nHojlund particularly impressed in the wins over Wolves and Luton Town, and has now registered seven goals in his last six Premier League outings.",
  "word_count": 611,
  "scraped_at": "2026-02-14T01:51:19.047194",
  "_text_extracted": true
}