{
  "article_id": "b2796343d794",
  "url": "https://www.liverpoolfc.com/news/jurgen-klopp-europa-league-challenge-we-have-make-sure-we-perform",
  "title": "Jürgen Klopp on Europa League challenge :  We have to make sure we perform  ",
  "date": "20230920T111500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NewsJürgen Klopp on Europa League challenge: 'We have to make sure we perform'\nJürgen Klopp knows his Liverpool team must be ready to meet the challenge of this season's Europa League campaign.\nKlopp's men will open up their involvement in the tournament when they travel to face Austrian side LASK on Thursday night at Raiffeisen Arena.\nThe Reds and LASK have been joined in Group E of the competition by Belgian team Union SG and Toulouse from France.\nAsked about his ambitions for the Europa League, Klopp told TNT Sports: \"We never had like public targets, we never needed that to go as far as we can.\n\"First and foremost, I think we all have to make sure that everybody, for the team I'm responsible, [but] that we all respect the competition in the right manner [and] that we respect the opponents [in] the right manner.\n\"Wherever we will go that will be a massive game for the teams. Everybody [who] comes to Anfield, it will be a massive game for them. It's also in the Champions League the same.\n\"But it will be here as well, and we have to be 100 per cent ready for that. That's the most important stuff. And what do you say? Don't praise the day before the night? So why should we talk about anything before we even play the first game?\n\"We want to go as far as somehow possible. I would love to go to the final, obviously, but I have no clue if you can reach that because there will be a lot of fantastic football teams in between us and that target. So we have to make sure we perform.\"\nLiverpool's fixtures in Europe may offer the chance for Klopp to rotate his squad and give younger players in his ranks an opportunity should he desire.\nThe boss, though, says that will only be the case if those available prove themselves to be worthy of the chance.\n\"We'll have it definitely like this,\" Klopp added. \"If there will be kids involved that depends on the level the kids can show in that moment.\n\"That means we have real talent there, honestly. But it's not experimental... I think if we don't get hit by an injury crisis or whatever, then we should have enough players to field [on] Thursday and Sunday a top team, and that's pretty much the idea. Then we will see how we build a squad.\n\"I didn't think about that yet, to be honest. These kind of long-term plans make in football absolutely no sense because you can kick them in the bin pretty much a second after you had them for whatever reason. So we will see.\"",
  "word_count": 452,
  "scraped_at": "2026-02-14T02:00:57.128676",
  "_text_extracted": true
}