{
  "article_id": "b27989b421b6",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-transfer-rumours-news/2024/4/29/24144395/thiago-silva-confirms-chelsea-exit-but-to-return-in-near-future-in-another-role",
  "title": "Once a Blue , Always a Blue : Thiago Silva confirms Chelsea exit but vows to return in  near future  in another role",
  "date": "20240429T160000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The expected news has been confirmed this morning. Thiago Silva will be leaving Chelsea at the end of the season. Four years, 151 (and counting?) appearances, three trophies including the Champions League and the Club World Cup. He was already a football legend when he arrived, but now he’s leaving as our Legend as well.\nOnce a Blue, Always a Blue: Thiago Silva confirms Chelsea exit but vows to return in ‘near future’ in another role\nSee you soon!\nThe 39-year-old reportedly has a verbal agreement to return to Fluminense and finish out his playing career at his boyhood club back in Brazil. But once that’s done, he intends to and expressly hoping to return to Chelsea, his now heart-club, presumably in a coaching capacity (he started working towards his coaching badges a few years ago already).\nSo, as he says, this is not goodbye. It’s a see a you later.\nThough that doesn’t make it any less emotional.\nSilva tweaked his hamstring on Saturday, so he may have played his final game for us already. Still, with the season ending at home on May 19, let’s hope we give him a proper send-off for the past four years.\nSee you soon, O Monstro!\n“Chelsea means a lot to me. I came here with the intention of only staying for a year and it ended up being four years. Not just for me but for my family, too.\n“My sons play for Chelsea so it’s a source of great pride to be a part of the Chelsea family — literally because my sons are here. I hope they can continue their careers here at this victorious club that many players wish to be part of.\n“I think in everything I did here over the four years, I always gave my all. But, unfortunately, everything has a start, a middle and an end. That doesn’t mean that this is a definitive end. I hope to leave the door open so that in the near future I can return, albeit in another role here.\n“But…it’s an indescribable love. I can only say thank you.\n“Obviously, when I started here, it was during the pandemic so there wasn’t any fans in the stadium. But through social media, it became something very special to me and then when the fans started coming back to the stadium and life was getting back to normal, I started to feel a lot of affection and respect for my story and for my start here.\n“It is already hard saying goodbye in the most normal of circumstances but when there is a mutual love, it’s even harder. But once a Blue, always a Blue.\n“The way in which I came to the club, with the support of the club, I got to the club as a leader even though I didn’t feel like it having arrived as the new guy. It’s always difficult to integrate but bit by bit I became part of the group and (Frank) Lampard played a big part in that. I am grateful to him for that.\n“[It’s been a] dream, definitely a dream. Not even in my wildest dreams did I imagine that I could achieve such great things and win one of the best professional titles, the Champions League, at one of the biggest clubs in the world.\n“Goodbyes are for those that leave and don’t come back. I intend on coming back one day...”\n-Thiago Silva; source: Chelsea FC",
  "word_count": 578,
  "scraped_at": "2026-02-14T02:13:49.311578",
  "_text_extracted": true
}