{
  "article_id": "b27af573b763",
  "url": "https://metro.co.uk/2025/10/06/arsenal-behind-three-clubs-champions-league-running-reckons-two-time-finalist-24356999/",
  "title": "Arsenal behind three clubs in Champions League running , reckons two - time finalist | Football",
  "date": "20251006T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are ‘one of the candidates’ to win the Champions League this season, but remain behind three other clubs in the running, according to a back-to-back finalist in the competition.\nThe Gunners are full of confidence at the moment after surging to the top of the Premier League table and winning their opening two Champions League fixtures of the campaign.\nMikel Arteta is under some pressure to turn a string of near misses into trophies this season, be it in England’s top flight or at Europe’s top table.\nArsenal comfortably beat PSV and Real Madrid in the knockout stages last season before losing out to PSG in the semis, with the French team going on to batter Inter Milan in the final.\nGaizka Mendieta, who captained Valencia in the 2001 and ’01 Champions League finals, still sees PSG ahead of Arsenal, while he also reckons Spanish giants Real and Barcelona have a better chance of lifting the trophy.\n‘The Champions League is a very demanding competition but I think clubs at this level, they learn season by season and Arsenal are contenders,’ Mendieta told OLBG.\n‘It’s early in the season, but with the new format, let’s see what happens. PSG last year were on the brink of not even making it, they made the cut in the last game.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Arsenal for me, have gained more experience and that brings a lot to clubs and for managers like Mikel Arteta, they can really have the desire to grow and improve on their mistakes.\n‘Certainly they will have improved and this season they may be slightly lower than PSG, Real Madrid and Barca – but for me, they’re one of the candidates.\n‘Arsenal did very well last year and were obviously unlucky coming up against PSG. But certainly, they’ve learned from that and this season we will see a new Arsenal in the competition.\n‘Could we see them in the final and lifting the trophy anytime soon? Why not.’\nChampions League odds\nPSG 11/2\nBarcelona 11/2\nArsenal 6/1\nLiverpool 13/2\nReal Madrid 8/1\nBayern Munich 9/1\nMan City 10/1\nChelsea 16/1\nNapoli 25/1\nInter 25/1\nOdds courtesy of Betfair\nThe bookmakers don’t quite agree with the former Spain international, making Arsenal third favourites behind PSG and Barcelona.\nThe oddsmakers also give Liverpool a better chance of glory than Real Madrid, who are down to fifth favourites, ahead of Bayern Munich.\nArsenal’s much improved strength in depth could see them get over the line this season where they have previously failed to under Arteta.\nThierry Henry certainly thinks so, telling CBS: ‘Arsenal have a lot of big chances to win things this year because the bench can change the game. Every time someone comes off the bench. they change the game for you.\n‘To win and go far and deep in every competition you need to have depth in your squad.\n‘You need to have guys who come on who don’t think about being on the bench and cry about it.\nMore Trending\n‘The group winning is the most important thing.’\nSix teams boast two wins from two so far in the Champions League group stage, with Bayern Munich, Real Madrid, PSG and Arsenal among them.\nInter Milan also have a perfect record, as do Azerbaijani side Qarabag.\nMORE: Rio Ferdinand names Arsenal star Mikel Arteta will be ‘thanking God’ he signed\nMORE: Arsenal’s Mikel Arteta tipped for Barcelona job with potential replacement named\nMORE: Gary Lineker makes new prediction for Arsenal’s £64m signing Viktor Gyokeres",
  "word_count": 637,
  "scraped_at": "2026-02-14T02:12:04.356437",
  "_text_extracted": true
}