{
  "article_id": "b286b5c46813",
  "url": "https://www.teamtalk.com/arsenal/ian-wright-major-flop-crunch-time-buckle-down-risk-fan-wrath",
  "title": "Arsenal news : Ian Wright tells major flop it crunch time as he must  buckle down  or risk fan wrath",
  "date": "20250214T111500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nIan Wright warns Arsenal flop it’s crunch time as he must ‘buckle down’ or risk fan wrath\nIan Wright has told Raheem Sterling it is now or never for him to make his Arsenal spell a success, with the forward expected to step up after yet another injury blow for Mikel Arteta.\nKai Havertz is the latest Arsenal forward to pick up a serious injury, having torn his hamstring during the club’s training camp in Dubai. It is unclear at this stage whether the German will require surgery on the issue, though he is expected to miss the rest of the 2024-25 campaign as he recovers.\nHavertz will soon join the likes of Gabriel Jesus, Bukayo Saka and Gabriel Martinelli in the Arsenal treatment room. Jesus will also be out for the rest of the season after suffering an ACL injury in January.\nSaka has returned to light training as he steps up his return from hamstring surgery, while Martinelli will be out for over a month after picking up a hamstring issue of his own during the recent defeat to Newcastle United.\nArsenal’s injury woes mean Sterling, Leandro Trossard and Ethan Nwaneri are Arteta’s main attacking options in the short term.\nSterling has barely made an impact at the Emirates so far after joining on loan from Chelsea in August. Arsenal icon Wright has now warned the 30-year-old that he is entering a crucial period for both his Arsenal loan and his entire career.\nDuring an appearance on Stick to Football, Wright was asked if Sterling could replace Havertz. The pundit replied: “The opportunity has arisen for him.\n“This the time where he should buckle down and say, ‘I have to make this work’ – otherwise, he’ll go out with a whimper.\n“The last time I saw him come on and do something in a short space of time was against Manchester United. That’s what you want to see from him, just come on and try to make something happen.\n“The fans are hoping as well – you can hear their groans, so you feel that he’s in that place where if he doesn’t do anything positive, he can hear them coming – and that’s not a great place to be.”\nRaheem Sterling must step up for Arsenal\nSterling has previously operated as a false nine at Manchester City, though he prefers to play on the left wing.\nPrevious reports have claimed that Sterling is highly valued at Arsenal and is a respected member of the squad, despite his recent struggles.\nSo far, the 82-cap England international has registered just one goal and two assists in 18 matches across all competitions.\nSterling outlined his desire to try and win the Ballon d’Or when joining Chelsea from City in July 2022. But things did not work out for the player at Stamford Bridge, while his career has declined even further at Arsenal.\nArteta still trusts the four-time Premier League champion though and will likely hand him a start when Arsenal travel to Leicester City in the Premier League on Saturday.\nArsenal will need to go on a brilliant winning run to catch league leaders Liverpool, though the Gunners were given a boost on Wednesday night when Everton snatched a late draw against Arne Slot’s side.\nDON’T MISS: Ornstein confirms devastating Kai Havertz news as Arsenal do ‘groundwork’ for huge Serie A signing\nArsenal transfers: Saliba replacement; big Isak claim\nMeanwhile, Arsenal are reportedly preparing for life without William Saliba amid claims Real Madrid want to sign the defender.\nArsenal have shortlisted rising Bournemouth star Dean Huijsen as a replacement for the French centre-back.\nSeparate reports claim Arteta is determined to help Arsenal win the race for Newcastle United striker Alexander Isak.\nArteta even thinks that signing Isak will give Arsenal a great chance at winning the Champions League in the next couple of seasons.",
  "word_count": 649,
  "scraped_at": "2026-02-14T01:52:15.339079",
  "_text_extracted": true
}