{
  "article_id": "b298401a7623",
  "url": "https://www.themag.co.uk/2024/10/the-yankuba-minteh-question-they-all-refuse-to-ask-liverpool-arne-slot-newcastle-united-brighton/",
  "title": "The Yankuba Minteh question they all refuse to ask",
  "date": "20241019T104500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Yankuba Minteh question they all refuse to ask\nOn 30 June 2024, Yankuba Minteh was sold to Brighton by Newcastle United.\nStatements released (see below) by the two clubs the following day, confirming the transfer.\nAs usual, the transfer fee wasn’t made public, though widely reported as having been agreed at £33m plus potential future add-ons.\nNewcastle United selling two promising young players simply due to the PSR position the club found themselves in, with £50m+ needed to immediately improve that PSR position before 30 June 2024, for the latest three year PSR accounting period deadline.\nElliot Anderson made a lot of headlines as he was a homegrown young promising player who had to be sold.\nHowever, arguably the Yankuba Minteh sale made even bigger headlines, due to the fact he had been bought and sold without ever playing a single minute of football for Newcastle United. Whilst this is the norm at clubs like Chelsea, buying and producing young homegrown players then sending them on loan(s), before then selling them at a vast profit without ever giving them a chance at Stamford Bridge, with it being a first at St James’ Park and that immediate PSR pressure to do the sale, made this Yankuba Minteh sale a much bigger story. For both the media and of course, especially the Newcastle United fans.\nSelling a promising young player without ever seeing him play (for NUFC), Newcastle fans having read and seen from a distance how Yankuba Minteh has progressed and impressed at Feyenoord on loan throughout last season.\nThe Yankuba Minteh debate comes into particular focus today, as he and Brighton face Newcastle United for the first time since the transfer.\nA transfer that was celebrated by the Seagulls and bemoaned by the Magpies.\nYankuba Minteh started the first four Premier League games of Brighton’s season, was then dropped for the next two, before coming back into their team for the Tottenham match, where they went 2-0 down before coming back to win 3-2. Minteh got the first comeback goal which was also his first PL goal. In his seven appearances so far, he has one assist and that goal.\nLike the rest of you, I don’t like to see any promising young player leave Newcastle United, especially when we haven’t even seen them play yet… and especially especially, when it was a sale forced by the PSR position.\nHowever, the way that some Newcastle United fans and indeed the media have gone on, you would think we had lost the next Lionel Messi.\nSo what is the truth?\nWell, obviously Yankuba Minteh was no longer the relative unknown that Newcastle United paid around £7m for in summer 2023. By end of May 2024 he had played a full season in a relatively high level league, played Champions League football, plus became a regular for his country.\nFair to say that all clubs were aware of Yankuba Minteh AND then in June (or before) all clubs would have been made aware that Newcastle United were prepared to sell him, communicated via agents etc.\nWhen this all hit the media, it was Forest, Brighton and Everton that were most frequently named as the clubs keen on buying Yankuba Minteh.\nIt wasn’t Manchester City, Real Madrid and Bayern Munich.\nThis doesn’t mean Yankuba Minteh isn’t a good player, or progress into a very good player.\nHowever, it is a reality check for those claiming Eddie Howe and Newcastle United have made the biggest blunder in the history of football.\nHowever, in particular, there is one Yankuba Minteh question they all refuse to ask.\nIf Yankuba Minteh is going to be the next World superstar, why did Arne Slot and Liverpool have zero interest in buying him?\nArne Slot spent an entire year working with Yankuba Minteh, watching him train every day, watching every minute he played for Feyenoord, endless conversations, knowing all of the physical metrics he was capable of.\nArne Slot agreed to join Liverpool in April of this year, he made this public in May, then started work on 1 June 2024.\nYet Arne Slot and Liverpool never showed any interest whatsoever in signing Yankuba Minteh. Why does nobody in the media ever pose this question? Why do so many Newcastle United fans not wonder about this?\nThe thing is as well, the situation at Liverpool is crying out for a promising left-footed right winger to be brought in. Mo Salah turns 33 before next season, his contract ends in June 2025 and so far has refused to sign an extension. So surely it would have been absolutely perfect timing to bring in Yankuba Minteh for a nothing fee by Liverpool standards, to have a season learning the ropes, before being properly unleashed next season on the right side of Liverpool’s attack.\nAgain, this is not to say Minteh isn’t going to prove a good player, he very likely will be.\nHowever, if we go on the actual facts, Newcastle United haven’t stupidly thrown away the next Diego Maradona, or Lionel Messi.\nInstead, they made the very difficult decision to sell two promising young players, rather than selling atop quality player such as Anthony Gordon, Bruno Guimaraes or Alexander Isak.\nNewcastle United official announcement – 1 July 2024:\n‘Newcastle United winger Yankuba Minteh has moved to fellow Premier League side Brighton & Hove Albion on a permanent basis.\nThe 19-year-old Gambia international joined the Magpies from Danish side OB last summer and spent the duration of the 2023-24 season on loan at Feyenoord.\nNewcastle United extends its best wishes to Yankuba for the future.’\nBrighton official announcement – 1 July 2024:\nWe are pleased to confirm the signing of Yankuba Minteh from Newcastle United, for undisclosed terms.\nThe winger has signed a contract that runs until June 2029.\nThe 19-year-old arrives at the club after a hugely successful season on loan with Eredivisie runners-up Feyenoord, where he scored ten goals and registered six assists in 27 league appearances.\nTechnical director David Weir said, “Yankuba is a young talent that has attracted a lot of interest, so we’re delighted to welcome him to the club.\n“He is an exciting attacking player with incredible speed. He had a very impressive campaign with Feyenoord, gaining experience in both the Champions League and Europa League.\n“Now we will give him the time and support he needs to ensure that he settles in.”\nYankuba made the move from Gambia to Europe in 2022, when he joined Danish side Odense BK.\nThere he contributed four goals and six assists in just 17 appearances, which convinced Newcastle to sign him in June 2023. He was immediately loaned to Feyenoord where he made a total of 37 appearances in all competitions.\nThat included four appearances in the Champions League, in which he scored once.\nMinteh has made seven appearances for The Gambia, scoring three goals.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1162,
  "scraped_at": "2026-02-14T01:51:57.644917",
  "_text_extracted": true
}