{
  "article_id": "b29f675ba7ba",
  "url": "https://www.themag.co.uk/2023/04/spurs-fans-comments-ahead-of-facing-newcastle-united-a-pleasure-to-read/",
  "title": "Spurs fans comments ahead of facing Newcastle United - A pleasure to read ! ",
  "date": "20230421T084500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spurs fans comments ahead of facing Newcastle United – A pleasure to read!\nReally enjoyed reading these comments from Spurs fans ahead of their trip to Newcastle.\nI hope Sunday’s match turns out as well as they are expecting!\nHonestly, is there a more entitled fanbase than the Spurs fans?\nThe way they are going on, you would think they’d dropped through the divisions like the Mackems did, when our friends down the road managed the remarkable feat of finishing rock bottom in the Premier League AND rock bottom of the Championship the next season!\nInstead, Spurs fans see their team still in fifth place and Champions League / top four still a possibility.\nA possibility that is, if everybody associated with their club was pulling together, which clearly is not the case.\nThe desperation of Spurs fans for sympathy due to their supposedly terrible suffering is laughable.\nSpurs fans commenting via their main supporters forum TheFightingCock:\n‘This could end up being really bad.\nThey will smell blood and they will go for the kill. Our players won’t be able to handle that atmosphere and Newcastle know that if they win, that’s pretty much Champions League football for them. They’d be 6 points clear of 5th place with a game in hand and 6 games to go with us having to play Man Utd and Liverpool within the following 7 days.’\n‘As we are playing like a Sunday league team, this game is being played on a Sunday.’\n‘We’ll lose this by 3 or 4.’\n‘Might be the first game this season I deliberately avoid, this team is insulting to watch right now.’\n‘Just think, in 12 months time we might be looking back at this as a golden period ?’\n‘I’ll still watch this, as unlike the Bournemouth match, I’ll go into it with little hope and see if we can manage a smash and grab. I know it’s not the most inspiring approach, but I’ll manage my expectations and, at the very least, be able to enjoy the moans and groans if there are any as these will be from the Toon supporters!’\n‘Having watched their game against villa we could really get at their defence but we won’t and I can see a heavy defeat coming our way.\nIf the game was today in my current mood I would not be going -.got a week to get over my sulk will that be long enough ?’\n‘At some point in the next 7 games we are going to take a 4 or 5 goal shoeing. Don’t think it will be this one, probably Liverpool. We’ll still lose this though 2-0.’\n‘Could not care less. If we won’t get top 4, I genuinely hope we lose every single game until the end so we get 8th and miss on Europe altogether. Sometimes a short-term pain is beneficial in the long-run.’\n‘First time in years that I genuinely do not care about a game. They will beat us easily, 99.99% guaranteed.\nTrippier playing will be the ultimate illustration of what’s wrong with this club. A player who cost us £3m is now captain of a top 4 side (after winning La Liga) and we have since spent £115m on 4 RBs who are all worse than him.’\n‘Not watching.\nWe’ll get pumped and Sky will wax lyrical about the symbolic passing of status from us to the Geordies.’\n‘At this point I’m not even in a rush to get settled in the house before kick off.\nI’m numb to it now, like a football version of depression.’\n‘Just our luck to get newcastle on a losing streak\nno doubt they will turn up for us and we allow them too.’\n‘It reminds me of the time when we were at home to a relegated Newcastle on the last day of the season, needing a win to guarantee finishing 2nd and crucially, finishing above Woolwich, we turned in the most lazy, lacklustre performance of any Spurs side I’d seen in years.\nThis is the same as that, but over a prolonged period of matches.’\n‘Wasn’t that the game we let Moussa Sissoko score 9 (well, 2 at least!)\nI swear that’s the only reason we bought him…\nSame as we bought Ruel Fox and Andy Sinton ‘cos they played well against us, ONCE!\nThat’s not a scouting mission… That’s buying a player based on ONE good game against us….\nOn that logic, we should buy every opposition player we face!!’\n‘We’ll win this. Got a good record up there since they used to pump up 7 nil when shearer played. Atouba scored that goal in that 1 nil and I swear we’ve been decent up there ever since.’\n‘If Villa can beat them, so can we.’\n‘Hummmm Villa have a team, one full of hungry, combative lads, playing for a clever, ambitious coach. We have…hum…Dier and Lenglet, managed by a dinosaur.’\n‘It’s mental – we are 3 off 4th with 7 to play and the despair is the complete opposite of last season.\nI would absolutely sack the 3 at the back Italian fraud tomorrow and bring in Poch. If not him, anyone – even Chris Powell.\nIt’s there to be chased with some ambition.’\n‘Newcastle fans will make it a cauldron, their managers knows we are a soft touch and will wilt under the pressure, they won’t give us any respect or time on the ball.\nWe will still be feeling sorry for ourselves because we had a few boos…diddums.\nCan see us being on the end of a pasting, wouldn’t at all be shocked to see us ship 4+.’\n‘My wife and I are going to this , our seats are in Row W so we probably won’t be able to see the pitch which will most likely be a blessing.’\n‘Lloris and Dier will mess around with the ball at the back, inviting a mental press from their players and getting st James’ park roaring them on. We will fold as easy as you like.\nAt 2 0 down, we might try and be attacking.’\n‘I think we have to prepare for the worst, Newcastle are on their way up, we are on the way down, I expect nothing from the game and I’m confident that the team will deliver exactly that.’\n‘4-1 Newcastle, Dr. Tottenham to help them get their top 4 bid back on track.\nWe will be under villa and Brighton by may, would put money on it.’\n‘A draw likely suits Newcastle more than it does us; so I would expect that they would be quite happy to keep the game at 0-0.\nThen time to role the dice and push for 3 points in the last 10 minutes. Of course, every chance we concede on the counter.’\n‘Any away fans should be given a medal.’\n‘Honestly forgot about this match , can’t wait for this season to be over so we can reset!’\n‘Newcastle are an ok team with an ok manager. Nothing more but have cohesion. Would like to see a reaction from players from last weeks disaster.’\n‘Yeah they are well organized and hard working but our team from previous seasons would slap them up comfortably.\nThey are probably going to get top four purely off the back of us, scousers and Chelsea being awful.\nSadly we aren’t that team, so expecting to get mullered, our soft as butter lads vs a flag waving belly out and very vocal Sid James\nNay chance pet.’\n‘All Howe has to say is this lot are good for a mistake, have no pride and are mentally frail. Job done.’\n‘I’m happy this game is not at home. Some of our fans are embarrassing the club and hurting the players. This is a time we need to get behind the players, not go against them.’\n‘I’d like to see Lloris, Dier, Sanchez, Perisic, PEH & Kulu dropped for this one.’\nThe fans do get behind the team, usually right up until one of our many donut players gaffs away a goal.\n‘Where is this sudden fetish with attacking our fans coming from?\nI don’t go, but those that do go are still shelling out fortunes to go and watch absolutley rubbish football.\nI’m amazed the stadium is even half full these days.\nYou owe those people a bit of respect.’\n’23rd January! the last time we won an away PL match. Now we have lost a home match when our Home record was ok. Difficult to see us winning this and an away draw would not be a bad result in isolation but will not help us overhaul Newcastle.’\n‘Afraid of a team managed by BeHeddie Howe\nWhat have we become…’\n‘Likely to be their best atmosphere of the season and our players will likely s… themselves in the process.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1490,
  "scraped_at": "2026-02-14T01:50:29.477189",
  "_text_extracted": true
}