{
  "article_id": "b2ab66fc55bb",
  "url": "https://www.newsweek.com/overlooked-storylines-watch-2023-2024-premier-league-season-1819018",
  "title": "The 5 Overlooked Storylines to Watch for in 2023 - 24 Premier League Season",
  "date": "20230810T231500Z",
  "domain": "newsweek.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A new sports season provides a fresh beginning. Since everyone starts with the same record, it's easy to focus on big-picture storylines.\nThe narrative around the 2023-24 Premier League campaign is no exception to that norm. Clubs like Arsenal, Manchester United and Manchester City are dominating the headlines. There are 20 teams in the division though. What about the rest of the landscape?\nThankfully, we've got you covered. Here are five overlooked storylines from exclusively outside of the \"Big Six.\"\nCan Brighton Continue to Be Bigger Than Any One Name?\nRemember the Energizer Bunny and how it kept going regardless of the circumstances? Brighton seems to have taken a page from that mascot's book.\nConsider the players the Seagulls have sold in recent years: Alexis MacAllister, Robert Sanchez, Leandro Trossard, Marc Cucurella, Yves Bissouma, Ben White and Dan Burn. Manager Graham Potter was also poached by Chelsea during the 2022-23 campaign, and Moises Caicedo has been linked to England's biggest clubs, although a deal has yet to materialize.\nWhile those sorts of departures might suggest an impending collapse, especially for a smaller club, that hasn't happened. If anything, Brighton has gotten better and better.\nLast season, Roberto De Zerbi stepped in for Potter and guided the Seagulls into sixth place, qualifying for the Europa League and giving the club its first taste of European action. That's a great achievement, but it also presents a challenge.\nCould that added competition, not to mention the extra travel, be the straw that breaks the camel's back and pushes the squad too far? Is it possible to keep selling players without getting worse?\nOr will Brighton's recruiting department continue to work magic, plucking promising players out of nowhere to replace the departures?\nCan Newcastle Hang With the Big Boys?\nYou might consider the inclusion of Newcastle to be cheating since they finished in the Champions League places, but I'll allow it since they sit outside of the modern \"Big Six.\"\nWith that disclaimer out of the way, let's get down to brass tacks. Last year, the Magpies proved to be one of the surprise squads. Despite the arrival of new ownership, Newcastle didn't have that many massive purchases. Sure, money was spent, but it's not like Kylian Mbappe showed up on Tyneside.\nInstead, defense proved to be the name of the game. Eddie Howe's team conceded 33 goals, finishing tied with Manchester City for the fewest allowed in the division. Newcastle also played at a high intensity, tactically using dead-ball opportunities to recover before the next push. Was it infuriating to play against? Yes, but it paid off.\nThis year, though, things will be different for several reasons. Not only is Newcastle no longer a surprise outfit—everyone has seen a season of matches and knows how they want to play—but European commitments will test the squad's depth. It's easy to play at high intensity when you have one match a week; traveling for a midweek engagement and taking the pitch a few days later doesn't allow for the same recovery.\nIt's also worth noting that the Premier League is theoretically going to be stricter about adding on stoppage time, which could take some of the wind out of Newcastle's sails. Gaining a mid-game breather provides less of an advantage when you're on the pitch for 103, rather than 93, minutes. While it's possible that those rule changes will fade away as the season progresses—as each summer's refereeing focus seems to do—the Geordies will have to adjust, at least for a little while.\nCan Brentford Keep Afloat Without Ivan Toney?\nSince returning to the Premier League ahead of the 2021-22 season, Brentford has established a reputation as a club that does things the right way and punches above their weight. A key part of that success, however, has been striker Ivan Toney.\nThe England international scores the majority of the Bees' goals—he notched just over a third of the club's league goals during the 2022-23 Premier League campaign—and is central to their style of play. His ability to both hold the ball up and finish chances in the box may seem old-fashioned, but it's allowed Thomas Frank's side to more than hold its own.\nSo, what's the problem? As laid out by ESPN, Toney is banned until January due to 232 breaches of the English Football Association's betting rules.\nAs noted above, removing the forward from the lineup is a one-two punch. Not only will someone need to replace Toney's goals, but the lack of a focal point will potentially require tweaks to the club's style of play. There are options—Yoane Wissa, Bryan Mbeumo and Kevin Schade can all pitch in—but none of them are ideal replacements.\nBrentford has developed a reputation as a club capable of making savvy, Moneyball- style signings to keep the assembly line moving, but replacing someone as central as Toney could put that ability to the test.\nIs the Luton Town Fairy Tale Destined to End in Disaster?\nSports fans, no matter where they're located, love a good Cinderella story. Luton Town is certainly providing one of those.\nThe Hatters slipped down the football pyramid as far as the fifth tier, spending some time in non-league football, but managed to climb their way out of the metaphorical mud. The recovery was officially complete in May 2023, when victory over Coventry City sealed promotion back to the Premier League.\nThe fairy tale doesn't end there, though. Pelly Ruddock Mpanzu made history, becoming the first player to climb from the non-league level to the Premier League with the same club. Luton's home ground, Kenilworth Road, holds just over 10,000 fans and is tucked among houses; it's like something out of the soccer version of Hoosiers.\nBut despite those storylines, there are games to be played. And all of the feel-good factors in the world are irrelevant once the whistle blows.\nAt the same time, though, home-field advantage can be a real thing. Sometimes teams are just destined to reach the Promised Land; think back to the year Leicester won the league and how many breaks just went in its favor.\nWill Luton be able to turn its tiny home ground into a fortress and keep that Cinderella Story going? Or is reaching the Premier League the metaphorical ball, and it's time to turn into a pumpkin?\nWill Burnley Stylistically Stick or Twist?\nIf you're a modern Premier League fan, you probably have a certain association with Burnley. You'll remember the Sean Dyche version of the Clarets, which got physical, played long balls and defended as if the players' collective lives depended on it.\nWell, relegation ended that era, and you might be surprised by what you see this season.\nUnder Vincent Kompany, Burnley has changed. Ball possession, attacking fluidity and goals are now the name of the game.\nThat reality makes sense. Kompany, after all, captained Pep Guardiola's Manchester City teams before riding off into the sunset. The Clarets' passing maps resemble what teams like City and Arsenal try to do with the ball.\nThe catch, however, is that Burnley doesn't have elite talent and billions of dollars to spend. And trying to use top-level tactics with (respectfully) lesser players can be a recipe for disaster.\nConsider what happened when Burnley met Manchester City during this past season's FA Cup. The Clarets tried to play their game and lost 6-0. That's acceptable in a single-elimination tournament, but suffering those sorts of results during a league campaign could devastate the squad's confidence.\nWhen the season begins, will Kompany believe that his style is good enough to defeat bottom-half teams, making potential drubbings at the hands of the superpowers irrelevant? Or will he try to rein things in, compromising his principles in exchange for a bit more pragmatism?\nWe'll have to wait and see.",
  "word_count": 1300,
  "scraped_at": "2026-02-14T01:53:51.860844",
  "_text_extracted": true
}