{
  "article_id": "b30b5274e1c4",
  "url": "https://www.myjoyonline.com/why-alonsos-chances-of-survival-at-real-madrid-are-slim/",
  "title": "Why Alonso chances of survival at Real Madrid are slim",
  "date": "20251208T224500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nXabi Alonso's Real Madrid fate has not yet been decided, but Wednesday's Champions League game against Manchester City at the Bernabeu could prove crucial.\nFans are losing patience and Madrid were booed off after Sunday's 2-0 La Liga defeat by Celta Vigo, prompting an emergency meeting for the club's hierarchy to discuss Alonso's future.\nReal remain four points behind leaders Barcelona having won just one of their last five La Liga matches and, after a dramatic slump since beating Barcelona in October, it seems now his chances of survival are very slim.\nAlonso arrived at Real in the summer offering a modern approach but the club has to accept that this step is necessary. And it still resists.\nPresident Florentino Perez has never fully believed in this kind of change, even though people inside the club convinced him to appoint Rafa Benitez, Julien Lopetegui and Xabi Alonso - steps in a new direction.\nBut the moment they falter, show doubt or the players stop buying in, Perez turns his thumb down, given that in the past the club has been more successful with less interventionist coaches like Carlo Ancelotti or Zinedine Zidane.\nWhen he arrived at Bayer Leverkusen, Alonso asked to be released if any of the clubs he had played for came calling, provided he felt like taking the job.\nHe added one more team to that list - Manchester City, as Pep's eventual replacement. Now it could be Pep who leaves him without a job.\nMadrid's return to the Bernabeu after six games away reflected everything that has gone wrong across their run of just three wins in seven. Some good moments were there but what stood out most was the lack of connection between the manager's idea and the players' execution. They don't seem to fully believe in the plan.\nThe scenes in the dressing room after Sunday's defeat were pure frustration - objects thrown, raised voices. Any time someone tried to blame the referee, the response was immediate: \"That's a bad excuse.\"\nAlonso had shouted a swear word towards Fran Garcia when he had been sent off and the manager said in the press conference that he did not like the referee's performance - but it was no excuse.\nThe most worrying moment in his press conference after the Celta defeat was when he said certain things had been prepared - a higher tempo, pressing upfield - but the team didn't apply any of it. Echos of what previous boss Ancelotti had warned him about.\nThe second most worrying moment was finding out the decision-makers at the club stayed behind closed doors at the Bernabeu for a few hours after the match analysing what had happened. That is never good.\n'If Mbappe doesn't score, nobody does'\nAlonso perhaps set himself up by announcing the return of \"rock and roll\" when he first arrived. He meant a side with a clear identity, that would press with aggression, attack with the impact of adrumbeat, and have players stepping up with the personality and sharpness of an electric guitar riff.\nDespite all the signs and previous warnings, Alonso didn't realise just how hard it would be to achieve the most difficult thing in football - getting everyone to think as one.\nHe knew things would be complicated. Ancelotti had already warned him, privately and publicly, that certain ideas were prepared during the week but never applied on the pitch.\nAncelotti went even further in conversations with those close to him - this was the most difficult dressing room of his career. Not because players are bad people, but because there are so many conflicting interests. Kylian Mbappe thinks about his records. Vinicius worries about not losing his authority in the team. Federico Valverde wants to play in midfield and doesn't yet have the maturity expected from a captain.\nOn the day of the match at Liverpool, those who make the decisions at Real Madrid were openly expressing full support and admiration for what Alonso was doing - modernising the team, making it dynamic and versatile.\nHe had just beaten Barcelona and was on a run of 13 wins in 14 matches. But after the defeat at Anfield, followed by draws away to Rayo and Elche, the pressure became relentless.\nStories began to leak out that there were too many videos, that the demands were too high, that the players were expected to be robots. The typical clash between a coach with a clear methodology and players who want to rely on instinct.\nProblems had been accumulated.\nAlonso was convinced Jude Bellingham would help him as he knew English players tend to submit to the general idea. The problem has been his position. Jude is a second forward, a finisher. If used as a midfielder, he is not comfortable but will work hard to adapt. That transitional period makes for a player that doesn't give as much as he would like to. That creates frustration and doubts.\nAlonso would have liked Martin Zubimendi because he believes Madrid lack a midfielder who can give them rhythm and organisation. But he didn't get him and had to work with physical, dynamic midfielders who are far more comfortable with quick transitions than with positional football and short, patient passing that he also wanted to implement. Arda Guler is trying to direct the team's play but he is more of a forward than a midfielder.\nIf Mbappe doesn't score, nobody does: Vini has now gone 11 games without a goal, Rodrygo 33.\nInjuries - mostly in defence - have forced Alonso to field 20 different line-ups in 21 matches.\nEder Militao is Real Madrid's latest casualty and the Brazil defender is expected to be out for three to four months with a torn hamstring suffered against Vigo.\n'Xabi believes he is capable of finding solutions'\nPerhaps everything had already fallen apart in the reaction of Vini when he was replaced at the Clasico.\nIt was a challenge to the authority of the manager that has not been resolved. That time the club did not protect Alonso and in the apologies, Vini \"forgot\" to mention him. It was going to be very hard to come back from that.\nWhen the entire press corps turns up with the same message - Alonso's future is uncertain - it usually means that message comes from the very top and that sources from the changing room back it up. Conversations then followed those disappointing results - between the coach and the players, and between the coach and the president.\nThe manager began making decisions partly designed to please the players, hoping they would also compromise and allow him to keep adding layers to the team's understanding — to press more, to improve their attacks against deep blocks, to control games better.\nThe defeat by Celta on Sunday effectively ended the fans' honeymoon with Alonso, although polls show that supporters also blame the players, who they felt didn't run nearly enough. \"When they're intense and press well, it's very hard to get out,\" said Celta's coach, Claudio Giraldez, after the match. But Madrid simply aren't doing that work with conviction or consistency, a clear sign of a team that doesn't think they are going the right way.\nEarlier, Giraldez had also said that Real Madrid were evolving, but nobody wants to listen. Alonso believes he is capable of finding solutions. But the media are now portraying him as a coach who has been overtaken by events. Again, when that happens, it usually means the club shares that view even if it isn't actually true.\nAt Real Madrid, you go from crisis to paradise and back to hell in one or two matches. Which is why Wednesday's is not just another game.\nIf Alonso were to go in the next few days, don't be surprised if Real try again to bring Zidane back to the club, while former Madrid full-back and current B team manager Alvaro Arbeloa is also a contender.\nLatest Stories\n-\nThis is not the time to settle political scores – Bawumia to government\n2 minutes -\n37% of SHS students exposed to drugs – Opare-Addo\n20 minutes -\nNLC secures court injunction against striking tertiary unions\n56 minutes -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n1 hour -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n2 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n2 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n3 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n3 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n3 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n4 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n4 hours -\nMasterMinds resources positions itself as key player in skills development and workforce training\n6 hours -\nINTERPOL has deleted Ofori-Atta’s Red Notice – Lawyers\n6 hours -\nSteven Spielberg donates $25,000 to James Van Der Beek’s $2m GoFundMe\n7 hours -\nSix possible effects of Trump’s climate policy change\n7 hours",
  "word_count": 1544,
  "scraped_at": "2026-02-14T02:27:05.516594",
  "_text_extracted": true
}