{
  "article_id": "b32306f7dacc",
  "url": "https://www.abc.net.au/news/2023-11-29/champions-league-manchester-united-v-galatasaray-history-feature/103163802",
  "title": "Champions League clash between Manchester United and Galatasaray comes with a history of intimidation and emotion",
  "date": "20231129T011500Z",
  "domain": "abc.net.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League clash between Manchester United and Galatasaray comes with a history of intimidation and emotion\nIf it wasn't the \"Welcome to Hell\" signs at the airport, it was the bell boy at the team hotel performing a throat-slitting gesture as the players arrived.\nKey points:\n- Manchester United and Galatasaray face-off in the Champions League at 5.45am (AEDT) in Istanbul, Turkey\n- The English giants currently sit last in their Champions League group, with victory their only hope of progression\n- The two teams have met seven times in their histories, with three draws and two wins each\nOr the deliberately timed phone calls during the night to disrupt sleep, and the mud and flags thrown at the bus to the stadium.\nOr the riot police bundling players down the steps to the locker room with their shields after the match.\nManchester United's first Champions League match against Galatasaray at the Turkish team's Ali Sami Yen Stadium has gone down in lore. Thirty years later, United is back in Istanbul and again fighting to stay in the competition — something it failed to do back in 1993.\n\"It was probably the most intimidating atmosphere I ever played in,\" then-United midfielder Bryan Robson has said.\nUnited's players probably thought their Premier League match on the weekend against a fired-up Everton seething with resentment at the perceived injustice of a 10-point sanction for financial mismanagement was a tough gauntlet to run.\nThursday morning's (AEDT) match against Galatasaray promises to be as — if not more — fiery.\nThere's plenty on the line, too, like there was in 1993 when United could only draw 0-0 and was eliminated on away goals after a 3-3 draw at Old Trafford to miss out on a place in the group stage.\nThis time, a defeat would end United's chances of reaching the round of 16, with Erik ten Hag's team having lost three of its first four Group A matches — including at home to Galatasaray on October 3.\nUnited starts the game in last place on three points, one behind both Galatasaray and FC Copenhagen. Bayern Munich is on 12 and has already qualified as group winner ahead of its home match against Copenhagen.\nUnited has played away to Galatasaray twice in the Champions League since 1993 but wasn't in the same qualification jeopardy in those trips.\n\"You have to stay calm in your head and not get too emotional,\" United manager Erik ten Hag said on Tuesday.\n\"You need emotion but you need to control it. Don't give them anything, don't give the referee anything.\n\"You have to stay away from such moments. We know how to deal with it. You have to play confidently and make it your game.\"\nFormer United midfielder Mike Phelan played in that game in Istanbul 30 years ago — when Eric Cantona received a red card late in the final minutes — and said United will need its senior players to step up.\n\"I think you've got to control the game because you can't control the atmosphere,\" Phelan said.\n\"You might be able to, in a little way, if your retention of the ball is good and you're not making mistakes, then you control the game, control the ball, and that can silence the crowd — don't encourage the crowd.\"\nTen Hag said he would have no concerns playing Kobbie Mainoo, an 18-year-old holding midfielder enjoying his breakthrough at United, in such an intense game.\nMainoo was one of United's best players in the 3-0 win at Everton in an all-action display in his first Premier League start where he led the press in midfield, launched attacks and even cleared the ball off the line to deny Everton a goal.\n\"If players are good enough, they are old enough,\" ten Hag said at a news conference, before downplaying the excitement surrounding Mainoo.\n\"That was one performance. You have to do it on a consistent basis. Kobbie is so mature he knows that. And we are confident he will do it but you have to prove it.\"\nGalatasaray, which is second in the Turkish league and only behind Fenerbahce on goal difference, has a former United player in winger Wilfried Zaha in its team and has plenty of players with experience of English soccer.\nTanguy Ndombele and Davinson Sanchez — who both played for Tottenham — and ex-Arsenal midfielder Lucas Torreira are igniting their careers after struggles in the Premier League, while attackers Dries Mertens and Mauro Icardi have big-game experience with former clubs Napoli and Paris Saint-Germain, in particular.\nMarcus Rashford will be missing for United because he is serving a one-match ban after getting sent off against Copenhagen last time out, though striker Rasmus Hojlund might return from injury after taking part in training on Tuesday.\nUnited appears to have turned the corner somewhat after an underwhelming start to the season, winning three of its last four games — all in the Premier League — either side of the 4-3 loss at Copenhagen that left the team's Champions League ambitions in such peril.\n\"The atmosphere will be intense but as a kid you want to be at this kind of stage — a big stadium, big atmosphere,\" United captain Bruno Fernandes said.\n\"You have to enjoy the challenge.\"\nAP",
  "word_count": 883,
  "scraped_at": "2026-02-14T02:25:08.299060",
  "_text_extracted": true
}