{
  "article_id": "b34ff9c009ea",
  "url": "https://brudirect.com/post/One-Boxing-Day-game-down-to-Uefa-Premier-League",
  "title": "Brunei No . 1 News Website",
  "date": "20251104T140000Z",
  "domain": "brudirect.com",
  "source_country": "Brunei",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The \"expansion of European club competitions\" has led to there being just one game on 26 December in the English top flight, says the Premier League.\nBoxing Day fixtures have been a long-standing tradition in English football but this year the only Premier League game will be Manchester United's home match with Newcastle United (20:00 GMT).\n\"The Premier League would like to acknowledge the circumstances that have led to a reduced number of matches on Boxing Day this season - impacting an important tradition in English football,\" the league said while confirming the schedule for this year's festive fixtures.\n\"There are now several challenges to Premier League fixture scheduling rooted in the expansion of European club competitions - which led to a revision of our domestic calendar ahead of last season, including changes to the FA Cup.\n\"This ultimately left the Premier League as a 33-weekend competition - fewer than previous seasons, despite being a 380-match competition since 1995.\n\"With fewer weekends to work with, the league is bound by how the calendar falls.\"\nDecember's full fixture schedule has now been confirmed, 16 days later than originally planned, with the Premier League blaming \"complexities\" around the calendar.\nThe Football Supporters' Association said on X:, external \"The Premier League's TV selections for [Christmas and New Year] have finally been announced a fortnight after they were supposed to be. Newcastle's game at Old Trafford - the longest trip of that gameweek - has been selected for a ridiculous 8pm kick-off on Boxing Day. Thoughtless.\"\nThis year Boxing Day falls on a Friday - it will be followed by seven games on Saturday, 27 December, with matchweek 18 concluding with two games the following day.\nLast season, the first since the expansion of Uefa's club competitions, there were eight Premier League games on 26 December.\nThe league added: \"The league can give an assurance that next season there will be more Premier League matches on Boxing Day - as the date falls on a Saturday.\n\"As with previous years, and in keeping with our commitment to clubs, special arrangements have been made to allow more time between games played across the festive period.\n\"This will allow greater time for players to recover with the rest periods between rounds 18, 19 and 20 being increased to ensure that no club plays within 60 hours of another match.\"\nIn July, player representatives and world football's governing body Fifa agreed there should be a minimum rest period of 72 hours between matches.\nHow have Uefa competitions expanded?\nThe calendar for Uefa's club competitions now stretches across 10 midweeks, rather than the six, since the Champions League, Europa League and Conference League were expanded from the 2024-25 season.\nMore teams are now taking part, with the format changed to a league phase before the knockout stages, and each competition has a standalone week for exposure.\nThe Conference League is also held on consecutive weeks in December, with the final round of games scheduled in the regular slot for the EFL Cup quarter-finals.\nCrystal Palace are in the Conference League and have reached the last eight of the EFL Cup, where they have been drawn away to Arsenal.\nA date for the tie is yet to be confirmed but it may have to be scheduled for 23 December, two days after each team plays in the Premier League.\nArsenal will then play again in the league on 27 December, with Palace back in action a day later.\nPremier League's festive fixtures\nFriday, 26 December\n-\nManchester United v Newcastle United (20:00 GMT)\nSaturday, 27 December\n-\nNottingham Forest v Manchester City (12:30)\n-\nArsenal v Brighton (15:00)\n-\nBrentford v Bournemouth (15:00)\n-\nBurnley v Everton (15:00)\n-\nLiverpool v Wolves (15:00)\n-\nWest Ham United v Fulham (15:00)\n-\nChelsea v Aston Villa (17:30)\nSunday, 28 December\n-\nSunderland v Leeds United (14:00)\n-\nCrystal Palace v Tottenham (16:30)\nComments (0)\nNo comments yet. Be the first to comment!",
  "word_count": 662,
  "scraped_at": "2026-02-14T02:19:12.280571",
  "_text_extracted": true
}