{
  "article_id": "b35039a1c853",
  "url": "https://www.bbc.com/sport/football/articles/cwyekw4x1gno",
  "title": "Rangers 1 - 3 Club Brugge :  Life comes quickly at Russell Martin in Champions League  ",
  "date": "20250820T000000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Life comes quickly at Martin as Rangers humbled'\n- Published\nForty minutes into Rangers' mortifying night at Ibrox, Djeidi Gassama won a corner at the Broomloan Stand end and his manager, Russell Martin, applauded on the sideline. The sound of one man clapping was deafening.\nRangers trailed 3-0 at the time, there had been multiple outbreaks of booing and scores of people had already headed home.\nWhen Ibrox turns on its own like this, there's a temptation to put in the earplugs and don the crash helmet. It ain't pretty.\nIt's as visceral as it gets; loud and vicious, words coming like blades, capable of cutting their target in half. A corner might have done it for the manager, but it wasn't doing it for the masses.\nThis was in the post, though. Under Martin, Rangers have one way of playing and stout defending isn't a part of it. Not yet at any rate.\nCaution is thrown to the wind. Everybody is on the front foot. There's little midfield or defensive discipline, none of the cynicism that you need, little of the physical strength and none of the commanding authority.\nThey could have shipped five or six in this game.\nRangers had negotiated ties with Panathinaikos and Viktoria Plzen in previous weeks and, while there was praise for getting through, the realists weren't blind to the luck they experienced along the way.\nPoor defending unpunished. Crosses not headed away. Runners not picked up. A goalkeeper making save upon save. Space given up. Attackers missing sitters. Chickens tend to come home to roost, though.\n'Rangers are a catastrophe at the back'\nTheir offensive stuff had been good - very good at times - but what about the rest?\nCould Rangers afford to give up so many chances to Brugge, a club that has sold around £70m worth of talent this summer but an outfit that retains enough slick operators to punish slapstick defending?\nNo, came the answer after three minutes when Nasser Djiga - back to life after playing dead in the build-up to Alloa's first goal in the League Cup last weekend - downed tools and let Romeo Vermant away from him to brilliantly lob Jack Butland.\nDjiga might improve. He's an athlete, he's powerful, he's capable of more. He's also guilty of lying down on the job when Alloa suckered his team - unforgiveable - and was culpable again, in the most eye-popping way, when assuming that his goalkeeper was going to come out to meet and deal with Vermant.\nHad Butland metamorphosed into Usain Bolt in that moment he still wouldn't have made it. Djiga, a loan signing from Wolves, gave up. He's deemed a success so far. It's the most generous assessment.\nNo, came the answer again after seven minutes when Jorne Spileers, untroubled by a blue jersey in his midst, side-footed home from a corner. These were the kinds of moments that Rangers survived in previous games. Not now.\nAnd no came the answer again after 20 minutes when Rangers failed with two attempts to clear their box, a hesitancy and incompetence that saw Brandon Mechele rifle a third past Butland.\nAt that point, the only prayers that could have been offered up on Rangers' behalf would have given thanks to the man above that this team was not going any further in this Champions League.\nThat it was going to be spared any further humiliation at the hands of Europe's biggest guns, a lucky escape that was denied one of Martin's predecessor's, Giovanni van Bronckhorst - and he lost his job on the back of it.\nThat Rangers, so early in whatever it is that Martin is trying to do, are not ready for Champions League football is obvious.\nThey are a burgeoning team in terms of goal threat and have, undoubtedly, discovered a player in Gassama, but they're a catastrophe at the back. In his brief time in charge, Martin has taken a weak defence, signed loads of players and has somehow made it weaker.\nIn pulling a goal back in the second half, and almost making it two, they showed the best side of themselves.\nThey worked hard, they put Brugge under pressure, they created some stuff at one end and avoided further concessions at the other. The whole pursuit resulted in the scoreline becoming less ugly rather than more hopeful.\nHave some made up minds on Martin?\nYou'd need to be a person of unshakeable faith, laced with a glorious delusion, to think that Rangers, with all their defensive vulnerabilities, are going to turn this around in Belgium next week.\nMartin's refusal to adapt while manager of Southampton does not augur well.\nHe needs to alter his thinking in the way he sets up his team - Brendan Rodgers did it in Europe last season after Celtic's 7-1 shellacking by Borussia Dortmund - but there are few signs that he's willing to do that.\nBut he must or those boos we heard in the first half will grow, those doubts that Rangers folk have about him will harden, and his life will get even more difficult.\nHe retains a positivity and a belief. Good on him. Life has thrown a lot at Martin and resilience is built into him. He's going to need every bit of mental strength in the bearpit he now resides in.\nRangers have a brutal run of fixtures now - St Mirren away, Brugge away, Celtic at home, Hearts at home, Hibs at home. All of those sides - not just Brugge and Celtic - are capable of feasting on their frailties.\nMartin needs to get through relatively unscathed, starting at St Mirren, a nuggety team built in the image of their smart and tough manager, Stephen Robinson.\nFootball in Glasgow comes at you quickly. Martin knew the truth of that in his brief time as a Rangers player and he certainly knows it now as manager.\nIt's an unforgiving landscape. Painfully early in his reign, yes, but people make up their minds quickly in these parts.",
  "word_count": 1009,
  "scraped_at": "2026-02-14T01:52:36.771626",
  "_text_extracted": true
}