{
  "article_id": "b3529dd2fe15",
  "url": "https://theprideoflondon.com/posts/kiernan-dewsbury-hall-chelsea-s-new-creative-midfield-dynamo-01j1ypsx51an",
  "title": "Kiernan Dewsbury - Hall : Chelsea new creative midfield dynamo",
  "date": "20240709T031500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kiernan Dewsbury-Hall is the latest addition to the Chelsea roster, as the club seeks to supplement Enzo Maresca's side ahead of the 2024/25 season. The £30 million transfer fee to acquire the former Leicester City midfielder is a sensible purchase to enhance the Blues' midfield options.\nDewsbury-Hall is a well-rounded midfielder who featured at the heart of Leicester's league-winning team last campaign. The integral cog in Maresca's machine pitched in with a standout 26 goal contributions (12 goals and 14 assists) - the highest in the Leicester squad and fifth highest in the Championship.\nIn this article, the Pride of London will dissect the various facets of the Dewsbury-Hall's extensive repertoire, soon to be showcased at Stamford Bridge.\nInnovative Playmaker: Incisive passer and smooth dribbler\nDewsbury-Hall possesses exceptional creative strength with the ball at his feet - capable of producing dangerous chances through his passing. The Englishman's signature move is the piercing ball between the opposition defenders that cut through the robust out-of-possession structures. But he is capable of more than just delivering the final killer pass.\nDewsbury-Hall is a versatile midfielder, able to drop deep and launch forward passes or spray switches to the opposite flank. Although he is not the most accurate long passer (45% long ball success rate), when he does pick out a teammate, they can often lead to advantageous moments.\nLike Leicester's right winger, Abdul Fatawu Issahaku, who benefitted from those long switches last season, Noni Madueke's one-versus-one proficiency will flourish if Dewsbury-Hall can locate him when isolated against a defender on the flanks.\nWith the ball at his feet, Dewsbury-Hall is also a silky dribbler. Capable of dancing through tight spaces, the former Leicester No. 8 is an unstoppable livewire. Despite executing a low volume of dribbles (2.57 take-ons per 90' - 32nd percentile among attacking midfielders and wingers), he is tremendously efficient (56.7% successful take-ons - 94th percentile). As a result, Dewsbury-Hall is a regularly fouled player who draws freekicks in dangerous positions.\nWhen producing chances high up the field, Dewsbury-Hall is superb. Whether it be from open play, set pieces, or dribbles, he delivers. Last season in the Championship, the Englishman impressively ranked fifth for total Shot-Creating Actions (SCA) and joint-first from open play.\nThe multi-dimensional on-ball threat makes Dewsbury-Hall a tactically lucrative player. If the opposition allows him space, he will penetrate the defensive structure with a fine pass. But if they come too close, he will glide past the defenders and cause jeopardizing overloads. Therefore, his variety of abilities is the quintessential trait that makes Dewsbury-Hall a distinctive talent.\nAdditional Elements: Shooting, defending, and injury history\nDewsbury-Hall is not the elite goal-scoring midfielder in Europe. However, his production last season was more than encouraging - contributing 12 goals for Leicester in the Championship.\nHe does not attempt a high volume of shots or significantly outperforms his expected goals (xG) due to his tendency to shoot from long range. Instead, many of his goals last season originated from late surging runs into the penalty box, where he was found through cutbacks and crosses.\nDefensively, Dewsbury-Hall offers significant upsides. The uncompromising attitude of the 25-year-old out-of-possession makes him a valuable asset in counter-pressing scenarios. Hence, Maresca could play him to execute a high press or a passive mid-block without compromising the technical quality in midfield.\nDewsbury-Hall will upgrade Chelsea's set-piece expertise - a key area the club is trying to improve. As Leicester's chief corner and freekick taker, he was an essential asset in dead-ball situations for Maresca last season.\nChelsea, a team riddled with injuries over the past few years, would be heartened to know that Dewsbury-Hall has an excellent injury history - missing only one game due to a calf injury in his senior career. This impressive consistency will be vital to establishing a core starting eleven next season and aid their quest for Champions League football.\nTactical Fit: Positional versatility\nThe most attractive aspect of Dewsbury-Hall's skillset is the tactical versatility. Like Chelsea starlet Cole Palmer, the former Leicester midfielder is adept at operating in various spaces on the field. Whether drifting out wide to the left flank, floating infield into more central zones, roaming in the half spaces, or dropping deep in front of the backline, Dewsbury-Hall is proficient in playing everywhere.\nIt will benefit Maresca to implement attacking fluidity in the frontline that would confuse opposition defenders. Constant rotations among the attackers, who can play in various positions, will help generate timely overloads in possession. Therefore, Dewbury-Hall's addition could amplify his teammates' strengths while providing the manager with tactical flexibility.\nSteep Climb: Moving to the Premier League, game time, and adaptation process\nMoving up from the Championship to the Premier League is a tricky road. The step up in the level of football is contrasting, which can often make or break players.\nAt 25, Dewsbury-Hall is in a healthy position in his career to make that transition. Moreover, considering he will play under his former manager in a familiar tactical system, that leap should be manageable.\nNevertheless, a challenging period remains for Dewsbury-Hall next season. With an array of midfield options to choose for Maresca, the Englishman will have to fight for his spot week-in-week-out. And mostly probably, he will not bank the same minutes he did for Leicester last season.\nUnder more scrutiny in the Premier League, a division where only the fittest survive, Dewsbury-Hall will face tough periods of form. But his attitude will determine whether his move to Chelsea will be a hit like N'Golo Kanté or a miss like Danny Drinkwater - two players who moved from Leicester to West London but had vastly contrasting careers.\nAt a club like Chelsea, where the climate of skepticism and criticism is always sky-high, Dewsbury-Hall will need bulletproof skin to shrug off the doubt and have the confidence to pole vault over the goalposts and make the Stamford Bridge stadium erupt.",
  "word_count": 985,
  "scraped_at": "2026-02-14T02:01:23.796600",
  "_text_extracted": true
}