{
  "article_id": "b356c23faf57",
  "url": "https://www.90min.com/features/2024-ballon-dor-nominees-ranked",
  "title": "2024 Ballon dOr nominees",
  "date": "20240905T201500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "2024 Ballon d'Or nominees - ranked\n- The 2024 Ballon d'Or nominees have been announced\n- Vinicius Junior and Jude Bellingham are among the favourites\n- Plenty of Spain stars have been nominated thanks to their Euro 2024 exploits\nThe nominees for the 2024 Ballon d'Or award have been revealed, with winner set to be announced on 28 October in Paris.\nA grand total of 30 of the best-performing players of the 2023/24 season have earned a nod, with plenty of discussion now ongoing over who deserves to win the award.\nTo get in on the fun, we at 90min decided to have a go at ranking the top ten nominees and decide who we think should win the 2024 Ballon d'Or award.\n10. Florian Wirtz\nHaving been the star man for a Bayer Leverkusen team that won a rather remarkable Bundesliga and DFB-Pokal double, voters would be remiss not to have Florian Wirtz in their top tens this years.\nHis 22 goal contributions in 2023/24 - including his Bundesliga-clinching hat-trick against Hoffenheim - will go down in Leverkusen history.\n9. Nico Williams\nHe may not have moved to Barcelona, but Nico Williams has earned a Ballon d'Or nomination at least.\nThat's quite consolation prize in our books.\nThe nomination is well deserved too thanks in large part to his exploits at Euro 2024.\nHis player of the match performance, and winning goal, against England in the final was pretty damn special.\n8. Toni Kroos\nEven in the very final year of his legendary career, Toni Kroos was one of the best and most effective footballers in the world.\nThe German's metronomic presence at the heart of the Real Madrid midfield was pivotal to their La Liga and UEFA Champions League double in 2023/24.\nHe's already sorely missed at the Santiago Bernabeu.\n7. Dani Carvajal\nThe fact that Euro 2024 was Dani Carvajal's first ever European Championship tournament, at the age of 32, was pretty surprising.\nThe fact that he won it wasn't at all.\nThe right-back enjoyed a remarkably trophy-laden 2023/24 at both club and international level, adding Euro 2024 to the La Liga and UEFA Champions League he won with Real Madrid.\nOh, and he also scored in the final of the latter. Nice one.\n6. Phil Foden\nSure, he didn't have the greatest Euro 2024, but one can't deny just how bloody fantastic Phil Foden was for Manchester City in the Premier League last season.\nThe Premier League title, PFA Players' Player of the Year, Premier League Player of the Season and FWA Footballer of the Year awards he won are proof of his brilliance.\n5. Kylian Mbappe\nKylian Mbappe may be the most talented footballer in the world, but he wasn't the 'best' footballer in the world during the 2023/24 season.\nThat being said, having scored 44 goals in 48 games, he was pretty close to being the best though.\n4. Lamine Yamal\nThe favourite to win the 2024 edition of the Kopa Trophy, Lamine Yamal should get a fair few Ballon d'Or votes this year too.\nWhich, yes, is utterly riduculous because he's 17 years old.\nThe youngster cemented himself as a genuine superstar of world football in 2023/24 despite his tender age, helping Spain to a triumph at Euro 2024 along the way.\n3. Jude Bellingham\nFor much of last season, Jude Bellingham looked certain to win the Ballon d'Or.\nIn the end, however, his slight tailing off of form late in the campaign has led to him falling down the pecking order a little bit.\nStill, though, the impressive spate of goalscoring he enjoyed early in the 2023/24 season should be enough to bag him a fair few Ballon d'Or votes come the end of October.\n23 goals from attacking midfield is certainly nothing to be sniffed at after all.\n2. Rodri\nNo footballer in the world guarantees wins in the way that Rodri does.\nBe it at club level with Manchester City - where he won another Premier League title - or at international level with Spain - where he won Euro 2024 - Rodri's immense presence in the middle of the park guarantees trophies for whichever team he plays for.\nHe's an utterly remarkable midfielder, and rightly one of the favourites to win the Ballon d'Or this year.\n1. Vinicius Junior\nIt has to be Vinicius Junior, doesn't it?\nThe wide forward was utterly unplayable when it mattered most for Real Madrid last season, netting three goals in the semi finals and final of the Champions League to famously win the trophy for a record 15th time.\nNo player stepped up in big games the way Vini did throughout the 2023/24 season.",
  "word_count": 781,
  "scraped_at": "2026-02-14T02:05:23.748304",
  "_text_extracted": true
}