{
  "article_id": "b377d92c290b",
  "url": "https://www.siasat.com/shah-rukh-khan-hosts-private-party-for-david-beckham-at-mannat-2896085/",
  "title": "Shah Rukh Khan hosts private party for David Beckham at Mannat",
  "date": "20231117T051500Z",
  "domain": "siasat.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mumbai: Superstar Shah Rukh Khan on Thursday night hosted a private party at his residence for legendary footballer David Beckham.\nA video doing the rounds online, sees a car arriving quietly at Mannat, with Beckham’s staff seated in the front seat, while he sat in the back passenger’s seat.\nThe footballer arrived in Mumbai to attend the ICC World Cup 2023 semi-final match between India and New Zealand. He met many Bollywood celebrities during his time.\nPost the match, on Wednesday actor Sonam Kapoor and her husband Anand Ahuja hosted a grand bash for Beckham where several B-town celebs marked their presence.\nApart from that, he also met the Ambani family on Wednesday and was gifted a Mumbai Indians jersey by them.\nThe jersey had the number seven that Beckham wore in his stint with iconic club Manchester United.\nBeckham is a UNICEF Goodwill Ambassador. The International Cricket Council has entered into a partnership with UNICEF to empower women and girls and promote inclusion and gender equality through cricket.\nBeckham on the other hand is also considered one of the best footballers of all time. He has represented England at national level and made over 100 appearances for them from 1996-2009. The midfielder also represented iconic football clubs like Manchester United, Real Madrid, AC Milan, Paris Saint Germain and LA Galaxy in his decorated career. With these clubs, he has won prestigious titles like the Premier League, La Liga, Ligue 1 and UEFA Champions League titles.\nTalking about SRK’s work front, he will be next seen in director Rajkumar Hirani’s ‘Dunki’ which is all set to hit the theatres on the occasion of Christmas 2023.\nThe film also stars Vicky Kaushal and Taapsee Pannu in pivotal roles.",
  "word_count": 287,
  "scraped_at": "2026-02-14T02:07:27.063476",
  "_text_extracted": true
}