{
  "article_id": "b38399a5047a",
  "url": "https://www.myjoyonline.com/afcon-2025-top-10-stars-set-to-light-up-morocco/",
  "title": "AFCON 2025 : Top 10 stars set to light up Morocco",
  "date": "20251218T101500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nAfrican football has always delivered exceptional talent over the years and brought the spark to world football at all times.\nThe 2025 Africa Cup of Nations (AFCON) tournament will be no different, with the African stars expected to come to the party once again.\nHere are some stars who are being tipped to light up the continental tournament in the next month.\n1. Mohamed Salah\nNo star arrives at AFCON 2025 with more eyes on him than the Egyptian King. To say Mohamed Salah has endured a turbulent few months at Merseyside would be a massive understatement. But if there is anyone with the mental fortitude to bounce back, it is the iconic right winger.\nSalah is no stranger to criticism or noise. Labels like “Chelsea reject” followed him early in his career. Now, at the other end of that journey, few can dispute his place among football’s modern greats.\nYet one truth remains. Despite his individual brilliance, Salah has never lifted the AFCON trophy with Egypt. With his prime years now behind him, this tournament may represent his final opportunity to do so.\nOne thing, however, is certain — you can never bet against Mo.\n2. Victor Osimhen\nThe Galatasaray striker needs no introduction. One of the most feared forwards in the world, Osimhen has everything it takes to lead Nigeria to the pinnacle of African football. At 27, he’s in the prime of his career, and his eleven goals for the Turkish giants this season are proof.\nBut with these stellar performances comes added pressure. Osimhen will carry more expectation than anyone in a Super Eagles shirt. Nigeria’s failure to qualify for the World Cup will only add to that weight. The nation demands goals—and Osimhen is ready to deliver.\nHe was pivotal in Napoli’s first Scudetto in 33 years, and he will aim to be just as decisive at AFCON 2025.\n3. Sadio Mané\nEvery great athlete reaches a point where they’ve done so much that everyone — including themselves — asks: “What’s next?” Fans demand more, pundits critique, and the world watches closely. Expectations never fade, and pressure never lets up.\nIt takes a rare kind of talent to stay motivated when the trophy cabinet is already full. That’s the challenge ahead for one of Africa’s greatest exports. Sadio Mané has already cemented his legacy at club and international level. But does he still have the fire to deliver? Only time will tell.\n4. Ademola Lookman\nOn his day, Lookman is arguably one of the most dangerous attackers in European football. Two-footed, quick, strong, and blessed with high football intelligence, there is little doubt he can give any full-back nightmares.\nAt 28, Lookman is firmly in his prime and has already proven he can deliver on the biggest stages. Few players can boast of scoring in a European final. Even fewer have scored a hat-trick in a major European final.\nThat level of performance is exactly what Nigerians will expect from the star winger. It is a huge amount of pressure — but Lookman has all the tools to turn it into something special.\n5.Brahim Díaz\nMorocco’s star man, Achraf Hakimi, won’t be at this year’s AFCON. The team will feel his absence keenly, as they will lose his creativity in wide areas.\nThankfully for The Atlas Lions, they have Brahim Díaz. Only recently switching allegiance to the host nation, Díaz brings immense dynamism to Morocco’s setup. Moroccans will be expecting big things from the Real Madrid winger.\nThe fact that he plays for Los Blancos only heightens the already lofty expectations. For Díaz, this tournament is a chance to repay the faith Moroccans have placed in him — and it’s hard to argue against their assessment that he is a true jewel for the team.\n6. Franck Kessie\nAlready an AFCON winner, Franck Kessié knows how to carry a team when the stakes are highest. Big tournaments aren’t just about skill—they’re about composure under pressure, and Kessié has it in bucket loads.\nIn 2023, he delivered when it mattered most: a last-gasp equaliser in the Round of 16, another crucial strike in the final, and countless moments of quality that swung games in Ivory Coast’s favour.\nPowerful, intelligent, and relentless, Kessié can influence both boxes. At this AFCON, the Al-Ahli midfielder will be looking to add more heroics to an already impressive legacy. He’s already had a taste of glory, and there’s no doubt he’ll want more at this AFCON.\n7. Bryan Mbuemo\nInternational tournaments often provide the spark that propels a player’s reputation to new heights. The likes of James Rodríguez and Michael Owen, for instance, gained global recognition through their exploits on the biggest stages.\nBryan Mbuemo has already established himself as one of the Premier League’s most dangerous attacking threats. With 27 goal involvements for Brentford last season and eight so far for Manchester United, his talent is undeniable. Yet, for someone of his quality, Mbuemo’s popularity hasn’t quite reached superstar status—mainly because he has rarely featured in major European competitions like the Champions League.\nAFCON 2025 will be his first taste of the tournament. Like many before him, the talented winger can use this platform to showcase his abilities to the watching world. The hopes of his nation, Cameroon, rest firmly on his shoulders.\n8. Ismaïla Sarr\nThere comes a moment in every sport when the proverbial torch is passed—from a star of the past to a star of the present and future. Sadio Mané carried Senegal on his back for nearly a decade, culminating in the unforgettable 2021 AFCON victory.\nBut with Father Time slowly catching up, it is clear who the next heir to his legacy is. Ismaïla Sarr, absent from that triumphant squad, has since developed into one of the Premier League’s most feared wingers. Three years on, the question remains: can Sarr shoulder the burden of the Lions of Teranga like Mané? It would come as no surprise if he does.\n9. Amad Diallo\nMissing out on the 2023 AFCON victory on home soil must have stung the 23-year-old. Every player dreams of lifting silverware for their country, but doing it in front of their own fans makes it even sweeter — simply because that opportunity may never come again.\nFor Amad, AFCON 2025 offers a chance to turn that disappointment into fuel. There is no better way to move past the pain of 2023 than to be a key player in the team’s title defence.\nPrimarily a wing-back for his club side, Manchester United, Amad’s technical ability and dribbling allow him to shift seamlessly into a winger role. He’s young but possesses undeniable potential, and AFCON 2025 may be the perfect stage to show the world exactly what he is capable of.\n10. Carlos Baleba\nAnyone who has watched the 21-year-old can immediately recognise his quality. We’ve seen the big, tall, fast midfielder before. We’ve also seen the gifted technician and the dogged midfield warrior. What is rare, however, is to see someone so young showcase all of these attributes in one package. Baleba is blessed with them all.\nPlaying in Brighton’s system under head coach Fabian Hurzeler demands sharpness—both mentally and technically. Baleba has struggled at times to adapt this season, but he has shown clear signs of improvement. He isn’t at his absolute best yet, but if he can produce glimpses of the player Manchester United coveted last summer, Cameroon will have as good a chance as anyone.\nPeople have begun to doubt him, and AFCON 2025 might be the perfect stage to silence those critics.\nLatest Stories\n-\nBooming Indicators, Dying Rivers: Ghana under Chronic Environmental Poisoning\n24 minutes -\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n53 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n1 hour -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n1 hour -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n3 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n3 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n4 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n4 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n4 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n4 hours -\nNUGS President urges sustainable digital governance\n4 hours",
  "word_count": 1486,
  "scraped_at": "2026-02-14T01:52:59.290735",
  "_text_extracted": true
}