{
  "article_id": "b3a0d5caa5c2",
  "url": "https://www.teamtalk.com/newcastle-united/newcastle-hit-with-sucker-punch-50m-pound-striker-bid-rejected",
  "title": "Newcastle transfers : Howe hit with sucker punch as £50m striker bid rejected",
  "date": "20250825T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nNewcastle hit with devastating sucker punch as £50m striker bid rejected by Prem rival\nNewcastle United have reportedly been hit with another major transfer blow after seeing a £50million offer for a top striker target completely kcocked back with just a week to go before the summer window slams shut.\nWith talismanic forward Alexander Isak still nowhere to be seen after two games of the new Premier League season, as he continues to hunt a move to Liverpool, The Magpies are lining up potential replacements in order to fend off the worst-case scenario.\nIsak has already been the subject of a £110m bid from Arne Slot’s men, with another offer expected to be imminent, and Eddie Howe was asked if there is a situation where the Swede is sold and Newcastle do not bring a replacement in.\n“I don’t think the club will allow that situation to happen,” he said. “We certainly can’t go through the season with no recognised striker at the football club – and that’s no disrespect to Will Osula.\n“I think he’s doing really well and he’s progressing really well, but he’s got limited experience in the Premier League, although I’m really happy with his career progression.\n“But Alex at the moment would be the only striker we have with Premier League history of goals and appearances and starts, so we can’t leave ourselves in that position.”\nNewcastle have already failed in their efforts to lure Brentford into selling Yoane Wissa, despite the player doing his utmost to try and force through a transfer.\nAnd it now appears they have hit another dead end when it comes to Wolves No.9 Jorgen Strand Larsen after the Molineux outfit completely flatbatted their offer of £50m for the player.\nThat’s according to a number of reports, including from the likes of David Ornstein, Ben Jacobs and Sky Sports, who have all detailed why Wolves are standing firm over Strand Larsen.\nThey state that the Premier League side’s position is that the Norway international is not for sale in this window, especially given that there is little time left in the window to then find a top-level replacement.\nWolves could actually have doubled their money on Strand Larsen, having exercised their option to buy the forward on July 1 from Celta Vigo for £23m. He scored 14 league goals on loan at Molineux last season.\nDON’T MISS ➡️ Every Premier League club’s record signing as four transfers this summer make the cut\nWhere does that leave Newcastle’s striker hunt?\nWhile Howe remains confident that Newcastle will not leave him without a recognised striker as the deadline nears and Isak remains on the sidelines, could there actually be a situation where the club leave themselves woefully short up front on the eve of a return to Champions League football.\nThe Wissa situation certainly still gives them hope, although Brentford could leave themselves short the longer the transfer saga drags on.\nChelsea forward Nicolas Jackson has also emerged as an option, although it looks like he could move to Bayern Munich to become Harry Kane’s understudy.\nAnd then there’s Aston Villa and the PSR concerns that could still force them to offload one of Ollie Watkins or Morgan Rodgers.\nThe former would obviously be a solid replacement for Isak, although the chances of Villa selling two top stars to Newcastle this summer must be slim after the recent Jacob Ramsey deal.\nAll eyes will now be on what happens over the course of the next week, as Newcastle prepare for another huge offer from Liverpool for Isak, while also trying to bring in at least one new addition up front to replace him.\nMore Newcastle news: Isak told to sack agent / Wissa stance revealed\n⚫ Alan Shearer urges Alexander Isak to ‘sack’ agent as Newcastle feud rumbles on\n⚫ Legal issues behind Alexander Isak to Liverpool transfer saga explained by sports law expert\n⚫ Newcastle stance on new Yoane Wissa bid revealed as Brentford move the goalposts – sources",
  "word_count": 674,
  "scraped_at": "2026-02-14T01:58:57.511147",
  "_text_extracted": true
}