{
  "article_id": "b3a2bc3e543d",
  "url": "https://www.anglocelt.ie/2025/01/06/eddie-howe-does-not-care-if-newcastle-are-popular/",
  "title": "Eddie Howe does not care if Newcastle are popular",
  "date": "20250106T124500Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe does not care if Newcastle are popular\nBy Damian Spellman, PA\nNewcastle boss Eddie Howe does not care what people outside of the city think of his team as he plots another assault on Carabao Cup glory.\nThe Magpies have climbed to fifth in the Premier League after a run of five successive victories, two of them at Manchester United and Tottenham, to rekindle memories of their surge into the Champions League places two seasons ago.\nGunners boss Mikel Arteta and then Liverpool counterpart Jurgen Klopp were angered by Newcastle’s approach during that campaign, prompting Howe to say: “We are not here to be popular and to get other teams to like us. We are here to compete.”\nAsked in the wake of furious post-match reactions from Aston Villa head coach Unai Emery and Spurs’ Ange Postecoglou following recent defeats if his side were “ruffling feathers” once again, the 47-year-old said: “We are here to try to win and ultimately that’s all we are driven for.\n“The popular stuff, I don’t really care what happens outside of Newcastle. The perception other teams have of us, it doesn’t really worry me.\n“It’s all about us making sure we are happy with who we are and how we are performing.”\nNewcastle’s recent resurgence has seen them close to within five points of second-placed Arsenal, who now stand between them and a second trip to Wembley in three seasons.\nThe Magpies went down 2-0 to Manchester United in the Carabao Cup final in February 2023, and the club’s wait for a domestic trophy has now stretched to almost 70 years.\nThey head for the Emirates Stadium – where they have won only once in 19 visits – on Tuesday evening, when they will be without suspended duo Bruno Guimaraes and Fabian Schar for the semi-final first leg clash.\nBut Howe is convinced his team has developed significantly since their Wembley defeat.\nHe said: “I think our game has evolved – I certainly think we’ve evolved quite a bit tactically since then. The game moves on very quickly in the Premier League.”\nThe Magpies’ trophy drought – their last major piece of silverware was the 1969 European Fairs Cup, with the 1955 FA Cup their last domestic success – represents a yawning cavern for an ambitious club.\nAnd Howe knows ending that run of failure is a must if they are to keep the big-name stars signed by their Saudi-backed owners.\nHe said: “It would no doubt help us in every respect. But we can’t concern ourself with the outcomes. It’s more, ‘Right, now we have Arsenal’.”\nSpeculation continues to surround the likes of in-form striker Alexander Isak and skipper Guimaraes amid concerns over the club’s ability to comply with profitability and sustainability rules\nAnd Howe admits, like many of their competitors, they may have to put business logic before football logic this month, as they did last summer when they sold Elliot Anderson and Yankuba Minteh.\nHe said: “That was very much the business taking over the football, and I think we’re still in that position to a degree.”",
  "word_count": 518,
  "scraped_at": "2026-02-14T02:08:52.970589",
  "_text_extracted": true
}