{
  "article_id": "b3a49edb9ff0",
  "url": "https://www.dutchnews.nl/2024/04/233934/",
  "title": "Ajax win against Twente overshadowed by protests ; PSV near title",
  "date": "20240414T214500Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ajax win against Twente overshadowed by protests; PSV near title\nA late penalty by Steven Bergwijn enabled Ajax to end a turbulent week on a high note as they recovered from a goal down against FC Twente.\nRicky van Wolfswinkel’s glancing header into the far corner after 31 minutes was the least Twente deserved for their first-half display.\nBut Ajax came out stronger after the break as John van ‘t Schip switched from a five-man defence to a 4-3-3 formation, and equalised when Kenneth Taylor lofted a free-kick onto the head of the unmarked Brian Brobbey.\nBergwijn scored from the spot in the 81st minute after substitute Anass Salah-Eddine brought down Devyne Rensch. The result keeps Ajax seven points behind fourth-placed AZ Alkmaar, who themselves are five points behind Twente in the race for the Champions League play-off spot.\nThe fourth-placed team qualifies directly for the Europa League, while a fifth or sixth-place finish would require Ajax to enter the end-of-season play-offs for the right to play in the Conference League.\nAjax’s fans spent much of the match chanting songs and waving banners calling for Michael van Praag to quit as chair of the supervisory board over the suspension and proposed sacking of chief executive Alex Kroes.\nAZ comeback\nAZ closed the gap on Twente with a comeback win of their own against RKC Waalwijk, who went into the half-time break with a 2-0 lead as David Min scored twice.\nMin hit his second goal from inside the centre circle after he intercepted a careless pass by Yukinara Sugawara and lashed the ball over the stranded Mathew Ryan.\nSugawara made amends in the 66th minute when he scored from a tight angle and AZ scored twice more in an 11-minute spell, with Vangelis Pavlidis back-heeling in the winner for his 26th goal of the season.\nPavlidis shares top place in the scoring charts with Luuk de Jong, who bagged two in PSV’s 6-0 thrashing of bottom club Vitesse Arnhem to move to joint eighth place on the Eredivisie’s all-time list with 175 goals.\nPeter Bosz criticised his players for playing “summer evening football” in the first 25 minutes, but two quick goals by De Jong and Malik Tillman shook the team into life as PSV scored three times in each half.\nLammers strikes again\nUtrecht strengthened their claim to a European play-off spot as Can Bozdogan grabbed an injury-time winner against fellow contenders Go Ahead Eagles.\nWinter loan signing Sam Lammers scored for the sixth game in a row to put Utrecht ahead in the fourth minute, while defender Gerrit Nauber headed the equaliser for Go Ahead just before half-time.\nFeyenoord warmed up for the cup final with a 1-0 win at Fortuna Sittard that brought them to the brink of securing second place, as defender David Hancko scored for the third time in four matches.\nThe other cup finalists, NEC, missed the chance to go back above Ajax as they drew 2-2 at home to PEC Zwolle to end a six-game winning run at home.\nNinth-placed Sparta have a four-point cushion in the race for the final play-off spot after Arno Verscheuren snatched a late winner in Almere, while closest rivals Heerenveen ended a five-match winless run to beat Heracles 2-0.\nExcelsior moved out of the relegation play-off position, now occupied by RKC, and pushed Volendam further towards the exit with a 4-0 win. Lazaros Lamprou scored twice for the Rotterdammers, while both teams saw red after the final whistle as Excelsior’s Troy Parrott and Volendam’s Safouane Karim were involved in a brawl.\nResults\nFriday\nExcelsior 4-0 Volendam\nSaturday\nAlmere City 2-3 Sparta Rotterdam\nAZ Alkmaar 3-2 RKC Waalwijk\nPSV Eindhoven 6-0 Vitesse Arnhem\nSunday\nAjax 2-1 Twente Enschede\nFortuna Sittard 0-1 Feyenoord\nHeracles Almelo 0-2 Heerenveen\nNEC 2-2 PEC Zwolle\nUtrecht 2-1 Go Ahead Eagles\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 693,
  "scraped_at": "2026-02-14T01:48:46.197113",
  "_text_extracted": true
}