{
  "article_id": "b3d71827b91f",
  "url": "https://menafn.com/1106129082/Premier-League-Man-City-Now-In-Driving-Seat-But-Guardiola-Still-Cautious",
  "title": "Premier League : Man City Now In Driving Seat But Guardiola Still Cautious",
  "date": "20230428T194500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- Khaleej Times) Published: Fri 28 Apr 2023, 6:02 PM According to some of the headlines after Manchester City's crushing defeat of title rival Arsenal this week, the sky blue ribbons can already be fastened to the Premier League trophy.\nIts 4-1 thrashing of the long-time leader at The Etihad wrenched control of the race out of Arsenal's hands and put City firmly in control of its destiny.\nBut City boss Pep Guardiola is too long in the tooth to assume a fifth league title in six seasons is now a formality.\nThe reaction to City's victory in the so-called title decider was understandable. It was its seventh successive league win and left it two points behind Arsenal with two games in hand, having trailed by eight not long ago.\nVictory for a relentless City at Fulham on Sunday will take it into the lead and, should it achieve that, it really will be its title to lose, especially with home games against struggling West Ham United and Leeds United up next.\nBut Guardiola urges caution.\n\"I have a feeling the next three games will dictate a lot,\" he said. \"Fulham have come from the Championship and this season have been amazing. We play at home against Leeds and West Ham. We feel comfortable here with the crowd.\"\nAfter their mauling at City, Arsenal has the weekend off to lick its wounds and regroup after its home clash with Chelsea was shunted to Tuesday on police advice.\nBut there is no respite for the teams battling at the other end of the table to avoid being relegated.\nTime appears to be running out for bottom club Southampton after its defeat by Bournemouth on Thursday left it six points from the safety zone with five games left.\nSouthampton go to third-placed Newcastle United on Sunday to face a side that has scored 10 goals in two games and appear on the cusp of a return to the Champions League.\nThe two clubs immediately above Saints, Everton and Leicester City, meet on Monday in a true 'six-pointer'.\nNottingham Forest climbed out of the drop zone with a priceless victory against Brighton & Hove Albion on Wednesday and victory at Brentford on Saturday would put even more pressure on Everton and Leicester.\nLeeds, who are above Forest on goal difference, travel to almost-safe Bournemouth on Sunday.\nWith Fulham comfortable in 10th place and Bournemouth and Forest on course for survival, it could be only the fourth time in Premier League history that all three teams promoted from the Championship avoid relegation in its first season up.\nThe last time that happened was in 2017-18 when Newcastle, Brighton and Huddersfield all stayed up.\nTottenham Hotspur's chances of a top-four finish is almost over though it did show some fight to draw 2-2 with fourth-placed Manchester United on Thursday in Ryan Mason's first game in interim charge, four days after a 6-1 drubbing at Newcastle.\nSpurs in fifth goes to Liverpool, who are seventh, on Sunday in a match that could go a long way to decide which of the two clubs can salvage a Europa League qualification spot.\nTottenham has 54 points, the same as sixth-placed Aston Villa, with Liverpool on 53 having played a game less.\nLiverpool is seeking a fourth successive win and, belatedly, has joined the Premier League party.\n\"This season taught us lessons that I didn't want to learn but the most important lesson in football is getting the three points at the weekend or midweek,\" manager Jurgen Klopp said.\nFIXTURES\n(UAE Time)\nSATURDAY\nCrystal Palace vs West Ham, 3.30 pm\nBrighton vs Wolves, 6 pm\nBrentford vs Forest, 6 pm\nSUNDAY\nMan United vs Aston Villa, 5 pm\nFulham vs Man City, 5 pm\nBournemouth vs Leeds, 5 pm\nNewcastle vs Southampton, 5 pm\nLiverpool vs Tottenham, 7.30 pm\nMONDAY\nLeicester vs Everton, 11 pm\nTUESDAY\nArsenal vs Chelsea, 11 pm\nALSO READ:\nipl 2023: this batter becomes fourth impact player to score a duck this season\nten hag says some united players did not give their best against spurs\nmendis bags five as sri lanka crushes ireland to record 100th test win",
  "word_count": 694,
  "scraped_at": "2026-02-14T01:50:29.463637",
  "_text_extracted": true
}