{
  "article_id": "b3db3f185908",
  "url": "https://apnews.com/article/manchester-city-reis-9b745667225e66817b0638a69fc702e2",
  "title": "Man City signs teenage Palmeiras defender Vitor Reis for $36 million",
  "date": "20250121T210000Z",
  "domain": "apnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City signs teenage Palmeiras defender Vitor Reis for $36 million\nMANCHESTER, England (AP) — Manchester City signed a second defender in two days, this time 19-year-old Vitor Reis from Palmeiras for 35 million euros ($36 million) on Tuesday.\nAbdukodir Khusanov, a 20-year-old Uzbekistan international, signed a 4 1/2-year contract Monday after his transfer from Lens. The length of Reis’ contract wasn’t given.\n“I’m excited to join Manchester City,” Reis said. “I want to make my mark as we seek more trophies.”\nCity manager Pep Guardiola talked about the players Tuesday on the eve of his team’s Champions League game at Paris Saint-Germain.\n“Really young young players. Different type, Khusanov (is) physically extraordinary. Hopefully he can learn English soon,” Guardiola said. “Vitor is a young talent in Brazil, I’m very pleased.”\nThe four-time defending Premier League champion has been unusually busy in the January transfer window. City is fifth in the standings — 12 points behind leader Liverpool — and fighting to reach the last 16 in the Champions League.\nEintracht Frankfurt forward Omar Marmoush is reportedly another target for 75 million euros ($77 million).\nReis was a Brazil Under-17 international and made 22 first-team appearances for Palmeiras.\n“He is excellent on the ball and outstanding in the air — he has all the attributes needed to be one of the best,” City director of football Txiki Begiristain said.\nThe moves for Reis and Khusanov, also a center back, come after injuries to City defenders including Ruben Dias, John Stones and Nathan Ake. An ACL injury for Ballon d’Or winner Rodri has also undermined City’s challenge in the Premier League and Europe, with Guardiola admitting recently his squad was too small to cope.\nCity has traditionally preferred to save major transfers for the offseason.\nCity plays PSG in the Champions League on Wednesday with both teams in danger of being eliminated.\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 321,
  "scraped_at": "2026-02-14T02:02:19.848180",
  "_text_extracted": true
}