{
  "article_id": "b3fcd9d1ab42",
  "url": "https://thepeoplesperson.com/2024/02/20/rio-ferdinand-believes-that-rasmus-hojlunds-recent-red-hot-form-is-down-to-confidence-276334/",
  "title": "Rio Ferdinand believes that Rasmus Hojlund recent red - hot form is down to confidence - Man United News And Transfer News",
  "date": "20240220T131500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rio Ferdinand believes that an upturn in confidence is the main factor behind Rasmus Hojlund’s recent goalscoring heroics.\nDespite failing to score in his first 14 Premier League matches, the Dane has now scored seven in six games and recently became the youngest player to score in six consecutive matches in the division.\nSpeaking on his YouTube podcast, VIBE with FIVE, the former United defender confidently asserted, “Hojlund, the jokes are over. You can’t joke about Hojlund anymore. He’s cooking right now”.\nThe Champions League winning defender highlighted how important confidence has been in changing the attacker’s fortunes at Old Trafford.\nElaborating on the issue he claimed, “it shows you that even at £75m, that outlay on him, huge interest, even playing international football. If you haven’t got confidence or confidence is lacking, your game can go to pot”.\nAnother issue that has plagued the Dane this season has been the lack of service from his teammates and the United legend also made sure to highlight this factor.\n“Add to that, getting starved of any chances, as well. So much against him in that sense”.\n“As soon as you get a couple of goals, then all of a sudden comes a bit of confidence. Confidence to go to someone and say cross the ball by the way”.\nThe former United number five also credited his teammates, Alejandro Garnacho and Marcus Rashford for trying to involve the striker in the general team build up.\n“He plays with two wide players who are trying to get him on the ball a little bit more than was before”.\nDiscussing the issue further, he also claimed that if Antony comes back into the team at some stage, he will need to cross the ball and if he doesn’t, Hojlund will now have the confidence to demand service from the Brazilian.\nThe former England international also took time to wax lyrical over the player’s second goal of the game.\nThe ball was swung in from a Luke Shaw corner, the ball was half-cleared to Garnacho who struck a volley that was heading wide but the Dane showed wonderful reflexes and striker’s instinct, to twist his body so that the ball would hit his chest and be diverted into the bottom corner of the net.\nSpeaking of the goal, “chances are falling to him now but he’s not scuffing them, he’s not uptight”.\n“You can see he’s relaxed. The ball came to him, the chest, what a goal. That speed of thought, the ability to do it, but also there’s a bit of confidence in him to do that”.\nHojlund will be hoping that he can make it seven consecutive games in a row with a goal, when United welcome Fulham to Old Trafford this coming Saturday afternoon.",
  "word_count": 462,
  "scraped_at": "2026-02-14T01:51:19.057274",
  "_text_extracted": true
}