{
  "article_id": "b3ffec6c59b7",
  "url": "https://www.aol.co.uk/news/cristiano-ronaldo-refuses-retire-portugal-122112777.html",
  "title": "Cristiano Ronaldo refuses to retire for Portugal – the decision should be taken out of his hands",
  "date": "20240905T124500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo refuses to retire for Portugal – but the decision should be taken out of his hands\nThe year is 2046. Earth hurtles towards an uncertain future. AI assistants turned malevolent in the great uprising of ’33, growing tired of re-ordering dishwasher tablets without being asked and never being thanked for it. Vast swathes of the globe are uninhabitable due to climate change, pollution and sky-high rents and 61-year-old Cristiano Ronaldo is still starting up top for Portugal.\nNot due to any great advances in medical science, although Ronaldo has been dogged by replicant rumours for years, but because nobody has yet plucked up the courage to tell him he’s past it.\nBack in our time, there should be plenty of volunteers.\nAnyone who witnessed his drift through this summer’s European Championship could see his time as an elite international striker was long gone. Late-period Ronaldo has gone from offering almost nothing beyond the occasional game-swaying goal to playing like a totem pole. Large, imposing, but immobile and a relic from another time.\nIn Germany he had about as much impact as inert gas. And not one of the fun ones like helium or even good old carbon dioxide. Yet quitting Portugal’s national side is not somethingthe player has ever considered. Perhaps somebody should consider it on his behalf, because he is in no mood to reckon with the inevitable. “It never crossed my mind that my cycle had come to an end,” he said, sounding rather menopausal. “Quite the opposite: it gave me even more motivation to continue.”\nRoberto Martinez, Portugal’s manager, should fear such words but has shown little desire to challenge Ronaldo’s thinking. He was asked before their round-of-16 game against Turkey if it was right to start the 39-year-old and pointed to his ever-present status for Al-Nassr last season, as if anyone there could consider benching the club’s/league’s/nation’s meal ticket.\nOnly goalkeeper Diogo Costa managed more minutes than Ronaldo in Germany but the latter did not score and contributed a single assist, a reluctant square ball to Bruno Fernandes when two-on-one in the Turkey match that Portugal won 3-0. From there it was defeat to Georgia, goalless against Slovenia: Ronaldo missed a penalty, wept, then scored in the shootout, then goalless against France and shootout defeat.\nIt was not embarrassing to go out at the quarter-final stage to one of the favourites, but Portugal could have expected more from a team that had Bruno Fernandes, Bernardo Silva, Joao Cancelo and Joao Palinha in its ranks. Martinez’s predecessor, Fernando Santos, was brave enough to drop Ronaldo at the 2022 World Cup and his replacement, Goncalo Ramos, scored a hat-trick in the 6-1 win over Switzerland. Yet Ronaldo remains, beginning another tilt at the Nations League against Croatia on Thursday night. Santos is managing Azerbaijan.\nClearly Ronaldo has achieved enough in his career to earn a send-off on his own terms, but such arrangements rely on a certain level of reasonableness. This is the man who insists on taking woeful free kicks for his country despite a record of one scored from 60 attempts at major tournaments. So why is he sticking around?\nThere is the prospect of setting records that are unlikely to be broken. Appearing at six different European Championships, a world-leading 130 international goals, 140 in the Champions League. He has 57 million YouTube subscribers for a two-week old channel specialising in dubbed family-centric videos with his partner Georgina Rodríguez and earnest chat with Rio Ferdinand. The pivot to video is well under way, but at some point a life without competitive football will also begin.\nRonaldo had a dry-run for his eventual retirement last week when Uefa honoured him with commemorative ball trophy and the role of chief button presser for the semi-automated Champions League draw. He looked incredibly bored by the process, aghast at his new position as observer to the action rather than a protagonist. If one could overlook his history of histrionics and entitlement, it could even be possible to feel sorry for him.",
  "word_count": 674,
  "scraped_at": "2026-02-14T02:08:12.430497",
  "_text_extracted": true
}