{
  "article_id": "b41a797963f0",
  "url": "https://www.fourfourtwo.com/competition/watch-manchester-united-vs-tottenham-hotspur-premier-league-2025-26",
  "title": "How to watch Manchester United vs Tottenham Hotspur : Live streams , TV details",
  "date": "20260207T110000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWatch Manchester United vs Tottenham Hotspur today in the latest edition of one of the Premier League's great chaotic fixtures, with FourFourTwo bringing you all the details on live streams and TV channels, wherever you are in the world.\n• Date: Saturday, 7 February 2026\n• Kick-off time: 12:30pm GMT / 7:30am ET\n• Venue: Old Trafford, Manchester\n• TV & Streaming: TNT Sports / Discovery+ (UK), USA Network via Sling (US), Stan Sport (Australia)\n• Watch from anywhere: Get 70% off NordVPN\nLast May, Manchester United and Spurs put it all on the line in Bilbao. The Europa League finalists had both stumbled badly in the Premier League and only European success could salvage something from the season.\nSpurs won the Europa League and claimed a place in the Champions League. As they meet for the second time this season, it doesn't seem ridiculous to ask whether they'd swap places.\nRead on as FourFourTwo brings you all the information on how to watch Manchester United vs Tottenham Hotspur online, on TV, and from anywhere.\nWatch Manchester United vs Tottenham Hotspur in the UK\nManchester United vs Tottenham Hotspur is this weekend's Saturday lunchtime kick-off on TNT Sports / Discovery+ in the Premier League. It will be broadcast live on TNT Sports 1 and can be streamed by subscribers to the Discovery+ platform.\nWatch the Premier League on TNT Sports and Discovery+\nYou can either get TNT Sports on your TV, in a traditional TV package deal – prices vary by provider – or you can stream all the channels through Discovery+, which costs £30.99 a month, and includes Champions League football.\nWatch Manchester United vs Tottenham Hotspur in the US\nManchester United vs Tottenham Hotspur is one of this week's Premier League games available to stream live in the United States on USA Network via Sling.\nWatch the Premier League on USA Network via Sling\nSling TV carries the linear USA Network channel and you will be able to stream the Manchester United vs Tottenham game via their Blue Plan ($45.99/month).\nHow to watch Manchester United vs Tottenham Hotspur in Australia\nPremier League lovers in Australia can watch Manchester United vs Tottenham Hotspur through Stan Sport.\nWatch the Premier League on Stan Sport\nStan Sport is the new Optus Sport – home to every single Premier League and Champions League live stream. Sign up, add the Stan Sport package (AU$20 AU$10 a month right now) to the base Stan plan ($12 a month), and watch away.\nWatch Manchester United vs Tottenham Hotspur from anywhere\nA good VPN is your ticket to the game, even when you’re abroad.\nMost streaming platforms have geo-restrictions that prevent you from watching your usual subscription services from another country. A Virtual Private Network helps you get around this problem by changing your IP address, making your laptop, tablet or smartphone appear to be in a different country. That means you can watch your usual streams, even when you’re a long way from home.\nThe tech experts at Tom's Guide review a lot of VPNs and right now they reckon NordVPN is the best VPN you can buy. And the good news is that NordVPN are currently offering an amazing deal on the service...\n🥇 World's best VPN service\n🙌 Fast, secure, easy to use\n✅ Unblocks Sling, Stan Sport\nSee also ► Premier League TV guide\nManchester United vs Tottenham Hotspur: Premier League preview\nMan United are somewhat remarkably winless in their last eight meetings with Spurs in all competitions, a sequence that dates back as far as a 2-0 win at Old Trafford in October 2022.\nTraditionally, this is a fixture that serves up plenty of goals. In the Premier League era alone there's been a 6-1 away win for Spurs, a 5-2, a 4-0 away win for United and a famous 5-3 Red Devils victory at White Hart Lane.\nThere hasn't been a goalless draw between Man United and Spurs for more than a decade and interim head coach Michael Carrick will be desperate for his team to impose their will on this 12.30pm kick-off.\nThey've won all three matches on his watch and are now nicely perched just inside the Premier League's top four with that elusive Champions League return in their crosshairs.\nTickets\nGet VIP Manchester United tickets HERE with Seat Unique!\nManchester United's hospitality offers comfortable, padded seating in the North West Quadrant. The package includes a concourse meal deal (hot food, drink, and snack) and the official matchday programme. Guests also receive a 10 per cent Megastore discount and non-matchday Museum entry, providing a great value, family-friendly match experience for home fans.\nIf their opponents are enjoying the benefits of a mid-season managerial change, Spurs are labouring under Thomas Frank after his summer appointment.\nNow 14th in the table, the Europa League holders are on a six-match winless run in the Premier League. The Champions League is offering some relief elsewhere but those six matches were against Brentford, Sunderland, Bournemouth, West Ham United, Burnley and Man City.\nSpurs were able to correct course for long enough to ride a spectacular Dominic Solanke double to a point at the Etihad Stadium but supporters have every right to be livid about that little run of form.\nBumping up against a freshly in-form United on their own patch might be the last thing Spurs needed. With home games against Newcastle United and Arsenal to follow, Frank could be heading into a pivotal fortnight.\nSee also ► These are the cheapest ways to watch the Premier League this season\nFourFourTwo's prediction\nManchester United 4-2 Tottenham Hotspur\nIf you told us no human being had ever correctly predicted a Manchester United vs Tottenham Hotspur scoreline, we wouldn't be entirely surprised. Goals please.\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1213,
  "scraped_at": "2026-02-14T01:59:36.843154",
  "_text_extracted": true
}