{
  "article_id": "b427b94af646",
  "url": "https://www.gdnonline.com:443/Details/1347897/LaLiga-Atleticos-Simeone-still-optimistic-about-title-chances-after-Barcelona-loss",
  "title": "Football : LaLiga : Atletico Simeone still optimistic about title chances after Barcelona loss",
  "date": "20250317T071500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Atletico Madrid coach Diego Simeone remains optimistic about the club's title chances after Sunday's 4-2 LaLiga defeat to Barcelona, saying the loss was not down to bad luck but lack of consistency.\nHansi Flick's side staged a comeback at the Metropolitano, with Ferran Torres scoring a brace, to move to the top of the LaLiga table on 60 points.\nBarca are level on points with second-placed Real Madrid, who won 2-1 at Villarreal on Saturday, yet they have a game in hand after last week's postponement of their home game with Osasuna. Atletico are third on 56 points.\n\"We will fight until the end. There are 10 games left and we have to play and win every one of them,\" Simeone told DAZN.\n\"It's not down to luck,\" the coach said. \"It's down to hard work. I wouldn't put it down to luck. We have to recognise the rival.\"\nSimeone spoke about fatigue following Champions League defeat at the hands of Real Madrid as well as the health of forward Julian Alvarez, whose slip during that match's penalty shootout caused him to touch the ball twice resulting in his goal being disallowed.\n\"A few days ago he had a bad stomach, yesterday he had a fever and this morning he had again stomach problems. I didn't want to play him, we talked, he was committed and I understood that he had given absolutely everything.\"\nThe coach also rued a missed opportunity to change tactics after his team went 2-0 up, indicating a few minutes during which he may have secured a more favourable outcome.\n\"In football, those four or five minutes are unforgivable. At that moment I was pushing to finish the game, the boys were reacting and I just didn't have the time. It was too late,\" Simeone said in a press conference.",
  "word_count": 304,
  "scraped_at": "2026-02-14T02:26:33.627307",
  "_text_extracted": true
}