{
  "article_id": "b42f578ff3d5",
  "url": "http://thepeninsulaqatar.com/article/07/06/2025/ballon-dor-should-go-to-champions-league-winner-says-ronaldo",
  "title": "Ballon dOr  should go to Champions League winner , says Ronaldo",
  "date": "20250607T131500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nThis combination of pictures created on June 06, 2025 shows Portugal's forward #07 Cristiano Ronaldo (L) controling the ball during the UEFA Nations League semi-final football match between Germany and Portugal in Munich, southern Germany on June 4, 2025 and Spain's forward #19 Lamine Yamal passing the ball during the UEFA Euro 2024 semi-final football match between Spain and France at the Munich Football Arena in Munich on July 9, 2024. (Photo by Tobias SCHWARZ and Fabrice COFFRINI / AFP)\nMunich: Five-time Ballon d'Or winner Cristiano Ronaldo said Saturday the individual honour should be awarded to a player who won the Champions League.\nSpeaking ahead of Sunday's Nations League final in Munich between Portugal and Spain, the veteran said \"trophies\" should determine who wins the Ballon d'Or.\n\"In my opinion, whoever wins it should be on a team that has won trophies. The Ballon d'Or winner should be in a team that has won the Champions League,\" the 40-year-old forward told reporters.\nFirst awarded in 1956 by French magazine France Football, the Ballon d'Or is awarded to the player considered the best over the previous season.\nParis Saint-Germain's 5-0 thumping of Inter Milan in the Champions League final last Saturday led to growing calls for Ousmane Dembele to win this season's gong.\nSpain starlet Lamine Yamal's superb display in Thursday's 5-4 Nations League semi-final win over France however had some arguing the teenager should be awarded the Ballon d'Or, which would make the 17-year-old the youngest winner in its history.\nFrance coach Didier Deschamps backed Dembele for the award, saying \"considering the season Ousmane is having, he deserves it and that's all I wish for him\".\nAt a press conference in Stuttgart on Saturday, France captain Kylian Mbappe told reporters he backed Dembele.\n\"Does anyone really need me to explain? Right now we're talking about Lamine Yamal and Ousmane Dembele, but I'm voting for Dembele.\"\nRonaldo said he \"cannot tell you who deserves it\" this season.\nRonaldo's five wins is bettered only by Argentinian Lionel Messi, who has won the award eight times.\nThe duo had a monopoly on the award for a decade from Ronaldo's first win in 2008 to his last in 2017.\nThe current holder is Spain and Manchester City midfielder Rodri.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 443,
  "scraped_at": "2026-02-14T02:09:11.429443",
  "_text_extracted": true
}