{
  "article_id": "b4368c92f8cb",
  "url": "https://www.themag.co.uk/2025/03/very-positive-update-on-anthony-gordon-injury-situation-report-newcastle-united-england/",
  "title": "Very positive update on Anthony Gordon injury situation - Report",
  "date": "20250323T194500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Very positive update on Anthony Gordon injury situation – Report\nAnthony Gordon replaced Marcus Rashford for England in the 74th minute on Friday night and very quickly he was involved in a challenge that appeared to leave him in some pain, holding his hip.\nThe NUFC player carried on, but just before the final whistle he went to ground again, needing treatment on the pitch before being helped off.\nAn official FA statement (see below) on Sunday morning revealed that Anthony Gordon would miss the Latvia match on Monday, having been forced to withdraw from the England squad. The statement adding that Gordon had returned to Tyneside to be assessed.\nFair to say that Newcastle United fans had been left fearing the worst, especially with only two months of the season left to go, so many crucial matches in a short space of time to decide whether United qualify for the Champions League.\nA very positive update though has now followed.\nIt comes from Craig Hope of The Mail, who has a really good track record when it comes to breaking stories regarding Newcastle United players and their injury situations.\nThe man from The Mail on Sunday afternoon has said that Anthony Gordon had a scan on Saturday and that the hip injury isn’t as serious as first feared. Hope adds that Gordon is indeed back with Newcastle United and having been assessed ‘the news wasn’t too bad.’\nWhat I think we can take from this, reading between the lines, is that if the journalist’s information is good (which it usually is), then it isn’t a serious injury, not one that will see a very lengthy absence and no surgery needed. Which then leaves us wondering how long before Anthony Gordon is fit and available? With these things, I think a lot to do obviously with how the player himself feels and if no major damage shown on his scan, Eddie Howe and the player will know a lot more in a matter of days when the knock/injury has had a chance to settle down hopefully.\nAnthony Gordon misses the home game against Brentford on Wednesday 2 April as it is the third of his club suspension, but he is then free from suspension for the away game at Leicester on Monday 7 April, the ninth last Premier League match of the season for United.\nThe Premier League season ends exactly nine weeks today, when Newcastle are at home to Gordon’s old club Everton. That Leicester away match is in 15 days time, so here’s hoping he can be back for that, or if not, for one of the other matches that swiftly follow (Man U at home on 13 April, Palace at home on 16 April, Villa away on 19 April).\nOfficial England statement – 23 March 2025:\n‘Anthony Gordon has withdrawn from Three Lions camp having sustained an injury during Friday night’s 2-0 win over Albania.\nThe forward has returned to Newcastle United for further assessment.’\nAnthony Gordon was unavailable for his second cup final since arriving at Newcastle United, having been cup-tied for the Man U final in 2023 having already played for Everton in the competition, whilst of course suspended last weekend for the win over Liverpool, though he fully joined in (see photo above) the celebrations after the final whistle at Wembley. It would have been especially cruel, if Anthony Gordon had then been ruled out for the rest of the season as well.\nThis is the March 2025 international schedule for Newcastle United players:\nThursday 20 March\nItaly 1 Germany 2\nSandro Tonali man of the match for Italy in this Nations League play-off first leg.\nScored a very well taken ninth minute goal and ran the show for Italy, creating great chances for teammates that were wasted. Germany fighting back though to win it with two second-half goals.\nGreece 0 Scotland 1\nOdysseas Vlachodimos dropped to the bench, presumably due to getting no football with Newcastle United. Scotland scoring with one of only two shots on target to get a surprise win in the first leg of this Nations League play-off, McTominay from the penalty spot.\nSlovakia 0 Slovenia 0\nA great display from Martin Dubravka with some fine saves, to help keep Slovakia on level terms in the first leg of this Nations League play-off.\nBrazil 2 Colombia 1\nBruno Guimaraes started and Joelinton replaced an injured Gerson on 28 minutes. A massive win in this World Cup group qualifier, Brazil now second in the South American qualifying group and now looking all but certain to be in those 2026 finals. A sixth minute penalty from Raphinha was equalised by Diaz just before half-time, Vinicius Junior with a dramatic late deflected winning in the ninth minute of added time.\nFriday 21 March\nEngland 2 Albania 0\nA cool finish on his debut by Lewis-Skelly in the 20th minute gave England the lead, then Harry Kane confirmed the win with his latest international goal on 77 minutes. Dan Burn can be happy with his contribution overall and it could have been so much better if his header from a first half corner had hit the back of the net instead of the crossbar. Injury concerns though for Anthony Gordon who came on in the 74th minute for Rashford but left the pitch at the end with a potential hip injury. Tino Livramento an unused sub in this World Cup group qualifier.\nSaturday 22 March\nLuxembourg 1 Sweden 0\nA friendly that Alexander Isak and Sweden were second best in, as Korac gave the home side a 23rd minute lead. The Newcastle United striker seeing a number of efforts blocked and/or saved, before subbed off on 61 minutes. Defeat in Luxembourg coming six days after that stunning victory at Wembley. Funny old game.\nSunday 23 March\nScotland v Greece (Odysseas Vlachodimos) Nations League Play-Off\nGermany v Italy (Sandro Tonali) Nations League Play-Off\nSlovenia v Slovakia (Martin Dubravka) Nations League Play-Off\nMonday 24 March\nEngland v Latvia (Tino Livramento, Dan Burn) World Cup group qualification\nTuesday 25 March\nSweden v Northern Ireland (Alexander Isak) Friendly\nArgentina v Brazil (Bruno Guimaraes is suspended for this match after picking up that latest yellow card against Colombia, Joelinton available though) World Cup group qualifier\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1060,
  "scraped_at": "2026-02-14T01:49:31.513276",
  "_text_extracted": true
}