{
  "article_id": "b44fc5db0ec4",
  "url": "https://www.nytimes.com/athletic/6397463/2025/06/03/real-madrid-summer-transfer-dealsheet/",
  "title": "Real Madrid Transfer DealSheet : Summer window latest , key targets and likely exits",
  "date": "20250603T224500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A summer of change is well underway at Real Madrid.\nCarlo Ancelotti has been replaced as coach by Xabi Alonso, defenders Dean Huijsen and Trent Alexander-Arnold have joined and Madrid are working on a possible deal for Benfica left-back Alvaro Carreras.\nThere could be more to come too, as the Bernabeu club move on from a regular season in which they won none of La Liga, the Champions League or the Copa del Rey. The revamped Club World Cup kicking off this month in the United States offers them a chance to get back to lifting trophies under new management — but where will Madrid be looking to strengthen further this summer?\nHere, we answer some of the key questions about their transfer window.\nAdvertisement\nWho will make the key decisions this window?\nAt Madrid, the final — and most important — decision is always taken by club president Florentino Perez. But other voices are influential too.\nOne of those belongs to Juni Calafat, the man in charge of Madrid’s recruitment who has been responsible for signing talented young players such as Vinicius Junior, Federico Valverde and Jude Bellingham in recent years. Chief executive Jose Angel Sanchez is responsible for conducting negotiations and closing deals. The former Madrid player and ex-interim coach Santiago Solari has been involved in these processes in recent years after returning as director of football in 2022.\nThose four key figures have now been joined by Alonso, who is playing an active role in improving the squad he inherited.\n“We have talked about things and they are agreed,” Alonso said in his first Madrid news conference. “There are others that affect me more directly. As of today, I’m already here to make decisions and decide things.”\nAt his previous club Bayer Leverkusen, sources — who, like all those cited in this article, asked to remain anonymous to protect relationships — say the former Madrid, Liverpool, Bayern Munich and Spain midfielder was important in calling players to help convince them to join.\nWhat moves have they made already?\nMadrid moved quickly to reinforce their squad with promising additions in all positions where they have suffered injuries or have ageing players.\nLast week, Madrid secured Alexander-Arnold’s long-expected signing from Liverpool — paying a fee of €10million (£8.4m, $11.4m) to have the right-back available for them for the whole of the Club World Cup when he could have joined for free after the tournament.\nDani Carvajal has said he is expecting to return from his October anterior cruciate ligament (ACL) injury at the Club World Cup, although this remains to be seen. Until Alexander-Arnold’s arrival, Lucas Vazquez was the only player available to Alonso in that position. He is ready to leave the club after the Club World Cup, hence Madrid’s urgency in bringing forward this deal.\nAdvertisement\nThey also signed centre-back Huijsen from Bournemouth in a £50million deal that is a club record for a defender. This was another necessary move, given Antonio Rudiger, David Alaba and Eder Militao are all currently out with injury. The trio are expected to be able to play some role in the U.S. — although this is less clear with Militao — but the 20-year-old Spain international strengthens a weakened area of the team. Rudiger and Alaba are not expected to be fit for the start of the tournament in just over two weeks.\nWhat positions will they be looking at in the summer window?\nThere are two further deals which could be done before the Club World Cup.\nMadrid are in talks with Benfica to re-sign their former academy left-back Carreras, who would also cost around €50million. The 22-year-old Spaniard is their first option in this position, but sources involved in negotiations believe it will not be an easy deal, as they say Carreras’ previous club Manchester United have a buy-back option, which could be worth up to €20m — although voices at United played down this prospect. They do have a sell-on clause as part of the deal that took him to Benfica in 2024, which is worth 20 per cent of any fee above the £5m the Portuguese club bought him for.\nIf Madrid do not sign Carreras, they are considering other alternatives such as Leverkusen’s Alejandro Grimaldo.\nThe club could also look to the market for a midfielder. They have been hoping to strengthen that position for some time, following Toni Kroos’ surprise retirement last summer and with the imminent departure of Luka Modric, who will leave after the Club World Cup.\nWhat is the manager’s priority?\n“We always want to improve and I want to have that communication with the club,” Alonso said at his presentation, without going into details of what he was looking for. “The squad is very good. It’s not that I’m coming to you (the club) with demands but with the idea of wanting to improve.”\nAdvertisement\nThe two signings who have already joined have met some of Alonso’s priorities. But he will be happier if a left-back also arrives, with reinforcements in other positions being considered.\nAre there any specific players they are targeting?\nApart from defence, another name to watch is Nico Paz.\nThe 20-year-old Como midfielder came through the youth ranks at Madrid and they have a €8million buy-back clause for him (the fee would rise to €9m in 2026 and €10m in 2027 if they do not trigger it this summer). That was part of the deal when he left Madrid last summer, when they sold the Argentina international for €6m with a first refusal to re-sign him from the Italian club and also this buy-back clause.\nComo worked to try to remove the latter during last season, but Madrid hold the negotiating power and will make the final decision on Paz’s future. At this stage, Bernabeu executives have yet to communicate their intentions to Como but they are considering triggering the clause.\nWho will they be looking to sell?\nBackup goalkeeper Andriy Lunin has a contract until 2030 which he signed last year, but voices in his camp think he deserves greater prominence and are exploring other options. That happened last summer too, before the Ukrainian renewed his deal, but Madrid and the player did not receive an appealing offer — which could influence his future again this summer. He has told sources at the club’s Valdebebas training complex that he intends to stay.\nLeft-back Fran Garcia was closely followed by Alonso while he was Leverkusen manager. But the possible arrival of a new player in his position means the 25-year-old could fall further down the Madrid pecking order. His priority is to stay, but Valdebebas sources are starting to doubt whether that will be possible. Clubs including Bournemouth have previously shown an interest in the Spaniard and whether he stays could be impacted by what fellow left-back Ferland Mendy does. Mendy has a deal until 2027 but was injured for much of last season.\nThe case of Rodrygo is complicated. The Brazilian did not play in the last few games of the season but the club did not publish a medical report giving the reason for his absence, as they usually do with injured players. Premier League teams have shown an interest in him, with Kylian Mbappe’s arrival last summer having reduced his role.\nAlonso backed Rodrygo when asked about the forward during his post-presentation press conference.\n“He is a Madrid player and I will have a conversation with all of them,” he said. “He is a spectacular player and we will need him.” According to sources close to Rodrygo, he wants to speak to the club and Alonso before he makes a decision.\nAdvertisement\nSome players have already left. Jesus Vallejo went as his contract was not renewed before the Club World Cup, with the 28-year-old defender assessing his options and thinking about Major League Soccer as a potential destination.\nAs stated earlier, Vazquez and Modric are set to leave after the tournament. In Modric’s case, this was made official before the last game of the La Liga season but Vazquez also received an emotional send-off at the Bernabeu. Both want to continue competing at the highest level.\nWill anyone move out on loan?\nIt has become increasingly rare for Madrid to loan their players out as they do not feel they are guaranteed playing time at the clubs who borrow them — especially when it comes to youngsters or academy graduates who have to progress.\nInstead, they have tended to opt for selling players while inserting buy-back clauses and rights of first refusals in the deals, as is the case with Paz.\nSources at Valdebebas believe there are players from the club’s reserve Castilla side who could leave in that way this summer, including strikers Victor Munoz and Gonzalo Garcia. They have attracted interest within La Liga and from clubs abroad as well.\n(Top photos of Paz, left, and Carreras: Getty Images)",
  "word_count": 1487,
  "scraped_at": "2026-02-14T02:02:47.533874",
  "_text_extracted": true
}