{
  "article_id": "b4a1f091ef2a",
  "url": "https://allafrica.com/stories/202508250723.html",
  "title": "Namibia : Gaberone United , Costa Do Sol Grab Wins",
  "date": "20250825T183000Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gaborone United Ladies FC and Costa do Sol recorded wins on the second day of the CAF Women's Champions League | Cosafa Qualifiers being played at the AW Muller Stadium in Johannesburg, South Africa on Saturday.\nIt was another fantastic day of football as the record 10 teams in this year's tournament compete for a single place at the continental finals that will be staged later this year.\nLast year's beaten finalists Gaborone United from Botswana claimed a 1-0 victory over Young Buffaloes of Eswatini in a hard-fought Group B encounter in the first game of the day.\nGaborone needed a penalty on 49 minutes from the talismanic Keitumetse Dithebe to seal the win that puts them in charge of the three-team pool. Buffaloes must now beat Kick4Life in their second game and hope the Lesotho side do them a favour by defeating Gaborone to have a chance of advancing.\nKeep up with the latest headlines on WhatsApp | LinkedIn\nDithebe was named Player of the Tournament last year when the qualifiers were staged in Malawi and has made a good start this time round too.\nCosta do Sol from Mozambique opened the scoring against Herentals Queens from Zimbabwe just before the half-hour mark as Lucia Moçambique had the simplest of tap-ins having been teed up in the six-yard box.\nThe Mozambican side grabbed a second just after halftime and it was a screamer. A long ball fell for Eunencia Machava and she thundered a shot towards goal that rifled into the back of the net.\nThe second round of matches in Group A will be played on Sunday at the same AW Muller Stadium venue.\nAnd there will be a heavyweight clash between Mamelodi Sundowns and debutantes Zesco Ndola Girls, who both won their openers 3-0 on Friday.\nThe victor of this clash, if there is one, will be in the pound seats when it comes to qualification for the semi-finals, with only the top team in each pool advancing and the best-placed runner-up.\nThat match kicks-off at 15h00 CAT (13h00 GMT) and could have huge ramifications on the remainder of the tournament.\nBefore then, Malawi side Ntopwa FC and another debutante, Beauties FC from Namibia, clash at 12h00 CAT (10h00 GMT) in the hope of keeping their title ambitions alive.\nThey each have to bounce back from their opening day defeats but will feel like this is an excellent chance to showcase their quality.\nEntrance for fans to all matches will be free of charge. If you cannot get to the stadium, you can watch all matches streamed LIVE on FIFA+. - cosafa.com",
  "word_count": 435,
  "scraped_at": "2026-02-14T01:52:36.768077",
  "_text_extracted": true
}