{
  "article_id": "b4ad8b8868fa",
  "url": "https://www.90min.com/posts/pfa-vertu-motors-wsl-fans-player-of-the-year-2022-23-nominees",
  "title": "PFA Vertu Motors WSL Fan Player of the Year",
  "date": "20230516T131500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PFA Vertu Motors WSL Fans' Player of the Year - 2022/23 nominees\nBy 90min Staff\n90min is the home of the PFA Vertu Motors Fans’ Player of the Month Award for the 2022/23 season.\nEach month, you can vote for your favourite players across five divisions of English football, for the chance to win incredible prizes, including the opportunity to present the award to the winning player.\nThe 2022/23 WSL season is almost over but there are still a few loose ends to be tied up.\nThe title has not yet been decided, a spot in the Women's Champions League remains up for grabs and the relegation battle is expected to roll to the final day.\nBut along the way this year, there have been a number of stellar performances from individual stars.\nHere are the nominees for the 2022/23 PFA Vertu Motors WSL Fans' Player of the Year award.\n1. Ona Batlle (Man Utd)\nOna Batlle is massively influential for Manchester United from full-back both in defence and attack and has been a main reason why the club has been able to challenge for the WSL title this season.\nThe Spaniard has the pace and tenacious tackling ability to shut down any winger she comes across. But with the ball is where she really shines.\nPer FBREF, Batlle leads the United squad when it comes to progressive carries, with nearly twice as many as the next best. She has also registered nine WSL assists over the course of the season, joint second in the league, and is totally unrivalled by any defenders in such a capacity.\n2. Rachel Daly (Aston Villa)\nRachel Daly continued to be utilised as a left-back by England during last summer's triumphant Euro 2022 campaign. But Aston Villa very much intended her to be a striker and have been handsomely rewarded.\nDaly had been a forward at Houston Dash and has taken her game to new levels in her first full season back in English football in more than a decade, hitting 20 goals and counting in the league alone.\nThe 31-year-old has spearheaded Aston Villa's surge up the table, netting a brace in a famous win over Manchester City on the opening weekend of the season and not looking back since. She could yet win the golden boot.\n3. Mary Earps (Man Utd)\nMary Earps has already been named Best FIFA Women's Goalkeeper this season, recognising her role in England's Euro 2022 triumph last summer. But she been truly outstanding for Manchester United in the WSL too.\nEarps has kept 13 clean sheets in 20 WSL games so far, equalling the league record for a single season set by Manuela Zinsberger in 2021/22. She hasn't always been a spectator either, making notable saves at crucial moments in various games throughout the season.\nWhat has also stood out from Earps is the leadership and confidence she brings to others, which has underpinned United's defensive strength.\n4. Frida Maanum (Arsenal)\nArsenal fans breathed a sigh of relief when Frida Maanum was okay to carry on in their recent game against Manchester United after receiving lengthy treatment. The Gunners had already lost four key players to serious injury in the season up to then, but Maanum is arguably their most important.\nThe Norwegian never stops running and is even able to put the team on her back when things aren't going right and score goals - nine of them in the WSL. She also plays with maturity and discipline well beyond her 23 years.\nMaanum has stepped up big when Arsenal have needed her most this season, particularly in wins over Manchester City, Leicester and Brighton since the start of April alone. If the Gunners make it into the top three with all the obstacles they have faced, she will have been the main reason.\n5. Sam Kerr (Chelsea)\nSam Kerr, for want of a better word, feels inevitable in a Chelsea shirt.\nShe has already scored the winning goal in the FA Cup final and claimed a second successive FWA Footballer of the Year award in May, while the Australian's spearheading the Blues' late title push.\nOnly Rachel Daly and Khadija Shaw have scored more WSL goals this season than Kerr heading into the final few weeks of the campaign.\n6. Khadija Shaw (Man City)\nKhadija 'Bunny' Shaw has gone from a bit-part player at Manchester City, sharing game time with Ellen White, to automatic starter and devastating goalscorer in the space of the last 12 months.\nUntil recently, Shaw was leading the WSL golden boot race, having scored 18 times in the league. Her 29 in all competitions is actually a Manchester City record for most goals in a single season, while she is no stranger to an assist either and has six of those in the WSL.\nThe Jamaican knows where the goal is and is a true penalty box striker.\nYou can place your vote here!\nNO PURCHASE NECESSARY. Enter Competition between 10/5/21 at 6:00 PM BST and 6/11/23 at 6:59 PM BST; conducted as 18 separate monthly competitions & 2 separate Grand Prize competitions. Open to legal residents of the United Kingdom (excluding Northern Ireland), who are 16+ at time of entry. Limit 1 entry per person per period.\nSee Official Rules for full details on how to enter, eligibility requirements, entry periods, odds of winning, prize descriptions and limitations. Void in Northern Ireland and where prohibited.",
  "word_count": 905,
  "scraped_at": "2026-02-14T02:00:19.997953",
  "_text_extracted": true
}