{
  "article_id": "b4af0f63c3a5",
  "url": "https://www.fourfourtwo.com/person/player/arsenal-player-faces-backlash-over-horror-challenge-amid-surprising-punishment-decision",
  "title": "Arsenal player faces backlash over horror challenge amid surprising punishment decision",
  "date": "20260205T120000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nArsenal winger Ethan Nwaneri is at the centre of a red card controversy after a dangerous tackle in a cup tie in France.\nNwaneri is on loan to Marseille from the Gunners and played the first half of their 3-0 win over Rennes in the Coupe de France round of 16 at the Velodrome on Tuesday night.\nIn a physical battle between the Ligue 1 rivals, OM came out on top thanks to goals from Amine Gouiri, former Arsenal striker Pierre-Emerick Aubameyang and Premier League outcast Mason Greenwood.\nEthan Nwaneri’s tackle sparks red card debate\nThe post-match furore is the result of a tackle by Nwaneri on Rennes midfielder Glen Kamara, who’s played much of his career in England and Scotland and spent five years as a junior on the books at Arsenal.\nKamara, a Finnish international and formerly of Rangers and Leeds United, limped out of the CdF fixture wearing one boot and one sock after Nwaneri’s challenge near the touchline.\nA post shared by OM | Olympique de Marseille (@olympiquedemarseille)\nA photo posted by on\nWith the score at 1-0 after Gouiri’s early opener, Kamara was carrying the ball up the left wing and Nwaneri, tracking the midfielder, dived in from the side with studs showing.\nWhile footage of the incident confirmed that the contact on Kamara’s ankle was brief, it caused the 30-year-old’s lower leg to buckle and ended his involvement in the match.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nNwaneri was shown a yellow card for the tackle but there is uproar in the French football community, with a fierce debate ongoing as to whether the teenager should have been sent off.\nThe criteria for a red card certainly seem to have been met by Nwaneri’s foul but the match referee deemed a yellow to be sufficient and VAR was not in use in the round of 16.\nNwaneri joined Marseille on loan during the January transfer window with a view to playing first team football more regularly. He scored in a win over Ligue 1 leaders Lens on his debut, allowing Paris Saint-Germain to overtake them, and played 67 minutes of Saturday’s 2-2 draw at Paris FC.\nGet VIP Arsenal tickets HERE with Seat Unique!\nArsenal's premium Club Level tickets offer superb padded seating and access to the lounge two-and-a-half hours pre-match. The package includes four drinks, one food item, and a half-time complimentary drink. Guests also receive a £5 merchandise voucher and a complimentary Museum Tour, ensuring an elevated and comprehensive matchday experience for home supporters.\nIt’s been a tumultuous period for Marseille, whose season began with a brawl between teammates Adrien Rabiot and Jonathan Rowe, both subsequently bombed out of the club, and reached its nadir with a tame league phase elimination in the Champions League last week.\nThere was another training ground bust-up before the game against Rennes, this time involving Geoffrey Kondogbia and Arthur Vermeeren and welcomed by head coach Roberto De Zerbi.\nThat outlook is frequently in evidence on the pitch, where OM can be aggressive and confrontational. De Zerbi has built a team with a certain character, making Marseille the scourge of referees and opponents alike.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 704,
  "scraped_at": "2026-02-14T01:59:36.846261",
  "_text_extracted": true
}