{
  "article_id": "b4da625b7c2d",
  "url": "https://www.nytimes.com/athletic/5558083/2024/06/13/hungary-viktor-orban-euro-2024/",
  "title": "Hungary , Viktor Orban and the weaponisation of a national football team",
  "date": "20240613T131500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sign up for The Athletic today with our limited-time Tournament Sale offer.\nViktor Orban could not have been clearer.\n“Today, we have a national team that goes into the game with the chance to win against anyone,” Hungary’s prime minister told its tabloid newspaper Blikk last month. “We can’t be underdogs — those little boys who just got out and are trying to behave properly on the pitch. We are men and we want to beat you.”\nAdvertisement\nThe words were typical Orban; a nationalistic projection of defiance, a refusal to accept Hungary’s place in the established order of modern Europe. His long and divisive political career has been shaped by the same messaging and now, after a second spell as head of state that has lasted 14 years, Orban sees capable flagbearers in Hungary’s national football team.\nPerhaps not since the 1950s, during the fabled era of Ferenc Puskas and the team dubbed the Magical Magyars, have Hungary known a side as accomplished as the current one nurtured by Italian head coach Marco Rossi. Unbeaten during their qualification campaign for the 2024 European Championship, the past two years have also brought competitive wins over England (twice) and Germany. The days of losing to minnows Andorra, as they did in 2017, are long gone.\nOrban, the nation’s 61-year-old populist and autocratic figurehead, knows a good thing when he sees one and has been quick to latch onto the team’s rise.\nSport – and primarily football – mixes freely with politics under his right-wing Fidesz party. An estimated £2.2billion ($2.8bn) of public funds have gone towards renovating stadiums and training facilities across the country since it came to power in 2010. Political opponents have suggested more has been spent on the development of young footballers than teachers.\nHow to follow Euro 2024 and Copa America on The Athletic…\n“Football for Orban is not a sport, it’s a way of expressing an ideology,” says Simon Chadwick, professor of sport and geopolitical economy at the SKEMA Business School in Paris, France.\n“We see it all over the world: Donald Trump making America great again. President Xi making China great again. Vladimir Putin making Russia great again. Orban’s policies play to a narrative of making Hungary great again.”\nAdvertisement\nAlmost every Hungarian top-flight club has either a new or rebuilt stadium funded by the state and Budapest’s 67,000-capacity, £500million Puskas Arena was last month selected to host the 2025-26 Champions League final. It previously staged the 2022-23 Europa League final and four games at the previous European Championship three years ago.\nNone of it has been accidental. Orban has pushed to restore Hungarian football to prominence, using his favourite sport to secure political gains domestically and legitimacy further afield. Orban’s supporters argue it has been money well spent after decades of decline. His opponents, though, see only the vanity of backing sporting projects in a country still beset by poverty.\nHungary will aim to deliver on their burgeoning potential in Germany over the coming weeks, but the thread running through the story of their revival is unmistakably political.\nIt is 11 days before Hungary’s opening group game at Euro 2024 and their preparations have brought them to Dublin for a warm-up friendly against the Republic of Ireland. Roughly 1,500 fans have made the journey for the match and a sizeable number have settled in Slattery’s, a pub next to the Aviva Stadium, ahead of kick-off.\n“This is our best team since 1986,” says Sandor, who has travelled with friends from his home on the outskirts of Budapest. He is the only member of their group yet to secure a ticket for the Euros. “There is a lot of excitement. We have a chance.”\nUEFA has said that Hungary is one of the top five nations to have requested Euro 2024 tickets from outside tournament hosts Germany, along with England, Turkey, Albania and Croatia. Budapest to Stuttgart, where Hungary play two of their three group games, is roughly nine hours by car and that sort of accessibility ensures tens of thousands will travel.\nOrban is not alone in believing in this Hungary team.\nAdvertisement\nAlthough they would eventually lose 2-1 to Ireland, thanks to Troy Parrott’s stoppage-time goal, they had previously gone 14 games without defeat, their best run since Puskas’ time in the 1950s. Four days later, they responded with an emphatic 3-0 home win against Israel; this Saturday, the serious stuff starts against Switzerland in Cologne.\nA legendary Hungary team got to the 1954 World Cup final, losing 3-2 to West Germany, and there were quarter-finals in 1962 and 1966, but the 1986 World Cup, where they missed out on a place in the last 16 on goal difference, is as good as it has been since. The years that followed Mexico 1986 were miserable — not until Euro 2016 did Hungary qualify for another major tournament.\nPerceptions of today’s team are very different. Led by now-Liverpool midfielder Dominik Szoboszlai, Hungary have become an accomplished, tactically astute side and are expected to advance to the knockout stage from a group that also includes Germany and Scotland.\n“The national team right now is very popular,” says Janos Kele, a Hungarian sports journalist and left-wing political activist. “The country is united around them, but on a political level, the country is polarised on the topic of football and how money has been invested. It’s very easy to see the connection between Orban and football.”\nGO DEEPER\nEuro 2024 Group A guide: Germany's narrow No 10s, resolute Hungary and Scotland's set pieces\nHungary’s prime minister – who played the game to a semi-professional level – is a football obsessive. Political meetings are said to be scheduled around games and he is expected to attend all of Hungary’s fixtures at Euro 2024.\nThese coming weeks, he will argue, are the fruits of a controversial political strategy.\nShortly after returning to power in 2010 (after previously being in office from 1998 to 2002), Orban passed laws that enabled Hungary’s richest individuals and companies to benefit from tax breaks when investing a portion of their wealth into sport. It effectively amounted to a redistribution of the public purse, with money siphoned away from central government to fund a structural rebuild of Hungarian football.\nPolitics and football are now inseparable there.\nAdvertisement\nFerencvaros, Hungary’s most decorated club, have Gabor Kubatov, a senior figure in Fidesz, as president; it’s the same story with Andras Tallai, the secretary of state for parliamentary affairs and taxation, at Mezokovesd Zsory.\nThere are links back to Orban at every turn.\nSandor Csanyi, Hungary’s richest man and a long-standing ally of the prime minister, has been the president of the national football association since 2010, a member of UEFA’s executive committee since 2015, and a FIFA vice-president for five years, while Lorinc Meszaros, another of Hungary’s wealthiest individuals, is the leading backer of Puskas Akademia, a tiny club only founded in 2005 and based in Orban’s home village of Felscut.\nTheir stadium, the Pancho Arena, has come to stand as the emblem of Orban’s lavish spending on football.\nBacking onto his countryside bolthole, a beautifully constructed 4,000-seater ground was built in a village that is home to less than 2,000 people, 25 miles west of Budapest. It is Hungarian football’s great white elephant, built for a reported £11million yet often attracting less than 1,000 fans.\n“Orban is obsessed with power,” says journalist Kele. “And football and power have been successfully connected. It was not without risks. He allocated huge amounts of money into football, directly to finance professional clubs, not just the youth development programme.\n“A lot of opposition voters are deeply against public investment in football and they see the whole strategy as mostly a political tool. A lot of the public money has gone directly to Felscut, a little village where Orban grew up. This is not to do with logical thinking, it is about the power of politics.”\nOrban will point to Hungary’s impressive qualification for these Euros as reason to believe the investment has worked. Three of their 26-man squad for the tournament – Zsolt Nagy, Laszlo Kleinheisler and Roland Sallai – are current or former Puskas Akademia players, while the domestic top division supplies nine of the 26.\nAdvertisement\nZsolt Low, the long-standing assistant of leading club manager Thomas Tuchel, made an unprompted point of highlighting his homeland’s resurgence in the aftermath of their Chelsea side winning the 2021 Champions League final. “We have a very good government that supports football and sport,” he said.\nOpponents of Orban, though, give his lavish spending little credit in terms of Hungary’s revival. Their domestic league is ranked below those of Cyprus and Serbia in UEFA’s coefficients and there are some who see neighbouring European countries as the ones to thank for the current crop of players.\n“One of the interesting things about this Hungarian national team is that a big proportion of the squad is based on foreign-developed players,” says Kele. “Some of them came from the Hungarian grassroots, like Szoboszlai, Sallai and Peter Gulacsi, and some of them are completely the product of another country’s system, like Loic Nego (born in France), Willi Orban (Germany), Callum Styles (England), Marton Dardai (Germany).\n“Milos Kerkez is someone in between the categories, a product of Serbian football (where he was born) and then Austria (from age 11) before coming to Hungary, but a lot of the players owe their development to German and Austrian programmes. There is a very small connection, if any, between Viktor Orban’s investment in football and the recent success of the national team.”\nGermany is braced for Hungary’s arrival, especially in Stuttgart. It is there where Hungary will play their second and final games in Group A, against the host nation on Wednesday and then Scotland four days later.\nBoth have been categorised as high-risk security fixtures, with Carsten Hofler, the local police’s head of operations at Euro 2024, admitting the authorities are “concerned about the serious hooligan scene in Hungary” and promises a “robust” response in the event of trouble.\nThe reputation of Hungary’s followers inevitably precedes them.\nAdvertisement\nMarching under the banner of the Carpathian Brigade, a nationalist ultras group formed in 2009, they have earned notoriety for violence, racism and an anti-LGBTQI+ stance across the past decade. To many, these fans are Orban’s unofficial footsoldiers.\nHungary’s hooligans, famed for wearing black clothes to games, fought in the stands at Euro 2016 in France when their team played Iceland in Marseille and made further headlines when clashing with police and stewards during a match against England at Wembley in October 2021.\nThat World Cup qualifier came just a month after the reverse fixture when Raheem Sterling and Jude Bellingham were racially abused during England’s 4-0 win at the Puskas Arena. Hungary were later fined £150,000 and ordered to play two games behind closed doors.\nUEFA had already given out its own punishments in the wake of the pandemic-delayed Euro 2020 that summer. Homophobic banners were displayed by Hungary fans during their opening group game against Portugal, also at the Puskas Arena, before allegedly aiming racist abuse at France players in their second fixture, again at that Budapest venue.\nAn anti-LGBTQI+ banner was then displayed against Germany, an opponent they will face again next Wednesday, during their final group game in Munich. That came after UEFA refused a request from Munich’s mayor for the Allianz Arena to be lit in rainbow colours for the game — a symbolic protest at an anti-LGBTQI+ law in Hungary, where same-sex marriages remain banned under Orban. UEFA later handed out a three-game stadium ban and a fine of £85,000.\nTellingly, though, there is never any government condemnation of Hungary’s supporters. The opposite, in fact.\nMinister for foreign affairs and trade Peter Szijjarto called UEFA a “pitiful and cowardly body” after the punishments were given out in 2021. He said: “They should be ashamed of themselves. Just like in Communism: no need for evidence, it’s enough to have anonymous reports.”\nGO DEEPER\nHungary Euro 2024 team guide: Solid foundations and Szoboszlai magic cause for hope\nSupporters intent on trouble have become emboldened.\n“Orban has weaponised the ultras,” says Professor Chadwick. “He will have lived his formative years under Communism in Hungary. If you look at places like Yugoslavia and Serbia, where fandom was weaponised during the Bosnian War, Orban will be familiar with this game. You don’t give fans something for nothing. This hardline enforcement of Hungarian populism is part of that. It’s about Orban projecting assertiveness and power – making it clear where his loyalties lie.”\nAdvertisement\nA small pocket of fans affiliated with the Carpathian Brigade were in Dublin for that friendly last week and there were minor scuffles with stewards, but the majority were saving themselves for the tournament itself. Local authorities in Germany already have plans in place to thwart those seeking violence.\nThe Carpathian Brigade might have been initially formed with government backing to unite Hungary’s fractured fanbase, but its overt nationalism, mirroring many of Orban’s hard-line policies on immigration, depicts a substantial section of the team’s support in a sinister light. Links to Orban are unwritten but obvious.\n“These far-right, ultras groups are, in my opinion, the minority in the fanbase. But they are the loudest,” says Kele. “They show up in their black T-shirts and it’s a bit frightening. Orban has very good political connections with this far-right fanbase, who are strongly and deeply supportive of his views. And he will never condemn those fans.”\nOrban’s Hungary, too, clings to history.\nAs well as harking back to a golden footballing age, when Hungary famously schooled England 6-3 at Wembley in 1953, its supporters can also be regularly heard chanting their opposition to the Treaty of Trianon.\nThat agreement, reached in 1920, saw Hungary sign away two-thirds of its land under duress having been an ally of Germany in the First World War. Over three million Hungarians suddenly lived on the other side of their country’s borders, in nations including Romania and what was then Yugoslavia and Czechoslovakia. Fans regularly display flags depicting the pre-1920 borders and it remains a wound Orban refuses to let heal.\nAgain, Orban has used football to push agendas. Slovakian club Dac, Sepsi of Romania and Serbia’s Backa Topola have also been financially backed by the Hungarian state. All three are from towns that were once part of the Kingdom of Hungary.\nSepsi, in particular, illustrate Orban’s wish to disrupt. A club only founded in 2011 had an 8,000-capacity stadium built in 2019 with money donated by Orban’s government and, despite being in the heart of what is now Romania, have traditionally played the Hungarian national anthem at their matches.\nAdvertisement\n“Orban understands the power of football,” says Chadwick. “Look at Saudi Arabia, (or) China 10 years ago, Russia. It’s very clear there’s a 21st-century despotic template, whereby sports, particularly football, are a means to assert power but also project a particular image of a country.”\nThe European Parliament elections, held in Hungary last weekend, hinted that Orban’s powers will face a rare threat in the years to come.\nOne-time ally Peter Magyar has emerged as a genuine rival, winning just under 30 per cent of the vote with his Respect And Freedom (TISZA) party. Fidesz was still backed by 44 per cent, but it was its worst performance at the European elections in 20 years. “This is the Waterloo of Orban’s factory of power, the beginning of the end,” says Magyar.\nNo sitting head of state within the European Union has had a longer reign than Orban, who will have been in office for 16 consecutive years by the time of the next national elections in 2026.\nThat will also be the year the Puskas Arena hosts the Champions League final — the biggest club fixture in world football. Csanyi, head of the Hungarian FA and a UEFA Ex-Co member, said the prestige of the occasion would “contribute to the continued development of football in Hungary and to its popularity”.\nAnd to Orban’s popularity? Quite possibly.\n“In my opinion, Hungary is a pessimistic country, one that was big and strong before the First World War and then became a small country,” says Kele. “Doing this sends a message to the public that we are strong enough to host something like the Champions League final.”\nUEFA continues to look past the concerns much of Western Europe has regarding Orban and Fidesz. There is no wish to dwell on Hungary’s Propaganda Law, which prohibits discussions and portrayals of LGBTQI+ people in schools and in the media. Amnesty International says the ruling, introduced in 2021, has “created a cloud of fear” and “contributed to negative stereotypes and discriminatory attitudes towards LGBTQI+ people”.\nAdvertisement\nAlong with immigration and an opposition to being drawn into the Ukraine war, what it calls “gender ideology” was one of the three pillars of Fidesz’s campaigning for the EU elections and, though support was reduced, over two million voters continued to back Orban.\nAlmost one in two Hungarians remain loyal to their prime minister, who counts Italian and French far-right politicians Giorgia Meloni and Marine Le Pen as allies. Putin is another friend, with Russia’s influence growing in Hungary. Energy giant Gazprom has reportedly agreed a sponsorship deal with Budapest-based Ferencvaros, who just won the domestic title for the sixth season in a row.\n“One of the things we know about Orban is that he’s looking more towards Moscow than he is to Brussels (where the EU is based),” says Chadwick.\nPutin’s playbook is now being thumbed by Orban. Budapest failed in its bid to stage this summer’s Olympics but, as Russia did when hosting a string of prestigious sporting events before the invasion of Ukraine in 2022, Hungary is intent on raising its profile.\n“What is Hungary projecting right now?” asks Chadwick. “It’s an image of progressiveness and reform, modernisation and success – making Hungary great again.\n“Internationally, Orban does have a sharp sense of diplomacy. The word that ties it all together is ‘legitimacy’. And football gives countries a legitimacy that they otherwise might not have.”\nGO DEEPER\nThe Radar - The Athletic's 50 players to watch at Euro 2024\n(Top photo: Michael Regan – The FA/The FA via Getty Images)",
  "word_count": 3051,
  "scraped_at": "2026-02-14T02:10:54.426992",
  "_text_extracted": true
}