{
  "article_id": "b4dafef30113",
  "url": "https://metro.co.uk/2025/07/31/rasmus-hojlund-sends-clear-message-man-utd-transfer-target-benjamin-sesko-23799507/",
  "title": "Rasmus Hojlund sends clear message to Man Utd transfer target Benjamin Sesko | Football",
  "date": "20250731T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rasmus Hojlund has warned Manchester United transfer target Benjamin Sesko he has no intention of giving up his shirt and is ready to fight for his place.\nSpeaking after he scored in Manchester United’s 4-1 win over Bournemouth in Chicago, Hojlund was asked whether the potential arrival of the RB Leipzig striker would impact his commitment to the club.\n‘I think my plan is very clear and that is for me to stay and fight for my spot whatever happens,’ said the Denmark international.\n‘I am still very young. I think people sometimes forget that. I am only 22 years old. I have learned a lot, and I think that shows in my game.\n‘I have done very well so far during the pre-season.’\nHojlund impressed Ruben Amorim with a timely goal during a resounding win over the Cherries, but the United head coach did not offer the former Atalanta star any reassurance over his future.\nHojlund has struggled since his £72million move two years ago but on the day reports claimed United had made their first move for RB Leipzig’sSesko, the Denmark international responded with the opener in Chicago.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPatrick Dorgu and Amad Diallo extended their lead before 19-year-old academy graduate Ethan Williams scored his first senior goal two minutes after coming on as a 70th-minute substitute.\n‘I’m really happy with Rasmus, but I don’t know what is going to happen until the end of the market,’ Amorim told reporters at a press conference.\n‘The important thing is that Rasmus is scoring goals. He’s connecting really well with the team. He’s improving.\n‘Again, I don’t know what is going to happen until the market is closed. We suffered a lot because of the lack of goals last season.’\nMatheus Cunha did not play due to fatigue while fellow new signing Bryan Mbeumo is scheduled to make his first appearance against Everton in Atlanta on Sunday.\nExpert analysis: Benjamin Sesko\nIt was quite a tough season for Leipzig, which forced them to change coach after a disappointing Champions League campaign. They’ve been struggling, which reflects on his output, but he was still one of their best and most consistent players.\nSesko’s strengths are certainly his physicality and speed – he’s great at making dangerous runs in behind defences, but he’s also a very clinical and instinctive finisher, especially when the ball drops to him in the area. His work rate is good and he’s a willing runner off the ball as well.\nHis hold-up play is quite strong, but I think his link-up play is a side of his game that he can still improve. It’s not that he’s bad at that side of the game, but compared to someone like Kai Havertz, he’s not at that level. In particular, his passing will need to get a lot better.\nBut during his young career, he’s shown he can take those steps forward. His mentality is definitely a strength – he’s a player who wants to learn and wants to improve so in that sense he will be a quick learner.\nRune Gjerulff, German football expert and editor of Bulinews\nHarry Maguire was replaced by Matthijs de Ligt, who scored an 88th-minute own goal, at half-time as United continue to treat the centre-back with caution.\n‘He had an issue during the holidays, during training. He’s a little bit late (in his training schedule) so we have to be careful with him,’ Amorim added.\n‘It’s just a little bit fatigue with the training so we are trying to control everything and saving all the players, to give the exact minutes they need.’\nLeft-back Dorgu, who joined for £25m from Lecce in February, provided the assist for Hojlund before getting on the scoresheet himself and he was another player who caught Amorim’s eye.\n‘He looks more and more like he belongs in Manchester United, and that is hard to do it at 20 years old so I’m really impressed with Patrick,” added the United boss, who was equally happy with Williams’ goal.\nMore Trending\n‘I celebrate that goal. It’s not usual, even during the season, but I celebrate that goal because I really like to see the kids that work really well.’\nAmorim believes the work done in pre-season, something he was not able to do having arrived in November, is paying dividends.\n‘I’m really happy with the players that we had last season. They are improving. We look like a different team today. Let’s continue with that,’ he said.\n‘But again, it’s a pre-season game. The pressure is going to be so much different during the season. It’s important for them to understand that the same players can play a different game.’\nMORE: Tottenham open talks for Bayern Munich star after Arsenal transfer approach\nMORE: Chelsea offer Man Utd two players in deal to sign Alejandro Garnacho\nMORE: Unai Emery makes Ollie Watkins claim amid Man Utd transfer speculation",
  "word_count": 871,
  "scraped_at": "2026-02-14T02:26:46.355904",
  "_text_extracted": true
}