{
  "article_id": "b4e488abca9b",
  "url": "https://www.empireofthekop.com/2023/06/14/dean-jones-clarkson-liverpool-rangers/",
  "title": "Dean Jones : Liverpool gem would be  good fit  for Champions League club",
  "date": "20230614T153000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "One Liverpool midfielder has been talked up as ‘a good fit’ and ‘potential arrival’ for a club who could be playing in the Champions League group stage next season.\nFollowing an impressive loan spell at Aberdeen in 2022/23, Leighton Clarkson is a player in demand, with Rangers and Celtic – along with several English Football League clubs – reportedly interested in the 21-year-old.\nHowever, Football Insider claimed that the Pittodrie outfit are in pole position to sign him permanently, with James Pearce telling The Athletic that the youngster is expected to move on from Anfield for good this summer.\nDean Jones was speaking with GIVEMESPORT regarding the player’s potential next destination, and he can see the Liverpool gem lining up at Ibrox next season.\nThe journalist said of the midfielder: “I think he is a good fit for Michael Beale. He already knows all about his game and what he can add to his squad.\n“I think Clarkson has had an interesting time with things recently, and he has probably gotten a taste of what life could be like if he was to look for a move whereby he is going to be in a big team more regularly. I think he is one that could be a potential arrival.”\nREAD MORE: Former Liverpool midfielder’s next move confirmed as club make official announcement\nDespite Rangers being linked with the 21-year-old, it seems for now as if Aberdeen lead the queue to sign him, with Barry Robson’s side potentially having an edge given their previous dealings with the Liverpool midfielder.\nHowever, it’s a sign of how well Clarkson has been playing that he’s been talked up as a viable candidate to join a club who could be in the Champions League group stage, should the Light Blues successfully negotiate two qualifying rounds first.\nA move to Ibrox could perhaps be facilitated by Beale’s connections with the Reds as a former underage coach on Merseyside, and the 42-year-old will no doubt have been aware of the midfield gem from his advancement through the various age grades.\nAberdeen appear to be the frontrunners for now, but don’t write off the possibility of Clarkson going to the club who finished immediately above them in the Scottish Premiership table in 2022/23, especially with Liverpool being expected to cash in on him this summer.",
  "word_count": 388,
  "scraped_at": "2026-02-14T02:09:58.121993",
  "_text_extracted": true
}