{
  "article_id": "b4e6221c4621",
  "url": "https://www.independent.ie/entertainment/television/tv-news/gary-lineker-named-bbcs-highest-earner-for-the-final-time/a123719310.html",
  "title": "Gary Lineker named BBC highest earner for the final time",
  "date": "20250715T141500Z",
  "domain": "independent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Lineker named BBC’s highest earner for the final time\nFormer Match Of The Day presenter Gary Lineker has topped the list of the BBC’s highest-earning on-air talent for the eighth consecutive year and the final time.\nThe 64-year-old, who left the BBC early at the end of the last Premier League season in May, was reported to have earned between £1,350,000 and £1,354,999 in the corporation’s latest annual report for 2024/2025, for his work on Match Of The Day and coverage of European football.\nRadio presenter Zoe Ball was the second highest-paid, earning between £515,000 and £519,999, for her work on the Radio 2 Breakfast Show, which she left on December 20 last year.\nBall has since returned to a new Saturday afternoon show on the station, which she began hosting in May 2025.\nMatch Of The Day pundit Alan Shearer was the third-highest earner with a salary of between £440,000 and £444,999.\nThe former Newcastle United striker will continue to analyse football on the BBC in the new season with Match Of The Day’s incoming presenters Kelly Cates, Mark Chapman and Gabby Logan.\nHis pay also covered work on the BBC’s coverage of European football competitions, such as the Uefa Champions League.\nBBC Radio 1 Breakfast Show presenter Greg James came fourth on the list, earning between £425,000 and £429,999, for work which also included his Radio 4 show Rewinder, while Fiona Bruce and Nick Robinson were the joint fifth-highest earners, with both earning between £410,000 and £414,999.\nBruce’s pay covered her work on Question Time and other presenting work on BBC One and coverage of the UK general election, while Robinson’s included his presenting work, Political Thinking and Today podcasts, and his work covering the UK general election.\nThe publication of salaries comes after former England striker Lineker left his presenting role earlier than planned following a social media row after he shared a post about Zionism which featured a depiction of a rat, historically an antisemitic insult.\nLineker issued an unreserved apology for the incident, and will no longer front the BBC’s coverage of the 2026 World Cup or the FA Cup next season.\nThe rest of the top 10 was made up of BBC Radio 5 Live presenter Stephen Nolan, who earned between £405,000 and £409,999, TV presenter Laura Kuenssberg, who earned between £395,000 and £399,999, BBC Radio 2 presenter Vernon Kay, who earned between £390,000 and £394,999, and journalist Justin Webb, who earned between £365,000 and £369,999.\nThe annual report and salary reveal comes as the BBC has made headlines over its coverage of the Glastonbury Festival, the Gaza: How To Survive A Warzone documentary, and a report into Gregg Wallace’s behaviour on MasterChef.\nOn Monday, Wallace’s MasterChef co-host John Torode confirmed he had a standalone allegation of racist language upheld in the same report.",
  "word_count": 471,
  "scraped_at": "2026-02-14T01:49:44.677663",
  "_text_extracted": true
}