{
  "article_id": "b4f320f0c72c",
  "url": "https://www.nytimes.com/athletic/6154982/2025/02/24/real-madrid-2-girona-0-coping-without-bellingham-what-alaba-return-means-and-reactions-to-modric-wonderstrike/",
  "title": "Real Madrid 2 Girona 0 : Coping without Bellingham , what Alaba return means and reactions to Modric wonderstrike",
  "date": "20250224T080000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid reacted to Barcelona and Atletico Madrid’s wins on Saturday by comfortably beating Girona on Sunday. After a defeat and two draws in La Liga, the 2-0 win against Girona means Los Blancos are second but level on points with Hansi Flick’s team, and one ahead of Diego Simeone’s.\nThe afternoon at the Bernabeu included reference to Spain’s refereeing controversy. After the referees issued two statements in the last week pointing out the “atmosphere of hatred and generalised violence against our collective”, Madrid and Girona posed before the match behind a banner: “Respect the referee, respect the football”.\nAdvertisement\nBut local fans whistled the referees and chanted their now-regular “Corruption in the Federation” song as soon as Madrid and Girona took to the pitch. Those chants were repeated on at least four occasions during the game, several of them without any controversial play involved.\nBut there was so much more to the match: a solid Madrid without the banned Jude Bellingham; the never-ending Luka Modric leading the side (he will be 40 in September); and David Alaba putting himself firmly in contention for a starting place from now on.\nThe Athletic’s Mario Cortegana was there and analyses the key talking points…\nGO DEEPER\n'F*** off', 'f*** you' and TV language lessons: How the Bellingham red-card debate took over Spain\nBrahim steps in to cover for missing Bellingham\nBellingham’s red card last Saturday meant Carlo Ancelotti would be without one of his key players for the next two La Liga fixtures (unless the club’s second appeal is successful) and, following his yellow in the second leg against Manchester City, for the first leg of the Champions League round of 16 against Atletico.\nYesterday, Brahim Diaz came on in his place, a common solution in Bellingham’s absences in his first season in the team.\nTo accommodate the Spain-born Morocco international, Madrid changed their formation to a 4-4-2 with Brahim on the right, Rodrygo on the left and Kylian Mbappe and Vinicius Junior up front. After half-time, there was a change, with Rodrygo on the right, Brahim as a Bellingham-like playmaker, and Vinicius Jr on the left.\n“We wanted to have more of an edge on the outside,” Ancelotti explained in the press conference. And it worked because his players generated more danger than in the first half and Vinicius Jr, according to the Italian, looked “unstoppable”.\nIt was a liberating game for the Brazil forward, who had not scored in La Liga since his hat-trick against Osasuna on November 9. Perhaps that’s why he was a little nervous, too individualistic and imprecise, being dispossessed 12 times. But after 105 days and six games (he missed three through injury and three through suspension), Vinicius Jr turned home in the 83rd minute to make it 2-0.\nAdvertisement\nHe received the ball from Mbappe in midfield, played it back to the France international into space after feinting past an opponent and Mbappe set up him for the goal. Vinicius Jr then did his trademark celebration, covering his eyes with one hand and pretending to shoot a gun with the other, and Mbappe followed suit.\nVinicius Jr usually imitates Mbappe’s celebration when the Frenchman scores and this gesture was another sign that the dressing room’s health is intact. This was made clear by two other moments: in the 58th minute, when Vinicius Jr hit the crossbar in a great move, Mbappe rushed over to cheer him on; and in the 75th minute, when Vinicius Jr shot too high and Mbappe was in a good position to receive his pass. The two stood looking at each other, but the latter held back from making any disapproving gesture.\nVinicius Jr has contributed 31 goal involvements (18 goals scored and 13 assists, including penalties won) this season, averaging one every 90 minutes. Mbappe has contributed 32 (28 scored and four assists), averaging one every 100 minutes.\nWithout Bellingham, Madrid won, had 63.2 per cent possession, 17 shots (five on target and 12 off target), kept a clean sheet after six games conceding, and allowed their opponents just four shots (two on target and two off target).\nIn fact, Real Madrid have recorded six wins and a draw without the England midfielder. but his absence is still seen as a major disadvantage by everyone at the club, including the supporters.\nAlaba is back and giving Ancelotti options\nAlaba started his first match 434 days after suffering a serious knee injury in December 2023.\nThe Austria centre-back played with academy product Raul Asencio, which allowed Antonio Rudiger some rest having played 3,086 minutes this season, though he came on for four minutes at the end.\nAdvertisement\nSources from the medical staff, kept anonymous to speak freely, explained to The Athletic before Alaba’s return that Ancelotti, as well as supporting him, had pushed to have him available as soon as possible.\nThat is why, since his return against Las Palmas, Ancelotti had given him some minutes in every game except against Espanyol, after which it became known that he suffered an adductor injury in his left leg.\nAncelotti values the former Bayern Munich man’s leadership and experience highly, as well as the fact that he is the only left-sided centre-back in the squad. After recovering again, he played at the end of the 3-1 win against Manchester City, and his start against Girona will not be the only one in the short- to medium-term.\n“Can he be in the line-up for the first leg against Atletico? Obviously, yes,” Ancelotti told the media. ‘Today he was comfortable, well positioned with the ball and without the ball… We mustn’t forget that he was ready a month ago and he had the injury. He just lacks minutes. A risk for him could be to play every three days, but he can handle a game a week without a problem.”\n“I’m very happy after such a long time injured,” Alaba said on Real Madrid TV. “I was ready to be a starter.”\nAlaba did not register any tackles, but he did produce two clearances, one recovery and 44 successful passes of 48 attempted.\nIf Ancelotti were to pick him, he would form a centre-back pairing alongside Rudiger, which would allow Aurelien Tchouameni to return to midfield, who against Girona again performed at a high level in his natural position. The player to drop to the bench would be Asencio.\nIt is a blessed ‘problem’ for Ancelotti, who faced the derby against Atletico in La Liga and the first leg against Manchester City without any first-team centre-backs available.\nGO DEEPER\nInside Alaba's return: 399 days out, holidays with physios and inspirational bench role\nModric has still got it\nThe match was a reminder, as if it were necessary, of the quality Modric still possesses.\nIn the 41st minute, at 0-0, he picked up a clearance from David Lopez at the edge of the box from a corner kick, chested the ball down, let it bounce once and immediately shot into the top corner past former Southampton, Tottenham and Fulham goalkeeper Paulo Gazzaniga. (Click here to watch the goal.)\nAdvertisement\nAncelotti summed up the goal and Modric’s game best. “It’s a gift for football,” the coach said. “So, he has to continue until he wants to,” he added about the Croatia midfielder’s future.\nModric finishes his contract in June, wants to continue at the club and talks will not start until later in the season, as has been the custom in recent seasons.\nThe stadium was amazed by Modric’s finish, as were his team-mates, who wildly embraced him. Bellingham, in a VIP box, stood up, applauded and you could read “¡Qué golazo!” (“What a goal!”) on his lips.\nThere was a curious moment, too, when the goal was replayed on the huge screens around the stadium and the crowd naturally let out an “Ohhh!”.\nModric’s performance was full of style, with plenty of spectacular deliveries from all across the pitch to Mbappe. That’s why the public, when he was replaced by Rudiger near the end, gave him a standing ovation and chanted his name.\nWhen Ancelotti was asked if Modric (who has provided four goals and six assists in 1,789 minutes this campaign) would deserve to be the first Real Madrid player to feature for Los Blancos at 40 years old (his birthday is September 9), the coach’s answer was telling.\n“I had another 40-year-old player who won a Champions League: Maldini,” Ancelotti said. “The two can be compared perfectly on what a footballer has to be, they are fantastic examples. Genetics is an important part, of course, but also professionalism, attitude and so on. It’s the key to reaching 40 like Maldini and Luka Modric.”\n(Top photo: Modric scoring his wonderstrike; by Angel Martinez via Getty Images)",
  "word_count": 1461,
  "scraped_at": "2026-02-14T01:52:15.330356",
  "_text_extracted": true
}