{
  "article_id": "b50b303de1f9",
  "url": "https://www.90min.com/features/10-best-signings-2024-summer-transfer-window-so-far-ranked",
  "title": "10 best signings of the 2024 summer transfer window so far",
  "date": "20240725T041500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "10 best signings of the 2024 summer transfer window so far - ranked\n- Kylian Mbappe joined Real Madrid on a free\n- Man Utd signed Joshua Zirkzee and Leny Yoro\n- 90min ranks 10 best transfers of the summer so far\nAlthough Euro 2024 and the Copa America have dominated footballing headlines for the large bulk of the summer so far, there have still been plenty of transfers that have managed to get football fans excited too.\nFrom Manchester United finally showing some competency in the market, to Real Madrid signing the literal best footballer in the world, fans have seen quite a lot of fun transfers go through already.\nBut which have been the best so far?\nWell that's what we at 90min are here to find out.\nHere's our top 10 signings of the summer so far...ranked.\n10. Daichi Kamada to Crystal Palace\nFee: Free\nCrystal Palace proved to be the benefactors of Daichi Kamada's rather dramatic fallout with Lazio this summer, snapping the Japan international on a free after negotiations collapsed with the Serie A side.\nWhile not as eye-catching a talent as the outgoing Michael Olise, Kamada is certainly a nice addition to the Palace forward line, and a player who has previously played the best football of his career under Oliver Glasner at Eintracht Frankfurt.\n9. Archie Gray to Tottenham Hotspur\nFee: £30m\nIf you're an avid Football Manager gamer, you'll be fully aware that Archie Gray is one of the most exciting young prospects in the English game.\nHaving completed a successful first full season in professional football with boyhood club Leeds United in 2023/24, the 18-year-old earned himself a big money move to Premier League giants Tottenham Hotspur this summer.\nHis ability to play right-back and central midfield will prove to be hugely valuable to Ange Postecoglou from the get-go.\n8. Alvaro Morata to AC Milan\nFee: £10.9m\n£10.9m for a striker who captain his nation to a Euro 2024 triumph and netted 21 goals in all competitions during the 2023/24 season?\nYep, that is a bargain.\nOn top of Morata's great form for Atletico Madrid and Spain, the forward also brings a wealth of Serie A experience from former club Juventus with him to AC Milan, and the ability to seamlessly fill the void left by Olivier Giroud in the team's attacking unit.\nA shrewd acquisition to say the very least.\n7. Savio to Manchester City\nFee: £30.8m\nTechnically, Manchester City paid their sister club Troyes £30.8m for Savio.\nIn actual fact, because of the City Football Group's structure, they essentially paid themselves £30.8m for Savio.\nRegardless of the shady financial aspect of this transfer, Man City seemed to have signed one heck of a player. The 20-year-old was utterly electric on loan for Girona, another CFG club, throughout the 2023/24 season, guiding them to UEFA Champions League qualification for the first time in their history with his 19 goal contributions in La Liga.\n6. Joshua Zirkzee to Manchester United\nFee: £35m\nA striker compared to Zlatan Ibrahimovic thanks to his quality in possession, it's fair to say that Man Utd fans are rightfully excited by the signing of Joshua Zirkzee.\nZirkzee was exceptional for Bologna last season, and considering his age and profile, the £35m the Red Devils has spent to acquire his services seems like a bit of bargain.\n5. Leny Yoro to Manchester United\nFee: £52.2m\n£52.2m is quite the fee to splurge on an 18-year-old, but Leny Yoro may genuinely be that special.\nAs equally adept in possession as he is out of it, Man Utd have secured the services of a player who could lead the team's defensive unit for the next 15 years.\nWhen you take that into consideration, it probably isn't a bad price after all.\n4. Joao Palhinha to Bayern Munich\nFee: £47.1m\nFinally.\nAfter coming close to signing on deadline day last summer - literally flying to Munich for his medical before finding out a deal couldn't be finalised - Joao Palhinha is now, officially, a Bayern Munich player.\nThe Portuguese destroyer, who made more tackles than any other Premier League player over the last two years, is the perfect addition to Bayern Munich's rather hollow midfield.\n3. Douglas Luiz to Juventus\nFee: £42.4m\nGetting rid of Adrien Rabiot was a great piece of business in its own right by Juventus, but replacing him with Douglas Luiz? Well, that's some astonishingly good business.\nThe Brazilian was one of the best midfielder in the Premier League during the 2023/24 season, and will be the player around which Thiago Motta builds his new-look Juve midfield.\n2. Michael Olise to Bayern Munich\nFee: £50.8m\nBasically every big club in Europe wanted to sign Michael Olise. And considering the fact that he's just 22-years-old and bagged 16 goal contributions in just 14 starts last season with Crystal Palace, it's pretty easy to see why.\nIn Olise, Bayern have signed a player that's capable of becoming genuinely world class, and a player who can bring a big of X-factor to their attack.\n1. Kylian Mbappe to Real Madrid\nFee: Free\nOf course Kylian Mbappe's move to Real Madrid is top of this list.\nReal Madrid literally signed the best footballer in the world on a free transfer.\nSignings do not come any bigger or better than this.",
  "word_count": 890,
  "scraped_at": "2026-02-14T02:05:16.991226",
  "_text_extracted": true
}