{
  "article_id": "b50fa185714f",
  "url": "https://www.citizen.co.za/best-bets/wins-for-chiefs-chelsea-and-northampton/",
  "title": "Wins for Chiefs , Chelsea and Northampton ? ",
  "date": "20250523T074500Z",
  "domain": "citizen.co.za",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There's a lot to play for in local and foreign football leagues, while the Champions Cup also ends this weekend.\nWho’s going to triumph this weekend? There’s plenty to get excited about as several football and rugby competitions come to a close. Here are three of our top tips this Saturday and Sunday.\nFootball\nKaizer Chiefs v Polokwane City\nKaizer Chiefs face Polokwane City in their final Betway Premiership fixture of the season on Saturday.\nNasreddine Nabi’s Amakhosi have won the Nedbank Cup, but their league form has been terrible, without a victory in their last eight matches.\nThis has left Chiefs in serious danger of failing to qualify for the MTN8 for the second season in a row.\nA victory at FNB Stadium on Saturday should be enough but any other result may well leave them with an embarrassing finale to their campaign.\nPrediction: Chiefs 1 Polokwane City 0\nNottingham Forest v Chelsea\nIt is safe to say that no one could have predicted Nottingham Forest would be in contention to qualify for the Uefa Champions League, going into the final English Premier League game of the season.\nBut that is the situation as Forest welcome Chelsea to the City Ground on Sunday. Chelsea, far less surprisingly, can also make it back into Europe’s elite next season.\nA win for Enzo Marseca’s side should be enough but the Blues have won just one away game in the Premier League all year.\nForest need a win to have a chance of making it themselves, but also need help from results elsewhere.\nPrediction: Forest 1 Chelsea 2\nRugby\nNorthampton v Bordeaux\nNot too many rugby fans would have predicted a Champions Cup final this season between English side, Northampton Saints, and French outfit, Bordeaux Begles … but that’s what we have got.\nThe teams clash in the final in Cardiff on Saturday afternoon and it’s anyone’s guess who’ll come out on top.\nIn the semi-finals, Northampton pipped Leinster away (37-34), while Bordeaux beat Toulouse 35-18 at home.\nThe two South Africans to keep an eye on are Saint’s impressive No 8 Juarno Augustus and Bordeaux’s powerhouse centre Rohan Janse van Rensburg. It promises to be a fabulous occasion.\nPrediction: Northampton by 5\nSupport Local Journalism\nAdd The Citizen as a Preferred Source on Google and follow us on Google News to see more of our trusted reporting in Google News and Top Stories.",
  "word_count": 402,
  "scraped_at": "2026-02-14T02:09:11.450899",
  "_text_extracted": true
}