{
  "article_id": "b53c949a5bf6",
  "url": "https://www.teamtalk.com/leeds-united/whites-accelerate-plans-first-summer-signing-pundit-reveals-20m-everton-hijack-plot",
  "title": "Manor Solomon : Leeds United accelerate plans for glitzy summer deal as pundit reveals Everton hijack plot",
  "date": "20250221T183000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United\nPremier League • England\nLeeds United accelerate plans for glitzy first summer signing as pundit reveals £20m Everton hijack plot\nLeeds United are hopeful they can reach an agreement to sign Manor Solomon on a permanent basis from Tottenham this summer, though any move rests on two factors and amid claims that Everton are preparing to launch a counter-bid of their own.\nThe Israel forward has proved an inspired signing for the Whites after arriving on a season’s loan from Tottenham last summer – the final one of three player trades between Leeds and the Londoners, with Archie Gray moving to N17 in a £40m deal and Joe Rodon moving in the opposite direction in a permanent £10m transfer. And while it took time for Solomon to find his best form in a Leeds shirt, he is now one of the first names on Daniel Farke’s team sheet, having shunted Willy Gnonto to a regular place on the substitute’s bench.\nSuch has been Solomon‘s impact at Elland Road – the 25-year-old has 15 goal contributions in 28 appearances so far – we recently broke the news that Leeds are now planning an approach to Tottenham over making his loan in West Yorkshire a permanent summer deal, with talks soon planned with Daniel Levy to ascertain what sort of price it would take to sign the 41-times capped winger.\nHowever, any such deal would be wholly dependent on two factors: firstly, Leeds would need to secure their place back in the Premier League, while secondly, they would also need to strike a fee with Tottenham and hope that the good relations that exist between the two clubs will not see the notoriously-tough Spurs supremo set a price beyond their reach.\nAs it stands, Leeds can feel confident that they will be able to secure his signing on a permanent basis as long as their promotion objective is achieved.\nThat said, a new threat to Leeds’ chances of a permanent deal for Solomon has emerged in the form of Everton, with Sky Sports pundit Paul Robinson revealing that the Toffees would see Solomon – understood to be valued in the £15m to £20m bracket – as an ‘ideal fit’.\n“He looks a good player at that level,” Robinson began on Football Insider. “He’s played 26 times for Leeds [in the Championship], got seven goals and seven assists.\n“The question is whether he can make the step up, and I think out of that Leeds team, he is one of the players who can compete in the Premier League.\n“The expectation at Leeds now is to go up, but they need to buy Premier League players.\n“He is one of the players that would add to Leeds and make them Premier League-ready.\n“As far as Everton are concerned, we speak every week about them needing a winger.\n“Solomon can play on either flank and can play as a number ten, depending on the formation David Moyes wants to adopt, and he’s a player that would bolster their ranks.”\nREAD MORE ➡️ Leeds to hold talks over permanent Manor Solomon transfer with sacrifice of major star possible\nSolomon drops hint on his future after impressive Leeds loan\nRobinson believes whichever side wins the race to sign Solomon will be landing a player ready to play out his peak years.\n“He’s 25 now, you’re not waiting for potential, he’s ready and wants to go and play,” Robinson added.\n“Everton aren’t the only side interested. Obviously, Leeds are there as well, but they’re only in contention if they earn promotion to the Premier League.\n“Solomon, you would expect since he’s been loaned out by Tottenham, is going to be the subject of a bidding war in the summer.\n“The important thing for him is to play regular football, and I think Everton is a good fit for him, but there will be a lot of clubs looking at him.”\nSolomon himself has already revealed that his move to Elland Road has allowed him to rediscover his best form, and he admits that he did take a risk by dropping into the second tier after a difficult and injury-hit first season at Spurs.\nNonetheless, he says that he saw that move as a means to an end with the ultimate goal of establishing himself as a regular in the Premier League once again.\n“In my mind, I want to get back to the Premier League where I belong. That is my goal. I understood that the best way to get back to myself and get back to the Premier League is to go to Leeds,” Solomon said on his fiancee Dana’s podcast.\n“A club like Leeds, I think, must get into the Premier League. And that’s a very, very big goal for the team and me. It’s something that I really, really want. I really, really want to get to the Premier League.\n“It’s a big goal. So I’m trying to help as much as I can so that we can get to the Premier League. Because I really want it. Yes, you really, really want it.”\nEverton keeping tabs on Willy Gnonto; Celtic star eyed by Leeds\nSolomon is not the only winger likely to be on the move this summer, with Jack Harrison currently on loan at Goodison Park for a second season now. That arrangement is due to end once the current campaign ends, and it remains to be seen if the Toffees will look to make that move permanent.\nAs it stands, however, Harrison looks likely to return to West Yorkshire, though with Leeds themselves well blessed with wing options and with Harrison’s decision to depart on loan in successive seasons not going down well in the corridors of power at Elland Road, it would take a huge turn of events for the 28-year-old to be back among the Whites’ ranks next season.\nWith Everton therefore opening up a space on their wing, sources have revealed to us that the Merseysiders remain keen on long-term target Gnonto, having seen two offers for him fail back in summer 2023.\nNow tied to a far longer contract and having put that saga behind him, we understand that it is still not out the question that Leeds could look to cash in on the Italy winger this summer if a suitable offer comes their way.\nWere that to happen, and even if Leeds did sign Solomon on a permanent basis, the Whites would look to add another winger to their mix, with Farke keen to have four options available to him at all times.\nAs a result, sources have revealed to us that the Whites have identified Celtic’s Nicolas Kuhn as a possible target, though competition for the German – who this week scored against Bayern Munich in the Champions League – would understandably be tough.\nElsewhere, Leeds are also in the market for a new striker this summer, with Patrick Bamford seemingly on his way out.\nAnd according to Ben Jacobs, Leeds have four names on their wanted list, including a player who recently embarrassed Whites captain Ethan Ampadu.",
  "word_count": 1186,
  "scraped_at": "2026-02-14T01:52:15.332766",
  "_text_extracted": true
}