{
  "article_id": "b57679d9fbbe",
  "url": "https://www.arsenal.com/news/every-word-artetas-pre-brentford-presser-0",
  "title": "Every word from Arteta pre - Brentford presser",
  "date": "20250411T180000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We return to Premier League action on Saturday evening when Brentford head to north London, and to preview that game Mikel Arteta held a press conference at the Sobha Realty Training Centre.\nHe was asked about the mood in camp following our epic win over Real Madrid, Declan Rice adding to his game, his respect for Thomas Franks' Bees and much more.\nHere is everything he had to say:\non the feeling around the training ground over the last few days:\nGreat, it's been an unbelievable energy, it was a very special night. That's over, and now the full focus is on Brentford, because it's a game that is going to require the best of us.\non which of Rice’s free-kicks he preferred:\nIt’s difficult, I don't know. The technique is very different in both of them. The range and the angles that he's got, both of them were excellent. They helped us to win the game, which was the most important thing.\non if he knows which one was Declan’s favourite:\nNo.\non if he is first in line to take all free-kicks now:\nThat's something that we discuss a lot. The different ways that he can create moments in and around the box, whether it is to assist or whether it is to score, because he has all the qualities. He can run into the box, he can eliminate people by dribbling, he has a long-range shot, he has deliveries on set pieces. That's where we're heading with him, to become a player who can decide games with very different tools as well.\non the players picking up on the “make it happen” theme:\nAbsolutely. I said the day before, it wasn't about believing, that’s not enough. It's about conviction, feeling it and making it real. In order to do that, we had to do a lot of things right like we have done all season, especially with the circumstances that we have had, so let's continue with the same mindset.\non Bukayo Saka’s importance for the rest of the season:\nVery important. It gives us a level of threat, connection and unpredictability that probably no other player at the moment can provide, especially with the connection that he's already built in and around the team. He's got the power to lift the stadium, which is something incredible because shifting the energy in the stadium is something really difficult to do. He’s a player who is able to do that, and that's a great addition and quality to have.\non Bukyao stating he’s desperate to win something with us:\nHe’s so humble, so simple and very committed to the club. He has very deep roots connected to this football club and with a lot of people here. I'm very glad to hear that he wants to stay with us and win with us.\non how Mikel tackles the Brentford game:\nJust with normality - this is our context. We play every three days and in different competitions. The biggest stage is playing in Europe, and then we come back to the Premier League and have a completely different game, completely different opposition and context around the game. If you want to become a team that can win in any of those, you have to do it every three days, regardless of what the scenario is.\non how many days off the team got for beating Madrid:\nJust one. I think they were very happy with that. Sometimes after winning you want to spend the next day in and around the team because you want to share that feeling. But we had a day off because it was the best way to recover and prepare for the game against Brentford.\non how many times he's watched the game back:\nI watched the game once and then straight away I went onto Brentford. That's the reality.\non if it’s hard to bring the players back down to earth:\nIt's not about bringing them back. It's now maintaining that energy and that momentum and using it towards Brentford and the very difficult game that we're going to face against a team that, when you look at what they've done, it's just incredible. It's remarkable, it's a beautiful story and they have earned it in the way they work, in the way they organise, in the way they believe, in the way they play. So big credit to them, it's going to be a really tough test for us.\non how much he respects Thomas Frank:\nA lot. More than respect, probably it’s admiration. He's done it with a football club where everybody shares the vision, they have a very clear identity. It's a club, a team that we can learn a lot from because the way they did it is very, very clever, in my opinion, and then the way the model has sustained and evolved as well is really well timed. Look at the results that they had away from home in the last six matches as well, we know what it's going to require from us to beat them.\non where their main threat comes from:\nThat's the thing, they have many. They are really aggressive in the high press. If they turn the ball over in transition, they are really good, really well organised. When they go really deep, they have runners from deep as well to help you in that situation. Any restart of play can become a set-piece and they play from that and create a lot of chaos, so you have to be very well prepared.\non if Tuesday was our best ever performance during his time in charge:\nProbably in terms of the impact we had worldwide and the context and the manner that we did it, it's probably the one that the people would talk the most about. But at the end, it's another game for us and there's still a lot to do. I think it's great for us as a team as well to build this moment, those connections and history together.\non semi-automated offsides being introduced in the Premier League this weekend:\nYes, I think in the Champions League it’s worked well and it facilitates the job of all of us and makes the game more fair, it's welcome.\non if he’s tempted to rest players before the second leg:\nWe'll look now at how the players have recovered because it's not only about this game, it's about the schedule that we have in the next few weeks as well. Whoever plays will be very competitive.\non injury updates:\nWith Dec and Bukayo, they're both fit. It was just a matter of two kicks and they recovered well, so they are available for tomorrow. Ricky's progressing really well. I think to give you a timeline is difficult because he needs to step up, especially having more people around and how then he reacts after that, but he's in a good place.\non how key it is to keep Ethan and Myles:\nWe have the most energy into making sure that the players that we have with us are happy, they feel valued, they feel very much part of what we are doing, they feel important. And then the rest of the necessities, okay, we can look, especially in our academy first, and then if we cannot do that, elsewhere.\non there being four more days between Kai’s injury and the end of the season, than there was between Saka’s injury and his return:\nSo we have some extra days then. Let's see. Every injury isn't the same. The mindset of those two, though is very, very similar. They have a great injury history, great work ethic, are desperate to get back playing as quickly as possible, and great medical staff as well to look after them. So hopefully we can have him, but let's wait, I think. Once you get to the last stage of that rehab is when you can understand better how close or far away you are to making that next step.\non how Ethan has dealt with playing fewer minutes lately:\nMyles has played a lot and Ethan has played a lot. He started a few days ago against Everton away. This is the Premier League and we are talking about 17 and 18-year-olds that never played professional football playing that much football. I'm very happy because they deserve it and they will continue to play.\non if we are building our own heritage in Europe:\nI would like to use that word related to big trophies more than just qualification for the next rounds. But we have to start somewhere, we weren't even in the Champions League for seven years so we have to start to build that story. I think we are on the right track but there's a lot to do.\non if that’s on the whole club, not just players and coaches:\n100%. Nights like we had the other day are going to be remembered for many, many years, and that's the kind of night that gives you belief. It gives purpose to the competition. It brings joy, and then it prepares you for the next one because you are waiting to experience a feeling like this again. That's the most important thing, in my opinion, that people are looking forward to, to expend this kind of emotion with us.\non if there’s any encouragement from Liverpool not being over the line yet:\nIt's a really, really long Premier League season and we have all played a lot of matches and we know how competitive and the margins that most teams win every week, which is by one goal. That means that there's always a chance, but it's certainly not in our hands. We have to win our football matches, be in the position and wait to see what happens. But we want to be there for sure.\non if he’s been surprised by the evolution of Declan’s game:\nI think we brought a player that was already made, it was obvious we paid the money that we paid for that reason. But that doesn't mean that we're going to put a ceiling on him because we believe that there was a lot of parts to his game to develop, and lot of understanding about the game as well. Then it's about him really believing and taking initiative to do it because he can do it. He needs to score more headers, he needs to score more goals, more tap-ins, he needs to score more goals outside the box, and he's able to do that. So he needs to be adding those qualities because he's got them in the locker.\non if he agrees that we got him half-price:\nHaha, I don't think so!\non Madrid hoping for a comeback next week:\nWe have to be focused on what we can do, what we control, and when the time comes, prepare the game because we know what to expect. Again, we're going to have to earn it, just step up again and be even better than we were in the first game.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1887,
  "scraped_at": "2026-02-14T02:26:33.617819",
  "_text_extracted": true
}