{
  "article_id": "b5928fb3c1cc",
  "url": "https://theathletic.com/4279372/2023/03/08/bayern-munich-psg-galtier-nagelsmann-champions-league/",
  "title": "Why Bayern Munich vs PSG is a must - win game for Galtier and Nagelsmann",
  "date": "20230308T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to the laws of nature, one swallow doesn’t make a summer. Football, meanwhile, is a different jungle altogether.\nOne game can define a football season. It is one of the absurdities of modern football. For all the advances in the discourse about placing more emphasis on performance, the resonance of a single result in the 60 games top clubs play every year continues to leave the loudest echo.\nAdvertisement\nAny coach has to accept this as reality and Julian Nagelsmann and Christophe Galtier will not be exceptions on Wednesday night.\nBayern Munich have a perfect record in this season’s Champions League. They were victorious in all six group games (keeping five clean sheets) and then won 1-0 away to Paris Saint-Germain in the first leg of their last-16 clash.\nAnd it wasn’t as if the draw in UEFA’s lair was kind to them either. Bayern faced Barcelona and Inter Milan in the groups and then had to face the French champions at the start of the knockout stages. In the words of Larry David, that’s pretty, pretty good.\nGaltier, meanwhile, could have been forgiven for thinking his first season at the Parc des Princes was going well. PSG were undefeated on New Year’s Eve, taking 44 from 48 points in Ligue 1, a gimme for casual onlookers who tend to forget that in the same timeframe as Bayern have won the Bundesliga 10 times in a row, Montpellier, Monaco and Lille have been French champions at the considerable (Qatari) expense and schadenfreude of PSG.\nAll of this promises to pale into relative insignificance in Munich, where the seasons of Bayern and PSG could end two months early. The Champions League remains the pinnacle, the true benchmark, and if the elite complains about how success is reduced to it, maybe they shouldn’t have lobbied for the reforms that made the rich richer with the consequence of undermining the competitive balance of their domestic leagues.\nBayern and PSG have become so dominant in the Bundesliga and Ligue 1 that others have to rely on luck, extreme regression or dysfunction to have a chance. It was the same in Serie A before Juventus’ Ronaldo-shaped hubris caused an implosion. Look at Luciano Spalletti’s Napoli. Fifteen points clear of the pack in Italy and bound for a first league title since 1990, but if you actually compare this vintage to Maurizio Sarri’s record-breaking runner’s up in 2018, they’re incredibly a point worse off.\nCircling back to the present, ordinarily edging a tight title race would be a feather in a coach’s cap. But the fact Union Berlin have led the standings in Germany this season and Borussia Dortmund sit level with Bayern at the top reflects poorly on Nagelsmann. Winning the league would not save his season nor burnish his CV — it’s par for the course.\nAdvertisement\nAs a 35-year-old whose professional playing career never got started because of a serious knee injury, Nagelsmann is no stranger to having his credibility questioned in management. He has, up until now, always had the answers. However, at Bayern, where the expectations are so much higher than at Hoffenheim and RB Leipzig and the criteria for success limited by comparison, the responses Nagelsmann has given thus far have been less than convincing.\nGoing out to PSG would not constitute the same disgrace as elimination to Villarreal in last year’s quarter-final. Nor would it likely precipitate an imminent dismissal in the way it did for Carlo Ancelotti, who was unceremoniously sacked by the Bayern hierarchy after a chastening 3-0 defeat to PSG in the group stages in 2017. But it would weaken Nagelsmann’s position, especially after a summer dedicated to correcting the team. Robert Lewandowski may have gone but Bayern invested €145million (£129m; $154.6m) on Sadio Mane and the Ajax-ification of the squad (Matthijs de Ligt, Ryan Gravenberch, Noussair Mazraoui and Daley Blind) while also completing the surprising loan of Joao Cancelo from Manchester City over the winter.\nThe wunderkind was expected to eke more out of the team and yet Bayern have regressed by six points compared with this stage last year. Tactically, his deployment of a back three and a duo of ’10s’ off the striker may well chime with the zeitgeist in European football, but it has also at times felt distinctly un-Bayern-like, lacking the dynamic wing-play the club became accustomed to in the era of Robbery (Arjen Robben and Franck Ribery).\nNagelsmann brought Thomas Muller back into the starting team, which was a decision he made amid the perception the head coach needs to conform and ‘be more Bayern’ — not only in setup but in how he behaves, too, after calling match officials “a cowardly bunch” in the afterburn of a 3-2 defeat to Borussia Monchengladbach.\nComplicating matters for Nagelsmann is the long shadow cast by the availability of his mentor Thomas Tuchel. It is a similar story for Galtier. No sooner had he been appointed by PSG than Galtier faced the question of why you and not Zizou? The impression left was Zidane wanted the France job, which didn’t become vacant in the end because his old skipper Didier Deschamps elected to stay on after leading Les Bleus to another World Cup final.\nAdvertisement\nGiven the Euros are a little over a year away, it probably won’t be long before the post comes up again, but in the meantime, Zidane continues to loom large and Galtier has had to make peace with that. “Zizou is Zizou,” he told L’Equipe barely a month after assuming control of PSG (if, that is, a coach can ever assume control of PSG).\nThe club was always going to make a change over the summer but events at the Bernabeu this time last year were seismic nonetheless as PSG, 2-0 up on aggregate with half an hour to go, remembered who they are and completely in character conceded three times in 17 minutes. The departure of Leonardo, the general manager most associated with the Qataris ownership of PSG, was announced the same day the club celebrated a 10th Ligue 1 title. Mauricio Pochettino followed later, the writing long since on the wall, but talks were drawn out over his settlement and then they needed to buy Galtier out of his contract at Sir Jim Ratcliffe’s Nice.\nWith Leonardo’s exit reportedly a condition of Kylian Mbappe’s extension — “No, I was not told that,” Leonardo countered — Luis Campos, the club’s new recruiter, was brought in on the back of assembling the team with which Mbappe won the league at Monaco and the one Galtier led to the title at Lille. It heralded a cultural reset, the end of “bling” to borrow a phrase from PSG’s president Nasser Al-Khelaifi. And so while Bayern went about making “corrections”, PSG held a clear-out partly informed by financial fair play. Here are some of the players who have left over the past couple of windows: Angel Di Maria, Leandro Paredes, Mauro Icardi, Julian Draxler, Idrissa Gueye, Keylor Navas, Ander Herrera, Layvin Kurzawa, Thilo Kehrer, Alphonse Areola. We could go on.\nBilled as a transition year, questions remain over what PSG were transitioning towards. A more disciplined, less diva-ish team that pursues up-and-coming talent rather than established Ballon d’Or candidates? That would be impossible to achieve and undesirable in the short-term with a winter World Cup in Qatar pitting PSG’s crown jewels Lionel Messi, Mbappe and Neymar against each other. The result is a half measure and Galtier is caught in between, a coach who has earned this chance but lacks the superstar status that automatically commands authority a la Zidane. The team also feels incomplete.\nPlans to play a back three have been complicated by the inability to bring forward the signing of Inter defender Milan Skriniar. The midfield, built around the frequently injured Marco Verratti, has potential but isn’t a match for the days of Thiago Motta and Blaise Matuidi. And then there’s the empowerment of Mbappe in light of his contract extension, which culminated in those remarkable briefings before the Benfica game in October about his discontent at playing as the ‘pivot’ of PSG’s attack.\nPSG drew that match and finished runners-up in their Champions League group on away goals. Unfortunately, it meant they ended up with Bayern instead of Club Bruges in the knockouts.\nA poor start to 2023, as Galtier staggered the return of Mbappe, Neymar and Messi after the World Cup to have the trio fresh for this phase of the Champions League, got worse following the exit from the Coupe de France at the hands of rivals Marseille. It brought pressure and scrutiny, as did the embarrassing scene of Campos barking out orders at the players from the sideline during the 3-1 defeat to Monaco as if he were the coach. Neymar’s annual injury just as the Champions League knockouts are starting has tragically recurred.\nAdvertisement\nThings, more generally, have stabilised though. PSG are sweating on Marquinhos’ fitness but confidence comes from Mbappe, who became the club’s all-time top scorer at the weekend and, unlike in the first leg, will be fit to start alongside Messi.\nNagelsmann has experienced an uptick in form at the right time, too. But, as with Galtier, who should be safe until the summer at least, whatever security he feels could all dramatically change on one Champions League night.\n(Top photo: Getty Images; design: Sam Richardson)",
  "word_count": 1567,
  "scraped_at": "2026-02-14T01:59:46.892155",
  "_text_extracted": true
}