{
  "article_id": "b59fc72e6607",
  "url": "https://www.90min.com/arsenal-vs-rangers-jonas-eidevall-leah-williamson-preview-uefa-womens-champions-league",
  "title": "Arsenal vs Rangers : Jonas Eidevall and Leah Williamson preview UEFA Women Champions League clash",
  "date": "20240903T191500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal vs Rangers: Jonas Eidevall and Leah Williamson preview UEFA Women's Champions League clash\n- Arsenal take on Rangers in their first knock-out tie for the UEFA Champions League\n- Beth Mead and Steph Catley ruled out due to injury\n- Eidevall: 'You can never cover everything in preseason, but I feel very confident about our foundations'\nArsenal will be looking to redeem themselves this year by securing a spot in the UEFA Women's Champions League, as they get ready to take on Rangers in their first knockout qualifier.\nThe two clubs will come head-to-head at Borehamwood on 4 September, marking the start of the tournament. This represents the first of two rounds before the 16-team group stage which starts in October.\nThe Gunners were left heartbroken last year after suffering a loss to Paris FC on penalties in their second qualifying tie. This time around though, they will be hoping for a different story and a win against Rangers will see them one step closer to qualification and playing either Atletico Madrid or Rosenborg on 7 September.\nAhead of their opening game, head coach Jonas Eidevall confirmed to press that Beth Mead and Steph Catley would be missing from tomorrow's squad due to injury, but that fans can expect to see new goalkeeper Daphne van Domselaar make an appearance.\n90min attended a press conference Eidevall and captain Leah Williamson, and here's what they had to say...\nPreseason positives\nArsenal spent part of their pre-season across the pond in the US, beating NWSL side Washington Spirit and losing to WSL rivals Chelsea.\nWhen asked about the learnings from the pre-season jaunt across the pond, Eidevall explained: \"The preseason was positive and it was great to see some of the young players coming to training and playing match minutes.\n\"One thing you can't underestimate is the time that players spend together on and off the pitch - building relationships. I feel promise. I'm really looking forward to seeing us play.\n\"There are always lessons to be learned. You can never cover everything in preseason, but I feel very confident about our foundations going into this season.\"\nThe value of new recruits\nArsenal may have only made two new signings this summer, but the addition of Rosa Kafaji and Mariona Caldentey is already having a huge influence on the team.\nEidevall commented on the importance of bringing in a player like Caldentey, whose got so much Champions League experience already under her belt.\n\"This was obviously important,\" he said. \"And that's because European football is different. It's knock-out football and you are coming up against opponents who do different things than what you are used to.\n\"And of course, Mariona has so many good experiences and can help us in what we are building. We can really learn from her as a team.\"\nCaptain Leah Williamson also explained how they've been settling in with the rest of the team.\n\"It's trying to get across how we do things, whilst also giving them enough room and space to showcase themselves as they've been brought in as an addition to our team,\" she said.\n\"It's exciting to go out to training as there's things we didn't have that we do now.\"\nLearning from mistakes\nReflecting on Arsenal's shock exit from the tournament's qualifying knockout stage last year, Williamson said: \"We lived to regret that for the rest of the year.\n\"Everyone knows what it feels like to lose, but one of our strengths is the intensity that we play at and I think when pressure comes, tension can be taken from that.\n\"We've underperformed so to speak. There's been a number of teams at the top of the game and we've tried to take trophies off of each other and it doesn't always go your way. I think we are getting closer and I'm enjoying the way we are playing.\"\nEidevall went on to stress the importance of not underestimating the capability of Rangers.\n\"Rangers were very close to knocking Benfica out of the qualifiers last year,\" he said. \"I think their run in the Champions League deserves a lot of respect and we know they are capable of putting on good performances.\n\"I think there's a lot that can be achieved in the first month. We should enjoy having those experiences together and enjoy being put under pressure, as that's what shows the true character of who we are as a team.\"\nHome advantage\nArsenal are hosting all their group's fixtures at Borehamwood, which also includes clubs Atletico Madrid versus Rosenberg.\n90min asked Williamson how much of a difference playing on home turf is likely to have. She explained: \"We've had some unbelievable Champions League nights at Borehamwood. It's incredible the way that Arsenal fans show up and I'm excited to be back with them.\n\"I think as soon as you walk out, even for the warm-up and hear them, it gives you a sense of knowing what is at stake and being at home brings with it a huge benefit.\"",
  "word_count": 838,
  "scraped_at": "2026-02-14T02:01:51.742165",
  "_text_extracted": true
}