{
  "article_id": "b5ae5bf90b4a",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-12239273/Dragons-Den-viewers-react-Gary-Neville-BBCs-new-signing.html",
  "title": "Dragon Den viewers react to Gary Neville as BBC new show signing",
  "date": "20230627T163000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'It's a no from me, I'm out': Dragon's Den viewers aren't convinced about the BBC's new signing as ex-England footballer Gary Neville is announced as guest entrepreneur after building a business empire off the pitch\n- Gary Neville was today named as the newest tycoon on Dragons' Den by BBC\n- The ex-Manchester United captain has built a business empire since retiring\nDragons' Den viewers have hit out after discovering that former Manchester United icon Gary Neville will be the latest person to join hit BBC show.\nEx-England player Gary - who has built up his own 'business empire' since retiring from football - was announced as the new guest judge earlier today, alongside businesswoman Emma Grede.\nCurrently filming the latest series in Manchester, it's not known how many episodes the former 'Red Devils' captain will appear in alongside regular tycoons Peter Jones, Deborah Meaden, Touker Suleyman, Sara Davies and Steven Bartlett.\nBut despite having ventures in everything from hospitality and property to digital marketing, which have netted millions of pounds, lovers of Dragons' Den appear to be less than convinced by the credentials of the 48-year-old football pundit.\nOne person on Twitter wrote: 'Gary Neville going on Dragons' Den? It's a no from me, I'm out,' as they mimicked the phrase used by the Dragons to reject bids from Den hopefuls. While another seemed baffled by the choice, simply saying: 'Gary Neville on Dragons' Den!?!?!?!?!?!?!'\nGary Neville (above) has landed a new TV job with the BBC - and it's nothing to do with football\nFans of Dragons' Den took to social media to react to news that Gary Neville would be appearing as a guest judge on the BBC show\nSince retiring from football in 2011, Gary has built a vast property development portfolio that nets him tens of millions a year.\nAmong his major enterprises is Hotel Football, a luxury hotel overlooking Old Trafford, and The Stock Exchange Hotel near Piccadilly Gardens, one of the top hotels in Manchester, alongside former team-mate Ryan Giggs.\nBut it's not been smooth sailing for his hospitality businesses, which has been hit by a number of controversies.\nIn 2020 it was reported the Hotel Football suffered a loss of more than £3million over the space of two years.\nPart of the Old Trafford Supports Club, set up in 2012, the site struggled during the Covid pandemic.\nAccording to reports in the Daily Star, Hotel Football lost £1.1m in 2021 and £2.1m the year before.\nA report by parent company Orchid Leisure had loaned the business £10.2million to keep the hotel afloat.\nIn quotes attached to the figures, Neville said trading had been 'hit drastically' by the pandemic, and that Covid restrictions had 'affected the financial figures.'\nHe added 'challenges around inflation and the labour market continue up to this day,' but 'the directors have continued their policy of investing in the hotel to improve operational performance and to promote the Hotel Football brand even post the pandemic year.\n'The directors feel that whatever the case the quality of the brand and of the property they manage cannot be sacrificed.'\nGary's enterprises include Hotel Football, a luxury hotel overlooking Old Trafford, and The Stock Exchange Hotel near Piccadilly Gardens, one of the top hotels in Manchester, alongside former team-mate Ryan Giggs. Pictured: Hotel Football\nHotel Football has reportedly lost £3.2 million across the past two years\nGary Neville runs the company with his former Manchester United teammate Ryan Giggs\nAnd In December, Gary was branded a 'hypocrite' after it emerged his other luxury Stock Exchange Hotel had been advertising for staff on minimum wage.\nIt came after the former England player sparked fury by using ITV’s World Cup final broadcast from Qatar to rant about Tory ministers paying nurses only ‘a pittance’.\nHe even compared the Government’s treatment of NHS staff to the Qatari regime’s approach to migrant workers, some of whom died building stadiums for the tournament.\nBut soon after the comments, it emerged that Neville’s five-star hotel, which he co owns with former teammate Ryan Giggs, had been advertising for waiters and waitresses on a salary of £9.50 an hour.\nThis is the minimum wage for anyone aged 23 or older. They would work at the hotel’s Bull & Bear restaurant, where bottles of wine cost up to £5,900 and steaks are priced at £49.50. Meanwhile, suites can cost up to £850 a night.\nNews of the pay sparked a furious outburst from Conservative MP Lee Anderson, who said: ‘It would appear staff within his hotel are working for a lot less than the public sector workers he claims are struggling to make ends meet.\n'This multi-millionaire needs to shut up as he is quickly becoming a national embarrassment alongside being a hypocrite.'\nStaff perks include discounted food but the ideal candidate will be well-presented and confident with experience in a 5- star restaurant or a high-quality restaurant setting\nSky Sports pundit Neville, 48, will join the new series of Dragons' Den as a guest Dragon\nAs well as owning hotel, Gary also founded his firm 'Relentless', an investment company specialising in ventures in and around the Manchester area, while he also runs 'Zerum', a property and construction consultancy business.\nHe became interested in property development in his 20s. And 'Relentless Development', the property wing of his firm, is now involved in the lucrative £120million St Michael's project, a redevelopment plan that aims to build hotels, offices, apartments and a top restaurant in Manchester city centre.\n'\"Relentless\" is my favourite word and sums up my approach to life, business, everything really,' boasts Gary on the swanky business page for his company.\nHowever, it's not just property investment which has proved a money-spinner for Gary - he also joint-owns League Two side Salford City alongside former United team-mates David Beckham, Ryan Giggs, Paul Scholes, Nicky Butt and brother Phil.\nIn 2017 the Sky Sports pundit co-founded Buzz 16, a production firm behind successful programmes such as The Overlap, Soccerbox and Class of '92 Full Time.\nAnd in February he sold his controlling stake as part of deal reported to be worth around £200million.\nGary also used to be a senior investor in E3 Creative, a digital creative agency specialising in online marketing and corporate strategy, but left the venture in 2019.\nBut as well as building a business empire, Gary has also used his influence and wealth to support disadvantaged youngsters.\nAlongside his former United pals Scholes, Giggs, brother Phil and Nicky Butt, Gary is one of the founding members of University UA92.\nThe organisation aims to help disadvantaged young people and boasts that it is 'disrupting the traditional model' of supporting the needy.\nHowever, Gary faced criticism when he sought to transform field in Turn Moss, Trafford, into training pitches for the UA92 and his Salford City FC team.\nDuring a heated planned meeting in 2018, when the proposals were revealed, Gary was heckled by audience members furious at the potential development of green belt land. He even claimed they called him a 'liar' during the clash.\nGary faced criticism when he sought to transform field in Turn Moss, Trafford, into training pitches for the UA92 and his Salford City FC team.\nGary, who has become a regular pundit with Sky Sports, has built a 'business empire' since retiring from football in 2011. But it hasn't been without its bumps\nTrafford council, which had been involved in funding the project, claimed the development would bring flooded land back into use and provide facilities for the local community.\nBut opponents from the group Friends of Turn Moss group blasted this and said instead it would hand over public space to the private sector, while harming wildlife and disturbing residents of nearby retirement apartments.\nGary was quizzed about his plans at the packed meeting, held at the Old Trafford stadium, with some protesters questioning why he wasn't building the facilities in nearby Salford.\nHe said it was 'ridiculous' to suggest Salford City, which he co-owns, and told the meeting: 'I played at the Manchester United stadium in Trafford and I resent being told people are not welcome in boroughs they are not from.\n'The idea people from Salford aren't welcome to use pitches in Trafford I find ridiculous.'\nIn a tweet, which was later deleted, he claimed opponents had called him a 'liar' and told him to go back to Salford, but this was disputed, reports the Manchester Evening News.\nWriting on the Friends of Turn Moss Facebook page, Helen Colley, a spokesman for the group, said: 'I didn't hear anyone call Gary Neville a liar.\n'Also no one told him to go back to Salford. He was asked why he wouldn't invest in Salford where the team is based.'\nAnd the savvy businessman's online ventures have also hit the back of the net, with his YouTube series Overlap raking in £180,000 in profit last year.\nThe Overlap has developed to boast an on-the-road live series featuring the likes of Roy Keane (left) and Jamie Carragher (middle)\nGary began the behind-the-scenes production on YouTube two years ago and has evidently enjoyed huge success as the company produced their latest financial statements.\nThe channel started with Neville starring alongside other professional athletes as he conducted in-depth and unique interviews with the likes of David Beckham, Tyson Fury, and Harry Kane.\nIt has since developed into one of the most-followed sports productions in England and has further evolved to feature an on-the-road live show where Neville, Jamie Carragher and Roy Keane debate hot football topics.\nThe latest financial accounts show that its popularity has led to an increase in cash in the bank with The Overlap Ltd holding by funds of over £1million, a significant rise from the £576,169 the previous year.\nNet current assets have also nearly doubled to £146,571 as the show's popularity continued its rise during the recently-concluded Premier League season.\nA surge in revenue and profits means corporation tax has also increased from £19,025 in 2021 up to £34,357 for the 12 months of 2022, marking a rise of over 80 per cent.\nNews that Gary would join Dragon's Den was announced by the BBC on Tuesday.\nHe will enter new addition businesswoman Emma Grede, will join the 21st series of the Dragons' Den programme, with filming currently taking place in Neville's native Manchester.\nThe pair will appear as guest Dragons alongside regular moguls Peter Jones, Deborah Meaden, Touker Suleyman, Sara Davies and Steven Bartlett. The show is currently filming and it's not known how many episodes Gary and Emma will be in.\nSpeaking of joining the show, Gary said: 'I am excited to join the Dragons, and to meet the entrepreneurs brave enough to face us in the Den.\n'I hope my personal journey shows that you can take the experiences you've had in one part of your career and use them to do something entirely different and make it a success.\nHe joins the programme on a temporary basis alongside businesswoman Emma Grede (above)\nThe pair will follow in the footsteps of Dragons like Steven Bartlett, Peter Jones, Deborah Meaden, Touker Suleyman, Sara Davies (left-right)\n'Business is all about managing people and managing yourself and I'm looking forward to sharing my experience to help the entrepreneurs we'll meet in the Den reach their potential.'\nDragons' Den say Neville has a 'business empire' spanning property, education, hospitality, media and sport, including The Stock Exchange Hotel, University Academy 92 and the St Michael's property development, all in Manchester.\nHe and Grede will sit on the panel alongside regular Dragons Peter Jones, Steven Barlett, Deborah Meaden, Touker Suleyman and Sara Davies.\nExecutive producer Samantha Davies added: 'For the first time in the show's 21 series there will be a sixth chair in the Den as we welcome our first guest Dragons.\n'And what better additions to our established line-up than business juggernauts Emma Grede and Gary Neville.\n'Gary is a great example of someone who took an alternative route into commerce and used his unique skillset to grow a successful portfolio of companies.\n'They're an exciting addition to the Den for both the programme and the entrepreneurs.'\nGary played more than 600 times for Manchester United in a stellar playing career and won eight Premier League titles, three FA Cups, three League Cups and two Champions League crowns.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl\n- Moment driver veers to target e-bike riders before killing teen\n- Chilling police interview of ISIS fanatic plotting UK attack",
  "word_count": 2185,
  "scraped_at": "2026-02-14T02:12:52.292712",
  "_text_extracted": true
}