{
  "article_id": "b5d5133f50b0",
  "url": "https://tribune.com.pk/story/2457057/andreas-brehme-1990-world-cup-winning-goal-scorer-dies",
  "title": "Andreas Brehme , 1990 World Cup winning goal scorer , dies",
  "date": "20240220T151500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Andreas Brehme, 1990 World Cup winning goal scorer, dies\nGerman left-back won 86 caps and played for clubs such as Bayern and Inter\nAndreas Brehme, whose 85th-minute penalty sealed victory for West Germany over Argentina in the 1990 World Cup final, died overnight into Tuesday at the age of 63, his former club Bayern Munich said.\n\"FC Bayern is deeply shocked by the sudden death of Andreas Brehme,\" the club said in a statement.\n\"We will always keep Andreas Brehme in our hearts. As a world champion and as a very special person.\"\nA versatile left-back, Brehme spent two seasons with Bayern Munich between 1986-1988, winning the Bundesliga in 1987.\nAs well as his World Cup heroics at the Olympic Stadium in Rome, Brehme left a mark at club level, playing for Kaiserslautern and Inter Milan, as well as Bayern, Saarbruecken and Real Zaragoza.\nBrehme spent 10 years at Kaiserslautern, sensationally leading the team as captain to the league title in 1998 as a newly promoted side.\nOver two stints at the club as a player, Brehme also lifted the German Cup and went on to coach the \"Red Devils\" for two seasons in the early 2000s.\nIn Italy, Brehme will be remembered for the partnership he formed with compatriots Juergen Klinsmann and Lother Matthaeus at Inter Milan.\n\"A magnificent player, a true Interista,\" the Nerazzurri said in a post on X, formerly Twitter.\n\"Ciao Andi, forever a legend,\" said Inter, for whom Brehme made over 150 appearances and won the Serie A title.\nInter said their players would wear black armbands in honour of Brehme during their Champions League clash against Atletico Madrid later on Tuesday at the San Siro.\nBrehme's World Cup-winning teammates reacted with shock at the passing of the national team hero.\n\"Andi was always positive and radiated pure life. He was a great person, a great friend,\" defender Guido Buchwald told SID, AFP's sports news subsidiary.\nBrehme's passing comes shortly after the death of another German footballing legend, Franz Beckenbauer.\nBeckenbauer, who died in January, was the manager when West Germany won their third World Cup title.\n\"Unfortunately, the sad news doesn't stop,\" midfielder Pierre Littbarski told SID.\n\"This is very, very sad for German football and especially for us, the 1990 world champions.\"\nRudi Voeller, another of Brehme's national team colleagues, said the death left him \"infinitely sad\".\n\"Andi was our World Cup hero, but for me even more -- he was my close friend and companion,\" Voeller said in a statement published by the German Football Association (DFB).\nBrehme played 86 times for his country, although nothing would top his exploits against Diego Maradona's Argentina in Rome.\nBrehme scored the only goal in the 1990 final, stepping up to take the penalty instead of team captain Matthaeus, who did not want to take on the responsibility after changing his boots at half-time.\n\"No matter where I am, at the airport, out shopping, I am always asked about it,\" Brehme had told SID.\n\"I didn't think about the significance of this penalty. I didn't think anything,\" said Brehme, who coolly slotted the ball into the corner to the goalkeeper's right.\n\"Andreas Brehme is one of the greatest and best football players in German history,\" DFB president Bernd Neuendorf said in a statement.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 572,
  "scraped_at": "2026-02-14T01:51:19.056986",
  "_text_extracted": true
}