{
  "article_id": "b5d945315b65",
  "url": "https://cartilagefreecaptain.sbnation.com/2023/3/8/23628350/the-hoddle-of-coffee-tottenham-hotspur-news-and-links-for-wednesday-march-8",
  "title": "The Hoddle of Coffee : Tottenham Hotspur news and links for Wednesday , March 8",
  "date": "20230308T094500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Today is the second round of Tottenham’s Champions League knockout tie against AC Milan, and we here over at Fitzie Incorporated are eager to see the boys in lillywhite maybe win or lose (but definitely possibly both at the same time) today.\nThe Hoddle of Coffee: Tottenham Hotspur news and links for Wednesday, March 8\nWhat on earth is Scott Parker wearing?\nAnother Tottenham boy was in action on Tuesday. That’s right, this is a Scott Parker hoddle.\nWho could forget the plaudits he accumulated over the years as one of the best dressed in the Premier League, as he drove Fulham into the relegation zone?\nBut even then he was prone to the odd outfit.\nTake, for example, the one he wore on Tuesday, where his side Club Brugge lost 7-1 on aggregte to Benefica.\nWe’ve got the classic two-piece suit here from Parker, and it looks great on him. That isn’t the problem I have.\nThe problem I have is that hideous beige gilet he is wearing over it. It couldn’t have been that cold in Portugal on a Tuesday night. Does he still think he’s managing Bournemouth last season? There are no trips to Stoke in the Champions League.\nWhy can’t he just wear an overcoat? It seems to me such a wasted effort to go through such trouble to put together a fine outfit only to muck it up with such a garish vest.\nIt doesn’t work.\nClub Brugge have taken notice, too. Not of his wardrobe, but of his record. Parker joined the club on December 31 and his situation at the club is already perilous.\nAfter the game, he sounded like a manager who is resigned to his fate, telling reporters “you’re probably asking the wrong person” if he expects to be in charge by Sunday, adding he’s trying to turn the corner on Brugge’s season.\nIt was an odd appointment from the beginning, and I can’t find any reason why Brugge would have wanted him in the first place. Had he not been sacked at Bournemouth, he very well could have two relegations on his CV (with two promotions, of course).\nRegardless of results, his teams never have played exciting football. And the one time he had an opportunity to use a dynamic player for his team’s survival, he left him on the bench. Hence his sacking at Fulham.\nIt’s hard to turn things around when your managerial tenure is off to such a turbulent start in a league where you have little credibility.\nLike the gilet, Scott Parker’s appointment at Club Brugge was a bad fit.\nFitzie’s track of the day: Look On Down From The Bridge, by Mazzy Star\nAnd now for your links:\nThe Athletic ($$): Antonio Conte says he wanted to return to Spurs sooner\nDavid Hytner: Conte at Tottenham feels like a relationship slowly fizzling out\nAlasdair Gold spots five things he saw in Tottenham’s training session\nScott Parker unsure of future after Champions League exit\nOne from the weekend: Homegrown talent Ted Ku-DiPietro brings ‘hunger’ to DC United",
  "word_count": 511,
  "scraped_at": "2026-02-14T02:16:40.087138",
  "_text_extracted": true
}