{
  "article_id": "b5e9a8ffafae",
  "url": "https://www.90min.com/carlo-ancelotti-reveals-toni-kroos-courage-announce-retirement",
  "title": "Carlo Ancelotti reveals how Toni Kroos showed  courage  to announce retirement",
  "date": "20240525T114500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Carlo Ancelotti reveals how Toni Kroos showed 'courage' to announce retirement\n- Toni Kroos has announced his retirement ahead of Real Madrid's last two games of the season\n- German midfielder has been pivotal in La Liga title win and run to Champions League final\n- Carlo Ancelotti reveals Kroos was adamant about decision\nReal Madrid manager Carlo Ancelotti has admitted he tried to convince Toni Kroos not to retire at the end of the season.\nThe legendary German midfielder will hang up his boots after Euro 2024 in his homeland, bringing an end to a truly glistening career at the top level of European football.\nKroos has remained a pivotal player for Ancelotti at the Bernabeu in 2023/24 as Los Blancos reclaimed the La Liga title and reached the Champions League final, where they will face Borussia Dortmund next week.\nFirst, however, the former Bayern Munich star will play his final game at the club's iconic stadium on Saturday night against Real Betis and Ancelotti revealed in his pre-match press conference he had tried to talk him out of retirement.\nHe said: \"We have worked well this week and we want to finish well. It has been a fantastic campaign, we have done very well from the beginning. Tomorrow [Saturday] we say goodbye to a legend of our club and we want to enjoy it. It is an important day. We are very happy for how we have managed this league that has been deserved and with many points. For me it has been the easiest to manage as an environment and squad. The players have done very well.\n\"As we have said many times, legends have to choose their destiny. We have to respect Toni's decision and we have to say goodbye to him as best we can. I respect his decision a lot because he is a man with balls. Replacing him is very complicated but impossible but this team has resources as it has shown in the last ten years, winning many. Every year it loses pieces but what it does not have to lose is that attitude and commitment. I hope I don't forget all those who have left and who have created a clean environment. all this time.\n\"We have talked about this, he [Kroos] was convinced, he wants to say goodbye at the highest level. Saying goodbye like this would be ideal, everyone wants to say goodbye at the highest level but then you have to have the courage to do it.\n\"On a technical level it is very difficult to find him but it is not what we are thinking. He sees it the same, he is calm and focused on what he has to do. He is a German and he is very difficult to change his mind. There were no tears in the talk, he is very convinced.\"\nWhile Kroos' departure will be heartfelt at Madrid, the Spanish champions have an exceptional batch of midfielders on the books to mitigate his exit.\nJude Bellingham and Federico Valverde are two of the world's best at 20 and 25 years of age respectively, while big things are also expected of Aurelien Tchouameni and Eduardo Camavinga. Club stalwart Luka Modric will likely also hang around for another season.",
  "word_count": 545,
  "scraped_at": "2026-02-14T02:25:33.973023",
  "_text_extracted": true
}