{
  "article_id": "b5ff6483860a",
  "url": "https://www.caughtoffside.com/2024/04/24/unai-emery-pushing-for-aston-villa-to-sign-athletic-bilbao-star/",
  "title": "Unai Emery pushing for Aston Villa to sign Athletic Bilbao star",
  "date": "20240424T220000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa manager Unai Emery would reportedly be behind the club signing Athletic Bilbao’s Nico Williams.\nVilla are enjoying an exceptional campaign under the Spaniard, and sit fourth in the Premier League, whilst also advancing to the semi finals of the Uefa Conference League.\nIf Emery can guide Villa to Champions League qualification it means the club will be able to attract a higher calibre of player to Villa Park.\nNico Williams to Aston Villa?\nWilliams has been one of Bilbao’s top performers in La Liga this season and it’s believed he would consider a move to the Premier League.\nThe 21-year-old has a release clause of around £43m in his contract which is unlikely to deter any potential suitors this summer.\nAt worst Villa will have Europa League football next season and will need to bolster their squad accordingly.\nGIVEMESPORT have reported The Villans have held a long term interest in the winger, and feel they are in a strong position to make him an offer.\nIt’s believed Bilbao want to keep hold of one of their top assets beyond this summer, and Williams has a contract until 2027 with the La Liga side.\nThe report adds that any move away could be complicated by the fact he plays with his brother Inaki at the club.\nEmery extended his deal with Villa until 2027 on Tuesday, and GIVEMESPORT add the club are serious about signing Williams with Emery full behind the deal.\nWilliams is already a Spanish international and has enjoyed an exceptional 2023/24 season, registering 20 goal contributions in 32 appearances in all competitions.\nThe attacker has become one of Athletic’s key players in the final third of the pitch and helped the club win this season’s Copa Del Rey, their first trophy in 40 years.\nThe Bilbao man is reported to have also attracted interest from Chelsea and Tottenham, and the race for his signature is expected to be competitive.",
  "word_count": 323,
  "scraped_at": "2026-02-14T01:51:24.792148",
  "_text_extracted": true
}