{
  "article_id": "b60283bc7d35",
  "url": "https://news.yahoo.com/bayern-munich-vs-psg-live-175921602.html",
  "title": "Bayern Munich vs PSG LIVE : Champions League team news , line - ups and more from last - 16 fixture",
  "date": "20230308T184500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Munich vs PSG LIVE score: Champions League result and reaction as Messi and Mbappe crash out\nBayern Munich will look to complete their progress through to the Champions League quarter-finals when they host Paris Saint-Germain in the last-16 second leg tonight.\nThe Bundesliga champions won the first leg at the Parc des Princes 1-0 after Kingsley Coman’s guided volley beat PSG goalkeeper Gianluigi Donnarumma. However, Bayern were dealt a blow right at the end of the game as defender Benjamin Pavard collected a second yellow card and was sent off.\nThe first leg was a close affair though Bayern were superior in shots and possession something that PSG boss, Christophe Galtier, will try to change this evening. The French side have won all three of their Ligue 1 matches since the defeat to Bayern and have notched up 11 goals in that time with Kylian Mbappe scoring five himself.\nPSG defender Achraf Hakimi is also expected to play despite an ongoing criminal investigation against him after the 24-year-old was accused of rape. Galtier declined to address the ongoing investigation but did confirm that Hakimi could return after recovering from injury saying: \"The aim with our medical staff is for him to be available for the match against Bayern.\"\nFollow all the action from the Champions League last-16 as Bayern Munich host PSG:\nBayern Munich vs PSG\nBayern Munich host PSG in the second leg of their Champions League last-16 tie\nPSG trail 1-0 after losing first leg in Paris and will be without Neymar due to injury\n89’ GOAL! - Gnabry comes off the bench to close out the tie (BAY 2-0 PSG)\n61’ GOAL! - Choupo-Moting taps in to open the scoring (BAY 1-0 PSG)\n53’ DISALLOWED - Choupo-Moting has a goal ruled out after Muller is judged offside (BAY 0-0 PSG)\n38’ OFF THE LINE! - De Ligt hooks one off the line to stop Vitinha scoring (BAY 0-0 PSG)\n33’ SAVE! - A low stop from Donnarumma denies Musiala (BAY 0-0 PSG)\n25’ CLOSE! - Messi gets free in the box but can’t beat Sommer (BAY 0-0 PSG)\nFC Bayern München 2 - 0 Paris Saint-Germain FC\nBayern 2-0 PSG (3-0 agg)\n21:49 , Michael Jones\n90 mins: Five minutes of stoppage time to play.\nGOAL! Bayern 2-0 PSG (3-0 agg) - Gnabry, 89’⚽️\n21:48 , Michael Jones\n89 mins: Joshua Kimmich recovers the ball for Bayern Munich and gets it to substitute Joao Cancelo. Cancelo threads a lovely pass up to fellow sub Serge Gnabry who carries the ball into the box then chips it over the goalkeeper to win the game and the tie.\nBayern 1-0 PSG (2-0 agg)\n21:47 , Michael Jones\n87 mins: Alphonso Davies tracks Kylian Mbappe as PSG work the ball down the left wing. It gets pulled back into the penalty area and looks to be setting Mbappe up for a shot only for Davies to lunge across him and poke the ball clear.\nGreat defending.\nBayern 1-0 PSG (2-0 agg)\n21:42 , Michael Jones\n84 mins: PSG’s final changes see Hugo Ekitike and Juan Bernat come on for Vitinha and Nuno Mendes. PSG have had the majority of possession in this game but haven’t been able to come alive inside Bayern’s final third.\nSix minutes plus stoppage time to play.\nBayern 1-0 PSG (2-0 agg)\n21:40 , Michael Jones\n81 mins: Sadio Mane comes on for Bayern Munich to replace Jamal Musiala. He returns to action tonight after a spell on the sidelines.\nKylian Mbappe wins a corner for the visitors that is whipped in once more by Leo Messi. Sergio Ramos gets his head to the ball once again but can’t beat the goalkeeper.\nBayern 1-0 PSG (2-0 agg)\n21:39 , Michael Jones\n78 mins: Time is running away from PSG here. If anything Bayern have become more convincing since they doubled their lead in this tie and PSG have begun to fade.\nEspecially in belief. PSG already look beaten.\nBayern 1-0 PSG (2-0 agg)\n21:33 , Michael Jones\n75 mins: Nearly! Leroy Sane is fed the ball and brings it into the penalty area. He’s got options to his right but decides to go it alone and scuffs an effort wide of the nearest post.\nBayern 1-0 PSG (2-0 agg)\n21:32 , Michael Jones\n72 mins: Christophe Galtier looks a little bewildered. He’ll have had his plans to take Bayern Munich but nothing is going PSG’s way tonight.\nBayern have been defensively brilliant - excepting the mistake from Yann Sommer.\nBayern 1-0 PSG (2-0 agg)\n21:26 , Michael Jones\n69 mins: Julian Nagelsmann makes a change for Bayern Munich and brings on Leroy Sane to replace the goalscorer Eric Choupo-Moting.\nThat’s not exactly a downgrade is it?\nBayern 1-0 PSG (2-0 agg)\n21:25 , Michael Jones\n67 mins: Eric Choupo-Moting now has four goals in six Champions League games this season. That’s a fine record for the striker who had to replace Robert Lewandowski.\nPSG are pushing higher up the pitch now. They need to score twice to get back into this tie.\nBayern 1-0 PSG (2-0 agg)\n21:23 , Michael Jones\n64 mins: Save! There’s still time for PSG to get back into this tie. The French side win a corner that Messi whips into the box. Sergio Ramos is the only body making a run and he storms into the air to power a header at goal.\nIt’s a decent effort but comes too close to Yann Sommer who sticks out a hand and pushes it wide of goal.\nGOAL! Bayern 1-0 PSG (2-0 agg) - Choupo-Moting, 61'⚽️\n21:21 , Michael Jones\n61 mins: No but Bayern can add to their lead! El Chadaille Bitshabu gives the ball to Marco Verratti inside his own box and the midfielder dallies too long in possession.\nThomas Muller pokes the ball away from him and gives it to Leon Goretzka who touches it towards goal before squaring a pass to Eric Choupo-Moting for the easiest of tap ins.\nBayern 0-0 PSG (1-0 agg)\n21:19 , Michael Jones\n60 mins: 30 minutes to play in Germany. Can PSG get themselves an equaliser and ignite some excitement into this match?\nBayern 0-0 PSG (1-0 agg)\n21:14 , Michael Jones\n56 mins: PSG will breathe a sigh of relief after that one. Based on what we’ve seen from the two fixtures in this tie another goal for the hosts will be enough.\nIt’s been a very close affair with chances few and far between. A two goal aggregate lead for Bayern would be huge.\nNO GOAL! Bayern 0-0 PSG (1-0 agg)\n21:12 , Michael Jones\n53 mins: It’s chalked off! The VAR believes that Muller gets a touch on the ball and he was stood in an offside position when Musiala put it into the box.\nPSG have a reprieve.\nGOAL! Bayern 1-0 PSG (2-0 agg) - Choupo-Moting, 52'⚽️\n21:11 , Michael Jones\n52 mins: Bayern lead! Jamal Musiala is given the ball on the edge of the box and flicks it into the penalty area. Eric Choupo-Moting gets his head to the ball and guides it into the far bottom corner.\nThomas Muller was also in the box and stretched to meet it after Choupo-Moting’s header. It doesn’t look as though he’s touched it but VAR are checking for offside.\nBayern 0-0 PSG (1-0 agg)\n21:07 , Michael Jones\n48 mins: PSG have been knocked out of the Champions League at the last-16 stage in four of the last six seasons. The two times they have progressed they went on to reach the semi-finals and the final.\nThe French side are still in this tie. One goal is all the need to force extra-time as it stands. Kylian Mbappe sees the ball drop fo him inside the box but his snapshot is blocked by the nearest defender, De Ligt I think.\nSecond half: Bayern 0-0 PSG (1-0 agg)\n21:04 , Michael Jones\nChristophe Galtier has made another change at the break and has replaced substitute Nordi Mukiele with El Chadaille Bitshabu. Mukiele must have an injury as he came on to replace Marquinhos in the first half.\nNo changes for Bayern.\nHT Bayern 0-0 PSG (1-0 agg)\n21:00 , Michael Jones\nTottenham are also trying to reach the Champions League quarter-finals tonight. They are currently drawing 0-0 with AC Milan at the Tottenham Hotspur Stadium but are losing 1-0 on aggregate after losing the first leg in Italy.\nCan Antonio Conte’s men turn that one around?\nHT Bayern 0-0 PSG (1-0 agg)\n20:56 , Michael Jones\nIt’s been a very even contest. Both teams have had four attempts with two each on target. PSG are edging it in terms of possession but Bayern’s win in Paris has given them the advantage in the tie.\nKylian Mbappe has been quiet for his standards.\nHT Bayern 0-0 PSG (1-0 agg)\n20:52 , Michael Jones\nHalf-time: Bayern 0-0 PSG (1-0 agg)\n20:48 , Michael Jones\n45+2 mins: There goes the whistle to end the first half. PSG will feel a bit gutted after forcing Matthijs de Ligt to clear one off the line but Bayern Munich will be pleased with that 45 minutes.\nThey didn’t allow PSG to create many chances to score and the French side will have to open up more in the second half to break them down.\nBayern 0-0 PSG (1-0 agg)\n20:46 , Michael Jones\n45 mins: Two minutes of added time to play at the end of the first half. PSG have been decent but apart from the mistake from Yann Sommer they haven’t been able to get at Bayern.\nBayern 0-0 PSG (1-0 agg)\n20:41 , Michael Jones\n41 mins: Now Bayern get stuck in at the other end of the pitch. Alphonso Davies shifts his way into the penalty area and hits a low shot towards goal but, as they have done all night, PSG have men back to defend and make the block.\nCorner to Bayern.\nBayern 0-0 PSG (1-0 agg)\n20:39 , Michael Jones\n38 mins: OFF THE LINE! Matthijs de Ligt keeps Bayern Munich ahead in this tie!\nYann Sommer is given the ball and attempts to run it out of his own box. Vitinha presses and takes over possession before guiding a shot towards goal.\nIt’s heading in but De Ligt flings himself at the ball and manages to lift it clear before it crosses the line. Wonderful last ditch defending.\nBayern 0-0 PSG (1-0 agg)\n20:37 , Michael Jones\n37 mins: Christophe Galtier takes no chances on Marquinhos and subs off the PSG captain with a little under 10 minutes of the first half to play.\nThe captaincy passes to Kylian Mbappe and Nordi Mukiele is brought on to replace him.\nBayern 0-0 PSG (1-0 agg)\n20:35 , Michael Jones\n35 mins: Bayern Munich win a free kick over on the right wing. Joshua Kimmich hits a low one towards the near post but Donnarumma scoops it up without too much trouble.\nMarquinhos thengoes down clutching his side and looks in a bad way. He pulled up straight after that free kick.\nBayern 0-0 PSG (1-0 agg)\n20:32 , Michael Jones\n33 mins: Save! Gianluigi Donnarumma is called into action after Bayern slip the ball into the box for Jamal Musiala. He turns Danilo and drills an effort across goal but the French goalkeeper manages to drop low and palm the ball away.\nBayern 0-0 PSG (1-0 agg)\n20:30 , Michael Jones\n31 mins: Bayern keep hold of possession before Musiala makes a decent run into space and receives a ball that gets floated over the top.\nHe tries to switch the play quickly out to Alphonso Davies on the left wing but is wayward with his pass and sends the ball out of play.\nBayern 0-0 PSG (1-0 agg)\n20:28 , Michael Jones\n29 mins: Bayern have won all seven of their Champions League games this season. The last time they won the opening seven matches of a Champions League campaign was in 2020 when they went on to win the title.\nPSG meanwhile have never progressed through the knockout rounds when they’ve lost the first leg.\nBayern 0-0 PSG (1-0 agg)\n20:26 , Michael Jones\n25 mins: Close! Fabian Ruiz goes on a fine run through the left side of the pitch and picks out Messi in the middle of the box. Messi has two or three stabs at the ball as Bayern throw men back to defend before the ball is eventually smothered by Sommer.\nBayern 0-0 PSG (1-0 agg)\n20:24 , Michael Jones\n24 mins: Since 2012/13, Bayern Munich have won all 10 Bundesliga titles. PSG have won Ligue 1 in eight of those 10 years.\nThe German and French champions seem evenly matched through these early stages but Bayern have that aggregate goal which gives them the advantage.\nBayern 0-0 PSG (1-0 agg)\n20:20 , Michael Jones\n21 mins: Chance! Matthijs de Ligt leaves a gap in the Bayern defence as he strides forward to lunge into a tackle on Lionel Messi. Messi goes down but not before squirting the ball over to Kylian Mbappe.\nMbappe’s first touch is poor though and he knocks it to the byline before smoking a shot into the near side-netting. A better first touch from the French striker and he would have had a good chance to open the scoring there.\nBayern 0-0 PSG (1-0 agg)\n20:18 , Michael Jones\n18 mins: The first corner of the game comes to PSG. Lionel Messi swings the set piece over to the back post but Yann Sommer leaps towards the ball and confidently plucks it out of the air.\nBayern 0-0 PSG (1-0 agg)\n20:16 , Michael Jones\n15 mins: It’s been an intriguing if slightly lacklustre opening quarter of an hour. Bayern are controlling more of the ball now and Leon Goretzka gets off their first attempt at goal with a shot from the edge of the box.\nHis effort bounces just in front of Donnarumma who needs a couple of attempts to scoop it up.\nBayern 0-0 PSG (1-0 agg)\n20:13 , Michael Jones\n12 mins: PSG seem to realise that a Bayern Munich goal would make an already difficult task close to impossible. Whenever the host have the ball inside the final third, Paris always have men back to defend.\nEric Maxim Choupo-Moting and Jamal Musiala link-up to get the ball to the tip of the ‘D’ but Choupo-Moting gets swarmed and loses possession before he can shoot.\nBayern 0-0 PSG (1-0 agg)\n20:10 , Michael Jones\n9 mins: Leon Goretzka evades a challenge from Sergio Ramos and manages to run the ball through the middle of the pitch. He looks to square it along the edge of the box but his pass is intercepted and the visitors clear their lines.\nBayern haven’t yet get into their stride but they’ve limited PSG’s attacking capabilites.\nBayern 0-0 PSG (1-0 agg)\n20:06 , Michael Jones\n6 mins: PSG are set up with two wingbacks in Achraf Hakimi and Nuno Mendes but both players are sitting quite deep to make the French champions more defensively solid.\nLionel Messi receives the ball just outside the box and looks to slip it into Mbappe but Dayot Upamecano steps up and nicks the ball off the World Cup winner.\nBayern 0-0 PSG (1-0 agg)\n20:03 , Michael Jones\n3 mins: Chance! PSG thread the ball through the inside left channel where it gets flicked on to Kylian Mbappe. He carries the ball into the left side of the box then shoots from a tight angle and fizzes his effort straight into the hands of Yann Sommer.\nDecent start from PSG.\nKick off: Bayern 0-0 PSG (1-0 agg)\n20:01 , Michael Jones\nPSG get the match underway. They roll the ball back to Gianluigi Donnarumma who sends it over to the left wing. The visitors send the ball down the line and win an early throw in.\nBayern vs PSG\n19:57 , Michael Jones\nThese two European heavyweights go head-to-head tonight. Only one will make it through to the last eight. PSG must defeat Bayern Munich in Germany if they hope to go through.\nThe rain is falling as the players head out onto the pitch. Kick off is up next.\nBayern vs PSG\n19:53 , Michael Jones\nThis is the 13th Champions League meeting between Bayern Munich and PSG, with each side winning six of the previous 12 matches.\nIt will be the most the French side have ever faced a specific opponent in the competition.\nSportswashing billions can’t stop circus act PSG slipping into farce\n19:48 , Michael Jones\nDespite Kingsley Coman winning yet another big Champions League game for Bayern Munich against Paris Saint-Germain, this wasn’t really history repeating itself but the latest round of farce.\nA 1-0 win for the German champions in this last-16 first leg certainly didn’t feel like the grand football match it had been billed as. It was instead an actual team gradually realising they had more to them than a sportswashing project that looked more like a circus act. PSG certainly look very far off the team that lost a Champions League final to Coman and Bayern in 2020. It meant many of their stars had to go right up to their ultras section at the end of the game, as if in apology.\nIt was, bar a late flurry inspired by Kylian Mbappe’s introduction, a sorry performance.\nSportswashing billions can’t stop circus act PSG slipping into farce\nBayern aiming to win Champions League\n19:43 , Michael Jones\nBayern Munich boss, Julian Nagelsmann, says the club’s goal is to win the Champions League this year but recognises that tonight’s match will not be an easy one to win.\n“We all want to go very far in the Champions League, but it also always comes down to form on the day with heavyweights like Bayern and PSG,” he said.\n“Both teams are at a similar level in terms of individual players. Both have top stars in their ranks. But our group has a very good feeling of being there for each other and giving everything.”\nThis match won’t decide Mbappe’s future\n19:38 , Michael Jones\nThere were murmurings that Kylian Mbappe could leave PSG if they fail to get into the latter stages of the Champions League this season.\n\"If I linked my future to the Champions League, without wishing to show a lack of respect to the club, I would have left a long time ago,\" said Mbappe.\n\"I don’t think this match will have an impact. I am here and I am very happy to be here. I am not thinking about anything other than making PSG successful.\"\nMbappe’s great record\n19:33 , Michael Jones\nSince Kylian Mbappé made his Champions League debut as a 17-year-old with Monaco in the 2016/17 season, he has scored 40 goals in the competition – the sixth-best tally in that period.\nScott Parker sacked by Club Brugge after just 12 matches in charge\n19:28 , Michael Jones\nScott Parker has been sacked by Belgian side Club Brugge, after barely more than two months in the job.\nThe former Bournemouth and Fulham head coach was appointed on 31 December, but won only two of his 12 matches in charge.\nHe was dismissed following a thumping defeat to Benfica in the Champions League on Tuesday night, with the 5-1 reversal yielding a 7-1 defeat on aggregate.\nScott Parker sacked by Club Brugge after just 12 matches in charge\n‘Bayern can cause PSG problems'\n19:25 , Michael Jones\nSandro Wagner, former Bayern Munich forward has been speaking on DAZN and has backed his former club to do well tonight.\n“Bayern could have by a bigger margin in the first leg. If Paris are not fully dedicated to defending tonight, Bayern will cause them problems with their pressing.”\nBayern vs PSG\n19:18 , Michael Jones\nPSG are in the house. They’ll be heading out for their warm-ups soon.\n📍🏟 The Parisians have arrived at the stadium!\n🕴 @Dior #FCBPSG pic.twitter.com/EWH8o0CZ6y— Paris Saint-Germain (@PSG_English) March 8, 2023\nBayern vs PSG\n19:15 , Michael Jones\nEric Maximin Choupo-Moting was a Paris player between August 2018 and 5th October 2020, before he joined Bayern.\nHe won two Ligue 1 titles and the 2019/20 Coupe de France and Coupe de la Ligue with Paris, scoring nine goals in 51 games for the club.\nHe has 15 goals in his last 18 Bayern games.\nMbappe in Europe\n19:10 , Michael Jones\nKylian Mbappe will provide PSG’s biggest threat tonight of that there is no doubt.\nHe has scored 40 goals in 60 Champions League appearances for Monaco (six) and PSG (34) and is only eight goals away from the all-time top 10 European Cup/Champions League goalscorers list.\nPSG’s Achraf Hakimi indicted on rape allegation by French prosecutors\n19:05 , Michael Jones\nParis Saint-Germain defender Achraf Hakimi has been indicted on rape charges, French prosecutors said Friday.\nThe prosecutors office in the Paris suburb of Nanterre said Hakimi was questioned on Thursday by investigators probing rape allegations. He was then indicted by an investigating judge and placed under judicial supervision.\nHakimi‘s lawyer, Fanny Colin, said the player “strongly denied accusations made against him,” in a written message to The Associated Press.\nColin said her client being indicted is an “obligatory step for any person being accused of rape” and will allow Hakimi to defend himself by giving him access to the case. Colin also said that some elements collected by the judicial police show, according to her, that Hakimi “in this case has been subjected to a racketeering attempt.”\nAchraf Hakimi indicted on rape allegation by French prosecutors\nNagelsmann on facing PSG\n19:00 , Michael Jones\nBayern Munich manager Julian Nagelsmann spoke about what it feels like to take on PSG in the Champions League saying: \"Paris have a clear identity and habits that you can exploit, but they can hit you on the counter if you get it wrong.\n\"We need to avoid taking too long to settle into the game. One job we have will be to avoid having too much space behind our back line.\n“It will be important to cut off passes to [Lionel] Messi and to keep him from changing direction.”\nThe difference between the teams\n18:55 , Michael Jones\nKingsley Coman’s second half volley in Paris is the only difference between the teams as PSG look to overturn Bayern Munich’s one goal lead tonight.\n⏪ King's goal to secure victory for us in Paris 👑#packmas #UCL pic.twitter.com/whEQRDJBBV\n— FC Bayern Munich (@FCBayernEN) March 8, 2023\nPSG on the verge of history\n18:50 , Michael Jones\nThis is Paris Saint-Germain’s 15th Champions League campaign. They are just one short of Lyon’s French record of 16.\nIt is PSG’s 11th outing in Europe’s top flight in succession - also one shy of Lyon’s unbroken run of appearances from 2000/01 to 2011/12.\nThey have now reached the knockout rounds in all of their last 11 seasons in the competition, last failing to progress beyond the group stage in 2004/05.\nBayern vs PSG team changes\n18:45 , Michael Jones\nJulian Nagelsmann makes three changes to the Bayern Munich side that defeated PSG in the first leg of this tie. Benjamin Pavard, Joao Cancelo and Leroy Sane are replaced with Alphonso Davies, Josip StanišiÄ and Thomas Muller.\nThere are also three changes to the PSG team from that first leg defeat.\nVitinha, Kylian Mbappe and Fabian Ruiz come into the side with Warren Zaire-Emery, Carlos Soler and Neymar dropping out.\nKylian Mbappe breaks PSG scoring record with 201st goal\n18:40 , Michael Jones\nKylian Mbappe became Paris St Germain’s all-time leading scorer with his 201st goal in Saturday’s 4-2 Ligue 1 victory over Nantes.\nThe 24-year-old France star drew level with Edinson Cavani thanks to two goals against Marseille last weekend.\nHe had to wait until injury time at the end of this game for his moment, turning smartly and slotting into the bottom corner to add gloss to a victory that puts PSG 11 points clear at the top of the table.\nLionel Messi opened the scoring in the 12th minute and the leaders looked in complete control when Jaouen Hadjam put through his own net soon after but Nantes fought back to equalise through Ludovic Blas and Ignatius Ganago.\nIt took until the hour mark for PSG to move back in front, Mbappe setting up Danilo Pereira before applying the coup de grace himself.\nKylian Mbappe breaks PSG scoring record with 201st goal\nBayern vs PSG line-ups\n18:36 , Michael Jones\nBayern Munich XI: Sommer; StanišiÄ, Upamecano, De Ligt; Coman, Kimmich, Goretzka, Davies; Muller, Musiala; Choupo-Moting\nPSG XI: Donnarumma; Ramos, Marquinhos, Danilo; Nuno Mendes, Ruiz, Vitinha, Verrattl, Hakimi; Messi, Mbappe\nMuller explains Bayern motto\n18:35 , Michael Jones\nDuring his media duties ahead of this evening’s game Thomas Muller was asked what Bayern Munich’s motto ‘Mia San Mia’ actually means.\n“It has a very broad understanding.” he replied, “It’s the self-confidence of the Bavarian; that he is strong, that he can win and that he should win, but that he knows he has to work for it.\n“And that when you have won, you can also enjoy it. A good image I have is of a broad, hairy chested Bavarian, covered in sweat, lifting a trophy.”\nPSG’s rocky form\n18:30 , Michael Jones\nThis season started emphatically for the French champions with Christophe Galtier’s side going 21 games unbeaten before the World Cup.\nBut, after the World Cup has been a different story. PSG have now lost more games in 2023 (five) than in the entirety of 2022 (four) though three wins on the bounce has steadied the ship ahead of this crucial European fixture.\nIt seems a foregone conclusion that PSG will win Ligue 1 again so their hopes for a more successful season rest upon triumphing over Bayern Munich tonight.\nWho will triumph tonight?\n18:25 , Michael Jones\nWhen the teams last met in the Champions League during the empty stadium era of April 2021, both sides won their away games and could only be separated by the away goals rule after a 3-3 aggregate draw.\nBayern continued that trend with a win in Paris and won’t take matters lightly tonight. With Kylian Mbappe in exceptional gaolscoring form the Germans will know their one goal-advantage can be wiped out instantly.\nThe Bundesliga champions will be more cautious knowing that a goal in their favour could well be enough to ge them through.\nDortmund’s defeat at Chelsea was not unlucky – it was an act of self-sabotage\n18:20 , Michael Jones\nThe Dortmund manager, Edin Terzic, didn’t want to talk about it. His midfield talisman, Jude Bellingham, said it was a “joke”. Even ex-Chelsea pundit Joe Cole, not so much wearing a cap as balancing a giant Tunnock’s teacake on his head, appeared from beneath its rim to say he didn’t like Champions League games being decided that way. But what no one seemed willing to say was that Borussia Dortmund had lost the game by an act of needless self-sabotage.\nTo recap, at 1-1 on aggregate in their Champions League last-16 second leg, inside a raucous Stamford Bridge, Chelsea were awarded a penalty to take the lead. The handball decision was debatable but what followed was not. Kai Havertz stepped and stuttered and let goalkeeper Alexander Meyer dive before aiming the other way, but his penalty hit the post and rebounded to Dortmund midfielder Salih Ozcan who gleefully cleared it away.\nYet VAR spotted Ozcan had stepped inside the penalty-box arc before it had been taken, and so Havertz was given another attempt, and this time he scored. Dortmund were desolate, Chelsea buoyed, and they went on to take their place in the quarter-finals.\nDortmund’s defeat at Chelsea was not unlucky – it was an act of self-sabotage\nBayern Munich vs PSG\n18:15 , Michael Jones\nAfter playing out a close affair at the Parc des Princes and coming off second best PSG with likely be more proactive and aggressive in Germany tonight.\nBayern Munich should be able to match whatever is thrown their way and know that a draw will see them advance.\nThey’ll narrowly progress after an entertaining draw at home.\nBayern Munich 2-2 PSG (3-2 on aggregate)\nBayern vs PSH predicted line-ups\n18:10 , Michael Jones\nBayern Munich XI: Sommer; StanišiÄ, Upamecano, De Ligt; Coman, Kimmich, Goretzka, Davies; Müller, Musiala; Choupo-Moting\nPSG XI: Donnarumma; Ramos, Marquinhos, Danilo; Nuno Mendes, Ruiz, Vitinha, Verratti, Hakimi; Messi, Mbappe\nWhat is the early team news?\n18:05 , Michael Jones\nBayern Munich will be without Benjamin Pavard, who is suspended, with Josip Stanisic in line to deputise on the right of Julian Nagelsmann’s defensive three.\nNoussair Mazraoui recently took a break from football due to a heart issue and may not yet be ready to return, while Manuel Neuer and Lucas Hernandez are long-term absentees.\nNews of Neymar’s injury comes as a blow to Paris Saint-Germain, with the Brazilian forward out for the rest of the season. In his absence, Lionel Messi and Kylian Mbappe may be employed as a front two and supported by a strengthened midfield.\nAchraf Hakimi has been named in Christophe Galtier’s travelling squad despite being under investigation by French police for an alleged rape.\nHow to watch Bayern Munich vs PSG\n18:00 , Michael Jones\nBayern Munich vs PSG is due to kick off at 8pm GMT on Wednesday 8 March at the Allianz Arena in Munich, Germany.\nViewers in the United Kingdom can watch the match live on BT Sport 2, with coverage on the channel from 7.15pm GMT. Subscribers can stream the action via the BT Sport app or online player.\nBayern Munich vs PSG\n16:32 , Michael Jones\nGood evening and welcome to The Independent’s coverage of tonight’s Champions League action between two heavyweights of Europe.\nBundesliga winners, Bayern Munich, host the French champions Paris Saint-Germain with the winner guaranteed a spot in the quarter-finals of Europe’s top competition.\nChelsea and Benfica are already through after their victories over Borussia Dortmund and Club Brugge yesterday but who will be joining them in the last eight?\nBayern bring a slender lead into tonight’s second leg after Kingsley Coman struck in Paris to give the German team a 1-0 victory and a draw this evening would be enough to see them progress.\nPSG, and Kylian Mbappe in particular, are in fantastic form though and will bring a different mindset to the match. In Paris they sat off Bayern and allowed them the ball but expect Christophe Galtier’s side to be more proactive tonight.\nWe’ll have all the build-up, team news and match action before the match kicks off at 8pm.",
  "word_count": 5131,
  "scraped_at": "2026-02-14T01:59:46.890780",
  "_text_extracted": true
}