{
  "article_id": "b61569d823b2",
  "url": "https://www.bbc.com/sport/football/articles/c62q367jlzdo",
  "title": "Gabriel Martinelli : How can Brazilian winger find his form for Arsenal to silence critics ? ",
  "date": "20250910T140000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How can Martinelli find his form for Arsenal to silence critics?\n- Published\nArsenal return to Premier League action this weekend with the visit of Ange Postecoglou's Nottingham Forest - their first league game since the defeat by Liverpool at Anfield before the international break.\nThe Gunners were criticised for their attacking output during the loss to the champions and one of the players who was at the centre of a lot of that criticism was Gabriel Martinelli.\nIt's fair to say things have not been clicking for the Brazilian winger of late. Some supporters were surprised to see him start at Anfield, especially given the options Mikel Arteta now has following a summer in which the club spent nearly £300m.\nBut there aren't many wingers who can be more trusted than Martinelli to carry out tactical instructions and defensive work, and in a match where fine margins were expected to be decisive he was selected by Arteta again on the left of the Arsenal attack.\nHowever, one moment summed up the past few months for Martinelli and why supporters have been so excited by the arrival of Eberechi Eze from Crystal Palace - a player who could also play on the left wing.\nDuring the first half, Martinelli led an Arsenal counter-attack and rather than play in striker Viktor Gyokeres - who looked to have an opportunity to run in behind the Liverpool defence - he kept the ball and eventually lost it for a goal kick.\nSome believe Martinelli is overthinking and suffering from a lack of confidence. That piece of play was a prime example and has since been heavily highlighted following a loss.\nWhy could it not be working for Martinelli?\nMartinelli is a hardworking player who cares deeply about succeeding at Arsenal. He is aware of the social media criticism of his performances and the discussion about his place in the team.\nThat would be hard for any player to deal with and, while that scrutiny is part of the ups and downs of a professional football career, it does not lend itself to players creating off-the-cuff moments that can win matches.\nHe scored 10 goals in 51 games and registered six assists in all competitions last season, which is a solid return but maybe not one of a top winger at a team competing for the title and going deep in the Champions League.\nOne of Martinelli's best moments did come in the Champions League when he scored the winning goal at the Bernabeu in the second leg, after Arsenal beat Real Madrid 3-0 in the first leg to ensure their place in the semi-final.\nThe change in Arsenal's style could also be one of the reasons for Martinelli's downturn in form.\nDuring his best season in 2022-23, Martinelli - who signed for Arsenal in 2019 - scored 15 goals in all competitions and registered six assists.\nArsenal were a lot more open during that time and the attacks allowed them to develop more naturally.\nArsenal finished second that season, their first of three second-placed Premier League finishes in a row.\nSince then, Arteta has changed tack - Arsenal now play with more control and are more considered in their build-up.\nThat doesn't necessarily suit Martinelli, who thrives with open spaces to run in to.\nDuring the last campaign, the Gunners were decimated by injury to attacking players and Martinelli had his own fitness issues.\nArsenal struggled to create against teams who defended in a low block and resorted to crossing the ball a lot more with little success.\nThis season Arteta has again changed his side's style, with the Gunners utilising a more direct, transitional style in the hope it will get the best out of £64m striker Gyokeres.\nThat change may well end up benefitting Martinelli, who is one of the quickest players in the Premier League, and the balls in behind the opposition defences may give him the chance to get through on goal quicker and into better areas.\nThe other options\nThe Brazilian winger is not going to be given lots of time to find his feet this season if things do not pick up, though.\nArsenal have strengthened their squad with the signings of Noni Madueke and Eze, while Leandro Trossard is another trusted option from the left wing.\nFor the first time this season, Madueke started on the right wing as Bukayo Saka was injured.\nBefore that, the former Chelsea winger had been brought on by Arteta on the left through pre-season - and that was also the case in the opening game of the season at Old Trafford.\nEze, although not a touchline winger, can play there and replaced Martinelli at Anfield.\nEze is seen more as a number 10 by those at Arsenal, but his versatility and ability to beat players is going to be of great benefit to Arsenal as they compete in four competitions.\nMartinelli, who is returning from international duty with Brazil, has spoken about how he likens the competition at his club side with that in his national team where he competes on the left wing for a place with Vinicius Jr - one of the best wingers in the world.\nWhat could it mean for the future?\nMartinelli has two years remaining on his contract with a club-held option to extend for a further year until 2028.\nThere were internal discussions about the possibility of selling Martinelli this summer, but it was felt that it would have taken a considerable offer for Arsenal sell him.\nMartinelli is still heavily trusted by Arteta and that has been shown by the winger starting the away games at Manchester United and Liverpool.\nHowever, it is accepted that Martinelli is one of a few players in the Arsenal squad who the club could sell for a sizable fee following a summer of investment.\nFor Martinelli and supporters, the hope is he rediscovers the form of three seasons ago that saw him score 15 league goals.",
  "word_count": 1000,
  "scraped_at": "2026-02-14T02:09:24.928127",
  "_text_extracted": true
}