{
  "article_id": "b6188b18d78a",
  "url": "https://www.90min.com/features/euro-2024-team-of-the-round-matchday-1",
  "title": "Euro 2024 team of the round : Matchday 1",
  "date": "20240619T101500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro 2024 team of the round: Matchday 1\n- First round of group-stage fixtures at Euro 2024 completed\n- Spain & Germany among early stand-outs\n- England & Italy also featured plenty of impressive performers\nBy Tom Gott\nThe first round of fixtures at Euro 2024 is in the books, with teams across the continent putting on a real show so far in Germany.\nSpain and hosts Germany have already established themselves as potential favourites to go all the way, while England and France are both on track but need to step things up as the tournament progresses.\nHere's a look back at the top performers from matchday one.\nGK: Unai Simon (Spain)\nCroatia always have the potential to cause problems for even the best teams in the competition, so Unai Simon had to be on top form to come away from his meeting with Luka Modric and friends with a clean sheet.\nSimon managed five saves during Spain's 3-0 victory, including a stop from a Bruno Petkovic penalty late on to ensure there would be no dramatic comeback.\nRB: Dani Carvajal (Spain)\nDani Carvajal is hardly known for his output in front of goal, but the Real Madrid right-back opened his account for Spain on what was his 45th cap.\nDefensively, Carvajal always looked comfortable against Croatia's tricky forwards, bringing the confidence that comes with winning the Champions League just a matter of weeks ago.\nCB: Nathan Ake (Netherlands)\nHe may have played more as a left-back, but there's simply no way of not including Nathan Ake in the best team of the matchround.\nAke walked away with an assist from the Netherlands' 2-1 win over Poland, but his overall performance deserves to be recognised as well. The Manchester City defender oozes class at both ends of the field.\nCB: Riccardo Calafiori (Italy)\nSocial media's new favourite player, Bologna centre-back Riccardo Calafiori enjoyed somewhat of a breakout performance in Italy's 2-1 win over Albania.\nWhile fans of Serie A are well aware of Calafiori's ability, the 22-year-old announced himself on the international stage with a strong performance, even chipping in with some huge contributions in attack.\nLB: Michel Aebischer (Switzerland)\nA teammate of Calafiori's at Bologna, Swiss star Michel Aebischer stole the show in a unique role as his side roared to a 3-1 win over Hungary.\nAebischer is a midfielder by trade but lined up as a left wing-back in a system which encouraged him to get inside and on the ball as much as possible. The rewards? A goal and an assist.\nDM: Fabian Ruiz (Spain)\nAnother show-stealer who walked away from the first round of fixtures with a goal and an assist, Fabian Ruiz played a huge role in Spain's win over Croatia.\nIt's no secret that Croatia's strength lies in midfield, where Luka Modric, Mateo Kovacic and Marcelo Brozovic have played their way into the streets-will-never-forget pantheon, but Fabian made sure he came out on top.\nDM: Jude Bellingham (England)\nEngland made hard work of their 1-0 win over Serbia but, while questions about the Three Lions continue to swirl, nobody is questioning the credentials of a certain Jude Bellingham.\nOne of the favourites for this year's Ballon d'Or, Bellingham took charge of proceedings for England. His goal proved pivotal but his all-round performance and willingness to fight for the shirt made a major impact.\nRM: Dennis Man (Romania)\nRomania's first win at the Euros in 24 years came in style as they thumped Ukraine 3-0, with Dennis Man playing the role of conductor.\nMan, who plays his football in Serie B for Parma, watched his side manage just 29% possession throughout the game but stayed sharp to pounce on any glimpses of space that came his way and seal a famous victory.\nAM: Jamal Musiala (Germany)\nArguably the star of the first round of fixtures, Jamal Musiala and Germany opened Euro 2024 in style with a 5-1 thumping of Scotland.\nBayern Munich's 21-year-old sensation made the most of his first Euros stars with a dazzling showing which yielded one goal and some absolute nightmarish movements with the ball at his feet. Scotland simply couldn't get near him.\nLM: Lamine Yamal (Spain)\nWhat can't Barcelona's teenage sensation do?\nLamine Yamal put on a hugely impressive showing in Spain's triumph over Croatia, popping up with the inch-perfect assist for Carvajal's goal on the stroke of half-time.\nST: Kai Havertz (Germany)\nThe left-back experiment is well and truly over for Kai Havertz with Germany. The Arsenal man was back at the top of the team against Scotland and he continued his impressive form with another goal and an assist.\nDovetailing perfectly with Musiala and Florian Wirtz, Havertz ensured Germany made a lasting impression in the tournament's opening game.",
  "word_count": 791,
  "scraped_at": "2026-02-14T01:51:32.427731",
  "_text_extracted": true
}