{
  "article_id": "b61e6234a316",
  "url": "https://www.bbc.com/sport/football/articles/cn8jm4mmk8no",
  "title": "  Not often you can write Arsenal history  - Gunners claim Fifa Women Champions Cup against Corinthians",
  "date": "20260201T230000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Not often you can write Arsenal history' - Gunners win Champions Cup\n- Published\nThe inaugural Women's Champions Cup delivered the kind of spectacle Fifa would have hoped for when launching the new inter-continental competition last March.\nArsenal's extra‑time triumph over Brazilian champions Corinthians produced plenty of drama, tension and quality at the Emirates Stadium.\nIn a game where momentum swung both ways, Corinthians struck a 96th-minute penalty to force extra time in which Arsenal's Catilin Foord then emerged as the hero with a 104th-minute winner that secured the silverware.\nThe scenes at full-time said plenty too as Arsenal's celebrations after receiving the trophy from club legend Arsene Wenger underlined just how valuable this competition was to a squad searching for momentum amid a challenging domestic season.\n\"It's not often that you can write history at Arsenal because history has been written so many times,\" goalscorer Lotte Wubben-Moy told Sky Sports after the triumph.\n\"We stand on the shoulders of giants. To come to this inaugural competition and win it and do it with all of our fans here in style - our fans are wonderful and that's who we do it for.\"\nArsenal captain Kim Little added: \"It's obviously a unique experience - it being the first Champions Cup. We'll take a lot from winning today and getting a trophy.\"\n'It was football in all its ways'\nFor Arsenal, the Champions Cup title arrives at a vital moment in their season.\nHaving failed to capitalise on Chelsea's faltering WSL campaign and been knocked out of the League Cup by Manchester United less than two weeks ago, the tournament offered a welcome distraction and the victory will give them a boost as they go into the second half of the campaign.\nBut they had to do it the hard way in the final against a resolute Brazilian opposition.\nThe home side dominated large stretches of the title showdown and failed to pull themselves clear of Corinthians but their quality proved the difference in extra time as Frida Maanum sent Foord through on goal to secure the silverware for Arsenal.\n\"It's football in all its ways today,\" said manager Renee Slegers, who won the Champions League with the club last season.\n\"There was good football, duelling and momentum shifts. I'm proud of the team in the rain, in the circumstances, we get over the line and find a way to win this game.\"\nThe Gunners were moments away from a regulation-time victory only for Katie McCabe to concede an injury-time penalty from which Vic Albuquerque levelled the game at 2-2 and forced extra time.\nLittle said: \"We showed incredible character and resilience, having conceded the goal right at the end, to come back in extra-time.\n\"These things happen in football. You have to bounce back. When we came out in extra-time we showed that, we created chances, and Caitlin scored a great goal to get the win.\n\"We've got an incredible squad of players and staff and it feels great to get more silverware for this club.\"\nSitting 13 points off leaders Manchester City in the WSL, the Gunners will turn their focus to defending their Champions League title when they face OH-Leuven in the last 16 later this month while they are also alive in the FA Cup.\nAnd this victory will come as a shot in the arms for Slegers and her players.\nCorinthians add colour to Champions Cup\nCorinthians may have ultimately fallen short of the trophy - but only after transforming the first-ever Champions Cup into a blockbuster.\nHaving arrived in London during their off‑season and then pushed one of the best teams in the world all the way for the title, they can return to Sao Paulo with their heads held high.\nHaving already produced a shock 1-0 win over Gotham FC in the semi-final, the seven-time Brazilian champions were agonisingly close to another upset in the final.\nTravel fatigue, lack of match fitness and a rain‑soaked Emirates pitch did nothing to blunt their competitiveness as they proved a constant threat to Arsenal on counters.\nThe Brazilians also showed plenty of character to come back into the contest twice.\n\"Corinthians had a great performance,\" said Slegers. \"They gave so much energy, intensity, passion and intelligence.\"\nTheir supporters, too, were a force of nature among the 25,031-strong crowd in north London - a passion that was matched on the pitch by their team.\n\"Magnificent,\" Wubben-Moy said in describing the travelling supporters.\n\"There's a big Brazilian community in London. They showed up today. That's what this tournament is about - bringing people together. They're the top competition and that's what we saw.\"\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 819,
  "scraped_at": "2026-02-14T02:09:42.990694",
  "_text_extracted": true
}