{
  "article_id": "b63e0280c52d",
  "url": "https://www.teamtalk.com/tottenham-hotspur/fabrizio-romano-confirms-spurs-plan-sign-man-utd-target-upgrade-101-game-star-postecoglou-doesnt-rate",
  "title": "Tottenham transfers : Fabrizio Romano confirms Postecoglou plan to sign Man Utd target as upgrade for 101 - game star",
  "date": "20240626T134500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nFabrizio Romano confirms Tottenham plan to sign Man Utd target as upgrade for 101-game star Postecoglou doesn’t rate\nTottenham manager Ange Postecoglou is actively looking to sign a new right-back this summer with a fee now agreed to sell Emerson Royal and with Fabrizio Romano confirming plans to bring in a long-term Manchester United target as his replacement.\nThe north London side made rapid strides under the likeable Aussie boss during his first season in charge, steering Tottenham to a fifth-placed finish in the Premier League. And while there will be some satisfaction in bringing back midweek European football to N17, the fact it is in the Europa League and not the Champions League will leave Postecoglou with a bit of a sense of regret.\nIndeed, Spurs topped the early Premier League table last season after a sublime start saw them win eight and draw two of their first 10 games – earning Postecoglou the honour of the best start ever made by a new manager in his debut season in the English top flight.\nSadly, their flying start was to derail following a painful home defeat to bogey side Chelsea at the start of November, with injuries and suspensions soon taking hold and serving as a reminder as to why the Tottenham squad still required further strengthening.\nIN DEPTH ➡️ Five players facing Postecoglou axe as part of major summer revamp\nThe Lilywhites were the only Premier League side who made a permanent signing in the January window in the form of Radu Dragusin, and Tottenham are once again expected to have a high turnover of players once again this summer as Postecoglou looks to ring in further changes.\nAnd their summer business looks set to get underway in due course with Tottenham beating off five Premier League rivals to sign a record-breaking teenage striker.\nTottenham transfers: Emerson Royal compromise with Milan close\nHowever, Spurs will also likely sign a more senior No 9 this summer, while Postecoglou we understand the ambitious Tottenham boss also hopes to add another midfielder and another two additions in defence.\nIndeed, their next significant deal could actually be an outgoing with 2021 signing Emerson Royal nearing the end of the line in north London after 101 appearances in a Spurs shirt.\nHaving played the majority of his career at right-back, he found himself utilised as an emergency centre-half on occasions last season.\nPostecoglou, though, has made it clear the club will be open to offers for the 10-times capped Brazil international this summer, with AC Milan emerging as the leading contenders for his signature.\nWith Tottenham initially seeking €25m (£21.3m) for the 25-year-old, the Serie A giants had initially balked at the fee, offering instead a fee in the €15m (£12.7m).\nBut after a series of talks between the clubs, it’s now understood that a fee in the region of €18m (£15.2m) is close to being agreed as a compromise, though Tottenham could claim a 10% sale of any future deal to earn themselves a potential nice little earner in the years to come.\nRoyal’s exit will leave Pedro Porro as Tottenham’s senior right-back, though that is a situation Postecoglou is keen to address having been linked with two would-be replacements.\nFabrizio Romano confirms Spurs plans to sign Man Utd target\nAs a result, both Monaco man Vanderson and Girona’s on-loan Manchester City full-back Yan Couto have been strongly tipped with moves to the Tottenham Hotspur Stadium in recent weeks.\nBrazil star Vanderson has caught the eye since moving to the French Riviera from Gremio, with his form catching the attention of Manchester United, who have targeted the 23-year-old as a potential upgrade for Aaron Wan-Bissaka.\nCouto, meanwhile, scored twice and weighed in with 10 assists for Girona as Michel’s side caused a monumental stir in LaLiga by finishing third in the table behind Real Madrid and Barcelona to qualify for the Champions League.\nDue to head back to parent club, Man City, this summer, the 22-year-old Brazilian appears to have edged Vanderson in the national squad in recent times.\nHowever, according to Romano, it is Vanderson whom Postecoglou plans to chase with the trusted transfer guru confirming to Caught Offside that a move for Couto is unlikely.\nDON’T MISS ➡️ No 1 Tottenham striker target available for amazing fee as FIVE other attackers snubbed\n“Emerson Royal could leave Tottenham as he’s publicly acknowledged interest from AC Milan, even if nothing is done yet,” Romano said. “As previously reported, Monaco right-back Vanderson is someone they are showing an interest in in case Emerson leaves the club.\n“I’m also aware there have been some rumours about Yan Couto, but I’m not aware of anything concrete on that story, let’s wait and see what happens. However, as Tottenham have Pedro Porro as their first choice, they want to sign a backup option for that position, and I see Couto as someone who would be more of a starter than a rotation player.”\nVanderson has scored six goals and has five assists from 84 appearances since moving to Monaco in January 2022 for a fee of just €11m.",
  "word_count": 858,
  "scraped_at": "2026-02-14T01:57:18.883414",
  "_text_extracted": true
}