{
  "article_id": "b640d3e7da40",
  "url": "https://theathletic.com/4783692/2023/08/21/christian-pulisic-milan-usmnt/",
  "title": "Christian Pulisic in Milan – it make or break",
  "date": "20230821T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What happens in Vegas doesn’t always stay in Vegas. Christian Pulisic was busy preparing for the CONCACAF Nations League finals when he heard AC Milan were thinking about taking a gamble on him. “As soon as you hear something like that, right away you want to say: ‘Yes’,” Pulisic explained.\nA video call was set up during negotiations and AC Milan’s chief executive Giorgio Furlani acted as the interpreter for Pulisic and the team’s coach, Stefano Pioli, to talk football. When Pulisic closed his laptop, he opened himself to the prospect of moving to Italy. Pioli had gone into detail about his vision for the 24-year-old, elaborating on the fluidity and versatility expected of his forward line. “Everything just really fit,” Pulisic said. His mind was made up. He wanted to go to Milan because he “really felt they wanted me”.\nAdvertisement\nThe interest was not recent either. Milan had weighed up whether they should sign Pulisic last summer. Chelsea’s new owners were busy splashing the cash in the transfer market and some of it almost washed up at the club’s Casa Milan headquarters.\nTodd Boehly and Behdad Eghbali wanted Rafael Leao, the explosive winger and Serie A MVP, who had just helped Milan win the league for the first time since 2011. A series of possible deal structures were sketched out in the hope one might lead Milan into temptation. They included a cash-plus-player exchange with Pulisic thrown in.\nIn the end, Milan decided it was too late in the transfer window to do business and that whatever Chelsea proposed, it wasn’t a good time. But it wasn’t a waste of time. During the talks, Milan did plenty of groundwork on the prospect of signing Pulisic and the USMNT star remained in their thoughts throughout the following season, particularly as one of the positions he could fill, on the right, was still in need of a serious upgrade.\nIn May, as the football world descended on Milan for the first Champions League semi-final in two decades to feature a Derby della Madonnina, executives from Chelsea checked in with their Milan counterparts. Leao was missing from the first leg through injury and Milan didn’t have an adequate replacement on the left, a role Pulisic thrives in for the USMNT. Milan lost 2-0 and it could have been worse. Sandro Tonali’s performance in midfield was one of the few salvageable things from a disappointing game. It caught the eye of the richest Premier League clubs.\nChelsea’s interest switched from Leao, who was about to commit to a new deal with Milan, to Tonali. Pulisic, Ruben Loftus-Cheek and Cesare Casadei, the top scorer and player of the tournament at the Under-20 World Cup, were offered up as trade pieces.\nAgain, a swap didn’t happen. But Tonali did leave for England.\nAdvertisement\nHis wish to experience the Premier League was granted by Newcastle United, who followed Milan’s preference to do a deal early. The €70million (£60m) they agreed effectively tripled Milan’s transfer budget and the club’s hierarchy settled on a plan to use it to revamp the team’s attack.\nLast season, Milan struggled to break down deep blocks. Their expected goals (xG) against bottom-half teams ranked eighth in Serie A and the 0-0s against Empoli, Sassuolo and Cremonese were a source of great frustration in an underwhelming title defence as Milan finished 20 points adrift of champions Napoli. Without Juventus’ points penalty, they would not have qualified for this season’s Champions League.\nCEO Furlani and the club’s recruitment committee decided to spread the Tonali money around rather than splurge it on one single player. They had a lot to do. Mistakes made in the market last summer needed correcting as only one of six signings — Malick Thiaw — came off. Club legend Paolo Maldini and sporting director Ricky Massara paid for it with their jobs. Another objective of this summer’s window was to make the midfield more progressive and the attack less dependent on Leao by finally upgrading on Junior Messias and Alexis Saelemaekers on the right.\nThis is where Pulisic came in.\nAs incarnated by other new arrivals, such as the electric Samuel Chukwueze and the direct Noah Okafor, the priority for Milan was finding players with the ability to wriggle out of tight spaces and beat their opponents in one-v-one situations. It is what Pioli, holidaying in the Maldives, explained to Pulisic on their video call. “This is where we see you fitting in. This is how we want you to play,” is how Pulisic remembers it.\nThe first offer Milan made Chelsea was a €14million ($15.2 million) basic fee with a series of add-ons, which nudged the deal closer to the €25million ($27.2 million) asking price. The proposal can be interpreted in different ways. First, the need for Milan and all clubs operating outside of the Premier League to get maximum bang for their buck. Second, an acknowledgement that Pulisic’s contract with Chelsea had only a year left to run. Third, Milan knew Chelsea didn’t want him anymore. Chelsea had made that clear by offering him to Milan as a bargaining chip, not to mention buying one player after another in his position, from Mykhailo Mudryk and Joao Felix to Raheem Sterling and Christopher Nkunku. Each of those transfers showed the little regard Chelsea had for Pulisic and how much his stock and star had fallen since his €64m move from Borussia Dortmund five years ago.\nThe opening bid was refused, but Milan knew Pulisic would choose the seven-time Champions League winners, a club he described as “legendary” and “historic”. The other bidder in the Pulisic sweepstakes, Lyon, could not offer European football. Over 10 days, Chelsea succeeded in getting Milan to up their offer. Chelsea knew Milan wanted Pulisic back at the Allegiant Stadium for the Vegas leg of their upcoming U.S. tour and leveraged that to reach an agreement on a package worth €22m ($24 million).\nAdvertisement\nPulisic became Milan’s fourth signing of the summer transfer window after Chelsea team-mate Loftus-Cheek, back-up goalkeeper Marco Sportiello and Luka Romero, the diminutive Argentinian who, like Casadei, enjoyed a fine Under-20 World Cup.\nAnother four buys followed soon afterwards. Milan moved like a well-oiled machine. Too slow in the market last summer when RedBird’s takeover and talks over Maldini and Massara’s contract renewals contributed to Milan missing out on Enzo Fernandez, this time around they were swift and decisive.\n“We’ve been signing a player a week,” Milan’s president Paolo Scaroni said. “It’s not a bad rate, is it? Furlani’s making us get used to it. Do you reckon he’ll keep this up until August 31?”\nSportiello and Romero aside, both of whom joined on free transfers, Milan have stuck to paying around €20m ($21.5 million) for each of the players they’ve signed this summer. Much has been made of the transition from Maldini to Moneyball. It’s a perception that has taken hold because RedBird owns an analytics company, Zelus, and Billy Beane occasionally joins in on recruitment calls. But the modus operandi isn’t too different from what went before under Elliott. Think of it as “continuity plus”, with chief scout Geoffrey Moncada and the data team established by Hendrik Almstadt all collaborating together. It would, therefore, be a stretch to define Pulisic as a Moneyball signing even if the strategy of turning one player sale into roughly eight acquisitions is loosely in sync with the term made famous by Michael Lewis’ book and film of the same name.\nAs each signing cost more or less the same, no one is weighed down by a huge price tag in the way Charles De Ketelaere was a year ago when he became a lightning rod for expectation. Still, the other Milan signings did not have Gazzetta dello Sport’s graphics team mocking them up as Captain America for the front page. No signing has attracted more attention than Pulisic.\n“I definitely felt this ‘wow’ factor,” Pulisic said when reflecting on his first day as a Milanista. Fans and reporters were waiting for him in the terminal at Malpensa airport and the video he posted as he landed in Italy generated six million views on Instagram and TikTok. More were outside the gates of the clinic while he underwent his medical. Pulisic looked like a G.I. handing out chocolate rather than a footballer signing autographs as he came through the sliding doors of Casa Milan to pose for selfies just moments after putting pen to paper on his four-year contract (with an option of a fifth) upstairs in the club’s boardroom.\nThe warm welcome was appreciated by a player in desperate need of turning the page and starting over.\nAdvertisement\n“It was a difficult last few seasons at Chelsea for whatever reason,” Pulisic said in an understatement. “This is just a brilliant opportunity to step away and play for a big team.” How much he makes of it is down to him. If Pulisic flops in Milan, chances with Europe’s biggest clubs will be few and far between. This year is huge for him, with the Copa America in the U.S. looming on the horizon. Two years after that, there is a World Cup on home soil.\nBy doing a deal for him before the start of pre-season, Milan have given Pulisic the best chance of hitting the ground running. Doing so is easier said than done. Players as good as Leao, Tonali and De Ketelaere struggled in their first season at Milan.\nIt’s a ground that can swallow players up. Historically, playing at the Giuseppe Meazza has meant competing for the scudetto and the Champions League. It’s a lot to take on. Expectations are high, opinions can be unforgiving. For every new signing who struggles, though, there is a Fikayo Tomori or an Olivier Giroud, Pulisic’s old Chelsea team-mates, who took everything in their stride when they joined. Pulisic spoke to both when Milan expressed an interest and his integration should not be a problem. This is not like Alexi Lalas’ move to Padova in 1994 when the team was almost entirely Italian. The Milan dressing room is international and Pulisic has already played with some of his team-mates either at club level or, in the case of Yunus Musah, with USMNT too.\nThe signs have been encouraging. “I met him at Casa Milan,” said Milan president Scaroni. “He’s a bright, clean-cut kid and a big talent. (Milan’s former owner) Silvio Berlusconi would have liked him.”\nOn the pitch, Pulisic laid on a couple of assists for Tommaso Pobega in the team’s first friendly of the summer against Lumezzane. Deployed on the left in that game, Leao’s availability on tour in the U.S. meant Pulisic moved to the right in Milan’s 4-3-3. Sharing set plays with Theo Hernandez, it was from a Pulisic corner that Tomori scored the opener in a 3-2 defeat to Real Madrid in Pasadena. Another Pulisic corner, this time short and knocked down by Thiaw for Giroud, resulted in another goal in the 2-2 draw with Juventus in LA. Set plays were a weakness for Milan last season. Only 11th in Serie A for goals from dead-ball situations, the hope is Pulisic and his deliveries can address it and affect a swing in the right direction.\nMeanwhile, from open play, his most exciting moment came in the first edition of the Trofeo Silvio Berlusconi when Pulisic, again coming off the right, exchanged a neat one-two with Loftus-Cheek then another with Giroud, bursting through the heart of a back five and getting into the box, where he drew a foul from Danilo D’Ambrosio. Monza goalkeeper Michele Di Gregorio saved Pulisic’s penalty but he succumbed to the rebound. A relieved Pulisic shook his head and broke out in a smile. It was the sort of break De Ketelaere never experienced last season. “Pulisic can play very well everywhere,” Pioli said. “Left, right, through the middle. When everyone’s fit and ready, we can play him off the striker.”\nMilan are capitalising off the pitch as well. Massimiliano Allegri, the team’s former coach, likes to say he feels more and more like an asset manager than a trainer these days as players are corporations in their own right. Those from football’s emerging markets, such as Son Heung-min in South Korea and Pulisic in the U.S., are real money spinners.\nAdvertisement\nJersey sales at Milan are up 75 per cent on a standard equivalent period. The increase in the U.S. alone has been astronomical, hitting 713 per cent. Breaking America isn’t easy. But it just got a whole lot easier with Pulisic. The share of jersey sales in the States has risen from nine per cent of Milan’s total to 43 per cent. Ticket sales for the tour in the U.S. spiked and Milan’s commercial team hope to leverage Pulisic’s popularity to grow sponsorship revenue in North America. His presence in Serie A is a huge draw and gives the league an ace up its sleeve when negotiating with U.S. broadcasters in the upcoming rights cycle when TV rights will be sold for five instead of three years. This is where the experience of Gerry Cardinale and his RedBird fund in the media, sport and entertainment space comes into its own.\nThe Pulisic effect has not been limited to America. Jerseys customised with his name on the back account for 45 per cent of all jerseys sold since he signed and he has provided a boost to the club’s season ticket campaign at San Siro. All of this is a welcome bonus. Milan signed the ‘calciatore’, not the ‘commerciante’ — the baller, not the businessman. As Furlani has always said, Milan’s focus “is, and will always be, the football”. Good football results make for good financial results. Without them, the revenue streams dry up.\nHow it all comes together on the pitch is piquing curiosity. The sacking of Maldini and Massara, the retirement of Zlatan Ibrahimovic (whose No 11 jersey is now on Pulisic’s shoulders) and the departures of Tonali, Brahim Diaz, Ante Rebic, Junior Messias and De Ketelaere have felt like a revolution. “I’ve heard some people talking about a year zero,” Furlani said. “This is 124th year in the history of the club, so it’s not right to call it year zero. It’s an evolution of what we started five years ago and we’re going to carry on trying to get the best results we can.” After all, didn’t Napoli overhaul their team last summer with spectacular results?\n“I like this Milan,” Pioli said while in California. “We can play in more ways. I’ve got versatile players.” In some respects, it feels like as big a year for Pioli as it does for Pulisic. He is the second longest-serving coach in Serie A and, although he followed up Milan’s first scudetto in 11 years with a run to the Champions League semi-finals, the team lost its way in the league. On paper, the club has given him all the tools to bounce back, refreshing the team and renewing Leao’s contract. Fall flat again and that could be that for him.\nAs a new player coming in, Pulisic needs stability. He has clocked up a lot of minutes in pre-season, playing left or right has made no difference. If, as expected, Milan end up fielding Leao on one side and the scintillating Chukwueze on the other, it’ll be up to Pulisic to do a better job than De Ketelaere or Brahim as Giroud’s foil in the No 10 role. It is make or break — America’s star has got his red and black stripes, let’s see if he now shines in Serie A.\n“It’s a fresh beginning,” Pulisic said. “Hopefully, I can be back to where I want to be and take it to another level.”\n(Top photo: Nicolo Campo/LightRocket via Getty Images)",
  "word_count": 2640,
  "scraped_at": "2026-02-14T01:50:52.172687",
  "_text_extracted": true
}