{
  "article_id": "b6506a0ec252",
  "url": "https://www.teamtalk.com/news/damaging-man-utd-raid-on-newcastle-forces-eddie-howe-reaction-demand-quick-resolution",
  "title": "Damaging Man Utd raid on Newcastle forces Eddie Howe reaction , with demand for  quick resolution  revealed",
  "date": "20240216T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Damaging Man Utd raid on Newcastle provokes Eddie Howe reaction, with demand for ‘quick resolution’ revealed\nNewcastle United manager Eddie Howe is refusing to panic amid heightening speculation that the club’s technical director Dan Ashworth is on the brink of a move to Manchester United – but has issued a warning to the Red Devils over their planned raid.\nThe Red Devils are embarking on a bright new era with Britain’s second wealthiest man, Sir Jim Ratcliffe, having had his £1.4bn purchase into 25% of the club approved by the necessary authorities. As part of that deal, Ratcliffe will be given full sporting control at Manchester United in an arrangement that gives the 71-year-old full control of all the club’s transfer activity.\nRatcliffe has wasted little time in making his authority felt with the departure of CEO Richard Arnold confirmed not long after news of his purchase of the Glazers’ shares coming to light, while also appointing Omar Berrarda as his replacement last month.\nNow Ratcliffe is turning his focus towards a new sporting director – the first appointment of its type in United’s long history – and with Newcastle’s highly-regarded Ashworth right at the top of his wanted list.\nIndeed, reports over the last few days have claimed United have made a breakthrough with regards an approach for 52-year-old, who counts Brighton and the English FA on his CV.\nAs one of the game’s most-respected figures in such a role, Ashworth played a leading role in helping Newcastle claim a Champions League spot last season with a number of his buys playing a major role in their ascent.\nTEAMtalk has ranked all Ashworth’s signings while at St James’ Park right here.\nDan Ashworth: Eddie Howe issues strong statement on Man Utd links\nNow with reports suggesting Ashworth could be in place at Old Trafford ahead of the summer window, the speculation has prompted a reaction from Newcastle manager Eddie Howe, who has himself very much benefited from his technical director’s wisdom and contacts.\nWhile Howe has declared speculation on Ashworth’s future as an unusual situation, he has also been quick to downplay the impact of his potential exit and also described the situation as somewhat unusual.\n“Obviously it’s been in the news a lot and usually with these things that means something’s going to happen. But as we speak now we’ve had no contact from anyone,” Howe said.\n“It’s quite an unusual situation. Usually there’s transfer speculation on players. This is very different. Of course whatever happens we want a quick resolution.\n“I think it’s a difficult one because when you’re in that role I think you need longevity to actually see the fruits of your labour. It’s a long-term position.”\nNewcastle told exit of key figure to Man Utd won’t impact them\nHowe was keen to stress how the potential loss of Ashworth will not impact Newcastle too greatly, pointing to the fact he’s only been in position with the Tynesiders since 2022.\n“I think the people that have done it best in the Premier League have had a period of real stability,” Howe added.\n“Change takes a long time in any football club to get those processes exactly how you want them to be. Dan’s had a relatively short time here, but let’s see what happens, as I sit here now nothing’s happened.”\nOn how Newcastle go about replacing their technical director, Howe is also keen to stress why he is not going to lose too much sleep over the situation and how all football clubs need to have succession plans.\n“Football always moves on very quickly and I say that regarding the manager’s position. Newcastle is a huge football club and will continue to work in a very efficient way. We’ve got some very capable people here, in all departments, so we carry on.\n“There has to be a succession plan. For everyone. There is a strategy from the board above.”\nWho the Magpies get as a replacement remains to be seen, though it is believed plans are already underway at finding his successor.\nIn the meantime, Ratcliffe reportedly wants his man in place as soon as possible and so that planning for the summer can begin in earnest at Old Trafford and ahead of what will arguably be their most critical window yet.\nDON’T MISS ~ Gamechanger for Man Utd? A quality XI of players signed during Dan Ashworth’s time in football",
  "word_count": 737,
  "scraped_at": "2026-02-14T01:56:44.629193",
  "_text_extracted": true
}