{
  "article_id": "b661f2f7708e",
  "url": "https://metro.co.uk/2025/03/02/chelsea-send-scouts-watch-serie-a-star-face-heavyweight-competition-22653754/",
  "title": "Chelsea send scouts to watch Liverpool - linked Serie A star but face competition",
  "date": "20250302T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have sent scouts to watch Bologna centre-back Sam Beukema in action, but they are not the only European giants to show an interest.\nThe 26-year-old has been with Bologna since 2023 when he signed from AZ and has been a regular in the starting XI for the Italian side.\nThe Dutch defender helped his team qualify for the Champions League this campaign and has made eight starts in Europe’s top competition this season, including against Liverpool and Aston Villa.\nBologna are battling to return to Europe for next season, currently seventh in Serie A, but they may be without Beukema as huge clubs are tracking his progress.\nTransfer expert Gianluca DiMarzio reports that Chelsea scouts were in attendance on Thursday night when Bologna beat AC Milan in Serie A.\nThe Blues are not the only team to be keen on the Dutchman, with Juventus, Inter Milan and Atletico Madrid all also credited with an interest in him.\nBeukema remains on the contract that he signed when he joined from AZ, which runs until the summer of 2027.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBeukema, who has not been capped by Netherlands, has been linked with Liverpool in the past, thanks to the words of both Reds boss Arne Slot and the player himself.\nSlot admitted that he wanted the defender when he was Feyenoord boss, hailing the ‘very good player’ when he was at Go Ahead Eagles before moving to AZ.\n‘I wanted to sign him. He had had a very good season at Go Ahead Eagles and we were looking for a central defender,’ Slot has said of the centre-back.\n‘I think he chose the wrong club, because Feyenoord did a lot better than AZ! But, in the end, he made a nice transfer to Bologna, where he is also doing well. Beukema is a very good player.’\nBeukema also fuelled the Liverpool speculation, although also said that he has a soft spot for West Ham as he dreams of a Premier League future.\nHe told Corriere dello Sport: ‘I also have ambitions and hope one day to be able to play maybe in the Premier League or another big club.\nMore Trending\n‘I once visited Upton Park with my father and I was really impressed, because the atmosphere was similar to that of Feyenoord or Go Ahead Eagles. But there are so many fantastic teams in England, so if another great club like Liverpool came along I would be happy to go there one day.’\nHe has also explained why he chose not to join Slot at Feyenoord, saying that he didn’t like the look of some of their players at the time.\nBeukema told Inews: ‘I could tell straight away he [Slot] was a top coach. But I chose AZ Alkmaar instead not because of him, but because of the situation at the time. Feyenoord had a tough season before Slot came and Alkmaar were much more stable.\n‘I was captain at Go Ahead Eagles and I told him I expect my team-mates to go all in and it seemed some [Feyenoord] players back then didn’t give their all. I said “Mr Slot, I don’t know if I can play with these kinds of players, will this change?” He said “don’t worry about that”. I was more relaxed, he made it very clear what he was expecting from his team.’\nMORE: Paul Merson names Premier League club that will beat Chelsea to top four finish\nMORE: Arsenal told transfer move for Champions League winner is ‘no-brainer’ to replace duo\nMORE: Ole Gunnar Solskjaer ‘upset’ over Manchester United transfer decision",
  "word_count": 651,
  "scraped_at": "2026-02-14T01:58:05.312564",
  "_text_extracted": true
}