{
  "article_id": "b69e6ad01e5e",
  "url": "https://thepeoplesperson.com/2023/07/25/the-day-erik-ten-hag-decided-he-needed-a-new-goalkeeper-267057/",
  "title": "The day Erik ten Hag decided he needed a new goalkeeper - Man United News And Transfer News",
  "date": "20230725T050000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The FA Cup final represented a pivotal moment in the career of Andre Onana.\nErik ten Hag, acutely aware of the financial restraints Manchester United would likely be forced to abide by this summer, wanted a new goalkeeper more suited to his style, but was willing to compromise in favour of investment in central midfielder and up front.\nThe Dutch manager was said to be willing to do “one last dance” with his current number one David De Gea to achieve these reinforcements.\nThe manner of United’s defeat at Wembley would lead Ten Hag to change this viewpoint, deciding he “could no longer wait” to change the profile of goalkeeper; a profile requisite to his continued overhaul of the United team.\nA catastrophic mistake to allow Manchester City to regain the lead just after half-time, as well as the inability to play through Guardiola’s carefully orchestrated press, exposed the fatal flaws within De Gea’s game.\nThese mistakes were the final straws which broke the camel’s back for Ten Hag, who had been alarmed by the errors the Spaniard produced in pivotal losses to Sevilla and West Ham a few months prior.\nThe Athletic reports De Gea’s flaws transitioned from acceptable compromise towards “impossible to ignore” in the days after Manchester City lifted the trophy at Wembley.\nA new contract had previously been discussed with De Gea. An offer was officially tabled in March, which the Spaniard rejected, before a further informal offer was floated around the time of the final.\nFrom De Gea’s perspective, the goalkeeper reportedly believed this new contract was a “done deal”, with several accounts relaying he signed his part of the paperwork and was planning to continue life at Old Trafford next season.\nShortly after the FA Cup final however, United “withdrew” their outlined proposal and “resubmitted one for less money”, with a reduced length. The club had taken the decision, with Ten Hag’s “influence”, to recalibrate De Gea’s contract; from that of a number one, to that of a number two. The Spaniard was welcome to stay in this new role, or depart Old Trafford for pastures anew.\nOn the morning of July 8th, over a month since the FA Cup final and the subsequent contract renegotiation, De Gea informed the club he was set to “announce his exit”.\nMultiple sources contend the goalkeeper felt “badly treated” by United in the handling of his departure, with Bruno Fernandes’ Instagram post suggesting De Gea was not alone in this assessment:\n“You deserved to say goodbye at the stadium with all the fans cheering you.”\nThe pursuit of a replacement for De Gea had begun concurrent to De Gea’s relegation to number two however. Ten Hag had begun asking about the potential availability of his former goalkeeper, Andre Onana, in the build up to the Champions League final – seven days post-FA Cup final. The former Ajax-man, now donned in the black and blue of Inter Milan, would deliver a world-class performance in Istanbul, which would be of no surprise to United’s manager.\nTen Hag has previously described Onana as a “masterful goalkeeper” who was instrumental in the Dutchman’s success in Amsterdam, where the pair won three Eredivisie titles in four-and-half years, and reached the Champions League semi-final during Ajax’s blistering European tour.\nInter were immediately receptive to United’s initial interest. The Italian side required external revenue, despite their Champions League run banking them £100 million, and were “open to doing business on Onana.” An opening valuation of “€70m soon dropped to €60m” with Old Trafford officials believing further concessions could be haggled.\nAn alternative pursuit was made for Mike Maignan, the highly-rated AC Milan goalkeeper, but the price demanded was considered excessive. It represented due diligence by United however, with Onana always the “number one choice” for Ten Hag.\nAnd so would begin a protracted and endlessly complicated negotiation.\nMultiple parties, with competing interests, were involved in a deal, which took place over the course of a month of fraught discussion. Talks were running in tangent to a prospective transfer for Rasmus Højlund – a striker the absolute priority for United – but an unrealistic valuation by Atalanta, as well as “Inter’s openness to negotiate”, ensured United began to prioritise Onana.\nTen Hag, adamant the goalkeeper should be present for the beginning of the American leg of pre-season, “exhibited frustration” at what he deemed a lack of progress. This internal pressure may have proven key in United’s willingness to raise their offer.\nA fee, of €51million plus €4m in add-ons, was finally agreed after many rounds of talks; an indication United’s almost-belligerent approach was ultimately successful given Inter’s initial asking price.\nA similarly hard bargain was strove for with Onana’s contract.\nUnited remain keen to continue their shift away from “awarding big basic contracts”, instead preferring to “incentivise deals and include more bonuses.” A five-year deal, with an option for a further year, would be agreed, with Onana set to earn close to £200,000-a-week; “double” his wage in Milan. It represents a bargain in comparison to the deal De Gea was on.\nUnited’s new goalkeeper was a constant source of enquiry during the deal. The Athletic reports Onana was “exciting tracking developments” and “asking for regular updates”. This desire to call Old Trafford home is paramount to what United are looking for in new signings. Mason Mount expressed similar sentiments during his transfer.\nWhile Onana will not wear the number one shirt next season exactly, instead preferring his long-standing ‘24’, Ten Hag has been reinforced with his number one. A goalkeeper with the profile, personality and pride to wear the United shirt, capable of functioning in a modern style of football.\nOnana is “determined to be the best goalkeeper in the world” and Ten Hag will be counting on this belief to become a reality at Old Trafford, next season and beyond. The goalkeeper will be pivotal to the next stage of United’s progression under the Dutchman.\nAnd it all began with a mishit volley by İlkay Gündoğan on his weaker foot at Wembley.",
  "word_count": 1008,
  "scraped_at": "2026-02-14T02:07:08.857345",
  "_text_extracted": true
}