{
  "article_id": "b6ad2c71882f",
  "url": "https://metro.co.uk/2026/02/01/mikel-arteta-dealt-injury-blow-arsenal-star-ruled-sustained-spell-26652492/",
  "title": "Mikel Arteta dealt injury blow as Arsenal star is ruled out for  sustained spell",
  "date": "20260201T174500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are expected to be without Mikel Merino for a ‘sustained spell’ due to a foot injury.\nThe Gunners bounced back from their disappointing 3-2 defeat to Manchester United to run out 4-0 victors over Leeds on Saturday, with Martin Zubimendi, Noni Madueke, Viktor Gyokeres and Gabriel Jesus all on target at Elland Road.\nBut having come on as a substitute against United, Merino was left out of Mikel Arteta’s matchday squad to face Leeds.\n‘He’s got an issue in his foot,’ Arsenal head coach Arteta told reporters when asked about Merino’s surprise absence.\n‘It’s a bone that’s giving him some pain, and we have some exams, we need some more specialists to look at it and to see how long he will be out.’\nAccording to the BBC, the Spain international is set for a ‘sustained spell on the sidelines’, which comes as a significant blow to the Premier League leaders at what is a crucial stage of the season.\nThe report claims the severity and exact nature of Merino’s issue will be made clear over the next 48 hours, with the midfielder likely to be missing for ‘a number of weeks’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWhile Merino was signed as a deep-lying midfielder by Arsenal back in 2024, the Spaniard’s versatility has proven invaluable for Arteta, with the ex-Real Sociedad man often filling in as a makeshift centre-forward.\nThe 29-year-old has scored four goals in the Premier League this season, while also netting twice in the Champions League.\nThere is also some concern surrounding Bukayo Saka’s fitness after the England forward pulled out of Arsenal’s clash with Leeds just moments before kick-off.\nArteta was unable to provide any clarity on the severity of Saka’s injury in warm-up but will no doubt hope to have the attacker back at his disposal for the second leg of Arsenal’s Carabao Cup semi-final with Chelsea in midweek.\n‘In the warm-up, he had a little niggle,’ Arteta explained in his post-match press conference.\n‘He wasn’t comfortable starting the game, so immediately we made a decision to make that change and bring Noni in. And he was ready, because you cannot do that in two minutes.\n‘The way he prepared, the way he’s waiting for opportunity, I think it paid off today because he really impacted the team.’\nMore Trending\nOn Arsenal’s rampant victory, the Spaniard added: ‘I’m very, very happy obviously.\n‘A very impressive performance, a very impressive result and in the context that we’ve done it.\n‘When you have the difficulty of the game and the opponent that we’re facing, with their recent form and the style of play that they have at the moment and the energy that the stadium brings, then the fact that after three results that didn’t go our way in the league, we really wanted to show how much we wanted it, and I think we’ve certainly done that today.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Premier League responds to Arsenal star Noni Madueke’s request after Leeds thrashing\nMORE: Chelsea make opening transfer offer to sign £43m defender\nMORE: Arsenal legend Tony Adams makes ultra confident Premier League title prediction",
  "word_count": 589,
  "scraped_at": "2026-02-14T01:50:01.807047",
  "_text_extracted": true
}