{
  "article_id": "b6b85dc2f617",
  "url": "https://english.aawsat.com/sports/5074297-japan-wants-host-2031-world-cup-fire-womens-football",
  "title": "Japan Wants to Host 2031 World Cup to Fire Up Women Football",
  "date": "20241024T080000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Japan wants to host the Women's World Cup in 2031 to ignite the domestic game and cut the gap on Europe and North America, the country's football chief told AFP.\nIn 2011 Japan won the competition but they have since been overtaken, with women's football booming in Europe in recent years.\n\"We would like to raise the value of women's football here,\" Japan Football Association president Tsuneyasu Miyamoto said in an interview at JFA headquarters in Tokyo, in front of a giant photo of Japan's World Cup-winning team.\nMiyamoto was captain of the Japan men's team when they co-hosted the World Cup with South Korea in 2002, a tournament that helped spark huge interest in football among the Japanese public.\nNow 47, he took over as JFA chief this year and has similar hopes for the 2031 Women's World Cup. The country has never hosted the event.\nJapan is likely to face stiff competition for hosting rights however with a joint bid from the United States and Mexico expected. England and China are also reportedly interested.\n\"We have the WE League, and it has been struggling to gather an audience,\" Miyamoto said.\n\"We would like to increase the number of women players here.\"\nThe professional women's WE League launched in 2021 but it has failed to attract anything like the attendances and revenue enjoyed by women's leagues in Europe and the United States.\nJapan's women have not gone beyond the World Cup quarter-finals since they lost to the US in the 2015 final.\nMiyamoto says Japan \"could have done better\" to capitalize on the 2011 triumph, which triggered massive interest in women's football before it quickly fizzled out.\n- 'No fear' -\nThe former defender wants Japan to develop a more passionate football culture all round, saying his stint with Austrian side Red Bull Salzburg \"inspired me a lot.”\n\"They have their own culture, they have football in their daily lives,\" he said.\n\"We haven't built that kind of community here in Japan. I'd like to make football our culture in Japan.\"\nMiyamoto played 71 times for his country, captaining the side at the 2002 and 2006 World Cups.\nHe spent most of his career in the domestic J. League, at a time when only a handful of Japan internationals played for European clubs.\nJapanese players are now all over Europe and the national team has benefitted as a result, regularly appearing in the World Cup knockout rounds.\n\"It's very normal for them to play in the Champions League,\" Miyamoto said of the current generation of players.\n\"When facing big teams like Germany or Spain... they have no fear.\"\nThe steady stream of players to Europe has helped Japan's national team but also posed problems for J. League clubs.\nMiyamoto says they need to keep producing talent but argues that \"transfer fees for Japanese players are low compared to players from South America.”\n- Art of the deal -\nBrighton paid just 2.5 million pounds to sign winger Kaoru Mitoma in 2021, while prolific goalscorer Kyogo Furuhashi joined Celtic for 4.5 million pounds the same year.\n\"In Europe clubs are very strong, but in Japan clubs are not that strong,\" said Miyamoto.\n\"Players who only have six months left on their contract are still playing in official matches. After the season, they will be free to go anywhere, and in that case, clubs can't get any money.\"\nMiyamoto wants to bring a new way of thinking to Japanese football.\nHe is a graduate of the FIFA Master sports executive program and also had a stint coaching J. League side Gamba Osaka.\nHe is the first JFA president to have played at a World Cup, and the youngest since the end of World War II.\n\"Former players, especially players who played at a high level, know how the football world works,\" said Miyamoto.\n\"Forty-seven is not young as a person. Talking about leaders of national organizations, maybe 47 is young.\n\"Maybe a new generation might be able to bring something new into this world.\"",
  "word_count": 673,
  "scraped_at": "2026-02-14T01:57:46.242092",
  "_text_extracted": true
}