{
  "article_id": "b6eaa1d59518",
  "url": "https://www.uefa.com/uefachampionsleague/news/0281-18096cb89d5d-7ee3fd883927-1000--highlights-report-city-ease-past-holders-madrid/",
  "title": "Man City 4 - 0 Real Madrid ( agg : 5 - 1 ): Silva double helps City ease into Champions League final at holder expense",
  "date": "20230518T010000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City 4-0 Real Madrid (agg: 5-1): Silva double helps City ease into Champions League final at holders' expense\nWednesday, May 17, 2023\nArticle summary\nBernardo Silva struck twice and Manuel Akanji and Julián Álvarez once each as Manchester City clinched a second UEFA Champions League final appearance with a resounding win against reigning champions Real Madrid.\nArticle top media content\nArticle body\nPep Guardiola's Manchester City produced a breathless attacking display to overpower holders Real Madrid in the second leg of their UEFA Champions League semi-final tie and set up a meeting with Internazionale in the Istanbul final.\nKey moments\n13': Courtois repels Haaland header\n21': Keeper denies City striker with stunning stop\n23': Silva caps neat passing move\n35': Kroos blasts effort against bar\n37': Silva nods in after deflected strike\n51': Ederson tips Alaba free-kick over\n73': Courtois pushes Haaland shot onto woodwork\n76': Éder Militão deflects Akanji effort into net\n90+1': Substitute Álvarez side-foots in\nMatch in brief: Silva showing sends slick City through\nMuch like the first leg in Madrid, Pep Guardiola's men looked to dictate the tempo and enjoyed the bulk of the early possession. With just seven minutes gone, Rodri flashed a low strike across the face of goal after an intricate display of passing from the hosts.\nJack Grealish and Erling Haaland were predictably prominent in the Cityzens' early forays into the Real Madrid area, and it was this combination which almost brought about the opening goal 15 minutes in. The England international floated a hanging cross into the area from the left of the box, which Haaland, nipping between two defenders, attacked with gusto, his downward header somehow kept out by Thibaut Courtois' reaction stop.\nThe Norwegian international brought the very best out of the Madrid goalkeeper again midway through the first half. Kevin De Bruyne's deep cross was nodded back across goal by Manuel Akanji, Haaland leaping above Eduardo Camavinga to plant a header towards the far corner. With most of the City of Manchester Stadium poised to celebrate the opener, the Belgian custodian somehow got his fingertips to the ball to divert it around the upright.\nThe City pressure did not waver and when De Bruyne threaded a clever pass through the Real Madrid back line for the run of Bernardo Silva, the Portuguese midfielder was able to exploit the space and guide an emphatic finish past the already-committed Courtois.\nLos Blancos had scored with their first effort on Ederson's goal in Madrid and almost repeated that feat, Toni Kroos' powerful right-footed effort from distance cannoning off the City crossbar following an exchange of passes between Karim Benzema and Vinícius Júnior.\nThat scare did not force the English Premier League leaders into their shell. Barely two minutes later and Silva kept his composure to send a looping header into the net after İlkay Gündoğan's low strike had deflected off the heels of Éder Militão.\nReal Madrid looked dangerous with the few sights of goal they did carve out, David Alaba's vicious, dipping strike from a free-kick out near the right forcing Ederson into an acrobatic one-handed stop.\nHowever, any comeback similar to last season's tie looked more remote with each passing minute, and instead it was Guardiola's men who appeared the most likely to get the third goal.\nHaaland's running battle with Courtois continued, the visiting keeper spreading himself to deflect the attacker's low strike onto the bar following Gündoğan's smart back-heel.\nFree-scoring City did manage to get their third with 15 minutes remaining. De Bruyne's searching free-kick was flicked on by Akanji, before deflecting into the net off the unfortunate Militão.\nWith the holders on the verge of bowing out, Benzema and substitute Dani Ceballos both tested Ederson in the closing stages, but the Brazilian international was not be denied a clean sheet.\nThere was still time for Julián Álvarez to add a fourth, linking up well with fellow City replacements Riyad Mahrez and Phil Foden before side-footing past the advancing Courtois to confirm Madrid's joint heaviest defeat in the UEFA Champions League and send City to Istanbul in style.\nPlayStation® Player of the Match: Bernardo Silva (Man City)\n\"He scored two important goals, provided great creativity but also tireless work for the team, with his ability to press and recover the ball.\"\nUEFA Technical Observer panel\nMatthew Howarth, Man City reporter\nCity were expected to enjoy prolonged periods of possession but, crucially, they were able to turn their first-half dominance into a two-goal cushion that proved insurmountable – even for this Madrid side. Guardiola's team adopted a more cautious approach in the second half but never relinquished control of the tie, Akanji's first City goal and Álvarez's late strike the icing on the cake in an immense display against the 14-time winners.\nGraham Hunter, Real Madrid reporter\nNot simply a bridge too far for Madrid – beaten by the better team here. Gradually, Real Madrid will begin to speak about how clever and tough City were to play against. You have to feel for Courtois – utterly superb on the night but for once it wasn't quite enough.\nRio Ferdinand, BT Sport\n\"You have to pay homage and respect when you see class, when you see top-level performers operating at this level. Pep Guardiola's got this side in formidable form just at the perfect time. They're purring now.\"\nReaction\nPep Guardiola, Man City manager, speaking to BT Sport: \"It was so painful last season [losing to Real Madrid in the Champions League]. People [talk about] lack of character in these players, but in one year we’ve shown how special a group of players these are.\"\nJack Grealish, Man City winger, speaking to BT Sport about the final: \"Every game we play, we try to dominate the ball. The manager in there is a genius and I’m sure he will tell us where we can hurt [Inter]. It will be a tough game. They have a lot of experience. You have to be a good team to get to a final and they are a good team, so you have to give them respect.\"\nCarlo Ancelotti, Real Madrid head coach: \"City played better and deserved to go through. They really pressed us at the start of the match, and that really made it difficult to build the play we wanted to. Getting into a deep analysis today isn't sensible. It's a painful loss. Very sore. But it can happen in football. You get to the Champions League semi-final and if a rival this strong plays better than you, then you're left without a place in the final.\"\nThibaut Courtois, Real Madrid keeper: \"I don’t think the way City started was a surprise to us, we were expecting a burst of pressure: that they wouldn't let us play out with the ball easily. We expected to be pressed back into our own penalty area. At half-time we were convinced we could turn the match around, but we weren’t crisp and clean with the passes, and that cost us.\"\nKey stats\n- Carlo Ancelotti took charge of his 191st match in this competition, surpassing Sir Alex Ferguson's previous landmark.\n- Man City have won their last 15 home matches across all competitions, scoring 53 goals in the process and conceding just seven.\n- Bernardo Silva became the third player to score twice in a Champions League semi-final match against Real Madrid, after Lionel Messi in 2011 and Robert Lewandowski in 2013.\n- Real Madrid suffered their joint-heaviest UEFA Champions League loss, having also been defeated 4-0 by Liverpool in March 2009.\n- Pep Guardiola has now reached his fourth Champions League final as a manager – only Ancelotti (five) has taken charge of more in the competition's history.\nFantasy star performers\nBernardo Silva – 17 points\nManuel Akanji – 13 points\nKevin De Bruyne – 9 points\nLine-ups\nMan City: Ederson; Walker, Rúben Dias, Akanji; Stones, Rodri; Bernardo Silva, De Bruyne (Foden 84), Gündoğan (Mahrez 79), Grealish; Haaland (Álvarez 89)\nReal Madrid: Courtois; Carvajal (Lucas Vázquez 80), Militão, Alaba, Camavinga (Tchouameni 80); Valverde, Kroos (Asensio 70), Modrić (Rüdiger 53); Rodrygo (Ceballos 80), Benzema, Vinícius Júnior\nWhat's next?\nManchester City are the nominal home side when they play Inter in the final in Istanbul on 10 June.",
  "word_count": 1376,
  "scraped_at": "2026-02-14T02:03:44.220223",
  "_text_extracted": true
}