{
  "article_id": "b6ee85a7d1f1",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=333425",
  "title": "adidas unveils the Official Match Ball for the FIFA Club World Cup 2025",
  "date": "20250201T033000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "adidas unveils the Official Match Ball for the FIFA Club World Cup 2025\n- Inspired by the tournaments host, the colourful design incorporates a striking red, white and blue colourway\n- The ball features adidas Connected Ball Technology enabling faster, more accurate officiating decisions\n- Available to purchase from tomorrow in adidas retail and selected retailers, and online at adidas.com football balls https://www.adidas.com/us/soccer-balls\nadidas Football has today revealed the Official Match Ball for the FIFA Club World Cup 2025. Played across 63 matches over 30 days, the ball makes its on-pitch debut when the tournament kicks off on June 14th and will be used by some of adidas biggest stars and global clubs including Real Madrid, Inter Miami, Al Ahly FC, Seattle Sounders, SL Benfica, Bayern Munich, CR Flamengo, Juventus, Boca Juniors, Ulsan HD and CA River Plate.\nThe design itself pays homage to the host nation, applying bold graphics and emblems that celebrate and connect to the USAs heritage. Against a pearlescent background, the ball features striking jagged-edged block patterns and deconstructed stars and stripes in red, white and blue representing the nations flag, alongside sliver accents and the official FIFA Club World Cup logo sign-off in white and gold.\nThe official match ball is engineered for greater accuracy in play by utilising PRECISIONSHELL a 20-piece panel shape with strategically placed debossed grooves on the balls outer shell. The shape was meticulously studied and tested in the lab and on pitch to assess the airflow over the ball, for maximum precision.\nPerformance benefits continue under the surface thanks to CTR-CORE - a system designed for accuracy and consistency in flight, by helping retain maximum shape and air retention to support fast, precise play.\nThe integration of adidas CONNECTED BALL TECHNOLOGY includes a suspension system in the centre of the ball hosting and stabilizing a 500Hz inertial measurement unit (IMU) motion sensor, providing unprecedented insight into every element of the movement of the ball. The sensor is powered by a rechargeable battery, which can be charged by induction.\nThe technology sends precise ball data to the VAR system in real time which when combined with player position data and by applying artificial intelligence, helps video match officials (VMOs) make faster offside decisions. Developed in close collaboration with Kinexon, adidas Connected Ball Technology can also aid VMOs in identifying each individual touch of the ball, resulting in less time spent resolving specific incidents, i.e. possible handball.\nSam Handy, GM adidas Football, said: We wanted to create a ball which pays tribute to the USAs infamous sporting culture and fandom. With this came a clear ambition to create something bold, loud, iconic, and unmistakably American. Its a true celebration of the host nation and were excited to see it perform on the worlds biggest stage this summer.\nThe Official Match Ball upholds adidas commitment to contribute 1% of net sales towards Common Goal, supporting initiatives that drive lasting social change for under-served communities, helping to create a better and more inclusive future through football.\nPriced at 160, the Official Match Ball is available to purchase from February 1st in adidas retail and selected retailers, and online at adidas.com football balls https://www.adidas.com/us/soccer-balls. The Official Match Ball that features Connected Ball Technology is only available for use at the tournament and will not be available in retail.\nNOTES TO EDITORS:\nAbout adidas\nadidas is a global leader in the sporting goods industry. Headquartered in Herzogenaurach/Germany, the company employs more than 59,000 people across the globe and generated sales of 21.4 billion in 2023.\nFor more information, please visit www.adidas-Group.com.\nAbout adidas in Football\nadidas is the global leader in football. It is the official supplier of the most important football tournaments in the world, such as the FIFA World Cup, the FIFA Club World Cup, the FIFA Womens World Cup, the UEFA European Football Championship, the UEFA Champions League & the UEFA Womens Champions League. adidas also sponsors some of the worlds top clubs including Real Madrid, Manchester United, Arsenal, FC Bayern Munich & Juventus. adidas is also partner to some of the best athletes in the game including Aitana Bonmati, Trinity Rodman, Vivianne Miedema, Alessia Russo, Lena Oberdorf, Mary Fowler, Wendie Renard. Leo Messi, Jude Bellingham, Mohamed Salah, Pedri, Lamine Yamal, Florian Wirtz, Paulo Dybala, Gabriel Jesus, Roberto Firmino, Joao Felix, Serge Gnabry and Manuel Neuer.\n( Press Release Image: https://photos.webwire.com/prmedia/8/333425/333425-1.jpg )\nWebWireID333425\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 753,
  "scraped_at": "2026-02-14T02:11:27.593076",
  "_text_extracted": true
}