{
  "article_id": "b6f1084f40cd",
  "url": "https://www.empireofthekop.com/2026/01/21/wyness-chiesa-liverpool-deadline-day-exit-claim/",
  "title": "Keith Wyness : Chiesa could leave Liverpool on deadline day",
  "date": "20260121T174500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The former chief executive of one Premier League club believes that a ‘fan favourite’ at Liverpool could viably depart Anfield before the end of the January transfer window.\nAhead of tonight’s Champions League visit to Marseille, Arne Slot’s attacking options have been replenished by the return of Mo Salah from the Africa Cup of Nations (AFCON), with Stephen Warnock and John Aldridge among those to welcome the 33-year-old’s resumption of service for the Reds.\nEven while the Egyptian was absent and Alexander Isak was injured over the festive period, though, Federico Chiesa was restricted to just a couple of starts, and reports from Italy have claimed that Juventus are ‘determined’ to bring him back to Turin.\nKeith Wyness: Chiesa could leave Liverpool in this window\nOn the latest episode of Football Insider‘s Inside Track podcast, Keith Wyness maintained that if Salah makes an immediate impact upon his return to Liverpool duty, the Anfield hierarchy could be prepared to sanction an exit for the Italian forward late in the transfer window.\nThe former Everton CEO said: “If [Salah] comes back after AFCON and he’s healthy, then I think Chiesa could move, so that will all happen before the end of the window. I think it will depend a lot on the Mo Salah situation. Chiesa has been a big Liverpool fan favourite and I know that.\n“I’ve been quite impressed with him. I’m still surprised he hasn’t been able to find his place in the squad, as for whatever reason Slot doesn’t seem to go for him.\n“I think Chiesa could move, but it will depend on the situation of other players. It would be one of the last-minute, last-day deals, but it could happen.”\nLiverpool must hold onto Chiesa until the summer at least\nAlthough Liverpool’s number 14 has been utilisied more frequently this season than last, it’s been evident for some time that Slot regards him as a backup player, with the Italian starting just two Premier League games in 17 months since joining the Reds.\nUnfortunately for the 28-year-old, he wasn’t able to make a significant impact when he was handed rare opportunities to start against Wolves and Barnsley over the past month, and Salah’s return from AFCON may well see Chiesa’s game-time diminish even further.\nDespite that, LFC would be wise to keep hold of the Italy international for at least the remainder of this season so that they’re not left with a frightening sparsity of attacking players, especially with Isak sidelined until March at the earliest.\nThankfully, The Athletic reported on Tuesday that Liverpool have ‘no appetite’ to offload him on loan, so it’d probably take a generous permanent offer for the Anfield hierarchy to even consider parting with him during the January transfer window.\nIt’s plausible that Chiesa could move on in the summer if he continues to feed off scraps under Slot, but hopefully our popular no.14 will remain on Merseyside for another few months and chip in with a few vital contributions, such as his late goal against Bournemouth on the opening night of this campaign.\nYou can watch Slot’s full pre-Marseille press conference below, via Empire of the Kop on YouTube:",
  "word_count": 529,
  "scraped_at": "2026-02-14T01:53:15.586916",
  "_text_extracted": true
}