{
  "article_id": "b6f5588cae56",
  "url": "https://www.themag.co.uk/2025/12/no-appetite-from-newcastle-united-owners-to-invest-in-this-or-process-has-been-shockingly-poor/",
  "title": "No appetite from Newcastle United owners to invest in this , or process has been shockingly poor ? ",
  "date": "20251226T170000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "No appetite from Newcastle United owners to invest in this, or process has been shockingly poor?\nAn ideal time in the heart of the festive season to get a snapshot of views from Newcastle United fans on how they think things are going.\nSo we sent out various questions to a small number of regular/irregular contributors to The Mag.\nAsking these Newcastle United fans some of the important questions of the day.\nAs well as some with a seasonal twist.\nHere we have Jamie Smith giving his answers:\nOne of the first acts of new Newcastle United CEO David Hopkinson, was to come out and announce that the club aren’t anywhere near deciding what will happen regarding a new stadium or expanded St James’ Park, never mind cracking on and getting it built. This despite the NUFC hierarchy having repeatedly in the past having indicated that an announcement was imminent. Your thoughts?\nFirst off, fair play to Hopkinson for fronting up and saying something.\nThe churn at boardroom level is undoubtedly a factor in this failure to launch, but it’s not the full story.\nThe ‘big six’ are coining in 2-300m a year more than NUFC and it’s unsustainable to keep challenging them for trophies and CL places unless we close that gap, for which the stadium is key. The fact we’re in year five and it’s still at the brainstorming stage, means either there’s no appetite from the Newcastle United owners to invest in this upgrade, or the process has been shockingly poor.\nThe vibe from this (David Hopkinson) meeting felt like a SJP upgrade, but even if it is a new ground, the situation with Euro 2028 suggests a five year wait minimum.\nMeanwhile it’s down to Eddie Howe to create alchemy to bridge that 200m+ gap and it may be brought into a harsh light if and when he can’t manage this any more.\nQuotes have been published today (Boxing Day) ahead of the Man U match, from his pre-match press conference earlier in the week, Eddie Howe actually saying some things that don’t instil confidence, such as he doesn’t see himself being manager when the stadium (and training ground) is completed and that he’s completely in the dark as to when there’ll be any progress, despite adding his voice to how important these developments are for the future of the club.\nI’ve got a season ticket so I don’t have the frustrations of those struggling with the ballots but I still feel the pain of others and see the importance of these developments for the club’s future. Unfortunately, I expect nowt any time soon.\nIf you could guarantee five NUFC players to be fit for the rest of the season (including all those currently unavailable), who would you choose and in what order?\nBruno – he’s been brilliant and a catalyst for everything good.\nBalance is needed so I’m going to say Hall, Wissa, Thiaw and Tonali, then you can sort of mix it up around that core.\nIf you could invite three current Newcastle United players to yours for a social gathering at Christmas, who would you invite and why?\nDan Burn – provided the greatest moment in NUFC history and he always seems good craic. He could run a quiz.\nBruno because he just radiates good vibes and Jacob Murphy, who has a life of the party aura about him and I just love him anyway.\nIf you could also invite three other football people, who have no direct connection to Newcastle United, who would you invite and why?\nPeter Crouch always seems like a smashing down to earth fella with a great sense of humour.\nI’d also definitely have Big Meeks as I like him and his infectious laughter would get everyone laughing at my jokes.\nI had better have Messi as well for a photo with my lad and maybe we can have a crack at persuading him to have a swansong season on Tyneside.\nWhat would have been a perfect Newcastle United Christmas present to unwrap?\nCan you unwrap consistency?\nI’d love to approach a game, especially away, without the fear of a repeat of the shocking performances at Brentford, West Ham and (ugh) Sunderland.\nIn 2025, what have been your five best Newcastle United moments?\nNumber one is Wembley, the best football memory of my life and one of the best overall days.\nSecond is the parade day, seeing the city come out and sharing it with friends and family in another example of pure happiness. Part of me wonders if this will ever be topped, even if I see United go on to achieve truly great things.\nThe win at the Emirates in the semi final comes third. First time I’ve seen us win there and real belief growing that we could take the cup. We booked our hotel for the final in a north London pub after the match.\nIt’s going to sound like I’m banging on about it now, but the second leg is fourth, one of the truly brilliant nights beneath the lights and a stellar performance to match the atmosphere.\nFinally I’m choosing Barcelona at home. Yes we lost but it marked a return to the Champions League in the second great achievement of the best season of my life, and a tremendous experience to take my little lad to see the opposition he’s always dreamt of.\nIn 2025, what have been your five worst Newcastle United moments?\nThere’s one that stands out, the ink is still wet on my report on spending an extended miserable afternoon in Sunderland.\nI’d put more of this season’s aways in there, as defeats to West Ham, Leeds and Brighton were all very poor and kept us mired in mid table.\nIt’s not shameful by any stretch either, but going from 1-0 up to 2-1 down against Arsenal was a gut punch, and indicative of the growing issue of chucking away leads.\nA knock on your door on Christmas Day, your place beautifully Xmas decorated, roaring fire, table laden with more food and drink than anybody could eat and drink. You open the door and freezing cold, snow bleaching down, which three cold and starving Newcastle United connected characters (past or present) would you still turn away?\nMike Ashley should be a stock answer, even though he does look like he knows how to have a laugh. The PSR handcuffs we wear are a direct result of his deliberate restriction of the club for his own interests, and his shadow will persist for years to come.\nJoey Barton has become one of those modern day caricatures, saying extreme things for clicks, likes and attention and I don’t want any fights at my Christmas dinner.\nFinally, Michael Owen can do one, judging from his recent TikTok video where his favourite bits of Christmas dinner are cauliflower cheese, rice cakes and wet lettuce, he wouldn’t enjoy the bait on offer at mine anyway.\nAssuming you don’t think that position has been reached already… what would it take for you to think Newcastle United needed to consider replacing Eddie Howe?\nHe needs and deserves this season, we are still competing on four fronts and the first two months of the year will tell us all if a course correction is on track.\nI would say that if the performances like the derby persist throughout and we don’t make the European places, the season will indicate a definite downward turn and questions need to be asked.\nAny managerial change should be at the start of a summer, both to allow choice from the best quota of potential replacements then give them the time to build for the new season.\nI wouldn’t be averse to giving Eddie another year regardless, as long as there’s a strong plan from day one of the summer.\nIf you were granted three New Year’s wishes to come true in 2026…\nIf it’s a big mad wish I can ask to win the Champions League, but I think I’ll keep it real, so here’s my three:\nNewcastle to win (at least) one of the domestic cups.\nThe summer to involve all first choice targets being obtained in good time for the season kicking off, and…\nNewcastle to be top of the Premier League when I sit and do this interview next Christmas.\nA poll on The Mag recently asked Newcastle United fans whether it would be success or failure, if this 2025/26 season ended with United mid-table in the Premier League, BUT having won the Carabao Cup again and reached the last 16 knockout stages of the Champions League. The vote ended up 60% of fans seeing that as success and 40% thinking failure. Your thoughts?\nMadness. Eleventh is obviously below where we should be, but the trophy is beyond the dreams of previous decades and as I’ve stated above, the income of the clubs we’re up against makes these achievements incredible. I can only think anyone voting ‘failure’ didn’t experience either Wembley or the parade day, which were absolute nirvana for the scarred hearts of Tyneside.\nAs an aside to this, I also feel that if we were to wind up on one of the lesser European competitions we’d have a very good chance of winning it and continuing to build momentum. The Conference League might be a very decent option.\nWhat are your best ever past Newcastle United Christmas time moments / memories. Could be any kind of memories – matches, presents, whatever?\nLast year was the best. The nine match winning run across three competitions from mid-December to mid-January supplemented a very merry Christmas.\nOther great memories would be top of the league in 2001 after wins at Arsenal and Leeds and returning from the World Cup break in 2022 to maintain our excellent progress and actually beat Bournemouth.\nIs it tenuous to include clicking with my future wife at a Christmas Party at Shearer’s in 2009?\nWhat are your worst ever past Newcastle United Christmas time moments / memories. Could be any kind of memories – matches, presents, whatever?\nAye cheers.\nToo many bad Boxing Day trips to the likes of Blackburn, Bolton, Liverpool that made me decide to just never travel on that day again.\nVeterans of 95/96 will remember that the post-Christmas defeat at Old Trafford would have title losing consequences although we didn’t know it at the time.\nHowever, the biggest heartache has to be the mackems winning here in 2014 – four days before Christmas, after United had probably been the better team, giving a rare decent account of themselves in a Pardew-era derby. The circumstances of this one actually make the other week seem tolerable by comparison.\nObviously it takes a ‘little’ bit of imagination but if there was a scenario where on the last day of a Premier League season… a Sunderland victory (against whoever) would mean Newcastle United qualified for the Champions League instead of Europa League BUT also meant the Mackems won the Premier League. What would you want to happen?\nI’ve touched on this already, but my belief is that a year in the Europa would be a positive for Newcastle United.\nI’ll just elaborate – I was desperate to clinch Champions League last year to cement our most successful season ever. I wanted the big games, the glory trips and the carrot to draw in top players to reinforce the squad. As it went, Alexander Isak still spoiled for his move and many top targets turned us down. I’m still buzzing to be in the big time and the riches it brings will be helpful PSR wise, but ultimately we’re happy participants in a competition we can’t realistically win, whereas Europa would mean we would be favourites for a very respectable trophy. Winning this would represent progress, so if it comes at the expense of a nightmarish Sunderland title win, send me to Estonia and Belarus.\nIn your lifetime, the five people associated with Newcastle United (anybody, on or off the pitch, inside or outside the club) who you would like to say thank you to and why?\nKevin Keegan is top of any of these lists. It was before my time when he came as a player to drag United out of Division Two but I’ve seen Auf Wiedersehen Pet. The turnaround of 1992 was jaw dropping and just in time for the Premier League gravy train and the way his team played was for the ages.\nI know he’s well thought of generally but I also think Rafa Benitez contribution to United is actually underestimated. I think Ashley might have just let it drift if we’d have got stuck in the Championship after the 2016 relegation, or made another one of his disaster appointments, but Rafa sticking around got us back up and into a steady position in the Premier League all while making a profit for the club. He was also the one who invited Amanda Staveley along for the first time and I believe it was her seeing the potential and refusing to be beaten that got the takeover through that finally rid us of Ashley.\nThe last few years have been brilliant but at board level it’s been chaos as we have cycled through sporting directors and chief executives while Riyadh adopts a difficult arm’s length approach. The only constant has been the alchemy of Eddie Howe, who has taken the remnants of the Bruce squad, a few mid-range players and the odd expensive luxury recruit and built a Champions League contender that delivered the trophy we have craved for generations. He deserves so much credit for progressing so fast in spite of the churn above him.\nFinally, I’m maybe looking ahead a bit but I’m going for Bruno Guimaraes. His obvious bind with Newcastle as a club and city is magnificent to see, and to have such a top player join us at a low ebb then become a figurehead for our rise and now a leader and advocate for all things Newcastle, is inspiring. I’m looking ahead because I’m hopeful the squad stability he pioneers can lead to him lifting a few more pots while captain of United.\nYou can follow the author on BlueSky @bigjimwinsalot.bsky.social\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 2392,
  "scraped_at": "2026-02-14T01:49:57.602846",
  "_text_extracted": true
}