{
  "article_id": "b70a11ea81aa",
  "url": "https://menafn.com/1109109936/Champions-League-Giants-Scrap-For-Knockout-Spots",
  "title": "Champions League Giants Scrap For Knockout Spots",
  "date": "20250120T201500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League Giants Scrap For Knockout Spots\nThere is no bigger game this week than Paris Saint-Germain against Manchester City, with two clubs who have transformed the face of football over the last 15 years at risk of early elimination.\nQatar-owned PSG and Abu Dhabi-backed City, the latter winners of the Champions League two years ago, have stumbled their way through this first season since the tournament's expansion.\nCity have taken just one point from their last three Champions League games and lie 22nd in the 36-team standings.\nPSG, semifinalists last season, are a point behind City in 25th place, and therefore in greater danger of going out given that only the top 24 advance to the knockout phase.\nThat would be deeply embarrassing for them, and particularly humiliating for Nasser Al Khelaifi, PSG's Qatari president.\nHe was instrumental in driving the changes to the Champions League as chairman of the influential European Club Association and a member of Uefa's Executive Committee.\n\"It is even stronger and that is what we like about it,\" Khelaifi said after the draw in August for the expanded competition, which now features 36 teams in one giant league, each playing eight games against different opponents.\nThe new format initially drew criticism. It was seen as a way of pandering to the demands of clubs like PSG and City to have more games and more revenue, while reducing the prospects of them going out early on.\nIt has not turned out that way, and PSG have been hampered by a difficult draw -- the hardest of any team according to statisticians Opta -- that has already seen them play Arsenal, Atletico Madrid and Bayern Munich, and lose to all three.\nIf PSG lose to City, they will be under severe pressure in their last game against Stuttgart on January 29, when 18 matches take place simultaneously.\nCity will similarly be in grave danger if they lose in Paris, although one win from their last two matches may suffice to reach the play-off round, with 10 points expected to be enough.\nReigning champions Real Madrid are also in a slightly uncomfortable position. They lie 20th with nine points having lost half their six games.\nGames against Red Bull Salzburg and French upstarts Brest should allow them to advance, but Real will likely also have to prepare for a two-legged play-off in February, as only the top eight progress directly to the last 16 in March.\nThe fixtures will pile up for these clubs, and the powerful trio mentioned above are among 12 European teams who will go to the first edition of Fifa's expanded Club World Cup in June and July.\nInter Milan, Borussia Dortmund, Bayern Munich, Atletico, Juventus and Benfica are also challenging for Champions League knockout berths while having the Club World Cup to come.\nContrast that with Liverpool and Barcelona, the only teams that have already guaranteed places in the knockout phase.\nThey both look set to skip the playoffs in February, and neither will be at the Club World Cup.\nThe consequences could be significant going into next season, when the clubs who have been able to give their players a full close-season break could have a big advantage.\nThis Champions League has created space for outsiders to impress, most notably Brest, who are poised to progress.\nThe top 14 places in the standings are nevertheless occupied by clubs from Europe's \"Big Five\" leagues in England, Spain, Germany, Italy and France.\nBut others, such as Club Brugge, Celtic and Dinamo Zagreb, are all in qualifying positions.\nCeltic, who last made the knockouts in 2013, could secure progress with a win at home to Swiss side Young Boys, who have lost every game and are bottom of the standings.\n\"I think we've done really well until this point, but we want to get over the line and into the knockout stages,\" said Celtic manager Brendan Rodgers on Saturday.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 711,
  "scraped_at": "2026-02-14T02:18:11.288906",
  "_text_extracted": true
}