{
  "article_id": "b71e334c7261",
  "url": "https://playingfor90.com/liverpool-premier-league-season-guide-preview-prediction-confirmed-transfers-01k13ge8r07e",
  "title": "Liverpool Premier League season guide : Preview , prediction & confirmed transfers",
  "date": "20250814T201500Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Reigning Premier League champions Liverpool are looking to retain an English top division title for the first time since 1984, but are Arne Slot's Reds the team to beat?\nWhat are Liverpool's confirmed transfers?\nLiverpool's arrivals\n- Florian Wirtz: Bayer Leverkusen - £116 million.\n- Hugo Ekitiké: Eintracht Frankfurt - £79 million.\n- Jeremie Frimpong: Bayer Leverkusen - £29 million.\n- Miloš Kerkez: Bournemouth - £40 million.\n- Giorgi Mamardashvili: Valencia - £25 million (deal agreed 12 months earlier).\n- Freddie Woodman: Preston North End - free transfer.\nLiverpool's departures\n- Trent Alexander-Arnold: Real Madrid - £8.4 million.\n- Luis Díaz: Bayern Munich - £65.5 million.\n- Darwin Núñez: Al-Hilal - £46.2 million.\n- Jarell Quansah: Bayer Leverkusen - £30 million.\n- Caoimhín Kelleher: Brentford - £12.5 million.\n- Tyler Morton: Olympique Lyonnais - £10 million.\n- Nat Phillips: West Bromwich Albion - £3 million.\n- Vítězslav Jaroš: Ajax - loan.\n- Owen Beck: Derby County - loan.\nPleased note: all information is correct as of the date of publication.\nWhat happened at Liverpool last season?\nRewind 12 months and most were forecasting a tough season for Liverpool, following the departure of Jürgen Klopp. Well, how wrong those predictions were, with Arne Slot storming the league in his first season in English football, the Reds cruising to the Premier League title, finishing ten points clear of Arsenal in the end, but that does not do justice the chasm that existed between the pair.\nThis was Liverpool's 20th league title, drawing level with fierce rivals Manchester United, seeking to become indisputably England's most successful club this time round. Whenever a team wins the Premier League, it is a successful season, but there is a feeling that the Reds left something on the table. They were beaten 2-1 by Newcastle in March's EFL Cup Final, not really showing up that day at Wembley. A few days earlier too, Slot's side had also been dumped out of the Champions League by eventual winners Paris Saint-Germain in the round of 16. Given that they finished top of the league phase, winning each of their first seven fixtures, this was very much viewed as a premature end to their European adventure. Thus, even as champions, there is room for improvement.\nHow will Liverpool do this season?\nLiverpool's season actually began with Sunday's FA Community Shield, but they were unable to collect a first piece of silverware to commence the new campaign. Despite goals from new signings Hugo Ekitiké and then Jeremie Frimpong, which saw the Reds lead twice, they were held to a 2-2 draw by Crystal Palace, rather hanging on towards the end. In the subsequent shootout, Mohamed Salah, Alexis Mac Allister and Harvey Elliott all missed from 12 yards, as Palace prevailed at Wembley.\nThis defeat should not concern Liverpool supporters too much though, given that most make them favourites to retain their title. In terms of outgoings, key figures Trent Alexander-Arnold and Luis Díaz have departed, while squad players Darwin Núñez, Caoimhín Kelleher, Jarell Quansah and Tyler Morton have all been sold for a decent profit. It would be remiss not to mention Diogo Jota, who tragically died in a car crash on 3 July along-with his brother André Silva. The club have retired his number 20 shirt, and whatever happens at Anfield this season, he will never be forgotten.\nMeanwhile, after hardly signing anyone last summer, the Reds have spent around £265 million already this year, a tally that could still rise. Jeremie Frimpong and Miloš Kerkez will be the new full-backs, while Florian Wirtz, arriving from Bayer Leverkusen for around £116 million, has the potential to become the best player in the Premier League. Giorgi Mamardashvili will challenge Alisson for the starting goalkeeper position while, in attack, £79 million has been spent to sign striker Hugo Ekitiké, who scored just four minutes into his debut at Wembley. They're not done there though, still interested in signing Alexander Isak from Newcastle, after an initial offer of £110 million was rejected.\nIn summary, Liverpool were, arguably, the best team in Europe already last season, and have recruited heavily during the summer, so have to kick off as favourites to go back-to-back.\nWhat is our predicted Premier League finish for Liverpool?\n- Our predicted finish for Liverpool in the Premier League this season: 1st.\nWhat are Liverpool's first 6 Premier League fixtures?\n- Bournemouth (H). Friday 15 August. Kick off 20:00 (BST).\n- Newcastle United (A). Monday 25 August. Kick off 20:00 (BST).\n- Arsenal (H). Sunday 31 August. Kick off 16:30 (BST).\n- Burnley (A). Sunday 14 September. Kick off 14:00 (BST).\n- Everton (H). Saturday 20 September. Kick off 12:30 (BST).\n- Crystal Palace (A). Saturday 27 September. Kick off 15:00 (BST).\nWhat are some other key dates for Liverpool supporters?\n- 27 August: Carabao Cup third round draw - taking place around 22:30 (BST).\n- 28 August: UEFA Champions League league phase draw - taking place at 17:00 (BST).\n- 1 September: The transfer window closes at 19:00 (BST).",
  "word_count": 839,
  "scraped_at": "2026-02-14T02:21:44.938033",
  "_text_extracted": true
}