{
  "article_id": "b73d4d797414",
  "url": "https://www.caughtoffside.com/2024/02/19/west-ham-join-arsenal-liverpool-in-the-race-to-sign-27-year-old-brazilian/",
  "title": "West Ham join Arsenal , Liverpool in the race to sign 27 - year - old Brazilian",
  "date": "20240219T093000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "West Ham United are reportedly keen on signing the Barcelona winger Raphinha at the end of the season.\nThe 27-year-old has been linked with a move back to the Premier League and a report via Fichajes claims that Arsenal and Liverpool have already expressed an interest in signing the player.\nBarcelona are going through financial limitations and they could look to cash in on the 27-year-old winger if a substantial offer is presented at the end of the season.\nIt is no secret that West Ham will have to improve their attacking options and they could certainly use a goal-scoring winger. The Brazilian has shown his quality in the Spanish league and the Premier League with Leeds United in the past. He could make an instant impact at West Ham and improve them going forward. He will add creativity, flair and goals from the wide areas.\nBeating the likes of Arsenal and Liverpool will not be easy. Both clubs have substantial financial resources and they are likely to be able to offer him Champions League football as well.\nLiverpool need a quality wide player if Mohamed Salah decides to move on at the end of the season. Raphinha could be a useful option for them. The opportunity to move to Anfield could be an attractive option for the player if Barcelona are prepared to let him leave.\nAs far as Arsenal are concerned, they need more depth in the attack. Mikel Arteta needs more options so that he can rotate the likes of Gabriel Martinelli and Bukayo Saka often. Raphinha is versatile enough to operate on either flank and he would be the ideal fit for Arsenal.",
  "word_count": 277,
  "scraped_at": "2026-02-14T01:51:19.058298",
  "_text_extracted": true
}