{
  "article_id": "b773005fe72e",
  "url": "https://www.arsenal.com/news/every-word-artetas-pre-man-city-presser-0",
  "title": "Every word from Arteta pre - Man City presser",
  "date": "20250131T193000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta was back in the press conference room at the Sobha Realty Training Centre on Friday afternoon as he spoke to the media ahead of our meeting with Manchester City on Sunday.\nWith the transfer window soon to close, he was asked about developments on that front, as well as the upcoming game against the reigning champions, the previous meeting this season and much more.\nHere is everything he had to say:\non the fitness of David Raya and Ben White:\nWe are still a bit uncertain. We have another session tomorrow and another 48 hours, so we have to wait and see. Ben is definitely out, hasn’t trained with us yet so is not going to be available. No other news from the game against Girona.\non Raya’s injury:\nIt’s a muscular issue so we have to wait and see.\non the rest of the transfer window:\nI’m very confident with the work that the club is doing and exploring every single opportunity that we believe can have an impact on the team. That’s certainly the case and if we can agree something we will. If not, we won’t.\non if it’s likely that we’ll be able to make a signing:\nWe are trying everything that we can, but I don’t want to give any reassurance or not. I don’t know, it doesn’t depend only on us, so our intention is clear but the possibilities are affected by three parties.\non if we have unfinished business and a point to prove against Man City:\nThe business is to be better than them. That’s it. The only thing I review is what happened during that match, how competitive it gets is normal when two big teams want to win the game. Nothing else from that side.\non how he reflects on our previous game with them:\nVery disappointed after everything that we did for 99 minutes but it is what it is.\non his comment about knowing about Man City:\nOf course I know because I was there for four years, so I know how competitive they are, how willing they are and how they can sustain that competitiveness regardless. They win and win again. That’s what I meant.\non if his relationship with Pep Guardiola has been affected:\nIf it had we wouldn’t have been on the phone talking to each other and messaging each other and deserving and willing to have the best. It wouldn’t happen.\non how the rivalry has developed between us and Man City:\nNormal. It's two teams trying to win.\non how decisive this result could be in the title race:\nIt would be a big boost for us. Winning big matches is always something special. Every time we play a big match against one of our big rivals it brings something extra - the confidence, the emotion, the fact that they are there and continue to win - for that we want to achieve.\non how confident we are about beating Man City:\nWith 11 men and 60,000 on every ball, right behind us pushing. Bring the energy, that’s what we want.\non a rumoured bid for Ollie Watkins:\nYou know I'm not going to talk about any individuals. As I said, we're actively looking productively to find a solution in that position and we'll see what the market brings.\non the referee’s importance on Sunday:\nHe needs to do his job the best that he possibly can, like each of us have to do. It is nothing new, nothing special. We're just going to focus on what we have to do from our side to be better than City and try to beat them.\non if Sunday is a must-win game:\nWe really want to win. Every game we have to on paper, it is that will.\non whether he has been surprised by Manchester City’s inconsistency:\nI don’t know but that’s the beauty of football. It’s not that simple and it's much more complicated than what you think in June, July or August.\non whether he wants an experienced player or younger one to come in:\nWe don’t really look at the market in those terms. We look at what we have in the squad, what we are lacking and what can really impact and bring something that potentially can make us much better, regardless of the age or sometimes the background that they have. It is a real belief that a player can be really good for us over time.\non if it’s a must we bring in a striker:\nIt doesn't depend on us. We have the intention, purpose and ambition to try to help the team and support the squad to be better and to finish the season really strong, and we are actively trying to do that.\non Ethan Nwaneri and Myles Lewis-Skelly’s progression:\nFirst of all, they earned the right for us to trust them, that’s certainly the case with those two. In pre-season we probably wouldn’t have projected how many minutes those two were going to play in the league and in the Champions League, probably we wouldn't be talking about the numbers that they have already achieved. That's again credit to them and everybody that is contributing to that, and if they continue to perform, they will continue to play.\non whether this result of Sunday's game could affect deadline day:\nThe result, no. Hopefully not but obviously if something happens that is not planned and puts the squad in a much more dangerous position, it might do. But that would mean that we hadn’t planned anything and we’re just reacting to something last second which is not good.\non if he knows if Guardiola feels City are still in the title race:\nI think is very obvious that it is yes, we don't have to discuss that!\non Erling Haaland’s comments to him after the game in September:\nI don't take anything personally, what happens on the pitch for me - and since I've been a player - stays there. It's full of emotions and things, and I just leave it aside and move on.\non Kai Havertz’s importance:\nHe’s been our main striker for a while now and he's producing some big numbers and his work-rate is unbelievable. Not only that but what we demand him to do in our model, his availability has been exceptional, so he’s always there and we are very happy to have him.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1104,
  "scraped_at": "2026-02-14T02:02:19.843104",
  "_text_extracted": true
}