{
  "article_id": "b773f194cc0d",
  "url": "https://thebusbybabe.sbnation.com/general/33114/afcon-troubles-await-for-man-united",
  "title": "AFCON Troubles Await For Man United",
  "date": "20251214T083000Z",
  "domain": "thebusbybabe.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What goes up must come down, and that’s certainly proven to be the case with Manchester United.\nAFCON Troubles Await For Man United\nAfter a shambolic start to the campaign that saw them lose to Arsenal, Grimsby Town, Manchester City, and Brentford, United enjoyed a perfect October by beating Sunderland, Liverpool, and Brighton. November would prove to be far less auspicious, with back-to-back draws at Nottingham Forest and Tottenham and a 1-0 defeat to 10-man Everton, followed by a 2-1 win at Crystal Palace. United would kick off December by taking the lead within the hour mark via Diogo Dalot, only to concede in the 83rd minute to West Ham’s Soungoutou Magassa and draw 1-1.\nThey did, however, manage to bounce back with a 4-1 win at a Wolves side that is enduring one of the worst starts to a season in Premier League history, with just two points from 15. United struck first via Bruno Fernandes, only to concede to Jean-Ricner Bellegarde before the interval, but they would restore their advantage after the break via Bryan Mbuemo before doubling the lead courtesy of Mason Mount, who thrived in the attacking trio alongside Mbuemo and Matheus Cunha. Diogo Dalot and Amad Diallo ran the show as an attacking wingback pair, Luke Shaw, Ayden Heaven and Noussair Mazraoui kept things tight at the back and assured Senne Lammens didn’t have much work to do, whilst Casemiro excelled in midfield alongside Fernandes, who sealed the deal from the penalty spot in the 82nd minute.\nAfter a fairly straightforward start to December, United look set for a busy holiday period that will see them host a Bournemouth side that has won twice and drawn twice in their last four meetings vs. United, and that is seeking a third-straight 3-0 win at Old Trafford. Next up, it’s matches vs. Aston Villa and Newcastle before taking on relegation-threatened sides Wolves, Leeds, and Burnley, followed by an FA Cup match vs. Brighton and a Manchester Derby on January 17, before finally getting a week-long break. There’s a good chance that United will be missing three key players for the duration (or majority) of this packed schedule, with Diallo, Mazraoui and Mbuemo set to take part in the upcoming 2025 Africa Cup of Nations, which will take place in Morocco between December 21 and January 18.\nUnited have yet to confirm whether or not the African trio will be available for Monday’s match vs. Bournemouth, but one thing’s for sure: all three of them have a great chance of remaining in Morocco until the very final weekend, be that the final or third-placed match. Mbuemo has been a constant headache for opposition managers in Africa, like Thierry Mouyouma, Stephen Constantine, and Vladimir Petković, emerging as a difference-maker in attack for Cameroon, whilst Mazraoui has become a vital cog in Morocco’s defense. Mazraoui and Mbuemo have made 35 and 27 senior appearances respectively, but whereas Mbuemo is entering his second major tournament after the 2022 FIFA World Cup, Mazraoui will be entering his third after the 2019 AFCON and 2022 World Cup.\nAs for Diallo, he has registered just 10 appearances for the Ivory Coast since making his international debut as an 18-year-old. However, after opening his competitive goal-scoring account with a goal and an assist in their final World Cup qualifier vs. Kenya, Diallo would play in last month’s friendlies vs. Saudi Arabia and Oman, and he’s set to compete in his first-ever senior tournament. Whilst the Ivory Coast are looking to defend their crown, both Morocco and Cameroon will be looking to improve on their Round of 16 exit in the last edition, and they’ll be counting on their United stars to deliver the goods on the continent’s biggest stage.\nBut just what exactly does this mean for Manchester United? A lot. Each of these three players has a unique, established role and responsibility in Ruben Amorim’s team, and if his replacements fail to step up, United could be inclined to bring in January reinforcements. With Benjamin Sesko still recovering from his knee injury, all signs point to Mount starting in attack alongside Cunha and Joshua Zirkzee in attack. Fernandes and Casemiro will continue to form the double pivot, whilst Dalot is expected to shift to the right flank to make way for Patrick Dorgu on the left. Over in central defense, Lisandro Martinez, and Leny Yoro will be vying for a place in the starting XI with Mazraoui gone, whilst Matthijs de Ligt and Harry Maguire are still working their way back from injury.\nThis temporary shortfall could very well throw a lifeline to Kobbie Mainoo, who, up until now, had appeared to be on his way out in the January window. Similar to other top-level players like Antoine Semenyo, Darko Gyabi, Jerome Opoku, and Callum Hudson-Odoi, Mainoo was raised in England to Ghanaian parents and rose through the Manchester United academy ranks before enjoying a sensational 2023 that saw him win the Jimmy Murphy Young Player of the Year award as well as make his first-team debut in an EFL Cup match.\n2024 was even better for Mainoo, establishing himself as one of the brightest young talents in Europe under Erik ten Hag, earning the praise of pundits like Danny Higginbotham and Kevin Egan, and proving integral in United’s FA Cup triumph and England’s run to the Euros Final. However, 2025 has seen Mainoo’s fortunes take a turn for the worse and making just 11 appearances (273 minutes) under Amorim this season. Whilst it looks increasingly likely that the two sides will look to part ways – at least on loan – in the winter window, United’s busy fixture list could very well give Mainoo more of the substantial minutes that he’s been looking for and force him to change his tune and stay put in Manchester.\nAll things considered, if United are to come away unscathed from the AFCON and continue their push for Champions League football, they’ll need every single one of their players to step up and start performing on a regular basis. First things first – can they extend Bournemouth’s winless streak to seven games and put an end to their recent woes vs. the Cherries?",
  "word_count": 1036,
  "scraped_at": "2026-02-14T01:52:59.296252",
  "_text_extracted": true
}