{
  "article_id": "b7a889d7ed85",
  "url": "https://www.arsenal.com/news/preview-arsenal-v-aston-villa-0",
  "title": "Preview : Arsenal v Aston Villa",
  "date": "20240413T171500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The relentless three-horse Premier League title race takes its latest twists and turns this weekend as high-flying Aston Villa arrive at Emirates Stadium on Sunday afternoon.\nWe have beaten Villa in five of the last six home meetings, and improving that record will be essential if we’re to remain on top of the table going into the final six matches of the campaign. However, the ask is much tougher this campaign this Villa side is easily their best in the past 15 years.\nUnai Emery’s side will be eying a league double at our expense to keep their dreams of participating in the Champions League for the first time alive, while we’ll turn our focus from our battles with Bayern Munich to ensure we remain at the front of the Premier League pack and continue to fight on both fronts.\nVilla’s form threatening top-four hopes\nA run of one win from their last five league games has put Villa’s European dreams in jeopardy, but while their current placing of fifth could still be enough to qualify, Unai Emery will have ambitions of climbing back into automatic qualification positions where they have been for the majority of an impressive campaign.\nA brilliant start saw them win 12 of their first 17 matches, including the 1-0 success at our expense in December, and meant Villa ended 2023 in second place. However four defeats since then saw them slip from title contention, and last week’s 3-3 draw against Brentford saw Tottenham Hotspur seize the all-important fourth spot.\nThe goals of Ollie Watkins have been vital, as he has netted a league-high 15 from open-play. He took his tally in all competitions to 25 when he opened the scoring in Villa’s Europa Conference League quarter-final win against Lille on Thursday night, as they take a 2-1 first-leg lead to northern France next week.\nWhat the managers say\nArteta on Villa: \"What they’ve done since Unai came in. He's made a huge impact at the club in terms of performances and consistency, it’s unbelievable what they are doing. They’re still in European competition and they played last night so its really impressive with what they’ve done.\n\"[Our momentum] is really good and we want to carry on going. It's the most beautiful part of the season coming up right now and a very busy schedule. We’re going to have a really tough [game] against a really good side, and are we going to have to be really good to beat them.\" - read every word of Mikel’s pre-match press conference\nEmery: “It’s different [to the previous meeting], completely different. We played at home here at Villa Park in December, compared to the match we are going to play on Sunday.\n“Something similar because there’s a lot of players again playing, fighting in those teams, but different because we’re playing at the Emirates, we’re playing as well in a different context, now they are fighting for the Premier League trophy.\n“We’re fighting behind them trying to keep our fifth position we have now and fighting with Tottenham. It's different as well because some players, of course, being injured are not going to play on Sunday.”\nTeam news\nOur only concern is Jurrien Timber who remains out with the knee injury sustained on the opening weekend of the campaign.\nAfter accumulating 10 yellow cards this term, Douglas Luiz is suspended which leaves Emery with a dilemma in midfield, as Boubacar Kamara is out for the season with an ACL injury and Jacob Ramsey has injured a toe.\nClement Lenglet has a knock while Matty Cash missed the last three games with a hamstring problem, but both returned to training this week and will be assessed. Tyrone Mings and Emiliano Buendia have both been missing virtually all season with their own major knee injuries.\nTalking tactics\nAdrian Clarke, writing in the official matchday programme: Emery likes his side to be set up in a 4-2-3-1, 4-4-1-1 or a 4-4-2, and no matter which shape he deploys they are usually tough to beat. Tactically, the Spaniard wants to congest the middle third, crowding space for opponents who want time on the ball. His back four will squeeze towards the halfway line, compacting space between the lines.\nThis helps them win turnovers and from there they have the power and pace to hurt you. By using twin strikers who are both quick and willing to run the channels, Villa are excellent at launching fast breaks. No Premier League side has produced more direct attacks than the Villans - look out for wingers Leon Bailey and Moussa Diaby whenever they launch those counters.\nEmery’s brand of high-octane, pressure football also limits the number of quality chances opponents can create. Facing an average of just 11.19 shots per match, only the current top three protect their own goal better than the Villans.\nHowever defending set pieces has been a weakness. They have leaked 14 goals from corners and free kicks this term, and only two clubs have let in more. With Arsenal so strong from set plays and outstanding in central midfield, these will be areas of concern for Emery.\nFacts and stats\nAston Villa are looking to complete just their third Premier League double over us, previously doing so in 1992/93 and 2020/21.\nOnly one of the last 16 league meetings between ourselves (11 wins) and Villa (5 wins) have finished level, with us winning four of the last five.\nAston Villa are unbeaten in their last nine league away games against London sides (W6 D3), having lost eight of their previous nine before this. It’s the Villans’ longest run without defeat in the capital in their league history.\nWe are unbeaten in each of our last 23 Premier League games following a European match, our last such defeat came against Man City back in February 2021.\nWe have won 10 of our last 11 Premier League games (D1), scoring at least twice in each victory. We have conceded just four goals across that spell.\nVilla lost 4-1 at Manchester City in their last away game, but haven’t lost consecutively on the road since May 2023. However, they’ve lost each of their three away games against last season’s top four so far by an aggregate score of 12-4.\nVilla have caught their opponents offside 142 times in the Premier League this season, more than 40 more than any other side. Meanwhile, only Man City (33) have been flagged offside themselves less often than the Villans (38).\nKai Havertz has been involved in nine goals in his last seven league appearances (5 goals, 4 assists). This is his most productive Premier League campaign for both goals (9) and assists (5).\nBukayo Saka has been involved in 11 goals in his last 11 league appearances, scoring nine and assisting two. One more goal would see him become the first English player to score 15 in a league campaign for Arsenal since Ian Wright in 1996/97.\nWatkins has been involved in 11 goals in his last 10 league games (9 goals, 2 assists), and seven in his last four away from home (5 goals, 2 assists). His 18 goals overall this season is the second most by an Aston Villa player in a single Premier League campaign, after Christian Benteke (19 in 2012/13).\nLeandro Trossard has eight Premier League goals this season, his joint-most in a single campaign. Four of these have been as a substitute, with only Olivier Giroud ever netting more from the bench for Arsenal in a season (6 in 2016/17).\nMatch officials\nDavid Coote will officiate his first Gunners game since the second week of the season when we won 1-0 at Crystal Palace, despite having Takehiro Tomiyasu sent off. That was one of six wins we’ve recorded in 10 matches he’s overseen.\nVilla are unbeaten in the three games of theirs he has been handed, including dismissing a player from each side during a feisty 2-1 win at Brentford in December. Those coupled with Tomiyasu’s early bath are the only red cards he has shown this season in 19 games in all competitions.\nReferee: David Coote\nAssistants: Tim Wood, Mark Scholes\nFourth official: Paul Tierney\nVAR: Peter Bankes\nAssistant VAR: Nick Hopton\nPrevious visits from Villa\nLast season saw us record our fifth straight win at the start of the campaign at the Villans' expense, with Gabriel Jesus opening the scoring before Douglas Luiz equalised straight from a corner. However the Brazilian magic continued when Gabriel Martinelli fired in on 77 minutes to claim a 2-1 success over Steven Gerrard’s team.\nThe campaign before saw us run out 3-1 victors thanks to goals from Thomas Partey, Pierre-Emerick Aubameyang and Emile Smith Rowe when Villa were under the management of Dean Smith, who had overseen their 3-0 win in November 2020 when Watkins bagged a brace - their only win in the last six visits.\nBefore then, a late comeback with goals from Calum Chambers and Aubameyang helped secure a 3-2 win in September 2019 in what was our opponents’ first game back at the Emirates since their relegation in 2015/16.\nTake a look back at five classic wins against Villa, including three 5-0 drubbings 24 years apart\nLive coverage\nTune in to Arsenal.com or the official app an hour before kick-off as Nick Bright and Adrian Clarke host our matchday show, packed with everything you need to prepare for the big game.\nThey'll be joined by Sky Sports Scenes’ Sharky and Specs Gonzalez, while Gooner Daniel Jillings joins us to talk about the launch of the British Sign Language GCSE and the use of BSL on matchdays at Emirates Stadium.\nFocusing on the game, Adrian will unpick the first leg of the Bayern fixture as well as look at the Villans to see where the match could be won or lost, before live commentary comes from Dan Roebuck and David Hillier.\nYou can also find out what broadcasters are showing the game wherever you are in the world\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1696,
  "scraped_at": "2026-02-14T02:25:26.762997",
  "_text_extracted": true
}