{
  "article_id": "b7cdcddab76d",
  "url": "https://www.arsenal.com/news/preview-arsenal-v-man-utd-0",
  "title": "Preview : Arsenal v Man Utd",
  "date": "20260124T153000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After four successive away games in different competitions, it’ll be a warm welcome back to Emirates Stadium for Mikel Arteta and his players when we face old rivals Manchester United on Sunday (4.30pm UK).\nDespite putting in the miles over recent weeks, we’ve extended our unbeaten run to 12 games as we fight on four fronts, and we’ll hope to keep that going against a United side once again reeling from another managerial departure, and winless in six against us.\nIn fact have won each of our last Emirates Stadium encounters against the Red Devils, which is the longest home winning run inflicted on United in the competition’s history. Having not tasted defeat in 16 home matches this term, our return to home comforts will be very welcome indeed as we aim to maintain our advantage at the top of the table.\nCaretaker Carrick\nRuben Amorim’s arduous 14-month reign ended three weeks ago following a 1-1 home draw against Wolves, with the Portuguese boss only victorious in 15 of his 47 Premier League games. Darren Fletcher’s three-game audition saw him also draw at Leeds United and Burnley, before they were knocked out of the FA Cup at home to Brighton.\nMichael Carrick was handed the job until the end of the season, and had an instant impression on his side as they dominated the Manchester derby to beat their rivals City 2-0 and move into fifth spot, having only lost one of their last 10 in the league.\nTheir 15th-place finish last term, coupled with the ignominy of a Carabao Cup second-round defeat by League Two side Grimsby and their FA Cup exit, means United will play just 40 games this season, their lowest total since 1914/15.\nWhat the managers say\nArteta: “Michael coming in will bring new ideas. Always, the intensity rises up. You could see that in the Manchester derby, the kind of behaviours and the game that they played, so we will expect a really tough match and we’ll adapt to that for sure.\n“At the end, the individuals are the ones that make the difference or the ones that make the game in a certain way and we're going to try to be ourselves, be very dominant like we always want to be, impose the game that we want to play and regardless of what they want to do, we want to take the game in the areas that are very good for us.” - every word from Mikel’s pre-match press conference\nCarrick: “I’m looking forward to the game. They’ve got so many strong points to [Arsenal’s] game, and to their squad. It’s a big challenge, they are where they are for a reason and where they are in the Champions League for a reason, so we’re fully aware of that and not taking that lightly at all.\n“We feel we’re in a good place and we’re looking forward to the game, so it’s where we want to be, with that real positive energy and enthusiasm, to go there and be positive, but for sure we know it's not going to come easy.”\nTeam news\nHaving been without Riccardo Calafiori and Piero Hincapie so far in 2026, Mikel Arteta will assess them in the final few days leading up to the game to see if they can feature in his matchday squad.\nMax Dowman remains out with his hamstring injury, while fellow academy product Ethan Nwaneri has joined Marseille on loan for the rest of the season.\nCarrick has a pretty full squad to select from, but Joshua Kirkzee is struggling with a knock which saw him sit out last weekend’s derby day win over Manchester City.\nMatthijs de Ligt is the only other injury concern, as the Dutch defender has been out since the end of November with a back injury, which is set to sideline him for a couple more weeks at least.\nTalking tactics\nAdrian Clarke, writing in the official matchday programme: Carrick’s Manchester United set up in a 4-2-3-1 against Manchester City, producing an impressive brand of fast, fluid, counter-attacking football. They only had a 32% share of possession, but by breaking up play with tremendous belligerence, they set up a series of dangerous breakaways, making six big chances. We can expect a similar tactical approach, who may look to target the flanks from those counters by deploying speedy wingers Patrick Dorgu and Amad Diallo.\nThe key takeaway from Carrick’s set-up against City was the vibrancy and desire his players showed in and out of possession. They applied an incredible 584 pressures – way above the norm - to unsettle Pep Guardiola’s men, while we must also be wary of switches of play or balls aimed towards their front three from deep areas. Over 15% of United’s passes against City were long.\nIt may have been a mixed bag from the Red Devils results-wise this term, but they always carry a goalscoring threat. Scoring in all but one away match (City away) they are the division’s third-highest scorers on 38, with their xG tally the second best on 40.61. Bruno Fernandes’ set-piece deliveries are usually top class, and with Harry Maguire back in the starting XI, they are sure to be dangerous from corners and wide free-kicks, having netted 11 times from them already.\nHolding onto leads has been an issue for United. Across their last 13 Premier League games they have drawn seven times, but on five of those occasions they gave up a winning position, while there is also some fragility in the air. Seven headed goals have been leaked this term, with only two top-flight outfits letting in more. Maguire’s return to the side will make them stronger though.\nFacts and stats\nThe last team to win five in a row against Manchester United in the league were West Bromwich Albion between 1976 and 1980.\nUnited are winless in their last six Premier League games against us – they’ve never gone seven in a row without a win against us in their league history.\nWe remain unbeaten at the Emirates Stadium this season in 16 games in all competitions, scoring 38 goals and conceding just seven.\nWe are looking to complete our fifth Premier League double over the Red Devils, but have only won both league meetings without conceding in 1901/02 in the second tier.\nMan Utd are winless in their last three league away games, and following a 2-1 win at Crystal Palace in November, they could win back-to-back league matches in London for the first time since October 2021.\nWe haven’t faced a single shot on target in our last two Premier League matches, the fifth time this season we’ve stopped our opponents from having one. It’s the most times a team has managed this since Chelsea in 2020/21 (5) and since 2003/04, only Man City in both 2017/18 and 2019/20 have done so more often in a season (6 in each).\nMikel Arteta has won 67% of his 12 Premier League games against Manchester United, the highest win rate of any manager to face them at least five times.\nMichael Carrick’s first and only Premier League victory in his previous stint as United manager came against us in a 3-2 win at Old Trafford in December 2021.\nEach of our last 11 Premier League goals at Emirates Stadium have been scored by different players, including three own goals.\nDeclan Rice has either scored (2) or assisted (1) in three of his five Premier League appearances against Man Utd for us.\nBruno Fernandes has created the most chances in the Premier League this season (62), while he also has the most assists (9). He ranks first for chances created both in open play (40) and from set plays (22).\nMatch officials\nThe man in the middle will be Craig Pawson, who has only been handed one of our matches so far this term - the 2-2 draw at Sunderland. That was the third match in a row we failed to win under his watch, which includes the 1-0 home loss to West Ham United in February last year when he sent off Myles Lewis-Skelly, and a goalless draw with Everton.\nWe had won on each of the previous seven occasions he had refereed us before then, including the 3-1 win over Manchester United in April 2022 when he awarded two penalties. That is the same amount as he’s issued all season so far from 12 outings, one of which was missed by Bruno Fernandes in a 3-1 loss at Brentford in Pawson’s only United game in 25/26. His average of just two cards a game is the lowest in the top-flight.\nRecent visits from Man Utd\nThe Red Devils’ league record at our home in recent years has been poor. Since winning 3-1 back in December 2017, United have failed to win any of their seven Premier League visits to Emirates Stadium, losing each of the last four in a row.\nThey did triumph on penalties 12 months ago after a 1-1 draw in the FA Cup third round when Fernandes cancelled out Gabriel’s opener, but a month before Jurrien Timber and William Saliba netted to hand us a 2-0 success.\nIn September 2023, stoppage-time goals from Declan Rice and Gabriel Jesus clinched a famous 3-1 victory, while another dramatic game occurred nine months earlier when we again tasted late success with a 3-2 win via an Eddie Nketiah brace - including a 90th-minute winner - and Bukayo Saka’s wonderful long-range strike.\nLive coverage\nFor a big-match feel, tune into Live From N5 an hour before kick-off when Nicole Holliday and Jeremie Aliadiere will be joined by Gunners legend Alex Scott.\nA genuine Arsenal legend will be crowned our Hero of the Week, while Nicole and Jeremie put forward their cases for our latest Live from N5 Hall of Fame induction.\nOur supporters in the studio are put to the test in Arsenal Mastermind and Time Capsule, before live kick-by-kick commentary is provided by Dan Roebuck and Adrian Clarke.\nYou can also find out which broadcasters are showing the action live wherever you’re watching in the world.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1717,
  "scraped_at": "2026-02-14T01:55:32.912882",
  "_text_extracted": true
}