{
  "article_id": "b7d4c629d221",
  "url": "https://www.aol.com/finance/barcelona-legend-gerard-piqu-thinks-060000979.html",
  "title": "Barcelona legend Gerard Piqué thinks he created the perfect sport for Gen Z falling attention span",
  "date": "20250227T110000Z",
  "domain": "aol.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona legend Gerard Piqué thinks he’s created the perfect sport for Gen Z’s falling attention span\nGerard Piqué, the highly decorated former Spain, Barcelona, and Manchester United footballer, has many reasons to love the sport. The three-time Champions League winner and World Cup champion made millions playing at the peak of the game with some of the greatest players of all time, including Lionel Messi.\nBut, much like the Gen Z audience he has captivated with a breakaway sport, he has grown tired of the game that made him a multimillionaire.\nAs a response, Piqué founded the Kings League, a sport probably unfamiliar to many of the fans that followed the Barcelona legend growing up, but is fast becoming a hit with attention-deficient, younger viewers.\nWhat is the Kings League?\nIt felt appropriate to be speaking with Pique at London’s Twickenham Stadium, the home of England Rugby and the host of the English leg of the global Rugby Sevens tournament. That represents a niche version of the 15-a-side game, with fewer players and much shorter games.\nPiqué, however, had other sports on his mind when creating the Kings League.\nA Kings League game starts like a water polo match, with a ball in the center and players beginning at the goal line, rushing to gain possession when the whistle blows. Each team starts with one outfield player and one goalkeeper before players are gradually called into the game to make a seven-a-side matchup.\nThere are other zany rules, like an orange ball replacing a white one in the final phase of the match.\nSix games are played through the day on Sunday, similar to how American sports cannibalize a schedule. The Kings League’s female equivalent, the Queens League, plays through a Saturday.\nInternet influencers, mainly Twitch streamers, are the team’s managers, selecting players through a U.S. franchise-style draft process.\nThe league has leveraged some of the biggest influencers in Spain, its original market, to grow its audience. That includes Ibai Llanos, a streamer with more than 17 million followers on Twitch, who runs Porcinos FC.\nFormer players, including ex-Manchester United star Javier “Chicharito” Hernández and former Real Madrid midfielder James Rodriguez, also manage teams.\nThe whole concept of the King’s League, from its shortened games to influencer managers, is handcrafted to appeal to the 18-35 demographic. Speaking at the Leader’s Week London, Piqué described the format as “football with a video game.”\n“Sport is not only competing against other sports. They are competing against Netflix, HBO, and Amazon. They are competing against Twitter, Instagram, and TikTok. And for kids, those are much more exciting right now,” Piqué said.\nThe Kings League might have found the balance needed to appeal to a young audience. Around 85% of the King’s League’s audience is under 35.\nDriving popularity in the King’s League is what Piqué views as an underlying exhaustion with the evolution of football.\nIndeed, Piqué grew tired of football as he approached the end of his career, both physically and psychologically. On the physical side, growing fixture congestion in the traditional game to satisfy broadcaster demand has caused a heavy strain on players, Piqué included.\nFrom a psychological side, Piquée has increasingly struggled to watch a game for 90 minutes, something he shares with his younger audience.\n“I think that 90 minutes is long, and this is why we try to reduce our games.”\n“It's impossible that you go to a stadium for 90 minutes and the game finishes 0-0. Conceptually, you cannot understand that, but it's happening in traditional football.”\nThe money behind the Kings League\nPiqué appears to have seen with his own eyes a trend that has begun to grip Gen Z. A YouGov sports whitepaper from 2023 found just over 30% of 18-24 year olds would watch sports live on TV, compare with around 75% of those over 55. Instead, younger audiences are much more likely to consume sports content on social media, after an event has happened, and, as Piqué points out, play video games.\nSeveral traditional football clubs have now embraced TikTok to grow interest in their audience, and have begun offering highlight reels while getting their players to engage in viral trends. The Kings League is a culmination of all these shifting habits.\nStill, trying to appeal to a young audience is a rocky conquest. They have less disposable income than their elders and often spend their parents’ cash at their discretion. The Kings League is also free to air on streaming channels, meaning they aren’t benefiting from the mammoth TV deals gained by traditional leagues like the English Premier League.\nHowever, there have been some early financial wins for the burgeoning league.\nThe drawn-out nature of a Kings League event meant supporters broke the record for food and beverage sales at La Liga side Atletic Madrid’s stadium, often from kids dragging their parents along to the youth-focused event.\nAnd while younger audiences won’t spend the same as their parents, the Kings League’s youthful demographic represents a goldmine for advertisers. A majority of the group’s revenue comes from companies keen to obtain younger audiences who can grow with them as they build income in their later years.\nThe group has also managed to avoid directly paying many of those involved. Influencers monetize the streaming channels they create for their leagues, which attracts knock-on advertisement deals from companies backing the Kings League.\nThe players, meanwhile, are of relatively low quality, meaning they don’t command high salaries from the league.\nFrom footballer to founder\nPiqué founded the Kings League not long after an acrimonious retirement from his boyhood club F.C. Barcelona, where he was pressured to leave owing to his outsized salary as the club suffered a financial crisis.\nThe Catalonian knew he needed to begin thinking about a life away from football, and consulted his retired former teammates on what awaited him.\n“They told me: Gerard be ready, because you change your whole routine,” he said of conversations with ex-teammates.\n“For 10 years, you're doing the same, and all of a sudden you're not training anymore in the mornings. So I said, Well, I have to be ready. Let's create something so that I can be busy.”\nHe picked the business world, and it’s a far cry from his time at the top of European football.\n“I would say that my day is a normal day as a guy who created the company and wants to make it work,” Pique says. He will start his day in the office around 9:30 am and work until 6 or 7 pm, with the occasional dotting of travel to meet business partners.\nSwitching to the office has had its other adjustments, notably the relationship with colleagues.\n“I was a professional [footballer] for 20 years. I would say that the atmosphere there was different than the one in the office, because the relationship that you have with your teammates, you spend a lot of time with them. I mean, you have showers with them, you share everything.\n“Here in the office is different, but in a way, you have the same objective, which has to be to grow the company, to arrive at any part in the world, to do the expansion as quick as possible.”\nIn October, the King’s League appointed Djamel Agaoua, former NBA Managing Director in Europe and Middle East, as its CEO in a sign of its ambitions to expand beyond Europe and Latin America and into the U.S.\nDespite years of leadership on the pitch, the mantle of CEO wasn’t something Piqué was keen to take on with the Kings League.\n“I think we are a team, and everyone is good at doing something. You have to figure out what it is and try to make the effort that you can in order to make the company succeed. I'm the founder. You can name it, it doesn't matter.”\nEditor's note: A version of this article was first published on Fortune.com on November 16, 2024.\nThis story was originally featured on Fortune.com",
  "word_count": 1337,
  "scraped_at": "2026-02-14T01:52:15.326375",
  "_text_extracted": true
}