{
  "article_id": "b80c6d893dea",
  "url": "https://www.90min.com/posts/why-erling-haaland-deserves-beat-lionel-messi-win-2023-ballon-dor",
  "title": "Why Erling Haaland deserves to beat Lionel Messi & win 2023 Ballon dOr",
  "date": "20231025T013000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why Erling Haaland deserves to beat Lionel Messi & win 2023 Ballon d'Or\n- The 2023 Ballon d'Or winner will be announced on Monday 30 October\n- There are 30 nominees for the award including the likes of Lionel Messi and Kylian Mbappe\n- Erling Haaland may feel hard done by if he misses out on a first Ballon d'Or given his fantastic campaign\n“I always said that the Ballon d'Or had to be two sections: one for [Lionel] Messi and one for the others,” said Manchester City manager Pep Guardiola when quizzed about the potential winner of the 2023 award.\nMessi is undeniably the frontrunner after a year in which he finally lifted the previously elusive World Cup trophy aloft. The diminutive Argentine is looking to add an eighth trophy to his mantelpiece and there are few candidates capable of denying him the award.\nHowever, one of those with the capacity to stop the former Barcelona star is Erling Haaland.\nThe Norwegian colossus enjoyed a record-breaking debut campaign in Manchester, finishing the season with bucketfuls of individual and collective silverware. Haaland dominated defences across the Premier League and Europe, putting up Messi-esque numbers that propelled City to legendary treble-winning status.\nIt's not going to be easy to dethrone Messi this year given this is likely the 36-year-old's final shot at another Ballon d'Or, but there can be no complaints if Haaland does usurp the Inter Miami forward on 30 October.\nHaaland's goalscoring numbers\nAny Haaland sceptics that predicted a slow, Timo Werner-style start to the former Borussia Dortmund striker's Premier League career were emphatically humbled last season.\nHaving been rather naively written off by certain sections of the social media sphere after a disappointing Community Shield performance, the 6'4 centre-forward wasted no time in making a mockery of his doubters.\nHaaland netted 15 goals in his first ten Premier League matches, including three hat-tricks, while also scoring five in his opening three Champions League matches. While the 23-year-old did slow down somewhat by his incredibly lofty standards towards the end of last season, he finished the campaign on an astonishing 52 goals in 53 matches for City.\n36 of these came in just 35 league matches, breaking the record previously held by Mohamed Salah for most goals in a 38-game Premier League season. When you consider that he also produced nine assists for teammates, that's a staggering 61 goal contributions - an average of 1.17 per appearance.\nWhile Messi did produce 41 goal contributions in as many games for Paris Saint-Germain last season, the competitiveness of Ligue 1 pales in comparison to that of the Premier League.\nHaaland's trophy haul\nGuardiola has arguably forged this Man City team into the greatest there has ever been in English football, but the Spaniard needed a Champions League trophy to back it up. After years of heart-breaking exits, he finally succeeded in doing what he was brought to the Etihad to do.\nThere had long been accusations that Guardiola was unable to win the Champions League without Messi, but Haaland, among others, helped dispel that particular theory when City beat Inter 1-0 in last year's final.\nHaaland contributed 12 Champions League goals in just 11 matches last term, including five in just 63 minutes against old Bundesliga foe RB Leipzig in the last 16. The 28-cap international also scored home and away in the quarter-final against another familiar nemesis in Bayern Munich, with his consistency in front of goal proving invaluable.\nClaiming the Premier League title, despite always seeming somewhat inevitable, was not straightforward for City. Arsenal's resurgence under Mikel Arteta pushed the Cityzens all the way and things could have been an awful lot different without Haaland's glut of goals from the opening game to the final weeks of the season.\nThere was, of course, an FA Cup triumph too, rounding up a remarkable treble for Guardiola's men. While he was rested on several occasions in the opening rounds, Haaland produced a hat-trick against Burnley in the quarter-final and played the entirety of City's 2-1 final victory against local rivals Manchester United in early June.\nHaaland's international inferiority\nThe driving force behind Messi's 2023 Ballon d'Or bid is his World Cup success in December 2022, thrusting Argentina to global dominance during the tournament in Qatar. However, it was a different winter period for Haaland.\nNorway failed to qualify for the 2022 World Cup, leaving one of the world's finest strikers stuck in Manchester while the majority of the planet's finest footballers jetted off to Asia.\nIt always seems harsh to overlook players based purely on international achievements when it comes to individual awards, especially given a significant number of players represent nations who will never challenge for the biggest prizes.\nNorway have only qualified for the World Cup three times before, having never done so in the 21st century, so it's unfair to judge Haaland's worthiness of an individual award on international performances given his nation's lack of firepower on the world stage.\nSince the turn of the century, very few players have won the Ballon d'Or that don't represent powerhouse nations in international football - arguably only Andriy Shevchenko of Ukraine and Pavel Nedved of Czechia.\nNorway's lack of presence at major tournaments puts Haaland at a natural disadvantage, but it may be a little unjust to inflict a handicap on Haaland as a result of his country's international inferiority.",
  "word_count": 900,
  "scraped_at": "2026-02-14T01:56:32.770774",
  "_text_extracted": true
}