{
  "article_id": "b81eec29515d",
  "url": "https://www.france24.com/en/live-news/20240427-ten-hag-pleads-for-patience-after-man-utd-blow-lead-again",
  "title": "Ten Hag pleads for patience after Man Utd blow lead again",
  "date": "20240427T211500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ten Hag pleads for patience after Man Utd blow lead again\nManchester (United Kingdom) (AFP) – Erik ten Hag pleaded with fans to stay patient after misfiring Manchester United yet again blew a late lead against relegation-threatened Burnley at a disgruntled Old Trafford on Saturday.\nIssued on:\nBrazilian winger Antony put United ahead in the 79th minute but substitute Zeki Amdouni scored from the spot eight minutes later after being fouled by Andre Onana.\nUnited, in sixth place in the Premier League, are scrapping for Europa League qualification after dropping out of the race for Champions League places.\nNext month's FA Cup final against Manchester City offers a chance to end a poor campaign on a high but that may not prove enough to keep Ten Hag in the job under ambitious new co-owners INEOS.\nBoos greeted the final whistle at Old Trafford. Earlier they echoed even louder when Kobbie Mainoo was replaced by Scott McTominay as part of a second-half double switch in which Rasmus Hojlund was also taken off.\nUnited's habit of throwing away winning positions has cost them dear in recent weeks and Saturday's match followed a familiar pattern.\nBut Ten Hag defended his substitutions and called for cool heads, saying he needed to protect young players from injury.\n\"We have some very young players and that's why we built this club back,\" said the Dutchman. \"That takes time, and we build this by bringing in young players.\n\"Rasmus Hojlund, Alejandro Garnacho, Kobbie Mainoo -- they are all in the first season of the Premier League and the Premier League gets more intense year by year.\n\"We have seen the data and it's much more intense than last season, especially when you see over the last four or five seasons. Those players have to adjust and that takes time.\"\nTen Hag, who won the League Cup last year in his first season with the club, said he was \"sorry for everyone\".\n\"I am very impatient but there we need patience and fans they need patience,\" he said. \"We built here a team, and they need experience.\n\"The mental (side), when you get fatigue you have to keep focus until the end.\n\"Also, this season there was an extra effect that they do extra time (added on). It is often seven, eight, nine, 10 minutes so bringing more minutes in the game, to keep tempo in the game as well.\"\nTen Hag believes the benefits of this bumpy season will be evident in the years to come.\n\"The great Manchester United team, we forget they were also built,\" he said. \"I have seen I think in 2004/05 they also didn't play that great football.\n\"They were building, and it takes time, but everyone forgets, even the players who were by that time in the team, they forget they were struggling and that they needed time to progress.\"\n© 2024 AFP",
  "word_count": 482,
  "scraped_at": "2026-02-14T02:13:49.315220",
  "_text_extracted": true
}