{
  "article_id": "b8203e91461e",
  "url": "https://www.90min.com/posts/how-liverpool-can-solve-midfield-problems-crystal-palace",
  "title": "How Liverpool can solve their midfield problems against Crystal Palace",
  "date": "20230223T210000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How Liverpool can solve their midfield problems against Crystal Palace\nBy Euan Burns\nThere had been a recent upturn in the mood at Liverpool after back-to-back victories against Everton and Newcastle in the Premier League. That all came crashing back down again on Wednesday night.\nJurgen Klopp's side found themselves 2-0 up inside the first 14 minutes in their Champions League round of 16 first leg at Anfield against Real Madrid. By half-time, it was 2-2. By full-time, it was 5-2 in favour of the Spanish visitors.\nIt was a stark reminder that this Liverpool side right now is a long, long way from the top level of European football. That is hard to take considering they were deservedly in the Champions League final last season, only narrowly losing to the same opponent.\nThe position that many have been primarily blaming for the poor form all season is the midfield. Players such as Fabinho and Jordan Henderson have seen their levels drop severely and they are of an age where that can be a serious concern, as there is not always a guarantee it will come back.\nHere is a look at the Liverpool midfield and how Klopp could try to shake things up.\n- Liverpool's 30-player squad: Keep, sell or loan this summer\n- Liverpool & Everton each fined over Merseyside derby incident\nWho featured in the Everton and Newcastle wins?\nThe curious issue Klopp needs to think about is that the same midfield three started the victories against Everton and Newcastle in the Premier League and the defeat to Real Madrid. It was Henderson, Fabinho and Stefan Bajcetic, who has been the bright spot in a very dark campaign.\nIt would be fair if Klopp decided the Real Madrid match was a special case and played the same midfield three again against Crystal Palace on Saturday. It was clearly working in the two Premier League games prior.\nIf he feels the need to alter the team, though, there is no one in the Liverpool squad that you would back to come in as a straight swap and do a better job. Naby Keita has had plenty of chances and continually failed. Arthur Melo is unproven so is worth a go, but past evidence suggests that even if he does play well, he won't stay fit for long enough for it to matter.\nIt is not clear how James Milner would make a long-term difference if swapped into the midfield three, and Harvey Elliott is better suited in a more forward role.\nA possible change of shape for Liverpool?\nThat lends itself to a change of shape. Now that players like Diogo Jota and Roberto Firmino are back from injury, there is an abundance of forwards to choose from. That lends itself to a move away from the midfield three given two-thirds of it are not performing consistently.\nAssuming Bajcetic is now considered undroppable, Klopp could move back to a 4-2-3-1 which he has used before. That could allow him to have Mohamed Salah on the right, Darwin Nunez on the left, Cody Gakpo up front and then Firmino or Jota just behind the Dutchman. All of those players are versatile.\nHe would then need to drop one of Henderson and Fabinho and use a midfield two. That would concern some fans given the team's poor defensive record, but Bajcetic and Henderson/Fabinho could sit much deeper than in a conventional 4-2-3-1.\nThat leaves a lot of space between the attack and the midfield/defensive unit, but Liverpool have so much pace and so much counter-attacking ability it could be the best way to play to their strengths.\nThis might not stop Liverpool from conceding so regularly, but they have often been at their best when they are simply trying to outscore teams. They're eighth in the Premier League and all but out of the Champions League. Klopp may as well go for it rather than just waiting to see if something changes.\nPlaying away from home against a fairly positive side like Crystal Palace could be the ideal stage to try and get four attackers on the pitch to spring from deep after soaking up some pressure.\nOn this week's edition of TFP, Chelsea legend Joe Cole joins Harry Symeou, Grizz Kahn, Scott Saunders and Hunter Godson to discuss all the UEFA Champions League action from midweek, as well as look ahead to this weekend's biggest fixtures.\nIf you can't see this embed, click here to watch the video!",
  "word_count": 749,
  "scraped_at": "2026-02-14T01:59:41.701073",
  "_text_extracted": true
}