{
  "article_id": "b825da585f9e",
  "url": "https://krdo.com/news/2025/12/09/how-one-extraordinary-interview-caused-liverpool-great-mohamed-salah-to-fall-out-with-the-club/",
  "title": "How one extraordinary interview caused Liverpool great Mohamed Salah to fall out with the club",
  "date": "20251209T171500Z",
  "domain": "krdo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How one extraordinary interview caused Liverpool great Mohamed Salah to fall out with the club\nBy Ben Church, CNN\n(CNN) — Mohamed Salah is not only in the argument of being Liverpool’s greatest player of all time, but he’s also been one of the best in the world over the last decade.\nHe has been a catalyst of Liverpool’s recent success, winning two Premier League titles, one Champions League and one Club World Cup during his historic nine-season stint.\nSalah, Liverpool’s all-time top scorer in the Premier League, has also built an emotional bond with fans and the local community, with murals of his face dotted around the stadium and city.\nIt should therefore be almost impossible for such a legend, in the twilight of his career, to fall out so dramatically with a club he’s given his best years to.\nBut, after an extraordinary interview given to reporters after Liverpool’s 3-3 draw against Leeds on Saturday, that’s exactly what has happened.\nWhat did Salah say?\nThere had been rumblings of a fallout for quite some time.\nLast season, before Liverpool clinched the Premier League title, it was unclear whether Salah would be given a new contract at the club, sparking months of speculation which strained the once unbreakable relationship.\nThe decision to hand Salah a new contract at the end of last season, though, appeared to put an end to rumors of a split. But, seven months after putting pen to paper, the relationship now looks somewhat unsalvageable.\nTo understand the fallout, one must first see it in context of Liverpool’s disastrous season so far. Many had expected the reigning league champion to push again for another title, but the club currently finds itself 10th in the table having lost six of its 15 league games this season.\nSalah’s form has also suffered to the point where he’s now not being named in the starting lineup. Where once Liverpool looked to Salah to rescue it from a poor run of form, he’s now being overlooked.\nThat, it appears, has been hard for Salah to swallow.\n“I’m very, very disappointed to be fair. I have done so much for this club down the years and especially last season,” Salah told a somewhat stunned media scrum outside the stadium, after being an unused substitute in Liverpool’s game against Leeds on Saturday.\n“Now I’m sitting on the bench and I don’t know why. It seems like the club has thrown me under the bus. That is how I am feeling. I think it is very clear that someone wanted me to get all of the blame.”\nNot content with that bombshell, Salah also took aim at Liverpool’s hierarchy at a time when manager Arne Slot is starting to face uncertainty around his position at the club.\n“I got a lot of promises in the summer, and so far I am on the bench for three games, so I can’t say they keep the promise,” he said.\n“I said many times before that I had a good relationship with the manager, and all of a sudden we don’t have any relationship. I don’t know why but it seems to me, how I see it, that someone doesn’t want me in the club.”\nHow has Liverpool responded?\nSomewhat unsurprisingly, Liverpool decided to omit Salah from its squad which traveled to Milan to face Inter in the Champions League on Tuesday.\nWhen Slot was asked about the situation during a press conference ahead of the match in Italy, the Liverpool manager said he was a bit “surprised” to hear Salah say what he said.\n“It’s not the first and not the last time that when a player doesn’t play … that he says something similar to what he did,” Slot conceded.\n“But I think our, my reaction to that is also clear, and that he’s not here with us tonight.”\nSlot also said he had “no clue” whether Salah had played his last game at Liverpool and that the club’s response was a show of strength.\n“Usually I’m calm and polite, but that doesn’t mean I’m weak,” Slot added.\nSalah’s decision to speak out has struck up a hot debate across the soccer world. Former Liverpool defender Jamie Carragher told Sky Sports that what Salah said was a “disgrace,” adding that he thought it was a calculated move to “cause maximum damage and to strengthen his own position.”\nMeanwhile, former England star Wayne Rooney said on BBC Sport that Salah was “absolutely destroying his legacy at Liverpool.”\nWhat happens now?\nIt’s unclear.\nLiverpool faces Brighton in the Premier League on Saturday and Salah has made noises to suggest it could be his last in a Liverpool kit.\nThe 33-year-old will shortly join up with Egypt for the Africa Cup of Nations, which will see him miss a few games for his club. But, with the January transfer window opening soon, there are rumors the winger could find a new club before returning from international duty.\nThe way he waved at Liverpool’s traveling fans at the end of the Leeds game at the weekend would also point to that possibility, with the “Egyptian King” – as Liverpool fans love to call him – seemingly one foot out of the door already.\nAnd, despite his waining impact in the Premier League, there would likely be a plethora of teams ready to snap Salah up.\nSaudi Arabia is perhaps the obvious direction, given previous interest last season, but Serie A clubs have also delved into the English market of late and the forward has previously played in Italy.\nIf Salah is to leave, though, it would bring to an end a love affair that has defined a glittering era for Liverpool football club. But, given his age and the cutthroat nature of top-flight soccer, it’s perhaps not altogether surprising.\nThe-CNN-Wire\n™ & © 2025 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
  "word_count": 988,
  "scraped_at": "2026-02-14T02:27:05.515465",
  "_text_extracted": true
}