{
  "article_id": "b82675ffcd00",
  "url": "https://metro.co.uk/2023/07/28/chelsea-ben-chilwell-tells-mauricio-pochettino-hed-love-to-be-captain-19211130/",
  "title": "Chelsea : Ben Chilwell tells Mauricio Pochettino hed  love  to be captain | Football",
  "date": "20230728T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ben Chilwell has staked his claim to be Chelsea’s new captain with Mauricio Pochettino yet to select Cesar Azpilicueta’s replacement.\nAzpilicueta departed Stamford Bridge earlier this summer after 11 years with the club, the last four of those spent as captain.\nPochettino has been using pre-season to assess his squad and determine who is best-suited to lead the Blues for the upcoming season and who can inspire the side back to glory following a terrible 2022/23 campaign.\nReece James is the favourite to be handed the armband, having donned it in the recent friendly with Newcastle and later saying it would be an ‘honour’ to become captain of his boyhood club.\nThiago Silva is also a strong contender having previously skippered PSG and the Brazil national team, while Kepa Arrizabalaga, Raheem Sterling and Enzo Fernandez are also under consideration.\nChilwell will also be in the running given his strong performances and experience, though injury issues have somewhat hampered his impact for the Blues.\nNevertheless, the left-back is up for the challenge, saying: ‘Yeah. I would love to be captain. I’m sure you’ve had that answer off a few of the players.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Of course, Chelsea Football Club, I’d love to be captain. I was captain of the youth team at Leicester and thoroughly enjoyed being that.\n‘Just having that role really. I think it brings the best out in me and my game, having a little bit more pressure and trying to help people around me I think is one of my strengths.\n‘Whether I get it or not, it’s not going to take away from my role. I don’t think you need an armband to be a leader so whether I get it or I don’t I’ll continue to do what I’m doing.’\nMore Trending\nThe 26-year-old joined Chelsea in 2020 from Leicester for £45million, winning the Champions League and UEFA Super Cup the following year.\nSo far, the England international has scored nine goals and made 12 assists in 85 appearances.\nIn the Premier League era, Chelsea have been captained by Azpilicueta, Gary Cahill, John Terry, Marc Desailly, Dennis Wise and Andy Townsend.\nMORE: Riyad Mahrez completes £30million move from Manchester City to Saudi Arabian side Al-Ahli\nMORE: Lauren James stunner gives England narrow win over Denmark at Women’s World Cup\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 457,
  "scraped_at": "2026-02-14T02:00:36.689013",
  "_text_extracted": true
}