{
  "article_id": "b83c4515f1bd",
  "url": "https://www.sounderatheart.com/2024/06/mls-fantasy-week-19-chasing-points/",
  "title": "MLS Fantasy Week 19 : Chasing Points",
  "date": "20240629T014500Z",
  "domain": "sounderatheart.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Week 19 Schedule & Notes\nBye: RSL\nThe first match of the week is this afternoon, NYCFC hosting Orlando. Saturday is a standard match day, with an almost even split of 4 games at 4:30, 4 games at 5:30, and five games at 7:30. There are a lot of options for setting up early switcheroos, and very good late players to start.\nNYCFC have dramatically cooled since their winning streak, now losing three straight matches. Meanwhile, Orlando is a team that is all over the map. In their past nine matches, Orlando have 3 wins, 3 draws, and 3 losses. They seem to be a firmly mediocre side, as Austin is the only team they have beaten that is in a playoff position (and I don’t believe they will be for long). Last weekend they won a shootout against the Fire, 4-2, and the week before was a 2-2 draw in Charlotte. I tend to favor NYCFC here, their past three losses were (1) a red card early at home against the Crew, and (2) road games against the Galaxy and Nashville. I believe they are still a strong squad, but my belief isn’t so strong that I have any of their players in my team.\nAtlanta hosts Toronto, who are quickly falling out of playoff position (two points in their past six games and 1-6-2 in their last nine). Atlanta is undefeated since parting with Pineda, though it is hard to see them as contenders at the moment with some key absences to international duty and Giakoumakis transferred out. The good news is Almada should be available this week, though he may be held out as his rumored transfer to the Eagle Football Group (new owners of OL) is finalized. Brooks Lennon ($8.7m) is a reasonable add, he had a clean sheet midweek on the road in DC and had 4 BPs again on the road in St. Louis, for a 13-point DGW. Those aren't incredible numbers, but he could be set to combine his attacking output with a CS at home this week. I'm still waiting to see how things shake out with interim manager Rob Valentino to take the jump. On the flip side, I am not particularly enthusiastic with Toronto on the road, given their recent form, even if Insigne and Bernardeshi are healthy.\nThe Revs host the Crew, which is suddenly a matchup of two of the hottest teams in the league. The Revs are the only team to win their past four matches (!) so I wouldn’t expect this to be a smash matchup for the Crew. Still, the Revs’ underlying xG numbers suggest they probably only actually “deserved” two points from this 4-game winning streak. Funny enough, this is one of the matches I am targeting with my switcheroo plays, with both Carles Gil ($14.3m) and Cucho Hernandez ($11.8). Gil has been consistently pretty good lately, and he doesn't have to deal with Aidan Morris. Cucho just had a massive eight days with 5 goals and an assist across three games. Two of those were road games, and in those two matches he had 15 then 16 key plays (which came to 7 BP!). I think both are likely to have great (fantasy) games, though I have them on the bench in case one or the other falters.\nNYRB host DC United, in what is shaping up to potentially be the most lopsided match of the week. In case you missed the hullabaloo, DC got two red cards last week, one of them to Benteke, and had a defender go out injured. DC is in the state of calling up players from the 2nd team to fill out the matchday roster, and they seem unlikely at best to be able to score in Benteke’s absence. Now, weird things can happen, but you have to like NYRB in this one. I’ll be checking lineups to see if Emil Forsberg or Lewis Morgan are starting in this one. If either of them is deemed ready to start (Forsberg from an injury, Morgan just returned from international duty), they could be in for a big haul as DC’s absences are concentrated in the defense.\nLooking through the rest of the schedule, I don’t have too many more general game notes. These teams have shown who they are recently. Petar Musa could have a great outing against Cincy, who are missing all their good CBs, but Dallas will be without Ferreira. Acosta should still be solid, but if Cincy struggle to build out of the back, he might have to play deeper than usual and the team will naturally have less possession. Miami and Minnesota are still missing their Copa America players, so they could be teams to target, though I don’t trust Nashville. Portland should have a good time at home though. SKC hosts Austin in a battle of terrible squads, though Austin is still clinging to a playoff position despite their worst xGD in the league. None of the players in that game are exciting to me.\nI’m guessing Vancouver handles St. Louis, especially as Tim Parker and Klauss are both questionable. I think LAFC will beat Colorado but it will be tough, San Jose and the Galaxy will likely be a shootout and I have no idea who wins (probably the Galaxy), and then Seattle hosts the Fire in a big test for both sides. Seattle desperately needs 3 home points, and the Fire are running out of time to turn their season around. The Fire had a road win in Toronto, scoring four goals, then a road loss in Orlando, allowing four goals. I think Seattle gets a shut-out win, but they will need to clean up mistakes in the defense and score goals early.\nChasing Points\nOne principle I try to uphold when writing my advice is to make sure I am not just chasing points. If a defender scored a goal, was it because they were involved in the attack? Were they a primary target for a great set piece taker? Was it a total fluke? If an attacker gets a hat trick, are they more like Benteke or Kubo? Is their underlying xG saying they are consistently generating high-quality (or maybe high volume) shots? Has something changed with their team to put them in better scoring opportunities, or was their opponent dealing with an issue (red card? key injuries/absences?) that opened the door for their great game?\nOne example from earlier this season was Lewis Morgan. Week 5, Morgan had a hat trick, putting him on 5 goals through 5 games. Emergence of a new star? Not exactly. He did this at home, against Inter Miami, who was dealing with CCC rotation and back line injuries, and without NYRB’s primary playmaker in Emil Forsberg. He also did this on just 0.8 xG. He’s had a decent year since then, but only two games with double-digit points puts him firmly behind many other attacking options.\nA more recent example I have been talking about is Jordan Morris. Jordan has six goals in his last seven games. Is that sustainable? Probably not, he has done this on 2.8 xG in that span. On the other hand, his xG in those seven games is higher than his total for the preceding 13. And his xG+xA in the past seven is a little closer, at 4.8, so he probably should have a couple of assists coming. And if you look at the team context, it is clear the situation has improved for Morris. Ruidíaz is benched (his xG after the Philly game is just 1.1 total), Rusnák is providing better opportunities (five assists in the past seven games), and JP is finding much more of the ball to control games (averaging 92 touches in his past six starts). I have a strong suspicion that JP and Rusnak needed time to round into form after their early injuries this year, and Morris is benefiting from their improved play. Morris’ G+A of 8 on the year is still a little below his xG+xA of 9.6, so he may be still due for a correction upward towards mean. Sure, he’s been a little lucky lately, but he’d been very unlucky for weeks.\nAnd, of course, Pedro de la Vega is ready for minutes (I am knocking on every piece of wood in sight).\nOn a similar note, Mateusz Bogusz has powered LAFC to wins in seven of their last eight matches, with his own six goals and four assists in that span. His underlying numbers are similar to Morris, 2.6 xG and 1.6 xA in those eight games. Should we expect his run of dominance to continue? Maybe? I don't see much that has changed for LAFC in those games, and Bouanga is still the star attacker for the team, with Giroud set to join in a month or so. And Bogusz's xG is heavily weighted towards one game, the Vancouver match at the beginning of the streak, where he had 1.3 xG, so just 1.3 xG in the seven games since then with five goals scored and no single game with xG over 0.3.\nOf course, these stats don’t tell the whole story. In the past eight games Bogusz has been credited with an average of 6.6 Key Plays per game, coming out to 12 BPs, with six shots BPs as well as BPs last week for passes and crosses. This past week in LAFC’s 6-2 mauling of SJ, Bogusz had 6 BPs. Jordan has just 10 BPs total over the whole season! So, while I think Bogusz’s points will fall off as his goals return to mean, he should still be a decent fantasy choice for his involvement as a creator. Maybe a great choice once LAFC has Giroud starting as the center forward, instead of actual Kei Kamara.\nCaptain Considerations\n- Denis Bouanga ($15.9m) - Picking Denis here mostly because there aren’t a ton of truly standout options this week. He’s at home this week, which has been extremely good for Bouanga this year. He has nine goals in ten home games, plus seven assists. He’s averaging 12 ppg at home. Colorado is probably better than most of the teams LAFC has faced at home this year, but he is still a top tier option.\n- Ryan Gauld ($13.7m) - Gauld had a bad week last week in Portland, but he’s still averaging over 10 ppg in his last six games. He should have a bounce back match at home against a weak St. Louis defense.\n- Luciano Acosta ($16.5m) - This is probably as good a week as any to push him down your list, considering Cincy's absences in defense, but Acosta has risen to the occasion more often than not. His points in his last three road games: 9, 13, 3, and 16. Though he also had a 6-point game at home against Nashville recently. I think he has all the potential in the world to go out and score double-digit points, as he has done in 10 matches so far, but he does carry more risk this week than usual.\n- Evander ($14.2m) - He was huge last week, gashing San Jose with a G+A and powering Portland to a win over Vancouver with an assist. He earned himself 7 BPs across those two matches. He was quiet in Portland's visit to Minnesota earlier this year, but he will be at home this time against a still-depleted Loons.\n- Emil Forsberg ($11.4m) or Lewis Morgan ($10.9m). As noted above, DC United's lineup will be makeshift at best, missing Benteke and many of their defenders. And DC's defense has been easily exploited this year. NYRB has been on both ends of multiple blowouts this year, one of which was a 4-1 win at DC back in May. It wasn't an incredible day for Forsberg (6 pts) or Morgan (8 pts), but each of them has had big days in the right matchups. I think Forsberg is a good captain option if he is healthy enough to start. If Morgan starts and Forsberg does not, then Morgan is the attractive option in the matchup.\nBargain Bin\n- James Pantemis (POR GK $5.7m) - Filling in for Maxime Crepeau in four of Portland’s last five matches, Portland has found three clean sheets in those games. Portland is at home against Minnesota missing their (possibly) best attackers. One of the better options under $6.0m, though I would rather have Frei at $6.4m from the evening matches, as Portland’s xG against looks like they should still be giving up goals.\n- John Pulskamp (SKC GK $4.5m) - If you're really desperate to slash salary, check and see if Pulskamp is starting for SKC again. SKC's defense is decidedly terrible, but they have also gotten a little unlucky to not earn more than their single clean sheet this year. Austin have just 5 road goals this year in 10 matches. On the other hand, SKC have lost 10 of their last 11 games (their sole win was against Seattle! Of course!), so don't expect the moon here. He's a high-risk, high-reward option.\n- Cameron Harper (NYRB DEF $5.9m) - Though listed as a Defender, Harper has been lining up at right midfield for NYRB. In limited minutes, he has earned four goals on the year, and has the best xG+xA per 90 on the team of any players who have more than 180 minutes. He didn’t start the last match against Toronto, but he did start the three prior matches and even scored a goal off the bench against Toronto. He’s not earning a ton of bonus points, but in his last two starts he had nine and eight KPs for 2 BPs in each outing. Plus 3 and 4 shots. His stats last year were not great, but he had the majority of his starts at RB, and he is still just 22. This is a great matchup for the Red Bulls, and I think Harper is a good bet to take advantage with a clean sheet and an assist or goal.\n- Noah Cobb (ATL DEF $4.2m) - A starting defender with a reasonable matchup this week, for almost minimum salary, playing in the early slate of games. If you're struggling to afford some of the premium players in the late games, you could try putting Cobb on your bench for a switcheroo.\n- Latif Blessing (HOU MID $5.9m) - A league vet, Blessing has suddenly found himself scoring 5 goals in the past six games. And he's done that in just 291 minutes. He started against the Galaxy, scored a goal, then was pulled at the half. He scored a goal off the bench against the Rapids. He started against Portland and was pulled at 56 minutes. He scored off the bench against Atlanta. He started and scored two goals against Seattle, coming off in the 68th minute. He started against DCU and came off in the 73rd minute. In the two matches he started and did not score, he registered zero shots (and no expected assists). I think you're probably chasing points if you take him, he's very likely to just have one or two points. But he's relatively cheap and could be a bench player that at least rises in value even if he doesn't score.\n- Obed Vargas (SEA MID $6.3m) - Vargas was great in the comeback win over Dallas, providing the game-winning assist (and oh what a ball it was) on top of 55 passes and 10 (!) Key Plays. That was his second-most passes all year. Playing the Fire at home is likely to be just as good of a matchup. Of course, if you want a possibly better midrange option, João Paulo ($8.8m) has been fantastic in his last two starts. He had over 105 passes (3 BPs in each) plus 15 Key Plays and BPs for shots and fouls suffered. He had 8 points in each of those games against Minnesota and Dallas without getting on the score sheet. There are better higher end options, but if he keeps this up he'll find himself at a premium price soon enough.\n- Sunusi Ibrahim (MTL FWD $5.9m) - Since starting in Week 13, Ibrahim has scored in four of his seven starts, with five goals. In Week 15, he scored in Philadelphia. Now Montreal hosts Philadelphia. I don't think he's a lock to score, but he could have a great day after facing some tough defenses recently.\n- Daniel Rios (ATL FWD $6.0m) - Atlanta have turned to Rios as their primary answer at forward with Giakoumakis out and Saba at the Euros. In their past three matches, he went 76 minutes (goal), 65 minutes, and 89 minutes (goal, PK miss). His npxG per 90 is a respectable 0.35, with 0.43 combined npxG+xA per 90. Of course, there is also Jamal Thiare ($4.7m), who has a better npxG per 90 at 0.46, and combined npxG+xA per 90 at 0.57. But Thiare has not been favored by interim coach Valentino so far, and Rios was significantly better against St. Louis, so I would spring for Rios first, assuming both are starting this weekend.\nOdds and Ends\n- I want to make a quick apology for not talking about Colorado last week. I liked their matchups, but did not feel strongly enough to be compelled to endorse them. I still put Djordje Mihailovic on my bench and Andreas Maxso as a starting defender. And what a week it was for Mihailovic! 37 points! Four goals, an assist, and 5 BPs in each match. I don't expect him to replicate that this week, facing LAFC on the road. The Black and Gold have severely limited opposing playmakers this year, with Espinoza the only player to reach 8 points in Los Angeles since the Timbers visited in Week 10. He's too big of a risk this week for me, though his form has been exceptional.\n- I think the Galaxy visiting San Jose will be a shootout, but it could be interesting now that manager Luchi Gonzalez has been fired. Their defense and especially goalkeeping has been dreadful this year, which is not an easy problem to fix. The Galaxy already won in San Jose earlier this year 3-1. But if Puig is not healthy enough to start, you could see San Jose benefiting from a new manager bounce. Even if Puig does start, I would bet he's on a minutes restriction and will play a little more cautiously. I like Cristian Espinoza ($13.4m) as Brugman will still be out for the Galaxy. Pec and Joveljic are both very strong options at forward that I would take over Morris if I wasn’t such a big believer in Morris.\n- This week is the first week of the last Fantasy Champions League qualifier period. So even if you haven't had a strong team lately, the slate is wiped clean for you to make some moves and earn a chance at some prizes. Best of luck!",
  "word_count": 3183,
  "scraped_at": "2026-02-14T01:51:32.420232",
  "_text_extracted": true
}