{
  "article_id": "b85a1da48a11",
  "url": "https://playingfor90.com/2023/11/26/xavi-hernandez-facing-growing-doubts/",
  "title": "Barcelona boss Xavi Hernandez facing growing doubts",
  "date": "20231126T150000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The international break was supposed to be an opportunity for Xavi Hernandez and his coaching staff to recharge their batteries in what has been an inconsistent season for Barcelona.\nHowever, against Rayo Vallecano, we saw more of the same.\nA Barcelona side who completely throwing away the first half, fall behind and then try to scratch their way back in the final third of the second half.\nFalling lower in the league table — now tied for third with Atletico Madrid with Los Colchoneros having a game in hand — those whispering voices of criticism toward Xavi have only gotten louder.\nLouder because in his third season at the helm, there has been little improvements and he arguably has a better squad than he did last season. A season in which Barcelona won the league and were more than solid defensively. A solidity that has disappeared.\nXavi certainly hasn’t helped himself by trying to deflect from what is a glaring problem, which is that his team looks unprepared most days with his tactical shortcoming becoming increasingly glaring. Simply sitting deep seems to flummox Xavi and so it’s not surprising that his side has dropped points against the likes of Rayo Vallecano, Getafe and Mallorca to name a few.\nWhile there have been refereeing decisions that have gone against Barcelona, which could have resulted in the Catalans picking up the win, they should not distract from the fact that Barcelona are playing poor football with no signs of improvement.\nHe also did himself little favors when he use the Barcelona press as a way to try to deflect. The press isn’t at fault for the lack of goals and leaky defense.\n“We lacked that mentality to go for it,” Xavi said in his press conference after the match. “If we want to win trophies this season, we have to change our mentality.”\nPlenty of things have to change but mentality may not have been high on the list of many.\nOne could argue it’s the same mentality they had last season when they won LaLiga. It sounds like another excuse to a problem Xavi has not found a solution for.\nBarcelona brought in Ilkay Gundogan and Joao Cancelo. Two former Manchester City players who played under Pep Guardiola. The latter had a falling out but the former won a treble last season, including the Champions League, playing a key role in that achievement.\nGundogan certainly has the right mentality.\nWith each passing game and things not improving, it’s becoming more evident that Xavi may not be cut out to be the Barcelona manager.\nHe arrived with a lot of fanfare given he was replacing Ronald Koeman. Under Koeman, Barcelona were woeful. Not too dissimilar to what we’re seeing from Barcelona at the moment. The difference, however, was Koeman had a far less talented squad and was dealing with the departure of Lionel Messi.\nXavi Hernandez has no such excuse.\nThe club has backed him as well as they could have given their financial situation.\nDespite both Joan Laporta and Deco backing Xavi in some of their recent interviews, the fact of the matter is one of the reasons there hasn’t been a change is because of their financial limitations and that the names out there as potential replacements leave much to be desired.\nOf the available managers, perhaps the most attractive is Hansi Flick whose last stint was as Germany manager.\nWere Xavi to be fired, the most likely replacement would be Rafael Marquez who is currently doing a decent job with Barça Atletic.\nXavi is going to get time to try to sort things out. But patience is not an infinite resource, especially in football.\nHe is going to need to find a solution fast. A stumble against Porto in the Champions League and adverse results against Atletico Madrid and Girona in LaLiga may bring in an end to his tenure. A tenure that was filled with so much hope at it’s inception.",
  "word_count": 663,
  "scraped_at": "2026-02-14T02:25:08.300556",
  "_text_extracted": true
}