{
  "article_id": "b86b2fd16faf",
  "url": "https://www.liverpoolfc.com/news/jurgen-klopp-v-mauricio-pochettino-story-so-far",
  "title": "Jürgen Klopp v Mauricio Pochettino : The story so far",
  "date": "20240224T100000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PreviewJürgen Klopp v Mauricio Pochettino: The story so far\nJürgen Klopp and Mauricio Pochettino will be facing off as managers for the 14th time on Sunday – and in a second major cup final.\nFrom Klopp’s first match as Liverpool boss through to a Champions League showpiece and now a new club for Pochettino, the pair have frequently been in opposing dugouts.\nAhead of their latest duel in the Carabao Cup final between the Reds and Chelsea at Wembley, we take a look back at their shared history so far…\nAs mentioned, Klopp’s Anfield tenure began with a game against Pochettino, who was in charge of opponents Tottenham Hotspur that afternoon in October 2015.\nA 0-0 stalemate at White Hart Lane was the first of three successive draws between the clubs, with league meetings in April and August 2016 ending 1-1.\nIt was Klopp who posted the first victory of the head-to-head in October that year, one that came in the League Cup. Daniel Sturridge was on the scoresheet twice under the Anfield lights as the Reds edged the fourth-round tie 2-1.\nAnd they repeated that trick when Spurs visited L4 in the top flight later that season, this time winning 2-0 courtesy of two goals in three first-half minutes from Sadio Mane.\nPochettino got the better of the 2017-18 Premier League meetings, inflicting one of Klopp’s lowest moments at Liverpool with a 4-1 home win at Wembley and emerging from a frantic Merseyside encounter with a point after a 2-2 draw.\nThe record has firmly swung back in Klopp’s favour since, however.\nThree wins out of three in 2018-19 saw the Reds defeat Pochettino’s Spurs 2-1 in both top-flight clashes before a truly historic night in Madrid in June 2019.\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeA Mohamed Salah penalty and a late swipe of Divock Origi’s left boot downed the Londoners 2-0 in the Champions League final and gained Liverpool a sixth European Cup.\nAnother 2-1 league win for Klopp’s men in October of that year preceded Pochettino’s departure from the Spurs dugout.\nAfter a spell with Paris Saint-Germain in France, the Argentinian returned to English football when he was appointed Chelsea boss last summer.\nAnd the fixture computer swiftly brought the two managers into battle again by sending the Reds to Stamford Bridge on the opening day of the current Premier League campaign, where it finished 1-1.\nThey last locked horns less than a month ago in the return game at Anfield, where goals from Diogo Jota, Conor Bradley, Dominik Szoboszlai and Luis Diaz inspired the home team to a 4-1 victory that had Klopp purring.\n“That was really… the way I like football, it came pretty close to that,” he said recently. “And against a good opponent, how everybody sees then.”\nFingers crossed Klopp is saying something similar after the final whistle at Wembley on Sunday.\n- Follow the Carabao Cup final with a free MyLFC account on LFCTV GO – including pre-match build-up from Wembley, live audio commentary of the game, a full match replay on Sunday evening, and more.",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:13:34.143980",
  "_text_extracted": true
}