{
  "article_id": "b8790387a05d",
  "url": "https://www.caughtoffside.com/2023/04/25/newcastle-and-man-united-monitoring-highly-rated-striker/",
  "title": "Newcastle and Man United monitoring highly - rated striker",
  "date": "20230425T133000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League duo Newcastle United and Manchester United are reportedly interested in signing soon-to-be RB Leipzig striker Benjamin Sesko.\nThat’s according to a recent report from 90min, who claim that despite the young forward already agreeing to leave RB Salzburg at the end of the season, both Newcastle and Erik Ten Hag’s Red Devils are interested in bringing him to the Premier League.\nHighly rated and inevitably compared to Erling Haaland, who followed a similar career path after coming through Salzburg’s youth ranks, the future seems bright for Sesko, and his price tag, given his age and inexperience, would undoubtedly see him as a cheaper alternative to the likes of Harry Kane and Victor Osimhen – both of whom are being heavily linked with a summer move to Old Trafford.\nElsewhere, with Eddie Howe’s Magpies looking likely to qualify for Champions League football next season, it makes sense that the side from the northeast are looking to bolster their attack.\nHowever, one player who could make way should the Magpies up their pursuit of Sesko is Callum Wilson.\nIt has been noted that the 31-year-old Englishman ‘could potentially leave St. James’ Park in the summer’ due to his desire to play more regularly, and that is something that is unlikely to happen at Newcastle given his age, proneness to injury and Alexander Isak’s incredible form since the Swede joined for a club record fee of £63m last summer (Sky Sports).\nIn light of their interest, scouts from both clubs reportedly attended Salzburg’s game against Sturm Graz last weekend – a match in which Sesko found the back of the net in the 73rd minute.",
  "word_count": 274,
  "scraped_at": "2026-02-14T01:39:53.120297",
  "_text_extracted": true
}