{
  "article_id": "b88691894a84",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-enter-advanced-talks-mindboggling-loan-capture-worlds-most-valuable-player",
  "title": "Man Utd enter advanced talks for mindboggling loan capture of world most valuable player",
  "date": "20230522T224500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd enter advanced talks for mindboggling loan capture of world’s most valuable player\nSensational reports in France are indicating that Man Utd are in advanced talks with Paris Saint-Germain about signing Neymar.\nNeymar became the most expensive player in history when he joined PSG from Barcelona back in 2017. The magnitude of his transfer value had a ripple effect on the rest of the sport. Sadly, things haven’t quite gone as the forward would have hoped.\nNeymar joined PSG because he wanted to become a focal point rather than being in Lionel Messi’s shadow, which theoretically would have boosted his chances of beating his former teammate to the Ballon d’Or.\nHowever, a combination of injury issues and other factors have meant that Neymar has never managed to turn the tables. Furthermore, PSG’s faith in him is yet to be justified if the ambition all along was to win the Champions League.\nEven after Messi eventually followed him to Paris, Neymar has been unable to lift Europe’s most iconic trophy with the club. Moreover, the number 10 has lost his place as the focal point of the squad to Kylian Mbappe. Now, PSG are seriously contemplating Neymar’s future.\nAnd according to L’Equipe, Man Utd have entered advanced talks about bringing the Brazil international to the Premier League for the first time in his career.\nThe English top flight might be the only market PSG can sell Neymar to. Even so, Man Utd would prefer to take the 31-year-old on loan initially.\nPSG, in contrast, would rather end their association with Neymar for good by selling him. Recouping their €222m investment seems impossible, but – under contract until 2025 – he would still command a huge fee.\nPSG director Luis Campos is ready to hold talks with the player’s representatives to work out the next steps.\nSensationally, it could lead to Neymar joining Man Utd next season. His other main suitor in the Premier League would be Chelsea, but they cannot offer any European involvement.\nCasemiro trying to influence Neymar to Man Utd transfer\nMan Utd, on the other hand, are one point away from securing a return to Champions League football for next season. They won the Carabao Cup earlier this season and have reached the FA Cup final too.\nIt would send shockwaves around the football world if Erik ten Hag was able to add Neymar to his project at Old Trafford.\nAnd the report claims that he already has an ally in his attempts to seal the signing. Indeed, Neymar’s compatriot Casemiro is reportedly trying to influence things so the move materialises.\nCasemiro has generally had a positive impact on Man Utd since joining from Real Madrid last summer. A couple of suspensions aside, he has been a useful presence in defensive midfield.\nNeymar would be an even more high-profile addition to the Man Utd squad. Mainly a left winger, he would pose a serious threat to current players like Marcus Rashford and Alejandro Garnacho, even though both have been in good form this season.\nPerhaps it might prompt Ten Hag to use Rashford more centrally, while encouraging patience over the development of Garnacho.\nFor now, it will all be theoretical until Man Utd take any more concrete steps towards signing Neymar. But if the claims in France are anything to go by, something momentous could be in the works.\nOther sources, such as ESPN, are otherwise indicating that Man Utd’s current owners are not pursuing a deal for Neymar.",
  "word_count": 588,
  "scraped_at": "2026-02-14T02:00:19.993881",
  "_text_extracted": true
}