{
  "article_id": "b8ad86318d1b",
  "url": "https://www.dw.com/en/kevin-behrens-from-the-amateurs-to-the-german-national-team/a-67123024",
  "title": "Kevin Behrens : From the amateurs to the German national team – DW – 10 / 18 / 2023",
  "date": "20231018T074500Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kevin Behrens: From the amateurs to the German national team\nOctober 18, 2023In just a few short years the Union Berlin striker has gone from toiling in Germany's fourth tier to his debut with the national team. Having made his first appearance against Mexico, could he be an option for EURO 2024?\nThe fourth-tier Regionalliga, Bundesliga 2, the Bundesliga, UEFA Conference League, Europa League, Champions League – and finally the German national team; Kevin Behrens' steep upward trajectory over the past five years has been unprecedented.\nIn the summer of 2018, the striker left Saarbrücken of the Regionalliga Südwest to move up two tiers to Sandhausen of the second division. At the ripe old age of 27 Behrens had finally reached his goal of becoming a professional footballer.\nOver-30 Germany debutant\nAfter three years at Sandhausen, in the summer of 2021, Bundesliga outfit Union Berlin signed him on a free transfer. Union were also on an upward trajectory of their own, having qualified for Europe three consecutive seasons – so Behrens quickly got his first taste of international club football.\nThe icing on the cake came shortly after Julian Nagelsmann had taken over as head coach of a Germany team in crisis. First Nagelsmann named Behrens to his squad for the friendlies against the USA and Mexico in the United States, then the new coach gave the 32-year-old Union man his first action in a German jersey, when he came on in the 87th minute of the Nationalmannschaft's 2-2 draw against Mexico.\n\"It was really exciting, really cool to get into such a wild game in that atmosphere. It's just awesome to have played my first game,\" he said after the final whistle.\nDespite the excitement of his debut, he kept his feet on the ground.\n\"I definitely still have to work on myself. The guys are really strong. I'm not used to training and playing at this level, but I'll keep working on myself and give it my all.\"\nStill, the overriding emotion will have been joy, as the national team seemed well out of his reach such a short time ago.\n\"To be honest, I hadn't even thought I would make it to the Bundesliga anymore,\" the Bremen native had conceded a few days before his national team debut.\n\"I am very, very proud of the fact that I never gave up and always worked on improving myself. The path I have taken has made me who I am today,\" Behrens added, before deflecting much of the credit for his success to his wife, with whom he has three children.\n\"She has always supported me, even in hard times. She's been through everything, from Wilhelmshaven [where Behrens started in the Regionalliga Nord in 2011-2012] to now in Berlin.\"\nFlying start to the season\nBehrens' nomination to the national team came as a surprise for its timing as much as anything else. There had been speculation that former national team coach Hansi Flick could give him his first callup for the September international break, as not only were Germany short in the striking department, but Behrens had got off to a flying start in the Bundesliga, scoring four goals in Union's first two matches.\nBy the time the October break rolled around though, Behrens had failed to add to his total and Union were on a skid, having lost each of their last seven matches in all competitions.\nCharacter guy, good in the air\nAsked whether he was surprised to get the call from the new Germany coach said he was both \"shocked and surprised.\"\nFor his part, Nagelsmann liked what he saw in Behrens' first training sessions with the Nationalmannschaft.\n\"He's a character guy who always plays to win. He draws a lot of players to him in the penalty area,\" the former Bayern coach said, while at the same time praising his heading prowess.\n\"That helps when we have opponents who defend deep and we still need a goal.\"\nAn option for Nagelsmann at EURO 2024?\nHaving finally made his national team debut, Behrens will be hoping it won't end there. The next aim has to be to make it into Nagelsmann's squad for the home European Championship next summer. His possible role? As a player who is just happy to be there and is capable of making an impact coming off the bench when needed. A player willing to keep his ego in check while doing whatever it takes to contribute to the team's success.\nThis was Niclas Füllkrug's role at last winter's disappointing World Cup in Qatar. Next summer could be Behrens' chance to slip into a this role – and he is not lacking in the necessary confidence. As he puts it, he has always been a player who can \"make a difference\" and \"cause a stir.\"\nTaking the pitch for the national team as Germany host EURO 2024, six years after his last Regionalliga match – that would truly be the crowning achievement of an unprecedented rise.\nThis article was originally published in German.",
  "word_count": 841,
  "scraped_at": "2026-02-14T01:51:09.235539",
  "_text_extracted": true
}