{
  "article_id": "b8b1bfe981bb",
  "url": "https://metro.co.uk/2025/12/04/enzo-maresca-explains-estevao-hauled-off-second-game-a-row-vs-leeds-25124515/",
  "title": "Enzo Maresca explains why Estevao was hauled off for second game in a row",
  "date": "20251204T003000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca decided to take off Estevao Willian at half-time in Chelsea’s defeat to Leeds United because he feared the youngster was going to be sent off.\nAfter a promising draw with Arsenal at the weekend, Chelsea fell to a dismal defeat at Elland Road on Wednesday night – shooting themselves in the foot with some calamitous defending for the hosts’ third goal.\nEstevao endured a difficult evening in front of an electric home crowd and was shown a yellow card at the end of the first-half for a petulant kick out at Gabriel Gudmundsson, tripping the Sweden international.\nThe Brazilian superstar had a fantastic night in the Champions League against Barcelona last week but has found himself hooked at the break in each of Chelsea’s last two matches since.\nExplaining the decision against Leeds, Maresca felt he had no choice but to withdraw the winger.\n‘I think the feeling with Estevao was a little bit, “welcome to Premier League, welcome to Leeds”,’ Maresca said in his post-match press conference.\n‘The impact for him must have been probably a big, big impact for him. The reason why we changed him is because he was already a yellow card.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Sometimes when you are 18, you struggle to manage emotion, so it was better to change him and to avoid any red card.’\nWhile on commentary duty for Sky Sports, Gary Neville labelled Chelsea a ‘mess’ with Maresca believing only two players emerged with any credit.\nMore Trending\n‘I think tonight’s game there is no one that was at this level or the best level,’ Maresca continued.\n‘I think all the teams, all the ones probably, Pedro [Neto], second half, Garna [Alejandro Garnacho], second half, they were our best players, because after we scored the goal we had two chances with Cole [Palmer] and with Joao [Pedro]. But then the third goal I think killed the game.’\nDefeat sees Chelsea slip to fourth place with Aston Villa picking up a victory at Brighton.\nThe Blues return to action away to Bournemouth on Saturday.\nMORE: ‘No chance’ – Man Utd legend Gary Neville makes Arsenal and Chelsea title claim\nMORE: Mikel Arteta told Arsenal have the ‘best player in the Premier League’ after Brentford win\nMORE: Mikel Arteta claims Arsenal star is ‘back to his best version’ after Brentford win",
  "word_count": 441,
  "scraped_at": "2026-02-14T02:27:05.517739",
  "_text_extracted": true
}