{
  "article_id": "b8c287202237",
  "url": "https://www.empireofthekop.com/2026/02/04/liverpool-have-placed-a-big-stake-on-jeremy-jacquet-but-theyre-definitely-not-suckers/",
  "title": "Liverpool have gone big on Jacquet , but theyre not  suckers  ",
  "date": "20260213T120000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Late on Monday night, Liverpool confirmed the signing of Jeremy Jacquet from Rennes, with the 20-year-old arriving at Anfield in the summer.\nThe deal could reach as high as £60m, with the Reds paying £55m up front and potentially another £5m in add-ons (BBC Sport), a significant investment on a player who’s made just 56 senior career appearances.\nThe transfer fee met with criticism from 1998 World Cup winner Christophe Dugarry, who described the Merseyside club as ‘suckers’ for spending such a ‘ridiculous’ amount on the young centre-back.\nWhile Liverpool have certainly placed a significant stake on Jacquet to excel at Anfield, rest assured that it’s not a deal which was done frivolously.\nLiverpool must be convinced Jacquet will become a star\nFSG’s long-standing reputation for frugality was disproven by their sanctioning of a £446m spending spree on Arne Slot’s squad last summer, although the modus operandi of the LFC hierarchy is to only invest in a player when they’re fully convinced of his worth.\nThe 20-year-old may still have plenty to prove in his career, and he’ll undoubtedly come under sterner scrutiny once he arrives in the Premier League due to the fee that the Merseyside club have paid for him.\nHowever, the objective testimonies of French football experts who’ve watched him in action regularly would suggest that Liverpool are getting a bloody good player in Jacquet.\nJulien Laurens, who’s perhaps best known in the UK as a regular on TNT Sports’ Champions League coverage, gushed: “I can’t stress enough what a superb signing Jeremy Jacquet will be for Liverpool! He is a special talent and has everything to become one of the best defenders in the world.”\nMeanwhile, broadcaster Matt Spiro is convinced that the ‘man mountain’ of a defender is ‘tailor-made for the Premier League’ and has ‘everything required’ to excel in the English top flight.\nWhy Jacquet seems ‘tailor-made for the Premier League’\nThe 20-year-old has especially stood out for his ability to win his battles against much more experienced opponents, ranking among the top 7% of players in Ligue 1 this season with his aerial duel success rate (75.5%) and his percentage of all duels won (67.2%), as per Fotmob.\nJacquet is also accomplished in core defensive traits such as tackles, blocks, clearances and recoveries, along with initiating attacks for Rennes with his percentages for pass completion (90.5%) and accurate long passes (54.2%).\nSimilar to the vast sums spent on Alexander Isak, Florian Wirtz and Hugo Ekitike last summer, Liverpool aren’t strictly buying him for an immediate impact, but to develop into an elite defender at the highest level in the years to come.\nGet that right, and they’ll have the last laugh on critics such as Dugarry.",
  "word_count": 453,
  "scraped_at": "2026-02-14T01:59:36.826849",
  "_text_extracted": true
}