{
  "article_id": "b8cd88e31a38",
  "url": "https://www.thenews.com.pk/latest/1244936-real-madrid-boycott-ballon-dor-over-perceived-vinicius-snub",
  "title": "Real Madrid boycott Ballon dOr over perceived Vinicius snub",
  "date": "20241028T190000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid boycott Ballon d’Or over perceived Vinicius snub\n\"[...] it is clear that Ballon d'Or-UEFA does not respect Real Madrid,\" says club in statement\nMADRID: Real Madrid said they will boycott the Ballon d'Or ceremony in Paris on Monday as they are convinced that their striker Vinicius, the bookmakers' favourite to win the men's award, has been snubbed.\nThe club told AFP it questioned the methods behind the selection of the Ballon d'Or winner, saying that their defender Dani Carvajal, another of the 30 players nominated, had also been unfairly overlooked.\nCarvajal scored the opening goal in the 2024 Champions League final against Borussia Dortmund and Brazilian Vinicius rounded off the 2-0 win at Wembley with the second goal.\nThe Ballon d'Or is awarded by a jury of journalists representing the top 100 nations in the FIFA rankings.\n\"If the award criteria doesn't give it to Vinicius as the winner, then those same criteria should point to Carvajal as the winner,\" Real Madrid told AFP.\n\"As this was not the case, it is clear that Ballon d'Or-UEFA does not respect Real Madrid. And Real Madrid does not go where it is not respected.\"\nThe Ballon d'Or organisers decided to innovate this year by keeping the winner's identity a secret until the very end, to avoid any leaks to the press and all the nominees were invited to Monday´s ceremony in the French capital.\nIn previous years, the winner was revealed a few days before the awards ceremony.\nIn response to Real Madrid´s boycott — which was announced as the nominees were gathering for the glitzy ceremony at a Paris theatre — the organisers insisted that \"no player or club\" knew in advance who has won the award.\n\"All the clubs and players are in the same boat,\" a Ballon d´Or source told AFP.\nThe absence of the Real players and the club's declaration suggest that neither Vinicius, Carvajal nor English midfielder Jude Bellingham, the architects of the club's Champions League triumph, will win the trophy.\nThat could leave the way clear for Manchester City's Spanish midfielder Rodri, who was voted Euro 2024's player of the tournament after inspiring his country to victory in Germany in July.\n-\nBreezy Johnson engaged at Olympics after emotional finish line proposal\n-\nOlympics men hockey game: McDavid, Crosby power Canada past Czechia\n-\nEx-Arsenal footballer Thomas Partey charged with additional rape counts\n-\nChloe Kim set for historic halfpipe gold showdown at Milano Cortina\n-\nVladyslav Heraskevych disqualified from Winter Olympics 2026 over helmet controversy\n-\nThomas Tuchel set for England contract extension through Euro 2028\n-\nMilano-Cortina 2026: Assessing Italy’s Winter Olympics economic growth\n-\nVictor Wembanyama’s historic first half tops Tim Duncan, sparks massive NBA reactions",
  "word_count": 455,
  "scraped_at": "2026-02-14T01:51:57.636137",
  "_text_extracted": true
}