{
  "article_id": "b8efcd598b35",
  "url": "https://www.aol.co.uk/articles/head-coaches-ruben-amorim-not-183946732.html",
  "title": "Head coaches like Ruben Amorim do not survive such bold ultimatums",
  "date": "20260104T191500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Coaches like Ruben Amorim never survive making bold ultimatums\nWhen managers start talking like Ruben Amorim then there is usually only one outcome: they leave. Sooner or later, and it is usually sooner, they go.\nThis has proved to be the case again as Manchester United sacked the Portuguese head coach on Monday morning,\nWe do not even have to go back too far for the previous example. Just a few days, in fact, with Enzo Maresca’s departure from Chelsea, which was largely the result of a power struggle between the club, the way they want to operate, and the head coach.\nAt United it appears to be more specifically a power struggle between Amorim and director of football Jason Wilcox. In such cases, both do not normally survive. It was always more likely to be Wilcox who remained in place.\nModern football dictates that the traditional role of an all-powerful manager is dead. Instead we are in the era of the head coaches. Except some head coaches think they should be managers even if they come from a country where the head coach system is prevalent.\nSuch as Portugal. Amorim did not have the say at Sporting that he believed he should have commanded at United. There he worked with a sporting director, Hugo Viana, who is now of course at Manchester City in a similar role.\n“I came here to be the manager of Manchester United, not be the coach of Manchester United,” Amorim declared after the 1-1 draw away to Leeds United.\n🗣️ \"I came here to be the manager of Manchester United, not the coach\"\n🗣️ \"If people can't handle criticism we need to change the club\"\nRuben Amorim issues a strong statement following Manchester United's draw with Leeds and insists that 'he will not quit' from his role 🔴 pic.twitter.com/DlsOFymdL9— Sky Sports News (@SkySportsNews) January 4, 2026\nExcept his title was head coach (as United made so clear in their sacking statement). And he knew the structure and the club and the squad that he was joining and inheriting. Plus, United spent more than £200m in the summer to provide Amorim a goalkeeper and a whole new attack having bought him a wing-back to suit his 3-4-2-1 system last January.\nWe were told these were the areas that Amorim was prioritising – even though it appeared he needed even more wing-backs and a more athletic central midfield – and he happily spoke about this being correct and the need to score more goals.\nMaybe he was toeing the party line. Maybe he was alluding to that nebulous concept of broken promises; that United were not, to borrow Kevin Keegan’s phrase when he was manager of Newcastle United, doing what it said on the brochure.\nThe manager/head coach debate opened up by Amorim is also reminiscent of what Mauricio Pochettino said having taken Tottenham Hotspur to their first Champions League final in 2019. Pochettino declared his job title should be changed back to head coach because he had no influence over Tottenham’s transfer activity.\nSpurs broke their transfer record to sign Tanguy Ndombele – and look how that turned out – but Pochettino stated: “Maybe the club need to change my title description, because my job now is to coach the team. It is not a question for me, it is a question for the club. Maybe the club are going to change my title description.”\nInstead, four months later, they changed the manager with Pochettino sacked and José Mourinho hired as the head coach. But he also tired of what he perceived as a lack of control while results dictated that he too was sacked.\nIt always comes down to a power struggle. Remarkably, Amorim called out Wilcox. Not by name but by title, stating the sporting director – and the club’s scouting department – needed to “do their jobs”.\nInterestingly, he added that he was “not going to quit” which represented a shift from what he said after losing the Europa League final last season – to Spurs – when he suggested he would walk away without compensation if he did not feel he could do the job.\nOn Sunday, Amorim dug his heels in, drew the battle lines and made it clear that if United were to shift him on then they would have to pay up. All the while hinting that he had no plans to stay beyond his contract. In his own words: “And that is going to finish in 18 months, and then everyone is going to move on”.\nThose are hardly the words of a young coach intent on the long haul, wanting to see through a wholesale rebuild and create a dynasty at United, which were the reasons why he was brought in and why the club believed the pain they went through, not least in the past year and the “storm” that Amorim hinted at, were all worth it.\nThen suddenly they had a head coach calling it on with them.\nUnited were used to Amorim’s emotional outbursts. The initial reaction was to be shocked at what he said, then to cringe a little, then to realise this is how he is and it all tends to blow over and calm down.\nBut what he said after the Leeds game followed on from him voicing his frustrations on Friday at the likelihood of no new signings being added to his squad during the January transfer window.\nWhat did United expect? Did they do their due diligence on Amorim – whose coaching hero is Mourinho – and did they not know that he was headstrong, emotional and absolutely a “philosophy” manager who is religiously wedded to his ways and his system?\nHistory tends to suggest that head coaches do not last long in such situations, and it has played out that way once again.",
  "word_count": 976,
  "scraped_at": "2026-02-14T02:27:10.770531",
  "_text_extracted": true
}