{
  "article_id": "b90762f46c4f",
  "url": "https://metro.co.uk/2023/07/21/gabriel-martinelli-fires-champions-league-warning-to-arsenal-squad-19171333/",
  "title": "Gabriel Martinelli fires Champions League warning to Arsenal squad | Football",
  "date": "20230721T193000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gabriel Martinelli has urged his Arsenal team-mates to ‘prepare for the worst’ ahead of the Gunners’ return to the Champions League this season.\nThe north London club registered a second-placed finish in the Premier League last term, which will end their seven-year wait for Champions League football.\nArsenal have never won the Champions League in the club’s history and last featured in football’s elite European club competition in the 2016-17 campaign.\nThe Gunners have been eliminated in the first knockout round the last seven times they have featured in the tournament – with their best result a runner-up finish in the 2005-06 season.\n‘I think we need to prepare ourselves for the worst, we need to prepare ourselves for the best teams and the whole team is doing that,’ Martinelli said.\n‘I think we are ready for a new challenge… It’s so important [our squad depth] because we have too many games in the season and it’s going to be tough again.\n‘We are ready to go and it’s good to have so many options.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nMore Trending\nMartinelli enjoyed a stellar season last term, registering 15 goals and five assists across 36 Premier League games for Mikel Arteta’s side.\nGunners legend Ray Parlour crowned Martinelli as Arsenal’s most improved player for the 2022-23 campaign.\n‘He deserves recognition as he has been excellent off the left,’ he told Metro.co.uk. ‘He took his chance when Emile Smith Rowe got injured. He was a bit-part player really, but after getting his opportunity, he has really improved.’\nMORE: Kai Havertz hits back at Chelsea fans who mocked him over MLS skill challenge\nMORE: Arsene Wenger's advice to Bukayo Saka revealed by Arsenal chief Tim Lewis",
  "word_count": 335,
  "scraped_at": "2026-02-14T02:16:47.393430",
  "_text_extracted": true
}