{
  "article_id": "b90e13d4d578",
  "url": "https://www.barcablaugranes.com/2023/10/25/23930010/barcelona-shakhtar-donetsk-champions-league-team-news-match-preview-lineups-score-prediction",
  "title": "Barcelona vs Shakhtar Donetsk , Champions League : Team News , Preview , Lineups , Score Prediction",
  "date": "20231025T003000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona vs Shakhtar Donetsk, Champions League: Team News, Match Preview\nA few days before the Greatest Game in the Game, Barça look to make a massive step towards a spot in the European knockout rounds\nCompetition/Round: 2023-24 Champions League, Group H, Matchday 3\nBarcelona Outs & Doubts: Gavi, Robert Lewandowski, Frenkie de Jong, Pedri, Raphinha, Jules Kounde, Sergi Roberto (out)\nShakhtar Outs & Doubts: Mykola Matviyenko (doubt)\nDate/Time: Wednesday, October 25, 2023, 6.45pm CET (Barcelona), 5.45pm BST/WAT (UK & Nigeria), 12.45pm ET, 9.45am PT (USA), 10.15pm IST (India)\nVenue: Estadi Olímpic Lluís Companys, Montjuïc, Barcelona, Catalona, Spain\nReferee: Ivan Kružliak (SVK)\nVAR: Tomasz Kwiatkowski (POL)\nHow to watch on TV: TUDN (USA), TNT Sports 1 (UK), SuperSport (Nigeria), SONY TEN 2 (India), Movistar Liga de Campeones (Spain), others\nHow to watch online: Paramount+ (USA), Discovery+ (UK), Movistar+ (Spain), others\nFollowing a dramatic, crucial late victory against Athletic Bilbao to get closer to the top of the La Liga table, Barcelona return to European action for their third Champions League group stage game as they welcome Ukrainian champions Shakhtar Donetsk to the Montjuïc Olympic Stadium on Wednesday evening’s early kickoff.\nBarça come into this one still unbeaten in all competitions three months into the season, an underrated achievement for Xavi Hernández and his troops considering the tough schedule they’ve faced and the almost unbelievable injury crisis they’ve had to deal with since the very beginning of the campaign.\nThe quality of the football despite the tough circumstances has been even more impressive than the results themselves, which provides a lot of encouragement as Barça look to compete in all fronts this term. Saturday’s El Clásico will be the biggest test of the season so far and will give us a good idea about the team’s chances of winning the league, but a deep European run remains the biggest priority for the club in 2023-24.\nAdvancing to the Round of 16 is the first step in their quest for a strong Champions League campaign, and three points against Shakhtar will pretty much guarantee a spot in the knockout rounds as it’ll leave Barça just one point away from mathematical qualification with three games still remaining.\nXavi made it clear in his pre-match press conference that he’s taking this one very seriously, and he won’t hesitate in using the best available players to ensure his team has the best possible chance to win. He will of course be smart in managing the minutes with El Clásico in mind, but anyone expecting a team full of kids will be surprised by the starting lineup.\nThis isn’t the same Shakhtar team that was a brutal opponent in Europe in the past thanks in large part to losing a lot of talent due to the external circumstances in Ukraine, but those who’ve stayed are part of a tough, well-organized team that can also play if given the chance.\nThey will be physical and defensive and will hope for chances on the counter and set pieces, but there’s no doubt Shakhtar will be more than happy with a draw and won’t take unnecessary risks like Royal Antwerp did when they lost 5-0 to Barça at Montjuïc with a surprisingly bold approach.\nBarça must be ready to attack a low block and will need patience and creativity to find good opportunities, and must be clinical to convert their chances and earn the victory. They are favorites but it doesn’t mean it’ll be a walk in the park, and the Blaugrana can’t be looking ahead to Saturday if they want to win this one.\nLet’s dance.\nPOSSIBLE LINEUPS\nBarcelona (4-3-3): Ter Stegen; Cancelo, Araujo, Christensen, Alonso; Fermín, Romeu, Gündogan; Yamal, Ferran, Félix\nShakhtar (4-3-3): Riznyk; Konoplia, Bondar, Matviyenko, Azarov; Bondarenko, Stepanenko, Sudakov; Zubkov, Sikan, Newerton\nPREDICTION\nThis isn’t the same Shakhtar of the past, but they are still a solid team that can cause problems if Barça take them for granted. But I expect the Blaugrana to understand the importance of a good performance and the victory and to play seriously from the get-go to earn all three points: 2-0 to the good guys.",
  "word_count": 685,
  "scraped_at": "2026-02-14T02:10:28.703919",
  "_text_extracted": true
}