{
  "article_id": "b91e7266a313",
  "url": "https://www.nytimes.com/athletic/5569829/2024/06/18/endrick-yamal-paez-euros-copa-america/",
  "title": "Endrick , Yamal and Paez : How do you manage children at major international tournaments ? ",
  "date": "20240618T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The good news for Endrick and Lamine Yamal is that being a teenage star at a major international tournament no longer comes with boot-cleaning and tea-making duties.\nYamal, who is only 16 years old, will be flicking through his text books, rather than playing waiter to his Spain team-mates, when he’s not tormenting full-backs at Euro 2024.\nAdvertisement\n“I brought my homework because I’m in the fourth year of ESO (the last year of compulsory school study in Spain),” the Barcelona winger said last week, prior to becoming the youngest ever player to feature in the European Championship finals when he started against Croatia on Saturday.\nAs for Endrick, aside from trying to win the Copa America with Brazil in the coming weeks, the 17-year-old had his heart set on visiting a theme park in Florida since arriving in the United States, that tournament’s host nation. “I hope that when we have a day off, I can have lots of fun at Disney,” he said. “I went to the one in Paris, it was wonderful.”\nThe Brazil forward got his wish last week, with his team-mate Rodrygo.\nRonaldo – the Brazilian version – had a rather different experience at the same stage of his career.\n“The 1994 World Cup was my university,” Ronaldo told the Brazilian podcast Podpah. “Observing Romario and Bebeto up close… it was amazing. Bebeto was always very receptive and gentle. Not Romario. Romario took the p**s constantly. He would make me clean his shoes, fetch him coffee.\n“Young players were terrorised back then.”\nRomario, in the words of Ronaldo, was “a real inspiration” for a 17-year-old centre-forward travelling to his first World Cup finals and a player “you can’t help but love”. But Brazil’s prolific, flamboyant and often outspoken striker was also “a son of a b***h”.\n“I was a young man and there was a lot of bullying in football back then,” Ronaldo explained. “I suffered a lot with him (Romario) when we played together!”\nSociety has changed since 1994, and football has evolved with it. That’s not to say that young players no longer need to earn the respect of their elders when they break through at international level; they do. But the sort of culture that Ronaldo described with Brazil all those years ago – the equivalent of Harry Kane making Jude Bellingham put the kettle on in between cleaning his boots at the previous Euros in 2021 – has long disappeared.\nWhen Endrick was called up by Brazil for the first time, in November last year, the squad went out of their way to make him feel as comfortable as possible.\nAdvertisement\n“He knows a few players but we’re all here, trying to get him talking, swapping ideas,” Bruno Guimaraes, the Newcastle midfielder, said. “He’ll soon feel at home. Everyone is embracing him.”\nIt was similar for Yamal with the Spanish senior team, where it falls on a club team-mate to introduce a newcomer to the dressing room. In Yamal’s case, that responsibility rested with Gavi, the Barcelona veteran aged … 19.\nAt 16 years and 57 days, Yamal broke the record that was previously held by Gavi when he came on (and scored) in a 7-1 victory over Georgia last September to become the youngest-ever player to represent Spain at senior level.\nIt was a landmark moment for Spanish football but also totally in keeping with the national team’s direction of travel since then manager Luis Enrique’s appointment in 2018.\n“I don’t look at age, it doesn’t matter if a player is 18 or 35, I only look at how they are performing,” Luis Enrique once said.\nThat approach heralded a new era – the Spanish Football Federation talked about “a profound renovation that has consolidated a generational change in the team” when Enrique departed after the World Cup in 2022 – and led to a cultural shift that has continued under the management of successor Luis de la Fuente.\nIt didn’t go unnoticed, for example, that when Yamal came in for some rough treatment during a friendly against Brazil in March, it was Joselu, one of the old guard in the Spain squad, and a Real Madrid player at that, who leapt to the Barcelona winger’s defence from the substitutes’ bench.\n“We have to look after Yamal a lot,” Joselu, who at the age of 34 is more than twice Yamal’s age, said last year. “He is a jewel of our country.”\nThere was another example against Croatia at the weekend, when Dani Carvajal, the 32-year-old Real Madrid right-back, planted a kiss on Yamal’s face after the youngster set up his goal to make it 3-0.\nYoung or old, Real or Barca, who cares?\nIn the absence of any official mentoring scheme (something football doesn’t really do), Nico Williams, the 21-year-old Athletic Bilbao winger, has taken it upon himself to play the part of older brother to Yamal.\nAdvertisement\n“I try to advise him as best as possible,” Williams said. “We have a good friendship and I try to keep him calm and focused on the playing field. In the end, he is 16 years old.”\nThat simple fact – the age of footballers such as Endrick and Yamal and what life actually looks like for them off the pitch – is something that is easily forgotten when they play with a maturity that is way beyond their years.\n“Yamal, let’s say this again, is 16,” Sid Lowe wrote in UK newspaper The Guardian in March, after the teenager scored a magical goal against Real Mallorca. “Can’t drink, can’t drive, can’t smoke, can’t vote, can bend the ball into the top corner.”\nIn the case of the 16-year-old Bolivia forward Moises Paniagua, you can add “can’t apply for a visa to enable him to play at the Copa America” to the list.\nPaniagua, who earlier this year became the second-youngest goalscorer in the history of the Copa Libertadores, South America’s equivalent to Europe’s Champions League, had to be left out of Bolivia’s Copa squad last week because he didn’t have full parental authorisation to travel to the U.S. The story behind the story is that Paniagua’s father was unable to sign the visa application because he was travelling at the time the documents needed to be submitted.\nPaniagua’s predicament serves as a reminder that we are talking about children here – children who are good enough to sign an autograph for an adult but not old enough to sign a travel document for themselves. Even getting dressed in the same changing room as grown men can be problematic, because of safeguarding.\nMaybe all of that should make us stop and think about other things too.\nLast year, Endrick broke down in tears on the substitutes’ bench after he was withdrawn on the back of a barren run in front of goal for Brazilian club Palmeiras. On the face of it, his reaction seemed extreme. But then you have to remind yourself he is a boy.\nAdvertisement\n“Yes, it’s true, he covered his face because he cried,” Abel Ferreira, the Palmeiras coach, said afterwards.\n“I’m not his father, but I should have given him a hug.”\n“Ecuador threaten to axe senior stars after they took £17million Chelsea wonderkid Kendry Paez, 16, to New York strip club, where a team-mate threw cash at strippers hours before a game while partying with £115m Moises Caicedo”\nThat was the not-so-catchy-but-every-box-is-ticked headline on the website of one UK tabloid after photographs emerged of Paez, who is still attending school classes three days a week, being led astray by some of his international team-mates in the United States in March.\nIt was reported that Paez had gone to a club with a number of the Ecuador players in between international friendlies against Guatemala and Italy after the squad was given some time off. A few of the squad, including Paez, were also pictured in a strip club.\nAged 16, Paez was the wrong age (legally, he had to be 21 years old to enter the premises) and in the wrong place at the wrong time, which some would probably say is exactly what being a teenager is all about.\nThe difference with Paez, of course, is that he is no ordinary teenager. He is due to join Chelsea in May next year, on his 18th birthday, and people in Ecuador are already talking about him being the greatest footballer the country has ever produced. Naturally, that brings with it a spotlight that can be unforgiving when things go awry.\n“I feel sorry for him,” Andres Guschmer, Ecuador’s sports minister, said in the wake of the New York fallout. “Emotionally, he’s very affected.\n“I told him, not as a minister but as someone who knows him and cares for him, that you learn from mistakes. That he has to re-establish his image and his professional role. That he cannot commit these types of mistakes because it can be very costly.\nAdvertisement\n“He’s only 16. He’s playing with adults. They make you feel like adults, and at times make you do things that are for adults, but he’s just a teenager.”\nA statement released by the Ecuadorian football federation, in response to the images circulating on social media, described the events as “contrary to the values and principles that we defend and promote as an institution”.\nIn many ways, that whole episode highlighted the complications around a minor being away on international duty with a senior team. Just because a child can play football alongside men doesn’t mean that he’s ready to socialise with them. So what happens with these young players when they take their boots off?\nYamal has a legal guardian assigned to him while he is with the Spanish senior team and that person, who has been approved by his parents, accompanies the 16-year-old anytime he wants to go anywhere on his own. So, for example, if the Spain squad had a day off and Yamal wanted to take a stroll outside of the training camp in Germany, the guardian would be by his side.\nSomething similar is in place for Paez with Ecuador, who were working on child protection protocols covering players right across their age groups before the incident in New York and have since hired an expert in that field.\nYet even with measures in place, there is no guarantee that problems won’t arise.\nFor example, when asked specifically about Paez and how a 16-year-old came to be in even a regular nightclub while away on international duty, the Ecuadorian federation told The Athletic that he had authorisation to leave the training camp because he was with family members that evening.\nAs with many teenage footballers, Paez sounds like a livewire. Nicknamed “Di Maria” because of similarities with the Argentina winger of that name, Paez is no Angel. As well as having bags of talent, he’s got a personality – the sort that makes him a little bit loud at times. Throw in his status as a future Chelsea player and the naivety of youth, and there is vulnerability.\nAdvertisement\n“It’s very difficult at 16,” Manuel Sierra, Paez’s agent, told Spanish newspaper AS in January. “Imagine everything that’s coming his way, all the temptations and requests.”\nPerhaps there needs to be more of an acceptance that if we expect players to grow up much faster than normal on the pitch, they will make errors of judgement off it, especially when they are away from the routine and structure of their day-to-day life at home.\nWhen aged 20, Phil Foden was sent home from his first week away with England for what the manager Gareth Southgate described as a “very serious” breach of Covid-19 regulations in place at that time. Yamal was dropped from Spain’s under-17 squad early last year, along with two other players, for an unspecified act of indiscipline while on international duty in Portugal.\nAs for Romario, he was made to pack his bags at the World Youth Championship in 1985 for urinating off the balcony of the team hotel (an incident that Ronaldo would have done well to avoid bringing up in between asking “one sugar or two?”)\nThe list of misdemeanours for gifted young players is long. Ultimately, the role of those around them is to provide the best possible guidance to minimise the risk of anything happening, but also to keep things in perspective when something does go wrong.\nPaez is a prime example.\n“A lot has happened in the course of a year and it has changed his life,” Martin Anselmi, the coach who gave Paez his debut at Quito-based club Independiente del Valle, tells The Athletic. “He has become the guy who is responsible for taking Ecuador to the (2026) World Cup. Unconsciously, people have handed him that baton.\n“There have been a few of the wobbles that a boy of that age can have. But overall he has handled it pretty well. In his place, I would not have dealt with things nearly as well as he has. There has been a bit of vertigo, a couple of little slips, like the incident recently. But I think it’s normal.”\nJamie Carragher sighs.\n“With Theo, he shouldn’t have gone. It felt like he was a young kid who was a fan on the trip.\nAdvertisement\n“I know that it’s not to do with him at all, but that decision from (Sven-Goran) Eriksson (the England manager at the time) was just absolutely mind-boggling.\n“Theo was out of his depth, not just football-wise but maturity-wise, and I would have been exactly the same as him in that situation, thinking, ‘What am I doing here? I’ve never been in a (England) squad before’.\n“I always remember he was walking around with a camcorder. You felt a bit sorry for him. It was almost as if he couldn’t believe he was there – and understandably so.”\nCarragher is talking about Theo Walcott, the then Arsenal winger who was parachuted into the England squad for the 2006 World Cup finals in Germany.\nAged 17, Walcott had yet to play in the Premier League and was still waiting to make his Arsenal debut, after joining the club from Southampton in the January of that year. On top of that, Eriksson had never seen him play a competitive match with his own eyes.\nIt was a bizarre decision by Eriksson on so many levels and Walcott was as surprised as anyone else when he came out of a driving test centre in London, after passing his theory exam, and his father told him the news.\n“The call-up was an absolute shock,” Walcott, who never got to play at the World Cup, said three years later. “But I didn’t pick the squad, did I? It was like I was on holiday, really.”\nIt looked that way to some people when Walcott walked around Baden-Baden, the town where England were based, with that camcorder in his hand, making his own video diary of the trip. In reality, Walcott was only being what he was at the time: a teenager who had never been exposed to anything like this before.\nThe experience was an eye-opener for him and not all of it was enjoyable. Walcott was particularly upset by the way in which the paparazzi hounded his girlfriend, who was studying for her AS Levels at college back in Southampton at the time, and it’s clear that the football side presented challenges too.\nAdvertisement\nIn his autobiography, Walcott describes how he felt “really low” during his first couple of days on England duty. With Sol Campbell and Ashley Cole still with Arsenal in preparation for their Champions League final against Barcelona, Walcott remembers being at the training camp on the Portuguese Algarve and “wandering around feeling like a spare part”.\n“Quite understandably, a lot of them (the England players) didn’t have a clue who I was,” he writes.\nIn that respect, Walcott found himself in a totally different situation to 18-year-old Wayne Rooney at Euro 2004, and Yamal, Endrick and Paez now.\n“I had not played in the Premier League and I’m with Steven Gerrard and Frank Lampard,” Walcott said four years ago in an interview with UK newspaper the Daily Mail. “Maybe some are saying behind my back I shouldn’t be there – and I definitely should not have been there. It was scary. Honestly, it was scary.”\nCarragher, who played for England at that 2006 World Cup, nods.\n“I think if you’re ready on the pitch, the off-the-pitch side takes care of itself, because you get the respect of the players, and you feel like you should be there, because you can handle yourself football-wise in training. But as soon as the football doesn’t go well, or people aren’t quite sure why you’re there, I think you’re always going to have a problem off the pitch too.”\nAt least Walcott didn’t have to suffer the same fate as Ronaldo, whose life lessons with Brazil at USA 94 didn’t start and end with being Romario’s tea boy. On the eve of those World Cup finals, at a military base in Rio de Janeiro, Ronaldo was introduced to a player by the name of Carlos Mozer.\n“They decided to do all the physical exams there before we travelled to the World Cup,” Ronaldo said. “We had to stay the night there. Someone told Mozer — this huge, strong bruiser of a centre-back — that there was a kid in the squad who snored at night.\nAdvertisement\n“He had a laugh about it with everyone, but then he suddenly turned serious. He pointed at me, in front of everyone. I was already scared. He said, ‘I’ve been told that you snore. If you snore and I wake up, I’m going to beat the s**t out of you.’ I was 17. I couldn’t sleep. I didn’t close my eyes that night. I was dead on my feet the next day.\n“Afterwards, he told me that he was only joking.”\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 3009,
  "scraped_at": "2026-02-14T01:51:32.428481",
  "_text_extracted": true
}