{
  "article_id": "b9306426f8e5",
  "url": "https://bleacherreport.com/articles/10073024-top-winners-losers-after-wednesdays-champions-league-quarterfinals-leg-2-results",
  "title": "Top Winners , Losers After Wednesday Champions League Quarterfinals Leg 2 Results",
  "date": "20230419T221500Z",
  "domain": "bleacherreport.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Featured Video\nLeBron's Historic Triple-Dub 👑\nTop Winners, Losers After Wednesday's Champions League Quarterfinals Leg 2 Results\nThere wasn't much drama on Wednesday in the Champions League quarterfinals, though there were plenty of goals.\nOn one side of the bracket, Manchester City and Bayern Munich drew 1-1, with City advancing on aggregate, 4-1. On the other side, Inter and Benfica drew 3-3, with Inter advancing on aggregate, 5-3.\nAnd so, on to the semifinals we go. But first, the day's winners and losers.\nWinner: Erling Haaland\nYawn.\nEvery week you can basically etch it in stone that Erling Haaland will end up in the winner's list. This week, he at least made things interesting, skying a penalty that—at least briefly—made him a candidate to be one of the week's losers.\nAh, but not so fast—his goal was coming:\nInevitable. The man is inevitable. And City are rocketing into the semifinals because of it.\nLoser: Bayern Munich's Finishing\nMunich had its chances. The Bavarians held 58 percent of possession, got off 19 shots (seven on target) and had five corners.\nBut the final product just wasn't there. And Bayern's European season is over because of it.\nOne factor to consider—how much different would this Bayern side be if Haaland had chosen them over City?\nIt's a moot point now. Haaland is off to the semis with City, and Bayern is left to lick its wounds.\nWinner: Serie A\nIt will be an all-Milan affair on one side of the bracket, as AC Milan and Inter will face off in the ultimate rivalry matchup.\nThe last decade or so of Champions League football has been dominated by Spain (seven UCL champions since 2010-11), England (three UCL champions in that time) and Germany (two UCL champs in that time). Inter was the last Italian UCL champion, claiming the trophy in the 2009-10 season.\nAC Milan has won the Champions League twice this century, meanwhile, taking the title in the 2002-03 and 2006-07 seasons. But, in general, the balance of power in Europe has moved away from Italy.\nBut that may change this season, with one Serie A club guaranteed to be in the final. Wednesday's result may have gotten a bit messy, as Benfica put away two late goals to finish the day 3-3, but on aggregate, Inter was the better side, and a fun matchup is on the horizon.\nWinner: Football Fans\nSo, on one side of the bracket, you have one of the best rivalries in sport. And on the other side, you get the defending European champions, Real Madrid—who have won five of the last nine titles—taking on arguably the most talented club in the world, Manchester City, still hungering for their first European conquest.\nC'mon...how awesome is that?\nCarlo Ancelotti vs. Pep Guardiola. Haaland vs. Karim Benzema. Real Madrid's incredible European pedigree vs. City's astonishing wage bill and aspirations. World-class talent at every position on the pitch.\nIt's going to be a spectacle any self-respecting football fan won't miss.",
  "word_count": 500,
  "scraped_at": "2026-02-14T01:50:29.479785",
  "_text_extracted": true
}