{
  "article_id": "b93b81482651",
  "url": "https://www.teamtalk.com/arsenal/gunners-move-14-goal-striker-champions-league-brace-despite-price-tag-doubling",
  "title": "Arsenal transfers : Gunners  move  for 14 - goal striker after UCL brace despite price tag doubling",
  "date": "20241127T150000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal ‘move’ for 14-goal striker fresh off Champions League brace despite price tag doubling\nReports in Italy state Arsenal have moved for a free-scoring Serie A striker despite his price tag doubling in just three months.\nArsenal have put their season back on track with a pair of convincing wins over Nottingham Forest and Sporting CP. However, Liverpool have thrust themselves into the position of favourites to lift the Premier League title after opening up an eight-point gap over nearest challengers Manchester City.\nA common talking point around Arsenal at present is do the Gunners need a more potent striker in order to go from challengers to winners of the game’s top honours.\nViktor Gyokeres is a player of interest to Mikel Arteta and co, though talk of a reunion with former Sporting boss Ruben Amorim at Manchester United is growing.\nCaught Offside recently claimed Arsenal view Atalanta’s Mateo Retegui as a worthy ‘plan B.’ According to a fresh update from Calciomercato, Arsenal’s interest in the 25-year-old is legitimate.\nThe report’s headline read: ‘Arsenal move for Retegui and Atalanta sets the price.’ Little else regarding Arsenal’s interest or in what guise they’ve ‘moved’ for Retegui was divulged, though the player’s price tag was.\nRetegui joined Atalanta from Genoa in August for a fee believed to be worth €22m. Per the latest update, Atalanta now value the 18-cap Italy international at just over double that amount – €45m.\nRetegui scoring for fun at Atalanta\nRetegui was signed by Atalanta thanks in large part to Gianluca Scamacca suffering an ACL injury. Only when the former West Ham striker went down did Atalanta launch their move for Retegui late in the summer window.\nRetegui has made a blistering start to life in Bergamo, notching 12 goals in 13 matches in Serie A for Atalanta.\nWhat’s more, he doubled down on his superb form on Tuesday night when bagging a brace in the 6-1 thumping of Young Boy in the Champions League.\nREAD MORE: The key contract details of every Arsenal first-team player: Expiry dates, weekly wages, agents…\nLatest Arsenal news – Guler, Toure\nIn other news, Fabrizio Romano has revealed Arsenal stand no chance of prising Arda Guler out of Real Madrid in January.\nThe playmaker continues to be linked with a loan exit amid a lack of opportunities, though Real Madrid have zero intention of selling.\nElsewhere, Arsenal and Tottenham have reportedly joined the race to sign Hammarby IF wonderkid Bazoumana Toure.\nThe 18-year-old only joined the Swedish top-flight side from Ivory Coast team ASEC Mimosas back in March but already he is attracting interest from some of Europe’s biggest clubs.\nThe winger, whose contract runs until December 2028, enjoyed a breakout season in 2024, scoring nine goals and creating four assists in 23 appearances.\nNow, new reports suggest Arsenal and Tottenham are monitoring the progress of the Ivory Coast youngster – who has been rated at just £8.3m (€10m, $11.1m).\nIN FOCUS: Who is Mateo Retegui?\nWhen Retegui was first called up by Italy in March 2023, he was seen as an unorthodox solution to their striker shortage. Few, at the time, would have been able to predict how he would develop over the next couple of years – precisely because not many Italians will have known who he was.\nIndeed, Retegui was born in Argentina and was still playing his club football in South America when his international call-up – made possible because of his grandparents – arrived.\nYet Retegui made the most of it, scoring on his debut against England and then his second cap against Malta: the first Italy international to score in both of his first games for the country since 1968.\nThe striker earned a move to Serie A with Genoa in the summer of 2023 and by the end of the season – after scoring nine goals from 31 games – was named in Italy’s Euro 2024 squad.\nAnd since a summer transfer to Atalanta, the attacker’s form has exploded. By the end of November, Retegui has 14 goals from 19 games to his name – including his first two Champions League goals.\nA turbocharged striker willing to work on or off the ball, Retegui is just over 6′ tall and makes the most of his physicality. He is capable of leading a line himself or playing in a strike partnership, thanks to his ability at playing with his back to goal or when charging forwards.\nAnd with predatory instincts in front of goal, his hunger is converting into a lethal goalscoring rate.\nAreas to improve include his control of the ball, but the variety of ways he can finish chances make him a major threat up front. Of his first 14 goals for Atalanta, five have been right-footed, three left-footed, four headers and two penalties.\nAt the age of 25, Retegui is approaching his peak years and it appears he could be playing at a higher level than anyone would have predicted when he was a diamond in the rough in Argentina.",
  "word_count": 843,
  "scraped_at": "2026-02-14T02:02:07.183715",
  "_text_extracted": true
}