{
  "article_id": "b94ff8b49081",
  "url": "https://metro.co.uk/2025/04/11/brighton-give-kaoru-mitoma-injury-update-ahead-leicester-clash-22892170/",
  "title": "Brighton give Kaoru Mitoma injury update ahead Leicester clash",
  "date": "20250411T110000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kaoru Mitoma is an injury doubt ahead of Brighton’s Premier League clash against Leicester City, Fabian Hürzeler has revealed.\nAs another impressive season draws to a close, Brighton are ninth in the table but crucially just six points off the top five and Champions League qualification.\nBut the Seagulls are at risk of stumbling at the final hurdle, having claimed just one point from their last three games, including a 2-1 defeat to fierce rivals Crystal Palace last weekend.\nThey’ll need all their best players available if they wish to qualify for Europe, including Mitoma who has played in all 31 league games so far, recording seven goals and three assists.\nHowever, Hürzeler has revealed that the Japan winger picked up a heel issue in the defeat at Selhurst Park and faces a race against time to be fit for the visit of Leicester.\n‘Kaoru is doubtful. He will try it in training today,’ the German head coach said in his pre-match press conference on Friday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nEven if the 27-year-old were to be sidelined, the Seagulls are expected to easily overpower the Foxes at the Amex on Saturday, with Ruud van Nistelrooy’s side destined for relegation.\nAdditionally, Jan Paul van Hecke is suspended for the match after his late red card against Palace, while James Milner, Tariq Lamptey, Adam Webster and Georginio Rutter remain in the treatment room.\nIt seems Mitoma picked up the injury during a challenge with Palace defender Maxence Lacroix, with the Eagles awarded a free-kick in the aftermath, a decision Hürzeler still has issue with.\n‘I saw it a little bit different, that he [Mitoma] played the ball first and we got a foul against us and unfortunately Mitoma hurt himself,’ he added.\n‘The outcome could also have been that we might have a chance if the game had continued, because afterwards there was a two against one situation.\n‘It’s not a complaint. The referee made the decision, the decision was against us, we have to accept it.\n‘We have to try now to get Mitoma back on the pitch today so that he is an option tomorrow. That is the thing we can influence.’\nMore Trending\nThe Japan international’s consistent form over the past few seasons has seen him linked with a big-money move elsewhere, with Man Utd said to be interested.\n‘In terms of quality, he’s good enough for Manchester United,’ former Brighton boss Gus Poyet told MyBettingSites.co.uk.\n‘The question is, can he take the next step and perform at an even higher level, as a club like United demands?\n‘He’s a top player, and I hope he does because he’s so important to Brighton. I love watching him play.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Chelsea vs Ipswich: Latest team news, predicted lineup and injuries\nMORE: Edu sends message to Mikel Arteta and finally breaks silence on shock Arsenal exit\nMORE: Rayan Cherki fires dig at Manchester United tactics after Europa League draw vs Lyon",
  "word_count": 562,
  "scraped_at": "2026-02-14T02:26:33.618749",
  "_text_extracted": true
}