{
  "article_id": "b9afdfaaf53f",
  "url": "https://metro.co.uk/2025/10/30/joe-cole-names-chelseas-three-most-important-players-to-beat-tottenham-24573059/",
  "title": "Joe Cole names Chelsea three most important players to beat Tottenham",
  "date": "20251030T190000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Joe Cole says Chelsea are ‘relying’ on three players in order to beat Tottenham away from home in the Premier League on Saturday.\nThe Blues are below Thomas Frank’s side in the top-flight table ahead of the clash at the Tottenham Hotspur Stadium this weekend.\nChelsea lost 2-1 to Sunderland at Stamford Bridge in their last Premier League match while Spurs smashed Everton 3-0 to move up to third.\nFormer Chelsea star Cole believes Pedro Neto is one of his old club’s most important players if the west London side are to defeat Spurs.\nNeto has been in fine form for the Blues, registering three goal involvements across his last two Premier League games.\nCole also feels Jamie Gittens and Estevao Willian will be crucial for Chelsea to pick up three points against their London rivals.\n‘Chelsea going to Spurs has traditionally been a comfortable game for the club over the years,’ Cole told Paddy Power.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s the expectations at Chelsea. Tottenham are now all excited, and they’re looking up at Chelsea, who are not a million miles away from Spurs, but there’s a different feeling to this game.\n‘If Chelsea are going to beat Spurs at the weekend, you’re relying on players like [Pedro] Neto, who’s been brilliant, Jamie Gittens, who scored a goal and got an assist at Wolves, and Estevao.\n‘The goals will come from wide, for Chelsea, and the midfield. Enzo’s been chipping in, but it’s a real tough game for Chelsea.’\nCole: Chelsea must win a big trophy next season\nQuizzed on what constitutes a successful season for Chelsea, Cole added: ‘This is season four under this ownership. There are two trophies, albeit new trophies that don’t carry the same weight as a Premier League, an FA Cup, a Champions League, or even a League Cup.\n‘But they have delivered trophies, and they’ve restructured the whole club financially.\n‘This season, the expectation has to be for Chelsea to comfortably get into the Champions League position and mount a challenge in the league. I don’t think the squad’s strong enough to compete with Arsenal. I’m happy to go on record saying that now, they won’t win the league.\nMore Trending\n‘Chelsea needs to be comfortably in the Champions League and closer to the top of the league than they were last year for this season to be considered a success. And next season, they have to be winning the big trophies, because that would be five seasons into this project.\n‘You have to go with the owners, this is what they are, this is the restructuring of the club. Whether you like it or not, this is where it is at.\n‘I try and explain it with my best knowledge of how football clubs work, reading between the lines, because obviously the owners can’t come out and go, ‘Listen, we’re not going gung-ho like we did before, trying to win these big trophies, because we’ve got to fit within a financial model’.\n‘They’re not going to say that, because it’s not a good soundbite. From what I understand, that’s what they’ve had to do, and the club wasn’t in a great position financially, so they’ve had to be a bit more clever with how they operate.’\nMORE: Scott Parker hits back at Arsenal criticism with clear Mikel Arteta claim\nMORE: Paul Merson makes incredible Premier League title claim as Liverpool and Man City trail Arsenal\nMORE: Liverpool star tipped for move to Real Madrid in January transfer window",
  "word_count": 636,
  "scraped_at": "2026-02-14T01:59:14.377733",
  "_text_extracted": true
}