{
  "article_id": "b9b8a7b788af",
  "url": "https://www.caughtoffside.com/2025/02/14/rodrigo-mora-arsenal-united/",
  "title": "Revealed : Arsenal & Man United monitoring 6 G / A wonderkid ahead of potential £55m transfer",
  "date": "20250214T091500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal and Manchester United are closely monitoring Porto wonderkid Rodrigo Mora ahead of a potential transfer, sources have told CaughtOffside.\nThere is growing interest in Mora after his superb breakthrough season for Porto, with the 17-year-old attacking midfielder already contributing three goals and three assists in just 12 league appearances.\nAs well as Arsenal and Man Utd, there is also interest from Real Madrid, Paris Saint-Germain and Aston Villa, CaughtOffside understands.\nMora has a release clause worth £55m in his Porto contract at the moment, though sources have also indicated that that could rise further, to something closer to £70m, between now and 2027.\nRodrigo Mora is surely heading for a big transfer soon after stunning Porto breakthrough\nMora looks like the real deal and has impressed scouts from top clubs in recent times, with Arsenal and United among those showing the strongest interest.\nThe Red Devils are keen to sharpen up their recruitment and bring in top young players, as they showed in January with deals for Patrick Dorgu and Ayden Heaven.\nMora is highly regarded inside Old Trafford, with sources stating that key figures at the club are already convinced that the Portuguese wonderkid is destined to become a leading player in world football.\nStill, it remains to be seen where Mora will end up next, with Arsenal also surely a tempting potential destination for the teenager at this moment in time.\nThe Gunners have made real progress under the management of Mikel Arteta, and are surely not far away from winning a major prize like the Premier League title and perhaps even the Champions League.\nMora would surely rather be a part of that than gamble on joining this out-of-sorts United side, who remain in the bottom half of the Premier League table.",
  "word_count": 296,
  "scraped_at": "2026-02-14T01:58:05.350792",
  "_text_extracted": true
}