{
  "article_id": "b9e66369859d",
  "url": "https://menafn.com/1106628495/Onana-Confirms-Irresistible-United-Move",
  "title": "Onana Confirms  Irresistible  United Move",
  "date": "20230719T181500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- The Peninsula) AFP\nMilan: Andre Onana said that he couldn't the resist the chance to play at Manchester United as the Cameroon goalkeeper prepares to join the Premier League giants after one season at Inter Milan.\nOnana is set to sign for United in a deal worth a reported 55 million euros ($62 million) after joining Inter last summer as a free agent and starring in their run to the Champions League final.\nIn an interview with the Gazzetta Dello Sport published on Wednesday he confirmed his transfer to Old Trafford, saying he couldn't wait to rejoin his former Ajax coach Erik ten Hag.\n\"I really want to begin this new exciting adventure with a coach who as far as I'm concerned is a maestro,\" said Onana.\n\"I'm going to play in a great league and for a great club which has an enormous amount of history just like Inter.\n\"It's important to be honest and tell the people the truth. I'm someone who's always looking for new challenges and to play in the Premier League for a club like United is irresistible.\"\nOnana made a big impression at Inter and looked to be the perfect replacement for outgoing veteran Samir Handanovic.\nInstead Simone Inzaghi's team will again need to find a new main man between the sticks, one who is unlikely to have the 27-year-old's ability to start moves with his impressive ball control.\nOnana's ability with his feet is one of the reasons why he is teaming up again with Ten Hag, who with Onana in goal and a team packed with rising young stars took Ajax to the semi-finals of the 2019 Champions League.\nHe will move to England after a thrilling campaign with three-time European champions Inter, an ever present in their charge to the Champions League final where they were narrowly defeated by United's local rivals Manchester City.\nHe won the Italian Cup and Super Cup but the highlight of the season was undoubtedly beating AC Milan in the last four over two blockbuster matches which put Serie A back in the spotlight after years of decline.\n\"The San Siro and Inter fans made me feel something special and I won't forget that for the rest of my life,\" added Onana.\n\"For some matches we were really as one, I had the feeling of playing not as 11 players, but as 80,000. Being able to experience that was a privilege that football and my life have given me.\"\nOnana retired from international football last year with 34 caps after being dumped by Cameroon coach Rigobert Song at the World Cup for disciplinary reasons.\nHe was banned for 12 months by UEFA in February 2021 after testing positive for a banned substance, a punishment which was later cut to nine months by the Court of Arbitration for Sport.",
  "word_count": 473,
  "scraped_at": "2026-02-14T02:07:08.864066",
  "_text_extracted": true
}