{
  "article_id": "b9f6fcfb851d",
  "url": "https://www.thenationalnews.com/arts-culture/art-design/2025/09/14/arab-artists-at-aichi-triennale-2025-uae-leadership/",
  "title": "Arab artists take centre stage as Aichi Triennale 2025 opens under UAE leadership",
  "date": "20250914T050000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Aichi Triennale 2025 opened in Japan this weekend with a powerful political message from its artistic director, Hoor Al Qasimi, President of Sharjah Art Foundation.\nThe Triennale, which runs from September 13 to November 30 across the Aichi Arts Centre in Nagoya, Seto City and the Aichi Prefectural Ceramic Museum, is Japan’s largest international art festival.\nIts sixth edition brings together more than 60 artists and collectives from 22 countries and territories under the theme A Time Between Ashes and Roses, drawn from a poem by the Syrian poet Adonis.\nAt the opening press conference, Al Qasimi set the tone by framing the title through the lens of the 1967 Arab–Israeli war and the Israeli aggression in Gaza today.\n“As we reflect on the 1967 Arab–Israeli war, it isn’t more crucial as it is right now when we think about the devastation that is happening, the genocide and ethnic cleansing,” she said.\n“I am grateful for the Triennale for allowing me to use this platform to bring artists from different parts of the world echoing the same desires, the same needs, the urgent call for us to be in solidarity and to raise our voices to support each other in the end of genocide that is taking place. And I echo many people when they say, none of us will be free until all of us are free. Free Palestine.”\nAl Qasimi also linked Palestine’s plight to the struggles of indigenous communities worldwide, citing participating artists from Guatemala and Australia as examples. “I hope that we can find some solidarity and connections through this exhibition,” she said.\nHighlights from the programme\nAl Qasimi previewed several of the works across the three main venues.\nAt the Aichi Arts Centre, she highlighted a monumental installation by Dala Nasser, a Lebanese artist based in the UK. Nasser’s work draws on folk traditions and religious stories, focusing on the story of Noah’s Ark and the contested sites that claim to house his tomb in Jordan, Turkey and Lebanon.\nJapanese artist Ohkojima Maki presents two works made of construction tarpaulin, one referring to the mythological and the other reflecting on the legacy of Hiroshima and Nagasaki 80 years after the atomic bomb.\nThe Korean collective ikkibawiKrrr created a project with communities in Toyota City, including an installation inspired by the Hashino “under the bridge” festival and collaborations with small cafés run by the older generation.\nCross-cultural ceramics\nIn Seto, a city with a thousand-year ceramics heritage, Al Qasimi praised the support of the community. Visitors arriving by train encounter an interactive project by Iraqi–American artist Michael Rakowitz, who has opened a combined bar, restaurant and exhibition space serving a fusion of okonomiyaki and Arabic cuisine. Rakowitz is also showing works that explore restitution and the looting of Iraqi artefacts.\nNearby, Japanese artist Rui Sasaki has transformed a disused bathhouse into an immersive installation using local plants pressed between glass, preserving community memories of the space.\nSeto also hosts work by Robert Andrew, an Indigenous Australian artist who has created an installation at a working quarry. Using rammed earth and string, his piece slowly unravels during the exhibition, absorbing pigments from the earth as it settles.\nStrong Arab presence\nBeyond Rakowitz and Nasser, this edition features a record showing of Arab artists. Emiratis Maitha Abdalla, Afra Al Dhaheri, Shaikha Al Mazrou and Mohammed Kazem present works in the Contemporary Art programme.\nSyrian–French artist Simone Fattal, Syrian–British artist Hrair Sarkissian, Palestinian artists Basel Abbas & Ruanne Abou-Rahme and Mirna Bamieh, Iraqi–American painter Bassim Al Shaker, and Sudanese modernist Kamala Ibrahim Ishag are all part of the line-up. Tunisian siblings Selma & Sofiane Ouissi will stage their performance Bird in November.\nFor Al Qasimi, placing these voices within a Japanese context creates connections.\n“What we’re seeing today is connected,” she said. “This exhibition is also a reminder that we all live under the same sky, and we’re all connected in all of our issues. There is always a root cause of colonialism and occupation that is at the root of a lot of this evil.”\nAichi Triennale, located in Nagoya, Aichi and Seto, Japan, runs until November 30",
  "word_count": 691,
  "scraped_at": "2026-02-14T01:49:53.054042",
  "_text_extracted": true
}