{
  "article_id": "ba2232f2f8c9",
  "url": "https://thepeninsulaqatar.com/article/23/10/2024/al-arabi-eye-winning-start-at-gulf-club-champions-league",
  "title": "Al Arabi eye winning start at Gulf Club Champions League",
  "date": "20241023T094500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nAl Arabi coach Anthony Hudson speaks during a press conference (on the left), and Al Arabi's Italian midfielder Marco Verratti during a training session (on the right).\nDoha: Qatar’s Al Arabi will take on Al Qadsia of Kuwait in a Group B encounter in Doha today as the Gulf Club Champions League, organised by the Arab Gulf Cup Football Federation.\nThe re-branded tournament carrying lucrative prize money has returned after a nine-year hiatus.\nAt Al Thumama Stadium, Al Arabi look to begin their Group campaign on a high note, as the Anthony Hudson-coached side looks to bounce back from their recent defeat to Al Shamal in the Ooredoo Stars League.\n“Tomorrow’s match represents an opportunity for the Arab team to compensate for the previous loss against Al Shamal in the round,” Hudson told media during a press conference in Doha, yesterday.\n“The team, as always, will strive to achieve the desired results in the defensive lines within the group,” the American said.\nHudson admitted that the Group, which also includes Bahrain’s Al Riffa and Saudi side Al Ettifaq, poses a balanced competition.\n“All teams have a strong chance to qualify for the semi-finals, which makes the competition balanced and fair,” Hudson added.\nAl Arabi midfielder Luis Martin also addressed the occasion, noting that the team aims to get off to a winning start.\n“I’m happy to participate in the Gulf Championship and excited for tomorrow’s match as we aim to achieve victory,” Martin said.\n“The match won’t be easy, but we aim to make our fans happy and achieve our first win in the tournament,” Martin noted.\nAl Qadsia coach Zeljko Petrovic, meanwhile, highlighted that they have done their homework ahead of the opener.\n\"We have prepared well for tomorrow's match and we have the desire to achieve a result that satisfies our ambitions,\" Petrovic said.\nThe Montenegrin said his team is aware of Al Arabi's strength, noting that the Qatari club has several star-class players.\n\"Al Arabi are one of the strong teams and includes in their ranks many distinguished players, led by the Italian Marco Verratti, who has great experience thanks to his various experiences in Europe,\" Petrovic said, indicating the stage is set for a mouth watering clash.\nIn other Group B action today, Al Ettifaq will host Al Riffa today.\nGroup A action got underway yesterday as Iraq’s Duhok secured a 2-0 win over Yemani side Al Ahli Sanaa and UAE’s Al Nasr defeated Oman’s Dhofar 5-2.\nThe group stage will run until February 2025, with matches scheduled on November 5, 6, 26, 27, December 3, 4, and February 4, 5 next year.\nThe last leg will be on February 18, 19.\nThe top two teams from each group will qualify for the semi-finals, held from March 4 to 12, 2025, with the finals on April 8 and 15.\nThe prestigious tournament, inaugurated in 1982 as the GCC Club Championship, sees the clubs from across the Gulf region compete for the coveted title and a grand prize of $3m.\nAlongside the top reward for the champions, the runner-up will take home $1m. Each club will receive $300,000 for their participation, and additional incentives for semi-final qualification and away match wins.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 602,
  "scraped_at": "2026-02-14T02:08:12.411989",
  "_text_extracted": true
}