{
  "article_id": "ba575fe7809d",
  "url": "https://metro.co.uk/2025/05/16/chelsea-vs-man-utd-live-premier-league-latest-score-confirmed-lineups-23101076/",
  "title": "Chelsea vs Man Utd LIVE : Premier League latest score and goal updates",
  "date": "20250516T191500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have taken a huge step towards Champions League qualification with a narrow victory over Manchester United at Stamford Bridge.\nWith Aston Villa sealing victory over Tottenham the same evening, the Blues needed a win of their own to remain in the top five in their penultimate game of the season.\nMarc Cucurella gave the hosts the breakthrough after 71 minutes, latching onto Reece James’ brilliant cross to head past Andre Onana.\nThe win moves them into fourth place with Manchester City – in FA Cup final action on Saturday – slipping down to sixth as a result of those wins for Chelsea and Villa.\nChelsea head to Nottingham Forest, also still in the Champions League race, on the final day of the season next week.\nEven with the Europa League final against Tottenham just five days away, Ruben Amorim opted to name a strong starting XI on Friday night which included Harry Maguire, Casemiro, Bruno Fernandes and Amad Diallo – all expected to start in Bilbao next week.\nMore Trending\nBuilding some momentum ahead of that final was behind the manager’s thinking but his side turned in another turgid and uninspired Premier League performance as they recorded their 18th defeat of the season.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHarry Maguire thought he gave the visitors the lead after a bright start to the contest, producing a slick finish to convert Fernandes’ cross.\nThe England international was judged to have been offside with United failing to trouble the Chelsea backline beyond that with Rasmus Hojlund again anonymous up front.\nUnited will head into the final week of the season in 16th place, facing Villa at home next Sunday.\nMORE: Mohamed Salah hits back at ‘harsh’ Liverpool fans for booing Trent Alexander-Arnold\nMORE: What is DAMAC? The new Chelsea shirt sponsor explained\nMORE: Antonee Robinson injury update ahead of Brentford vs Fulham",
  "word_count": 360,
  "scraped_at": "2026-02-14T02:02:47.548942",
  "_text_extracted": true
}