{
  "article_id": "ba7da9ae2485",
  "url": "https://www.90min.com/posts/erik-ten-hag-anticipates-emotional-evening-first-man-utd-home-game-sir-bobby-charlton-death",
  "title": "Erik ten Hag anticipates  emotional evening  in first Man Utd home game after Sir Bobby Charlton death",
  "date": "20231023T164500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag anticipates 'emotional evening' in first Man Utd home game after Sir Bobby Charlton's death\n- Sir Bobby Charlton passed away at age of 86 on Saturday\n- He was widely regarded as one of the greatest footballers of all time\n- Man Utd return to Old Trafford for first match after his death on Tuesday against Kobenhavn\nBy Sean Walsh\nManchester United manager Erik ten Hag is keen for his side to win their first home game after the passing of Sir Bobby Charlton and believes Tuesday's visit of Kobenhavn will be an 'emotional' one.\nClub legend Charlton passed away on Saturday at the age of 86. He is widely regarded as one of England's finest ever footballers, helping the Three Lions to World Cup glory in 1966, while he won seven major honours with United - including their first European Cup - after surviving the Munich air disaster.\nUnited returned to Premier League action later on Saturday evening just hours after Charlton's death was announced. They beat Sheffield United 2-1 at Bramall Lane thanks to a stunning late strike from Diogo Dalot to record back-to-back victories for only the second time this season.\nTen Hag's press conference on Monday ahead of the visit of Kobenhavn in the Champions League was preceded by a moment of silence honouring Charlton.\n\"As you say, Bobby as a legend, a giant, not only for Manchester United but for football, his legacy, what he left, was high standards we have to live here every day. Our thoughts are with his family, wife and children,\" Ten Hag opened with.\n\"We are professionals, it's our job, but we must use those emotions in the right way. I saw a goal from Sir Bobby Charlton at Wembley and from distance and Diogo's was [like that against Sheffield United].\"\nWhen asked if he wants to win this first match back at Old Trafford after Charlton's death to honour the late midfielder, Ten Hag replied: \"Definitely. First, we want to win as a tribute to Sir Bobby Charlton, we always want to do that in a certain way and that's what we're aiming for.\n\"He is in front of Old Trafford, with Denis Law and George Best. He is always with us and they are always a huge inspiration for us, every day and for every game.\n\"It's always a special every night at Old Trafford, the fans are always so behind us, it's a strong connection. The last home game against Brentford, when the game was going against us, they stayed behind us. The fans stick with us in adverse moments, we fight together, so definitely tomorrow after the passing of Sir Bobby Charlton, their hero, legend and giant, I'm sure it will be a very emotional evening.\"\nDalot joined Ten Hag for Monday's press conference, and he too paid tribute to Charlton after his manager had compared their goals.\n\"First, it's a big privilege, when you look at Sir Bobby's goals and it relates to one of your own. I was fortunate enough to get to know him. He was always there after the game and he represented the standard of the club, which is something we have to look back and see, if legends like this won the best titles, we have to follow those steps,\" the full-back said.",
  "word_count": 556,
  "scraped_at": "2026-02-14T01:56:32.772223",
  "_text_extracted": true
}