{
  "article_id": "ba8908dbc773",
  "url": "https://www.managingmadrid.com/2024/2/12/24070411/three-observations-from-real-madrids-statement-win-over-girona",
  "title": "Three Observations From Real Madrid statement win over Girona",
  "date": "20240212T170000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid faced second-placed Girona on Saturday in a potentially title-deciding clash that ended in a 4-0 win for Los Blancos. A stunning strike from Vinicius Jr., followed by two goals from Jude Bellingham and another one from Rodrygo Goes, made sure that everyone witnessed that Real Madrid are still very much the best team in Spain.\nThree Observations From Real Madrid’s statement win over Girona\nLet’s get into three quick observations.\nThis is a team of winners\nI don’t quite know how they do it, but Carlo Ancelotti’s men almost always arise to the occasion of the big stage. In matches like this, a switch goes off in Real Madrid’s collective brain. They will fight for each duel, play the perfect game and win. Each and every player in the (makeshift) team played the perfect game in a season-defining event against their direct league competitors.\nVinicius Jr, in games like this, is untouchable\nIn my post-Clasico piece, I talked about Vinicius Jr. saving his best for the absolute big games: the finals, the crucial league games, and the big Champions League knockout games. We saw that same, big-game version of Vinicius again against Girona. It’s not a coincidence that Vinicius’s best performance of the season happened to be in Real Madrid’s most crucial game so far.\nHe cooked them so much that Girona’s right-back, Yan Couto, had to be consoled by Real Madrid players after the game. Vinicius had: Five dribbles completed, five shot-creating actions, three key passes, a goal, two assists, and an awesome defensive shift (more on that in a second).\nApart from that, Vinicius had that aura around him, making everyone believe he could not do anything wrong. Vinicius was at his absolute peak, and was so, so good and crucial on the wing. No shenanigans, no problems — and a standing ovation from the entire Bernabeu to cap it all off.\nVinicius scored a hat-trick against Barcelona, but in my opinion, this performance was his best one this season by quite some distance. More of this, please!\nThe perfect defensive game plan\nReal Madrid had no central defenders and came away with a clean sheet anway. That was not luck. For starters, Dani Carvajal and Aurelien Tchouameni had brilliant games, as did Lucas Vazquez. They locked Girona up, suffocating them inside their half and not letting them get a sniff of the goal. It was fun to see the entire team locked in on both ends of the field.\nThe entire team had to be in that ‘locked-in’ mindset to get everything done on the defensive end. Eduardo Camavinga was once again awesome in front of the defense. His presence was so important because Tchouameni was forced to play centre-back, and he did not disappoint one bit, while also contributing so much to the attacking third. It’s been a while since I’ve seen a bad Camavinga game, and I want this run to continue.\nVinicius Jr probably had his best defensive performance in quite some time. He came back to Real Madrid’s own half, shielded the ball well. and won it back to start counters on a few occasions.\nThese sorts of games are the ones that really show you how it’s not just individuals playing the team and Ancelotti letting them do whatever they want. It’s a team with a plan. Real Madrid have a coach in Ancelotti who knows how to empower the team’s strengths, hide its weaknesses, and play a brand of football that only Real Madrid can play. It is a brand that doesn’t have too many restrictions on players but has a really good, efficient system that gets the best out of its players – something that Ancelotti deserves so much credit for.\nAncelotti’s current season so far takes his legacy to an even higher level. Regardless of what happens from this point on, Ancelotti has made sure the entire world knows that he’s still got it. He deserves every bit of credit for making this team this good even after so many injuries.",
  "word_count": 674,
  "scraped_at": "2026-02-14T01:51:19.063978",
  "_text_extracted": true
}