{
  "article_id": "ba89a3e1e0d5",
  "url": "http://usa.chinadaily.com.cn/a/202312/01/WS656934cfa31090682a5f0e19.html",
  "title": "Teenager Paz passes the test in thrilling Madrid comeback",
  "date": "20231201T024500Z",
  "domain": "usa.chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Teenager Paz passes the test in thrilling Madrid comeback\nTwo late goals by 19-year-old Nico Paz and Joselu gave Real Madrid a 4-2 comeback win against Napoli on Wednesday, securing top spot in Champions League Group C with one round of matches remaining.\nThe 14-time champion, who had already secured qualification to the last 16, maintained its 100 percent record and has 15 points from five games, eight points ahead of the Italian champion.\n\"It was a difficult match,\" Madrid coach Carlo Ancelotti said. \"But we got the victory and reached our goal of finishing first in the group.\"\nNapoli, second on seven points, needs a draw in its final game against Braga, third on four points, to qualify for the knockout stage.\nUnion Berlin is bottom on two points after a 1-1 draw against Braga earlier on Wednesday.\nAncelotti was relieved by the victory, and as he said the team needs some rest.\n\"It was a difficult, complicated match,\" said the Italian. \"But during the most difficult part of the match we found the energy to win. The last 20 minutes were very good and changed the dynamic.\n\"We fought and competed until the end and we achieved our objective of finishing top of the group. Now, let's get some rest, we need it.\"\nMadrid started well but was surprised by a quick counterattack by the visitor, with Giovanni Di Lorenzo assisting Giovanni Simeone to open the scoring with a close-range strike in the ninth minute that at first sight looked like it had been saved by goalkeeper Andriy Lunin.\nThe referee let it stand as the goalline technology confirmed the ball had fractionally crossed the line.\nMadrid hit back quickly, with Rodrygo equalizing with a fine shot into the top corner two minutes later, and they went ahead with a Jude Bellingham header in the 22nd.\nIt was Bellingham's 15th goal in 16 games in all competitions for Madrid this season, making him the first player in the club's history to score in each of his first four European Cup games.\nThe Englishman has outdone last season's tally of 14 in 42 games with Borussia Dortmund and has surpassed the achievements of Real heroes Cristiano Ronaldo, Alfredo Di Stefano and Pruden Sanchez, who scored 13 goals in their first 15 games, and Ferenc Puskas, who had 11.\n\"He's spectacular in getting into the box, he comes into the box like a motorbike,\" Ancelotti told Movistar Plus.\n\"It's surprising because nobody could have imagined such fast adaptation here, to this club and the football he is showing. He surprises the fans, teammates and even rivals.\"\nMadrid kept pressing and Brahim Diaz could have extended its lead in the 31st minute but his shot went just wide.\nHowever, Napoli made the most of the first chance they had after the break with Frank Anguissa equalizing from a rebound in the 47th minute, while Madrid suffered with several wasted chances by substitute Joselu, including an absolute sitter from close range in the 79th.\nIt was another substitute, academy midfielder Paz, who gave Real the lead again with a stunner from outside the box in the 84th minute.\nJoselu ended up scoring the fourth goal with a tap-in in added time.\nAt 19 years, 82 days, Paz became the third youngest player to score for Madrid in the Champions League, after Rodrygo (18 years, 301 days) and Raul Gonzalez (18 years, 113 days).\n\"Just before conceding the third goal, we created chances to score a third ourselves,\" Napoli coach Walter Mazzarri said. \"We knew Madrid is good on the counter, we should have been more careful when we were level. We played really well until we went 3-2 down.\"\nJoselu apologized to the fans at the Bernabeu while celebrating after having missed a few good chances earlier in the match.\n\"It's about pushing your teammate, your friend, the soldier next to you over the line,\" Bellingham said about Joselu. \"We know what he can do when the ball's delivered in the right area. Tonight he put a few (shots) wide but that's the life of a striker. It was important for me to look for him more than anything. Especially in that area of the pitch, I'm happy for him.\"\nAgencies\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 778,
  "scraped_at": "2026-02-14T02:17:09.415880",
  "_text_extracted": true
}