{
  "article_id": "ba8c8656149b",
  "url": "https://www.caughtoffside.com/2024/02/23/man-utd-could-offer-more-than-e60-70m-for-26-year-old-brazilian-defender/",
  "title": "Manchester United Transfer News : Red Devils could offer over €60 - 70m for Gleison Bremer",
  "date": "20240223T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have been linked with a move for the Juventus defender Gleison Bremer.\nThe 26-year-old has been a key player for the Italian club since joining them from Torino and his performances have attracted the attention of the top clubs.\nThe report from Tuttosport mentions that Tottenham have enquired about him in the past and Manchester United could now submit a lucrative proposal to sign him.\nThe report states that the Red Devils could offer in excess of €60-70 million for the Brazilian defender.\nManchester United need to bring in upgrades on players like Harry Maguire and Jonny Evans. The Brazilian defender could prove to be a quality acquisition.\nHe has the physicality and technical attributes to do well in English football and he could help the Red Devils tighten up defensively.\nIt remains to be seen whether Juventus are prepared to accept an offer for the South American at the end of the season. He is an indispensable asset for them and losing him would weaken their defensive unit severely.\nOn the other hand, Manchester United must look to secure Champions League qualification if they want to attract top class players like Bremer. The Red Devils have had a mediocre campaign so far and they will need to finish the season strongly in order to secure a top four spot.\nThe Brazilian defender has previously admitted that a move to the Premier League could be tempting for him and it remains to be seen how the situation develops.\n“The Premier League is an exciting championship, I would like to play there one day “, he said.",
  "word_count": 268,
  "scraped_at": "2026-02-14T01:48:39.896829",
  "_text_extracted": true
}