{
  "article_id": "ba98adff9d33",
  "url": "https://www.pressdemocrat.com/article/trending/bellinghams-stunning-goal-rescues-england-in-2-1-win-over-slovakia-to-adva/",
  "title": "Bellingham stunning goal rescues England in 2 - 1 win over Slovakia to advance to Euro 2024 quarters",
  "date": "20240701T010000Z",
  "domain": "pressdemocrat.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "GELSENKIRCHEN, Germany (AP) — Jude Bellingham needed to produce something special to keep England at Euro 2024.\nAnd he did.\nEngland was seconds away from slumping to one of the biggest upsets in the history of the European Championship when trailing 1-0 to Slovakia deep into stoppage time in the round of 16 on Sunday.\nBut Bellingham’s spectacular overhead kick in the fifth of six added minutes at Veltins Arena sent the game into extra time, and Harry Kane sealed a 2-1 win that keeps alive England’s hopes of a first major trophy since 1966.\n“I think it was 30 or 20 seconds until we were out of the European Championship,” Bellingham said. “It’s hard to deny that it was one of the most important moments of my career so far.”\nHe’s had a few.\nThe midfielder, who turned 21 on Saturday, has just completed a stunning debut season at Real Madrid, winning the Champions League and the Spanish title.\nAt such a young age, he is one of England’s most important players at Euro 2024 and delivered a moment of magic when all hope seemed lost.\n“His world is different to pretty much every other 21-year-old in the world… what he can provide are these moments where he grabs things by the scruff of the neck and his character and his personality creates moments that can change in a big game,” England manager Gareth Southgate said.\nEngland – one of the pre-tournament favorites and runner-up at the last Euros – trailed 1-0 to 45th-ranked Slovakia after Ivan Schranz’s 25th-minute goal.\nWith the clock running down, Bellingham’s time came.\nKyle Walker launched a long throw from the right. Marc Guehi leapt to flick the ball on.\nBellingham was in the box and had to readjust his body to execute a perfect overhead kick, sending the ball into the bottom corner to leave Slovakia goalkeeper Martin Dubravka stuck on his line as he watched it nestle into the back of the net.\nSome England fans had already left the stadium. Those inside erupted.\n“I had a funny feeling the game wasn’t dead and I know that sounds ridiculous. We were pushing and probing,” Southgate said.\nBellingham’s goal was England’s first shot on target in the match.\nIt didn’t have to wait long for its second as Kane headed home to score his seventh goal in his last seven knockout games at major tournaments. It was also a record-extending 65th for his country.\nEngland will play Switzerland in the quarterfinals in Duesseldorf on Saturday.\nBut for so long it looked like being a humbling exit for Southgate’s team — bringing back memories of its elimination at the hands of Iceland at Euro 2016.\n“It’s knockout football and anything is possible,” Southgate said.\nEngland had faced fierce criticism for its performances in the group stage and boos rang around the stadium in the first half as frustration grew among its fans following Schranz’s strike.\nIt needed to improve in the second half. Phil Foden had a goal ruled out by VAR, Kane headed wide from close range and Declan Rice hit the post in the 81st.\nSlovakia had already produced a shock by beating No.3-ranked Belgium in the group stage and it looked like doing it again against the No. 5-ranked team in the world.\nThat was until Bellingham struck.\n“They scored a goal from a player who is valued at 100 million euros. This was a team worth 1.5 billion (euros). You concede just half a meter and you will get punished,” Slovakia coach Francesco Calzona said.\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nAP Euro 2024: https://apnews.com/hub/euro-2024",
  "word_count": 606,
  "scraped_at": "2026-02-14T01:51:32.418920",
  "_text_extracted": true
}