{
  "article_id": "baa75def73d2",
  "url": "https://www.90min.com/posts/every-player-to-win-ballon-dor-world-cup-same-campaign",
  "title": "Every player to win the Ballon dOr and World Cup in the same campaign",
  "date": "20231101T151500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every Player to Win the Ballon d’Or, World Cup in Same Year\nThe World Cup is the greatest collective prize available in world soccer, but it often comes inextricably linked with the grandest individual honor on offer—the Ballon d’Or.\nGuiding your nation to glory on the international stage sits well with voters come awards season, with extra pressure added for Ballon d’Or hopefuls in a World Cup year.\nMany past world champions have gone on to secure the fabled golden ball the very same year. International success is not the only thing that counts, but it certainly boosts the odds of earning the most coveted of awards.\nHere are the players to have won the Ballon d’Or after a World Cup-winning campaign.\nThe Seven Players to Win the Ballon d’Or, World Cup in the Same Year\nBobby Charlton (1966)\nA decade after English icon Stanley Matthews became the inaugural Ballon d’Or victor, Bobby Charlton scooped the prize. The Manchester United hero was awarded the crown on Dec. 27 as a late Christmas present following an astonishing World Cup campaign with England over the summer.\nWith the award previously dished out based on achievements across a calendar year as opposed to an individual season, even more onus was placed on major international titles such as the World Cup, with Charlton integral to England’s sole triumph in 1966.\nThe swashbuckling midfielder edged out Eusébio in the vote, whose Portugal side he conquered in the World Cup semifinals with a decisive brace. Ironically, the deciding vote was cast by the Portuguese journalist Fernando Couto e Santos from Mundo Desportivo, in an act of anti-patriotism which would irk Eusébio years later.\nPaolo Rossi (1982)\nThree goals at the 1978 World Cup had earned Paolo Rossi a spot in FIFA’s Team of the Tournament, but Italy’s fourth-place finish meant only fifth in that year’s Ballon d’Or vote. However, four years later, the Azzurri sharpshooter fired himself and his country to glory to make sure he wasn’t to be overlooked again.\nRossi failed to hit the back of the net in any of Italy’s three matches in the first group stage at the tournament in Spain, but he still claimed the Golden Boot courtesy of six goals across the final three matches of the tournament—including the opener in the 3–1 victory over West Germany in the final.\nMarco Tardelli and Alessandro Altobelli were also on the scoresheet that day, but Rossi stole the show single-handedly in the second group stage and semifinal. A hat-trick against Brazil guaranteed progression to the last four, where the Juventus forward proceeded to score twice in victory over Poland.\nLothar Matthäus (1990)\nWest Germany’s charge to World Cup glory in 1990 was powered by Lothar Matthäus.\nThe industrious midfielder’s brilliance was already known across the globe as he led Bayern Munich to immense success in the 1980s, after which he teamed up with Inter as he transferred his skills to Italy’s top tier. He was critical in the club’s 1988–89 Serie A crown—their first league title in almost a decade.\nBut the crowning achievement of Matthäus’s career was the 1990 World Cup. He scored four times at the tournament, including a decisive penalty in the quarterfinal against Czechoslovakia, and finished runner-up for the competition’s Golden Ball, only falling short of top scorer Salvatore Schillaci of Italy.\nMatthäus’s genius was recognized in the 1990 Ballon d’Or vote, where he bested Schillaci and compatriot Andreas Brehme.\nZinedine Zidane (1998)\nZinedine Zidane entered the 1998 World Cup in France having just claimed the Serie A title for Marcello Lippi’s Juventus, with the weight of expectation falling on the talisman’s shoulders to deliver glory to the French at a home tournament.\nThe graceful playmaker wasn’t entirely faultless, getting sent off in the group stage against Saudi Arabia without quite stamping his authority over the knockout rounds. Yet, he picked his moments well. At Stade de France against reigning champions Brazil, Zidane came alive.\nThe Juventus maestro decided the showpiece event with two first-half headers, allowing France the necessary breathing space to deal with Marcel Desailly’s 68th-minute red card. Emmanuel Petit eventually rounded off the scoring as Zidane scooped the Player of the Match award.\nAn even bigger individual honor was to come, however, with Zidane comfortably beating out the competition to clinch his only Ballon d’Or crown.\nRonaldo (2002)\nHeartbreak for Ronaldo at the 1998 World Cup turned to ecstasy in South Korea and Japan four years later. O Fenômeno had already claimed the Ballon d’Or in 1997 following his exploits with Barcelona and Inter, but another arrived off the back of an incredible World Cup campaign with Brazil.\nRonaldo scored four times in the group stage as Brazil eviscerated their inferior opponents and he refused to slow down in the knockout rounds. A goal in the last 16 victory over Belgium was followed by the winner against Türkiye in the semifinal, with the quarterfinal win over England the only match in which he didn’t best the opposition goalkeeper.\nThe final was set up for more Ronaldo magic and he delivered without hesitation. The striker’s unbridled power and frightening pace proved too much for Germany and he scored twice in the second half to guide the Seleção to a fifth World Cup title.\nA move to Real Madrid and Ballon d’Or glory followed during the remainder of 2002.\nFabio Cannavaro (2006)\nOnly three defenders have ever won the Ballon d’Or. That’s how good Fabio Cannavaro was for club and country.\nThe center back had guided Juventus to Serie A glory in 2005–06—although their title was later revoked following their role in the Calciopoli scandal—and entered the summer’s World Cup in Germany brimming with confidence.\nItaly topped their group due to their resilient backline, which Cannavaro led with distinction, keeping two clean sheets en route to the knockout phase. The Azzurri continued to progress courtesy of their watertight defense, with three more clean sheets kept between the last 16 and semifinal.\nWhile Italy were unable to shut out France in the final, they managed to take the game to penalties after Zidane’s ludicrous headbutt saw the Frenchman sent off in extra time. The Azzurri triumphed on spot kicks, with Cannavaro claiming a place in FIFA’s All-Star Team and subsequently scooping the Ballon d’Or.\nLionel Messi (2022–23)\nThe combination of Ballon d’Or voting changing to a seasonal as opposed to yearly cycle and the decision to host the 2022 World Cup in Qatar during the winter months means Lionel Messi didn’t clinch his record-extending eighth Ballon d’Or until late 2023.\nMessi’s club success was almost entirely inconsequential following his astonishing 2022 World Cup campaign, which guaranteed the greatest player of all time a first world title with Argentina before his retirement.\nThe diminutive magician wasn’t just part of Lionel Scaloni’s winning squad, he was the beating heart of their successful campaign. He scored five goals leading up to the final as he resuscitated La Albiceleste following an opening game defeat to Saudi Arabia, but there was still room in the tank for some more sorcery in the final.\nMessi scored twice during an astounding battle between Argentina and France, overshadowing Kylian Mbappé’s hat-trick as the South Americans triumphed on penalties following a 3–3 thriller after extra time.\nHe may have been pipped to the top scorer award by his former French clubmate, but he still won the Golden Ball and the following Ballon d’Or.\nREAD THE LATEST WORLD CUP NEWS, PREVIEWS & ANALYSIS HERE\nEwan Ross-Murray is a freelance soccer writer who focuses primarily on the Premier League. Ewan was born in Leicester, but his heart, and club allegiance, belongs to Liverpool.",
  "word_count": 1275,
  "scraped_at": "2026-02-14T01:51:09.205174",
  "_text_extracted": true
}