{
  "article_id": "baac88a6c318",
  "url": "https://www.thenationalnews.com/news/uk/2025/08/29/uk-bans-israeli-officials-from-major-defence-exhibition-in-london/",
  "title": "UK bans Israeli officials from major defence exhibition in London",
  "date": "20250830T073000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Britain has barred Israeli officials from attending a major defence exhibition in London next month owing to the escalating war in Gaza.\nIn a move that will further fray relations between the countries, no Israeli government representatives will be allowed to attend the Defence and Security Equipment International show.\nThe UK government described Israel's escalation of its assault on Gaza as “wrong” and said “as a result” no Israeli government officials would be invited to the exhibition, which is to run from September 9 to 12. Israeli troops are preparing for an assault on Gaza city in the latest phase of a conflict that began in October 2023.\nIsrael condemned Britain’s “deliberate and regrettable act of discrimination” and said it would withdraw from the exhibition, which attracts more than 45,000 delegates from the global defence sector. The Israeli government said the decision “plays into the hands of extremists and introduces political considerations wholly inappropriate for a professional defence industry exhibition”.\nRelations between the UK and Israel deteriorated after Britain imposed sanctions on two Israeli cabinet ministers and said it would recognise a Palestinian state, unless Israel agreed to a ceasefire and revived the prospect of a two-state solution. British authorities also suspended some arms licences to the country.\nMore than 62,900 Palestinians have been killed since the war began and the UN last week declared a famine in the enclave, where civilians are struggling with a lack of basic necessities.\n“There must be a diplomatic solution to end this war now, with an immediate ceasefire, the return of the hostages and a surge in humanitarian aid to the people of Gaza,” the UK government said in its statement.\nAt the Paris Air Show in June, an even tougher stance by the French government meant organisers were ordered to hide displays from Israeli companies, including Israel Aerospace Industries, Elbit Systems and Rafael Advanced Defence Systems.\nIt is unclear what action officials at the UK exhibition will take, but Israeli companies will be able to attend, albeit with increased security.\nThe ban on Israeli officials was welcomed by the Palestinian Solidarity Campaign in the UK, which said allowing senior figures to attend would have been an \"egregious act of complicity” in Israeli actions in Palestine.\nIsrael said its war effort was also targeting threats to the West, such as the Houthi forces attacking international shipping. \"This decision by Britain plays into the hands of extremists, grants legitimacy to terrorism, and introduces political considerations wholly inappropriate for a professional defence industry exhibition,” the Israeli government said.",
  "word_count": 423,
  "scraped_at": "2026-02-14T01:49:44.662192",
  "_text_extracted": true
}