{
  "article_id": "baafd7e065bf",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-news-coverage/2023/3/16/23642398/liverpool-fc-team-news-klopp-we-came-here-with-the-backpack-three-goal-difference-real-madrid-cl",
  "title": "Jurgen Klopp :  We Came Here With The Backpack With The Three Goal Difference  ",
  "date": "20230316T053000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "To be honest, this outcome was not entirely unexpected. Liverpool traveled to the Bernabeu Stadium to face Real Madrid in the second leg of their knockout stage tie. They carried with them a three goal deficit from the loss at Anfield two weeks ago, and despite a record breaking performance against Manchester United, were unable to keep that momentum going.\nJurgen Klopp: “We Came Here With The Backpack With The Three Goal Difference”\nThe manager gives his assessment of the loss to Real Madrid and being knocked out of the Champions League.\n“We came here with the backpack we had with the three goals difference. You need a special performance and we didn’t show a special performance tonight,” manager Jürgen Klopp said following the match.\n“It was, in moments, a good performance, but Real Madrid was, for the whole game, the team in control of the game. They had the better chances, Ali had to make two sensational saves to keep us in the game and that’s the reason.\n“Again, if you want to go through you need to be outstanding; if you want to win the game, you need to be really good. In the end, Madrid were the better team and that’s why the right team went through to the next round.”\nYes, the loss means that Liverpool are out of the Champions League for the rest of the season, leaving the Premier League as their only competition this year. All the better, really, as they now need to put all focus on making it into the top four to ensure that they are back in the Champions League next season. Not only for the money and the potential signings that Liverpool need to make, but the history of the club.\n“With the history we have in this competition, we start usually in the competition with the idea of winning it, to be honest,” Klopp continued.\n“We reached the final a few times, didn’t win the final that often, that’s true, but we were there three times in the last few years and that’s why I believe if you want to win the competition, you have to be outstanding. We weren’t tonight, so that’s why it’s then fair that we go out.\n“But of course, it is the competition and we want to be part of it every year. That’s a massive task for us, we all know that. When we come back from the international break we have a proper football week ahead of us, I would say, with three games: City, Chelsea and Arsenal, which will then probably define what we get out of it. People might say we lost it in Bournemouth, but I think this week is a pretty decisive one, so we have to hope now the boys come back healthy, early enough, in the right shape and then we will try it.”\nLooking ahead to those matches doesn’t really feel fun. Sure, winning 7-0 at Anfield against one of your oldest and most bitter rivals is great, but it means nothing when you give away a win to bottom of the table Bournemouth by one measly goal. Especially knowing that that run ahead will be essential in making sure that you do take over one of those all-important Champions League spots.\n“Our job is to squeeze absolutely everything out of this season what is possible. It’s a strange one,” Klopp added.\n“Our recent two games, obviously a sensational performance against Manchester United, which is a real good football team. And then a really bad performance against Bournemouth, which is a good football team as well, but we should not lose this kind of game. It put us then under more pressure.\n“If we could have three points then I think everybody really could have felt, or smell our breath, if you want. There is again distance because other teams won their games... it is clear, we want to be top four, but if we can do that, we will decide on the pitch [and] not here in the press conference.”\nHonestly, the sooner we can get Real Madrid in our rear view, the better. The worst part is that we have an international break to stew on it, and get ready for Manchester City on April 1st (not a joke).",
  "word_count": 718,
  "scraped_at": "2026-02-14T02:16:40.071501",
  "_text_extracted": true
}