{
  "article_id": "bac3b1c27e83",
  "url": "https://neoskosmos.com/en/2024/07/04/features/how-greece-overcame-the-group-of-death-to-lift-the-euro-trophy-in-portugal-20-years-ago/",
  "title": "How Greece overcame the  group of death  to lift the Euro trophy in Portugal 20 years ago",
  "date": "20240704T110000Z",
  "domain": "neoskosmos.com",
  "source_country": "Greece",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was a football triumph like no other! The ultimate underdogs managed to lift the trophy. This was Greece’s achievement back in 2004 when its national team was crowned European Champions, causing pandemonium among Greeks around the world, including Australia.\nTwenty years have passed since the impossible dream of winning the 2004 Euros, a moment that has remained in the minds and hearts of all Hellenes ever since.\nThose were the days when Federation Square and Lonsdale Street in Melbourne and Brighton-Le-Sands in Sydney, which, along with other places, had been transformed into a sea of proud Hellenes.\nThe tournament’s events attracted well-known personalities, among them being the then NSW Premier Bob Carr who went to the southern suburbs of his capital city to watch the final and celebrate with the tens of thousands of his Greek-Australian constituents.\nIt was on this day, July 4, 2004 that the “Ethniki” completed the “David and Goliath” story, with striker Angelos Charisteas’ 57th minute header proving the difference as they defeated Portugal and lifted the Cup.\nThe victory was felt across the globe as Greeks from the homeland and the diaspora collectively flooded the streets in celebration of the national team’s heroics.\nThe story of Greece’s Euro win has become part of football folklore, standing as a grand example of the phrase “anything is possible”.\nA major part of the successful team was Ioannis Topalidis, Greece’s assistant coach at the time, who revealed to Neos Kosmos that they were just happy to have qualified for the tournament.\n“We were very pleased just to make the Euro because it was a very difficult qualification for us, with hard opponents like Spain and Ukraine – a strong team at the time with players like Andriy Shevchenko,” Topalidis said.\nThe assistant coach explained that the team was determined to make the nation proud, with everyone conscious of how poorly Greece had fared at the 1994 World Cup (the previous tournament they had qualified for), losing all three games, conceding ten goals and scoring none.\n“We were confident that we would have a good display in Portugal. Of course, we were not thinking about winning the trophy in the early stages, but we were confident we could have a good showing,” he said.\nThe public did not share the Greek team’s optimism before the tournament, raising their concerns extensively, though it did not faze head coach Otto Rehhagel in the slightest.\n“Rehhagel was asking me ‘What are they saying’. I told him that they were saying we were going to embarrass ourselves in Portugal,” Topalidis said.\n“Rehhagel replied ‘Let them say what they are saying. They don’t know what we know, that our team is good. We know that and that is what is important’.”\nThe Group of Death\nIt is sometimes neglected given Greece’s eventual win, but advancing out of the group was itself considered a Herculean task.\nThe “Ethniki” was drawn with tournament hosts Portugal, Spain and Russia, all incredibly good teams at the time.\nIndeed, Topalidis remarked that every match throughout the tournament saw Greece as the underdogs and their opponents as the favourites.\n“All games were incredibly challenging for us,” the assistant coach said.\n“Definitely we can say that Spain was a major concern. We had faced them in qualifying and so knew firsthand that it was a difficult team.”\nGreece surprisingly managed to accumulate four points from their opening two games, beating Portugal and drawing Spain, though they were dealt a reality check with a 2-1 loss to Russia (the easiest team on paper they had to play).\n“All the games were something that you gave proper attention to because all the teams of our group were favourites, but we had the momentum on our side, we knew that we were a difficult team for opponents to beat, and we were optimistic in every game.”\nFirst signs of belief\nGreece’s four points was enough for them to advance to the quarter-finals and they were again dealt an awful hand as they prepared to face the defending champions, France, a team with legends like Claude Makelele, Patrick Viera, Zinedine Zidane, and Thierry Henry.\nShockingly, they beat them as well and Topalidis explained that was the moment they began to truly believe in their chances of winning the trophy.\n“Once we overcame the obstacle of France, we believed we could make it to the final,” he said.\n“Beating the current Euro champions had us thinking ‘One more match and we are in the Final’.”\nThe Dellas winner\nThe Final itself is a moment all of Greece cherished, though Topalidis spoke of another key moment that he replays in his mind to this day.\n“What has stayed in my mind, and I think of it a lot, is the match with Czech Republic in the semi-final and the goal Dellas scored against them,” he said.\nTraianos Dellas’ famous winner came right at the death of the first period of extra time and, due to the tournament using the short-lived silver goal rule (if a team was ahead by the end of the first period of extra time, they won the game), Greece was declared winners just moments after.\n“I think of that goal so much because it came in the last minute of the first half of extra time and the opponent did not have time to react because of the silver goal rule.”\nKing Otto and the genesis of a Golden Generation\nIt is easy to attribute Greece’s Euro win to luck, but Topalidis put the achievement down to two key ingredients: Otto Rehhagel and a core of great players (admittedly, Topalidis showed modesty, but one cannot praise highly enough his contribution).\n“Rehhagel and the core group of players helped cultivate a family environment in the team which, combined with our changing formation and tactics for each opponent, proved to be key to our success,” Topalidis said.\nHe also reinforced the impressive quality of the players with the squad containing Giorgos Karagounis, Angelos Basinas, Antonis Nikopolidis, Giourkas Seitaridis, Takis Fyssas (all of whom had huge Champions League experience with Panathinaikos in the preceding years), as well as captain Theodoros Zagorakis, Kostas Katsouranis and many more.\nIndeed, most of the squad are now considered legends of Greek football.\n“To achieve something like this requires a very good team. Just think that even England has never won a Euro tournament. It is extremely difficult to achieve this but not impossible,” Topalidis said.\nEuro 2004 represented the beginning of a golden age for Greece with the country qualifying for four of the following five tournaments, making the quarter-finals in Euro 2012 and the Round of 16 at the 2014 FIFA World Cup.\nTopalidis concluded by reiterating that a good set of players and a manager that can successfully guide them are the only ingredients you need to succeed.\n“If you have a team that is in a good competitive level in a knockout tournament like this, everything is possible.”\nMore photos from Neos Kosmos and Con Deves below:",
  "word_count": 1171,
  "scraped_at": "2026-02-14T01:54:45.418984",
  "_text_extracted": true
}