{
  "article_id": "baeae02a8eae",
  "url": "https://www.nytimes.com/athletic/6540241/2025/08/08/thomas-frank-interview-tottenham-spurs-party/",
  "title": "Thomas Frank interview : Spurs summer work , Levy relationship and partying until 5am",
  "date": "20250808T174500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thomas Frank nearly had to cancel a party that he had been planning with his wife, Nanna, for over a year.\nIn the middle of June, they invited 90 guests to a hotel in Denmark to celebrate life — an idea that had been discussed for several years. Frank and Nanna spent the entire weekend with their three children, friends and the rest of their family playing volleyball, gorging on a buffet of grilled meats, popping bottles of champagne in the spa and dancing until the early hours of the morning.\nAdvertisement\nThe party started on Friday, June 13 at 3pm, coincidentally, less than 24 hours after Frank had been appointed as Tottenham Hotspur’s new head coach. At least it gave him the perfect excuse to fully enjoy the celebrations.\n“We planned to do it a year ago because there was no World Cup or Euros this summer, and then this f***ing show started,” Frank tells a group of journalists, including The Athletic, on a rooftop in Seoul during Tottenham’s pre-season tour of East Asia.\n“I signed (with Spurs) the day before, and we came to the hotel to check everything was in place. The next day, I went for a run and a morning swim. Then I had the last bit of talking. I put the phone down, had a quick shower and at 2:50 pm, people came and we partied over the weekend.\n“There was a fantastic vibe. I’m still young, but when you are 50, you don’t normally go to a big party like that, and, because people were staying overnight, everyone was all in. The first night was supposed to be a little bit quiet. We had champagne and drank a few beers first, went to dinner and then it became lively. There was a sing-along band. We got to bed around 2:30am.”\nThe following night, Frank stayed up with a few of his closest friends until around 5am. He knew it would be the last opportunity to truly unwind in what has turned into an eventful summer.\nThe Dane took charge of what turned out to be his last game with Brentford, a 1-1 draw against Wolverhampton Wanderers, on May 25.\nHe spent a few days in Denmark on holiday before he flew to Nerja in Spain with his mother and sister. They talked for hours on the rooftop terrace over cups of coffee and lounged in the swimming pool. After Nanna arrived, Frank visited a few interior design and kitchen shops with her in Marbella. It was a “relaxing” trip, but everything was about to change.\nAdvertisement\nOn June 6, Spurs sacked Ange Postecoglou. The club identified four potential candidates to replace the Australian and drew up a list of key criteria, including a track record of youth development, being a good communicator with the media and fans, experience of European competition and working within a club structure.\nThe process was led by chairman Daniel Levy, new chief executive officer Vinai Venkatesham and sporting director Johan Lange. The latter has known Frank for over 20 years since they worked together at the Danish second-division side B.93.\nCandidates, including Frank, were asked to assess the strengths and weaknesses of the first-team squad. Frank had questions about the injury crisis which Spurs suffered last season. Despite his lack of experience in Europe — he has only managed in the qualifying rounds of the Europa League with Brondby — Frank emerged as their No 1 target and agreed a three-year contract.\nBefore the process was completed, Frank and Nanna drove from west London to Copenhagen so they could take the family’s dog home with them for a few weeks. They left their house at 6:30am and caught a train from Folkestone to Calais. They spent nine hours in the car, powered by espressos and energy drinks with only a couple of short breaks to use the toilet, before they reached the ferry terminal at Putgarten in Germany.\nAfter checking the GPS, they skipped the ferry and drove through Denmark until they reached Copenhagen at 11pm. Frank spent the majority of the journey with headphones on, deep in conversation with people about his exciting new challenge with Spurs.\n“I was not that fun to drive with,” Frank says. “From the drive home onwards, I was (working) non-stop. Getting closer to the job, finding out I will probably get it, then the paperwork. Then it was squad planning, talking to people and trying to get the right people with me. From June 12, when I signed, until July 5, I had two spare 90 minutes for myself in the summer house. The rest was work.\nAdvertisement\n“We saw friends and family in the evening, so I didn’t work from 6am until 6pm, but I was on the phone, laptop, and online meetings. It’s positive because that’s an opportunity to plan. Imagine coming in the middle of the season; it must be a nightmare.”\nFrank has not spoken to his predecessor Postecoglou and does not plan to. “I don’t know him, so I feel it would be a little bit odd, but if I meet him, I will go and speak to him. He always came across very friendly, open-minded and like a good person.”\nThe 51-year-old and his coaching staff have only been working with Tottenham’s first-team squad for around a month, but he knows where they need to improve after finishing 17th in the top flight last season. Spurs have looked more compact throughout much of pre-season and have been experimenting with a 4-2-3-1 system. They beat Arsenal 1-0 in Hong Kong and drew 1-1 with Newcastle United in Seoul, although they did lose 4-0 to Bayern Munich on Thursday night.\n“There are a lot of (good) things from Ange,” Frank says. “They are a very brave (team). The ability to play and train with intensity is very high, so that is a good foundation.\n“Set pieces are an area I have a big belief in, and it’s hugely important, but it was not as highlighted as before, looking from the outside. We all have different beliefs. There is something on the defensive side where we need to be more balanced from defending the box, low, middle and high, but they were very good at high pressing last year. They are the two big areas.”\nFrank has been impressed by Pape Matar Sarr, Rodrigo Bentancur and Archie Gray. Ben Davies, who only has a year left on his contract, is a candidate for the dressing room’s leadership group because of “the way he understands the bigger picture”. He has praised others too, including Cristian Romero, Micky van de Ven, Djed Spence and Wilson Odobert.\nTottenham’s squad struggled to cope with competing in multiple competitions last season and were rocked by an injury crisis. James Maddison will miss most of the 2025-26 campaign after suffering an anterior cruciate ligament injury in the draw with Newcastle, Dejan Kulusevski is recovering from his own knee injury, while Son Heung-min has left after “10 beautiful years”.\nSpurs should be using their victory over Manchester United in Bilbao as a springboard to more success. The only senior signing who immediately improves the starting XI is Mohammed Kudus after their pursuit of Morgan Gibbs-White led to Nottingham Forest reporting them to the Premier League for an illegal approach.\nAdvertisement\nMeanwhile, Arsenal, Manchester United, Liverpool and Chelsea have all spent over £100million ($134m) in the transfer market.\n“The squad needs to be big and robust enough so we can compete in all four tournaments,” Frank says. “But I can’t have too many players. It’s just so difficult to keep everyone happy. It’s almost impossible.\n“Then we want to see if we can add quality. We don’t want to sign players we don’t think can really improve the squad. I would want to wait. We have talented players who can grow. I’m not here for the short-term fix; I want to build something that can last. We need to think longer-term, but we need to compete now.\n“I’m constantly learning about (the players). Finding out… are they good enough? Can they raise their ceiling? And do they fit the culture? Those are the three big things.”\nThere has been a significant change across Spurs this summer. Venkatesham has arrived as CEO, while chief football officer Scott Munn has left. Long-serving executive Donna-Maria Cullen is stepping down from the board. Adam Brett, director of performance services, and Nick Davies, head of sports science, have departed too.\n“How much is going to change at the club, I am a little bit in doubt of. But Vinai has come in and he’s clearly going to be an important part,” Frank says. “All the talks I have had with him, he comes across well. He’s going to be integral to our success going forward.\n“I have a good feeling that we have a good opportunity for — I don’t want to say change — but just act. They won the first trophy, we are in the Champions League, but we need to build. As I said in the first press conference, we are now in 2025. Six years ago, we were able to compete in all competitions, and that is what we need to do. The competition has only become more difficult. There’s a lot of work we need to do to get up there.”\nAdvertisement\nFrank recognises it will take time for everything to come together. He brought several members of staff with him from Brentford, including head of athletic performance Chris Haslam, assistant coach Justin Cochrane and analyst Joe Newton. Spurs have hired Cameron Campbell to the newly-created role of individual development (IDP) coach, while Fabian Otte is in charge of the goalkeeping department, and Andreas Georgson will oversee set pieces.\n“All the processes were in place in Brentford,” he says. “Everyone knew what to do. I had a well-oiled coaching machine. I have a very good coaching staff now, and I think it will be top-level, but we don’t know each other. It’s a big advantage that Chris, Justin and I have been running it at Brentford, but we can’t do it on our own here. We need to create a super strong unit to get everybody on board with the principles.\n“For example, the coaching meetings in the morning and the afternoon last an hour, but before (at Brentford) it was 10 to 15 minutes. I need to know all the people at the training ground, get to know the players better, invest even more in watching training and games.\n“We are signing players here, and the processes in Brentford were, I’m not saying better, but very good. Johan and his team are doing a top job, but for them to understand what I’m looking for, that needs to be aligned. Now I need to spend more time with Johan and Rob (Mackenzie, head of scouting). All of that is extra hours every day.”\nFrank had a close relationship with Brentford’s owner Matthew Benham, CEO Jon Varney and director of football Phil Giles.\nDuring Tottenham’s pre-season tour, he was involved in squad planning meetings with Levy, Lange and Venkatesham on the eighth floor of the Kerry Hotel in Hong Kong, where they discussed targets over breakfast. He went on walks around the hotel with Lange, too. The early signs are promising, but no manager has lasted more than two years at Spurs since Mauricio Pochettino was sacked in November 2019.\n“I did what I could to do my due diligence about the club, the people and everyone involved in it,” Frank says. “With the short knowledge I have of Daniel — and I guess that’s the reason why you ask, because I guess some don’t think he has the best reputation — he has been very good. It’s been a good approach in everything and very transparent. Sometimes there can be a reputation that is very difficult to get away from.”\nFrank joined Brentford in December 2016 as an assistant to Dean Smith before he spent nearly seven years as their head coach. He guided them from the Championship to the Premier League and recorded two top-half finishes in the top flight. He will go down as one of the most important figures in their history.\nAdvertisement\nAt his introductory press conference with Spurs, he said, “In a way it was very difficult and in a way it was very easy” to leave the west London side.\n“I felt that maybe it was time to challenge myself and get another opportunity,” he added. How did he break the news to Brentford’s senior figures?\n“I told Phil (Giles) from the beginning when there was the first approach because I wanted to be clear,” Frank says in Seoul. “I owed them that respect so they could plan accordingly. Maybe I wouldn’t get the job, but then at least they could start thinking and prepare. When I got very close, I called Matthew (Benham). When I got offered the job, there were negotiations and a little bit of friction. After that, I spoke to Phil a few times and Matthew once, but I will definitely go for dinner with them.”\nBrentford’s stadium holds 17,250 supporters and is dwarfed by Tottenham’s, which has a maximum capacity of around 63,000. Brentford’s turnover for the 2023-24 season was £166.5m. Tottenham’s was over three times that amount at £528.4m. Brentford might have finished above Spurs last season, but there is no doubt that Frank has taken a huge step up in his career.\n“I’m super excited and ready for the challenge,” he says. “I loved it at Brentford. It was a top job in every aspect and it was only an opportunity like this I wanted. This can be fantastic but maybe also not so good — who knows?\n“The opportunity to make a difference here is massive, and I’m looking forward to it. I will go in, be brave and be myself.”\n(Top photo: Jasmin Walter/Getty Images)",
  "word_count": 2335,
  "scraped_at": "2026-02-14T02:02:51.937651",
  "_text_extracted": true
}