{
  "article_id": "baf18c33727a",
  "url": "https://metro.co.uk/2023/06/28/arsenal-mikel-arteta-drops-hint-kai-havertz-position-chelsea-transfer-19033634/",
  "title": "Arsenal boss Mikel Arteta drops hint over Kai Havertz position following Chelsea transfer | Football",
  "date": "20230628T204500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has dropped a hint over where he plans to play new Arsenal signing Kai Havertz following his £65m transfer from Chelsea.\nGermany international Havertz has signed a long-term contract at the Emirates Stadium after ending his three-year stay at Stamford Bridge.\nThe 24-year-old scored 19 goals in 91 Premier League appearances for Chelsea and netted the winner in the 2021 Champions League final against Manchester City.\nGiven the lack of strikers at Chelsea, Havertz played up top for much of last season but Arteta has suggested he will adopt a deeper role at Arsenal.\n‘Kai is a player of top quality,’ Arteta said of his new signing. ‘He has great versatility and is an intelligent player.\n‘He will bring a huge amount of extra strength to our midfield and variety to our play.\n‘We welcome Kai and his family to Arsenal Football Club and we are all excited to start working with him when we start pre-season training soon.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHavertz leaves a Chelsea team that finished just 12th in the Premier League last season and joins an Arsenal side that sat top of the table for 248 days, eventually finishing five points behind Man City.\nArteta identified Havertz as a key summer target and also wants to bring West Ham captain Declan Rice and Ajax defender Jurrien Timber to north London.\nFollowing his departure from Stamford Bridge, Havertz said he was leaving Chelsea ‘with a heavy heart’.\nMore Trending\n‘I would have preferred for you to hear my thoughts on leaving Chelsea first from myself before my thoughts on me joining my new team,’ the German said.\n‘This isn’t my style and it upsets me that you had to hear of it in this way. Today, I find myself at a crossroads, where words can’t describe the emotions I’m feeling.\n‘It is with a heavy heart that I write this letter, saying goodbye to the club that has become my second home, and to the incredible fans who have supported me throughout this amazing journey.’\nMORE: Jorginho dismisses Arsenal exit link: ‘I’m quite happy where I am’\nMORE: Kai Havertz pens farewell message to Chelsea fans after joining Arsenal\nMore Trending\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 438,
  "scraped_at": "2026-02-14T01:56:02.403312",
  "_text_extracted": true
}