{
  "article_id": "baf65d0ebb9f",
  "url": "https://www.uefa.com/uefachampionsleague/news/0287-19749891edb7-610c44c6f98f-1000--what-to-look-out-for-wednesday/",
  "title": "What to look out for on UEFA Champions League Matchday 5 Wednesday | UEFA Champions League",
  "date": "20231129T000000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What to look out for on UEFA Champions League Matchday 5 Wednesday\nWednesday, November 29, 2023\nArticle summary\nThe old guard and the new breed come under the spotlight as UEFA.com digs into the Matchday 5 storylines.\nArticle top media content\nArticle body\nThe relentless Thomas Müller is looking to etch his distinguished name even further into Europe's premier club competition while Rodrygo also has his eyes on the record books.\nWe pick out some key talking points ahead of the second set of games on UEFA Champions League Matchday 5.\nTuesday 28 November\nGroup E: Lazio 2-0 Celtic, Feyenoord vs Atlético de Madrid\nGroup F: Paris vs Newcastle, Milan vs Dortmund\nGroup G: Man City vs Leipzig, Young Boys vs Crvena zvezda\nGroup H: Shakhtar Donetsk 1-0 Antwerp, Barcelona vs Porto\nWednesday 29 November\nGroup A: Galatasaray vs Man United (18:45), Bayern vs Copenhagen\nGroup B: Sevilla vs PSV Eindhoven (18:45), Arsenal vs Lens\nGroup C: Real Madrid vs Napoli , Braga vs Union Berlin\nGroup D: Benfica vs Inter, Real Sociedad vs Salzburg\nAll kick-off times 21:00 CET unless stated\nWhat comes next?\nUEFA Champions League Matchday 6 will be played on Tuesday 12 and Wednesday 13 December, with the top two in each section progressing automatically to the knockout stage. The round of 16 draw will be streamed live on UEFA.com from midday CET on Monday 18 December.\nRodrygo striding into Madrid history books\nBorn barely six months apart, Vinícius Júnior and Rodrygo have already worked their way past the tallies of many Real Madrid goalscoring greats in this competition. The pair are now both level with Fernando Morientes in fourth place for Madrid in the Champions League era with 17 goals – one more than Gareth Bale, Guti, Luís Figo and Roberto Carlos, though it will be some time before they are troubling the top three: Cristiano Ronaldo (105), Karim Benzema (78) and Raúl González (66)\nVinícius Júnior is expected to be out for several weeks with a thigh injury, so Rodrygo can steal a march on his team-mate when his side welcome Napoli. Speaking after the Matchday 4 victory against Braga, Rodrygo felt there was much more to come. \"It's unusual for us not to score,\" he said. \"Everything went right today and I hope we can keep that up in the upcoming games.\"\nMüller to join list of greats\nThomas Müller's outing as a first-half substitute against Galatasaray moved him on to 149 appearances in UEFA club competition, leaving him one shy of arguably the most exclusive club in European football. The 34-year-old could become the 19th player in history to reach 150 games and only the second of those to have represented Bayern after former midfielder Toni Kroos.\nMüller's game time has been limited this season, but with Bayern safely through to the round of 16 already, Thomas Tuchel may well choose to give his supporting cast more minutes in their final two games. The first of those is against a buoyant Copenhagen side that beat Manchester United 4-3 last time out, moving them up to second in Group A. Their coach, Jacob Neestrup, believes they can take another scalp and make history. \"We have played four games and we deserve to be second in the group,\" he said. \"There is one goal for Copenhagen and that is to be in the Champions League come the new year.\"\nFurther ahead\n• Whatever happens on Matchday 5, Inter and Real Sociedad will face off in Milan with top spot in Group D up for grabs in their final match in the section.\n• Group F appears set for a thrilling finish, with qualification or first place likely to be on the line given Dortmund, Paris, Milan and Newcastle are only separated by three points heading into Matchday 5.\n• Six teams booked their place in the next stage of the competition on Matchday 4 and can already start looking forward to the round of 16 draw on Monday 18 December.\nWhere is the 2024 UEFA Champions League final being played?\nThe 2023/24 UEFA Champions League final will take place at Wembley Stadium in London on 1 June 2024.",
  "word_count": 694,
  "scraped_at": "2026-02-14T02:17:09.419288",
  "_text_extracted": true
}