{
  "article_id": "bafd9c137fad",
  "url": "https://economictimes.indiatimes.com/news/international/us/manchester-city-may-pocket-over-260-million-financial-rewards-heres-how/articleshow/100573546.cms",
  "title": "Manchester City : Manchester City may pocket over £260 million financial rewards . Here how",
  "date": "20230528T163000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Manchester City eye emulating the historic treble feat achieved by neighbourhood club Manchester United in 1999, Pep Guardiola's will take away significant financial rewards too. Manchester City are set to receive a whopping £160 million for winning the premier league. The club can earn another £100 million if they win Champions League final. Apart from this, if Manchester City manage to defeat Manchester United in the FA Cup final at Wembley, they can bag another £4 million, as per a report in Mirror.\nPep Guardiola has said that his Manchester City players are ready to take the chance to deliver a historic treble of Premier League, FA Cup and Champions League.\nThe English champions sealed their third consecutive league title with three games to spare and will face Manchester United in the FA Cup final and Inter Milan in the Champions League decider in first two weeks of June, as per an AFP.\nOnly United's class of 1998/99 have ever previously won the treble in English football.\nErling Haaland was named the Premier League's Player of the Season on Saturday, after a record-breaking debut campaign in which he helped Manchester City claim their third straight league title.\nThe 22-year-old scored 36 goals in 35 games this season, breaking the previous record of 34 for a single Premier League season set by Andrew Cole and Alan Shearer in 42-match Premier League campaigns.\nOnly Dixie Dean, for Everton in 1927/28, has scored more goals across all competitions (63) in a top-flight English season than Haaland's 52.\nThe Norwegian is also the first player in the Premier League to score hat-tricks in three successive home matches, and the first Man City player to score a Manchester derby hat-trick since 1970.\nHaaland becomes the third successive Man City player, and fourth overall, to claim the accolade, after Kevin De Bruyne in 2019-20 and 2021-22, while Ruben Dias took the honour in 2020-21. Vincent Kompany was the first, in 2011-12.\nThe striker was voted the Player of the Season by the public, the captains of the 20 Premier League clubs and a panel of football experts.\nFAQs\nQ1. When is Manchester City's FA Cup final match?A1. Manchester City's FA Cup final match is on June 3.\nQ2. When is Manchester City's UEFA Champions League final match?\nA2. Manchester City's UEFA Champions League final match is on June 10.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 460,
  "scraped_at": "2026-02-14T01:48:17.243823",
  "_text_extracted": true
}