{
  "article_id": "bb04817f90a4",
  "url": "https://www.westmeathexaminer.ie/2025/12/07/oliver-glasner-not-getting-carried-away-with-crystal-palaces-lofty-position/",
  "title": "Oliver Glasner not getting carried away with Crystal Palace lofty position",
  "date": "20251207T211500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Oliver Glasner not getting carried away with Crystal Palace’s lofty position\nBy Press Association Sport Staff\nCrystal Palace manager Oliver Glasner played down his side’s position in the table after their 2-1 victory at Fulham lifted them to fourth in the Premier League.\nLuck was on the Eagles’ side when the Cottagers had an Emile Smith Rowe goal disallowed by VAR for a marginal offside in the build-up early in the second half before Marc Guehi snatched the win with an 87th-minute header.\nA trip to Shelbourne in the Conference League is next in Palace’s packed schedule, but they are threatening to put themselves in the picture for playing Champions League football next season.\nGlasner said: “I’ll have to ask if we get a bonus if we are fourth in December – I don’t think so.\n“Of course it’s nice, but for me what I’m thinking of is we’re always talking in the last games it felt we were getting a bit fatigued at the end of the game due to our schedule, and today I felt it was the opposite.\n“All the players who came in and brought great energy to the pitch and, for me, man of the match was Nathaniel Clyne.\n“He didn’t play for months, I didn’t give him minutes but at every single training session he’s available, he does his job 100 per cent.\n“I said to the players that’s who we want to be, that’s who we are, always being ready to support the team.\n“That’s what I’m thinking about and for me fourth place in the league is not that important.”\nPalace opened the scoring through Eddie Nketiah after he was played in by Adam Wharton, but Fulham levelled through Harry Wilson’s magnificent finish from the edge of the area.\nA tight second half was settled by Guehi snatching victory for the Eagles by flashing in a header from Yeremy Pino’s corner.\nFulham boss Marco Silva said: “We scored a goal and the way it was disallowed has to be a huge frustration because probably the toenail of [Samuel] Chukwueze is too big right now.\n“He has to be careful with that because sometimes a nail today in football is enough to disallow a goal.\n“It was difficult for us because it was a great goal from ourselves and it was disallowed.\n“We kept the control of the game, but not with the intensity or the energy from the last game (against Manchester City) to create from one side to the other.\n“One of the reasons, I believe, was because from the back we should have started to move the ball quicker and make the ball arrive in offensive areas quicker.\n“It’s these type of games that if you can’t win, you cannot lose it in the way we lost – these are the moments we have to be resilient.”",
  "word_count": 477,
  "scraped_at": "2026-02-14T02:27:05.517333",
  "_text_extracted": true
}