{
  "article_id": "bb08af40ad97",
  "url": "https://www.thenews.com.pk/print/1165683-real-s-bellingham-hits-out-at-ridiculous-two-game-ban",
  "title": "Real Bellingham hits out at  ridiculou two - game ban",
  "date": "20240307T234500Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real’s Bellingham hits out at ‘ridiculous’ two-game ban\nMADRID: Real Madrid midfielder Jude Bellingham said his two-match ban for dissent is “ridiculous” and that he is being made an example of as a newer player in LaLiga.\nThe Spanish Football Federation (RFEF) suspended the 20-year-old for showing contempt towards referee Jesus Gil Manzano after receiving a red card in Real’s 2-2 league draw with Valencia on Saturday.\nThe referee’s report said Bellingham had displayed an “aggressive attitude” when he disputed Manzano’s decision to blow the final whistle as the England international headed in Brahim Diaz’s cross for what would have been the winning goal in added time.\n“I didn’t think I said anything very offensive towards him,” Bellingham told Movistar after his side’s 1-1 draw with RB Leipzig in their Champions League last-16 second leg tie on Wednesday.\n-\nJames Van Der Beek's Final Conversation With Director Roger Avary Laid Bare: 'We Cried'\n-\nJaden Smith Walks Out Of Interview After Kanye West Question At Film Premiere\n-\nMichelle Obama Gets Candid About Spontaneous Decision At Piercings Tattoo\n-\nWhy Halle Berry Wasn't Ready For Marriage After Van Hunt Popped Question? Source\n-\nBunnie Xo Shares Raw Confession After Year-long IVF Struggle\n-\nBrooks Nader Reveals Why She Quit Fillers After Years\n-\nTravis Kelce Plays Key Role In Taylor Swift's 'Opalite' Remix\n-\nHow Jennifer Aniston's 57th Birthday Went With Boyfriend Jim Curtis\n-\nJoJo Siwa Shares Inspiring Words With Young Changemakers\n-\nJames Van Der Beek Loved Ones Breaks Silence After Fundraiser Hits $2.2M\n-\nDisney’s $336m 'Snow White' Remake Ends With $170m Box Office Loss: Report\n-\nTravis Kelce's Mom Donna Kelce Breaks Silence On His Retirement Plans\n-\nPremiere Date Of 'Spider-Noir' Featuring Nicolas Cage Announced\n-\nPedro Pascal's Sister Reveals His Reaction To Her 'The Beauty' Role\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters",
  "word_count": 326,
  "scraped_at": "2026-02-14T01:48:46.208001",
  "_text_extracted": true
}