{
  "article_id": "bb208708ec07",
  "url": "https://theathletic.com/4521191/2023/05/16/richarlison-first-spurs-season-assessed/",
  "title": "What Richarlison first season at Spurs tells us : He wants to feel wanted",
  "date": "20230516T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Abel Braga tells a story, from the summer of 2017, back when he was managing Fluminense and had a young Richarlison in his ranks. Fluminense were about to face Palmeiras, who were looking for a new striker after selling Gabriel Jesus to Manchester City earlier that year. Just days before the game, Palmeiras offered Fluminense €11million (£9.5m and $12m in today’s currency) to sign the then-20-year-old, whose head was turned by the prospect of a pay-rise at a better team.\nAdvertisement\n“He was an inexperienced kid and got strung along by Palmeiras,” Braga tells The Athletic nearly six years on. “They were going to sign him on the following Tuesday and asked him not to play at the weekend. They messed with his head. He didn’t play (Richarlison said in a statement about his request not to play that he was also concerned about an injury he was carrying), we lost, and the president decided not to sell him. Richarlison came to my office and cried.”\nIt was a hugely difficult moment, the player had seemingly broken his relationship with Fluminense and their fans, whose derision and anger he would now have to face. Braga had a decision to make but he knew what would be best for a young player who had got himself in over his head. He had to defend him in public. So Braga went into his next press conference and called on the Fluminense fans to forgive Richarlison and show him support and love. “We can’t crucify him,” he said. “Who has never done something stupid as a kid?”\nWhen Fluminense hosted Gremio at the end of the week, Richarlison was back in the team. “At first the fans were a bit reticent,” Braga remembers. “But they soon started to applaud him because he was such a phenomenal player.” Soon enough, Richarlison was happy and scoring goals again. Later that summer he got his move anyway, Fluminense selling him to Watford for more money than Palmeiras offered. He got to leave the club on good terms and has never looked back.\nFor Braga, the lesson is clear. Richarlison is a player who you need to connect with if you want to see the best of him. That is what Braga got from him at Fluminense, what Tite did with Brazil, and what Marco Silva did at Watford and later Everton.\nIt was Silva who convinced Richarlison to join Watford from Fluminense, knowing he was on the brink of joining Ajax at the time. It was that personal touch that convinced Richarlison to join, and which saw him play with such promise at Watford. (When Silva was sacked, Richarlison tweeted an angry emoji, which he later deleted.)\nAdvertisement\nSilva took the Everton job and the first thing he told Farhad Moshiri was to sign Richarlison and Lucas Digne. “I knew it would be an almost perfect situation if he came and joined us at Everton,” Silva later told The Athletic. “He will score important goals. He has the capacity to become one of the best forwards in the Premier League.”\nTap into Richarlison emotionally and you have a brilliant player on your hands: skilful, dangerous, athletic and willing to run through brick walls for you; the kind of player who can energise a whole team and fanbase.\nMaybe that is what Tottenham thought they were getting when they paid Everton an initial £50million to sign Richarlison last summer. At the time, it felt like a brave proactive move — the sort of thing Tottenham would never normally do. For years they had been reluctant to spend big money on forwards because they knew that, with Harry Kane and Son Heung-min in the team, they would be buying depth rather than a guaranteed starter. Spending that much on someone who might not be a regular starter was what you expect from Manchester City rather than Spurs.\nBut now, coming to the end of Richarlison’s debut season at Spurs, it does not feel like money well spent. This has been a difficult season for the 26-year-old. There have been flickers of promise, moments when you glimpse what a good player he could be for Spurs. But it is impossible to avoid the harsh logic of the numbers: 17 starts and three goals in all competitions, with just one in the league.\nSo what happened? What happened to the Richarlison that Spurs paid all that money for?\nFor Braga, the problem has been the lack of emotional connection that Richarlison has felt during his time at Tottenham. The support and love and arm around the shoulder that he needed from a manager has not always been there.\nAdvertisement\n“People criticise Brazilian coaches a lot, but there is one real strength here,” Braga explains. “We really try to understand each individual on a social level, on a cultural level, and so on. Some players need you to be a father figure. Others will only react if you shout at them. (Antonio) Conte didn’t seem to understand that. He’s the kind of coach who barely speaks to a player during a whole season.”\nConte has many strengths as a coach but that type of interpersonal work has never been one of them. Richarlison is far from the only example of this. There have been plenty of players at Spurs whose form dipped this season — Eric Dier, Hugo Lloris, Son — who looked like they needed a few friendly and understanding words. But at least those three had years of experience to fall back on. Richarlison has at times looked lost.\n“You can only have a connection with a player if you get in his head,” Braga explains. “You have to understand his life, his childhood, a whole range of things. That’s how you get to know his personality. You can’t have one single way of behaving with every player. You need intimacy, a kind of reciprocity: you know how he likes to be treated and you know what you’ll get in return. It costs nothing. Conte isn’t like that. With him, it’s, ‘My way or the highway’. And if you’re like that, you risk losing a player as good as Richarlison.”\nThe proof of this is in the difference between Richarlison’s performances for Tottenham and for Brazil. He provided one of the most exciting early moments of the World Cup, scoring a second goal against Serbia in the group stage game in Lusail with a brilliant acrobatic volley. It was a remarkable goal, jumping, spinning and striking the ball all in the same instinctive movement. It was the sort of goal that only a player in the higher reaches of confidence would try, and only the most gifted players could successfully execute.\nRicharlison scored again when Brazil overran South Korea in the last 16 and if their quarter-final penalty shoot-out against Croatia had gone a different way, then who knows how far Brazil would have gone.\nEven though the World Cup ended painfully for Richarlison, on a personal level it was the highlight of his career. After Brazil beat South Korea, he was interviewed by his country’s former superstar striker Ronaldo and had to speak through the tears, overwhelmed by emotion and pride. Richarlison told Ronaldo that he was his childhood hero. Ronaldo replied that it was now Richarlison’s turn to inspire the next generation of Brazilians, including millions of children, with his “art, goals, joy, spontaneity and feelings”.\nBut Ronaldo was not just returning a compliment out of politeness. Richarlison was the most popular Brazil player back home during the World Cup. His pigeon dance inspired thousands of gifs and memes. Even fans who did not follow club football closely fell in love with Richarlison, his style of play and the character and personality he exudes on the pitch.\nAdvertisement\nLook back on Richarlison’s record for Brazil — 20 goals in 42; and 10 goals in 626 minutes since the start of 2022 — and you can see the clear correlation between his enjoyment of the game and his effectiveness on the pitch, and the huge payback for the trust Tite showed in him, preferring him as his No 9 despite strong cases for other contenders.\nIn an ideal world, Richarlison would like to play as a No 9 for Tottenham too, but part of the issue this season is that he has come into a team with no clear sense of how best to use him. In hindsight, this was the strangest thing about signing him. Yes, he can play anywhere across the front three. But that is not the same thing as there being an obvious place for him in the team.\nRicharlison wants to play as a No 9, where he played for Brazill, but Tottenham’s centre-forward is the greatest goalscorer in their history and their greatest player in the modern era. The chances of Kane being dropped for Richarlison have never been higher than zero.\nRicharlison has had great success on the left, the perfect position for him to drive from out to in, open up his body and shoot with his right. But the problem is that Tottenham already had a player in that role, Son, another all-time Tottenham great, who came into this season on the back of sharing the Golden Boot last year.\nSo the only player in Spurs’ front three at the start of this season who Richarlison could displace was Dejan Kulusevski on the right. Richarlison did that after the first five games — and after lively productive cameos against Chelsea and Nottingham Forest — when Spurs hosted Fulham on 3 September, winning 2-1. In his second start, days later, against Marseille in the Champions League, Richarlison scored two excellent headers to win Spurs the game 2-0. It felt like lift-off — the moment we would forever look back on as the moment that kickstarted his time at Spurs.\nWhen he celebrated in tears with his family in the stands, it was a window into the emotional heart-on-sleeve Richarlison, and the fans loved him for it.\nRicharlison has his first Tottenham goal 💪\nThe Brazillian finds himself on the end of Perisic's cross and leaps high to head home the game's opener 💥#UCL pic.twitter.com/C8BJl5bLOQ\n— Football on BT Sport (@btsportfootball) September 7, 2022\nBut the problem — which was not Richarlison’s fault — was that Kane, Son and Richarlison as a front three did not really work. It was too top-heavy, too narrow, with no one holding any width wide on the right, and no one to link the rest of the team to the attack. But when Kulusevski got a hamstring strain, Richarlison kept his place, even though it was clear the team was not functioning perfectly. And then Richarlison picked up a calf injury, his first of many this season. Richarlison recovered just before the World Cup but then got a hamstring injury with Brazil too.\nAdvertisement\nSo he missed the first three league games after the World Cup, then had to make do with life on the bench. Kulusevski was back in front of him in the pecking order, even though he was not playing especially well either. When Richarlison finally got a start in Son’s position against West Ham on February 19, it was his first start in two months. It was remarkable that Richarlison had only had a few games here and there before then on the left, rather than a proper run. It almost felt as if what needed to happen was for Son or Kane to get injured so that Richarlison could play.\nBut even when Son was belatedly dropped for Richarlison, he did not have the rhythm or confidence to take advantage. Conte finally brought him back into the team for his last two games in charge: against Nottingham Forest, he scored what we thought was his first Premier League goal, only for it to be disallowed by VAR after an exuberant celebration. Then against Southampton on March 18, he was injured after five minutes and left the pitch in tears.\nRyan Mason brought Richarlison back in, starting him for three of his four games so far. Mason has realised that the left side is Richarlison’s best position, even if it means compromising Son and moving him out to the right. And at Anfield, Richarlison finally got his first league goal for Spurs, a brave header in the last minute at Anfield. Again, it felt like a huge moment for him and for Spurs. But then Liverpool went down the other end and won the game 4-3, a reminder perhaps that nothing is quite going how Richarlison and Spurs want it to.\nNo one will be more frustrated with how this season has gone than Richarlison. He is self-critical to a fault, and when he opens up with the Brazilian media he is always the first to acknowledge his own mistakes and the big gap between how he is doing and where he wants to be. Even his infamous interview after Spurs were knocked out of the Champions League was more of an attack on himself and his own form than it was on Conte.\nThe question for Richarlison and Spurs is whether the next manager, whoever that is, can reach out to Richarlison, make him feel wanted and trusted, and tap into the player he can be again.\nAdditional reporting by Charlie Eccleshare.\n(Top photo: Richarlison after scoring against Liverpool in April; by Paul Ellis/AFP via Getty Images)",
  "word_count": 2247,
  "scraped_at": "2026-02-14T02:24:42.737975",
  "_text_extracted": true
}