{
  "article_id": "bb456534df5b",
  "url": "https://www.the42.ie/the-astonishing-ineptitude-of-premier-league-giants-6043539-Apr2023/",
  "title": "The astonishing ineptitude of Premier League giants",
  "date": "20230414T134500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "TOWARDS THE end of the 1939 movie ‘The Wizard of Oz,’ Dorothy and her friends pay a return visit to the title character.\nUp until that point, the wizard is assumed to be a powerful, Godlike figure with a supposed power to grant wishes and the ghost-like image representing this character reinforces the sense of fear, mystique, and awe he exudes.\nHowever, when Dorothy’s dog Toto pulls back the curtain from which the booming voice emanates, the wizard is revealed to be just an ordinary man, operating machinery that prompts the ghostly image to appear and convey a deceptive sense of magic/spirituality.\nIt’s a famous scene and could be interpreted as a metaphor for any number of things.\nIn this instance, however, it’s useful to think of the wizard as akin to a beleaguered Premier League owner.\nThese days, all the top English sides, to an extent, project an aura of invincibility.\nOn the outside, everything about them seems impossibly slick and backed up by their army of social media followers.\nCertainly, compared to our own backyard in Ireland, English football is a behemoth.\nSome context was put into this discrepancy when the Irish Independent’s Dan McDonnell noted reecently that “there are more people working full-time in the youth section of Luton Town than in the entirety of the League of Ireland academy structure”.\nAnd Luton are only a Championship side (albeit one vying for promotion).\nA bigger team like Manchester United, for example, feels almost like an industry in itself. Per the Red Devils’ official website: “As of 30 June 2022, the company employed 1,068 employees.”\nAnd with the increased TV money that has been put into English football in recent years, attracting many of the world’s best players and coaches like Erling Haaland and Pep Guardiola, it is fair to say that the Premier League is as close as the sport gets to a European Super League at present.\nSo it is tempting to assume that with all the money and power at its disposal, the figures at the top of the tree must be extremely accomplished high-achieving individuals who are simply on another intellectual level to us mere mortals.\nWe look at them, in essence, the same way Dorothy and her compatriots initially perceive the Wizard of Oz.\nIn reality though, all too often, these clubs are often propped up by one or two key decision-makers desperate to ensure no one can see what goes on behind the curtain.\nIn many instances, they are a couple of ordinary people who happen to possess abundant riches, as fallible and error-prone as you or I.\nBig clubs beyond England are not immune to ineptitude either, of course.\nRecall the catastrophic way in which Barcelona has been run in recent years, summed up by an anecdote in a 2021 New York Times article about their financial crisis and specifically, how they came to buy Ousmane Dembélé from Borussia Dortmund.\n“Barcelona had decided on its strategy, and its price: Dembélé, in Barcelona’s eyes, was worth $96 million, and not a cent more. No matter how hard Dortmund pressed for a higher fee, the men from Barcelona would hold firm. The two executives steeled themselves as they headed to the suite the Germans had booked. They embraced before knocking on the door. And then they stepped inside, only to find that Dortmund’s executives had decided on a strategy, too.\n“The Germans told their guests that they had a plane to catch. They had no time to exchange small talk, and they were not here to negotiate. If Barcelona wanted Dembélé, it would have to pay roughly double the Spaniards’ valuation: $193 million. The price would make the 20-year-old Frenchman the second-most expensive soccer player in history.\n“Barcelona’s president, Josep Maria Bartomeu, was stunned. But he did not walk away. He quickly agreed to pay almost the entire amount, settling at a fee of $127 million up front, with a further $50 million in easily-achieved performance bonuses. For all his intentions of playing hardball, he felt he did not have a choice.”\nBut mismanagement and careless spending has felt especially pronounced in the Premier League this season.\nThe richest league in the world may also currently be the stupidest.\nThe most obvious example of ill-conceived excess is surely Chelsea. The Blues have spent over £600 million on players alone since Todd Boehly and his ownership group succeeded Roman Abramovich at the helm last May.\nBut too often, it has felt like spending for spending’s sake and lacking a coherent strategy behind these purchases.\nThe result has been an unequivocal failure. Chaos-prone Chelsea are already on their third manager this season, caretaker boss Frank Lampard, a little over two years after he was originally sacked as permanent boss.\nThe club currently sit 11th in the Premier League on 39 points, 34 behind table-toppers Arsenal and 12 points off the relegation zone, though one more win in their eight remaining matches will see them pass the 40-point mark, which should be enough to beat the drop.\nAs it stands, they are on course to succumb to their worst Premier League finish since the 1995-96 season when John Spencer was their top scorer, Glenn Hoddle their manager and they had just a handful of non-British or Irish players in their squad.\nTheir one saving grace had been a qualification for the Champions League quarter-finals, though despite spending more than all the clubs in La Liga, Serie A, Ligue 1, and the Bundesliga combined in January, they were largely outclassed on Wednesday by a Real Madrid team themselves full of superstars but who seem like a model of financial restraint and conservatism by comparison.\nDespite all the spending, they also somehow don’t have a natural striker deemed good enough for the big occasions and so in Madrid, lined up with a decidedly underwhelming makeshift forward line of Raheem Sterling and João Félix.\nThe events on Wednesday felt like the punchline to an especially elaborate, lengthy, and improbable joke.\nYet while big clubs with vast financial powers have always been susceptible to ineptitude to some degree with Chelsea the most glaring example this season of sheer incompetence behind the scenes, rivals have hardly been immune either.\nIt is striking how many of the top teams this season have been exposed for what could charitably be described as poor planning.\nMan United have undoubtedly improved under Erik ten Hag, but are still recovering from the Cristiano Ronaldo era to a degree.\nThe Red Devils’ insistence on indulging the Portuguese star with diminishing returns meant they were left somewhat vulnerable earlier this season when the 38-year-old effectively made his position untenable by giving an infamous interview to Piers Morgan, criticising more or less everyone at the club.\nMan United have seen an upturn in their fortunes since parting company with Ronaldo, but they originally had no plans to do so at the start of the season.\nIt initially worked out nicely by virtue of Marcus Rashford unexpectedly hitting career-best form in the immediate aftermath of the Portuguese international’s sudden departure, but an injury to the England striker has left Wout Weghorst as one of the few obvious available alternatives.\nGranted, it is by no means an implosion of Chelsea-esque proportions, but quite how, ahead of some vital games in the end-of-season run-in, one of the biggest clubs in the world have found themselves reliant on a striker who has two goals in 23 appearances and managed the same tally in 20 matches amid Burnley’s relegation last season beggars belief.\nThen you look at Liverpool who have somehow managed to go from being on the verge of a quadruple last season to resembling a tired, beaten side who seem to produce five ordinary performances for every one superlative display, hence they are on course for their worst campaign since 2015-16, when Jurgen Klopp took over in October and the only time thus far in English football when he has presided over a failure to qualify for the Champions League.\nIt feels like several members of the squad have grown old overnight, and the same players who were lauded for being on the cusp of history last season are now in danger of swiftly becoming surplus to requirements.\nIn particular, the midfield has looked in desperate need of renovation. Their delay in tackling this problem had been presumably due to their patient, long-running interest in Jude Bellingham — perhaps the most coveted teenager in world football — yet news this week that Liverpool had promptly decided to end this prolonged pursuit felt like the appropriate denouement to a grim season.\nAnd then of course, there is Tottenham, who were essentially trolled by their own manager Antonio Conte before his inevitable recent sacking.\n“They don’t want to play under pressure, they don’t want to play under stress. It is easy in this way. Tottenham’s story is this,” Conte said, in words that appeared to echo fellow Juventus legend Giorgio Chiellini’s memorable 2018 quip: “It’s the history of the Tottenham,” following another disappointing Champions League exit.\nAccording to Deloitte’s Football Money League survey, published in January, six of the top 10 richest clubs in the world are Premier League-based: Man City, Liverpool, Man United, Chelsea, Tottenham and Arsenal.\nOf those six, at best you could argue two have been run efficiently this season. And of those two, one was recently charged with more than 100 separate financial fair play breaches.\nEven L Frank Baum would have struggled to come up with as surreal a spectacle as this ongoing, unseemly farce.\nUpcoming Premier League fixtures (3pm kick-off unless stated otherwise):\nSaturday\nAston Villa v Newcastle (12.30)\nChelsea v Brighton\nEverton v Fulham\nSouthampton v Crystal Palace\nTottenham v Bournemouth\nWolves v Brentford\nMan City v Leicester City (17.30)\nSunday\nWest Ham v Arsenal (14.00)\nNottingham Forest v Man United (16.30)\nMonday\nLeeds United v Liverpool (20.00)",
  "word_count": 1651,
  "scraped_at": "2026-02-14T01:59:46.862426",
  "_text_extracted": true
}