{
  "article_id": "bb4b3b9652bc",
  "url": "https://www.teamtalk.com/news/chelsea-warned-avoid-sensational-re-signing-liverpool-star-mohamed-salah-for-one-big-reason",
  "title": "Mo Salah : Chelsea warned to avoid sensational re - signing of Liverpool star for one big reason",
  "date": "20241213T150000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea warned to avoid sensational re-signing of Liverpool star Mo Salah for one big reason\nFormer Chelsea defender William Gallas has sensationally revealed why he thinks his old club will not take Liverpool superstar Mohamed Salah back at Stamford Bridge even on a free transfer.\nSalah spent two years at Stamford Bridge earlier in his career but only scored twice goals in 19 appearances for the Blues before being sold to Italian outfit Roma for around £15million.\nThe Egypt international ended up at Anfield in 2017 and the rest is history, with Salah turning into one of the club’s all-time greats with a remarkable 227 goals in 371 games for Liverpool – helping them win the Premier League and Champions League along the way.\nHis form this season has been equally sensational, with 16 goals and 12 assists in 22 games in all competitions for a Reds side who currently top the Premier League and the expanded Champions League table.\nHowever, the attacker has already entered the final 12 months of his contract at Anfield and can leave on a free next summer, although there are growing reports that he will extend his stay on Merseyside.\nBut, despite the fact that Salah could be available for transfer, Gallas insists he wants him nowhere near his old club Chelsea, telling Prime Casino: “I think Chelsea should reject the chance to sign Mohamed Salah as a free agent this summer, I think he would be a disruption on the squad.\n“The current Chelsea team are all learning and growing together and it’s working for Enzo Maresca. They are all part of a generation with no big egos, despite Cole Palmer being the focal point.\n“I think bringing in a player like Salah wouldn’t be good for the balance of the squad, despite his form in the Premier League and how it would weaken Liverpool.”\nREAD MORE ➡️ Six clubs Vinicius Junior could jump ship at Real Madrid for: PSG, two Saudi sides…\nFormer Liverpool stars convinced Salah is staying\nMeanwhile, former Anfield stars Jamie Carragher and Stephen Warnock are both convinced that Salah will be going nowhere next summer.\n“I think he will stay because there aren’t too many options,” Carragher told the Stick To Football podcast on Thursday. “I don’t think he’s ready to go to Saudi, he can do that in three years. I think he’s that driven as a footballer in terms of getting records for Liverpool.”\nWarnock also stated his belief that the Liverpool talisman will extend his stay on Merseyside a while longer, adding: “I don’t have to answer who I think will replace Mohamed Salah – because he will be at Liverpool.\n“I think the contract situation will get resolved. You can see on his face that he’s happy when he’s playing for the club and I think he wants to get the contract signed. Even when he came out to the media, it was a ‘I don’t want to go – I want to be here!’\n“If he leaves, I don’t know where he would go, to be honest. I know there were a few links with Paris Saint-Germain but I don’t know whether they’d go down that route with his age.\n“I just don’t see him leaving Liverpool and I think he’ll stay there!”\nLiverpool plot blockbuster move for Chelsea ace / Kelleher pushed towards Blues move\nLiverpool are reportedly considering a surprise move for Chelsea right-back Malo Gusto amid the uncertainty surrounding Trent Alexander-Arnold’s future.\nThe England defender can start talking to foreign clubs in January about a free transfer switch next summer, and with his future still very much up in the air, it’s led to the Reds eyeing up potential replacements.\nAnd, according to the latest reports, Gusto has emerged as a potential target.\nMeanwhile, Jason McAteer has told Chelsea that they should sign Caoimhin Kelleher “now” after it was suggested Robert Sanchez was hurting their title chances.\nKelleher has acquitted himself very well in the Liverpool goal this season, but with Alisson now fit again he will be resigned to bench duty once again.\nAnd with Giorgi Mamardashvili arriving next season to rival Alisson for the No.1 spot, McAteer feels Kelleher could be pushed towards Chelsea.",
  "word_count": 706,
  "scraped_at": "2026-02-14T01:52:10.157232",
  "_text_extracted": true
}