{
  "article_id": "bb6129216772",
  "url": "https://ianslive.in/we-control-isaks-future-to-an-extent-howe-confirms-no-formal-offers-made-for-swedish-striker--20250729181140",
  "title": "  We control Isak future to an extent : Howe confirms no formal offers made for Swedish striker",
  "date": "20250729T141500Z",
  "domain": "ianslive.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Suwon, July 29 (IANS) Newcastle United head coach Eddie Howe spoke on the potential exit of striker Alexander Isak and confirmed that there have been no offers for the Swedish striker. Newcastle United are currently touring South-East Asia as part of their pre-season preparations. After a 2-3 defeat against Arsenal, the Toons will face K-League XI at the Suwon World Cup Stadium in South Korea on Wednesday.\nIsak was left out of Newcastle’s pre-season squad, citing a thigh injury; however, reports by ESPN suggest Isak has informed the club that he wishes to leave, and Liverpool, PSG, and Al-Hilal are the three clubs interested. Newcastle is said not to be interested in letting him go.\nHowe confirmed that sentiment by saying to an extent, the club controls what the future may hold for the 25-year-old.\n\"He is still our player. He's contracted to us. We, to a degree, control what is next for him. I would love to believe all possibilities are still available to us. My wish is that he stays, but that's not in my full control. We have not received a formal offer for Alex from any club,” said Howe in the pre-game conference.\nIsak played a huge role in Newcastle’s solid season, with 27 goals across 42 games in all competitions, and secured UEFA Champions League (UCL) football for next season, while also ending the team’s trophy drought by lifting the Carabao Cup.\nAmid rumours that Newcastle forward Isak hopes to leave the club during the summer transfer window, Howe has admitted that things are going on behind the scenes regarding the Swedish striker, but is confident that he will stay at the club.\n\"Of course, things are going on behind the scenes. Conversations will remain private. We'd love him to continue his journey at Newcastle. We're in a strong position financially, and we're determined to be successful,” Howe previously confirmed.\n--IANS\naaa/bsk/",
  "word_count": 317,
  "scraped_at": "2026-02-14T02:02:51.943850",
  "_text_extracted": true
}