{
  "article_id": "bb762915322c",
  "url": "https://www.thejustice.org/article/2023/02/manchester-city-faces-detrimental-sanctions-brandeis",
  "title": "Manchester City faces detrimental sanctions",
  "date": "20230214T124500Z",
  "domain": "thejustice.org",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City faces detrimental sanctions\nEuropean powerhouse Manchester City faces the possibility of Premier League expulsion after being charged with over 100 counts of fraud.\nOn Monday, Feb. 6, the Premier League made an official statement announcing serious allegations of rule breaches from powerhouse Manchester City, from 2009 until today. The English Football Association could choose a wide range of sanctions for these alleged breaches, spanning anywhere from a fine to relegation from the division. In the statement, they were charged with five categories of breaches in over one hundred incidents:\nIn every season from 2009-2018, they have been charged with a failure to provide accurate financial information that gives a true and fair view of the club’s financial position, with respect to its revenue.\nFrom 2009 until 2016, they were charged with a failure to provide full details of manager and player contracts.\nFrom 2013 until 2018, they were charged with a failure to comply with the club licensing and Financial Fair Play laws of the Union of European Football Associations, Europe’s governing body.\nFrom 2015 until 2018, they were charged with breaches of the Premier League’s profitability and sustainability laws.\nSince the alleged breaches ceased in 2018, they have allegedly failed to cooperate with the Premier League in investigations, including providing adequate documents and information.\nIn recent years, Manchester City has become one of the world’s most dominant soccer clubs. Over the course of their club’s history, the Citizens have been in the shadow of cross-town rivals Manchester United, who are widely acknowledged as the biggest club in England. In Manchester City’s 128 years prior to 2008, they had only two league titles, four FA Cups, and two league cups. That’s when the tides changed.\nOn Sep. 1, 2008, they were bought by Sheikh Mansour, the Deputy Prime Minister of the United Arab Emirates. Mansour’s net worth, though disputed, is reportedly $30 billion. This takeover changed the game in soccer, leading to a trend of nation-states owning clubs and a new era of sportswashing. Sportswashing is when regimes use sports as propaganda to improve their reputations and deflect from human rights violations. This idea isn’t new — it was used during the 1934 World Cup in Mussolini’s Italy, the 1936 Olympics in Hitler’s Germany, and the 1978 World Cup in Videla’s Argentina. Amnesty International and Human Rights Watch criticized Manchester City’s “close relationship with a country that relies on exploited migrant labour and locks up peaceful critics and human rights defenders.”\nThe UAE’s sportswashing techniques have certainly been successful. Emirates sponsors massive soccer clubs including Real Madrid, AC Milan, Arsenal, Benfica Olympique Lyon and Olympiacos, as well as the English FA Cup. It also sponsors other notable sports such as F1, rugby, tennis, horse racing, golf, cricket, cycling, and more. Today, people overlook the human rights violations, and Dubai is one of the most popular and sought after vacation destinations in the world.\nThis technique has also been successful in growing Manchester City as a club. Since the takeover, they have won six Premier League titles, six League cups, two FA Cups, and reached the UEFA Champions League Final. In Sheikh Mansour’s first season, 2008-09, the club’s total revenue between matchday, broadcasting, and commercial accumulated around €102 million ($140 million). In the 2021-21 season, that number was reportedly €731 million ($783 million). Clearly, they have grown as a club under Mansour, but now they face controversy over their honesty and integrity with regards to FFP and Premier League laws.\nIn short, clubs cannot spend more money than they earn through these revenue sources. With the unfathomable net worth of their owners, it was very possible to pump in more money than they have earned to sign the biggest stars. Allegedly, they have lied about the amount they have earned in order to invest more under the table and therefore spend more.\nThis is not the first time Manchester City has been subject to investigation over these matters. In 2020, UEFA banned them from all European international competition for two years over similar violations of FFP. This decision was appealed and ultimately overturned. However, UEFA’s former Chief Investigator, Yves Leterme, is convinced the Premier League has a stronger case against the club than UEFA did in 2020. He cited many reasons for this accusation — “the Premier League does not have to adhere to the same strict limitation periods as we do.” UEFA could only operate in a five year time period, while the Premier League has no limit and can use all evidence it has dating back to 2009.\nThe Premier League began its investigation of Manchester City in 2018. If found guilty, the club could face a wide range of sanctions. The sanctions could span anywhere from a transfer window ban, to heavy fines, to a strip of past league titles, to a points deduction during this year’s heated title race, to even an expulsion from the Premier League. If the latter were to happen, though highly unlikely, they could be sent as low as the fifth tier semi-professional level, as the three EFL leagues below “would have no obligation to accept a demoted City.” Manchester City has some serious work ahead, and the soccer world will be keeping a close eye on them throughout it all.\nPlease note All comments are eligible for publication in The Justice.",
  "word_count": 891,
  "scraped_at": "2026-02-14T02:06:47.853605",
  "_text_extracted": true
}