{
  "article_id": "bb982cad3e4c",
  "url": "https://www.teamtalk.com/liverpool/arne-slot-sack-not-safe-yet-broadcaster-reveals-fsg-dream-choice-become-new-boss",
  "title": "Arne Slot : Liverpool boss not safe from sack yet as broadcaster reveals FSG dream choice replacement",
  "date": "20251201T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nSlot not safe from Liverpool sack yet as broadcaster reveals FSG’s top choice to become new boss\nLiverpool continue to make contingency plans for life after Arne Slot after a divisive figure revealed their plans to appoint one of Europe’s leading coaches as his successor and their immediate plans for an interim boss, while our sources can reveal what the Dutchman must do next to ensure he survives.\nThe Premier League champions claimed a much-welcomed and pressure-relieving 2-0 win at West Ham on Sunday to climb back to eighth in the table, to move within three points of a top-four spot. That victory, courtesy of goals from Alexander Isak – only his second for the club – and Cody Gakpo, ended a run of three straight losses for Liverpool.\nIndeed, going into the game at the London Stadium, the Reds had lost nine of their last 12 games, heaping incredible pressure on Slot and prompting talk that he was facing the sack to gather serious pace.\nOff the back of that, our correspondent Fraser Fletcher had revealed that a victory against the Hammers was seen as a “non-negotiable” by the Liverpool board, with the game coming at the start of what is viewed as a very winnable run of fixtures.\nDespite starting that sequence in the best possible fashion – and Liverpool’s no-nonsense defensive approach will also have raised spirits – Slot remains a man under intense pressure, and broadcaster Richard Keys is adamant the sack remains possible at Anfield and having named the big-name coach FSG have set their sights on as his replacement.\nRevealing ambitions to appoint PSG coach Luis Enrique as the heir, but with a familiar face slotted in as an interim appointment, Keys said live on beIN Sports: “Did Steven Gerrard have any idea that this situation was developing when he said no to Rangers recently? I’m just asking the question.\n“I think long-term, they want Luis Enrique. I think there’s little to no chance Paris would allow that to happen, but maybe Luis Enrique harbours an ambition to manage in the Premier League. That’s not going to happen now, so they may need a babysitter.”\n“Now, Steven may have tax issues that require him to continue to live in Bahrain, but I’m sure in football, if people want something to happen, it generally does. I don’t believe Liverpool’s hierarchy could not have had conversations about it [sacking Slot].”\nLIVERPOOL WIN REFLECTIONS 🔴 Three huge selection lessons Slot learned after Liverpool win as new Salah reality dawns\nArne Slot sack? What happens next…?\nSpeaking to a source at Anfield in the wake of Wednesday’s chastening loss to PSV Eindhoven in the Champions League, Fletcher revealed that the Reds boss would be expected to pick up a minimum seven points from their next three league games, and potentially as many as nine to save himself.\nHaving won the first of those, at West Ham, Slot will have slept a little easier on Sunday night.\nHowever, in Fletcher’s hard-hitting report, he revealed that while the long-term vision remains unchanged, Wednesday’s Champions League thrashing had rattled the club, intensifying the scrutiny on Slot.\nTo that end, any slip-up at West Ham, as Keys attested to, could have proved fatal to his chances of keeping his job.\nNonetheless, the pressure remains intense and Slot will be expected to pick up two more wins from the next two games (Sunderland at home on Wednesday and away at Leeds on Saturday) to really keep the wolves from his door and convince the owners they are starting to turn the corner.\nFurthermore, Fletcher revealed that, behind the scenes, contingency planning is understood to be in its infancy.\nIn the wake of Sunday’s win, though, Slot paid tribute to the fans, who had made clear their support for the manager during the match.\n“It says a lot about the club and fans that they were not only supportive of me but the whole team,” Slot told the media.\n“If you have such a run of form you are having and have an away game, and the away end is so full and supports the team from start to finish, including me, that is special.\n“Not only after the 1-0 but 0-0 from start to finish. It tells you this club is always together but maybe even more in difficult moments and they appreciate even more what you have done for the club and support you and that is what this makes the club special; to support someone when they are successful is easier than to support someone or a team when things are as tough as they are now.”\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.\nLatest Liverpool news: Iliman Ndiaye truths; Konate nears new deal\nMeanwhile, our Everton correspondent Harry Watkinson has been in contact with the club to ask them about rumours linking Toffees star Iliman Ndiaye with a high-profile move to Anfield.\nAnd TEAMtalk can now reveal the truths around the speculation and what is really going on with the Senegal international, who is also attracting admiring glances from Manchester City and Tottenham Hotspur.\nElsewhere, a Sky Sports reporter has shed light on what happens next for Liverpool and Ibrahima Konate following news Real Madrid steered clear, and the most obvious scenario might not be the one that unfolds.\nOur reporter, Dean Jones, meanwhile, has revealed why the Reds now have a growing optimism that Konate will extend his deal on Merseyside following Real’s U-turn.\nFinally, David Ornstein has provided an update on what the future holds for top Liverpool transfer target Marc Guehi – and it makes sobering reading for Liverpool.",
  "word_count": 964,
  "scraped_at": "2026-02-14T01:49:57.607189",
  "_text_extracted": true
}