{
  "article_id": "bbc463e49915",
  "url": "https://www.themag.co.uk/2024/06/yankuba-minteh-agrees-terms-to-move-to-another-club-from-newcastle-united-agent/",
  "title": "Yankuba Minteh agrees terms to move to another club from Newcastle United - Agent",
  "date": "20240623T104500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Yankuba Minteh agrees terms to move to another club from Newcastle United – Agent\nYankuba Minteh could be set for an imminent move away from Newcastle United.\nBakary Bojang is the 19 year old’s agent and he has stated (see below) that Minteh has agreed personal terms to move to another club.\nThe agent refusing to name the club, nor others they have been talking to.\nBojang says that with personal terms agreed, it is now down to Newcastle United, whether or not Yankuba Minteh is sold.\nYankuba Minteh agent Bakary Bojang speaking to the Chronicle on Saturday (22 June 2024) morning:\n“It is correct that Newcastle are willing to sell the player if they receive a good offer.\n“From our side, if Newcastle wants to sell and the sporting project is good, we will definitely look at it.\n“We are in communication with some clubs.”\nBakary Bojang later speaking to the Chronicle on Saturday night:\n“I can’t confirm [which] clubs who are in communication with us.\n“[But] We have agreed terms with one of the clubs.\n“So now the rest is with Newcastle.”\nTaken at face value, the agent’s comments don’t appear to leave any doubt, in terms of Newcastle United’s willingness to sell Yankuba Minteh, if getting the right offer.\nAt the same time, experience tells us that agents benefit from their players moving clubs and not all of them tell the whole truth the whole of the time.\nI am not claiming that this is the case here but you do need to have a healthy scepticism with any transfer story.\nThe backdrop to this possible transfer, is that Newcastle United are claimed to be one of at least six clubs who need to bring in some cash by 30 June 2024 at the latest, to avoid breaking Premier League PSR (Profit and Sustainability Rules) for this latest three year accounting period, from 1 July 2021 to 30 June 2024.\nWe are all in the dark of course as to how accurate this is and if true, exactly what amount of money Newcastle United need to add by the end of the month? However, the likes of Aston Villa, who are believed to be a club that definitely needs to sell one or more players before the end of June, are in the process of doing so.\nIt is of course a strange situation with Yankuba Minteh, a player who hasn’t as yet wore the black and white shirt and if the above is true, probably never will.\nYankuba Minteh was one of the successes of the 2023/24 season for Eddie Howe and Newcastle United.\nThat is, despite not playing a single minute in a black and white shirt.\nYankuba Minteh one of those rarest of things, an NUFC player sent out on a year’s loan that has proved to be the absolute perfect choice of club.\nSigned from Odense for £7m plus future potential add-ons in June 2023, then instantly loaned out to Feyenoord for the entire 2023/24 season.\nIn the Dutch league, Yankuba Minteh starting 17 games and 10 appearances off the bench.\nA total of 1,463 minutes of league football and averaging a very impressive direct goal involvement every 97 minutes on average, scoring ten goals and getting five assists.\nAdd in some promising performances in Feyenoord’s Champions League games and another goal, capping off an excellent season. Not to mention helping Feyenoord to win the Dutch cup, as well as finishing runners-up in the league and getting Champions League qualification again.\nYankuba Minteh staying in the headlines even after the club season finished, as he scored two goals for Gambia in World Cup qualifiers in June, to go with another goal for his country during the league season.\nHe has made exciting progress but we are basically talking about one season in the Dutch league and he only started 17 league games. If Newcastle United desperately needs a large sum to come in to stay the right side of PSR before this upcoming 30 June 2024 deadline (covering a three season period), then it only makes any sense whatsoever if a club was going to pay serious guaranteed money for Yankuba Minteh, rather than a big part of any transfer being potential money if hitting certain targets. Whilst any sell on clause Odense may have, is another factor to take into possible consideration.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 744,
  "scraped_at": "2026-02-14T01:51:32.424199",
  "_text_extracted": true
}