{
  "article_id": "bbd2d2246ded",
  "url": "https://www.bbc.co.uk/news/articles/c77kvx575npo",
  "title": "How Kettering Town sponsorship deal changed football for ever",
  "date": "20260118T164500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How a tyre company's name on a shirt changed football for ever\n- Published\nInter Milan and Pirelli. FC Barcelona and Unicef. Liverpool and Crown Paints.\nThanks to shirt sponsorship, these brands evoke instant nostalgia in football fans across the globe.\nHuge companies like Emirates and T-Mobile have become synonymous for many with teams, rather than their services.\nO2? Arsenal's invincibles, of course. Sharp? Manchester United's 1999 treble-winners. Etihad? Manchester City and \"Agueroooooo!\".\nBut Kettering Tyres? Now there's a story.\nIt is 50 years since Kettering Town, nicknamed the Poppies, became the first English football club to feature a sponsor's name on its shirt.\nThat moment, on 24 January 1976, spawned an industry now worth hundreds of millions of pounds.\nThe £4,000 deal was secured by Derek Dougan, then the Northamptonshire club's player-manager and business chief.\nHe had seen a TV advert and thought the tyre firm's initials were a perfect match.\nNicknamed \"The Doog\", he had previously played for Wolverhampton Wanderers, Leicester City and Peterborough United, as well as spells in the United States.\n\"Dougan joining Kettering put us on the back pages but also the front pages with this shirt, this initiative,\" remembers Sean Suddards, who played for the side at the time.\n\"He was chairman of the PFA [Professional Footballers' Association], he was George Best's partner in crime playing for Northern Ireland and he was a television celebrity.\n\"And then he became a celebrity in Kettering.\"\nIn an interview with the Sports Argus at the time, Dougan said finding a different sponsor for every home match was \"hopelessly time-consuming\".\n\"I hit on the idea of getting one company to do the lot,\" he said.\n\"When I spotted the title for Kettering Tyres – KT for Kettering Town – I realised I was on a winner if I could get them to do it.\n\"When they agreed I felt I had made a breakthrough.\"\nThe sponsor's name debuted in the Poppies' Southern League Premier Division match against Bath City.\nBut within days, the Football Association (FA) ordered its removal, claiming a breach of its regulations.\n1 of 4\nDougan reportedly stripped the lettering back to just \"Kettering T\", but this was not accepted either.\n\"It was strange because all of a sudden the front of the shirt was the object everyone noticed, whereas before it was the back,\" Suddards, now 72, told Chance Litchfield on The Non-League Scene.\n\"Derek took the shirt by the scruff of the neck and went ahead and did it, much to the annoyance of the powers that be.\"\nDougan argued he was one of many commercial managers in football who wanted to secure more money for their clubs.\n\"The clubs are horrified that they are denied the opportunity of bringing additional money into the game,\" he told the BBC in 1976.\n\"I feel, quite honestly, that I've got to take the bull by the horns.\"\nIn a separate interview, reported in the Liverpool Daily Post, Dougan called the FA \"petty-minded bureaucrats\" for blocking the deal.\nBut threatened with a reported £1,000 fine, Dougan had no choice but to back down.\nClub historian Bob Brown explains: \"They said, 'We can close your ground down if you keep doing it.'\n\"So Kettering Tyres was never a shirt sponsor again after that.\"\nBut Dougan's battle had not been in vain. In June 1977, the FA decreed a small logo would be permitted in the future, so long as it was not \"detrimental to the image of the game\".\nUruguayan club Penarol is considered to be the first in the world to introduce shirt sponsorship, in the 1950s.\nLater, German side Eintract Braunschweig wore liqueur manufacturer Jagermeister's logo on their shirts.\nBut football finance expert Kieran Maguire believes Kettering Town's move was a pivotal moment for the game.\n\"Since we've had the globalisation of the Premier League and La Liga, it has meant shirt sponsorships have been a fantastic way to partner up your brand with a sport that is globally popular,\" he says.\n\"We've seen major brands trying to get their name across to a wider population and they're very much willing to pay premium deals for that.\"\nAccording to GlobalData, the combined value of shirt sponsorship deals involving Premier League clubs and gambling companies alone in the 2024-25 season was $135.43m (£101.1m).\nMaguire continues: \"These organisations wouldn't renew those contracts if they didn't feel they were getting value for money.\n\"But fans also talk about the sponsors with affection. That ties in with the huge interest among football fans for retro shirts.\n\"For businesses, that means they get the opportunity to recycle their brand and keep it relevant.\"\nKettering Town has produced replicas of the infamous 1976 shirt to mark the anniversary.\nPlayers will wear it in Saturday's home match against Alvechurch and next weekend, away at Bishop's Stortford.\nMeanwhile, Bryan Lewin, a supporter for 70 years, has been hunting for one of the originals.\nThey are incredibly rare as replica kits were scarcely produced in the days when the strip came out.\nSo far, the only known person in possession of one – a former player – has ruined it by wearing it in the garden, Lewin says.\nDougan died in 2007, aged 69, but Lewin is proud of how his initiative etched the club's name into football history.\n\"This has produced millions of pounds to clubs in England,\" he says.\n\"But go down to your local park on a Saturday or Sunday morning and you'll see youth games where many shirts are sponsored.\n\"This permeates right down to the grassroots levels and has brought money into football as a whole – not just the top level.\"\nGet in touch\nDo you have a story suggestion for Northamptonshire?\nFollow Northamptonshire news on BBC Sounds, Facebook, external, Instagram, external and X, external.\nRelated topics\nMore related stories\n- Published23 December 2025\n- Published18 April 2025\n- Published31 October 2024",
  "word_count": 984,
  "scraped_at": "2026-02-14T02:09:43.002567",
  "_text_extracted": true
}