{
  "article_id": "bbdd081e9c79",
  "url": "https://cartilagefreecaptain.sbnation.com/2025/5/21/24434832/tottenham-hotspur-news-europa-league-title-ange-postecoglou-change-the-club",
  "title": "Ange : Tottenham Europa League win will  change the club  - Cartilage Free Captain",
  "date": "20250522T003000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s hard to know where to begin. Over 90+ minutes in Bilbao, Spain, Tottenham Hotspur exorcised the demons of this long and hard season — the 17th place Premier League finish, the injuries, the poor form, the doubts — with a club-defining 1-0 win over Manchester United.\nAnge: Tottenham’s Europa League win will “change the club”\nThis means EVERYTHING to Tottenham Hotspur.\nThe result was not only the fourth time they’ve defeated United this season. It gave Tottenham the Europa League title — the first piece of silverware since the 2009 League Cup title and the first European title since the 1984 UEFA Cup win over Anderlecht. But it’s more than that — the win means that Spurs will play Champions League football next season with all that comes with it.\nIt’s a win that redefines the entire club. No longer are Spurs trophyless losers who always fall short at the last hurdle. No more are they saddled with a 17-year old giant monkey on their backs. Ange Postecoglou may or may not be leading the team next season (LOTS more to come on that) but he has given Spurs fans something unquestionably priceless — a night of joy.\nThe significance is not lost on Postecoglou. Speaking to TNT Sports after the final whistle, Ange said how proud he was of his team, and how winning this match can have a massive ripple effect on the entire organization.\n“I’m still taking it all in. I know what it means for this football club. The longer it goes, the harder it is to break that cycle. I could sense the nerves in everyone at the club and until you take that monkey off your back you never understand what it feels like. We have a young group and I hope by tasting this, the players feel different about themselves and what it means to them is unbelievable.\n“I’ve always felt knockout football is different to league football and when you’re in that situation it comes down to good organization, having a real gameplan and moments, and you can minimize moments by having a strong foundation.\n“I felt we were going to be really hard to break down. We could’ve been better in transitions but I felt comfortable that if we got ahead we could deal with most of what Manchester United would throw at us.\n“People misinterpreted me [about saying I always win in my second season]. It was not me boasting, just me making a declaration and I believed it. I had this thing inside me more than anything else.\n“I know our league form has been unacceptable, but coming third was not going to change this football club, winning a trophy would, that was my ambition and I was prepared to wear it if it did not happen. People kept reminding me of it because we were getting closer but I’m happy with that.”\nIt wasn’t exactly the prettiest match of football ever. In fact, it was mostly a slog. If you were a neutral watching this match (and there were a lot of them based on my social media feed) you were very likely not impressed by the way both Spurs and United set up to play. Both teams had significant players missing to injury, both of them set up more to capitalize on mistakes made by the other team than to win on their own terms. The winning goal was a scruffy near post backheel poke by Brennan Johnson that deflected off of Luke Shaw and over the line. Spurs barely had any shots after that fact and spent the last 20 minutes plus injury time with five defenders trying to absorb pressure.\nIt wasn’t exactly champagne football. It definitely wasn’t Ange-Ball. But it worked. And Postecoglou said in his post match press conference that it was by design.\n“Knockout football is always different. My teams have always played differently in knockout football. You’ve got to limit the opposition in those moments. The players understood that. That’s why we did so well in the Carabao Cup, beating a lot of good teams. It’s also important having the likes of Van de Ven, Romero, Udogie, Porro and Vic.\n“I’m super proud of these players. To quote my favourite prime minister Paul Keating: ‘It’s an unlikely victory but this is a victory for the true believers, the people who in difficult times have kept the faith.’ This players have never wavered.”\nThere will be lots more to come in the hours and days ahead.",
  "word_count": 755,
  "scraped_at": "2026-02-14T02:26:38.633925",
  "_text_extracted": true
}