{
  "article_id": "bbfa32caa7bf",
  "url": "https://www.caughtoffside.com/2023/12/08/1562563/",
  "title": "West Ham ace sends direct dig at David Moyes despite Spurs win",
  "date": "20231208T210000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "James Ward-Prowse has openly criticised David Moyes for his approach and lack of confidence in West Ham’s players.\nThe scrutiny on Moyes’ tactics has been significant this season, justifiably so, as many fans express dissatisfaction with the playing style considering the talent available. There’s a noticeable contrast with the styles of West Ham’s Premier League rivals like Aston Villa, Newcastle, Brighton, and Spurs.\nSome West Ham supporters believe the team won’t progress unless a progressive, modern, attack-minded manager replaces Moyes next summer. Despite a lackluster first half against Tottenham, West Ham rallied in the second half, displaying the performance levels they are capable of, securing a memorable comeback win with goals from Bowen and James Ward-Prowse.\nWest Ham faced jeers after a lackluster display in a 1-1 draw against Palace, and the uninspiring performance persisted in a disappointing first half at Tottenham with just 28% possession.\nJames Ward-Prowse openly criticised Moyes for his approach, emphasizing Moyes’ emphasis on neutralizing Spurs rather than leveraging West Ham’s talented team to exploit their rivals.\nWard-Prowse hinted that the players took charge, rallying themselves in the second half to showcase their ability to play football.\n“Good result, good performance,” Ward-Prowse told Amazon Prime TV.\n“I think a lot of the pre-game preparation was around them and their qualities.\n“But we know what we’re about as a team and as a club.\n“And I think that epitomised the group that we’ve got at the moment, it’s a strong group and heading in the right direction…”\nWith the recent win, the Hammers are now three points behind Spurs in 5th and six points off the Champions League spots.",
  "word_count": 272,
  "scraped_at": "2026-02-14T01:54:16.872301",
  "_text_extracted": true
}