{
  "article_id": "bc0234e4f9ef",
  "url": "https://www.the42.ie/liam-scales-4-6222676-Nov2023/",
  "title": "Liam Scales on surprising Brendan Rodgers and going from Arklow Town to the Champions League",
  "date": "20231114T211500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "HERE’S HOW to tip the Scales in your favour.\nAt the start of the season, Brendan Rodgers was planning without Stephen Kenny’s latest debutant at senior international level. Having joined Celtic from Shamrock Rovers, Liam Scales – like so many Irish youngsters before him – struggled to break into the first-team, and was set for a return to Aberdeen, for whom he had spent the previous season on loan.\nBut then circumstances changed. A series of centre-backs near the top of the pecking order fell away; some were injured, others left. And suddenly Scales found himself pitched into the starting team. First he played at centre back in a routine win over St Johnstone, and next he was man of the match in an Old Firm win at Ibrox. Scales has since played every minute of action in the league and Champions League, the latter which has featured two games against Atletico Madrid along with clashes against Lazio and Feyenoord.\nRodgers has described Scales as one of the biggest surprises of his career.\n“Most people thought I was going to go back to Aberdeen”, reflected Scales at a press conference at the Irish training base earlier today. “It was sort of in the pipeline, there was talk of it happening. Then obviously a few injuries happened. I think I’ve surprised in the sense that maybe I wasn’t fully in the picture, then a few injuries happened and I was thrown straight in and did well, and I’ve held my place now.”\nScales is now part of a growing cohort in the Irish squad of an overnight success years in the making. He didn’t tread the traditional Irish football route. The brightest talents of his agegroup went to England at 16, whereas Scales was still playing Gaelic football at that age, combining it with football for Arklow Town in the Leinster Senior League, after a brief stint at St Joseph’s Boys didn’t work out. He went on to make his League of Ireland mark with UCD, from whom he joined Shamrock Rovers. His performances for Rovers were such that Celtic made a move.\n“The main thing I wanted to do was enjoy my football and play with my mates”, said Scales of his teenage years. “I was playing U16 county Gaelic football for Wicklow as well and I was enjoying that, and it came to a stage where I had to pick one or the other. It wasn’t an easy decision and I think I just picked football because I knew I had a chance to get a scholarship. I never looked too far into the future about being a professional. It was always, get a scholarship at UCD, see how it goes, I’ll do these trials for the Leinster schools teams and see how it goes, and it’s worked out well for me that way.”\nHe joined Celtic midway through the 2021 League of Ireland season, but was nonetheless voted into the PFAI’s Team of the Season, the medal for which he only picked up today, when he met PFAI Secretary Stephen McGuinness at Abbotstown.\nThe greatest recognition came last night, when Scales was presented with an Ireland cap by Niall Quinn. Scales made his senior international bow against Greece at the Aviva last month, and retained his place in the subsequent victory over Gibraltar.\nAt 25, Scales’ rise is similar to that of Chiedozie Ogbene: both grounded their late teens and early twenties in the League of Ireland before crossing the channel. Post-Brexit, it’s a route likely to be emulated.\n“The League of Ireland is brilliant”, said Scales. “The fact that young players aren’t really able to go to the UK because of Brexit is brilliant. I keep an eye on the league and you see the likes of (Sam) Curtis at Pat’s, who has played a lot of senior games and he is still only 17. That is going to really help him in his career moving forward. He will go on now…obviously he might stay at Pat’s, but if he goes on now he has senior games under his belt and clubs abroad really value that. It’s a great pathway and I do hope more people follow that.”\nScales has needed patience at international level, too.\n“I had to be patient. I was in a few squads but I never got a cap [across] the last couple of years. To finally get it is brilliant. It is a high level of football and there is a lot on the line. You pretty much need to win as many of them as you can. The pressure is there and they are tough games, but it is a good experience and I’m delighted that it has happened.”\nIt has probably happened during the final days of Stephen Kenny’s reign. The manager’s contract expires at the end of this international window and there appears little appetite at the FAI to renew it.\n“I’ve loved working with Stephen”, said Scales. “He brought me into the U21s when he was manager there and I was at UCD. Maybe there were players playing at a higher level or playing in academies in Premier League clubs and I was picked ahead of them because I was playing men’s football and he knew the importance of that. He has always backed me, I suppose, and I’ve enjoyed working with him. That’s all I can say. He has shown lots of faith in me and I really appreciate that.\n“The results, it’s down to us as well and they haven’t been good enough. Everyone can see that. It’s tough because you know he loves the job so much, it’s the dream job for someone like him. It’s tough to see him go through that.”",
  "word_count": 958,
  "scraped_at": "2026-02-14T02:25:08.303717",
  "_text_extracted": true
}