{
  "article_id": "bc099a308e9d",
  "url": "https://www.teamtalk.com/leeds-united/ucl-side-choose-disastrous-leeds-utd-flop-firpo-wolves-misfit-ait-nouri-new-manager-handed-final-say",
  "title": "UCL side choose disastrous Leeds Utd flop over Wolves misfit with new manager handed final say",
  "date": "20230623T003000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United\nPremier League • England\nUCL side choose disastrous Leeds Utd flop over Wolves misfit with new manager handed final say\nLeeds United could be able to offload Junior Firpo this summer after he was identified as a top target for Marseille, according to reports in France.\nFirpo joined Leeds from Barcelona in 2021, effectively replacing Ezgjan Alioski as their main left-back. However, despite the calibre of club he arrived from, Firpo has struggled to prove himself for Leeds.\nHe featured in exactly half of their Premier League games this season, which ended in relegation from the Premier League. In turn, a number of their players could move on this summer.\nOur feature last month highlighted 10 players likely to leave Leeds following relegation.\nFirpo – whose contract at Elland Road is only due to last for another two years – is another one to consider who was not on that original list. Earlier this month, Fabrizio Romano confirmed the wing-back will leave Leeds for a new challenge elsewhere.\nAt the time, his next club was not known, though there was interest from across Europe. Now, a French source has managed to pinpoint one of his potential takers.\nAccording to La Gazette Du Fennec, Marseille have been focusing on Firpo as they aim to invest in a new left-back.\nMarseille – who have Champions League football on offer for 2023-24 – have had Nuno Tavares on loan from Arsenal this season. After the end of his spell in France, the club will need a new option to rotate with another ex-Arsenal man, Sead Kolasinac.\nFirpo emerges as Marseille target after wide-of-the-mark Wolves rumour\nThe report from LGDF mentions how some had been theorising that Marseille would be in for Wolves’ Rayan Ait-Nouri.\nHowever, the Algerian is deemed to be ‘uncompetitive and not really cut out for Europe’. Instead, as they prepare for their Champions League campaign, Marseille’s target is Firpo.\nBefore making their move for the Leeds man, they will have to get the green light from their new manager, Marcelino Garcia Toral.\nMarcelino will be aware of Firpo from his time working with other clubs in La Liga. Prior to joining Leeds, Firpo spent the entirety of his career in Spain, spending the 2017-18 and 2018-19 seasons with Real Betis and the 2019-20 and 2020-21 seasons with Barcelona.\nMeanwhile, Marcelino was in charge of Valencia in both of the seasons Firpo was at Betis.\nAt the moment, Marcelino’s final judgement on the 26-year-old is yet to become apparent. Furthermore, the report has not mentioned how much Leeds might gain in terms of a transfer fee if Marseille take Firpo off their hands.\nAs for Ait-Nouri, incidentally, LGDF suggests he has become a target for Al-Duhail in Qatar. However, the 22-year-old ‘has no intention’ of leaving European football at this stage of his career.\nTherefore, if Wolves want rid of their 2020 signing from Angers, they will have to find another solution.\nREAD MORE – Next Leeds manager: Friday announcement due as 49ers pick Prem legend; Whites in talks over three signings",
  "word_count": 513,
  "scraped_at": "2026-02-14T01:56:02.429512",
  "_text_extracted": true
}