{
  "article_id": "bc46c1028264",
  "url": "https://thepeoplesperson.com/2025/10/22/angelo-stiller-united-learn-how-much-they-need-to-pay-to-sign-vfb-stuttgart-star-300236/",
  "title": "Angelo Stiller : United learn how much they need to pay to sign VfB Stuttgart star - Man United News And Transfer News",
  "date": "20251022T134500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United appear to be in the running to sign VfB Stuttgart midfielder Angelo Stiller.\nWith the team seemingly in need of midfield reinforcements, Man United have been linked with several midfielders, from the summer up until the present day.\nDespite being interested in launching a summer bid for Carlos Baleba, United ultimately decided against the move due to his exorbitant price tag. Instead, it appears that United could attempt to sign him next summer instead.\nStill, such links with Baleba have not dissuaded United from chasing down a high-flying Bundesliga star.\nInterest in Stiller mounts\nHaving already displayed interest in him last summer, United have reportedly retained their interest in Stiller, with the player believed to be ready to depart Stuttgart in 2026.\nWhile the player has a €40m release clause in his contract, it could be challenging for United to activate this clause given that several other clubs might try to do the same.\nWith Liverpool and Bayern Munich also being linked, Stiller could decide that he would rather join one of those clubs, given their exposure to Champions League football.\nStill, United need not fear, as Stuttgart could be convinced to send the player to Old Trafford if the price is right.\nPrice tag revealed\n“Stiller feels perfectly at home in Stuttgart, but he can certainly imagine taking the next step next summer,” Sky Germany reported, indicating that he is indeed open to a transfer.\n“VfB Stuttgart internally values Stiller at €50 million,” the report confirmed. ” If the five-time German international were to be sold for that sum, he would become the second-most expensive signing in the club’s history.”\nFurthermore, the article acknowledged that Stuttgart can decide to buy Stiller’s release clause for a once-off payment of €2 million, meaning that United may have little other choice than to bid €50 million for the player by the time the summer of 2026 rolls around.\nWhile this is no insignificant sum, Stiller could prove to be a reasonable signing for United, given that Baleba is believed to be priced at over £100m.\nFeatured image Alex Grimm via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 375,
  "scraped_at": "2026-02-14T01:59:14.387589",
  "_text_extracted": true
}