{
  "article_id": "bc53c3b0c15b",
  "url": "https://metro.co.uk/2024/10/26/two-referees-banned-uefa-drunkenly-stealing-road-sign-champions-league-match-21870028/",
  "title": "Two referees banned by UEFA for drunkenly stealing road sign before Champions League match | Football",
  "date": "20241026T103000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A pair of match officials have been slapped with lengthy bans by UEFA after they were arrested for drunkenly stealing a road sign in the lead-up to Rangers’ Champions League qualifier with Dynamo Kyiv.\nWhile Bartosz Frankowski and Tomasz Musial have both made careers from dishing out punishments, the duo have managed to land themselves in serious hot water over the boozy night out prior to the European contest.\nPolice stated that Frankowski and Musial had been captured on CCTV attempting to carry the said road sign with another individual just hours before kick-off in Lublin, Poland, on August 6 following reports of ‘improper behaviour’.\nThe two Poles received fines at the time and have now been suspended from officiating until June 30 2025 for violating ‘basic rules of decent conduct’ by the UEFA Control, Ethics and Disciplinary Body.\n‘At around 1:40am, we received a report of three men carrying a road sign down the street,’ Lublin City Police Senior Superintendent Kamil Golebiowski told TVP Sport in the immediate aftermath.\n‘Police officers were dispatched to the scene. All of the men were intoxicated and had over 1.5 per mille of alcohol in their blood. They were taken to a sobering-up centre.’\nFrankowski was expected to take charge as the video assistant referee for the game, while Musial had been set to act as his assistant. But the Polish Football Association were forced to quickly call in Tomasz Kwiatkowski and Pawel Malec to replace them in their positions.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I am still trying to find words that will sufficiently express how much I regret this incident and how sorry I am,’ Frankowski – who has officiated at Euro 2020 and Euro 2024 – said in a statement.\n‘I realise that with one such violation, I ruined 22 years of refereeing, ruined my entire career. I should have calmly prepared for the match and not gone anywhere.\n‘As one of the police officers later told me, our prank was spotted by CCTV cameras and they intervened. I would like to clarify that we were in no way aggressive. These were stupid jokes.\n‘We did not suspect that it would be perceived this way. We had no bad intentions. It was stupidity, an idiotic fantasy, I don’t even know what to call it.’\nAccording to Frankowski, the pair’s antics with the road side were simply a ‘prank’ and a ‘stupid game’ gone wrong.\n‘Now, looking back, I understand that it was not a very smart idea. It was a sign that was lying next to where road works were being carried out and we were passing by,’ he added.\n‘I am very sorry that this happened. And on a purely human level, it was stupid, because I know that my unfortunate behaviour will cast a shadow on many years of hard work.\n‘What happened was irresponsible and unprofessional on my part, and I am fully aware of that. I would just like to emphasise that there were no acts of aggression in my behaviour, I did not break the law and there was no unlawful behaviour on my part towards police officers or anyone.’\nIn a separate statement, Musial said: ‘I wholeheartedly apologise to the authorities of the Polish Football Association, especially the Referees’ College, the authorities of Ekstraklasa and all those whom I have disappointed with my attitude.\n‘This is the first incident of this type involving me. For many years of my professional career as a referee, I have worked hard to get to where I am today.\nMore Trending\n‘At the same time, I have always tried to set an example, both on and off the pitch. I am aware of the consequences that await me, but I hope that I will be able to rehabilitate myself and rebuild your trust.’\nFrankowski and Musial were suspended by the Polish FA back in August, prior to the ban from UEFA.\nThe match in question between Dynamo Kyiv and Rangers finished 1-1 after Cyriel Dessers found a last-gasp equaliser for the Scottish Premiership side away from home.\nHowever, Rangers were beaten 2-0 in the second leg at Ibrox the following week, meaning Dynamo secured a 3-1 aggregate victory.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Manchester United consider hiring Premier League boss to replace Erik ten Hag\nMORE: Sergio Aguero names his three ‘favourites’ to win the Champions League\nMORE: Fabio Capello urges Bayern Munich star to retire after Barcelona defeat",
  "word_count": 807,
  "scraped_at": "2026-02-14T01:49:08.077098",
  "_text_extracted": true
}