{
  "article_id": "bc57e481f81b",
  "url": "https://www.empireofthekop.com/2023/12/18/liverpool-january-transfer-rumours-portugal/",
  "title": "Liverpool not ruling out January additions ; honing in on one European market",
  "date": "20231218T230000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool are unlikely to indulge in a ‘mad transfer trolley-dash’ in January, although Jurgen Klopp isn’t ruling out the possibility of new signings next month, with the club reportedly honing in on one market in particular.\nThat’s according to the Daily Mail in their latest Liverpool Confidential round-up, with the understanding that the Reds ‘are alert to opportunities and could make moves if the price is right’.\nLFC’s plans for the winter transfer window are believed to be contingent on the European progress of clubs with players they’re targeting, with a greater likelihood of getting a better deal from those whose sides have dropped out of the Champions League.\nLiverpool have ‘kept an eye on’ the Portuguese market and are assessing a number of options from that country in addition to Goncalo Inacio of Sporting Lisbon.\nThe Reds don’t have any ‘concrete’ targets in mind but ‘will keep their eyes peeled if any cheap or short-term deals’ become available in January, although midfield signings are deemed ‘unlikely’.\nDespite Klopp publicly downplaying any desire to bring in a centre-back next month, the anterior cruciate ligament injury to Joel Matip could have the manager imploring Jorg Schmadtke and co to add depth in that part of the squad when the opportunity is there to do so.\nWith Ryan Gravenberch becoming the latest addition to a lengthy injury list at Liverpool, and no let-up in the fixture schedule during the festive period, it’d be remiss of the club not to at least try to get new faces through the door in January.\nThe lethargic 0-0 draw against Manchester United on Sunday showed that several players have regressed in their performance levels since the first two months of the season. That’s understandable considering how much football the Reds have already played, but concerning with more than half the campaign still to go.\nLFC have shown over the past couple of winters that they can pounce for a target out of the blue if the opportunity arises and the move feels right, with Luis Diaz and Cody Gakpo being nabbed from under the noses of other Premier League suitors.\nPerhaps Liverpool will repeat the trick next month, once again cherry-picking a top talent from the Portuguese top flight just like they did with the Colombian and Darwin Nunez.\n📖 Anfield Annals: John Smith – Liverpool’s Red Knight and Most Successful Chairman",
  "word_count": 396,
  "scraped_at": "2026-02-14T01:56:38.153395",
  "_text_extracted": true
}