{
  "article_id": "bc748e50ffcc",
  "url": "https://www.caughtoffside.com/2025/04/18/liverpool-want-ademola-lookman/",
  "title": "Liverpool keen on signing Ademola Lookman",
  "date": "20250418T143000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool are interested in signing the Atalanta attacker Ademola Lookman at the end of the season.\nThe 27-year-old Nigerian has been a key player for the Italian club, and he has 18 goals and seven assists to his name. He has been linked with the move to the Premier League, and a report from Il Giorno claims that Liverpool have set their sights on the former Premier League attacker.\nLookman has played in the Premier League before with Everton, but he never really managed to showcase his true qualities. He might feel that he has unfinished business in English football, and he will look to prove himself if he joins Liverpool. He has been described as a “truly extraordinary player” by Gian Piero Gasperini.\nThe Reds need to bring in a dynamic attacker like him who is capable of operating anywhere across the front three. They have been overly reliant on Mohamed Salah for goals and creativity. Diogo Jota and Darwin Nunez have been quite mediocre, and Luis Diaz can be inconsistent at times. Signing another quality attacker could prove to be a wise decision.\nMeanwhile, the player has been linked with Manchester United as well. The player is likely to cost around £50 million.\nAdemola Lookman could be tempted to join\nLiverpool will be hoping to fight for league titles and the Champions League next season, and the opportunity to join them will be quite exciting for the 27-year-old as well. He is at the peak of his powers, and this is the right time for him to take the next step and join a more competitive club.\nLiverpool are one of the biggest clubs in the world, and the opportunity to join them can be hard to turn down. It will be interesting to see if they can secure an agreement with the Italian outfit. Convincing the player to join them should not be difficult.\nLiverpool are close to winning the league title this season and they will look to build on their current squad. Signing top quality attackers like Lookman will help them challenge for major trophies next season as well.",
  "word_count": 354,
  "scraped_at": "2026-02-14T01:49:31.508252",
  "_text_extracted": true
}