{
  "article_id": "bc748be98672",
  "url": "https://www.caughtoffside.com/2025/04/24/matheus-cunha-man-utd-transfer-2/",
  "title": "Matheus Cunha transfer : Man Utd optimistic over Wolves star",
  "date": "20250424T110000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wolves star Matheus Cunha is felt to really want a transfer to Manchester United this summer, with optimism that a deal can be done.\nThat’s according to the latest from Italian journalist Fabrizio Romano via his official account on X.\nRomano claims the Red Devils are optimistic about getting a deal done for the in-form Brazil international.\nSee below for details on Man Utd’s pursuit of Cunha, who has also been linked with other top clubs in recent times after an impressive record of 16 goals and four assists in all competitions for Wolves so far this season…\n? Manchester United mantain optimism for Matheus Cunha deal as the club feels he really wants the move.\nUCL football not expected to be a factor with Cunha keen on the move, as Man United would be ready to pay £62.5m clause in installments if Wolves approve.\nTalks continue. ?? pic.twitter.com/LcYrcLkxct\n— Fabrizio Romano (@FabrizioRomano) April 24, 2025\nCunha clearly looks like one of the top attacking players in the Premier League and like he could be a good fit for Ruben Amorim’s side.\nUnited are in desperate need of upgrades on the likes of Marcus Rashford, Antony and Jadon Sancho, and Cunha looks like he ticks a lot of boxes.\nMatheus Cunha transfer could be the big change Manchester United need\nCunha looks ready to move up a level after showing huge potential at Wolves, and it’s easy to imagine he could really explode with better players around him.\nFor now, of course, MUFC don’t necessarily look like that much of a better team than Wolves after such a dire campaign, but one imagines it won’t be too long before Amorim can steer the team up the table.\nAmorim will have a summer to bring in more of his own signings, and also to get his ideas across in a full pre-season, which he hasn’t had yet.\nThat would hopefully help someone like Cunha settle in well and get off to a flying start at Old Trafford.\nStill, it will be interesting to keep an eye on this saga if any Champions League clubs try to enter the running for the 25-year-old, who could arguably do a lot better than United right now.",
  "word_count": 372,
  "scraped_at": "2026-02-14T01:58:31.707370",
  "_text_extracted": true
}