{
  "article_id": "bc912ba70755",
  "url": "https://www.fourfourtwo.com/features/the-best-strikers-of-the-80s",
  "title": "The best strikers of the 80s",
  "date": "20231127T223000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best strikers of the 80s\nRanking the greatest centre-forwards on the planet during the 80s\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nPutting the ball in the net is what it all comes down to in football, ultimately – and good strikers go a long way to helping your team do that.\nThe 80s saw plenty of them, from prolific club goalscorers to those who shone brightest on the international stage.\nHere, FourFourTwo runs through the finest of them...\n32. Nico Claesen\nA regular for Belgium during the latter half of the 80s, Nico Claesen represented his country at Euro 1984 and the 1986 World Cup – scoring three goals at the latter as his nation finished fourth.\nTop scorer in the Belgian top flight in 1983/84, Claesen had spells in Germany and England with Stuttgart and Tottenham respectively before the end of the decade.\n31. Roger Milla\nRoger Milla earned cult status through his performances for Cameroon at Italia '90 – but one of Africa's very first global footballing superstars had already made a noteworthy impact in Europe by then.\nHaving won the Coupe de France with Monaco and Bastia in 1980 and 1981 respectively, Milla dropped from Ligue 1 to Ligue 2 – scoring freely for Saint-Etienne then Montpellier, helping the latter to promotion back to the top flight in 1987.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nHe was also instrumental in Cameroon qualifying for their first World Cup in 1982.\n30. Mark Hateley\nCapped 32 times by England, Mark Hateley began his career with Coventry City but spent most of it abroad – taking the not-so-well-trodden path from Portsmouth to AC Milan in 1984.\nThe £1m man's time with the Rossoneri was blighted by injury – but he did score 21 goals in three seasons, including a derby winner against Inter, before averaging a goal every other game in Monaco's 1987/88 Ligue 1 title-winning campaign.\n29. Steve Archibald\nA member of Scotland's 1982 and 1986 World Cup squads, Steve Archibald helped fire Aberdeen to the 1979/80 Scottish Premier Division title under Alex Ferguson – earning himself a move to Tottenham in the process.\nAfter bagging 77 goals in four seasons for Spurs – where he won two FA Cups and the UEFA Cup – Archibald was on the move once more – this time to Barcelona, where he netted 15 times as Terry Venables' side were crowned 1984/85 La Liga champions.\n28. Klaus Allofs\nTop scorer at Euro 1980 as a member of the victorious West Germany team – with all three of his goals coming in a 3-2 group-stage win over the Netherlands – Klaus Allofs was prolific in the Bundesliga with Koln for much of the 80s.\nA World Cup runner-up in 1986, Allofs' goalscoring form eventually earned him a move to Marseille – who he helped fire to the double in 1988/89.\n27. Graeme Sharp\nEverton favourite Graeme Sharpe was the Toffees' top scorer in four seasons during the 80s, with his goals playing a major part in their First Division title triumphs of 1984/85 – when they also lifted the Cup Winners' Cup – and 1986/87.\nCapped 12 times by Scotland, Sharp memorably scooped the 1984/85 First Division Goal of the Season award for his stunning winner against Liverpool in the Merseyside derby at Anfield.\n26. Trevor Francis\nBritain's first £1m player when he moved from Birmingham City to Nottingham Forest in 1979, Trevor Francis starred in England, Italy and Scotland during the 80s.\nThe 1979/80 campaign was a particularly memorable one for Francis as he struck 17 times in all competitions to help Forest to their second successive European Cup success (and League Cup victory).\nHe later got his hands on the 1984/85 Coppa Italia with Sampdoria.\n25. Oleg Blokhin\nA superstar for Dynamo Kyiv and the Soviet Union, Oleg Blokhin's crowning achievement came when he won the 1975 Ballon d'Or – but he remained a top player well into the 80s.\nJoint top scorer in the 1985/86 Cup Winners' Cup – scoring in the final as Dynamo went all the way under legendary coach Valeriy Lobanovskyi – Blokhin retired in 1988 as the Soviet Union's most-capped player and record goalscorer.\n24. Bernard Lacombe\nOne of France's premier strikers of the early 80s, Bernard Lacombe ended his international career on a high note by helping Les Bleus to 1984 European Championship glory – forming an effective strike partnership with Bruno Bellone.\nA prolific scorer in Ligue 1 – finding the net in the competition 255 times over the course of his career – Lacombe won three French league titles and two Coupes de France with the great Bordeaux side of the 80s, hitting the 20-goal mark for them in two campaigns.\n23. Ramaz Shengelia\nNamed Soviet Footballer of the Year in 1981 – when he also came seventh in the Ballon d'Or voting – Ramaz Shengelia spearheaded the Dinimo Tbilisi side who famously won the 1980/81 Cup Winners' Cup.\nA European U21 champion with the Soviet Union in 1980, the Georgian striker scored 10 goals in 26 caps at senior level – and notched more than 150 goals for Dinamo.\n22. Edwin Vandenbergh\nA key member of Belgium's great teams of the 80s, Edwin Vandenbergh was a Euro 1980 runner-up and a 1986 World Cup semi-finalist.\nLeading goalscorer in the Belgian top flight every season between 1979/80 and 1982/83 – and later the 1985/86 campaign – Vandenbergh won back-to-back league titles with Anderlecht in the middle of the decade, as well as the 1982/83 UEFA Cup.\nHe also scored an iconic winner against reigning champions Argentina in the opening game of the 1982 World Cup.\n21. Alessandro Altobelli\nAlessandro Altobelli bagged 275 goals over the course of his career, making him one of the most prolific Italian goalscorers of all time.\nWhile he never reached the 20-goal mark in a league campaign, Altobelli was incredibly consistent and won the Serie A title and Coppa Italia in the early 80s with Inter Milan – in addition to the small matter of tasting glory with Italy at the 1982 World Cup, where he notched the Azzurri's third goal in the final against West Germany.\n20. Careca\nStill playing for Sao Paulo in his native Brazil in 1987, that summer saw Careca make a transformative move to Napoli – where he would lift the UEFA Cup within two years.\nSecond only to Golden Boot winner Gary Lineker in the 1986 World Cup scoring stakes, Careca averaged almost a goal every other game during a 64-cap career for his country – with whom he was a 1983 Copa America runner-up.\n19. Igor Belanov\nA Euro 1988 runner-up withe Soviet Union, Igor Belanov has been cited among the greatest players of all time – and he definitely deserves to be held in such high regard.\nJoint top scorer with teammate Oleg Blokhin as Dynamo Kyiv won the 1985/86 Cup Winners' Cup, Belanov's brilliance was recognised in 1986 as he received the Ballon d'Or.\n18. Preben Elkjaer\nIn 1985, Preben Elkjaer came second in the Ballon d'Or after helping Hellas Verona to their famous 1984/85 Scudetto – scoring against Juventus that season after embarking on a fine solo run minus his right boot (he found the net with that foot).\nAt international level, Elkjaer bagged 38 goals in 69 caps for Denmark to stand as one of his country's all-time leading marksmen – and he particularly excelled at the 1986 World Cup, making it into FIFA's All-Star Team.\n17. Romario\nSimply one of the most prolific scorers and natural finishers the game has ever seen, Romario moved from Vasco da Gama to PSV in 1988 – and immediately made his mark in Europe.\nNotching 26 goals in 34 appearances in all competitions, he fired his new club to the 1988/89 Dutch double – before finishing as top scorer in the 1989/90 Champions League.\nThe Brazilian icon made his international debut in 1987 and would go on to rack up 55 goals for his country.\n16. Emilio Butragueno\nSpain's go-to striker during the latter half of the 80s, Emilio Butragueno goes down as one of his nation's greatest players of all time.\nEl Buitre (The Vulture) spent the majority of his career with Real Madrid – who his goals helped to five straight La Liga titles between 1985/86 and 1989/90.\nThird in the Ballon d'Or in 1986 and 1987, Butragueno reached the Euro 1984 final with Spain (although he didn't actually score during the tournament).\n15. Hans Krankl\nAustrian icon Hans Krankl found the net 34 times in 69 caps for his country and excelled at club level with Barcelona – winning the 1980/81 Copa del Rey – and Rapid Vienna – where he won two league titles and reached the 1984/85 Cup Winners' Cup final (scoring in defeat to Everton).\nA hugely popular player in his homeland, Krankl represented Austria at the 1978 and 1982 World Cups – and later managed the national team.\n14. Fernando Gomes\nA 1986/87 European Cup winner with Porto – for whom he racked up 314 goals in 398 appearances across two spells– Fernando Gomes was a hugely dangerous poacher, featuring for Portugal at Euro 1984 and the 1986 World Cup.\nGomes won five Portuguese top-flight titles as a Porto player – three of them in the 80s – and scooped the European Golden Shoe (awarded to the top scorer in European leagues during a season) in 1983 and 1985.\n13. Gary Lineker\nGary Lineker went on to become one of the best football presenters in the business – but before his esteemed broadcaster, he was one of England's most clinical strikers ever.\nGolden Boot winner with six goals at the 1986 World Cup – despite England going out in the quarter-finals – Lineker ended the 80s by lifting the Copa del Rey and Cup Winners' Cup with Barcelona, having claimed the 1985/86 PFA Players' Player of the Year award while at Everton.\n12. Jurgen Klinsmann\nJurgen Klinsmann won all of his major honours during the 90s – but only after he had torn up the Bundesliga during the latter part of the previous decade.\nTop scorer in the German top flight with Stuttgart in 1987/88, Klinsmann made his international debut for West Germany in 1987 – before being named German Footballer of the Year in 1988, a year in which he reached the European Championship final with his country.\n11. Paolo Rossi\nUnquestionably one of Italy's finest and most popular players of all time, Paolo Rossi achieved the rare feat of winning the World Cup and Ballon d'Or in the same year in 1982.\nThat was when he top-scored with six goals as the Azzurri were crowned world champions for the third time – bagging both goals in their semi-final victory over Poland, and opening the scoring against West Germany in the final.\nAt club level, Rossi's finest hour came as he won the 1984/85 European Cup with Juventus.\n10. Jorge Valdano\nIf it wasn't for a certain Diego Maradona, Jorge Valdano might have gone down as Argentina's outstanding attacking player of the 80s.\nThe point we're trying to make is... he was a very good player. While not exactly prolific for the national team (although he was on target in their 1986 World Cup final triumph over West Germany – Valdano scored plenty of goals for Real Zaragoza and Real Madrid, winning back-to-back UEFA Cups with the latter in the middle of the decade.\n9. Hugo Sanchez\nWidely regarded as Mexico's finest ever player, Hugo Sanchez is also one of the most clinical finishers in the history of La Liga – where he finished as top scorer in every campaign from 1984/85 to 1987/88, and in 1989/90.\nAfter netting 82 goals in 152 appearances for Atletico Madrid, Sanchez crossed the Spanish capital divide to join Real Madrid in 1985 – and he only got more prolific, racking up 208 goals in 283 games for Los Blancos between then and 1992.\nOn top of all that, he has been credited with inventing the scorpion kick (fair play!).\n8. Jean-Pierre Papin\nBetween the mid-80s and mid-90s, Jean-Pierre Papin was easily one of the best centre-forwards on the planet – and he proved so for club and country alike.\nLigue 1 top scorer in 1987/88, 1988/89 and 1989/90 while at Marseille, Papin made his international debut for France in 1986 and scored twice as Les Bleus finished third at that year's World Cup.\n7. Ian Rush\nLiverpool icon Ian Rush remains one of the most free-scoring strikers ever to take to the pitch in English football, finishing as the Reds' top scorer five times during the 80s alone.\nWinner of the 1983/84 First Division Golden Boot, the moustachioed Welshman formed a superb strike partnership with Kenny Dalglish at Anfield – where he five league titles, three FA Cups and two European Cups, most of them between 1982 and 1989.\n6. Karl-Heinz Rummenigge\nWith 45 goals in 95 caps, Karl-Heinz Rummenigge goes down as one of the most free-scoring strikers West Germany ever had.\nA 1980 European champion, and a 1982 and 1986 World Cup runner-up, Bayern Munich legend Rummennigge finished as Bundesliga top scorer three times in the early 80s.\nAnd his individual brilliance was recognised in the ultimate fashion as he won the 1980 Ballon d'Or and retained it the following year.\n5. Rudi Voller\nA legend in Germany, Italy and France (but mostly Germany), Rudi Voller banged in the goals throughout the 80s to establish himself as one of the best players of his generation.\nVoller's career really took off in the 1981/82 season, when he plundered 39 goals in 39 games for second-tier 1860 Munich – earning himself a big move to Werder Bremen, for whom he struck 119 times in 174 appearances, before spells with Roma and Marseille.\nThe future Germany manager made his international debut – for West Germany – in 1982, subsequently helping them to the final of the 1986 World Cup – where he scored off the bench in defeat to Argentina.\n4. Ruud Gullit\nNamed by Pele in 2004 as one of the world's 125 greatest living footballers, Ruud Gullit was among the very best Dutch players of the 80s and early 90s.\nThe 1987 Ballon d'Or winner formed a famously lethal striker partnership with Marco van Basten which took the Netherlands all the way to Euro 1988 glory – the country's first major honour – having fired Feyenoord and PSV to Eredivisie titles earlier in the decade.\nGullit opened the scoring in the final of the aforementioned Euros, then won back-to-back European Cups with AC Milan in 1988/89 – bagging a brace in the final – and 1989/90.\n3. Kenny Dalglish\nOne of the finest British players of all time, Kenny Dalglish is widely regarded as greatest ever to pull on the iconic Liverpool shirt – and with very good reason.\nSigned from Celtic in 1977, the Scotsman – who scored 30 goals in 102 caps – went on to become King Kenny at Anfield, scoring 172 goals, setting up 167 more, and forming a fine partnership with Ian Rush up front.\nDalglish retired in 1990 having made 515 appearances for and won 14 major trophies with the Reds – 12 of them during the 80s, including two European Cups.\n2. Diego Maradona\nHad he operated as a 'main' striker, Diego Maradona would top this list – but his more regular deployment in a supporting striker role means we have him second.\nNot that we can even begin to take away from the inarguable genius of perhaps the finest player in the history of the sport – who scored surely its greatest ever goal, the Goal of the Century against England in the 1986 World Cup quarter-final (when he also got... that other goal...).\nThere will never be another player quite like the late, great Diego – who magically inspired Argentina to glory at the aforementioned World Cup, before enjoying Serie A and UEFA Cup success with Napoli before the 80s were out.\n1. Marco van Basten\nIf Diego Maradona scored the greatest goal of all time, Marco van Basten scored quite possibly the second-greatest: his jaw-dropping volley to seal Euro 1988 victory for the Netherlands against the Soviet Union (of all the stages to do that on).\nBut (unsurprisingly, given we've just named him the best striker of the 80s), Basta was so much more than that special strike: between the 1983/84 and 1986/87 seasons, he amassed a scarily prolific 140 goals in 147 games for Ajax – and later 33 for AC Milan in their European Cup-winning campaign of 1988/89.\nAn absolute monster of a centre-forward, it's no wonder he won the Ballon d'Or three times – with his first two triumphs coming back-to-back in 1988 and 1989.\nTom Hancock started freelancing for FourFourTwo in April 2019 and has also written for the Premier League and Opta Analyst, among others. He supports Wycombe Wanderers and has a soft spot for Wealdstone. A self-confessed statto, he has been known to watch football with a spreadsheet (or several) open...",
  "word_count": 2966,
  "scraped_at": "2026-02-14T02:07:27.057258",
  "_text_extracted": true
}