{
  "article_id": "bcb5672c4c4c",
  "url": "https://dailyexpress.com.my/news/216108/postecoglou-will-tell-kane-his-spurs-vision/",
  "title": "Postecoglou will tell Kane his Spurs vision",
  "date": "20230712T071500Z",
  "domain": "dailyexpress.com.my",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LONDON: Tottenham’s new manager Ange Postecoglou said on Monday he will meet with Harry Kane this week to outline his vision for the club after being given no assurances over the England striker’s future amid interest from Bayern Munich.\nBayern have reportedly had a £60 million ($76 million) bid for Kane rebuffed by Tottenham, with the German champions believed to be set to return with an improved offer.\nKane will start pre-season training on Wednesday and former Celtic boss Postecoglou is keen to lay out his plans to Tottenham’s record goalscorer.\nGrilled on the Kane situation when he held his first press conference since being hired in June, Postecoglou said: “I haven’t had any assurances and I wouldn’t expect any assurances.\nKane\n“That’s just my nature. What I know right now is that Harry is part of this squad and he’s looking forward to coming back to training and starting to work together.”\nKane has just one year left on his Tottenham contract, increasing the urgency to resolve his future before the north Londoners’ potentially lose him for free when his deal expires.\nThe 29-year-old, also linked with Manchester United and Chelsea, is reportedly keen to leave after failing in his attempt to engineer a move to Manchester City two years ago.\nPostecoglou, the first Australian to manage in the Premier League, would clearly prefer to keep Kane.\nHis attempt to win over the England captain will start this week before the squad jet out to Australia, Thailand and Singapore for their pre-season tour.\n“My conversation with him will be about how we can make this club successful and I’ve got no doubts that’s what he wants as well,” he said.\n“It’s not going to be a conversation where we walk out of the room and have an understanding. I don’t want that kind of conversation.\n“What I want is to introduce myself to Harry and give him my vision of the football club and get a sense from him on what he thinks the club needs to do to be successful and walk out on that training pitch and try to make it happen.”\nKane netted 30 times in the league last season despite Tottenham’s struggles in their eighth place finish, giving him 280 goals in total.\nBut he is yet to win a major trophy with the club and will miss out on Champions League action next season if he stays with Tottenham.\nInsisting Kane would not get special treatment regardless of his iconic status and the uncertainty over his future, Postecoglou said: “I don’t think it’s my role to sit down and treat people in a manner because of their circumstances.\n“I’m really big on treating everyone the same and Harry has already entrenched himself in the history of this football club.\n“He’s one of the premier strikers in the world and I want him involved.”\nAfter the dour football played by Postecoglou’s Tottenham predecessor Antonio Conte, the 57-year-old said he aims to produce a more entertaining style in keeping with the club’s purist principles.\n“We want to be an aggressive team, a dominant team, a team who takes the game to every opposition home and away,” he said.\n“For me the history of this football club kind of suggests that is the best fit for it.”\nAlthough some Tottenham fans have been underwhelmed by Postecoglou’s appointment, who was a treble winner with Celtic last season, is adamant he can win over the doubters.\n“I am the kind of guy who loves a challenge. I love a rebuild. That is where I feel I am at my best,” he said.\n“Now my goal is to try and make some special moments here and create something special for this great football club.”",
  "word_count": 624,
  "scraped_at": "2026-02-14T02:24:50.289772",
  "_text_extracted": true
}