{
  "article_id": "bccc86187147",
  "url": "https://www.boredpanda.com/bayern-celtic-champions-league/?cexp_id=117789&cexp_var=14&_f=homepage_featured",
  "title": "Heartbreak for Celtic As Davie Late Goal Clinches Champions League Win For Bayern",
  "date": "20250219T201500Z",
  "domain": "boredpanda.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "You know, this already happened a quarter of a century ago. The Champions League, the last minutes of the match—Bayern on the pitch, the score 1:0, and a guy named Schmeichel in the opposite goal. And then, a completely ridiculous saving goal in the final seconds of the game. Only one difference—back then, Bayern lost…\nCeltic was a huge underdog in the playoff clash against the six-time winners of the Champions League, but the furious Scots did everything to ensure that this duel would be remembered for a long time. The German club went further, but the guys from Glasgow are absolutely beyond reproach. In the end, they lacked just a few dozen seconds before forcing extra time in Munich.\nCeltic was the huge underdog before their standoff against Bayern in the Champions League playoffs—but it turned into a real drama\nImage credits: Hasan Bratic / SIPA\nAfter the 2:1 home loss, nearly no one believed in Brendan Rodgers and his guys in Munich, but the skeptics were ashamed\nYes, Vincent Kompany’s team has slowed down a bit since 2025 and no longer looks like the juggernaut that was sweeping everything in its path in autumn in the Bundesliga, but Celtic’s chances were still considered very low. But even the first match in Glasgow—lost by Rodgers and company with a score of 1:2—left chances and hope.\nEven though Celtic have never won in Munich—the Scots have played Bayern here twice and both times, in 2003 and 2017, they lost: 1:2 and 0:3, respectively. But in the end, football history teaches us that when you have someone named Schmeichel in goal—whether it’s Peter or Kasper—you should be prepared for miracles.\nImage credits: Celtic FC / YouTube\nThe author of the Celtic goal was Nicolas Kühn, who spent two years in Bayern with desperate yet fruitless attempts to make it there\nThis match is a wonderful interweaving of different stories. For example, Nicolas Kühn, who, a few years ago, tried unsuccessfully to break into the Bayern reserves. But then, finding himself in the right place at the right time, he avoided a desperate tackle from Kim Min-Jae and dealt with Manuel Neuer in cold blood, scoring and silencing the stands.\nOr Harry Kane, whose participation was in question after an injury in the last Bundesliga match—but the England captain came on, only to get another injury in the first half. And now, it’s far from certain whether the best scorer of the German league will be able to take the field this weekend.\nImage credits: Jannik / Unsplash (not the actual photo)\nFor example, Kasper Schmeichel, who recently admitted that a couple of years ago, when Bayern lost to Manuel Neuer due to severe injury, he almost moved to Munich. But the transfer fell through at the last second, when the Dane was already on his way to the airport. And perhaps, he also held a grudge against them.\nAnd don’t be misled by the final statistics of the match. The Germans surpassed their opponents in ball possession more than twice, with shots on goal of 23-5, and 6-4 in scoring chances. There were just as many situations in which Celtic could have scored a second goal. But the game was rapidly approaching the extra time, and the ghost of Milan’s recent failure was looming over the Allianz Arena more and more…\nImage credits: George Zografidis / Pexels (not the actual photo)\nAlphonso Davies came off the bench and saved Bayern with an incredibly ugly, yet full-fledged last-minute goal\nAnd then there was Alphonso Davies’ goal, ugly but necessary. A few years ago, the Canadian was considered probably the best left-back in the world, but this season he has played only a little over a dozen and a half matches for Bayern. Injuries, a ‘soap opera’ with a contract extension, and inevitable rumors about Real Madrid—even in the game against Celtic, Raphael Guerreiro started in his position.\nBut then Bayern went into a final, drawn-out attack. Leon Goretzka jumped out to the center forward position (he had often done this before, but after Kompany’s arrival, he almost stopped making these shifts), and Schmeichel blocked the ball sent almost point-blank—but the Canadian’s speed made the difference.\nThen, he was five yards behind Cameron Carter-Vickers, who was about to kick the ball out of bounds—and he was close to him, so the kick turned into a ricochet off Davies’s leg and straight into the net! Bayern are in the round of 16, for a record 17th time in a row—and Celtic are going home, but no one will dare utter a single reproach against Brendan Rodgers and his wild, selfless, and likeable gang.\nThe opinions of the commenters on X, by the way, are very divided. Some really admire Celtic’s performance, and believe that they deserved to win with their courage and truly heroic play—not parking the bus in front of the goal, but bravely looking for chances in the opponent’s half.\nOthers, quite reasonably, note that the result is on the scoreboard, and all the emotions will be forgotten in a couple of days. However, it cannot be ruled out that these latter responders might just be Rangers fans…And what do you, our dear readers, think about this duel? Please feel free to express your opinions in the comments below.\nMost commenters on social media simply gave Celtic a shoutout for their heroic performance, though some folks noted that the scoreboard tells it all\nImage credits: darren5534\nImage credits: sadhia_a1\nImage credits: JamieMurphy0716\nImage credits: AshyMagnificent\nImage credits: martinferera\nImage credits: Goose1167\nImage credits: Kasitif\nImage credits: Gypeitcheil\nImage credits: StevenGilluley\nImage credits: DenzelTrotter\nImage credits: tim_declan\nImage credits: bornacelt\nCome on BP!first s****y celeb, now boring sports? This is not a site for sports.. at least make it possible to opt out from boring content! And you want us to pay for premium? 😸🙈\nAt this point they're just throwing anything out there and hoping something sticks.\nLoad More Replies...Come on BP!first s****y celeb, now boring sports? This is not a site for sports.. at least make it possible to opt out from boring content! And you want us to pay for premium? 😸🙈\nAt this point they're just throwing anything out there and hoping something sticks.\nLoad More Replies...",
  "word_count": 1048,
  "scraped_at": "2026-02-14T01:52:15.334969",
  "_text_extracted": true
}