{
  "article_id": "bcda0c8914ef",
  "url": "https://menafn.com/1108227084/Arne-Slot-Says-He-Will-Succeed-Jurgen-Klopp-As-Liverpool-Manager",
  "title": "Arne Slot Says He Will Succeed Jurgen Klopp As Liverpool Manager",
  "date": "20240517T191500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot Says He Will Succeed Jurgen Klopp As Liverpool Manager\nThe decision was finalized after Liverpool agreed to a compensation deal worth up to £9.4 million with Feyenoord, where Slot is currently holding charge.\nSlot, speaking at a press conference on Friday, expressed mixed emotions about his impending departure from Feyenoord. \"I can confirm that I will become the trainer there next year,\" Slot stated.\nHe acknowledged the growing sentimentality as he approached his final match.“Until now I was not thinking about this being the buildup to my last match, but that starts coming now. At the beginning of the week, you are thinking about training and those kind of things. But the feeling gets stronger now. That is why I'm a little bit late now [for the press conference] because I wanted to say goodbye to some people personally and take time for them, more than just shaking hands.\n“So yeah, the feeling grows. I understand that good results help, but it is very nice to feel that people really are thinking it's a pity that I'm leaving.\nHowever, Liverpool have not commented on the announcement.\nFeyenoord, via social media 'X', confirmed the 45-year-old's departure: \"The Arne Slot era is coming to an end. Let's enjoy the last moments.\"\nSlot's final game in charge will be Sunday's Eredivisie home match against Excelsior, marking the end of his successful three-year tenure. Klopp's last match with Liverpool will coincide with Slot's farewell, as the Reds take on the Wolves at Anfield.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 307,
  "scraped_at": "2026-02-14T02:25:33.987853",
  "_text_extracted": true
}