{
  "article_id": "bcee719a095a",
  "url": "https://www.teamtalk.com/tottenham-hotspur/postecoglou-beaming-midfielder-tipped-join-tottenham-domiantes-liverpool-shock-anfield-result",
  "title": "Postecoglou beaming as £30m midfielder tipped to join Tottenham dominates Liverpool in shock Anfield result",
  "date": "20240412T093000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nPostecoglou beaming as £30m midfielder tipped to join Tottenham dominates Liverpool in shock Anfield result\nTottenham could land one of the hottest midfielders in Europan football judging by the display of Atalanta star Ederson in Thursday night’s Europa League quarter-final romp for Atalanta at Liverpool.\nAnge Postecoglou’s first season in charge in north London has gone well so far, with Spurs currently in a strong position to qualify for the Champions League next season.\nHowever, there are still two glaring holes that will almost certainly be filled this summer, the addition of a dominant midfielder and a central striker.\nAnd Tottenham scouts will have been hugely impressed after top target Ederson delivered an outstanding performance as the Serie A side stunned Anfield with a well-deserved 3-0 triumph.\nDON’T MISS: Tottenham striker search: Dream signing, realistic options and perfect Postecoglou projects all assessed\nEderson has been heavily linked with a move to north London this summer, with Calciomercato recently suggesting that Atalanta are requesting a fee of £30million for the midfield talent.\n“Ederson’s a name who’s been in discussion at Tottenham,” Sky Sports journalist Michael Bridge recently told GiveMeSport.\n“I think it’s an area where Spurs will consider adding a genuine No. 6.”\nMeanwhile, a different GiveMeSport report claimed Tottenham are ‘totally convinced’ that the Brazilian talent is a perfect fit for Postecoglou’s style of football.\nAny doubts over that claim would have been completely dispelled on Thursday evening, given how he dominated the Liverpool midfield.\nAtalanta were rampant against the Reds as they handed them their first home defeat in 14 months to leave Jurgen Klopp seething.\nEurosport.it were certainly impressed with the Tottenham target Ederson as they gave their post-match ratings article, where he got a 7.5 score.\n“We actually wonder how many Edersons are playing this evening at Anfield, given that the Brazilian is literally everywhere on the pitch,” they wrote.\n“Perfect performance, without any flaw and indeed useful to remedy some uncertainty of his teammates.”\nEderson could be value midfield addition\nMeanwhile, Italian publication Il Giornale gave Ederson a 7 out of 10 and wrote: “Substance and temperament to spare.\n“You find him everywhere, but he sings and carries the cross with his back always straight. A fundamental player to have balance.”\nThe only problem for Tottenham now is that price tag may well have increased after Ederson’s performance on Merseyside.\nPostecoglou is looking at bringing in a new defensive midfielder due to the inconsistency of Yves Bissouma this season and his inability to dominate games against teams that player a lower block.\nREAD MORE: Tottenham to raid Bayer Leverkusen for Xabi Alonso favourite as Postecoglou priority becomes clear\nPierre-Emile Hojbjerg is also expected to move on this summer after failing to convince Postecoglou that he is worthy of a regular starting spot.\nSpurs are back in action on Saturday lunctime when they face a tough trip to Newcastle in the Premier League.\nA win at St James’ Park will consolidate their Champions League push, given that main rival Aston Villa head to current leaders Arsenal on Sunday.",
  "word_count": 517,
  "scraped_at": "2026-02-14T01:48:46.197292",
  "_text_extracted": true
}