{
  "article_id": "bd011aa4a706",
  "url": "https://www.managingmadrid.com/2024/3/30/24116438/ancelotti-we-will-see-if-militao-is-able-to-play-vs-manchester-city-maybe-yes-maybe-no",
  "title": "Ancelotti :  We will see if Militao is able to play vs Manchester City , maybe yes , maybe no  ",
  "date": "20240330T144500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After an international break that seemed to last forever, Carlo Ancelotti finally sat in a press conference ahead of Real Madrid’s game vs Athletic Club. He was asked, mainly, about Eder Militão and his potential return, to which he said: “Maybe not, maybe yes. I’m not saying it’s 50%, it could be 70% no and 30% yes. We have to see it game by game. It may be that tomorrow he will be given minutes and we have time until the 9th April to improve his condition. The knee is fine, all he needs is football, getting used to playing on a big field again and with his teammates. He has recovered very well.”\nAncelotti: “We will see if Militao is able to play vs Manchester City, maybe yes, maybe no”\nAncelotti on how the team is feeling\n“The equipment is good. The internationals have recovered well. We had a small problem with Camavinga, but today he trained normally. We have good feelings for tomorrow’s game. We play against a team that is having a great season and plays with great intensity. It has individual and organizational quality. An important match that we come to with all the confidence in the world. Militao returns tomorrow, which is the most important news. He is not 100%, because he needs to play football, but he is fine from the injury. It is very good news for us. We have been unlucky with Courtois’ injury, but he will be back soon.”\nAncelotti on injuries in defense\nWhat happened to us has been something strange. I think we have held up well. They have all complied. Rüdiger first, with a fantastic season. Nacho too, he has contributed a lot to the defense. Also the times that Tchouameni has played he has given a lot of performance there. We are the team with the least goals scored in the League. That’s because the collective work has been very good.\nAncelotti on Lunin’s improvement this season\n“He has improved a lot, because he has had the opportunity to demonstrate his quality by playing. His performance has been very good. He is a goalkeeper who has quality.”\nWould Athletic Club be distracted because of the CdR final next week?\n“Athletic has a week to prepare for the final and I think that tomorrow they will play at their best. They are playing for the Champions League spots, which is very important. We don’t think they are thinking about playing in the final, but about coming to the Bernabéu to try to score.”\nWho plays if there’s no Militao?\n“If he is not there, there are not many options. If he is ruled out, will Nacho or Tchouameni play? The doubt is there.”\nAncelotti on whether fans would be excited about Mbappe\n“I believe that the fans are excited about Real Madrid, regardless of the players. I think Madrid fans are excited about the Real Madrid shirt.”\nIf Vini will be affected by the noise\n“There is one thing that worries me a lot about Vinicius and that is that he cannot play tomorrow. That’s what worries me.”\nAncelotti on Luka Modric\n“The feeling I have is that I see Modric very well, ready to fight till the end of the season. We plan to finish the season well. This month is very important and we are in an optimal position to get the best out of ourselves.”\nAnything about his renewal?\n“Everyone is talking about next season... except us. Luka is playing this season. The future of the individual and the club, we are going to make the decisions when the season ends because we have time to do so. I don’t think anyone is interested now in talking about his future.”\nAncelotti on Spain-Brazil, Vinicius’ press conference\n“I saw the match. I liked it, it was an entertaining, nice match... Friendly, but very competitive. I liked it and enjoyed it. For Vinicius it is a very important issue that he takes very seriously. This is what we all have to do, take this issue very seriously.”",
  "word_count": 680,
  "scraped_at": "2026-02-14T02:25:26.772565",
  "_text_extracted": true
}