{
  "article_id": "bd03eb2c94e2",
  "url": "https://thepeoplesperson.com/2025/04/16/ex-man-united-and-olympique-lyonnais-man-rafael-says-the-english-giants-are-favourites-to-win-the-tie-293019/",
  "title": "Ex - Man United and Olympique Lyonnais man Rafael says the English giants are  favourites  to win the tie - Man United News And Transfer News",
  "date": "20250417T004500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United and Olympique Lyonnais defender Rafael has insisted that the Premier League club are the favourites to win their Europa League quarter-final tie.\nUnited are set to host Lyon on Thursday in the return leg following last week’s 2-2 draw at the Groupama Stadium.\nThe Red Devils have endured a wretched Premier League season that currently has them in 14th place in the Premier League table with just 38 points gained and six matches left to play.\nThe club’s top-flight campaign is a write-off at this point, with full focus on the Europa League, which not only represents a chance to win silverware but also to qualify for the Champions League.\nIn his press conference ahead of the clash with Lyon, Ruben Amorim stressed the significant impact Champions League qualification would have on United’s summer transfer plans. He noted that not only would the financial boost be crucial, but competing in Europe’s elite tournament would also make it much easier to attract top talent.\nThe stakes couldn’t be higher for United and Rafael, who lined up for both sides before he called time on his professional career, has weighed in on the situation.\nAccording to Rafael, Lyon have the tools to hurt the Red Devils but considering the fact that Amorim’s men are at home, he fancies their chances of going through.\nThe 34-year-old told L’Equipe [via Get French Football News], “With the ball, I think Lyon has a better team than United.”\n“They’re more technical, more intelligent. But the match takes place at Old Trafford, and United are the favourites.”\nLyon have been dealt a huge injury boost, with Malick Fofana included in the Ligue 1 outfit’s travelling squad.\nThe tricky forward missed the first leg due to an injury but is now available to Paul Fonseca for selection. Fofana has struck 10 goals this season.\nUnited vs. Lyon kicks off at 20:00 BST.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 322,
  "scraped_at": "2026-02-14T02:02:35.576290",
  "_text_extracted": true
}