{
  "article_id": "bd1470e5fcd5",
  "url": "https://theanalyst.com/na/2023/01/analysing-europes-top-womens-leagues-opta/",
  "title": "Analysing Europe Top Women Leagues",
  "date": "20230110T100000Z",
  "domain": "theanalyst.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We’ve waved goodbye to 2022 and welcomed 2023 with a fresh start. Domestic leagues across Europe, well for large parts, have reached the midway point. The 2022-23 season is entering its second and final phase as we all gear up for the return of footballing action across the women’s game.\nThere have been multiple interesting storylines throughout the season from AS Roma’s continuous rise in the domestic and European circuit to Potsdam fading away into obscurity. There’s variance and substance behind every team’s performance so far in the season. There have been storylines for individual players too, from Pajor powering Wolfsburg to Alba Redondo cementing her case for Spain’s striker position.\nThere’s been chaos, vibes and everything in between, and it’s not over yet.\nTeam Talk\nIn a game of football, generally, one team has a lion’s share of the possession. Some teams make it part of their identity to play a certain way, such as Barcelona Femeni. Some teams like to work the ball up the field with slow and intricate passing while some choose the shortest path between the two goals aka the direct route.\nUnderstanding how a team likes to use the ball and progress higher up the field could help us gauge the team better. Using Opta’s passes per sequence and direct speed upfield metrics could help in doing exactly that.\nIt is to nobody’s surprise that most of the “big clubs” across Europe’s major leagues have adopted a possession-based style and try to patiently work the ball in order to assert control over proceedings. Barcelona, PSG, Bayern Munich alongside WSL’s top four (Man City, Chelsea, Arsenal and Man Utd) all average a higher number of passes per sequence while having the lowest direct speed upfield compared to their peers.\nEverton, a team aiming to have a seat at the big-team table, are trying to adopt a similar playstyle. Their recruitment is geared with this idea but they have struggled to assert themselves in games in order to dominate proceedings.\nThere are teams who like to get upfield as quickly as possible. It could be a stylistic choice as is the case with AC Milan, who have recorded the fourth most direct attacks in Serie A so far (17) and have the second fastest direct speed upfield (1.83 m/s) or it could be driven as a mechanism to limit damage when playing against sides of higher technical quality.\nAnd then there are teams which adopt the best of both worlds and are flexible depending on the needs of the game. Wolfsburg and Roma are teams that are capable of doing the slow and patient build-up while also being capable of hurting teams on the break. Both the teams rank among the top 2 sides in their respective leagues for both build-up and direct attacks.\nLet’s look at some of these teams in a little more detail.\nRoma’s Rise and Juventus’ Dwindling Power\nAS Roma’s continued rise since their inception in the Serie A has been a story to follow. The club has already won two trophies (Coppa Italia and Supercoppa Italia) in Italy after acquiring the Serie A license of Res Roma in 2018. Their performances in the UWCL this season have grabbed the attention of fans around the globe and this season they have their sights on the big one, the Serie A title.\nLe Giallorosse have recorded the highest xG in the league (17.7). With Valentina Giacinti leading the line and having attacking support from Annamaria Serturini, Emile Haavi and others, Roma have been a very shot-happy team. Their tally of 225 shots in the league is 55 more than any other team in the women’s Serie A.\nIt’s not just their attacking numbers that have looked good, but their defensive metrics have been a major part of their success as well. With just 4.04 open-play xG conceded so far, which is in line with their four goals conceded, they have one of the best defensive records across Europe. They are also one of the most intense pressing sides across Europe, with a PPDA of 7.8) and manage to create many turnovers high up the pitch allowing them to catch teams in a disorganized state and generate shots from it. Their tally of 46 shots from high turnovers are the highest in the Serie A.\nAn understated aspect of their season so far has been the squad composition and minutes distribution while juggling multiple competitions. The squad is full of players that are in the peak years of their career and Alessandro Spugna has done a brilliant job of utilizing his squad. A total of 16 players have played more than 40% of the available league minutes so far.\nWhile Roma is on an upward trajectory, things have taken a downward turn for the giants in Turin. Juventus’s underlying metrics have declined as compared to last season. Their npxG per 90 of 1.88 is lower from 2.07 from the previous season. Their defensive numbers have gotten worse as well, their non-penalty xGA per 90 of 0.88 in the 2022-23 season is higher than 0.67 from the 2021-22 season.\nWith the second highest average age among all teams in the Serie A this season, there might be a change around the corner in Italy.\nDamn, Potsdam!\nTurbine Potsdam is a team with a rich history, having been home to multiple superstar players before the modern stars reached their stardom status. The likes of Ada Hergerberg, Svenja Huth, Sarah Zadrazil and Lia Walti all have played for Potsdam before moving on to different clubs.\nBut things are not so shiny now.\nAfter narrowly missing out on UEFA Women’s Champions League spots in the 2021-22 season, Potsdam are currently at the bottom of the table with only one point on board from 10 games. They have managed just five goals while conceding 28 in that timeframe and have the worst goal differential in the league.\nLast season’s downturn could be attributed to the long-term injury to star striker, Selina Cerci. This season, however, Potsdam are a depleted side. They have conceded the highest xG from open-play in the league (17.5) and second highest xG from set-pieces (4.4) this season. Things are bleak in attack as well. They have managed to record just 48 shots in the league so far, accumulating the second lowest xG from open-play in the league (4.1) while underperforming on that as well.\nRelegation looms on the horizon for a once giant club.\nSurprise Packages\nThere have also been teams who are punching above their weights and are doing so in their own style. They have caught the eye, producing some positive results along the way so far and maintaining a good position on the table.\nLiverpool’s Throw-Ins\nLiverpool’s promotion to the WSL was one of the stories to look forward to in the 2022-23 season. Their opening day win against defending champions Chelsea made an even bigger statement. While both the goals in their 2-1 win came from the penalty spot, there was an interesting thing to note in the sequence leading up to the goals.\nThe first penalty was earned following the chaos caused by a long throw-in into the Chelsea box. With Megan Campbell in their squad, Liverpool brought long throw-ins back in fashion. They have looked to create good chances from set-play and are capable of bamboozling their opponents with a long throw into the box.\nTheir 2.9 xG from set-pieces is only behind Arsenal and Chelsea in the WSL this season. Although this hasn’t directly resulted in a goal so far, having the ability to create something out of nothing can help them land a decisive blow in terms of the result.\nFiorentina and Fleury’s Approach\nFiorentina and Fleury currently sit in third and fifth position in their respective leagues, which in Fiorentina’s case is a big uptick from their seventh-place finish last season. Both of these teams have adopted a different approach to punch above their weights.\nWhile teams focus a lot on possession, it’s not the only way teams can experience success. Some teams are comfortable in conceding possession and maintaining a defensively solid shape while remaining capable of hurting teams on the break and being efficient in doing so.\nIn France, Fleury has been doing stuff along these lines. They have recorded the second most number of shots in the French league (140) accumulating the fourth highest xG in the league (9.9) only behind Lyon, PSG and Paris FC and they are doing so while recording 46.5% average possession so far in the season.\nWe can use our zones of control viz to understand what areas of the pitch they concede ‘control’ in to better understand their approach. Les Essonniennes are comfortable in conceding the ball and maintaining defensive solidity, while remaining capable of stitching up quick attacks after regaining possession high up the pitch.\nThey have recorded 17 direct attacks in the D1 Arkema so far, which is second highest in the league. Their 4.9 xG conceded is the third lowest figure in the league so far. Their ability to generate high turnovers is a big asset that makes them a threat.\nFleury have regained possession within 40m of the opposition goal 154 times so far, which is fourth best in the league. They are very effective from these situations as well, generating 21 shots while scoring three goals (most in the league).\nIn Italy, Fiorentina has found success doing so. Their approach to generate quick breaks in behind and be clinical in putting them away has been a story of their season. Their underlying numbers are in line with their position on the table. Their 22 direct attacks are the third highest behind Roma and Inter Milan and their direct upfield speed of 1.7 m/s is also the third fastest in the league.\nTheir attack is largely shouldered by the duo of veteran Spanish star, Vero Bouquete and 25-year-old Hungarian striker, Zsanett Kaján. The pairing are at the heart of everything Fiorentina do in attack. Vero is capable of pulling the strings from an attacking midfield position and Kajan does well to provide a presence in the attacking third while being capable of creating chances too. The Hungarian striker has scored three non-penalty goals and assisted another three, leading the chart in both departments.\nLevante Lighting Up the Liga F\nLevante have arguably been the second best side in Spain (only the second place is up for grabs with Barcelona in the league) not only in terms of league position, but also raw numbers and underlying metrics.\nTheir goal tally (42), non-penalty xG (30.3) and total shot volume (233), all put them firmly behind just Barcelona in Spain in terms of raw volume and per 90 data. Their expected goal differential of 18.7 is second to Barcelona again.\nJ.L. Sanchez Vera’s 4-3-1-2 with Natasa Andonova playing at the tip of the midfield and doing the selfless work to aid the exploits of Alba Redondo and Mayra Ramirez has been extremely successful. The Redondo-Ramirez duo has been incisive in the way they attack the channels and Vera has provided a platform to maximize that.\nRedondo has scored 13 goals so far this season while assisting another five, leading the charts for both at Levante. The trio of Andonova, Ramirez and Redondo have scored 25 of Levante’s 42 goals between them.\nTheir exploits while having one of the youngest squads in the league and not much depth from the bench is worth pointing out going into the second half of the season.\nPlayer Power\nTeam playing styles are one aspect of the game, the execution of an idea and play-style is dependent on the players comprising the team. It’s worthwhile and interesting to look at the top performing players through the lens of various playstyle metrics like goalscoring, chance creation and ball progression.\nGoalscoring\nScoring goals is integral to a team’s chances of being able to win games and goalscorers are arguably the most talked about players on a football team. They get all the hype and for large parts it’s deserved as well.\nBy looking at the goalscoring aspect of the game we highlight some of the best performing players of the season so far in this section.\nIn WSL, Man City’s Khadija Shaw has managed to lead the charge for City and show her true powers in the process. The Jamaican striker is currently the joint-top goalscorer in the WSL with eight goals and has the highest direct shot-involvement in the league (34). It’s not just her goalscoring with which she adds value, her powerful line-breaking carries and physically robust nature while performing the action makes her a threat from various situations.\nAlba Redondo has made a very strong case for the striker position in the Spanish national side. She is posting a healthy shot-volume of 5.06 shots per 90 and has the highest direct shot involvement in the league (96) while her team-mate and partner in crime, Mayra Ramirez, is not far behind on (61). The timing of her runs and initial acceleration make her an incredible threat in behind,\nInter Milan’s Tabitha Chawinga has taken the Serie A by storm. Her tally of nine goals and four assists are the highest in Serie A and means she has played a direct hand in 13 of Inter’s 28 goals this season. Her excellent threat in behind is one of her key strengths.\nIn France, PSG’s Kadidiatou Diani and Paris FC’s Mathilde Bourdieu have been ruling the league. Both players rank inside the top three for their shot-volume and their open-play chance creation rate, underlining their ability to score and create for their teams. Diani has shouldered the offensive burden for PSG, filling in the striker position. Bourdieu has been averaging more than a goal per 90 so far in the season and has been a key figure for Paris FC’s campaign so far.\nFollowing two injury laden seasons, Ewa Pajor’s brilliance was at the risk of getting lost in time, but she has taken care of that this season and in some blistering fashion.\nPajor has been other-worldly good this season. Her numbers are above and beyond any other player across all major European leagues. Her 15 goals in 14 league and Champions League games so far are the best return of any player within the top five women’s leagues across Europe in 2022-23.\nThe 25-year-old striker is averaging a ridiculous 7.2 shots per 90 while also generating 1.6 chances from open-play for her teammates, highest average direct attacking contribution across Europe.\nPajor’s shotmap suggests a strong presence and also highlights how she is able to get shots from very good areas. Her speed, timing of the runs and ability to play quick lay-offs allow her to get in behind quickly and produce some very good combination play around the midfield area as well. She drifts out wide to provide parity and help create chances for her team.\nBall-Playing Defenders\nThe ability to progress the ball from the defence has increasingly become a desirable trait among defenders. They are tasked with providing the foundation for a team’s build-up alongside being defensively astute.\nWhile the numbers here are often biased towards high possession sides, it’s worth looking at players who are key in helping their team play out from the back. Lyon’s Wendie Renard, Barcelona’s Mapi Leon and Man City’s Alex Greenwood have all been key parts of their side’s build-up play. All three of these players are blessed with exquisite range in their distribution making them capable of launching a direct attack from their own third.\nEverton’s Katrine Veje and Roma’s Elena Linari are two other players whose qualities on the ball are real standouts for their teams. Veje has recorded the most number of 10+ meter long carries (54) and ranks second for progressive carries (96) in the WSL this season.\nReal Sociedad’s defensive trio of Manuela Vanegas, Alejandra Bernabe and Ana Tejada all show up well in their ability to move the ball upfield. The trio fill up three of the top four spots for most progressive carries in the league while Vanegas also ranks in the top six for progressive passes in Spain with 62.\nWhile the veterans and usual suspects show up well on the scatter plot, it is worth highlighting the hidden gems and the young guns who will best fit the billing in the near future.\nManchester City’s summer recruit Laia Aleixandri has been able to impose her quality on the ball for City. The Manchester Blues are a side geared towards slow and patient build-up and Laia’s qualities on the ball perfectly align with that philosophy. She is equally adept at carrying and passing the ball from defence. Her 49 progressive passes and 81 progressive carries this season ranks her second and fourth in the respective categories across the league.\nBayern Munich and Iceland’s Glódís Viggósdóttir has been solid overall for the Bavarians at the heart of the defence, covering space and helping bring the ball out of defence with her carries and passing alike. Viggosdottir is integral to Bayern’s buildup, no other player in the Bundesliga has the more open-play build up involvements than the Icelandic defender (575).\nHer eight goal build up involvements are only second to team-mate Georgia Stanway (nine) is another testament to her heavy involvement in the buildup phases for Bayern. She is extremely proficient with her carries as well. No player has recorded more progressive carries than the 27-year-old (145) and her carries are always geared towards moving the ball upfield.\nSummer signing, Maya Le Tissier, has quickly become a key part of United this season. The young centre-back possesses one of the most well rounded skill sets both on and off the ball. She is excellent at bringing the ball out from defence with her carries. No player has recorded more progressive carries than the English defender (101). She also leads the chart for 5-10 metre progressive carries in the WSL.\nDribbling Queens\nWe have looked at the metrics concerning attack and defence but everybody likes a player capable of producing moments of genuine technical excellence, demonstrating close control and skills on the ball. They can grab attention and adoration of fans and embarrass defenders while producing moments of genuine quality.\nThese players might not always be ‘effective’, but they all got that ‘dawg’ in them.\nBenedetta Glionna has been an asset for Roma this season with her carries. Her ability to not just progress the ball but also take-on and create chances with it in the final third. She is averaging the highest number of ball carries with a take-on across Europe’s major leagues while also leading the charts for carries ending with a chance created (nine) in Serie A this season, despite playing 520 minutes.\nElena Julve is the type of player that will always have you at the edge of your seat and watch her with your eyes glued to the screen. She has recorded the highest number of carries with a take-on (42) in the Spanish league so far while also recording the fifth most progressive carries (93) in the league. She is a livewire on the ball despite lacking the final product in most cases.\nMayra Ramirez has been a pillar for Levante this season. The Colombian international has recorded the second highest number of carries with take-ons in the league so far this season (35). Her balance and close control on the ball along with her lower centre of gravity makes it very difficult to dispossess her while carrying.\nBayern Munich and Germany’s Klara Buhl has been one of the most impactful young players in the world. She is capable of wreaking havoc with her pace and explosiveness to dismark herself and then generate shooting opportunities or create chances for her team-mates.\nThe break is over and 2022-23 is halfway done. We are now entering the business end of the season; the part where teams chase glory and try to avoid relegation. Teams will be looking forward to unwrapping their Christmas presents in the hopes of an improved second phase of the season.\nWe’ve looked at the story so far but what are some storylines to follow in the second half of the season?\n- Can Arsenal maintain the top position despite losing Vivianne Miedema and Beth Mead to season long injuries?\n- Will United be able to finally disrupt the top 3 monopoly?\n- Will Wolfsburg continue their flawless run?\n- Can AS Roma take another step forward and dethrone Juventus in Italy?\n- Can PSG go all the way despite not having a recognized striker up front?\nWe’ll be keeping you up to date with the key data stories through the remainder of the season. Buckle up and enjoy the ride.\nEnjoy this? Subscribe to our newsletter to receive exclusive content.",
  "word_count": 3480,
  "scraped_at": "2026-02-14T02:29:04.531679",
  "_text_extracted": true
}