{
  "article_id": "bd172f25ce25",
  "url": "https://www.teamtalk.com/arsenal/gunners-transfer-gets-here-we-go-confirmation-leave-champions-league-club-stunned",
  "title": "Arsenal transfer gets  here we go  confirmation to leave Champions League club stunned",
  "date": "20230901T171500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal transfer gets ‘here we go’ confirmation to leave Champions League club stunned\nA team who Arsenal will face in the group stage of this season’s Champions League have been overlooked, with Crystal Palace instead emerging as the surprise transfer victors, according to multiple sources.\nThe future of Rob Holding always looked like it would lay away from the Emirates by the time tonight’s 11pm deadline rolled around.\nThe 27-year-old has not been included in Arsenal’s three matchday squads in the Premier League this season.\nFrom within the Premier League, Luton Town, Crystal Palace and Wolves all showed interest. From further afield, Spanish sides Sevilla and Mallorca made enquiries.\nThe Athletic reported the race had boiled down to Palace and Sevilla, with the latter holding the obvious advantage of the promise of Champions League football.\nArsenal were drawn in Sevilla’s group on Thursday and the possibility of facing the Gunners loomed large.\nHowever, according to Fabrizio Romano and the Athletic, Holding has opted against joining Sevilla in favour of signing with Crystal Palace.\nRomano tweeted it’s ‘deal done’ on a permanent £4m move before giving the switch his signature ‘here we go’ confirmation.\nThe Athletic stated a three-year contract will be signed and a medical will now take place.\nREAD MORE: Fairy tale Man Utd signing coming with Arsenal clash in mind, as double defender exit announced",
  "word_count": 232,
  "scraped_at": "2026-02-14T01:56:26.892616",
  "_text_extracted": true
}