{
  "article_id": "bd216c83ff2d",
  "url": "https://www.syracuse.com/tv/2025/08/where-to-watch-algeria-vs-south-africa-today-african-nations-championship-free-stream.html",
  "title": "Algeria vs . South Africa ( 8 / 8 / 2025 ): How to watch African Nations Championship group stage free stream online",
  "date": "20250808T120000Z",
  "domain": "syracuse.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fresh off an opening round 1, Algeria looks to take down South Africa on Matchday 2 of the 2025 African Nations Championship Group Stage, on Friday, August 8 (9/8/2025) at 10 a.m. ET.\nHow to watch: Fans in the USA can watch the match live on beIN Sports, or stream it for free with fuboTV.\nHere’s what you need to know:\nWhat: 2025 Africa Nations Championship, matchday 2\nWho: Algeria vs. South Africa\nWhen: Friday, August 8, 2025\nWhere: Namboole Mandela National Stadium, Namboole, Uganda\nTime: 10 a.m. ET\nTV channel: beIN Sports, beIN Sports CONNECT\nCan I bet on the match?\nYes, you can bet on the match from your phone in New York State, and we’ve compiled some of the best introductory offers to help navigate your first bets from BetMGM, FanDuel, DraftKings, Bet365 and more.\nHere’s a recent international soccer story via the Associated Press:\nPARIS (AP) — Paris Saint-Germain forward Ousmane Dembélé and England forward Chloe Kelly are among the contenders to win the men’s and women’s Ballon d’Or award.\nThe 30 men’s and 30 women’s nominees were revealed Thursday by France Football magazine, with the winners to be announced at a ceremony in Paris on Sept. 22.\nThe 28-year-old Dembélé was inspirational in leading PSG to its first Champions League title after years of falling short and helped the French club complete a treble. He scored a career-high 35 goals overall for PSG last season.\nTeenage star Lamine Yamal, whose mesmerizing performances lit up the Champions League and helped Barcelona win the Spanish league title, is among the other men’s nominees.\nKelly starred for England at Euros\nWhen England won the women’s European Championship last month, the 27-year-old Kelly blasted home the decisive penalty in the final against World Cup winner Spain. She also played a key role earlier in the tense knockout stages.\nLast season, Kelly played on the right flank as Arsenal won the women’s Champions League with another against-the-odds win over powerhouse Barcelona.\nShe faces competition from defender Lucy Bronze and goalkeeper Hannah Hampton — her England teammates who both play for Chelsea — and from Barcelona midfielder Aitana Bonmatí, the winner of the past two awards.\nBarcelona players have won the past four women’s awards. Bronze was runner-up in 2019 to U.S. forward Megan Rapinoe.\nPSG players in the spotlight\nDembélé was one of nine PSG players nominated for the men’s award, including goalkeeper Gianluigi Donnarumma, forward Désiré Doué, who scored twice in the 5-0 rout of Inter Milan in the Champions League final, and inspirational winger Khvitcha Kvaratskhelia, who joined from Napoli in the January transfer window.\nThe other men’s nominees include Egypt striker Mo Salah, whose 29 league goals helped Liverpool win the Premier League, and prolific Real Madrid striker Kylian Mbappé, who netted 44 times for Madrid last season.\nMidfielder Rodri won the Ballon d’Or last year after impressing with Manchester City and Spain but missed most of last season with a knee injury.\nReal Madrid snubbed the star-studded ceremony last year in apparent protest because its forward Vinícius Júnior finished in second place. After staying away, Madrid and its players then vented their feelings on social media.\nThe voting system\nThe Ballon d’Or was created by France Football magazine and has been awarded since 1956 for men, and since 2018 for women. It is voted for by journalists from the top 100 countries in the FIFA rankings for the men’s award and the top 50 FIFA-ranked countries for the women’s award.\nEach journalist, one per country, selects players in ranked order with points attributed to each position. The winner is the player who receives the most points.\nOther nominations\nPSG coach Luis Enrique was among the nominees for best men’s coach and England’s Sarina Wiegman best women’s coach.\nDonnarumma, whose shot-stopping in the knockout stages proved crucial to PSG’s success, is favored to win the Lev Yashin award for best men’s goalkeeper, while Hampton is among the five women’s candidates for that award.\nMore sports, gear and tickets\n- Where to watch Michigan State vs. Wisconsin today: College basketball free stream\n- Where to watch the NBA Celebrity All-Star Game for free today\n- Where to watch NASCAR Truck Series at Daytona tonight: Free live stream\n- How to watch Syracuse lacrosse vs No. 1 Maryland today for free\n- Where to watch USA women’s hockey vs. Italy today: Winter Olympics free stream\nfuboTV is a live TV streaming service focused on live sports, including U.S. and international soccer, the NFL, MLB, NBA, NHL and more. It also includes its own fubo Sports Networks with exclusive programming. It offers 212 channels starting at $64.99 (for one month, then $84.99), includes unlimited DVR, and streams on most devices. Right now you can try fuboTV for $20 off your first month.",
  "word_count": 802,
  "scraped_at": "2026-02-14T02:11:49.091695",
  "_text_extracted": true
}