{
  "article_id": "bd28580851ae",
  "url": "https://www.caughtoffside.com/2024/08/30/arsenal-agree-loan-deal-for-raheem-sterling/",
  "title": "Arsenal agree deal to sign Raheem Sterling on loan from Chelsea",
  "date": "20240831T014500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have reached an agreement with Chelsea to sign Raheem Sterling on loan according to Fabrizio Romano.\nChelsea will be relieved as finding a new home for Sterling had proven difficult and although they will have to revisit the situation again in 12 months time, a portion of his wages which are believed to be in excess of £300,000 per week are now off the books.\nIt’s a great move for Sterling and it offers him the chance to play for a side playing Champions League football and competing for the Premier League title.\nSterling joins Arsenal on loan\nWith the clock ticking towards Friday’s 11pm deadline the Gunners reached an agreement with Chelsea for the England international and Romano has reported Sterling wanted the move and had spoken to Mikel Arteta.\nHe took to X.com and said:\n“Raheem Sterling to Arsenal, here we go! Agreement done on loan move from Chelsea. Chelsea accept final conditions and the player wanted the move, also spoke to Mikel Arteta. Agreement done, documents expected to be ok soon.”\n???? Raheem Sterling to Arsenal, here we go! Agreement done on loan move from Chelsea.\nChelsea accept final conditions and the player wanted the move, also spoke to Mikel Arteta.\nAgreement done, documents expected to be ok soon. ?? pic.twitter.com/QzCFXU3wna\n— Fabrizio Romano (@FabrizioRomano) August 30, 2024\nSterling has an existing relationship with Arteta from their time together at Manchester City and he would provide Arsenal with a much needed alternative to Bukayo Saka, as he simply can’t play every minute of every game, whilst adding more depth to their attacking options.\nThe 29-year-old has failed to live up to expectations at Stamford Bridge following his £50m move from City in 2022.\nThe winger made 31 Premier League appearances last season, scoring eight goals and providing four assists, but was booed at times by Chelsea fans.\nHow often Sterling plays for Arsenal remains to be seen, but from Arteta’s perspective it makes sense as he’s got an extra body in, someone he knows well and a proven quantity at Premier League level who has the ability to make the difference.",
  "word_count": 355,
  "scraped_at": "2026-02-14T02:14:29.070280",
  "_text_extracted": true
}