{
  "article_id": "bd28c0af76cc",
  "url": "https://theathletic.com/4789269/2023/08/20/england-world-cup-final-story/",
  "title": "The story of England World Cup :  Ive never experienced so many problems  ",
  "date": "20230820T153000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alex Greenwood pulled off her bandage, letting the wound gape. Keira Walsh embraced her Barcelona team-mates. Lucy Bronze, who gave the ball away for Spain’s goal, sobbed uncontrollably. Manager Sarina Wiegman went through the post-match formalities blankly. This was her second consecutive World Cup final loss.\nAdvertisement\nSpain deserved their 1-0 win, smothering England’s build-up play and providing the final’s one enduring moment of quality — Olga Carmona’s pinpoint finish after 29 minutes.\nBut this Lionesses side is not a footnote. They are still European champions. They have inspired political change. They have been in Australia for six weeks and together for nine — and in that time, they proved capable of overcoming retirements and injuries, disputes and doubts.\nIt was not supposed to be this way. Last summer’s European Championship triumph was seamless — no injuries, no suspensions, no issues with form.\nThis World Cup had been even more exhaustively planned, from which motivational books to place in the players’ library to which hours of the flight to Australia the squad were allowed to sleep.\nBut by the time the Lionesses were flying to Australia, an element of chaos — though played down by Wiegman publicly — had already begun to rock the England camp.\n“I have never experienced so many problems in my career,” said Wiegman after England’s first knockout game. “That’s my job: to think of things that can happen in a game, a tournament, or ahead of a tournament. You try to turn every stone… and today we got totally tested on those stones!”\nSpain were one stone too many; their chemistry, precision, and bravery on the ball making them worthy champions — but this was still a final of fine margins. Where Lauren Hemp’s shot rebounded off the bar, Carmona’s nestled centimetres inside the post.\nGiven what they faced, it is remarkable England came so close.\nThe challenges began precisely 22 days after the Euros win, when Ellen White, the team’s all-time leading goalscorer, announced her retirement at the age of 33. One day later, she was followed into the sunset by midfielder Jill Scott, then 35, in many ways the soul of the team.\nAdvertisement\nMaybe those had been foreseen by Wiegman — but she could not have expected the injury bad luck to come.\nOn April 19, captain Leah Williamson tore the anterior cruciate ligament (ACL) in her right knee during a Women’s Super League match between Arsenal and Manchester United, ruling her out of the tournament. She told Wiegman she feared not playing under her again.\nThe next month, it was confirmed that first-choice No 10 Fran Kirby would need surgery on a knee injury sustained in February. She, too, was out.\nThere were hopes that Beth Mead, who also tore an ACL in November, could recover. Those hopes were extinguished when Wiegman named her squad on May 31: England’s player of the tournament at the Euros was absent.\nMillie Bright, named as captain in Williamson’s place, made the list but had not played since March with a knee problem.\nTen months to the day since their Euros win, England would be heading to the World Cup without four of their starting line-up for the final against Germany and without Scott, who had appeared off the bench in the quarter-final, semi-final and final.\nWilliamson described the sadness of leaving the squad WhatsApp group in April.\n“Am I needed for anything?” was her last message. “Or can I just dip out now, thank you?”\nWiegman won the Euros with the Netherlands in 2017. She then led them to the 2019 World Cup final. After taking charge of England, she won the Euros last summer – and then reached a fourth major tournament final in a row.\nShe knows the planning such success takes. She leaves no stone unturned. Her plans are meticulous and had been in place since November. So when that plan is rocked, it creates uncertainty.\nWith such a degree of squad turnover, she and trusted assistant Arjan Veurink knew they needed to maximise their time in camp. Official preparation was due to begin on June 19, three weeks after the last competitive domestic game. That meant they had exactly nine football sessions, the minimum time, according to England’s technical team, players need to mitigate injury, before their send-off friendly against Portugal on July 1.\nAdvertisement\nHere came the next problem. These dates stood outside a player-release date negotiated by FIFA and the European Club Association (ECA), which stated players could link up with national teams between the non-mandatory time frame of June 23 and 29. But England stood firm.\nWhile supposed to be relaxing on their short post-season break, players were asked to indicate by using a thumbs-up emoji in a WhatsApp group which date they would prefer to report on: June 19 or June 23. They were told they would not feature against Portugal if they did not commit to the earlier date.\nAn emergency meeting took place on June 2, two hours before the UEFA Women’s Champions League final in Eindhoven, with Wiegman, general manager Anja van Ginhoven, Football Association (FA) technical director Kay Cossington, director of women’s football Baroness Sue Campbell and representatives from most of the England players’ clubs attending.\nThere was a frank exchange of views and a solution was not immediately found.\nEventually, every player arrived on June 19. Although the players said it had not affected their preparations, Mead said: “We don’t want to be the middleman for it. It’s not fair. If your national team manager wants you in on this date, you want to go then because you think it might jeopardise your position if you don’t. Players don’t need that stress.”\nBut lurking in the background was another issue. On the plane to Australia, players wore special glasses which simulated the blue tint of morning light and the red of sunset, tailoring the brightness so players could fall asleep at optimal times to reduce jet lag. One thing they could not block out, however, was a problem that one source close to negotiations, who will remain anonymous because the matter is still ongoing, said “continued right up until they were boarding the plane”: a row over performance-related bonuses and commercial blackouts.\nIn the previous weeks, the England technical team had issued guidance preventing players from promoting personal sponsors from July 4, two weeks before the tournament started, to ensure they rested over the weekends and on their days off. There was pushback by some but not all. The highest earners did not speak up while some of the less experienced players did not want to lift their heads above the parapet.\nWith players scrambling to ensure they fulfilled their commercial contracts before the deadline, a surprise FA email landed in their inboxes, outlining new, looser guidance. Players lost out on thousands in commercial revenue because of the last-minute change, according to one player agent — speaking anonymously to protect their position.\nAdvertisement\nThe bonuses row, which originally dates back to before last summer’s Euros, was another source of deep-rooted frustration. Players felt the FA should be topping up a newly launched pot of FIFA prize money that guarantees each player in England’s squad $195,000 (£153k) for reaching the final — but the governing body disagreed.\nWiegman tried to stay neutral to protect the team’s preparations but her players, angered by what some felt was a lack of good faith in negotiations, blindsided the FA in a joint statement made in Brisbane just four days before their opening game, shared from Bright’s Twitter account.\nThe key line came four paragraphs in: “With the opening game on the horizon, we Lionesses have decided to pause the discussions, with full intentions of revisiting them following the tournament.”\nFrom your Lionesses x pic.twitter.com/TMvPaLXwHp\n— Millie Bright (@Mdawg1bright) July 18, 2023\nFrustration drips through the statement, which ends with the signatures of all of the squad members. Players have still been speaking to the Professional Footballers’ Association (PFA) throughout the tournament and, recognising their success has improved their negotiating position, are resolute that they are owed bonuses on top of the FIFA prize money.\nThere was a degree of anger at FA chief executive Mark Bullingham’s suggestion earlier this week that the timing of FIFA’s announcement of the prize money fund meant they were simply “timed out” in discussions. The FA had maintained their ‘no bonus’ position throughout and so time seemed irrelevant as far as the players were concerned.\nAs if commercial discussions could not get more fraught, goalkeeper Mary Earps spoke out about the FA’s long-term relationship with kit supplier Nike — with the public unable to buy England women’s goalkeeper shirts.\n“Should we be aligning with brands that don’t have inclusion at the centre?” she asked on the day the tournament began.\nUnder pressure from Nike, the FA scrambled to minimise the damage and protect commercial sensitivities, contacting journalists in an attempt to provide context behind Earps’ quotes.\nAdvertisement\nTo an extent, the togetherness of the squad was clear. They made a joint statement on the bonuses, even signed by travelling reserves Lucy Staniforth and Maya Le Tissier, while Earps went out of her way to praise the support of her team-mates when she wondered whether she was “over-reacting” to her shirt complaint.\n“They said: ‘No Mary, it’s totally unacceptable,’” Earps relayed. “‘We, as a group, stand for inclusion and this is the total opposite of what we stand for.’”\nFor others, the level of external disruption appeared ominous.\n“Everything is a battle,” said one source close to the camp, who will stay anonymous to protect relationships. “It feels heavier than before. I expect to see a hangover on the pitch.”\nThose concerns were evident after England’s first game, a laboured 1-0 win over Haiti.\nThey appeared uninspired in attack, with Wiegman’s big decisions — Alessia Russo over Rachel Daly, Ella Toone over Lauren James — failing to pay off. England relied on a retaken Georgia Stanway penalty to see them past a side ranked 49 places below them.\nIn the Euros, Wiegman named an unchanged XI for six successive matches. She had made only four tactical changes combined in her three previous major tournaments. But amid such upheaval at the World Cup, Wiegman could not be static.\nWomen’s Super League top scorer Daly was recalled to the starting line-up against Denmark — but at left-back, a role she played during the Euros, rather than striker — while James replaced Lauren Hemp on the left wing.\nJames scored a spectacular opener and for 30 minutes England looked better — before another wave rocked Wiegman’s boat. Walsh, arguably the side’s most irreplaceable player, went down with what appeared to be a serious knee injury.\nThough England held on to their 1-0 win, the mood afterwards was terse, with players swept away before post-match interviews and Wiegman downcast at the prospect of losing her No 6. A fourth member of her starting XI looked to be lost to a knee injury.\nAdvertisement\nThe next four days were pivotal. The camp needed to stick together. For the first time, their squad depth would be tested.\nIn finding England’s base, technical director Cossington and general manager Van Ginhoven visited 23 hotels and 18 training venues in May 2022. Their goal was to find a “home from home”, with England opting to stay in one base throughout the tournament rather than hop between cities in the knockout rounds.\nTerrigal, a coastal town of 10,000 people some 90 minutes north of Sydney, was chosen for its proximity to training bases, but also its beauty and seclusion.\n“We wanted them to feel Australia,” Cossington has said. “That’s important. They need that outside opportunity.”\nA key difference from previous coaches is Wiegman’s emphasis on including players’ families in the tournament experience. She knows its importance, speaking on Friday about how she still found the death of her sister “challenging” after she passed away during England’s pre-Euros prep camp last summer. The manager’s own family are in Australia, too, spotted wearing England shirts even before the Netherlands’ elimination in the quarter-finals.\nThe FA provided each player with £10,000 to fly loved ones to Australia and when the money did not quite cover the mother of Katie Robinson (the squad’s youngest and newest member), a fundraising page was set up.\n“As I grew in my personality, I really wanted to be more relaxed,” Wiegman said this week. “Why do players start playing football when they’re seven years old? It’s because they love the game. Yes, it’s all about winning, but you perform better when you can be yourself and when you’re in an environment – and it sounds like school – an environment where you’re safe, where you will not be judged.\n“Because when you’re on the pitch, you’re being judged all the time and that’s uncomfortable and unsafe.”\nAdvertisement\nArsenal forward Vivianne Miedema, who played under Wiegman for the Netherlands, revealed in The Athletic how Wiegman brought objects into camp as motivational tools.\n“She had a teddy bear at the Euros and a coffee cup at the Olympics in Tokyo,” said Miedema. “Each reminded her of home. For the World Cup, she brought in her Euros medal as motivation. By asking us to add things to them, she made a literal memory lane. At the Olympics, we went to a rice field box. When we ended the tournament, we had all these things that told the stories of what we’d done together. It created more meaning behind our experiences.”\nGO DEEPER\nHow Sarina Wiegman manages - by those who've experienced it\nPlenty of details remind the England team of home. In the canteen, staff shipped over Yorkshire Tea, HP Sauce, and sachets of Robinsons squash, which would not be available in Australia. Chef Gareth Cole takes dinner requests from players, within reason. But one item in the Lionesses camp encapsulates the idea of reminding the players where they have come from.\nHanging outside the team room is a painting, commissioned by England Football, depicting every member of the squad as a small child, wearing the kit of their grassroots sides.\n“We wanted to show where they started,” explains Cossington. “Just that little girl who loved the game.”\nThe staff were determined to ensure that, outside the hard work of training, the England team were able to relive those days. An arts and craft station was set up in the squad’s communal area, with backups Lotte Wubben-Moy and Hannah Hampton earning acclaim for their abilities in drawing cartoons and making bracelets respectively.\nThey have messed around with a coffee machine that produces self-portraits in its latte art, while senior players Bright, Katie Zelem, Daly and Walsh launched a girl band — the Meringue-Utans. Named after that day’s dessert, hits include Sister Sledge’s We Are Family, Natasha Bedingfield’s Unwritten, and, from Australia, Natalie Imbruglia’s Torn.\nAdvertisement\n“We did fun and silly stuff in 2019,” said Karen Bardsley, England’s starting goalkeeper at that year’s World Cup. “But we had to do it all off our own backs.”\nThis tournament, England visited Steve Irwin’s Australia Zoo and went whale-watching in matching bucket hats. Manchester United captain Zelem, vastly experienced at WSL level but a relative newcomer to this squad, was named as the official DJ and has led tours around each city on scooters, the organisation of which, club team-mate Ella Toone joked, put “Tooney’s Tours” to shame.\nWiegman famously finds it difficult to switch off. During the 2017 Euros, she left a “family day” halfway through, telling her loved ones: “I’m sorry, I can’t relax. I can’t do this.” If she manages, it is through yoga, which she has tried to do every day in Terrigal.\nWith Walsh out and England’s attack struggling, having scored just one goal from open play in the previous 427 minutes, Wiegman sat down with her assistant Veurink and contemplated ripping things up.\n“In April we had tried to find ways to be unpredictable for our opponents,” she said. “At that time, the squad still had lots of wingers, so we thought we’ll stick with what we want to do, stick with the same shape.\n“Then, during the tournament, the first two matches we were struggling a bit and we had moments where we played really well but we also had moments when we were a little vulnerable. After the second match, Arjan (Veurink) came to me and said: ‘Sarina, let’s sit down. Isn’t this the time to go to a 3-5-2?’ And I said: ‘You’re completely right, this is the right setting.’”\nIt is not an exaggeration to call this Wiegman’s biggest decision as a manager, moving England away from the 4-3-3 formation they had been wedded to. Against China, with Zelem in for the injured Walsh, the benefits immediately showed.\nRusso looked far more dangerous in a front two alongside Hemp, and was afforded the licence to come short to link play. Hemp, meanwhile, as a converted winger, could sprint in behind. Daly and Bronze, playing as wing-backs, were confident pushing forward with the cover of Jess Carter behind.\nGO DEEPER\nHemp and Russo are spearheading England in a way Wiegman never envisaged\nGreenwood, arguably England’s best and most consistent player this tournament, took a wider starting position, allowing her to play progressive passes through the lines. When everything functioned, England had a wave of attackers including Russo, Hemp, James, Daly, Bronze and Stanway hurtling forward at different angles.\nAdvertisement\nChina’s rigid 4-4-2 could not cope and England sauntered to a 6-1 win to top Group D. The speed with which they had picked up the new system was startling.\n“What Sarina and Arjan have brought to us is simplicity,” said Cossington. “A really clear playing style and principles in and out of possession. Also what they have respected is our culture and philosophies and who we are as a country and that’s been embedded through our style of play, too.”\nThat spirit has been matched by Bright’s captaincy. Her lack of playing time before the tournament, a rusty performance in her first game back against Haiti and her discomfort speaking publicly, at least compared to Williamson, raised questions over whether the role was too big for her.\nBut Bright has grown into the tournament just as the team have done — imbuing the side with a quiet strength. She has worked on developing her leadership skills with club coach Emma Hayes, journaling and sharing her aims with partner Levi Crew before each match.\nGO DEEPER\nTracing the moments that made Millie Bright\n“When the going gets tough, you keep the belief, keep the calmness, and always find a way to win,” is how she summarises her role as captain. It would be needed in the first knockout match against Nigeria.\nThe squad entered the match at Brisbane’s Suncorp Stadium buoyant.\nThe previous night, they had watched the United States lose to Sweden on penalties. Having lost to the USWNT in the semi-finals of the previous World Cup, and with Germany, the other pre-tournament favourites, already out, their pathway looked open.\nThat night, they already knew that Walsh’s injury was not serious and their star midfielder would return to the midfield against Nigeria.\nHowever, despite Wiegman’s insistence that England would not underestimate their opponents — who had already beaten hosts Australia in the group stage — they were indebted to the woodwork on three occasions to prevent their exit.\nAdvertisement\nChloe Kelly’s winning penalty in the shootout might have sent England through, but this was a team that had been outplayed and outfought by a side that entered the tournament with a fraction of the English FA’s investment.\nAgain, Wiegman had problems. James, who had scored three times and managed three assists in just three starts, was sent off after deliberately treading on Michelle Alozie. FIFA suspended her for the next two matches — ruling her out until the final.\nIt was at this moment, assailed by yet another problem, that Wiegman leaned back and wryly smiled about her problems. Wiegman being Wiegman, her groundwork and planning ensured England already had solutions.\nDespite giving off a persona that some might initially see as austere — “It’s my focus face,” she has joked — Wiegman’s great strength is her player-management. In previous tournaments, she has not had to dip into her reserves of players, but in Australia, just four outfield players have not appeared: Lotte Wubben-Moy, Katie Robinson, Esme Morgan and Jordan Nobbs.\nIn her squad selection, Wiegman ensured she had selected selfless players but has also needed to ensure they were ready to fill in when required. Zelem, who replaced Walsh against China having been out of the squad in March, was a key example and has been integral to squad chemistry.\n“In April, I wanted to try out other things (so Zelem was left out of the squad),” Wiegman said. “Then, she made the World Cup squad, played a very good game against China — and that gives me energy. I could give plenty of examples of that. That’s what I enjoy so much.”\nShe tries to be clear with her team, managing expectations so players know whether they are starters, finishers, or unlikely to play.\n“I didn’t really play in the Euros but I felt trusted and didn’t feel nervous about going on in a final to do my job because I knew what my job was,” Jill Scott said of her role as perennial substitute last summer. “That’s what’s great — there are no grey areas, everyone is trusted to do their job and everyone knows they’re still appreciated.”\n“I think it’s her directness,” said Carter, who was in and out of the side in the group stages.\nAdvertisement\nWith James absent, Wiegman recalled Toone to the starting XI. The Manchester United attacking midfielder has struggled for form for long stretches of the past year and had endured a poor start to her World Cup, sacrificed when England moved to 3-5-2. At that time, James’ form meant Toone’s place in England’s immediate plans looked remote.\nToone’s personality is outsized, needing space to bounce about and expend energy. Under some coaches, with a drop in form, that would be dampened. Not Wiegman, whose camp has encouraged individuality, with Toone’s TikTok documenting the banalities of trying to call her technologically-challenged gran to pranking best friend Russo by flinging dead shellfish at her on Terrigal beach.\nDespite another quiet display on her return against Colombia, Wiegman kept faith in the 23-year-old. She was repaid against Australia when Toone’s sensational opener set England on their way to a 3-1 win over the tournament hosts and into the final. It was the Lionesses’ best performance of the World Cup.\nWiegman’s aim is to take the pressure off. Ahead of the Euros final, her message to the squad was that they can win but they did not have to win — that while they really wanted to, none of it was a ‘have to’ situation.\n“We won by being absolutely ourselves,” Williamson has said.\nAnd so to the final.\nThere was a pattern to England’s World Cup — they encountered a problem, they adapted, they overcame. For many in the stands at Stadium Australia, the difficulty was in accepting that this escapology had not happened again.\nAs Spain’s midfield movement threatened to overrun England, Wiegman made her final gamble. The previous nine weeks had shown her side’s adaptability. One last change to change everything.\nThe team reverted to the 4-3-3 formation they began the tournament with, swapping Russo and Daly with James and Chloe Kelly. Kelly’s whipped crosses began to threaten Spain.\nAdvertisement\nEarps’ penalty save from Jennifer Hermoso appeared as another potential turning point. “I thought we were going to score and get the 1-1,” Wiegman said afterwards.\nBut the tempo had been sucked from the game. The VAR stoppage, Greenwood’s head injury, and Spain’s manipulation of possession put the match out of reach. Bethany England’s attempt to strain for an injury-time headed equaliser encapsulated a match that remained tantalisingly out of reach.\nThere was a cruelty in Bronze’s role in Olga Carmona’s winning goal for Spain — the player who has given more to English football than any member of the squad making an error at such a crucial moment. But this is where Wiegman’s player-management comes through again.\nThough several of the squad were too distraught to take in Wiegman’s post-match team-talk on the pitch, they would have heard no recriminations. Wiegman refuses to discuss individuals at their best. She will not go near them at their lowest. At 31 years old, Bronze might have one last major tournament left, and confirmed she would not be retiring from internationals.\n“We can feel very proud,” were Wiegman’s closing words. “Everything we’ve done, how we’ve grown and the challenges we’ve had, how we’ve adapted. We have given everything.”\nThis is elite sport. Sometimes the journey to which you give everything ends up taking everything. The legacy of these Lionesses is that their resilience itself has meaning.\n(Top photo: Justin Setterfield/Getty Images))",
  "word_count": 4182,
  "scraped_at": "2026-02-14T01:48:22.644451",
  "_text_extracted": true
}