{
  "article_id": "bd385c330e27",
  "url": "https://www.heraldscotland.com/news/23645645.ange-postecoglou-reveals-key-reasons-behind-emotional-celtic-exit/",
  "title": "Ange Postecoglou reveals the key reasons behind emotional Celtic exit",
  "date": "20230710T220000Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ange Postecoglou agonised over a soul-searching decision to leave Celtic – but admits his gut told him the time was right to accept a new challenge.\nThe treble-winning Parkhead manager held a first press conference since departing Glasgow for Tottenham Hotspur and opened up on the key factors behind an emotional exit that left supporters crestfallen.\nPostecoglou agreed to take over from Antonio Conte in North London just days after leading Celtic to a domestic clean sweep in June. And while he did feel there was more to achieve, the 57-year-old insists he needs to keep moving to remain at the top of his game, and that the challenge at Spurs was too strong to ‘resist’.\n“Yeah, absolutely [it required soul searching to leave],” said Postecoglou. “My wife and my kids loved it up there and my whole family was really happy. I’ve got two young ones and they’ve lived abroad their whole life in four different countries.\n“We made the decision as a family that wherever my profession took us, we’d go and we’d experience that. My wife knows better than anyone, I can’t resist a challenge.\n“That’s when I’m at my best and my history is I’ve never stayed too long at too many clubs. I’ve always left when clubs are successful.\n“All I’ve tried to do whenever I’ve been, like most managers, is leave the club you’ve inherited in a better place than where you picked it up and hopefully make a positive impact.\n“It was a tough decision, for sure. But it was also a tough decision to leave the Australian national team before a World Cup, it was tough to leave Yokohama after winning the championship there.\n“You establish relationships with people, and these are always tough decisions. For me, I’ve always gone with my gut on these things.\n“I know when I’m at my best, and I’m at my best when the challenge is the biggest. I thought this was a challenge that would fit all the things I’m looking to achieve.\n“For me to come from where I’ve come from and be sitting here today, I needed to have that instinct inside me to know when to move on because I’ve had to be faultless in my career to get to this point.\n“That’s because no one’s going to rate an Australian manager, are they? If I had any significant failures along the way I was never going to get here.\n“Part of that process is knowing that I need to keep moving to be at my best. Yes, there’s challenges at every club you’re at.\n“Every club that I’ve left, even the national team, there were more challenges [to take on]. But there are always challenges, even if I’d stayed at a club for five years I’d never be satisfied with where we’re at. I’d be looking to improve all the time.\n“So, that’s not the key factor for me. The key factor was an opportunity here to again make an impact at a football club, which I’ve tried to do at every club I’ve been at.”\nPostecoglou has been succeeded by the returning Brendan Rodgers, a figure he revealed was in constant contact with him during his Celtic tenure. The pair have exchanged good luck messages since, and the Greek-Australian is confident the club have chosen the right man to continue his work. Postecoglou knows that cracking Europe is a key aim for Rodgers in his second spell as manager, and firmly believes the foundations are in place for significant progress on the continent.\n“He’s absolutely the right man, mate,” said Postecoglou. “He’s a fantastic manager and he loves that football club.\n“He was constantly messaging me while I was Celtic manager to make sure that I stayed on track, and we had success. I’ve exchanged messages with him and he was very, very supportive when I got the [Celtic] role.\n“Even when I got this role, he sent me a nice message and I’ve reciprocated and stayed in contact with him and all the staff there. I’ve no doubt they’ll have great success.\n“Hopefully, they can make an impact in the Champions League, I know that’s what his ambition is. That group of players and staff certainly have the capability to do that.\n“Hopefully, that happens.”",
  "word_count": 716,
  "scraped_at": "2026-02-14T02:24:50.290121",
  "_text_extracted": true
}