{
  "article_id": "bd4ee33a5838",
  "url": "https://dailypost.ng/2025/03/05/ballon-dor-ive-never-dreamed-of-winning-award-vinicius-jr/",
  "title": "Ballon dOr : Ive never dreamed of winning award - Vinicius Jr",
  "date": "20250305T071500Z",
  "domain": "dailypost.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "News\nBallon d’Or: I’ve never dreamed of winning award – Vinicius Jr\nReal Madrid attacker, Vinicius Junior has said he never dreamt of winning the Ballon d’Or.\nThe Brazilian is optimistic of winning the gong after missing out on the 2024 edition to Manchester City midfielder, Rodri.\nMany football fans thought the 2024 award was going Vinicius’s way until the last moments when it became clearer he stood no chance.\nHe helped Los Blancos to three titles in the 2023-24 season, including a second La Liga-UEFA Champions League double in three years.\nHowever, Rodri was chosen for the award after winning Euro 2024 with Spain and having a strong club season with City.\nAsked about his Ballon d’Or snub last year, the Brazilian forward chose to dwell on the future.\nHe told a press conference that he hopes to win a few as he keeps helping his club and country.\n“No, people vote what they think. I have my thoughts. I never dreamed of winning the Ballon d’Or, but when you are close you believe it, but I will have more chances. I’ve already won two European Cups, and I’m here to win many more.\n“I’m here to continue making history, to pay for everything that the president and the club have given me.\n“I hope I can continue to score more goals and play more games in this shirt. I have won, but I can win much more, and I can enter the history of this club with so many great players who are legends,” he said.\nLos Blancos saw off Manchester City in the knockout play-offs to book a Round-of-16 clash with Atletico.\nThe first leg at the Santiago Bernabeu ended 2-1 in favour of the multiple champions.",
  "word_count": 290,
  "scraped_at": "2026-02-14T02:18:17.729589",
  "_text_extracted": true
}