{
  "article_id": "bd53c9d9dc91",
  "url": "https://weaintgotnohistory.sbnation.com/2023/4/7/23673607/lampard-hoping-to-get-chelsea-firing-again-now-ready-to-play-any-part-going-forward-as-well",
  "title": "Lampard hoping to get Chelsea firing again , ready to play any part going forward as well",
  "date": "20230407T074500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frank Lampard’s legendary standing and status at Chelsea is already leading to excess speculation over his long-term (managerial) prospects at the club.\nLampard hoping to get Chelsea firing again now, ready to play any part in process of going forward as well\nAll in it together\nWe’ve certainly had plenty of interim and caretaker managers over the past couple decades, but none of them were subject to such immediate focus on possibly staying beyond their initial remit. In fact, only two were offered full-time contracts, Avram Grant and Roberto Di Matteo, and only one would end up still in place the following season (by actually winning the Champions League, not just reaching the final).\nIn Lampard’s case, this is partly a function of his arrival occurring late in the season, but mostly you would have to think it’s a function of Lampard being who he is: club legend, ambitious manager, a real Chelsea Blue Blood.\nLampard did reveal in his re-introductory press conference that he wasn’t specifically told that he cannot under any circumstances have the job next season, but he also made it pretty clear that he’s not meant to be anything more than just a caretaker through the end of the season.\nThings can of course always change, and change quite quickly in football. And Lampard has also seemed to hint that he would be open to helping out in any capacity, not just strictly as a manager. Whether that means he would be open to an administrative role (a la, say, Petr Čech in the final days of the Abramovich Era) is unclear, but that possibility probably shouldn’t be ruled out either.\n“If the owners, people that work here, decision-makers, medical, kit men and anybody wants to speak to me about anything: my job here is to try and affect it positively. [This] club wants to move forward so it’s a case of how can we get better? I will be absolutely happy to have all those conversations. But my priority is trying to get results on the pitch.”\n“The conversations I have had with the decision-makers and people running the club have all been really positive. You get an understanding of a club that has a vision and wants to move forward, now of course this is about people and people working in the right direction and collaborating and talking and trying to find the right way. That’s the sense I’ve had coming here.\n“Of course at the moment we are in a position where it is part of the process [and] I’m ready to play my part in that process and I would be very honest and open with everybody. I know the club, I think that’s a positive coming into this role now.\n“[But] also from a selfish point [of view] I want to do my best in this period because I have a professional ego where I want to be the best I can be [...] to be as good as possible. I want that feeling. I want that feeling of managing here, winning some games because there’s nothing better. There’s no doubt about it. That’s why I am here.”\n-Frank Lampard; source: Evening Standard\nWinning some games would require us to start scoring some goals, and in theory Lampard should have plenty to impart on this squad in terms of that endeavor.\nThere’s no shortage of skill in the squad; if they had half of Lampard’s mentality and hunger, we’d be alright.\n“Part of the job is to try and manage the situation and make every player feel included. [...] Everyone can have a clean slate as such, and show in training and be competitive in training and the competitive nature can cross over onto the pitch. That’s a good thing about the squad, you can push each other and try and manage that.\n“In terms of goalscoring, there’s no genius answer for a coach to explain to you about scoring goals to a point. You can set up the structure of a team and work to get your team in a dominant area of the pitch a lot. We saw that against Liverpool, a lot of good chances.\n“All I’ll say here is to work repetition on the training ground, to work in terms of speaking to the players. Fortunately, it was a big part of my game. That’s not me comparing it. It’s just understanding the mindset to take that agressive, cold-hearted nature to want to score goals. I know the players will have that, it’s just a case of trying to direct that in the right way.\n-Frank Lampard; source: Football.London\nGood luck, Frank, however long this job might last!",
  "word_count": 781,
  "scraped_at": "2026-02-14T02:24:37.524695",
  "_text_extracted": true
}