{
  "article_id": "bd6b50c3eba1",
  "url": "https://www.caughtoffside.com/2025/11/21/pep-guardiola-full-press-conference-man-city-newcastle/",
  "title": "Pep Guardiola full press conference ahead of Man City - Newcastle",
  "date": "20251121T180000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City manager Pep Guardiola addressed his usual pre-match press conference on Friday morning ahead of this weekend’s Premier League clash against Newcastle.\nThe Spanish tactician will be hoping his Man City side can make a strong start again after the international break, having enjoyed a superb 3-0 win over reigning champions Liverpool in their last match.\nUp next is a tricky game away to Newcastle, and Guardiola singled out Magpies midfield star Bruno Guimaraes for praise in one of his comments.\nGuardiola also provided an update on the ongoing injury saga involving star player Rodri, while fans will also surely be starting to make plans for how to buy Champions League tickets for Man City vs Bayer Leverkusen.\nFor now, here’s Guardiola’s press conference in full.\nPep Guardiola’s Manchester City press conference – full transcript\nOn City’s opponents Newcastle\nTop, top team, they’re a Champions League team but we’re ready.\nOn City’s goalkeepers\nWe have an incredible two ‘keepers with Gigio and James. I’ve been incredibly impressed how James developed since he left the academy here.\nGigio, always I said, when you start at 17 with Milan it’s because you are something special. All the players are qualified for the World Cup and hopefully Gigio can do it.\nExperience, if you learn from what happens you have more experience, but that doesn’t mean you will always do well.\nOn title race vs Arsenal\nThe truth is the team as strong as Arsenal in the last seasons, the feeling I had is they will not drop many points and if they get a lot of distance it will be difficult. We are in November, and in November in this league nothing is final. What happens in February or March, be careful. Now international break is done we will see each other every few days till March, now the real season starts now. We have to be there in March. Winning tomorrow would be an important step for us.\nOn Rodri and injuries\nEverybody is fit except Kova (Mateo Kovacic) and Rodri. Rodri is making good steps, it’s almost three weeks since he made the last little step back. He knows that we have to take real time to recover fine, recover well, mentally and especially physically from the problems he had, to be consistent from now on until the end.\nOn Bernardo Silva\nTop, one of the best. He gives us and gives himself something that is not in the stats but a lot of things, his mentality, absolutely one of the best players I ever trained in my career.\nOn Nico O’Reilly\nI’m happy for him, hopefully he can continue, stay humble. Sometimes that age when you reach the highest level he can be stable. I’m delighted for the academy, all the people who worked with him since a little boy, everyone involved in his development, it’s a big, big compliment.\nOn Wayne Rooney’s Erling Haaland snub\nAbsolutely (he’s right). You would chose another one. It doesn’t matter. Wayne decides that and I’m fine, it’s not a big issue.\nOn Haaland’s form\nHe’s incredible this season, he’s breaking all the records, personal and Premier League, for Norway. For him, his national team, many of the squad for Norway weren’t even born the last time they were in the World Cup. As a football player, world class player, he deserves to play a World Cup and live the experience. I’m so happy for him.\nOn having a break\nI don’t know. For me the break I like it, take a break, I love my job but take time to breathe. Maybe a longer time would be good too. We adapt with a World Cup in winter time. Whatever the big brains in world football decide, we will do it.\nOn Bruno Guimaraes\nIt’s not just this season, for many years, since Lyon we realised he was a special player. Newcastle make an incredible signing. He’s getting better and better. Always I’ve been a big fan of him.",
  "word_count": 667,
  "scraped_at": "2026-02-14T02:03:26.526624",
  "_text_extracted": true
}