{
  "article_id": "bd763100e81f",
  "url": "https://www.themag.co.uk/2023/12/richard-keys-up-to-mischief-with-newcastle-united-yet-again/",
  "title": "Richard Keys up to mischief with Newcastle United - Yet again",
  "date": "20231219T090000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Richard Keys up to mischief with Newcastle United – Yet again\nRichard Keys has been talking about Newcastle United.\nEddie Howe’s side winning 3-0 at St James’ Park.\nThe Newcastle players bouncing back to winning form against Fulham in the Premier League.\nThis is what Richard Keys has found to say, as Eddie Howe now takes his team to Chelsea for a Carabao Cup quarter-final…\nRichard Keys writing on his personal blog – 18 December 2023:\n“It’s a crucial week for Newcastle…\n“Eddie Howe really needs to win the competition [Carabao Cup].\n“As we all know, Newcastle fans are desperate for a trophy.\n“If I were Howe I’d throw everything at it now – starting at Chelsea. There’s no reason not to. In fact, it’s his best way of convincing his guv’nors that he is the man to take the Toon to the next level.\n“He did a wonderful job landing a CL place last season, but it all went horribly flat didn’t it?\n“It turned out that there was a world of difference between the romance of it all – and the reality. Newcastle simply weren’t good enough.\n“There are some big decisions to be made now at St. James’.\n“Can Howe take them on again?\n“Can he convince top players to join the Saudi revolution?\n“It will take more than just money to do that.\n“Or will Newcastle have to find themselves a ‘super-coach’ in order to push on?\n“If that’s a decision they’re considering – who might that be?\n“Don’t rule out Jose Mourinho. And if it happens, remember where you read it first.”\nRichard Keys up to mischief with Newcastle United, yet again.\nHe is so transparent, you can see straight through him.\nObviously, the overwhelming majority of you reading this, will be automatically thinking exactly the same obvious points as me, as Richard Keys adds each additional provocation. However, I do feel obliged to make a few points.\nIf for some bizarre reason, the Newcastle United owners somehow thought Jose Mourinho was the answer, to anything, then Richard Keys wouldn’t even be the ‘first’ to claim this as a possibility. In recent years, countless desperate attention seeking journalists and pundits have claimed Mourinho could go to Newcastle United and only this past week, the Italian media have thrown the story out again, purely based on the fact that as things currently stand, he will be out of contract at Roma in the summer.\nThe Jose Mourinho style of football was rarely great to watch but he did win countless trophies, back in the day. That is it though, he has had his day. His days of winning the Champions League and domestic league titles are long gone, the last was in 2015 at Chelsea when he won the Champions League.\nHe was backed with massive money at Man U but sacked with the team failing, then spent big at Tottenham but only lasted 17 months before sacked.\nEddie Howe took over at a shambles of a club with a team on its knees and relegation looking all but certain. He more than saved Newcastle from relegation and then in his first full season finished fourth and reached NUFC’s first cup final in 23 years. Despite an unprecedented missing list of players, Eddie Howe has Newcastle sixth in the table and having won against Man City and Man U in the competition, would take Newcastle into only their third ever League Cup semi-final in their entire history, if winning at Chelsea.\nJose Mourinho may indeed have been a ‘Super-Coach’ once but reality is that he has taken over a Roma side who had finished top three on five occasions in the past eight seasons, never finishing lower than seventh. Serie A is far weaker than the Premier League and yet Mourinho has finished sixth in each of these past two seasons and currently are eighth this season. It is funny how Richard Keys misses out ‘small’ details like this.\nAlso, as well as demanding eye watering levels of wages, Jose Mourinho also expects massive spending power in the transfer market. Whatever expectations Richard Keys might claim / wish should be on the shoulders of Eddie Howe, the fact is that for starters all of the ‘big six’ have squads that cost far more to build than Newcastle’s, plus in this latest summer 2023 transfer window, all of the ‘big six’ spent more than Newcastle United did.\nI am not going to answer all the rest of his nonsense but fair to say that no rational person with integrity would say that suddenly it is crisis time, purely because Newcastle United were knocked out of the Champions League. As we all know, it was labelled the Group of Death for good reason and all the way through there was so little between the four clubs. On Wednesday night it was in the balance until the very end, as to whether PSG, AC Milan or Newcastle would join Dortmund in the last 16 and such small margins decided it, with 31 minutes to go Eddie Howe’s side were finishing second in the group.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 869,
  "scraped_at": "2026-02-14T01:56:38.148414",
  "_text_extracted": true
}