{
  "article_id": "bd851f947833",
  "url": "https://metro.co.uk/2024/04/20/santi-cazorla-hails-arsenal-duo-rates-premier-league-title-chances-20685167/",
  "title": "Santi Cazorla hails Arsenal duo and rates Premier League title chances | Football",
  "date": "20240420T150000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Santi Cazorla has picked out Arsenal stars Martin Odegaard and Declan Rice for special praise and insists the club remain ‘clear candidates’ for the Premier League title despite their recent defeat to Aston Villa.\nArsenal travel to Wolves needing to shake themselves off after an immensely painful week, with Mikel Arteta’s men slipping up in the title race and suffering elimination from the Champions League in the space of just four days.\nBut with Manchester City in FA Cup action this weekend and Liverpool playing on Sunday, the Gunners know they will return to the top of the Premier League table with victory at Molineux this evening.\nAt his pre-match press conference, an upbeat Mikel Arteta smiled from ear to ear when reminded that Arsenal had the opportunity to go four points clear of City should they win their next two games, given the champions must wait until next Thursday for their next league contest.\nAnd while Arsenal’s confidence will have taken a knock in the wake of back-to-back losses, Cazorla, a former fan favourite in north London, is confident Arteta is the perfect man to lift the squad ahead of their all-important Premier League run-in.\nAfter sharing a dressing room with Arteta for four years at the Emirates, Cazorla never had any doubts that his fellow countryman would go on to become a top manager.\n‘I really want to go back. I owe them a lot, they hold a special place. I also have a great friend [Arteta] there,’ the ex-Spain and Arsenal midfielder said in a wide-ranging interview with The Guardian.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Injured, watching games together, he would get the remote and pause it. “What are you doing?”. He would say: “Go back, go back”, rewind 30 seconds, and ask: “What do you see?”.\n‘”I see a paused screen! What do you want me to see?!”. He would say: “Look at this guy here, how badly he’s positioned. If he goes here, and he goes there, this space opens”. Every game, pausing every 20 seconds.\n‘The match has finished and we’re still in the 20th minute. I’m thinking: “What’s with this guy?”.\n‘He sees it. I love football but I don’t. I think it’s a gift. He’s pausing. “Can’t you see we’re doing this badly? Don’t you think the left-back should be deeper? That he should draw out his marker? Don’t you think we can create a space there?”.\n‘I said yes to everything: “Yes, you’re completely right, Mikel. Now, press play.” I’d say: “Mate, you’re a coach already.” He said: “Yeah, I see things that make me think I should be”.\n‘We talked a lot. He still loved playing, but working with Pep Guardiola at [Manchester] City was an opportunity, the best apprenticeship.\n‘Mikel has changed Arsenal’s mentality. When I was there, something was missing. Mikel changed that and they have an incredible squad.’\nMore Trending\nCazorla sees himself in Arsenal captain Odegaard and believes Rice has proven an excellent signing following his arrival from West Ham last summer, comparing the England midfielder to Aaron Ramsey.\n‘I love Odegaard and see myself in him: like him, I found a coach [Arsene Wenger] who gave me confidence. He made me captain before I could say “hola” in English,’ Cazorla added.\n‘Declan Rice reminds me of Aaron Ramsey, appearing everywhere, a brutal player.\n‘Arsenal are clear candidates for the league.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Tottenham star Pedro Porro compares Liverpool target Ruben Amorim to Ange Postecoglou\nMORE: Alan Shearer blasts Noni Madueke and Nicolas Jackson after Chelsea’s penalty row against Everton",
  "word_count": 663,
  "scraped_at": "2026-02-14T02:25:26.757749",
  "_text_extracted": true
}