{
  "article_id": "bd8ad0314772",
  "url": "https://www.teamtalk.com/manchester-united/fabrizio-romano-rules-out-rumoured-next-man-utd-manager-candidate",
  "title": "Next Man Utd manager : Fabrizio Romano RULES OUT rumoured candidate",
  "date": "20260105T190000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nFabrizio Romano RULES OUT rumoured next Man Utd manager candidate\nFabrizio Romano is insistent a manager linked with replacing Ruben Amorim will not be heading to Manchester United, while sources have revealed five names the Red Devils ARE looking at, and who among them is the top choice.\nMan Utd sacked Amorim on Monday morning, bringing an end to what can only be termed a disastrous spell for the Portuguese at Old Trafford.\nThe real reasons behind why Man Utd reached the decision they did – of which there are many, some obvious, others not so much – are already emerging.\nDarren Fletcher has taken charge on an interim basis and per David Ornstein, the expectation is Man Utd WON’T hire a permanent replacement for Amorim until the summer.\nThe club are content to take their time to ensure every avenue is explored and the right candidate is chosen. However, that does mean responsibility for qualifying for next year’s Champions League could rest entirely with Fletcher who has never managed at senior level before.\nIn any case, the hunt for Man Utd’s next permanent manager is on and one shock name already linked is legendary Frenchman, Zinedine Zidane.\nSuggestions Zidane could take over at Old Trafford seem to do the rounds every time there’s a vacancy in Manchester.\nBut according to Fabrizio Romano, Zidane will not be moving to Man Utd any time soon and instead, already has a verbal agreement in place to become the new manager of the France national side after the 2026 World Cup.\n“I already saw some rumours in the English media saying Zinedine Zidane could be a candidate,” began Romano when reporting on his YouTube channel.\n“Guys, Zidane is always linked with the Man Utd job but remember what I keep telling you on Zidane.\n“He has a verbal agreement to become the new French national team head coach after the World Cup to replace Didier Deschamps.\n“So at this moment I’m not aware of any concrete contact with Zidane.”\nSo… who ARE Man Utd looking at?\nLate on Sunday night and before Amorim was relieved of his duties, our insider, Fraser Fletcher, got the drop on who Man Utd were looking at in the event Amorim were dismissed.\nGiven Amorim was fired barely half a day later, Fletcher’s revelations have now assumed even greater significance.\nFive names were put to our correspondent – Oliver Glasner, Andoni Iraola, Enzo Maresca, Unai Emery and Gareth Southgate.\nOf those five, Glasner is viewed internally as the top choice, which begs one obvious question – are United sleepwalking into the same mistake?\nGlasner primarily played a back three at former club Frankfurt and has brought that system over to Crystal Palace.\nAmorim’s insistence on sticking with a back three has been confirmed as one of the primary reasons behind his falling out with director of football, Jason Wilcox.\nHowever, we’ve been told Glasner would be far more flexible with his tactics and formations if moving to Man Utd. It would not be a case of ‘support the back three or fire me’, as it unfortunately became with Amorim.\nFletcher’s full scoop and the finer details of who’s in line to become Man Utd’s next permanent manager can be found here.\nLatest Man Utd news – Maresca contacts / Mainoo reprieve\nIn other news, early contacts between Man Utd and recently-departed Chelsea boss, Enzo Maresca, have been positive.\nElsewhere, Amorim’s dismissal could allow Kobbie Mainoo to get back into the starting line-up under interim boss Darren Fletcher and become part of the club’s long-term future, sources have told TEAMtalk.\nFinally, TEAMtalk has taken a look at six United stars who’ll secretly be thrilled Amorim has been binned, of which Mainoo is chief among the lot.",
  "word_count": 633,
  "scraped_at": "2026-02-14T01:55:32.917225",
  "_text_extracted": true
}