{
  "article_id": "bd94a5380449",
  "url": "https://www.myjoyonline.com/morocco-king-hailed-for-the-atlas-lions-growing-status/",
  "title": "Morocco King hailed for the Atlas Lion growing status",
  "date": "20230331T193000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nIn 2009, King Mohammed VI officially opened the crown jewel of Morocco’s football investment – the Mohamed VI Football Complex – just outside Rabat.\nThe centre likened to the Clairefontaine in France or St George’s Park in England, was the beginning of an overhaul of the North African nation’s football structure.\nThe vision of HM King Mohammed VI, implemented daily by the Royal Moroccan Football Federation [FRMF], was to develop the next generation of footballers.\nThat investment, worth over US$15 million, has begun to pay off.\nTop players like Nayef Aguerd, a centre-back for Premier League club West Ham United, and Sevilla forward Youssef En-Nesryi came through the Mohamed VI Complex academy.\n“For us, at the Royal Moroccan Football Federation, it’s been about implementing the vision of His Majesty King Mohammed VI,” said special representative of the FRMF Omar Khayri.\nThe state-of-the-art national training centre contains four five-star hotels, eight FIFA standard pitches – one of which is indoor in a climate-controlled building – and a medical facility that includes a dentist.\nWithout a doubt, the success of the Atlas Lions at the 2022 FIFA World Cup in Qatar remains Africa’s best story in world football in recent times, but it is certainly not the result of luck and grit.\nIt is a result of clarity of vision coupled with expertise and planning. That is evidenced by the fact that the country’s clubs hold the men’s and women’s African Champions League titles.\nThey also won the men’s Confederations Cup, cementing their dominance in continental club football.\nMorocco are also a previous winner of the African Nations Championship [CHAN], the continental tournament that exclusively features players who play domestically.\nIn the Women’s Africa Cup of Nations, they finished second after losing to South Africa in the final of the 2022 edition. They have qualified for their first FIFA World Cup.\nAt the weekend, Morocco’s 2-1 win over Brazil in an international friendly further underlined the North African country’s growing status as a heavyweight in African football.\nIt was their first-ever win over the Samba Boys, and Khyari has credited HM King Mohammed VI’s massive investment for the success.\nIn a match where both teams paid tribute to football legend Pele who died in December 2022, Soufiane Boufal and Abdelhamid Sbiri struck on either side of the half to send wild celebrations across Morocco.\nManchester United’s talisman Casemiro scored Brazil’s goal in Tangier, a city in north-western Morocco on the coast of the Mediterranean Sea.\nBefore the massive win on Saturday, Morocco had suffered defeats in their only two other meetings. A 2-0 loss in a friendly in 1997 and a 3-0 loss in the group stage of the 1998 World Cup.\nThe 2-1 victory over Brazil came in a week when they became the first African nation to qualify for the 2023 Africa Cup of Nations. This was after Liberia held South Africa to a disappointing 2-2 draw at home.\nHaving beaten both Bafana Bafana and the Lone Stars in the three-team group, the Atlas Lions are guaranteed a place at the AFCON in Ivory Coast next January.\nThe victory over the five-time world champions, Brazil proves their 2022 Qatar World Cup heroics were not a fluke. The North African giants beat a Ronaldo-led Portugal 1-0 last year to become the first African team to reach the semi-finals of the World Cup.\nNational team coach Walid Regragui and his revered South African counterpart Pitso Mosimane are on record as crediting King Mohammed VI’s grand vision for the success of Moroccan football.\n“HM King Mohammed VI has put a lot of means to advance soccer in Morocco,” Regragui said at the World Cup.\n“That facility was built by the Government,” the three-time CAF Champions League winner, Mosimane, said after touring the facility.\nKhayri added that the victory over mighty Brazil proves that the King’s foresight and great vision to develop football is bearing fruit.\n“The King has been leading sports development from the front, and the win today is a result of his hard work and great plans not just for football but all sports. Beating Brazil is an immense pride moment for Morocco,” Khyari said.\nThe FRMF has also begun investing in women’s football, developing football in schools and clubs, and creating a national league structure.\nIn fact, Morocco is the only nation in the world to have two tiers of women’s football that are both fully professional.\n“Remember, the King’s vision has also uplifted women’s football. Besides reaching the Women’s Africa Cup of Nations final last year and going to our first World Cup later this year, our Futsal team won the 2020 Africa Cup of Nations. This is all because HM King Mohammed VI has put in a lot of means to support the development of sport in the country,” said Khyari.\nHe believes the Atlas Lions have closed the gap between Africa and the best football-playing countries in the world.\nLatest Stories\n-\nBooming Indicators, Dying Rivers: Ghana under Chronic Environmental Poisoning\n20 minutes -\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n48 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n1 hour -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n1 hour -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n3 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n3 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n4 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n4 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n4 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n4 hours -\nNUGS President urges sustainable digital governance\n4 hours",
  "word_count": 1046,
  "scraped_at": "2026-02-14T02:09:52.185711",
  "_text_extracted": true
}