{
  "article_id": "bd946f270ef0",
  "url": "https://metro.co.uk/2023/04/13/tottenham-make-vincent-kompany-their-top-target-as-they-follow-arsenals-mikel-arteta-plan-18603963/",
  "title": "Tottenham make Vincent Kompany their top target as they follow Arsenal Mikel Arteta plan | Football",
  "date": "20230413T110000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City legend Vincent Kompany is now Tottenham’s No.1 target as the quest to find their new manager continues.\nIn March, Spurs sacked Antonio Conte following a poor run of form that had seen the club knocked out of both the Champions League and FA Cup in quick succession.\nThe Italian manager was already expected to leave Spurs at the end of the season when his contract expired but the decision to end the relationship early came after he publicly berated his players and the club’s board following the 3-3 draw at Southampton.\nCristian Stellini and Ryan Mason are now in charge until the end of the season with the aim of finishing their side in the top four, with Tottenham currently fifth and just three points off Newcastle and Manchester United, albeit having played a game more.\nIn the meantime, Daniel Levy is on the hunt for a new permanent manager – his fifth in four years – with a wide variety of names on the shortlist including Julian Nagelsmann, Brendan Rodgers, Graham Potter and Mauricio Pochettino.\nAnother name touted was Kompany whose Burnley side have already won promotion to the Premier League and are on the verge of winning the Championship title.\nAnd according to The Sun, the former Manchester City captain is now Levy’s first-choice to takeover at the Tottenham Hotspur Stadium.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nTottenham's next permanent manager odds:\nBrendan Rodgers – 9/4\nMauricio Pochettino – 10/3\nJulian Nagelsmann – 6/1\nGraham Potter – 6/1\nAnge Postecoglou – 9/1\nVincent Kompany – 9/1\nArne Slot – 9/1\nOdds courtesy of Betfair\nIt is said that Spurs’ chiefs have been ‘blown away’ by what the Belgian has achieved at Turf Moor in such a short space of time having only moved there last summer following three years at Anderlecht.\nNot only has he brought Burnley back to the top-flight at the first time of asking but he has also transformed the Clarets’ style of play from Sean Dyche’s defensive tactics to exciting, attacking football, with his side scoring 78 goals in 40 games so far and losing just twice.\nAnd despite all this success, it is rumored that Kompany could be tempted to leave the club as Burnley may not be able to offer the transfer funds he desires in the summer, something Tottenham could capitalise on.\nMore Trending\nSome do have concerns over the 37-year-old’s youth and experience however, but Levy and co. are willing to take a chance on Kompany as they look to replicate the success arch-rivals Arsenal have had since appointing Mikel Arteta.\nArteta had never managed before joining the Gunners in 2019, having previously served as Pep Guardiola’s assistant at City for three years, where he worked with Kompany, but after a slow start he is now well-placed to win Arsenal’s first league title since 2004.\nWhile Levy works on securing his new manager, Tottenham’s run-in continues on Saturday when they host Bournemouth.\nMORE: Manchester United’s Old Trafford dropped as UK and Ireland confirm stadiums for Euro 2028 bid\nMORE: Frank Lampard annoyed by Graham Potter decision which could hurt Chelsea’s Champions League chances\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 594,
  "scraped_at": "2026-02-14T01:53:35.627210",
  "_text_extracted": true
}