{
  "article_id": "bd974637f18f",
  "url": "https://www.cbsnews.com/essentials/how-to-watch-the-2024-nba-draft/",
  "title": "How to watch the 2024 NBA Draft tonight : Livestream options , starting time , draft order , more",
  "date": "20240626T190000Z",
  "domain": "cbsnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How to watch the 2024 NBA Draft tonight: Livestream options, starting time, draft order, more\nThe 2024 NBA Draft is here. Some of NCAA March Madness' biggest stars have entered the draft, including big man Zach Edey (Purdue) and five-star recruit Jared McCain (Duke), alongside highly-anticipated picks like Bronny James (USC). The 2024 NBA Draft promises to be as entertaining and dramatic as an NBA game.\nKeep reading to find out how and when you can watch the 2024 NBA Draft tonight, even if you don't have cable.\nHow and when to watch the 2024 NBA Draft\nThe 2024 NBA Draft will be held on Wednesday, June 26, 2024 and Thursday, June 27, 2024. The NBA Draft will be broadcast on ABC and ESPN, and stream on Sling TV and the platforms featured below.\nBelow are the times for each day of the 2024 NBA Draft\n- Wednesday, June 26: 8 p.m. ET ( 5 p.m. PT) airing on ABC and ESPN\n- Thursday, June 27: 4 p.m. ET (1 p.m. PT) airing on ESPN only\nHow to watch the 2024 NBA Draft without cable\nIf your cable subscription doesn't carry ABC or ESPN, or if you've cut the cord with your cable company, you can still watch the finals. Below are the platforms on which you can watch the 2024 NBA Draft without cable.\nSave 50% on Sling TV: The most cost-effective way to stream the 2024 NBA Draft\nOne of the most cost-effective ways to stream the 2024 NBA Draft is through a subscription to Sling TV. To watch the NBA Draft and all the top-tier sports and content airing this summer, you'll need a subscription to the Orange + Blue tier.\nSling's Orange + Blue tier costs $60 per month, but the platform is currently offering 50% off the first month of any pricing tier, making the Orange + Blue tier $30 for the first month. You can cancel anytime.\nNote: Because Sling TV doesn't carry CBS, you won't be able to watch CBS-aired programming like next year's NFL games on CBS. To watch these games, plus PGA golf, UEFA Champions League and more live sports, we recommend you also subscribe to Paramount+ with Showtime. Paramount+ with Showtime costs $12 per month after a one-week free trial.\nCBS Essentials and Paramount+ with Showtime are both subsidiaries of Paramount.\nTop features of Sling TV Orange + Blue tier:\n- Sling TV is also our top choice to stream network-aired Paris Olympic events.\n- There are 46 channels to watch in total, including ABC, NBC and Fox (where available).\n- You get access to NHL games airing on TNT and TBS, which Fubo doesn't carry.\n- All subscription tiers include 50 hours of cloud-based DVR storage.\nWatch the 2024 NBA Draft for free with Fubo\nYou can watch the 2024 NBA Draft on Fubo. Fubo is a sports-centric streaming service that offers access to local network affiliates, ESPN and more. To watch the NBA Draft for free, start a seven-day free trial of Fubo. You can begin watching immediately on your TV, phone, tablet or computer. In addition to the NBA Draft, you'll have access to NFL football, MLB, NBA, NASCAR, MLS and international soccer games. Fubo's Pro Tier is priced at $80 per month after your free seven-day trial.\nSports fans will want to consider adding on the $7.99 per month Fubo Extra package, which includes MLB Network, NBA TV, NHL Network, Tennis Channel, SEC Network and more channels with live games. Or upgrade to the Fubo Elite tier and get all the Fubo Extra channels, plus the ability to stream in 4K, starting at $90 per month ($70 for the first month).\nTop features of FuboTV Pro Tier:\n- There are no contracts with Fubo, you can cancel anytime.\n- The Pro tier includes over 180 channels, so there's something for everyone to enjoy.\n- Fubo includes most channels you'll need to watch live sports, including CBS (not available through Sling TV).\n- All tiers come with 1,000 hours of cloud-based DVR recording.\n- Stream on your TV, phone, tablet and other devices.\nHulu + Live TV/ESPN+ bundle: Watch the 2024 NBA Draft live for free\nYou can watch this year's draft with the Hulu + Live TV/ESPN+ bundle. The bundle features 95 channels, including ABC, TNT, TBS, local network affiliates and ESPN. It also includes the ESPN+ streaming service. Unlimited DVR storage is also included. Watch the 2024 NBA Draft, MLB this season and network-aired NFL games next season with Hulu + Live TV/ESPN+ bundle.\nHulu + Live TV comes bundled with ESPN+ and Disney+. It's priced at $77 per month after a three-day free trial.\nWatch the 2024 NBA Draft live with a digital HDTV antenna\nYou can also watch this year's draft on TV with an affordable indoor antenna, which pulls in local over-the-air HDTV channels such as CBS, NBC, ABC, Fox, PBS, Univision and more. Here's the kicker: There's no monthly charge.\nFor anyone living in a partially blocked-off area (those near mountains or first-floor apartments), a digital TV antenna may not pick up a good signal -- or any signal at all. But for many homes, a digital TV antenna provides a seriously inexpensive way to watch sports without paying a cable company. Indoor TV antennas can also provide some much-needed TV backup if a storm knocks out your cable.\nThis ultra-thin, multi-directional Mohu Leaf Supreme Pro digital antenna with a 65-mile range can receive hundreds of HDTV channels and can filter out cellular and FM signals. It delivers a high-quality picture in 1080p HDTV, top-tier sound and features a 12-foot digital coax cable.\nSee the latest NBA fan gear at Fanatics\nThere's never been a better time to get ready for the 2024-25 NBA season than now. Rooting from home is more fun when repping your team in the latest NBA fan fear. Fanatics is our first stop for the newest NBA fan gear, our go-to for the latest drop of NBA merch like rookie jerseys, team T-shirts, hats and more. Fanatics also has gear to celebrate the Boston Celtics 2024 NBA Championship win. Get free shipping on all orders over $24 through June 25, 2024 (use code 24SHIP).\nWhere is the 2024 NBA Draft?\nDay 1 of the 2024 NBA Draft will be held at Barclays Center in Brooklyn, NY, home of the Brooklyn Nets and the New York Liberty. Day 2 of the draft will broadcast live from ESPN's Seaport District Studios in New York.\nWho has the top pick for the 2024 NBA Draft?\nThe Atlanta Hawks have the top pick of the 2024 Draft.\nWhat is the draft order for the 2024 NBA Draft?\nAt the NBA Draft Lottery 2024, drawings were conducted to determine the first four picks in the NBA Draft 2024. The remaining lottery teams selected picks 5-14 in inverse order of their records in the 2023-24 regular season.\nBelow is the complete draft order for the first and second rounds of the 2024 NBA Draft.\nFirst Round\n1. Atlanta\n2. Washington\n3. Houston (from Brooklyn)\n4. San Antonio\n5. Detroit\n6. Charlotte\n7. Portland\n8. San Antonio (from Toronto)\n9. Memphis\n10. Utah\n11. Chicago\n12. Oklahoma City (from Houston)\n13. Sacramento\n14. Portland (from Golden State via Boston and Memphis)\n15. Miami\n16. Philadelphia\n17. Los Angeles Lakers\n18. Orlando\n19. Toronto (from Indiana)\n20. Cleveland\n21. New Orleans (from Milwaukee)\n22. Phoenix\n23. Milwaukee (from New Orleans)\n24. New York (from Dallas)\n25. New York\n26. Washington (from LA Clippers via Dallas and Oklahoma City)\n27. Minnesota\n28. Denver\n29. Utah (from Oklahoma City via Toronto and Indiana)\n30. Boston\nSecond Round\n31. Toronto (from Detroit via New York and LA Clippers)\n32. Utah (from Washington via Detroit and Brooklyn)\n33. Milwaukee (from Portland via Sacramento)\n34. Portland (from Charlotte via Denver, Oklahoma City and New Orleans)\n35. San Antonio\n36. Indiana (from Toronto via Philadelphia, LA Clippers and Memphis)\n37. Minnesota (from Memphis via Los Angeles Lakers, Washington and Oklahoma City)\n38. New York (from Utah)\n39. Memphis (from Brooklyn via Houston)\n40. Portland (from Atlanta)\n41. Philadelphia (from Chicago via Boston, San Antonio and New Orleans)\n42. Charlotte (from Houston via Oklahoma City)\n43. Miami\n44. Houston (from Golden State via Atlanta)\n45. Sacramento\n46. LA Clippers (from Indiana via Memphis and Milwaukee)\n47. Orlando\n48. San Antonio (from Los Angeles Lakers via Memphis)\n— Philadelphia (forfeited)\n49. Indiana (from Cleveland)\n50. Indiana (from New Orleans)\n51. Washington (from Phoenix)\n52. Golden State (from Milwaukee via Indiana)\n53. Detroit (from New York via Philadelphia and Charlotte)\n54. Boston (from Dallas via Sacramento)\n55. Los Angeles Lakers (from LA Clippers)\n56. Denver (from Minnesota via Oklahoma City)\n57. Memphis (from Oklahoma City via Houston and Atlanta)\n— Phoenix (from Denver via Orlando; forfeited by Phoenix)\n58. Dallas (from Boston via Charlotte)\nDid Bronny James enter the NBA Draft?\nBronny James might arguably be the most famous face entering the 2024 NBA Draft. The USC freshman is Los Angeles Lakers star LeBron James' eldest son.\nLeBron James, who is set to become an unrestricted free agent this summer for the first time since 2018, publicly stated he hopes to stay with the Lakers. He's also been outspoken about his desire to share the court with Bronny, leading some to believe the Lakers will use their No. 17 or No. 55 pick to draft the younger James.",
  "word_count": 1575,
  "scraped_at": "2026-02-14T02:25:33.959863",
  "_text_extracted": true
}