{
  "article_id": "bdaaf4fe04f7",
  "url": "https://www.teamtalk.com/newcastle-united/edie-howe-sack-newcastle-tipped-wield-axe-sunderland-fa-cup-upset-vastly-superior-claim-made",
  "title": "Eddie Howe sack : Newcastle tipped to wield axe if Sunderland cause FA Cup upset as  vastly superior  claim is made",
  "date": "20240105T163000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nEddie Howe sack: Newcastle tipped to wield axe if Sunderland cause FA Cup upset as ‘vastly superior’ claim is made\nNewcastle United are being backed to sack Eddie Howe if the Magpies suffer the ultimate humiliation and are beaten by Sunderland in Saturday’s eagerly-awaited FA Cup third-round tie at the Stadium of Light.\nThe Magpies have enjoyed a glorious time of things since the Englishman was appointed manager back in November 2021, with Newcastle, at the time, seemingly embroiled in a battle to stay in the Premier League. But Howe – aided by some truly shrewd transfer additions – breathed new life into the club, steering them to an 11th placed finish, before securing a hugely-impressive top-four place last season.\nHowever, this season has not going anywhere near to plan with Newcastle’s enormous progress seriously slowed up by a plethora of unfortunate injuries. That has left Howe’s squad on its knees and stretched to the limit.\nBut having lost eight of their last nine games (with the other game resulting in a 1-1 draw at Chelsea that ultimately resulted in their Carabao Cup elimination on penalties), pressure has really ramped up on Howe.\nTo that end, a worrying three-game warning was placed on Howe’s head amid fresh speculation linking former Man Utd and Chelsea boss Jose Mourinho with the Newcastle hotseat.\nThat speculation even stretched across the continent into Spain and well-known Spanish daily Marca believes the axe is hovering over Howe, with their information suggesting Newcastle were ‘looking seriously’ into replacing him with high-flying Girona boss Michel.\nNonetheless, Howe has moved to play down that his future at Newcastle is in some doubt and is adamant he retains the backing of the club’s ambitious owners PIF.\nCritically, Howe has also been given some much-needed support from local fanzine The Mag, who hold a strong voice on Newcastle United.\nREAD MORE ~ Ranking Premier League clubs by their wage bill in 2023/24: Newcastle make top 10\nHowe told he faces Newcastle sack if they lose to Sunderland\nHowever, the pressure remains firmly on Howe’s shoulders and, with their FA Cup tie against Sunderland looming large, the boss has been warned by former Black Cats striker Darren Bent that defeat on Wearside could prove his final act.\n“I don’t even think it would be from the supporters,” the former England man told talkSPORT. “I think the supporters understand they’re ahead of schedule and the job that he’s done has been fantastic.\n“But I think the owners have now had a taste of European football and they want to invest money into the squad – you can invest more money in the squad if you’re in the Champions League.\n“But if they start to drift away from Europe – which at the minute, they are – I think the owners might panic and go: ‘Enough’s enough, get someone else in’.”\nDespite that warning, Bent believes Newcastle supporters are still very much in Howe’s corner.\n“I don’t think the fans would turn on him yet, he’s got too much credit in the bank. But the owners will start looking at it. Every defeat that happens, the owners will start to go: ‘Hmm, something’s not right here’.”\nNewcastle are ‘vastly inferior’ to Sunderland\nWith Howe facing arguably one of his most-important ever matches as Newcastle boss, comparisons have been made to Ruud Gullit, who also fell on his sword as Magpies boss in the aftermath of a defeat to Sunderland.\nDaily Mirror journalist, Simon Bird, who is well ensconced in all things Newcastle, believes Howe’s job will be on the line if he suffers defeat.\n‘Reputations are on the line, and if Howe doesn’t get a win, I fear the hugely supportive narrative around him will change. There are already a wavering few, legitimately questioning tactics which have seen United opened up easily on the break in recent games,’ he wrote.\nStating his confidence that Newcastle will not suffer defeat, he claims Howe’s side are significantly better than their hosts, regardless of what side they put out.\nFurthermore, he believes that Howe can use the derby as a positive platform and will survive in the hotseat until the end of the season at least.\n‘I also think it is unlikely Newcastle will lose this one. They have a vastly superior first XI, and are more powerful.. They’ve got to smother Sunderland early on and get a quick goal,’ Bird continued.\n‘That would set up Howe for a revival after an awful two months including nine defeats in 13 games. A settling confidence booster ahead of tough games against Manchester City and Aston Villa.\n‘I’d expect Howe to get at least the season in charge. A top seven-finish is still very achievable, and that would be par for the course.\n‘Surely that would be good enough for him to stay much longer and reset, after a challenging campaign riddled with injury problems and extra games.\n‘The Saudi owners want to “be No.1” and will be pushing for progress, but also have to accept profit and sustainability rules hold back Newcastle’s rebuild, and football isn’t an exact science and has ups and downs.’\nNewcastle go into the match at Sunderland with their records in perfect balance. To date, Newcastle have won 53 times, having lost 53 times, while there has also been 49 draws between the fierce Tyne-Wear rivals.\nDON’T MISS: Newcastle transfer talks with Jobe Bellingham confirmed as Magpies continue to monitor star",
  "word_count": 914,
  "scraped_at": "2026-02-14T01:54:27.643993",
  "_text_extracted": true
}