{
  "article_id": "bdbec9891efe",
  "url": "https://www.fourfourtwo.com/features/goalkeepers-who-took-penalties",
  "title": "Goalkeepers who took penalties",
  "date": "20241022T100000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Goalkeepers who took penalties\nA look at some of the goalkeepers in the men's game who took penalties, either during match or in a shootout...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nGoalkeepers are usually better known for saving penalties than for scoring spot-kicks. But there have been some notable exceptions.\nAlthough less common these days, goalkeepers have sometimes been the first-choice penalty taker for their club side. Occasionally, even for their national team.\nAnd if not during the match itself, goalkeepers have more regularly been called upon to take a spot-kick in a penalty shootout. Sometimes, even to win the tie.\nHere, a look at some of the goalkeepers who took penalty kicks...\n17. Lucidio Sentimenti\nLucidio Sentimenti played for Juventus and Lazio in the 1940s and 1950s and won nine caps for the Italian national team.\nA goalkeeper who was an outfield player at youth level, Sentimenti was also an accomplished penalty taker and scored three spot-kicks in his Serie A career.\n16. Kepa Arrizabalaga\nKepa Arrizabalaga became the world's most expensive goalkeeper when he moved from Athletic Club to Chelsea for €80 million (£71.6m).\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAt the end of his first season at Chelsea, Kepa refused to be taken off ahead of a penalty shootout in the Carabao Cup final, which the Blues eventually lost to Manchester City. And in the 2022 Carabao Cup final against Liverpool, the Spanish goalkeeper was brought on for the shootout, but failed to save a single spot-kick and blasted his effort over the bar as the Reds won 11-10.\n15. Ederson\nEderson scored Manchester City's fifth penalty in the shootout as the Sky Blues beat Manchester United 7-6 to win the Community Shield in August 2024.\nThe Brazilian goalkeeper also converted in a shootout against Real Madrid in the Champions League quarter-finals in April 2024, but Pep Guardiola's side were edged out 4-3 on penalties by Los Blancos.\n14. Misael Alfaro\nOne of the highest-scoring goalkeepers in football history, Misael Alfaro scored 31 official goals across his club career, many of which were penalties, and has claimed that the true figure is actually higher.\nA four-time champion at club level, Alfaro also won 42 caps for El Salvador, but never scored a goal for the Central American nation.\n13. Vincent Enyeama\nVincent Enyeama scored the winning penalty for Nigeria against Zambia in a shootout in the quarter-finals of the 2010 Africa Cup of Nations after saving from Thomas Nyirenda.\nEnyeama, who won the AFCON with the Super Eagles in 2013, was also a penalty specialist for his club sides and netted 25 career goals in total.\n12. Kennedy Mweene\nKennedy Mweene won over 120 caps for Zambia between 2004 and 2021 and was in goal as the Copper Bullets won the 2012 Africa Cup of Nations.\nMweene netted 14 career goals overall, including 12 penalties. He also converted in a shootout as Zambia beat the Ivory Coast to win the Africa Cup of Nations final in 2012 and scored an equaliser against Nigeria in an AFCON group game the following year.\n11. Marko Dmitrović\nAfter several missed penalties in the 2020/21 season, Eibar turned to goalkeeper Marko Dmitrović for a spot-kick against Atlético Madrid.\nDmitrović stepped up and beat Jan Oblak in a 2-1 loss to Diego Simeone's side. After the game, coach José Luis Mendilibar said that Dmitrović would continue to take the penalties for the Basque club. But he only took one more, against Cádiz in March, and goalkeeper Jeremias Ledesma guessed right to parry the Serb's powerful kick.\n10. Hans-Jörg Butt\nHans-Jörg Butt played as a goalkeeper for Hamburg, Bayer Leverkusen and Bayer Munich in an impressive career which also saw him win four caps for Germany.\nAside from his shot-stopping abilities, Butt was also an excellent penalty taker and scored 26 of his 31 spot-kicks in the Bundesliga. No other goalkeeper has got anywhere near that record.\n9. Lionel Mpasi\nDR Congo's run to the semi-finals of the 2023 Africa Cup of Nations featured a thrilling 8-7 win over Egypt on penalties following a 1-1 draw in the last 16.\nWith the scores at 7-7, Egypt goalkeeper Gabaski crashed his penalty onto the top of the crossbar and over. And moments later, he was powerless to prevent the winning kick as Lionel Mpasi powered his spot-kick into the corner to seal victory for the Leopards.\n8. Ricardo\nRicardo played a pivotal part in Portugal's win on penalties against England in the quarter-finals of Euro 2004.\nThe former Sporting CP goalkeeper removed his gloves and saved Darius Vassell's spot-kick, before stepping up to power home the decisive penalty in a 6-5 shootout win.\n7. Gerónimo Rulli\nVillarreal and Manchester United drew 1-1 over 120 minutes in the 2021 Europa League final in Gdańsk and after all 20 outfield players scored their penalties in the shootout, it was the turn of the goalkeepers.\nGerónimo Rulli stepped up to convert his spot-kick and the Argentine then saved David de Gea's effort to win a first ever major trophy for Villarreal and a fourth Europa League title for coach Unai Emery.\n6. Johnny Vegas Fernández\nOne of the best Peruvian goalkeepers of his generation, Johnny Vegas Fernández was a regular in squads for the South American nation but won just three caps.\nA free-kick and penalty specialist, Vegas netted 45 goals in a 20-year career between 1997 and 2017, making him one of the highest-scoring goalkeepers in football history.\n5. Jorge Campos\nAn agile shot-stopper who relied on his speed, quick reflexes and anticipation to compensate for his small stature, Jorge Campos is one of Mexico's all-time great goalkeepers.\nCampos could also play a bit, spending a season up front at Pumas, and netted over 40 career goals. There were quite a few penalties among those, including a memorable spot-kick scored with the outside of his foot against Pumas' fierce rivals América.\n4. Dimitar Ivankov\nFormer Bulgarian number one Dimitar Ivankov netted 42 goals in his career, making him the sixth highest scoring goalkeeper of all time and the leading European.\nMany of those were penalties and in 2008, he scored two and saved three as Kayserispor beat Gençlerbirliği 11-10 in a shootout to win the Turkish Cup.\n3. José Luis Chilavert\nJosé Luis Chilavert was one of the best goalkeepers in the world at his peak and the Paraguayan was South American Footballer of the Year in 1996.\nChilavert scored over 60 career goals, with a record eight of those netted for Paraguay. Many of his strikes came from free-kicks and penalties – and he even netted in the shootout for Vélez Sarsfield as the Argentine side beat São Paulo in the final of the Copa Libertadores in 1994.\n2. René Higuita\nLegendary Colombian goalkeeper René Higuita was nicknamed El Loco (\"The Madman\") and was known for taking risks.\nHiguita regularly brought the ball out from the back when his team were struggling to create chances. He scored 43 career goals in total, including 35 penalties.\n1. Rogério Ceni\nRogério Ceni spent almost all of his career with São Paulo and was the club's set-piece taker between 1997 and 2015.\nThe former Brazil shot-stopper netted 129 times in that period, with many from the penalty spot, and is listed in the Guinness Book of Records as the goalkeeper with the most goals scored in professional football.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 1425,
  "scraped_at": "2026-02-14T01:51:57.642629",
  "_text_extracted": true
}