{
  "article_id": "bde940b8946e",
  "url": "https://tribune.com.pk/story/2573602/bayern-munich-extend-coach-kompanys-contract-until-2029",
  "title": "Bayern Munich extend coach Kompany contract until 2029",
  "date": "20251022T020000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Munich extend coach Kompany's contract until 2029\nThe Belgian coach has guided the club to 11 wins in 11 matches across all competitions\nVincent Kompany has extended his contract as coach of Bayern Munich by two years until 2029, the Bundesliga champions announced on Tuesday.\nKompany was not Bayern's first choice when he was appointed in the summer of 2024, but the Belgian reclaimed the German title for the Bavarians in his debut season at the club.\n\"It feels like I've been here a lot longer and that I know the club well,\" former Manchester City captain Kompany said in a statement.\n\"It's been a great experience so far. We've started on a wonderful journey. Let's keep working hard and celebrate much more success!\"\nAt a press conference later on Tuesday ahead of Bayern's Champions League home match against Club Brugge a day later, Kompany said he was \"busy preparing for the games\" when Bayern bosses approached him about an extension.\n\"When the proposal came up, and my only request was that it doesn't become a big topic and that we could quickly refocus on the next game.\n\"Personally, everything just feels right in Munich... There aren't many places better than Bayern.\"\nBayern defender Jonathan Tah told reporters: \"we're all delighted about the contract extension.\"\nThe 39-year-old coach has Bayern flying with 11 wins in 11 games this season, sitting atop the Champions League and Bundesliga tables.\n\"Vincent Kompany has brought the fun back to FC Bayern -- and the spark has really caught on. Under his leadership, a real team has grown that plays dominant and attractive football,\" Bayern CEO Jan-Christian Dreesen said.\n\"I like Vincent's level-headedness. He never pushes himself into the limelight and makes our players better with his meticulous work.\"\nKompany's appointment came as a surprise when Bayern paid a £10 million ($13 million) to release him from his contract with Burnley in 2024.\n\"When we appointed Vinny, we had a clear vision of our shared path and he quickly proved that he would help FC Bayern move forward -- both on and off the pitch,\" said Max Eberl, the club's sporting director.\n\"He's a role model who unites players, fans and everyone at the club, and we want to build something long-term with him.\"\nUnder Kompany, Burnley won promotion to the Premier League but were relegated after just one season, recording the lowest top-flight points tally in their history.\nDespite winning 12 of the previous 13 Bundesliga titles, stability in the Bayern dugout has been rare during that run.\nPep Guardiola, whose three-year stint at the club ended in 2016, was the last Bayern coach to complete at least two full seasons.\nBefore bringing Kompany to the club, Bayern reportedly tried to sign Xabi Alonso, Julian Nagelsmann, Oliver Glasner and Ralf Rangnick but were knocked back by each candidate.\nWhen an attempt to hold on to then coach Thomas Tuchel, who had already agreed to leave at the end of the season, was also rebuffed, Bayern turned to Kompany.\nKompany confirmed on Tuesday that Serge Gnabry and Josip Stanisic would be out for Wednesday's match with Brugge.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 547,
  "scraped_at": "2026-02-14T02:26:56.608096",
  "_text_extracted": true
}