{
  "article_id": "bdf95d865a97",
  "url": "https://www.bbc.com/sport/football/articles/c5y0p4y80wjo",
  "title": "Premier League :  Little Messi ,  The Spider  and  The Little Engine  - 21 wildcard players to watch",
  "date": "20250813T074500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wildcards, breakouts and new faces - 22 Premier League players to watch\n- Published\nYou already know about the Premier League's established superstars but what about the wildcards who might make a name for themselves this season?\nWhether they are new and recent signings, late bloomers or exciting young academy talents, we are talking about the less familiar faces of all ages who are hoping for a breakout campaign.\nHere, BBC Sport's TV and radio commentators pick 22 players who will be worth watching out for in the next few months - and a manager who may surprise a few people too.\n1. Estevao Willian - Chelsea\nAge: 18 Position: Winger Country: Brazil\nConor McNamara: I commentated on Estevao's debut for Chelsea against Bayer Leverkusen last week and the kid is a star.\nHe showed an excellent poachers' instinct to score his first goal in Chelsea blue, reacting well after Cole Palmer's shot had come back off the crossbar - but Estevao's game is all about running with the ball at high speed.\nHe only turned 18 in April, but the Brazilian looks the real deal.\nIt's early days of course, but he already seems to have a telepathy with Palmer - when the England international backheeled the ball on the edge of the area against Leverkusen, Estevao knew it was coming and got his shot away.\nMark Scott: I'm commentating at the Bridge on Sunday and Estevao is the player I'm most excited about seeing.\nRegarded by many as the biggest talent to come out of Brazil since Vinicius Junior, he gave Chelsea fans a taste of his ability with a cracker against them at the Club World Cup, and has since impressed in a blue shirt with a sparkling showing in the friendly win over Leverkusen.\nThat electric performance showcased the abilities that have led to all the hype - immense quality on the ball and extreme confidence and flair driving at defenders with it.\nEstevao is versatile as well, able to play on either flank or as a number 10. Chelsea's plan was to ease him in gradually, but they might have to re-think that...\n2. Joel Piroe - Leeds United\nAge: 26 Position: Striker Country: Netherlands\nGuy Mowbray: The very definition of a wildcard, given that he can look like he can do it all AND the total opposite - sometimes within the same game.\nI've a feeling Leeds will have brought in a new striker to start ahead of him before the big kick-off, but I wouldn't be surprised to see him come on as an impact sub to get them a point or two early in the season.\n3. Cristhian Mosquera - Arsenal\nAge: 21 Position: Centre-back Country: Spain\nJames Fielden: All of my picks come from the Uefa age-group championships that I covered in the summer and Mosquera looked largely untroubled throughout at the Under-21s tournament in Slovakia.\nA front foot and aggressive defender when need be, he was extremely confident stepping forward and helping in attack. With recovery pace to help in rare situations of Spanish panic, he sounds like Mikel Arteta's kind of player.\nWhether he can dislodge the established elite at Emirates Stadium is another matter, but Arsenal have had injury issues in the middle of defence, and he's only missed three games for Valencia over the last two seasons. For a reported fee of £13m, he looks to be a low risk and potentially high reward acquisition.\n4. Dan Ndoye - Nottingham Forest\nAge: 24 Position: Forward or winger Country: Switzerland\nSteve Bower: Dan Ndoye is new to the Premier League and could be another shrewd piece of business from Nottingham Forest.\nHe first came to my attention in the Europa Conference League for Basel and subsequently on to the Champions League with Bologna.\nI've also covered a fair bit of Switzerland for BBC Sport at the last two major tournaments and he has steadily grown into a crucial player for his country.\nAfter the departure of Anthony Elanga, Ndoye looks an exciting replacement for Forest fans. At 24, he has good experience and looks ready for the Premier League.\n5. El Hadji Malick Diouf - West Ham\nAge: 20 Position: Left-back or left wing-back Country: Senegal\nIan Dennis: There were a number of Senegal players who caught the eye when they beat England at the City Ground in June but none more so than El Hadji Malick Diouf.\nDuring my commentary for 5 Live that night I'd mentioned interest from Brighton and Hove Albion so I'm not surprised to see him in the Premier League and West Ham have a real gem.\nDiouf can play as a left-back or a wing-back, has an ability to get up and down. He is a dynamic player with excellent crossing ability and somebody who will offer a real threat in an attacking sense.\nHe scored seven goals for Slavia Prague last season and I think he will become a real crowd favourite at West Ham.\n6. Emmanuel Agbadou - Wolves\nAge: 28 Position: Centre-back Country: Ivory Coast\nTom Gayle: For me, Emmanuel Agbadou was one of the Premier League's best signings during the January transfer window. Wolves had to strengthen defensively and, in the Ivorian, they managed to more than fulfil the need for a top-quality centre-half vacated by Max Kilman's departure five months earlier.\nAgbadou's reading of the game and positioning, combined with a heavyweight boxer build and the athleticism of a gymnast, made him one of the league's toughest opponents in a one-v-one situation.\nWhat also stood out was his confidence. Inside his own box he can happily receive the ball and turn while under pressure, spray long-range passes, and drive with possession way past the halfway line. This nonchalant style helped enable Pereira's side to play much more aggressively over the second half of the campaign.\nHis transition to the English top flight is a sharp poke in the eye to anyone who continues to view Ligue 1 as a 'Farmer's League'. I'm convinced the Agbadou fan club will only grow bigger this season, especially if he continues taking goal-kicks, helping conjure 'proper Sunday league' vibes.\n7. Simon Adingra - Sunderland\nAge: 23 Position: Winger Country: Ivory Coast\nJonathan Pearce: I wish Simon Adingra well at Sunderland. This talented Ivorian had a really good first season at Brighton, famously scoring at Ajax to send the travelling fans there into delirium.\nHe started last season well too, with four goals in his first eight games, but then the confidence in his tricky dribbling fell away. He seemed to be trying almost too hard to hold off the challenge from Yankuba Minteh for his place and performances suffered.\nI hope Sunderland fans are excited by him. £18m is not a lot for a player who deserves to succeed in his fresh start\n8. Jhon Arias - Wolves\nAge: 27 Position: Winger or attacking midfielder Country: Colombia\nConor McNamara: I was in the United States for the Club World Cup and Jhon Arias was one of the standout players of the tournament as he played his final games for his old club Fluminense, picking up three player-of-the-match awards.\nHe is 27, so should be at his peak, old enough to not be overawed by the Premier League stage.\nThe Colombian will take the No.10 shirt vacated by Matheus Cunha. He scored his first goal in Wolves' colours in a recent friendly against Girona showing excellent dribbling skills to run deep into the penalty area before shooting from close range.\nArias is my top tip of this summer's new signings to be a big hit.\n9. Diego Coppola - Brighton\nAge: 21 Position: Centre-back Country: Italy\nJames Fielden: I saw Coppola play twice at the European Under-21 Championship in the summer and it was against Spain and Germany, so good games to judge him against top teams.\nBrighton had clearly done their homework previous to the Euros with the deal announced mid-competition, and you can see why they're ready to drop him into their evolving backline.\nStrong and commanding in the middle, Coppola was also keen to play out over short and long distances and that, along with other metrics clearly impressed the Seagulls.\n10. Romain Esse - Crystal Palace\nAge: 20 Position: Midfield Country: England\nMark Scott: There was a buzz when Palace made Romain Esse their latest youthful acquisition from the Championship in January. That excitement grew after he bagged his first Premier League goal 25 seconds into his debut, but game time proved limited after that.\nIt's tough to dislodge Eberechi Eze and Ismaila Sarr in attack, but Esse showed while he was at Millwall how good he can be at both taking on opponents and crossing, as well as cutting in and getting a shot away.\nShould Palace get through their Conference League play-off, the extra games in Europe will afford him more opportunities to display those attributes.\n11. Harry Howell - Brighton\nAge: 17 Position: Midfield Country: England\nGuy Mowbray: I must confess to never having seen him play... but he's a name that's been mentioned to me by quite a few people this summer - some of whom I consider to be VERY good judges!\nAs was once said about another teenager, external who made his mark on the Premier League - \"remember the name\".\nJonathan Pearce: Brighton fans will be praying that Carlos Baleba stays put and that Yankuba Minteh continues his dramatic improvement. But there's another youngster ready to leap off the Amex talent conveyor belt.\nI was mightily impressed by Howell's cameo debut in the penultimate game of last season. He helped win the game with his front foot, fearless, direct running at the opposition.\nHis cousin Jack Hinshelwood had a big breakthrough season last time around - 2025-26 could be the year for Harry.\n12. Jair Cunha - Nottingham Forest\nAge: 20 Position: Centre-back Country: Brazil\nConor McNamara: Jair Cunha was another player that I saw in action this summer at the Club World Cup. He's 6ft 6in but is strong as well as tall - he is huge for a 20-year-old.\nCunha used his height to score a header for Botafago against Seattle Sounders, but it was his defensive calmness that caught the eye that day, even more than the goal he scored. He's very comfortable taking the ball down and controlling it in tight spaces where others would just boot it clear.\nLogic tells us that he should be raw, because he has played so little senior football in his short career so far - only 46 games so far - but this guy has a real presence about him. He was a key player in the Brazil team that won the Under-20 South American Championship this year.\n13. Max Dowman - Arsenal\nAge: 15 Position: Midfielder Country: England\nIan Dennis: I can't wait to see Arsenal's Max Dowman in the flesh because the last time I heard such a buzz around a youngster was Wayne Rooney.\nI speak to a lot of scouts and I have heard rave reviews for a while about this 'gifted' attacking midfielder.\nSo much so, I spoke with Gunners midfielder Declan Rice about him last season, who at the time claimed \"Max is the best 15-year-old in the country\".\nIt was March when I sat down with Rice, who said at the time he has been inundated with great reviews about the teenager, explaining: \"I've had so many texts about Max recently where people have watched him and are saying \"wow, what a talent\".\nDowman doesn't turn 16 until 31 December but sounds the real deal.\nJames Fielden: Maybe not an original hot take that Dowman is going to be much talked about in years to come, but even having seen him play at the Uefa European Under-17 Championship this summer you can see why he'll cause teams no end of problems wherever he plays off the front line.\nOne of a growing number of English players who glide across the field with grace that we've maybe not been used to seeing over the last couple of decades, it'll be interesting to see what Arteta has planned for him, firstly in terms of game time beyond the domestic cups and also, the position in which he'll be deployed.\nLet's hope he fulfils his potential and is managed carefully at domestic and international level.\n14. Habib Diarra - Sunderland\nAge: 21 Position: Midfielder Country: Senegal\nGuy Mowbray: Can a club record signing be classed as a 'wildcard'? Well, given that Diarra will be new to most Premier League watchers, I'm putting him in that bracket.\nOnly 21, the midfielder - who Sunderland beat Leeds to sign - captained Strasbourg to European qualification last season, before scoring one of Senegal's three goals against England at the City Ground in June.\nHis quality stood out when I went to watch Sunderland's pre-season game against Sporting last month.\n15. Rio Ngumoha - Liverpool\nAge: 16 Position: Winger Country: England\nSteve Bower: A few people within academy football told me about Rio Ngumoha over a year ago - tales of Chelsea's anger at losing the teenager, and a big gain for Liverpool.\nArne Slot's positive approach was immediate in involving him in first-team training and then we saw him become the youngest player to start a game for the club in January in the FA Cup.\nHe's not 17 until the end of August but I know internally there's huge excitement about him, and his goals in pre-season have heightened this.\nSometimes a young player sees an opportunity and, with Luis Diaz's departure, Ngumoha looks set to be in the first-team group throughout the season.\nConor McNamara: Back in January I commentated for Match Of The Day when Ngumoha became the youngest player to start a match for Liverpool - aged 16 years and 135 days old - in the 4-0 win over Accrington in the FA Cup.\nTo make us all feel old, the song that was No.1 in the charts the day he was born was Katy Perry's 'I Kissed A Girl'!\nAt the time he was so unknown that I needed Slot to help me pronounce his name correctly.\nBut that FA Cup appearance was his only first-team game and he never made the bench for a Premier League match through to the end of the campaign.\nHis form this pre-season suggests that should change this term. He is still very young and we know that competition for places will be severe at Anfield, but Ngumoha has a spark about him.\n16. Thierno Barry - Everton\nAge: 22 Position: Striker Country: France\nGuy Mowbray: Having checked his numbers and seen a few clips online, I'm really hoping he can make a big - and quick - impact for Everton.\nHe'll be raw certainly, but the talent is undoubtedly there for David Moyes to work with.\nIt's about time Everton had a strong centre-forward who can consistently deliver again. Dixie Dean, Tommy Lawton, Joe Royle, Bob Latchford, Andy Gray, Duncan Ferguson... Thierno Barry?\nAnd if he doesn't fire - how about Beto to step up as a bit of a wildcard himself?!\n17. Josh King - Fulham\nAge: 18 Position: Midfield Country: England\nTom Gayle: The time feels right for Fulham to release the handbrake from underneath Josh King. As I wrote back in February, the club has a history of struggling to keep hold of prodigious talents, so it's no surprise to see they've employed a more cautious, drip-feed approach when it comes to his development and exposure to first-team action.\nReading between the lines, the fact King signed a new long-term deal in July, his second contract agreement in the space of just over 18 months, says or in fact screams to me that a) there has been interest from other teams, and b) Fulham believe he is 'Premier League ready'.\nSecuring top-flight game time won't be easy, though. Right here and now, the experience of both Andreas Pereira and club record signing Emile Smith Rowe, means they have a far greater claim to the number 10 position than the teenager.\nStill, I have no doubt assurances will have been made to King regarding a significant increase in Premier League minutes over the coming year. Manager Marco Silva knows their demanding schedule will inevitably lead to the youngster being granted a 'next man up' moment. Given his impressive cameos to date, I expect King to flourish when given an opportunity.\n18. Jaka Bijol - Leeds United\nAge: 26 Position: Centre-back Country: Slovenia\nConor McNamara: Leeds' new centre-back from Udinese is a very interesting signing. I've been wondering for a few years now why a Champions League club has not snapped him up.\nHis one failing seems to be a tendency to mis-time lunging tackles, something he will need to get right in the cut and thrust of the Premier League, but otherwise he appears to have all the attributes - very strong in the air, mobile, and able to ping an accurate long-range pass.\nI commentated on several of his games for Slovenia at last summer's Euros in Germany, and he did really well in games against strikers such as Harry Kane, Rasmus Hojlund, Alexander Mitrovic, and Cristiano Ronaldo - none of them scored in their games against Bijol during the tournament.\n19. Harrison Armstrong - Everton\nAge: 18 Position: Midfield Country: England\nSteve Bower: Given Everton's frustrations in the summer market, Blues fans are hoping one of their own has an opportunity to make an impact.\nI saw Harrison Armstrong start at Goodison in the FA Cup win over Peterborough in January before a productive loan spell in the championship with Derby. Still only 18, he offers versatility in the attacking positions.\nHe'll have to be patient but he'll be hoping to follow the likes of Ross Barkley and Anthony Gordon in taking his opportunity when it arises.\n20. Charalampos Kostoulas - Brighton\nAge: 18 Position: Forward Country: Greece\nMark Scott: Brighton's track history of buying low and selling high is the envy of city traders, but their £30m outlay on Charalampos Kostoulas is the second most they've ever spent on a player.\nThe Seagulls rarely get it wrong though and haven't blinked at splashing that much on an 18-year-old with just a season of senior football behind him.\nHe's shown versatility having impressed as a number nine at academy level, before switching successfully to a second striker role once he made the first team at Olympiakos.\nHis physicality has also caught the eye, with one of his former coaches saying the strength he has for his age is \"extraordinary\". Maybe he'll turn out to be yet another Brighton bargain.\n21. Justin Devenny - Crystal Palace\nAge: 21 Position: Midfield Country: Northern Ireland\nJonathan Pearce: Jason Devenny caught my eye the minute I saw him in Palace's 2-2 draw at Aston Villa last November. It was only his second game. He scored, but more than that he wanted the ball. He was hungry to make an impact.\nHe certainly did that with the winning Community Shield shootout penalty against Liverpool last Sunday. He'll never forget that and I've a feeling he'll have a big season.\n22. Enzo le Fee - Sunderland\nAge: 25 Position: Midfield Country: France\nSteven Wyeth: Sunderland's 2025 business throws up plenty of 'ones to watch' and January loan arrival Enzo le Fee certainly has the attributes to succeed in the Premier League, with the added motivation of a point to prove.\nIt is just over a year since Roma parted with good money to sign Le Fee on the back of his performances in France for Rennes and Lorient. An early season injury, and managerial instability that surfaced while he was sidelined, were significant in what became a transient spell in the Eternal City.\nNow a talent who thrives on creative responsibilities gets another shot in one of Europe's major leagues, and this time under the tutelage of a manager, Regis le Bris, who previously guided him through the ranks at Lorient.\nAnd a manager... Keith Andrews - Brentford\nConor McNamara: Obviously no longer a player, but I would still put Keith in the 'wildcard' category.\nSure, his appointment has raised plenty of eyebrows but I have worked regularly with him as a co-commentator in the past for Irish TV.\nHis enthusiasm and way with words really impresses me. Because I know him from work, in recent seasons my eye would be drawn towards him before games when Sheffield United or Brentford were warming up and, although an assistant at the time, he always seemed to be at the heart of everything and constantly communicating with the players.\nThe owners at Brentford have earned a reputation for making good decisions, and they will not have made this one rashly. They have seen him up close, and will have heard the feedback of a squad who enjoy his methods.\nSo many high-profile managers have crashed out in their first Premier League job so it certainly is not easy. But I'll be hoping that Andrews gets off to a really good start.\n- Published16 August 2025",
  "word_count": 3534,
  "scraped_at": "2026-02-14T01:52:36.776850",
  "_text_extracted": true
}