{
  "article_id": "bdfdfcd2e2b8",
  "url": "https://theathletic.com/4575317/2023/06/14/chelsea-transfer-nkunku-lavia-sales/",
  "title": "Chelsea transfer window : Nkunku coming , Lavia interest – but sales a priority",
  "date": "20230614T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Another transfer window is upon us, and its official opening today (Wednesday) means we’re all going to be hearing a lot about Chelsea in the coming weeks — both when it comes to potential signings and looming departures.\nThe club’s ownership, led by Todd Boehly and Behdad Eghbali, will continue to be aggressive in the market despite their massive recruitment drive over their first year in charge yielding a humiliating 12th-place finish in the 2022-23 Premier League, while the number of players leaving Stamford Bridge before the window shuts for most major footballing countries on September 1 (though in some leagues it stays open longer) is expected to hit double figures.\nAdvertisement\nHere, The Athletic outlines the positions Chelsea are looking to strengthen over the next couple of months and details some of the players they have been tracking, and highlights those most likely to be saying their goodbyes…\nLast three transfer window spends\nJanuary 2023: £283million (Enzo Fernandez, Mykhailo Mudryk, Benoit Badiashile, Noni Madueke, Malo Gusto, Andrey Santos and David Datro Fofana arrived permanently, and Joao Felix joined on loan)\nSummer 2022: £242million (Wesley Fofana, Marc Cucurella, Raheem Sterling, Kalidou Koulibaly, Carney Chukwuemeka, Pierre-Emerick Aubameyang and Gabriel Slonina arrived permanently; Denis Zakaria signed on loan)\nJanuary 2022: (Pre-takeover) Zero.\nHow much money is likely to be available this summer?\nAfter back-to-back windows of huge spending and a disastrous season that ended in failure to secure any sort of European football for 2023-24, Boehly and Eghbali know Chelsea’s ability to recruit further this summer will be dictated in large part by how successful they are in trimming a bloated first-team squad through significant player sales.\nIndeed, some outgoing deals may well need to be finalised before June 30 in order to be included in the club’s accounts for last season for financial fair play (FFP) compliance purposes.\nPotential buying clubs will likely feel these added pressures give them considerable leverage in negotiations with Chelsea, but Boehly and Eghbali are confident there will be sufficient options in the market for them to generate the income they need.\nThey will be selling not just to offset past spending but also to fund signings in this window; while a new young core is now in place at Stamford Bridge, there are still areas to strengthen.\nWho makes the key decision over signings?\nCo-sporting directors Laurence Stewart and Paul Winstanley have been empowered to run Chelsea’s recruitment operation, though Boehly and Eghbali remain actively-engaged owners. Below them sits a growing team of talented recruitment specialists that includes technical director Christopher Vivell, co-director of recruitment and talent Joe Shields, lead data analyst Matt Hallam and, as of next month, former Stoke City head of football operations Andy Cousins.\nAdvertisement\nThe idea is that the process of identifying and recruiting talent will be collaborative, with all of the above individuals feeding into it.\nIncoming head coach Mauricio Pochettino is already a big voice in the conversation, too — particularly when it comes to prioritising the targeting of certain positions and profiles of player, in order to equip the squad for his preferred style of football.\nGO DEEPER\nMauricio Pochettino and Chelsea: Why will he start work in July, and what awaits at Stamford Bridge?\nWhich positions are the priority?\nChelsea know they need a more defensive-minded central midfielder to pair with record signing Fernandez, either in Pochettino’s preferred 4-2-3-1 formation or in a 4-3-3. Caretaker manager Frank Lampard admitted last month that the squad lacked a player suited to operating as a lone No 6 in the wake of Jorginho’s winter-window move to Arsenal.\nGiven this season’s historically-bad goalscoring issues, an elite No 9 is desired too, though how hard Chelsea push on that front is likely to be influenced by whether Romelu Lukaku can be persuaded to give his career with them another go following a season on loan back at Inter Milan. One source, speaking anonymously to The Athletic to protect relationships, believes the Belgium international has already ruled out trying again Stamford Bridge and would even be prepared to take a pay cut if that meant he was able somehow to stay at Inter. Saudi Arabia team Al-Hilal have also had a long-standing interest in the now 30-year-old.\nMeanwhile, Chelsea are also mindful that France forward Christopher Nkunku, who is joining them from RB Leipzig this summer, can operate as a striker.\nGO DEEPER\nChelsea have signed a gem in Christopher Nkunku - now they must maximise his talents\nThe other key position ideally circled for improvement is goalkeeper, where Edouard Mendy lost his confidence and his starting spot last season and Kepa Arrizabalaga is still not fully trusted, despite regaining that No 1 position and performing solidly for stretches during 2022-23.\nAdvertisement\nWho are known or plausible targets?\nIn central midfield, Chelsea are stepping up their long-term interest in Southampton midfielder Romeo Lavia. They wanted Manuel Ugarte of Sporting Lisbon, but Paris Saint-Germain appear to have won the race to sign the 22-year-old Uruguayan. Crucially, and this may be an obstacle for Chelsea in their pursuit of other players too, PSG can offer mutual targets Champions League football next season.\nLavia’s value has been somewhat set by Manchester City having a £40million ($50.3m) buyback clause they can exercise in 2024, which was included as part of the deal which saw the now 19-year-old leave them for Southampton last summer. Despite now being a Championship club, relegated Southampton are reluctant to sell Lavia in this window unless they receive an offer in the region of £50million. Chelsea, if they proceed with this one, will obviously look to pay less than that.\nIdeally, the club want to add two midfielders to the squad and remain very keen on Brighton’s Moises Caicedo. They could well make another move for him if they generate enough money from midfield outgoings. Caicedo will cost considerably more than Lavia, with Brighton valuing him at over £70million. Arsenal and Newcastle United are among the other Premier League clubs who have been linked with him, but Manchester United are perceived to be a bigger threat. As with PSG, all three can put Champions League football next season on the table.\nFormer Cobham academy boy Declan Rice has been a target for the previous and current owners, but the West Ham captain is much likelier to join Arsenal than return to Chelsea.\nThey like Napoli’s prolific striker Victor Osimhen, but so does every other top European club in search of an elite No 9. Dusan Vlahovic is also on the radar and might be more attainable, due to Juventus’ financial issues. Inter’s Lautaro Martinez would not come cheap, while any move to reunite Harry Kane with his former Spurs boss Pochettino would be a non-starter as chairman Daniel Levy would never sell the England captain to one of Tottenham’s bitterest rivals.\nChelsea were considering re-signing Tammy Abraham from Roma, but the serious knee injury he suffered in their season finale just over a week ago has removed him from the equation. Elsewhere in Serie A, Atalanta’s Rasmus Hojlund has been monitored but, at 20, more constitutes potential than the finished article at this point. Chelsea have also been linked with an audacious move for Neymar, whose position at PSG is in doubt.\nGO DEEPER\n50 to watch - Hojlund: Atalanta's striker is on the rise - just don't compare him to Haaland\nOne possible high-profile acquisition at academy level to be aware of is Arsenal’s Ethan Nwaneri. The attacking midfielder became the Premier League’s youngest player when he came on as a substitute against Brentford last September aged 15 years and 181 days. His schoolboy registration ends this month and there are serious doubts he will sign a new deal at Arsenal. Chelsea are competing with Manchester City in particular for his services, while Manchester United are also in the hunt.\nAdvertisement\nWhen it comes to goalkeepers, Andre Onana could be available this summer despite Inter’s surprise run to the Champions League final. Chelsea have also looked at David Raya, whom west London neighbours Brentford are preparing to sell before he can become a free agent in the summer of 2024. Spurs are trying to strike a deal for him early in the window.\nAC Milan’s Mike Maignan is admired, but the 27-year-old would be very expensive. Valencia’s Giorgi Mamardashvili, 22, is another who has been watched closely despite their struggles in La Liga last season. Much, though, will depend upon budget and the club’s ability to shift Kepa off the books.\nWho is an outside name to keep an eye on?\nStaying on the subject of ’keepers, Brighton’s former No 1 Robert Sanchez would be a cheaper alternative to the names above and is highly regarded by Chelsea’s goalkeeping coach Ben Roberts from several years working together at the south coast club. Relegated Leeds’ Illan Meslier is also a contender, but is lower down on the pecking order.\nWho could be heading out?\nIt might be easier to list the players who are definitely staying.\nThe club will listen to offers for virtually everyone bar the signings made in the last two windows, although even one or two of those — namely Aubameyang and Koulibaly — are already considered among the most expendable squad members for this window.\nChelsea are looking to recoup as much as possible of the €14million (£12m; $15m) fee paid to Barcelona for striker Aubameyang last September and do not want to let him leave on a free transfer. They have already rejected a bid from Galatasaray, the newly-crowned Turkish champions. Inter see the former Arsenal striker, who turns 34 this week, as a potential replacement for Lukaku or Martinez, should either leave. There is also hope at Stamford Bridge that one of the Saudi Arabian clubs will make a bid.\nGO DEEPER\nSaudi Arabia, football's big disruptors. The story of the money, the motive and the hidden disputes\nMason Mount is leaning towards joining Manchester United if they make an acceptable offer (though the clubs’ valuations are significantly apart at present), while fellow midfielder Mateo Kovacic is nearing a move to Manchester City.\nAdvertisement\nMendy is also expected to leave in search of more regular first-team football and has switched agents in the hope that will help him find another club. Aston Villa are one of the clubs keeping an eye on that situation amid doubts over 2022 World Cup winner Emiliano Martinez’s future. There is a real prospect of N’Golo Kante departing as a free agent, having held talks with Saudi champions Al Ittihad, while club captain Cesar Azpilicueta, who turns 34 in August, may now get to return to his native Spain a year after seeing a transfer to Barcelona blocked.\nBoehly and Eghbali are particularly keen to unload some of the more expensive contracts sanctioned by previous owner Roman Abramovich as they seek to bring down the wage bill. Christian Pulisic, Hakim Ziyech and Kepa headline that particular list, though finding a willing buyer for the latter will not be easy despite his career revival last season.\nThe fear among some Chelsea supporters is that graduates from the club’s academy may be the ones sold in the efforts to offset the new ownership’s spending spree last season — beyond Mount, Conor Gallagher remains one of the most saleable assets in the squad and fellow midfielder Ruben Loftus-Cheek appeared to be saying goodbye to Stamford Bridge on the final day of the Premier League season against Newcastle United amid interest from AC Milan.\nDefender Trevoh Chalobah is being monitored by Champions League runners-up Inter, though he wants to stay to fight for his place. Brighton would like to sign centre-back Levi Colwill permanently after a productive season on loan, though Chelsea have so far insisted he is not for sale, rejecting an initial bid worth £30million. Brighton are expected to come back with an improved offer in the region of £40million — but even if they don’t there is interest in the 20-year-old from elsewhere in the Premier League.\nCallum Hudson-Odoi, who spent last season on loan at Bayer Leverkusen in Germany but saw little action in 2023, has just 12 months left on his contract and is under consideration by several clubs. The 22-year-old England forward will probably have to accept a cut to his £120,000 a week Chelsea salary to go elsewhere.\nGO DEEPER\nChelsea's season review: Good riddance to 2022-23\n(Top photos: Getty Images)",
  "word_count": 2073,
  "scraped_at": "2026-02-14T02:00:19.978106",
  "_text_extracted": true
}