{
  "article_id": "be2cd189dbcb",
  "url": "https://www.dailynews.com/2023/04/16/lafc-holds-on-to-defeat-rival-galaxy-in-first-meeting-of-season/",
  "title": "LAFC holds on to defeat rival Galaxy in first meeting of season",
  "date": "20230417T024500Z",
  "domain": "dailynews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CARSON — In a brief stretch of the second half, the Los Angeles Football Club turned Sunday’s El Trafico meeting against the Galaxy around.\nWith the game tied 1-1, Carlos Vela stepped up and converted a penalty in the 68th minute and two minutes later Ryan Hollingshead banged in a header off of a corner kick for a two-goal lead on the way to a 3-2 win in front of 25,174 at Dignity Health Sports Park.\nThe win was the first for LAFC in the series at Dignity Health Sports Park. Including last season’s U.S. Open Cup, the Galaxy had a 6-0-2 record in home games against LAFC.\n“On the inside I am very, very happy and proud,” LAFC coach Steve Cherundolo said. “But the coach in me and the ex-pro in me is a little frustrated by the performance tonight for many reasons, but we’ll work through it. We are very happy at putting three points in our back pocket.\n“It wasn’t our best performance and we found a way to win … this team knows how to win and that’s a huge, huge advantage.”\nLAFC (5-0-2, 17 points) is the lone unbeaten team remaining in MLS. The Galaxy on the other hand is one of two winless teams (0-4-3, three points) remaining.\nThe Galaxy sent the game into halftime tied at 1-1 thanks to Tyler Boyd’s wonder-strike from approximately 30 yards that hit off the fingertips of LAFC goalkeeper John McCarthy and into the goal.\nMidway through the second half, two moments of self-inflicted mistakes turned the game. The first came on a throw-in as Raheem Edwards sent the ball to Sega Coulilbaly, who not only had just entered as a sub, but was standing in his own 18-yard box. LAFC’s Jose Cifuentes went for the ball and was brought down by Coulilbaly and referee Armando Villarreal pointed to the penalty spot.\nAfter Vela converted, minutes later the Galaxy failed to handle a corner kick that Hollingshead put away for a 3-1 lead.\n“I thought the game was a little bit of stalemate in the beginning of the second half,” Galaxy coach Greg Vanney said. “We were starting to look at ways to pick up the speed and the intensity and then in the course of two minutes (in the second half), we made two colossal mistakes.”\nTrailing 3-1 in recent El Traficos, usually meant that things were about to get interesting and that’s what happened. Mark Delgado got on the end of a cross for a tap-in and goal in the 84th minute to make it 3-2 and as the fourth official put up eight minutes of stoppage time, the possibility of an seemed to ignite the Galaxy fans in attendance.\n“Javy (Javier Hernandez) had a great chance or two, Riqui (Puig) hit one off the post, Lucas (Calegari) hits a nice shot that the keeper makes a good save,” Vanney said. “Even after all of that, we still had our chances to put ourselves right back in the game or get something out of it.”\nHowever, in the end, it would be LAFC’s day. The teams will meet again July 4 at the Rose Bowl and Sept. 16 at BMO Stadium.\n“It feels great,” Vela said of the win. “I feel like we showed many times we are better than them but for some reason anytime we went here it was a crazy start.\n“In the end we played many games against them … So I hope after this one we can win more often here and show every time we play against LA Galaxy, we’re the team of the city and that’s what we are doing.”\nVela opened the scoring in the 22nd minute with a left-footed shot that curled out of the reach of Galaxy goalkeeper Jonathan Klinsmann.\nThat’s where the game remained until Boyd’s goal.\n“We did more mistakes than them and that’s why they won,” Hernandez said. “We tried to fight back …the players that came in made a difference, but like I said we played we way better than them, but as well, we did more mistakes than them.”\nThe rivals entered the game as further apart in all phases as they could possibly be. LAFC, the defending MLS Cup champion, was unbeaten in six league games and has made its way to the semifinals of the CONCACAF Champions League.\nThe Galaxy, on the other hand, was winless in its first six games, all while trying to manage a supporters’ group boycott against the front office, an impending summer window transfer ban and still trying to fill out the roster.\n“It’s frustrating, guys are disappointed, they believe in what they’re doing, which is the most important thing,” Vanney said. “Ultimately we’re in a results-oriented business, so those are the things that give you really the emotion that you really want to go home with, whether you’re fans, or players or anyone, you want the emotion of winning the game. I know they believe that in the way we’re playing, there are results inside of this and a lot of results inside of this. We have to stop hurting ourselves, stop having our letdowns and we have to take our chances and its just execution at the end of the day.”",
  "word_count": 879,
  "scraped_at": "2026-02-14T01:55:54.959524",
  "_text_extracted": true
}