{
  "article_id": "be34c63feac7",
  "url": "https://www.opinionnigeria.com/manchester-united-players-behind-garnacho-over-gorilla-emoji-post-ten-hag/",
  "title": "Manchester United players behind Garnacho over gorilla emoji post – Ten Hag – Opinion Nigeria",
  "date": "20231027T181500Z",
  "domain": "opinionnigeria.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Breaking News\nManchester United players behind Garnacho over gorilla emoji post – Ten Hag\nThe Red Devils have stumbled to those victories against Brentford, Sheffield United and Copenhagen, with a vastly improved performance required if they are to lay a glove on Pep Guardiola’s men.\nErik ten Hag said Friday that the Manchester United squad are behind Alejandro Garnacho as the Argentina winger faces a potential ban for a social media post in which he used gorilla emojis.\nThe 19-year-old uploaded a photo on X, formerly known as Twitter, of United players celebrating with Cameroon international Andre Onana after their 1-0 Champions League win against Copenhagen in midweek, using the emojis.\nThe post was quickly deleted and Onana, who had saved a late penalty at Old Trafford, subsequently defended his teammate, whom he said was trying to express “power and strength”, adding “this matter should go no further”.\nBut the Football Association has punished players in the past for making racial references on social media and is understood to have sought Garnacho’s observations.\nFormer United striker Edinson Cavani was banned for three games and fined £100,000 in 2020 for using the Spanish term “negrito” (small black person) below an Instagram post.\nThe previous year Bernardo Silva was given a one-match ban and fined by the FA for a tweet he posted comparing teammate Benjamin Mendy with a black cartoon character.\nTen Hag appeared to be relaxed about the situation at a press conference on Friday.\n“Not (concerned about a ban) in this moment,” he said. “We are talking with the FA.”\n“But what you see and I can confirm that and I want to emphasise, we are together, we are United and we have seen that in the post of Andre Onana.”\nUnited are preparing to take on champions Manchester City at Old Trafford on Sunday after an unconvincing three-game winning streak in all competitions.\nThe Red Devils have stumbled to those victories against Brentford, Sheffield United and Copenhagen, with a vastly improved performance required if they are to lay a glove on Pep Guardiola’s men.\nDespite losing twice in the Premier League this season, City sit second in the table and six points ahead of eighth-placed United.\n“It’s a match above many other derbies,” said the Dutch manager. “It’s so huge because it’s Manchester, internal. But I think it’s also about world football and all the eyes will be on this game global-wide.\n“In this moment they’re six points ahead, we’re six points back, so we have to catch up. We know we have to progress the team.”\nThe midfield battle looks key and Ten Hag said his side could be missing Casemiro for a third straight game, with an ankle injury sustained on Brazil duty putting his place in jeopardy.\n“Aaron (Wan-Bissaka is back) in training today and Case is a race against the clock,” Ten Hag said. “No, not 100 percent.”",
  "word_count": 484,
  "scraped_at": "2026-02-14T02:00:57.107100",
  "_text_extracted": true
}