{
  "article_id": "be43ea73328f",
  "url": "https://www.caughtoffside.com/2024/11/04/edu-arsenal-exit-mikel-arteta/",
  "title": "Edu Arsenal exit and what it means for Mikel Arteta",
  "date": "20241104T201500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Edu’s imminent departure from Arsenal has certainly come as a surprise.\nThere have been whispers for a while about talks taking place with Evangelos Marinakis about a role overseeing his football group, but it was certainly not seen as a given that he would move on.\nSo his seemingly imminent exit has caught people off guard, with an official announcement from Arsenal about his future expected soon.\nI’m flying out to Italy on Tuesday for the Champions League game with Inter and I will be at Mikel Arteta’s press conference, which is due to take place at San Siro at around 7pm.\nIt will be interesting to see if Arsenal make an announcement before then. I would expect that they will, just so they have something official out there before Arteta has to sit in front of a room full of journalists, but we’ll have to wait and see.\nI’m still a bit torn myself in terms of how Edu’s departure will impact the club.\nThere is no doubt he has done a great job since his return to the club in 2019. Not every deal he has made has been a success, but the majority have worked out well and that’s all you can really ask for from a sporting director.\nHe and Arteta have worked very well together. They have been aligned in what they have wanted to do and together they have moved the club forward in a big, big way.\nThey have overhauled and built a squad that is now full of excellent young players that have had Arsenal challenging for the Premier League title for the past few seasons.\nArteta and Edu have a good relationship. They trust each other. Arteta knows they are on the same page and that is very important because it creates stability behind the scenes and that is absolutely vital.\nEdu exit WILL impact Arteta…\nSo Edu’s departure will impact Arteta. That’s obvious. But it shouldn’t be seen as a disaster.\nSporting directors come and go. It’s a role at football clubs which always comes with a pretty high turnover in terms of personnel. There are others out there that can do the job, so the important thing now is that the club chooses a successor wisely.\nCould Arsenal replace Edu with the transfer guru who discovered Lewandowski & Gundogan? Click here to find out more!\nArteta will have a strong say in that, along with Richard Garlick, Arsenal’s managing director and director Tim Lewis, who make up Arsenal’s football leadership team.\nMaking the right appointment is crucial. If they get it right, the new man could come in and bring a fresh outlook to the role which could help Arsenal in the long-run.\nSo it’s an interesting one to really assess right now. It’s a bit of a step into the unknown for Arsenal again after a period of stability under Arteta and Edu.\nThe unknown can be a bit daunting of course, but it can also be exciting. It’s just about making sure you make the right decision at the right time.",
  "word_count": 514,
  "scraped_at": "2026-02-14T02:26:24.531708",
  "_text_extracted": true
}