{
  "article_id": "be7b48887ee7",
  "url": "https://www.azfamily.com/2023/08/04/arizona-talks-join-big-12-ap-source-says-arizona-state-deciding-possible-move-too/",
  "title": "Arizona in talks to join Big 12 , AP source says . Arizona State deciding on possible move , too",
  "date": "20230804T093000Z",
  "domain": "azfamily.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arizona in talks to join Big 12, AP source says. Arizona State deciding on possible move, too\nArizona is in talks to join the Big 12, a person with direct knowledge of the discussions told The Associated Press\nArizona is in talks to join the Big 12, a person with direct knowledge of the discussions told The Associated Press, and a board of regents meeting Thursday night could determine whether Arizona State is ready to leave the Pac-12, too, and join the Wildcats.\nThe person spoke to the AP on condition of anonymity because neither the school nor the conference were prepared to finalize an invitation to the Wildcats.\nThe person added that Arizona State was not as far along in the process, which could slow down Arizona’s final decision because the Tucson-based school would prefer to be in sync with its rivals from Tempe.\nThe boards of regents for Arizona's two biggest universities, along with the University of Washington, scheduled special meetings for Thursday night amid speculation that more Pac-12 schools could leave the flailing conference.\nThe Arizona Board of Regents, which oversees Arizona and Arizona State, were holding a closed executive session to look at possible legal advice and discussion regarding university athletics. Washington regents called a special meeting to discuss present pending or potential litigation with counsel.\nSouthern California and UCLA are headed to the Big Ten next year, the same time Colorado is leaving the West Coast's largest and most storied conference for the Big 12.\nThat leaves the Pac-12 with nine schools — for now — and no media rights deal beyond the upcoming school year with the Big Ten again eyeing the troubled league. None of the other remaining schools have scheduled regent or trustee meetings — yet.\nThe uncertainty is being felt across the league.\n“You know, the old question of how long would it take TV money to destroy college football? Maybe we’re here,\" Washington State football coach Jake Dickert told reporters Thursday afternoon. “To think even remotely five years ago the Pac-12 would be in this position it’s unthinkable to think that we’re here today. And to think local rivalries are at risk and fans driving four hours to watch their team play in a road game and rivalries is at risk to me is unbelievable.”\n“But at the end of the day, I just think we’ll look back at college football in 20 years and be like, ‘What are we doing? What are we doing?’” he added. “Let’s let our guys stay regional. Let’s play. Let’s preserve the Pac-12 and what it is.”\nPac-12 Commissioner George Kliavkoff presented details of a media rights deal to league stakeholders on Tuesday, but no vote was held. ESPN reported the deal would make Apple TV the conference's primary home and not a more well-known traditional network like ESPN or Fox.\nThe carrot may not have been big enough.\nMore schools could be headed out the door, potentially pulling apart the “Conference of Champions\" — a league with roots dating to 1915 — at the seams.\nA group of Big Ten presidents has started discussing the possibility of adding more West Coast schools if the Pac-12 continues to crumble, with Oregon and Washington as the primary targets.\nThe Big 12 has targeted the Pac-12's corner schools — Colorado, Utah, Arizona and Arizona State — as Kliavkoff has gone through a protracted bid to secure a media rights deal.\nNow one corner is gone, two may have a foot out the door already and the conference that touts sports alumni like Jackie Robinson, John Elway and Jackie Joyner-Kersee could be in trouble.\n___\nAP College Football Writer Ralph D. Russo contributed.\n___\nAP college football: https://apnews.com/hub/college-football\nCopyright 2023 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed without permission.",
  "word_count": 641,
  "scraped_at": "2026-02-14T02:24:50.281609",
  "_text_extracted": true
}