{
  "article_id": "be9fe28d6eb3",
  "url": "https://www.dutchnews.nl/2025/10/napoli-fans-arrested-in-eindhoven-ahead-of-champions-league-game/",
  "title": "Napoli fans arrested in Eindhoven ahead of Champions League game",
  "date": "20251021T090000Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Napoli fans arrested in Eindhoven ahead of Champions League game\nAround 180 Italian football fans have been arrested in Eindhoven after police said they were planning a confrontation with PSV supporters.\nThe supporters ignored police orders to leave the city centre as the atmosphere became tense on the eve of PSV’s Champions League match with Napoli.\nA spokesman said the arrests were made after the fans’ behaviour “showed signs of provoking disorder”, but no actual clashes occurred.\nCity mayor Jeroen Dijsselbloem issued an emergency order for parts of the centre of Eindhoven this week after the match was deemed “high-risk”, with around 300 suspected hooligans likely to travel with the Napoli supporters.\nPolice are authorised to carry out random searches in the city centre and around the Phillips Stadium until Wednesday morning.\nThree years ago more than 100 Napoli fans were arrested at Amsterdam’s Centraal Station before the club played Ajax in the Champions League. They were found to be carrying sticks, a knife and a safety hammer.\nNapoli were allocated 1,600 tickets for the game, all of which were sold, but around half of those arrested had travelled without tickets, a spokesman said.\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 250,
  "scraped_at": "2026-02-14T01:49:53.046354",
  "_text_extracted": true
}