{
  "article_id": "be9fa9c8c193",
  "url": "https://www.fourfourtwo.com/features/liverpool-to-win-the-europa-league-here-are-7-ways-the-reds-will-embrace-the-competition-and-eventualy-deliver-in-dublin",
  "title": "Liverpool to win the Europa League ! Here are 7 ways the Reds will embrace the competition – to eventually deliver in Dublin",
  "date": "20230918T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool to win the Europa League! Here are 7 ways the Reds will embrace the competition – to eventually deliver in Dublin\nLiverpool can conquer the Europa League, starting this week: Matt Ladson of This Is Anfield explains why the Reds should embrace the competition\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nLiverpool didn't expect to have Europa League football just two seasons after a Champions League final – but rather than seeing it as a hindrance, the Merseysiders could embrace the competition for the potentially huge positives it can bring.\nThe Reds begin their European adventure this season in the picturesque Austrian city of Linz, where they face LASK on Thursday evening. The other opponents in their group, Toulouse of France and Royal Union Saint-Gilloise of Belgium, offer similarly different settings for supporters who will travel to see their side. The Champions League, for all its glory and prestige, can get quite repetitive, there’s only so many times supporters can travel to Madrid, Naples and Porto before it all gets a bit routine.\nLiverpool have played in the city of Madrid in each of the last five seasons, going back to the final in 2019; similarly, Porto and Napoli have each been opponents three times in the space of five seasons under Jurgen Klopp. So the journey in the Europa League offers new sights for both supporters and players alike, but that’s not the only potential benefits for Liverpool…\n1. Liverpool face less pressure in the Europa League this season\nKlopp has often spoken about how intense the season has been for his side in the seasons preceding this one; almost every one ended with a cup final (or multiple cup finals), and/or a taxing title run-in with Manchester City.\nThe higher calibre of the opponent in the Champions League meant increased pressure and little time to take a breath. Every match felt like a defeat would derail the season’s ambitions; there was little room for mistakes. The Europa League, though, will have less pressure. Liverpool should comfortably navigate through their group and even a draw or defeat won’t feel insurmountable.\nThat reduced pressure in European games, at least until the latter knockout rounds, will have a benefit going into the Premier League games.\n2. Rotation options create chances\nThe example of backup goalkeeper Caoimhin Kelleher is a prime one here. He’s clearly too good to be second-choice, but Klopp has always felt the need to play Alisson in both European and Premier League fixtures.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nNow, the Irishman should be given his chance to get playing time in the Europa this season. This keeps the player happy and his development progressing. The lower level of opponent, intensity and pressure means Klopp can rotate his pack, thus giving rest to his first-choice players, and also opportunity and valuable minutes for his second-choice options to remain fit and fresh for when they’re needed in the league.\nA ‘second choice’ XI for Liverpool could even look see Kelleher in goal, Joe Gomez, Joel Matip, Jarell Quansah and Kostas Tsimikas in the backline with Endo Wataru, Harvey Elliot and Ryan Gravenberch in midfield behind, Ben Doak, Cody Gakpo and Diogo Jota in attack.\nAnd that’s without the currently injured trio of Conor Bradley, Stefan Bajcetic and Thiago Alcantara.\n3. New stars can emerge\nThe one name fans are most excited to see in Europa action is 17-year-old winger Ben Doak.\nThe Scotsman has been highly impressive when given chances from the bench in the first-team, as he was in the UEFA Youth League last season, scoring four and assisting four in eight appearances.\nWithout the Europa League, where would Doak get his real chance other domestic cups? This is a real opportunity for him and several others.\n4. Building the European winning feeling\nIncredibly, from Liverpool’s Champions League winning squad of 2019, only eight remain from the 23-man squad against Tottenham. The Europa League, therefore, allows Liverpool’s new “reloaded” squad to achieve success in Europe.\nKlopp has told his new-look squad that this is year one, not year eight, for them, and what better way to usher in a new era than with a European title under the belts, creating that winning habit.\nJamie Carragher previously explained how the Reds’ success in the 2001 UEFA Cup final provided them with the inspiration, know-how and platform to go on to win the 2005 Champions League.\nIndeed, Klopp’s first season in charge at Anfield saw them make a run to the final of the Europa League, overcoming Manchester United and Borussia Dortmund in some thrilling and memorable nights that set the tone of what was eventually to come on the top European stage.\n5. Completing the set\nKlopp has won the lot at Liverpool, as have a sizeable number of his first-team squad; Champions League, FIFA Club World Cup, UEFA Super Cup, Premier League, FA Cup, League Cup and Charity Shield.\nThe only trophy Klopp hasn’t won so far is the Europa League, having suffered defeat in the 2016 final. Klopp delivered a rousing speech after that final in Basel, telling his squad after defeat to Sevilla that \"there will be more finals\" and that this is \"just the start\".\nHe wasn’t wrong. The Reds went on to three Champions League finals in four years between 2018 and 2022.\n6. Another route into the Champions League\nOf course, the other huge benefit of Europe’s second-tier competition is that it offers another route into next season’s Champions League.\nLiverpool should be finishing inside the Premier League’s top four, but at least this extra route again helps to relieve the pressure there.\n7. Benefit for the Premier League challenge\nEven if the Premier League is Liverpool’s priority, at least during the earlier stages of European involvement, the Europa League can have huge benefits there. It gives the chance to rest key players who have had very little rest in recent seasons, such as Alisson, Virgil van Dijk, Andy Robertson, Trent Alexander-Arnold and Mo Salah.\nMeanwhile, with plenty of new arrivals in midfield, it will give players like new signings Wataru Endo and Ryan Gravenberch with an ideal stage to fine-tune their tactical understanding of playing in Liverpool’s system - with Klopp having admitted that for Endo that is something he needs to learn to adjust to.\nIn the Europa League, he can make those adjustments without the intensity and focus of the Premier League. Thus, that then benefits when those players are required in the Premier League.\nSome may see it as an unwanted distraction – but for Liverpool, the Europa League can be a win-win situation this season. Oh, and did we mention the final is in Dublin? That would be some day and night for Liverpool supporters!\nMore Liverpool stories\nJurgen Klopp has opened up about the club’s decision to launch a mega-money bid for Caicedo – but the Reds manager could be on his way out of Anfield sooner than anticipated.\nKlopp has been adamant that Salah will remain despite Saudi Arabian interest, however, another bid could be just around the corner.\nMatt Ladson is the co-founder and editor of This Is Anfield, the independent Liverpool news and comment website, and covers all areas of the Reds for FourFourTwo – including transfer analysis, interviews, title wins and European trophies. As well as writing about Liverpool for FourFourTwo he also contributes to other titles including Yahoo and Bleacher Report. He is a lifelong fan of the Reds.",
  "word_count": 1359,
  "scraped_at": "2026-02-14T02:20:10.967304",
  "_text_extracted": true
}