{
  "article_id": "beb69dd289f8",
  "url": "https://www.espn.com/soccer/english-premier-league/story/4872355/pulisic-set-to-lead-chelsea-summer-transfer-exodus-sabitzer-could-stay-at-man-united",
  "title": "Pulisic set to lead Chelsea summer transfer exodus",
  "date": "20230213T050000Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are set to let a host of players, including USMNT star Christian Pulisic, depart in the summer, while other clubs are busy making plans for the future. ESPN's Insider Notebook has the latest.\nPulisic part of Chelsea summer exodus plans\nChristian Pulisic is set to lead a summer clearout at Chelsea as the Blues continue a radical overhaul of their squad, sources have told ESPN.\nSince Todd Boehly and Clearlake Capital completed their takeover of the club last May, Chelsea have made 16 permanent signings and brought in two more players on loan (Denis Zakaria and Joao Felix) at a total expense of more than €600 million -- including the British-record €121m signing of Argentina midfielder Enzo Fernandez in January.\nThe recruitment drive has led to a bloated squad that the Blues will look to trim at the earliest opportunity, with Pulisic one of several players expected to be made available.\nThe United States international was open to leaving Stamford Bridge in January -- with Manchester United and Newcastle United among the clubs to have been sounded out over a deal -- but a knee injury scuppered any prospect of a move. Before his injury, Pulisic played 16 times in the Premier League but was named in the starting XI for only six games.\nPulisic's existing contract expires in June 2024 and there are no plans at present to offer an extension. Chelsea are expected to listen to offers for the 24-year-old and accept they will have to make a significant loss on the €64m paid to Borussia Dortmund to acquire the winger in 2019.\nHakim Ziyech is also likely to leave after a deadline day loan move to Paris Saint-Germain collapsed over paperwork issues, while striker Pierre-Emerick Aubameyang faces a bleak future at the club after being left out of Chelsea's Champions League squad.\nMLS side LAFC are reportedly exploring a move for the 33-year-old, who could also attract summer interest from Spanish LaLiga clubs after his successful spell with Barcelona last year.\nSources have told ESPN that Mateo Kovacic, Kalidou Koulibaly and Callum Hudson-Odoi could also be made available, while they will cut their losses on €115m striker Romelu Lukaku (who is currently on loan at Inter Milan), and there is uncertainty over N'Golo Kante and Mason Mount as Chelsea attempt to get the pair to sign new contracts.\nCoach Graham Potter has admitted he faces a difficult challenge in keeping every member of such a large squad fully engaged in the weeks ahead -- especially as many of them know already that their futures probably lie elsewhere. -- James Olley.\nSabitzer could stay at Man United beyond his loan spell\nManchester United are prepared to sign midfielder Marcel Sabitzer permanently in the summer if he impresses during his loan spell at Old Trafford, sources have told ESPN.\nSabitzer joined United from Bayern Munich until the end of the season in a January deal that does not include an obligation or an option to make the move permanent. Under the terms of the agreement, Sabitzer will return to Bayern in the summer, but United have told the Austria international there is still a chance he could earn a long-term contract.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nManager Erik ten Hag is hopeful that the possibility of securing permanent moves to Old Trafford will act as incentives for both Sabitzer and striker Wout Weghorst -- who was signed on loan from Burnley during the January window -- between now and the end of the season.\nSabitzer is under contract at Bayern until 2025 but is expected to leave permanently in the summer. The 28-year-old has fallen down the pecking order at the Allianz Arena and Bayern are set to bolster their midfield even further in the summer window with the free transfer addition of Konrad Laimer from RB Leipzig. -- Rob Dawson.\nAtletico target free agent Thuram in summer\nAtletico Madrid still have Borussia Monchengladbach forward Marcus Thuram on their list of transfer targets for the summer, but fear they will miss out amid competition from Premier League clubs and Bayern Munich, sources have told ESPN.\nThuram, 25, is a free agent in four months and was linked with Atletico during the January transfer window when the club were looking for a forward to fill the gaps left by the departures of Joao Felix and Matheus Cunha. However, Gladbach would not negotiate Thuram's departure and Atletico ended up signing Memphis Depay from Barcelona for €4m instead.\nSources said that Atletico plan to make a new move for Thuram in June when his contract expires, but are working on alternatives in case the France international ends up at another club.\nReal Betis striker Borja Iglesias is one such option, though the 30-year-old's deal expires in 2026 so a move may be complicated by Betis' demands for a significant transfer fee to let him leave.\nAtletico are looking to move Felix on permanently after his loan at Chelsea ends on June 30, with Memphis arriving in January to complete the attack alongside Alvaro Morata and Angel Correa. Memphis decided to join Atleti after talking with former Barcelona teammate Antoine Griezmann and the forward may also been key in convincing his international teammate Thuram as well. -- Rodri Faez.\nBarcelona's Ansu Fati back to full fitness\nResults from Barcelona's internal fitness tests prove Ansu Fati is fully fit again, sources have confirmed to ESPN, but the winger faces a fight to prove himself and win his place back in the first XI.\nAnsu, 20, burst on to the scene as a 16-year-old in 2019 but his progress has been hindered by a series of long-term injuries in recent years. He returned at the back end of last season but his minutes have been carefully managed by coach Xavi Hernandez and he has come off the bench 13 times in his 20 appearances in LaLiga this campaign.\nA series of tests have now shown Ansu is as quick, resistant and in shape as he has ever been, though, with sources insisting he is 100 percent again having managed to stay injury free this season through a total of 31 appearances -- 22 of which have been off the bench -- as he approaches a possible crossroads in his career.\nBarca president Joan Laporta revealed on Thursday that he's aware of interest from elsewhere -- with Manchester United, Arsenal, Liverpool all linked -- but there have been no bids to sign the Spain international, who the Catalan club still \"have a lot of faith deposited in,\" according to Laporta.\nMeanwhile, Xavi called for patience over reports of a transfer, but a lack of regular football could test Ansu's resolve as he is behind Robert Lewandowski, Ousmane Dembele and Raphinha in the pecking order at Camp Nou, with a recent switch to four midfielders not favouring him.\nIn his 31 outings this season, he has managed six goals, although he has not scored in LaLiga since October, a run spanning 10 games. However, he did net three times in January, twice in the Copa del Rey and once in the Spanish Super Cup. -- Sam Marsden and Moises Llorens.",
  "word_count": 1197,
  "scraped_at": "2026-02-14T01:59:41.715923",
  "_text_extracted": true
}