{
  "article_id": "bebad16d06a1",
  "url": "https://thepeoplesperson.com/2024/04/06/ex-man-united-boss-ole-gunnar-solskjaer-tells-erik-ten-hag-exactly-how-to-sink-liverpool-278528/",
  "title": "Ex - Man United boss Ole Gunnar Solskjaer tells Erik ten Hag exactly how to sink Liverpool - Man United News And Transfer News",
  "date": "20240406T163000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United manager Ole Gunnar Solskjaer has sent a message to current boss Erik ten Hag about how he can get one over Jurgen Klopp and beat Liverpool.\nUnited are set to host Liverpool at Old Trafford on Sunday in what is shaping up to be a crucial tie.\nKlopp’s men will undoubtedly be looking to defeat the Red Devils in a bid to maintain their position as table leaders. United on the other hand require a big win to keep their hopes of attaining Champions League football alive.\nTen Hag also needs his side to clinch the victory to relieve some of the pressure that has been mounting on him after yet another devastating late loss at the hands of Chelsea on Thursday.\nSunday’s match is set to be Klopp’s 21st and final game for Liverpool against United. In the time he has faced United as Liverpool gaffer, the German coach has registered seven wins, eight draws and five defeats, including last month’s FA Cup quarter-final clash.\nAgainst Solskjaer, Klopp won three games, drew three and lost one.\nThe Norwegian was one of multiple individuals who spoke to The Athletic and gave their opinions on what it’s like facing Klopp and how Ten Hag should approach the game.\nSolskjaer said, “With Jurgen you know what is coming but it is so hard to play against. The ball is going forward very quickly and they never rest when they are out of possession. Beating them at Old Trafford in the FA Cup (3-2 in 2021) was one of the highlights of my career as United manager.”\n“That Liverpool team was the best that their club, with a fantastic manager, have ever had. I know that’s a bold statement because Liverpool were so good in the ’80s, but they were a fantastic side under Jurgen Klopp.”\nSolskjaer suffered a 5-0 loss vs, Liverpool in his final season in the Old Trafford dugout. Mohamed Salah bagged a hat-trick on that occasion.\nAccording to the ex-United striker and manager, “We’d signed the players and wanted to see where we were at against one of the best teams in the world. I felt the players were ready for it, just like I’d felt they were ready when we’d gone to (Manchester) City and won (2-0 in March 2021).”\n“We could have sat back against Liverpool and countered, but my decision was to go for it. We lost 5-0. It was 50/50 more or less in possession and chances at half-time, yet we were 4-0 down. I made the wrong decision and that was my lowest point as United manager by a mile.”\nSolskjaer told The Athletic that Roberto Firmino is the Liverpool player who caused him and his players the most problems.\nThe newspaper also talked to Jose Mourinho’s former assistant at United, Rui Faria. The pair oversaw four games against Klopp’s Liverpool and didn’t lose any of them. Only when Faria left did Klopp finally beat Mourinho – a 3-1 loss that ultimately cost the Portuguese coach his job.\nFaria pointed out to Andy Mitten, “Try to control the match by having the ball, with a good positional balance ready to press and cope with their offensive transition — very vertical — in case the ball is lost.”\nEarlier in 2018, a Mourinho-led United sunk Liverpool 2-1 at the Theatre of Dreams. Faria explained how the win came to be. “Strategically there was a clear intention of getting behind, using Romelu Lukaku as target man and attracting defenders to him, then to use (Marcus) Rashford as a main runner behind defenders out of position. Both goals were scored by Rashford. Both goals came from that.”\nFormer Premier League defender Danny Higginbotham opined that United have often found success against Liverpool by playing well on the counter-attack – a gameplan he relayed Ten Hag might have to turn to if he wishes to outsmart Klopp and cause a massive upset.\nAs per Higginbotham, United have proven they’re not very comfortable in possession and they cause more damage to their opponents in transition moments.\nOn what is likely to happen on Sunday, the ex-Gibraltar international said that Klopp will almost certainly stick to his principles and as a result, United will have to sit back and make the opportunities they receive on the turnover count.\nHe added that the key to United getting a result will be to defend well and be solid at the back.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 763,
  "scraped_at": "2026-02-14T02:29:59.646857",
  "_text_extracted": true
}