{
  "article_id": "bf0a2b4fb90a",
  "url": "https://www.teamtalk.com/tottenham-hotspur/brennan-johnson-exit-sparks-interest-dangerous-laliga-forward-etta-eyong",
  "title": "Tottenham transfers : Johnson exit ignites interest in  dangerou LaLiga forward as January spree begins",
  "date": "20260102T153000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nJohnson exit ignites Tottenham interest in ‘dangerous’ LaLiga forward as January spree begins\nTottenham Hotspur are reportedly checking on the possibility of signing a top LaLiga forward talent in the January window, after nearing a deal to offload Brennan Johnson to Crystal Palace for £35million.\nThomas Frank’s men looked completely clueless in the attacking third, not for the first time this season, as they drew 0-0 at his former club Brentford on Thursday.\nThe display led to calls from the away end of ‘boring, boring Tottenham’ and ‘we want our money back’ as Spurs earned a point at their London rivals in what was their first goalless draw in 137 Premier League outings.\nThe absence of the banned Xavi Simons and injured Swede Lucas Bergvall, to add to that of Dejan Kulusevski and James Maddison, is certainly not helping Frank try and develop Tottenham‘s play in the final third. However, some Spurs supporters are growing tired of the continued pragmatism and would prefer a change of manager, just six months into the Dane’s tenure in north London.\nAdding fresh attacking talent in the January window could help, though, and the latest reports suggest a move for Levante striker Etta Eyong could be on the cards.\nAccording to a report from MailOnline, Tottenham have checked on Eyong as they look to bolster Frank’s forward options, particularly centrally and on the left, in the winter window.\nEyong has scored five goals and laid on one assist for Levante in LaLiga this season, while he also contributed with three goals and assists combined for Villarreal before leaving the club over the summer.\nWhile those stats don’t particularly jump out, Eyong is regarded as a real talent who would give Tottenham more dynamism and power in the No.9 position, especially in Dominic Solanke’s continued absence.\nIndeed, he’s already making enough of an impact in Spanish football that Barcelona are also said to be monitoring his progress, while at international level, Eyong is currently away at the African Cup of Nations with Cameroon.\n‘Dangerous’ Eyong could provide Tottenham spark\nWhile not exactly viewed as a like-for-like replacement for Palace-bound Johnson, Eyong could give Spurs more attacking thrust if Solanke’s absence is prolonged.\nRicharlison remains an enigma who misses chances quality No.9s would not, while Randal Kolo Muani’s loan move has been pretty disastrous so far, with his only two goals coming in the Champions League against his parent club PSG.\nFormer Cameroon coach Marc Brys, who was sacked just before AFCON began, certainly believes Eyong has the talent to be an elite striker in European football.\nIn a recent interview with Mundo Deportivo, Brys said: “He’s a very good player, Very modest and humble, which is a gift.\n“He’s not an egocentric striker; he plays for the team. I like that: he’s hard-working, he draws attention so others can takeEtta Eyongpop advantage of the space. He played one game with us and did well, even though he didn’t score. He was an important addition to the squad. He has a good heart, he’s polite, and he has no negative attitude. That’s what makes him special.\n“He needs to continue developing, to integrate more fully, but he has the potential to score a lot of goals. He’s already shown that, although he hasn’t yet reached his full potential.\n“He’s dangerous, unpredictable, and can surprise anyone. And that’s valuable for any top team.”\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nLatest Tottenham news: Goretska swoop; Palhinha signing re-think\nArsenal are reportedly in the mix with rivals Tottenham to sign Bayern Munich midfielder Leon Goretska this month, as sources reveal Thomas Frank’s stance on the 30-year-old.\nElsewhere, Spurs have not yet decided whether to make Joao Palhinha’s deal permanent heading into 2026, but the player has made it clear to the club he wants to stay, TEAMtalk understands.\nFinally, Conor Gallagher’s loan move potential could depend on how much Atletico Madrid are willing to continue to pay towards his wages, with Manchester United and Tottenham among the clubs linked to the former Chelsea midfielder.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 724,
  "scraped_at": "2026-02-14T01:59:31.497464",
  "_text_extracted": true
}