{
  "article_id": "bf0ee0ab4395",
  "url": "https://www.teamtalk.com/manchester-united/mason-greenwood-man-utd-fix-asking-price-two-laliga-giants-target-attacker",
  "title": "Mason Greenwood : Man Utd fix asking price as two LaLiga giants way bigger than Getafe target attacker",
  "date": "20240220T121500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMason Greenwood: Man Utd fix asking price as two LaLiga giants way bigger than Getafe target attacker\nManchester United are aiming to raise some money by selling Mason Greenwood this summer after his loan spell at Getafe, according to reports.\nGreenwood has not played for Manchester United since January 2022 after his arrest on suspicion of rape and assault. Just over a year later, the criminal charges were dropped due to key witnesses withdrawing and new evidence emerging.\nManchester United went on to conduct their own investigation into the matter and were initially willing to consider reintegrating Greenwood – who they do not believe committed the offences he was accused of – until backlash prompted them to change their minds.\nInstead, the club facilitated Greenwood’s next move away from them, allowing him to join Getafe on loan in September.\nGreenwood has got back up to speed on the pitch in Spain, scoring seven goals from 24 appearances between LaLiga and Copa Del Rey so far.\nWhile Manchester United decided it was in everyone’s best interests for Greenwood never to play for them again, they do still technically have him under contract for another year after his spell with Getafe ends.\nTherefore, it is likely the club will receive offers for him in the summer and they will have to pick which one to accept.\nVarious clubs have already been linked with Greenwood, but the main contenders will come from LaLiga again – except this time they will be bigger than Getafe.\nAccording to Fussball News, a battle is unfolding between Barcelona and Atletico Madrid for Greenwood’s signature.\nSources already confirmed to TEAMtalk in December that Diego Simeone’s side could make a move for the Bradford-born forward.\nMan Utd set Mason Greenwood price tag\nAware of the rising interest, Manchester United have supposedly set an asking price in the region of €40m (£34m) for Greenwood’s transfer.\nSince he is a product of their own academy, any money they make will be profit when it comes to Financial Fair Play considerations.\nA return to Manchester United is categorically ruled out, so the race is now on for clubs – most likely overseas, as TEAMtalk has already explained – to buy the 22-year-old.\nWhether Barcelona or Atleti intend to meet Manchester United’s asking price for Greenwood remains to be seen.\nA fee of €40m would, somewhat surprisingly, make Greenwood the club’s fourth most expensive sale of all time, behind only Cristiano Ronaldo, Romelu Lukaku and Angel Di Maria.\nOnly two players have ever moved from Manchester United to Barcelona before: Gerard Pique in 2008 and Mark Hughes back in 1986.\nThere have never been any sales from Manchester United to Atletico Madrid, interestingly.\nBoth of those suitors are aiming to have Champions League football on offer next season, as is usually a regular occurrence for them.\nGreenwood last played in the Champions League – and indeed any European competition – back in December 2021, actually scoring on his most recent appearance in the tournament.\nFor now, he has up to 13 matches left to focus on in a Getafe shirt. Jose Bordalas’ side are currently 10th in LaLiga, standing an outside chance of claiming a first top-half finish since 2019/20.\nREAD MORE: PSG to kickstart post-Mbappe era with stunning Man Utd raid, as eye-watering contract offer leaked",
  "word_count": 560,
  "scraped_at": "2026-02-14T01:56:44.626214",
  "_text_extracted": true
}