{
  "article_id": "bf36f046a5fa",
  "url": "https://www.caughtoffside.com/2025/06/05/jamie-gittens-wants-summer-move-amid-chelsea-links/",
  "title": "Chelsea target Jamie Gittens want summer exit from Borussia Dortmund",
  "date": "20250605T180000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Borussia Dortmund attacker Jamie Gittens has handed Chelsea a major transfer boost by informing the German club of his desire to leave this summer.\nThe 20-year-old attacker has been linked with the move to the Premier League, and Chelsea are hoping to wrap up a move for him quickly. According to BILD, the player has informed the club that he wishes to move on this summer.\nDortmund open to a sale\nThe report further claims that Dortmund could be open to selling him for £50 million, after his mediocre performance during the second half of the season. The 20-year-old is a promising young talent, and it is no surprise that he is being inconsistent at this stage of his career. He has all the attributes to develop into a future star, and Chelsea are ready to invest in the future.\nDespite his inconsistencies, Gittens has racked up 12 goals and five assists last season.\nChelsea are prepared to sign the player before the Club World Cup begins, and it remains to be seen whether the two clubs can finalise an agreement quickly. He would be a super long-term investment for Chelsea, and he could prove to be a major upgrade on Mykhailo Mudryk, if he manages to adapt to English football quickly.\nChelsea could use Jamie Gittens\nChelsea secured UEFA Champions League qualification for the next season, and they must improve the squad in order to match up to the European elite next year. They will also look to fight for major trophies. They need more cutting edge and unpredictability in the final third, and Gittens would add just that.\nJoining a Premier League club will be quite exciting for the young attacker as well. Regular football in England could accelerate his development and help him fulfil his potential. Chelsea are one of the biggest clubs in the world, and they could provide him with the platform to showcase his abilities at a high level consistently.",
  "word_count": 326,
  "scraped_at": "2026-02-14T01:49:39.540532",
  "_text_extracted": true
}