{
  "article_id": "bf3d85c37cf8",
  "url": "https://www.caughtoffside.com/2025/04/05/leeds-porto-zaidu-sanusi/",
  "title": "Leeds open talks with Porto regarding transfer of 27 - year - old",
  "date": "20250406T010000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United’s hopes of securing automatic promotion to the Premier League suffered a blow this week, as the club dropped from first to third in the Championship standings.\nJust a single point separates them from second-placed Sheffield United, while Burnley sit narrowly ahead at the summit.\nWith only six fixtures remaining in the regular season, every game now carries significant weight in the Whites’ bid to reclaim a top-two spot.\nDespite the ongoing promotion battle, Leeds are already preparing for the upcoming summer transfer window.\nWhether Leeds return to the Premier League or face another year in the Championship, strengthening the squad remains a clear priority for the club’s hierarchy.\nOne potential reinforcement is Nigerian international Zaidu Sanusi, currently on the books at Portuguese giants FC Porto.\nZaidu Sanusi linked with summer switch to Leeds\nAccording to Africa Foot, Leeds have opened talks with the Portuguese giants over a potential deal for the Nigerian international.\nThe proposed deal is said to include a four-year contract running until 2029, with an estimated transfer fee in the region of £1.75 million.\nCrucially, both the player and Porto are reportedly open to the move, making this a transfer worth monitoring as the summer window approaches.\nZaidu, previously wanted by West Ham, began his journey in Portuguese football in 2016 with Gil Vicente, later gaining valuable experience during a loan spell at SC Mirandela.\nHis standout performances at C.D. Santa Clara earned him a move to FC Porto in 2020, where he quickly established himself as a regular starter and contributed to the club’s domestic successes.\nHowever, the Nigerian full-back has endured a difficult spell over the past year. A serious cruciate ligament injury ruled him out for a large portion of last season.\nThough he has since returned to full fitness, Zaidu has struggled for game time, making only eight appearances in the current campaign and frequently finding himself on the bench.\nWhile Zaidu brings top-level experience and Champions League pedigree, his recent injury history and lack of match sharpness raise legitimate concerns over whether he is the right fit for a promotion-chasing Leeds side.\nFor now, Leeds United’s immediate focus must remain on the pitch. With six crucial games left, regaining a spot in the automatic promotion places will be the top priority.\nHowever, should the club secure a return to the Premier League—or even if they fall short—a move for Zaidu Sanusi could be one of the early stories of their summer rebuild.",
  "word_count": 412,
  "scraped_at": "2026-02-14T02:02:35.590095",
  "_text_extracted": true
}