{
  "article_id": "bf5fb9d77d01",
  "url": "https://www.anglocelt.ie/2024/05/29/luke-shaw-and-harry-maguire-join-england-camp-early-in-bid-to-prove-fitness/",
  "title": "Luke Shaw and Harry Maguire join England camp early in bid to prove fitness",
  "date": "20240529T221500Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luke Shaw and Harry Maguire join England camp early in bid to prove fitness\nBy Simon Peach, PA Chief Football Writer\nLuke Shaw and Harry Maguire have linked up with Gareth Southgate’s squad early as the England duo bid to prove their fitness for this summer’s European Championship.\nWith the June 16th group opener against Serbia looming large, the Euro 2020 runners-up convened in County Durham on Wednesday for the start of their pre-tournament training camp.\nShaw and Maguire have reported to England’s training base at Middlesbrough’s Rockliffe Park, where only six of Southgate’s long list were absent.\nReal Madrid star Jude Bellingham is preparing for the Champions League final against former club Borussia Dortmund on Saturday evening.\nA post shared by England football team (@england)\nSouthgate confirmed he will play no part in either of the upcoming friendlies against Bosnia and Iceland but those involved in last Saturday’s all-Manchester FA Cup final could play in the second match.\nDefeated City players John Stones, Phil Foden, Kyle Walker and Jack Grealish along with 19-year-old Kobbie Mainoo, who continued his inexorable rise with a goal in United’s 2-1 win, are yet to link up with the squad.\nSouthgate said at last Tuesday’s squad unveiling he has never had to deal with as many complications as he has selecting this England squad.\nFitness concerns are chief among those headaches, with Euro 2020 final goalscorer Shaw recently suffering a setback as he looks to recover from a muscle injury that has sidelined him since mid-February.\nSouthgate admitted the left-back is a “long shot” and concerns remain over Manchester United team-mate Maguire, who has been out for a month with a muscle issue of his own.\nA post shared by Harry Maguire (@harrymaguire93)\n“Luke Shaw, Harry Maguire have had injuries at the end of the season with United, so they needed a little bit more work with our medical team,” Southgate told England’s YouTube channel.\n“But I think they’re both hugely committed to trying to be fit for the tournament and they realise that every day is important.\n“Now we get a chance to see exactly where they are and that’s the key at this time of the season.\n“We get information from the clubs, but until you see the players in front of you, medics get their hands on them, and we can see them on grass, then you have a much clearer picture.”\nEngland play Bosnia on Monday at St James’ Park before welcoming Iceland to Wembley next Friday.\nSouthgate has to submit his final 26-man squad to UEFA just hours after that send-off match, with the squad then flying to Germany on June 10.\nAsked how challenging it will be to cut down his 33-man training squad, Southgate said: “Extremely difficult.\n“It was obviously very difficult to leave players out of this 33 and, of course, there are some younger players that are coming with slightly different expectations, perhaps into this camp.\n“But there are going to be some difficult calls to make.\n“We’re hoping that not too many of those calls are decided by injury and we’ve got the strongest possible squad to pick from.”\nMainoo’s man-of-the-match performance in the FA Cup final increased calls for him to start at Euro 2024.\n“The curious thing about young talent is how will they cope under pressure,” Southgate said.\n“You can see technical ability, everybody can see that, but then it’s about how tactically aware (they are), how mature, ability to cope in big matches.\n“When you’re playing for a club like Manchester United, you’re always under the spotlight, so he’s shown that with them, with us in March (in his first senior call-up).\n“We’ve never been afraid to put young players in. If players are good enough, then we’re not so concerned about their age.\n“It’s helpful to have more evidence when you’re making decisions on players, so Kobbie’s had an amazing season, really adjusted well. Fabulous for him to finish the season with a goal and a trophy at the end of it.”",
  "word_count": 673,
  "scraped_at": "2026-02-14T02:01:16.450608",
  "_text_extracted": true
}