{
  "article_id": "bf6d455da375",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=342096",
  "title": "Vancouver Whitecaps FC sign German Legend Thomas Müller",
  "date": "20250806T190000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vancouver Whitecaps FC sign German Legend Thomas Müller\nVancouver Whitecaps FC announced on Wednesday the addition of one of the sports most decorated players of all-time in legendary German attacking midfielder Thomas Müller. The FC Bayern Munich great has signed for the remainder of the 2025 season and the agreement includes a Designated Player option for 2026. Müller, who will occupy an International Roster Slot and fill one of the spots opened due to the Season-Ending Injury List, will officially join the clubs roster pending receipt of his International Transfer Certificate (ITC), visa, and work permit.\nWhitecaps FC acquired the Discovery Priority for Müller from FC Cincinnati in exchange for $200,000 in 2025 General Allocation Money (GAM), $100,000 in 2026 GAM, and a conditional $100,000 in 2026 GAM.\nThomas is a world-class player the ultimate Raumdeuter Interpreter of space known for his elite chance creation, unmatched spatial awareness, and relentless off-the-ball movement, said Axel Schuster, Whitecaps FC CEO & sporting director. He not only brings a winning pedigree and exceptional football intelligence, but also a tireless work ethic that will elevate the entire team. Thomas is a natural leader whose passion for the game is infectious. This is a statement signing by our club and our ownership a transformative moment for our club and our city. We are proud to welcome Thomas to Vancouver.\nVancouver Whitecaps FC are enjoying a record-breaking season, leading the MLS Western Conference in points per game. Müller is scheduled to arrive in Vancouver next Wednesday, with his introductory media conference and first training session set for Thursday. Whitecaps FC will play six of their final nine regular season matches at BC Place, including Sunday, August 17.\nIm looking forward to coming to Vancouver to help this team win a championship, added Müller. Ive heard great things about the city, but first and foremost Im coming to win. Ive had great conversations with Axel Schuster and Jesper Sørensen, and now I cant wait to play in front of the supporters and to see all of the fans come out to BC Place as we head towards the playoffs.\nMüller joins Whitecaps FC following a remarkable 17-year career with FC Bayern Munich, where he became one of the most successful players in European football history. The attacking icon amassed 756 appearances, 250 goals, and 238 assists, helping the club secure a record 33 titles, including:\n- 13 Bundesliga championships\n- 8 DFL-Supercup titles\n- 6 DFB-Pokal (German Cup) titles\n- 2 UEFA Champions League titles\n- 2 UEFA Super Cups\n- 2 FIFA Club World Cups\nOn the international stage, Müller earned 131 caps, scored 45 goals and added 41 assists for Germany, playing a crucial role in their 2014 FIFA World Cup victory. He also claimed the Golden Boot and Best Young Player at the 2010 FIFA World Cup, as well as the Silver Boot and Silver Ball at the 2014 FIFA World Cup.\nTRANSACTIONS: On August 6, 2025, Vancouver Whitecaps FC acquired the Discovery Priority for Thomas Müller from FC Cincinnati in exchange for $200,000 in 2025 General Allocation Money (GAM), $100,000 in 2026 GAM, and a conditional $100,000 in 2026 GAM. Müller is signed through 2025 and the agreement includes a Designated Player option for 2026.\nThomas Müller\nPronunciation: TOH-mahs MUH-ler\nPosition: Attacking Midfielder\nHeight: 6-01\nWeight: 165 pounds\nDate of Birth: September 13, 1989\nHometown: Weilheim, Germany\nCitizenship: Germany\nStatus: International\nPrevious Club: FC Bayern Munich (2009 - 2025)\nYouth Clubs: TSV Pähl (1993 - 2000), FC Bayern Munich Academy (2000-2009)\nInstagram: @esmuellert\n( Press Release Image: https://photos.webwire.com/prmedia/8/342096/342096-1.jpg )\nWebWireID342096\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 620,
  "scraped_at": "2026-02-14T02:26:46.353743",
  "_text_extracted": true
}