{
  "article_id": "bf7c7ed8ce8a",
  "url": "https://www.teamtalk.com/news/man-city-flop-embarrassing-himself-cut-loose-return-home-beckons",
  "title": "Man City flop embarrassing himself could be cut loose as return home beckons",
  "date": "20241025T164500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City flop embarrassing himself on loan could be cut loose as return home beckons\nIpswich are reportedly considering sending Kalvin Phillips back to his parent club Manchester City, as he is nowhere near the level expected, and is ‘head is at Leeds’.\nPhillips has been sent out on two loans from City in the past two seasons, with Pep Guardiola clearly not fancying him. Last term, he had a disastrous spell at West Ham where he was dropped early in his time there after scoring an own goal on debut.\nHe is now at newly-promoted Ipswich, where things are yet to go swimmingly, with Phillips missing the opening two games of the season, before competing 90 minutes just once in six games.\nAccording to Football Insider, the Tractor Boys are unhappy with his performances so far. It’s said they are ‘amazed’ – but not in a good way – at his lack of mobility and running power, while his condition is said to be ‘nowhere near’ the level of a top Premier League footballer.\nThey also feel that his ‘head is still at Leeds’, where he spent his first eight senior seasons after coming through the academy.\nAs a result of those factors, if he cannot demonstrate he is up to speed, Ipswich will consider sending him back to City early.\nREAD MORE: The key contract details of every Man City first-team player: Expiry dates, weekly wages, agents…\nPhysical complaints nothing new\nIt is not the first time Phillips’ physical attributes have been questioned by a club. City boss Guardiola openly stated the midfielder was “overweight” after the 2022 World Cup.\nPhillips has stated he was “quite frustrated” with that narrative following him everywhere he went.\nBut he stated that Ipswich boss Kieran McKenna told him when he joined ahead of this season that he wanted to get him back to where he was when he left Leeds.\nClearly, to this point, that has not happened, and the fresh reports suggest Ipswich may not feel it’s possible for them to do.\nAs a result, it seems there is some likelihood of them cutting his loan short.\nMan City round-up: Big moves incoming\nCity are plotting some big inbound transfers in the coming windows.\nIf Erling Haaland is to leave for Real Madrid, as it’s said he’s keen to do soon, Viktor Gyokeres is the ‘priority’ target, and City have already been in touch with him.\nArda Guler is also on the radar to potentially replace a star, with Kevin De Bruyne’s future looking as if it may potentially be away from City.\nRaphinha is another La Liga star on the radar, and it’s believed he’ll command an £83million transfer fee.\nCity could lose out on the chance to sign Andrija Maksimovic – a promising youngster from Red Star Belgrade – given Brighton are in the mix for him, and are deemed a more likely step than a huge club like City.\nPhillips’ timeline with City\nBy Nathan Egerton\nPhillips joined City from Leeds in the summer of 2022 but made just four starts in all competitions in his debut season.\nThe England international also made 17 substitute appearances for City in 2022/23, although he was an unused substitute in both the FA Cup final and the Champions League final.\nIn the first half of the 2023/24 season, he made two starts and eight substitute appearances.\nOverall, the 28-year-old has made six starts and 25 substitute appearances in all competitions for Pep Guardiola’s side.\nHaving bought Phillips for an initial £42million, City have paid £7million-per-start and they also lost three of those six games.\nHe joined West Ham United on loan in January 2024 in search of regular first-team football but made just seven starts and three substitute appearances for the Hammers.\nThe defensive midfielder is enjoying a better loan spell at Ipswich Town and has started six games for McKenna’s side in the 2024/25 season.\nHe has already had 441 minutes of first-team football this season, which is just 198 minutes less than he recorded in the entire 2023/24 season.",
  "word_count": 681,
  "scraped_at": "2026-02-14T01:51:57.639073",
  "_text_extracted": true
}