{
  "article_id": "bf84f69aefdb",
  "url": "https://www.geosuper.tv/latest/34888-la-liga-ancelotti-confirms-key-players-return-as-real-madrid-face-athletic-club",
  "title": "La Liga : Ancelotti confirms key player return as Real Madrid face Athletic Club",
  "date": "20240330T154500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nMarch 30, 2024\nReal Madrid's head coach Carlo Ancelotti confirmed on Saturday that longtime absentee Eder Militao is likely to get some minutes during La Liga match against Athletic Bilbao at Santiago Bernabeu on Sunday.\nMilitao, 26, tore his Anterior Cruciate Ligament (ACL) at the start of the season and was expected to be out till May but the Brazilian made an excellent recovery and is expected to play against Athletic.\n\"[It's] an important game that we go into with all the confidence in the world. Militao is back tomorrow, which is the most important news. He's not 100%, because he still needs to play football, but he's fine with the injury. That's very good news for us. We've had the bad luck of [Thibaut] Courtois' injury, but he'll be back soon,\" Ancelotti confirmed in a press conference on Saturday.\nThe Italian then talked about Eduardo Camavinga who picked up a niggle during the international break with France saying that he had problems initially but the Frenchman completed the training session normally.\n\"The team is fine. The international players have recovered well. We had a small problem with [Eduardo] Camavinga, but today he trained normally,\" Ancelotti added.\n\"We have a good feeling for tomorrow's game. We're playing against a team that's having a great season and is playing with great intensity. It has individual and organizational quality.”\nWith Militao being fit, it has been widely speculated that the Brazilian may feature against Manchester City in the Champions League quarter-final but Ancelotti decided to play it safe as the 26-year-old has just returned from a serious injury.\n\"We have to take it game by game. It may be that tomorrow I will give him minutes and we have time until the 9th to improve his condition,\" Ancelotti first said on this.\n\"The knee is fine, he just needs football, getting used to playing on the big pitch again and with his teammates. He's recovered very well.\"",
  "word_count": 328,
  "scraped_at": "2026-02-14T02:25:26.772174",
  "_text_extracted": true
}