{
  "article_id": "bf9495e401ba",
  "url": "https://news.sky.com/story/england-started-the-euros-being-doubted-but-showed-resolve-resilience-and-relentlessness-13402839",
  "title": "England started the Euros being doubted - but showed resolve , resilience and relentlessness",
  "date": "20250728T023000Z",
  "domain": "news.sky.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England started the Euros being doubted - but showed resolve, resilience and relentlessness\nThey showed how to fight back. How to win on penalties - twice. And above all, how to confront the most painful and challenging of situations.\nMonday 28 July 2025 02:14, UK\nBeing with the Lionesses before they boarded their bus - for a late night of partying - was to intrude in celebrations but glimpse into the mindset of champions.\nHow such resolve, resilience and relentlessness can be mustered by a group of players who have given so much, been through so much over the last month in Switzerland.\nThey leave as back-to-back European champions after conquering the world champions on penalties. Avenging the World Cup final defeat to Spain two years ago.\nWatch England's victory parade live on Sky News from 11am on Tuesday\nAnd yet they started the Euros being doubted - the first reigning champions to make a losing start. Twice they came close to elimination; saved both times by Michelle Agyemang.\nThey led for less than five minutes in the knockout stage.\nBut all that matters is the name engraved on the trophy - even if they took the scenic rather than the smooth route to glory.\nThey showed how to fight back. How to win on penalties - twice. And above all, how to confront the most painful and challenging of situations.\nHow many of those who posted racist abuse to Jess Carter are now celebrating the dogged defending that prevented Spain running away with last night's final?\nAnd after the final, Carter opened up to Sky News about how close she came to leaving this tournament - a week after revealing the scale of the racist abuse face.\nI'd just informed her about fans singing her name in Basel.\n\"It's incredible - I'm disappointed as to why it's come around and that's obviously really sad,\" Carter said in our post-match interview.\n\"I can't thank them enough. Because honestly without my fans, family and my teammates I'm not sure I'd ever have the courage to go back on the pitch and play again.\n\"I'm not really someone who struggles with the hate they receive because everyone has their opinion.\n\"But this tournament has been really tough and I wasn't sure I was going to be able to come back on the pitch and be me.\"\nHow grateful England are that she did stay.\nAnd how much appreciation for Lucy Bronze? Only after the final did the defender reveal she had been playing with a fractured tibia in all six matches here.\n\"I've not been training all the time,\" she said. \"But just played the games and fought for my team.\"\nIncluding when scoring England's final spot-kick against Sweden in the quarter-finals.\nAnd that shootout managed to feel even more dramatic and nervy - thanks to the four England misses - than the one that sealed victory over Spain.\nBecause England had Chloe Kelly to turn to. Just as they did three years ago in extra time of the final, scoring the winner against Germany at Wembley.\nBut football came to losing Kelly in January. After accusing Manchester City of trying to \"assassinate my character\", she nearly packed up her boots for good.\nArsenal restored her belief and ensured she came to Switzerland a Champions League winner, confidence back, ready to complete the job for England again.\n\"Thank you everyone who wrote me off, I'm grateful,\" Kelly said after scoring England's fifth and final penalty after Hannah Hampton's goalkeeping heroics.\n\"There were a lot of tears at full time especially when I saw my family. Those are the people that got me through dark moments.\"\nBut there will be so many moments of joy to take from these Euros, memories to bottle up, new superstars to embrace.\nBecause if it was not for Michelle Agyemang, England might not even have made it to the final.\nSo while Kelly takes the plaudits as the match winner again, just remember how the striker came to England's rescue.\nNot once - with the equaliser against Sweden from 2-0 down - but again to level in the 96th minute against Italy in the semi-final.\nAnd just remember how Agyemang is only 19, leaving her first tournament a champion.\nAs the Lionesses arrived back at their Euros base in Zurich early this morning, to party into the early hours, Heather Small's Proud was playing.\nThe players who made their triple European champion manager Sarina Wiegman proud - and the nation so proud, once again.\n\"We've shown resilience, we've shown character,\" forward Beth Mead said. \"And we've smashed it and won.\"",
  "word_count": 773,
  "scraped_at": "2026-02-14T02:09:18.626844",
  "_text_extracted": true
}