{
  "article_id": "bfec4a0b1d8f",
  "url": "https://www.twtd.co.uk/ipswich-town-news/37630/huws-we-have-real-unity-and-direction-now/onthisday",
  "title": "Huws : We Have Real Unity and Direction Now - Ipswich Town News",
  "date": "20240115T083000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wednesday, 15th Jan 2020 11:20\nMidfielder Emyr Huws believes the Blues now have “real unity and direction” and are starting to build having come out of their poor run of form. After ending their eight-game League One winless run by thrashing Accrington Stanley 4-1 at Portman Road on Saturday, the Blues drew 0-0 away against fellow promotion chasers Oxford last night in a wind and rain-affected game the Welshman feels they deserved to win.\nThe 26-year-old thought his team’s display in very trying conditions - the teams were taken off for 15 minutes in the first half to allow the pitch time to improve - was worthy of all three points and like his manager Paul Lambert was frustrated by some of referee Tom Nield’s decisions, not least the failure to award a penalty after James Norwood was fouled inthe box by John Mousinho in the first half.\n“I think the team effort and desire and togetherness was positive and that’s why we got a point, but a few refereeing decisions meant we didn’t get the three points,” Huws said.\n“I think we were on top in the first half and if we’d have got the decisions and gone [ahead] then it would have been a different game but all things considered I think a point is OK, it’s positive.”\nWhile a draw and a clean sheet away against Oxford, who are fifth, two places and two points behind the Blues with an impressive home record this season, looks a good result, Huws couldn’t hide his disappointment that Town couldn’t take all three points back to Suffolk.\n“Yes, we’ve seen them play in other games and they’ve done well in the past but I think we deserved the points today,” he added.\n“But a point in these conditions, the pitch in the first half was just a shambles in the middle, slipping everywhere, so it was tricky. And it’s another positive performance considering everything and we’ll take that into Tranmere.”\nReflecting on the first half conditions and the decision to suspend the game for 15 minutes, he said: “I’ve never had that go on for so long, usually the decision is made. I was freezing, and then we were asked to go again, so it was strange, really strange.\n“But fair play, the groundsman’s done a little bit of forking and the puddles went a little bit so it was alright, I guess.”\nAsked whether the conditions were a test of his fitness, he added: “I haven’t played a game like that for a while on that sort of pitch, which was shocking in the first half, in the middle especially.\n“The sides were OK but that middle patch was just like a minefield in there, slippy and the water and everything. But it was a good test I think and another positive.\n“Did it take more out of me than a normal pitch? I’ll wait and see tomorrow, see how I feel.”\nThe game was the former Cardiff man’s second full 90 minutes in four days as he continues his comeback from his long spell out with a knee injury and he thought he coped well.\n“I feel good,” he continued. “I wouldn’t say I feel as good as I did at Portman Road [on Saturday] but the conditions today were just sapping. The pitch was heavy, but I feel strong and I feel great and I feel like there’s still more to come and I’m excited for the games coming up.”\nHuws confirmed that he believes he’d be fine to play on Saturday and is pleased to have got more game time in recent weeks.\n“I haven’t played a lot and had a chance to get much of a rhythm and it’s tough when I’m coming back to fitness, trying to get a rhythm going,” he said.\n“I think I’m managing to do that now and it’s nice and it’s good for me personally to get a run. Hopefully I’ll get back to influencing the games more and getting the wins.”\nAre fans starting to see the real Emyr Huws again? “I think there are elements of my game that are coming and it’s nice and I’m glad to be helping the team.\n“I still feel there is more to come, but I’m happy in the body, I feel strong and I feel really good.”\nThe one-time Manchester City trainee is pleased to be back involved and competing in the midfield again and is looking forward to the rest of the season.\n“I think it’s exciting,” he added. “I’ve just got to keep working hard, all of us keep working hard, and it will come.\n“We had a little blip, those things happen and I feel like there is a real unity and direction now and it’s nice, and I think it’s building.”\nHuws is enjoying playing in midfield alongside Flynn Downes with Alan Judge ahead of them.\n“I think we’re building that nicely,” he considered. “I think Judgey’s been outstanding in the last few games, so has Flynny all season.\n“It’s been really nice playing with those two. Both are smart players, both know the game and know how to position themselves and we all help one another. It’s just nice.”\nManager Lambert has hinted that there will be less rotation in the second half of the season, however, Huws believes the squad will continue to be required.\n“I still think there will be changes and we need everyone because we’ve got so much talent in the squad,” he said. “Eleven players aren’t going to win this league, we’re all going to win this league together.\n“I’m sure that will be the case, people will come in and do the job. We need to win games and however we do that, whoever plays, we win need to win games and we need to get out of this league.”\nLambert has challenged players to aim to make a shirt their own and Huws says that competition for places will benefit the squad.\n“I think that’s standard throughout all professional sport, especially in football,” he added. “The competition, people have to perform and there are players their waiting to take your spot.\n“Healthy competition, we’re working hard in training, we’re putting the graft in and everyone’s pushing each other.”\nHuws admits he’s frustrated not to have scored a league goal this season - although he did net in the 4-0 Leasing.com Trophy victory over Gillingham - with his last league goal the final moments strike in the 3-1 victory over Newcastle at Portman Road in April 2017.\n“I know, I wish you’d not brought that up, but yes!” he laughed. “It’ll come. There were some chances today but the ball just didn’t sit. I’d like to add more goals and step by step I think I’ll get there.”\nLooking ahead to the weekend, Town would benefit from another game given their return to form over the last few matches, however, it seems likely the match at Tranmere will be postponed with the Prenton Park pitch waterlogged and last night’s FA Cup tie against Watford called off.\n“Nors [former Tranmere striker Norwood] did say it was bad but I didn’t know it was in jeopardy,” Huws added.\n“But if it’s bad again we’ve probably had a good little warm-up with this one to know how we need to play.\n“We have to play the conditions and we have to play smart, so we’ll go up there and go for the three points.\n“Nors said it was a cow field, it’s like cows have been on it for seven years. He played there for a few years, so he should be used to it!”\nPhoto: Pagepix\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nCOYBS let's do this..\n1) They need to stop getting bogged down in poor refereeing decisions. It's life, don't lose your focus on the game because of it.\n2) Play football, stick to your principles, work hard, do your triangles, and be more clinical in the box.\nWe have the quality to win this League imo.\nI like your take on us being in a good position to strike now, with perhaps fresher legs than some of our rivals. I just feel that we may have unnecessarily taken our feet off the gas at a time when we were 6/7 points clear of the field, bar Wycombe, with a game in hand, while our supposed biggest rivals, Sunderland and Portsmouth, were way off the pace.\nWe're all in the mix together again now though, and it is a straight run for the line until May; but those 2 sides seem to have sorted themselves out, Oxford have bought well in this window, Rotherham are undoubtedly a good side, as are Coventry, plus Doncaster (who I thought were the best side we played) are on a very good run despite tough fixtures. This all makes automatic promotion look as tricky a proposition now as it did before a ball was kicked this season, when perhaps it didn't have to be.\nThankfully we seem to be back on our game now, with the right players being picked in the right position.and a clear understanding of their role in the system. Between that, the fresh legs and the sheer quality of the squad, I still believe we should go up automatically.\nWhatever anyone says, or thinks about Lambert - it's taken long enough for the penny to drop for a so called (yet to be proven) top Manager.\nWe have the quality in our squad that many don't, and we can top this. However, there will be a need at times to grind out wins with effort, grit, and determination - players who don't fight shy of last night type conditions will be required.\nThe acid test will be if we have enough who fit the latter bill - on last nights show we have, but the end of season position will prove the point.\nRe-visit this post in May .... !!!\nBig 5 months coming up...have the players/squad got the bottle when the crunch really comes?\nSo I have just checked, Ipswich to Oxford, 140 miles, dual or motorway all the way, two hours twenty minutes!\nSo the players and staff I estimate of being around 30 people, the hotel most certainly will be no travel lodge, I would expect a minimum of £200 per person, kinnell! That's £6000! And we are supposed to be skint? But we can waste money like this!\nAre our players unable to sit on a luxury coach for such a short time and then be able to run around a bit? I,m puzzled on the logic, a trip way up north I yes I get that, but Oxford?\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1817,
  "scraped_at": "2026-02-14T01:48:39.900246",
  "_text_extracted": true
}