{
  "article_id": "c007d2612422",
  "url": "https://mufclatest.com/predicted-xi-4-3-3-ten-hag-must-get-this-united-team-winning-hojlund-a-class-act-and-he-must-be-paired-with-pellistri-garnacho/",
  "title": "Predicted XI : [ 4 - 3 - 3 ] Ten Hag must get this United team winning ; Hojlund a class act and he must be paired with Pellistri & Garnacho ! ",
  "date": "20231006T001500Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United take on Brentford in the Premier League at Old Trafford on Saturday afternoon as Erik ten Hag’s side look to come back from two defeats in their last matches. United were beaten 1-0 by Palace last weekend and 3-2 by Galatasaray on Tuesday night.\nIt is a worrying time for United, who despite money being spent in the summer, look no better for it. Granted, injuries have cost United with the majority of the defence out injured at this time. But it should not be like this. It has been toxic for years and that’s the Glazers.\nUnited desperately need to change their form and get points on the board. United sit tenth in the Premier League prior to any matches being played this weekend and sit bottom of their group in the UEFA Champions League after two matches and face problems there.\nPredicted Manchester United Starting XI – 4-3-3\nOnana;\nDalot, Varane, Maguire, Amrabat;\nFernandes, Casemiro, Mount;\nPellistri, Hojlund, Garnacho\nGoalkeeper: Onana\nAndre Onana had another terrible individual performance against Galatasaray at Old Trafford on Tuesday evening. Despite playing with his feet, his distribution and shot stopping ability is very poor. It looks like he could find himself alongside Massimo Taibi, Mark Bosnich and Roy Carroll.\nOnana is a player that takes the blame for his own actions, which is admirable, but he has not improved and just does not look the part in goal for United. Perhaps Altay Bayindir should be given a start to show what he can bring to the table this weekend?\nThe Cameroonian is a decent goalkeeper and did well at Inter Milan, but at this stage of the season, it is not working for him or United at this time, so something needs to be done to stop United from sinking much lower than they already have this season.\nDefenders: Dalot, Varane, Maguire, Amrabat\nUnited’s defence is injury hit with one fullback and four central defenders fit at this stage of the season. Sergio Reguilon could well be back in the squad this weekend, which would be welcomed but United need to get others back in order to change their fortunes.\nDiogo Dalot and Sofyan Amrabat will most likely keep their places in the fullback positions against Brentford, which is the last club match ahead of the second international break of the season. Both players have been doing well in this positions – why change it – not that it can be!\nIn the centre of the defence, Raphael Varane and Harry Maguire could be partnered to give rotation and rest to the likes of Victor Lindelof, who has played a lot of football recently. Maguire needs to raise his game after losing his place in the team this season. Varane is class though.\nMidfield: Fernandes, Casemiro, Mount\nUnited’s midfield has been poor this season. Casemiro is the clubs top scorer at this time but he will be suspended in the Champions League after his red card against Galatasaray on Tuesday evening. The Brazilian is a class act and will get a rest against FC Copenhagen – he will do better.\nBruno Fernandes should remain in the starting XI against Brentford, even if he does need a break after playing the most football of the last few years, according to FIFPro. He can change the game when in form and that is something that needs to be happening more and more now.\nMason Mount is back from injury and seemingly aiming to find something for United on the pitch to change the game. He’s a player that was an expensive signing and needs more good performances this season. The number seven has the talent and needs to find goals and assists.\nForwards: Pellistri, Hojlund, Garnacho\nUnited need to change for formation and play to the strengths of the attacking players against Brentford. Rasmus Hojlund should continue his centre-forward position for the club after scoring three goals so far this season – all of those in the UEFA Champions League.\nFacundo Pellistri should be back on the right-wing for United based what he can achieve for United. Granted, he has not scored any competitive goals for United at senior level but he does have one assist so far. He is a player worthy of a start because of his work rate and ability.\nOn the left-wing, Alejandro Garnacho should start ahead of Marcus Rashford, whose form has been terrible this season. Rashford does have one goal and three assists so far this season, but based on performances, he has been shocking. Garnacho should offer more in attack.\nSubstitutes: Bayindir; Lindelof, Evans; Eriksen, McTominay, Hannibal; Martial, Rashford, Antony\nUnited need something short of a miracle to find themselves competing for the Premier League title this season. It seems to be another season of work in progress – but major things need to change. On the bench, nine players will be named against Brentford.\nAltay Bayindir will most probably remain on the bench with Onana trusted to remain as the goalkeeper for the club. Whether it be for the right reasons or the wrong ones. In defence, United have just Victor Lindelof and Jonny Evans at this time.\nIn the midfield, Christian Eriksen, Scott McTominay and Hannibal may be the only midfielders on the bench against Brentford with United seeking a rare victory at this stage of the season. In attack, United have Anthony Martial, Marcus Rashford and Antony available.\nWritten by John Walker\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 927,
  "scraped_at": "2026-02-14T02:00:57.112703",
  "_text_extracted": true
}