{
  "article_id": "c02346ce2c6a",
  "url": "https://www.caughtoffside.com/2025/01/18/tottenham-open-signing-david-hancko/",
  "title": "Tottenham learn asking price for David Hancko",
  "date": "20250118T171500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are interested in signing the Feyenoord defender David Hancko.\nAccording to TBR Football, the 27-year-old defender will cost around £30 million and it will be interesting to see if Tottenham step up pursuit of the player with an official offer. The player has been linked with Chelsea as well.\nSpurs need a central defender before the transfer window closes. Their defensive unit has been ravaged by injuries and key players like Cristian Romero and Micky van de Ven have been sidelined with persistent injury problems.\nThey need to add more quality and depth to the side, and it will be interesting to see how the situation develops. Hancko has proven himself in the Eredivisie and he has the qualities to succeed in the Premier League as well.\nThe opportunity to move to England will be quite exciting for him, and Tottenham could be an attractive destination. They have an excellent squad and an exciting project. They will look to push for trophies in the coming seasons and they need quality players for that to happen.\nDavid Hancko could improve Spurs\nThe reported £30 million asking price might seem like a premium right now, but the player has the quality to justify the investment. He will help them tighten up at the back. The North London outfit have the resources to pay the reported asking price for the player, and it remains to be seen whether they are ready to break the bank for him.\nThey will be desperate for Champions League qualification this season and they need the right players to bounce back strongly during the second half of the season. They have been quite inconsistent so far, and they will need to raise their performance levels in the coming months.\nSpurs have been linked with players like Milan Skriniar as well, and it remains to be seen who they end up with.",
  "word_count": 315,
  "scraped_at": "2026-02-14T02:02:19.850705",
  "_text_extracted": true
}