{
  "article_id": "c02f61c2b0a8",
  "url": "https://www.teamtalk.com/manchester-united/harry-maguire-manchester-united-contract-aleksandar-stankovic-arsenal-transfer-battle",
  "title": "Man Utd : Major contract breakthrough imminent as battle with Arsenal for 20y / o sensation explodes",
  "date": "20260212T234500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMajor Man Utd contract breakthrough imminent as battle with Arsenal for 20y/o sensation explodes\nManchester United are more confident than ever that one of their most important stars will sign a new contract, while the Red Devils are reportedly set to do battle with Arsenal for an exciting young midfielder.\nUnited’s 1-1 draw with West Ham on Tuesday hasn’t dulled the optimism at Old Trafford, with Michael Carrick’s men still fourth in the Premier League table – on track for crucial Champions League qualification.\nIt remains to be seen whether Carrick will continue to lead the team next season, but work behind the scenes for the summer transfer window is well underway.\nBut just as important as new signings for United is retaining key stars, and we have revealed today how Harry Maguire looks set to stay at the club for another campaign at least.\nHarry Maguire expected to sign NEW Man Utd deal\nMaguire, 32, has been integral to United’s success since Carrick was appointed, starting every game since he took interim charge, of which the Red Devils have won four and drawn one in the Premier League.\nMaguire joined Old Trafford in a £80m (€97m, $115m) transfer in the summer of 2021, which remains to this day a world-record fee for a defender.\nHe penned a five-year contract with the club, worth a staggering £190,000 per week, and it expires at the end of this season, which has prompted speculation about his future.\nHowever, despite being eligible to open talks with overseas clubs since January 1, we can confirm that Maguire has not entered negotiations with any foreign sides at this stage.\nThat is because he remains fully committed to United, and he has every intention of staying. United, for their part, are open to offering an extension on significantly reduced terms.\nMaguire’s willingness to remain patient over contract discussions and not pester the club for an extension has strengthened his position, and we understand qualification for the Champions League would significantly boost the likelihood of a new agreement being reached.\nSources have not revealed the figures Maguire is willing to take at this stage. But his willingness to stay on reduced terms, commitment to the cause, and renewed importance only solidify his case.\nWe can reveal, though, that retaining Maguire will not impact the Red Devils’ transfer plans; they still intend to sign a new centre-back in the summer.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nMan Utd battle with Arsenal ignites\nMeanwhile, we revealed earlier today that United have accelerated their interest in Club Brugge midfielder Aleksandar Stankovic, identifying him as a top target.\nThe Red Devils are expected to face competition from Arsenal and Chelsea for the 20-year-old sensation, though, with the Gunners and Blues equally keen on securing his services.\nStankovic, son of Serbian icon Dejan Stankovic – came through the ranks at Inter Milan but never managed to force his way into the senior picture at San Siro. However, since joining Brugge last summer, he has shown his true potential.\nA senior recruitment figure who has tracked Stankovic extensively confirmed to us that interest has accelerated in recent months.\n“Arsenal, Chelsea, Spurs and United have been regular visitors to see Stankovic,” they said. “He is a real class act. Not dissimilar to a young Declan Rice – that’s the comparison for me.\n“You can see he’s inherited his class from his father. This kid is a major talent.”\nStankovic is open‑minded about his long‑term future, though Inter inserted a buy‑back clause when sanctioning his move to Brugge, with options active in the summers of 2026 and 2027.\nSources indicate the player would relish the chance to return to Inter one day, but he is also fully aware of the growing admiration from England and other major European leagues. The coming months will be crucial in determining who wins the race.\nLeeds United plot shock Old Trafford raid\nIn other news, a report claims that Leeds United are considering a shock move for United left-back Tyrell Malacia this summer, when his contract expires and he’ll be a free agent.\nThe two sides are long-time rivals, but the two sides have engaged in transfer dealings before, with Daniel James being the most recent example, having moved to Leeds in 2021, while Eric Cantona memorably left the Whites for United in 1992.\nLeeds are said to be ‘monitoring’ Malacia, who is not in the long-term plans at Old Trafford and has played just two minutes of Premier League football this term.\nSunderland are also said to be keen and are ‘ready to launch a summer raid’ for the 26-year-old.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 821,
  "scraped_at": "2026-02-14T01:59:36.827480",
  "_text_extracted": true
}