{
  "article_id": "c0503277f6ac",
  "url": "https://www.themag.co.uk/2025/09/nottingham-forest-owner-sacks-nuno-espirito-santo-due-to-recent-circumstances-premier-league/",
  "title": "Nottingham Forest owner sacks Nuno Espirito Santo due to  Recent circumstances  ",
  "date": "20250909T081500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nottingham Forest owner sacks Nuno Espirito Santo due to ‘Recent circumstances’\nThe Nottingham Forest owner has now sacked Nuno Espirito Santo.\nEvangelos Marinakis giving ‘recent circumstances’ as the justification for the decision.\nThe shameful Nottingham Forest owner having the official club statement (see below) published at 1am in the morning.\nThe writing has been on the wall ever since Marinakis disgracefully confronted Nuno on the pitch after Forest only drew with Leicester at home in their last game of the 2024/25 Premier League season.\n‘Recent circumstances’ at Nottingham Forest have seen Nuno do an incredible job that saw the club rise from being relegation fighters in their first two seasons after promotion, to them finish seventh last season and qualify for Europe. Forest only just missing out on Champions League football on the final day of last season.\nNottingham Forest also reached Wembley last season, losing to Manchester City in their FA Cup semi-final.\nThe 2025/26 Premier League season has seen a solid start, with a win, draw and defeat for Nuno and his Nottingham Forest players.\nNottingham Forest official announcement – 9 September 2025:\n‘Nottingham Forest Football Club confirms that, following recent circumstances, Nuno Espirito Santo has today been relieved of his duties as Head Coach.\nThe Club thanks Nuno for his contribution during a very successful era at the City Ground, in particular his role in the 2024/25 season, which will forever be remembered fondly in the history of the Club.\nAs someone who played a pivotal role in our success last season, he will always hold a special place in our journey.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 279,
  "scraped_at": "2026-02-14T02:09:24.928462",
  "_text_extracted": true
}