{
  "article_id": "c08972f0111a",
  "url": "https://www.caughtoffside.com/2024/10/26/tottenham-battle-aston-villa-andreas-skov-olsen/",
  "title": "Tottenham and Aston Villa want Andreas Skov Olsen",
  "date": "20241026T111500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are reportedly keeping tabs on the Club Brugge attacker Andreas Skov Olsen.\nAccording to Give Me Sport, they will face competition from Aston Villa and West Ham United as well.\nTottenham have made regular checks on the attacker in recent weeks and they could look to submit a formal offer for him soon. The Denmark international has impressed with his performances this season and it will be interesting to see where he ends up.\nSpurs could certainly use more quality in the wide areas and the 24-year-old could prove to be a solid acquisition. He will add pace, flair and goals to the side.\nThe attacker will be entering the final 18 months of his contract at the Belgian club and he could be available for a reasonable price. Tottenham should look to follow up on their interest with an official offer in the coming months.\nThey need more quality and depth in the side in order to compete for trophies regularly. They will be hoping to secure Champions League qualification as well.\nTottenham could use Andreas Skov Olsen\nRicharlison has struggled with injury issues this season and his performances have been quite inconsistent since the move from Everton. Tottenham could certainly use an alternative and the Denmark international could compete with the Brazilian for the starting spot.\nCompetition for places will help Tottenham improve as a squad. The 24-year-old will look to prove himself in English football and help the North London club push for major trophies.\nHe has the technical attributes to succeed in England and it remains to be seen whether Tottenham can win the race for his signature.\nMeanwhile, it is no surprise that Aston Villa are looking at the player as well. They are competing in the UEFA Champions League this season and they need a deeper squad to compete at this level. Unai Emery needs to rotate his squad more often in order to keep the key players fresh and adding a versatile winger like Skov Olsen would be a wise decision.\nBoth clubs have the finances to get the deal done and it remains to be seen where the 24-year-old ends up.",
  "word_count": 361,
  "scraped_at": "2026-02-14T02:01:51.712728",
  "_text_extracted": true
}