{
  "article_id": "c099eac496c2",
  "url": "https://theathletic.com/4676923/2023/07/10/england-rice-bellingham-euros/",
  "title": "English footballers are in demand more than ever – and it not an accident",
  "date": "20230710T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is coming up to 10 years since football reporters and influential figures across the game were invited to what was described as a “call to arms” for English football.\nThe choice of location was poignant. In 1991, the Millbank Tower, on the banks of the River Thames, had been the scene of one of the momentous meetings in English football history: the secret gathering of club chairmen and a television executive that proved the catalyst for the breakaway movement that ushered in the Premier League era.\nAdvertisement\nTwenty-two years on, in September 2013, the same TV executive, Greg Dyke, was chairman of the FA when he chose the same venue to issue his rallying cry.\nDyke spoke of the “unintended consequences” of the Premier League’s growth. Its huge success, he said, had come at a cost for homegrown players and for the England men’s team, which was enduring one of those familiar periods of sustained underperformance. With the number of homegrown players in the Premier League falling sharply by the year, Dyke warned of a bleak future for England at international level.\nIt was already a fairly bleak present. Since reaching the quarter-finals of three consecutive tournaments under Sven-Goran Eriksson, England had failed to qualify for Euro 2008, been outclassed by a far younger, slicker Germany team at the 2010 World Cup and seen their limitations exposed by Italy at the quarter-final stage of Euro 2012. They would go on to finish bottom of their group at the 2014 World Cup and crash out of Euro 2016 against Iceland in the round of 16.\nBy the autumn of 2013, the famed “golden generation” was on its last legs — almost literally so in the cases of Ashley Cole, Steven Gerrard and Frank Lampard — and there was very little top-class talent coming through to take the burden.\nEleven of the 27 players called up by Roy Hodgson for that month’s World Cup qualifiers were aged 24 or under. But of those 11, only Raheem Sterling and Kyle Walker ended up winning 50 caps. Most of the others won more caps than you might remember — Theo Walcott (47), Jack Wilshere (34), Ross Barkley (33), Chris Smalling (31), Phil Jones (27), Daniel Sturridge (26), Andros Townsend (13), Tom Cleverley (13) — but, whether due to form or fitness issues, none became a long-term fixture in the England team at a time when competition was far less intense than now.\nAdvertisement\nAt that summer’s European Under-21 Championship finals, England had finished bottom of their group, beaten by Italy, Norway and Israel. Of the squad Stuart Pearce took to Israel, only Jordan Henderson and Danny Rose won more than 20 caps for England at senior level. Only a handful of the others (Wilfried Zaha, who switched allegiance to the Ivory Coast, Nathaniel Clyne, Craig Dawson, Jonjo Shelvey, Nathan Redmond and, eventually, Jason Steele) went on to establish themselves in the Premier League.\nThe same summer, at the Under-20 World Cup in Turkey, England finished bottom of a group containing Iraq, Chile and Egypt. The under-19s and under-17s failed to qualify for their respective European Championship finals that summer. English football was not developing enough players of the required calibre and when it did, there were concerns about both the lack of opportunity at Premier League level and the absence of a recognisable culture in the national team setup.\nElsewhere on The Athletic…\n- Did that really happen? Barbados v Grenada and a deliberate own goal\n- Liverpool looked for talent at U21 Euros – but they already own two of the winners\nDyke reeled off some more statistics: only 25 per cent of those players signed by Premier League clubs that summer had been English (and most of them by clubs in the bottom half); English players accounted for just 32 per cent of those in starting line-ups in the Premier League the previous season (down from 69 per cent in 1992-93 and 38 per cent in 2002-03); of the 220 players who started matches in the Premier League the previous weekend, only 65 (29.5 per cent) were English — and there were serious concerns about the quality as well as the quantity.\n“We already have a small talent pool and it’s getting smaller,” Dyke said. “In future, it’s quite possible we won’t have enough players who are playing regularly at the highest level in this country or elsewhere in the world. As a result, it could well mean England’s teams are unable to compete seriously on the world stage.”\nSo Dyke set English football two targets: to reach at least the semi-finals of Euro 2020 and to win the World Cup in 2022 — “oh, and by the way, to show we are making progress along the way, I’d like to see us do well in the Under-20 World Cup in 2017”.\nBut for any of that to happen, he said, would require huge changes in outlook within English football — an increased commitment to developing talent at grassroots and academy level, giving those players the opportunity to flourish at first-team level and establishing a clearer identity and culture around the national team. He set up a commission to look for radical solutions to what he called “a serious and growing problem”.\n“English football,” he said, “is a tanker which needs turning.”\nAdvertisement\nNearly 10 years on, Dyke is happy to tell The Athletic he feels the tanker has turned.\nIt isn’t quite where he hoped it would be, but English football is on a journey after years, perhaps decades, of complacent drift. “If the question is, ‘Has the tanker turned?’, I feel it has, yes,” the former FA chairman says.\nThe obvious thing to say is that England didn’t win the World Cup in 2022, a promising campaign ending in defeat by France at the quarter-final stage.\nBut that was having reached the semi-final in 2018 and the final of Euro 2020 (played in 2021 due to Covid-19). The World Cup was an “if only” story — Harry Kane suffering a rare loss of composure from the penalty spot — rather than one meriting the usual handwringing and demands for root-and-branch reform.\nEngland are fourth in the FIFA rankings and are among the favourites for Euro 2024, having started their qualifying campaign with four wins out of four (including a first competitive victory over Italy since 1977).\nOn Saturday evening, England won the European Under-21 Championship for the first time since 1984, beating Spain 1-0 in the final, with goalkeeper James Trafford the hero after saving a penalty from Abel Ruiz in the ninth minute of stoppage time. Anthony Gordon was named player of the tournament and it says much about England’s performance in Georgia that there would have been several other strong candidates in Lee Carsley’s squad, not least Trafford and defender Levi Colwill.\nThe triumph at under-21 level would probably have been met with more excitement had it been unexpected. But it is far more encouraging when it is a continuation of a successful recent trend. For Angel Gomes, Morgan Gibbs-White and Emile Smith Rowe, it was a second trophy success at international level, having won the Under-17 World Cup in 2017. Marc Guehi, Connor Gallagher, Phil Foden and Jadon Sancho were also part of that victorious under-17s squad and would still be eligible to play at under-21 level, as would Jude Bellingham and Bukayo Saka. It is a seriously talented crop of players.\nBetween 1994 and 2013, England reached just five finals at age-group level. Often they were eliminated at the group stage or missed out on qualification altogether.\nSince 2015, they have been runners-up at European under-17 level in 2017, winners at European under-19 level in 2017 and 2022, winners of the Under-20 World Cup in 2017 and now winners of the European Under-21 Championship, with high hopes for the Under-17 World Cup in Indonesia later in the year.\nAdvertisement\nAs for the number of homegrown players in the Premier League, that long-term slump has been arrested, albeit not yet reversed. From the 38 per cent figure highlighted by Dyke in 2011-12, it dropped as low as 30 per cent by 2018-19, but then rose to 38 per cent in 2020-21 before dropping sharply again and picking up slightly to 34 per cent last season.\n“I still don’t feel we have reversed that trend enough,” Dyke says. “It’s still very difficult for English youngsters to play regularly in the Premier League and we have some brilliant young players now, haven’t we?”\nThe quality is clear. English footballers are in demand in a way that simply wasn’t the case a decade ago.\nIn the summer of 2013, when Premier League clubs spent £630million (now $808m) in the transfer market, barely 10 per cent of that sum went on English players. The biggest of those fees were for Andy Carroll (Liverpool to West Ham United for £15million) and Steven Caulker (Tottenham Hotspur to Cardiff City for £8million), followed by Gary Hooper, Stewart Downing, Tom Huddlestone, Curtis Davies, Dwight Gayle and Nathan Redmond.\nA decade later, the biggest fee paid in world football so far this summer has been for England midfielder Bellingham, joining Real Madrid from Borussia Dortmund for an initial £88.5million, potentially rising to £115million. That initial outlay will be exceeded when Declan Rice completes his £105million move from West Ham United to Arsenal. The fees paid for Mason Mount (even though he was in the final year of his contract at Chelsea) and James Maddison are also among the 10 biggest this summer.\nWhen it comes to the size of these fees, the easy response is to say that English players have always been overpriced. It is true, but the English premium has usually meant big fees for middle-of-the-road players, leading clubs to look overseas instead. Before the summer of 2021, Harry Maguire was the only English player to have commanded a fee in excess of £50million. Now, three of the 12 most expensive players on the planet are Bellingham, Rice and Jack Grealish.\nAccording to the CIES Football Observatory, three of the nine most valuable players in world football right now are English: Saka (third), Bellingham (fourth) and Foden (ninth). Eighth on that list is Jamal Musiala, who was born in Germany but moved to England at the age of seven — not English, but certainly a product of English football, as is Borussia Dortmund’s new €30million signing Felix Nmecha, a German international but one who spent his formative years at Manchester City’s academy.\nAdvertisement\nAnother 12 English players are in the top 100, some of whom (Marcus Rashford, Trent Alexander-Arnold and Harry Kane) would be considerably higher if they had more time left on their contracts.\nThe CIES algorithm considers market forces as well as talent — which means players in the Premier League are generally more expensive in their model — but, again, the sight of so many English players near the top of their rankings is a new phenomenon. Ten years ago, at the time of Dyke’s speech, the highest-valued were Wayne Rooney (eighth), Theo Walcott (29th), Daniel Sturridge (36th), Joe Hart (50th), Jack Wilshere and Danny Welbeck (joint 51st) and Phil Jones (56th).\nFees for English players have always been inflated; the difference in 2023 is that the biggest clubs and best coaches tend to feel those fees are worth paying — and that represents quite a change in an era when English talent was at serious risk of getting left behind.\nPep Guardiola had only been at Manchester City a matter of months when he started talking up the quality of the English players he had seen in the Premier League, name-checking Kyle Walker, Danny Rose, Eric Dier, Dele Alli and Kane, who were playing together under Mauricio Pochettino at Tottenham Hotspur, as well as two of his own players, Stones and Sterling.\nHe also made the point — irrefutable — that English talent is overpriced. Signing these players is “impossible”, he said. “It’s so expensive.”\nBut as the years have passed, he has embraced English talent. Sterling has since moved on to Chelsea, but he, Walker and Stones have made huge contributions to City’s success in the Guardiola years, as have Foden and Grealish more recently. Rico Lewis, 18, started 16 matches in all competitions this season and attracts the same kind of hushed tones Guardiola previously reserved for Foden.\nIt takes more than just talent to play for Guardiola. It takes a deeper understanding of tactical and technical nuances: not just pausa and the need to dominate possession, but the ability to adapt to switch formations and positions, with and without the ball. Stones and Lewis have excelled in that regard, taking risks in possession and moving seamlessly from defence to midfield in build-up play, which flies contrary to everything previous generations of English footballers were taught.\nAdvertisement\nSeveral of the players who reached the European Under-21 final with England in 2009 — Joe Hart, Micah Richards, Lee Cattermole, Mark Noble, James Milner, Theo Walcott — went on to have good careers in the Premier League (outstanding in the case of Milner). But that night in Malmo, they were comprehensively outclassed by a Germany team who, technically and tactically, were on another planet as they ran out 4-0 winners.\nTo quote the football writer Jonathan Wilson, six of Germany’s squad (Manuel Neuer, Jerome Boateng, Mats Hummels, Benedikt Howedes, Sami Khedira, Mesut Ozil) went on to win the World Cup five years later, whereas seven of England’s squad (Cattermole, Nedum Onuoha, Danny Rose, Adam Johnson, Jack Rodwell, Craig Gardner, Fraizer Campbell) went on to play for Sunderland. As a long-suffering Sunderland fan, Wilson can make that sound every bit as acerbic as it is intended.\nLast time England reached a European Under-21 final was in 2009 when they lost to Germany. Six of Germany’s squad went on to win the World Cup, seven of England's went on to play for Sunderland.\n— Jonathan Wilson (@jonawils) July 5, 2023\nFor a long time, it felt like club academies in England were developing a certain class of player who might or might not be skilful enough and hardened enough to adjust to the attritional football of the Premier League, but were unlikely to thrive at elite level in the Champions League or at the upper echelons of the best European leagues. That sense of inferiority only grew as Guardiola’s influence spread, preaching a technical, possession-based style that was so far removed from English football orthodoxy.\nBut look at English football now. Look at the way Stones has developed into a perfect Guardiola player at City. Look at the way Alexander-Arnold has flourished into a multi-dimensional full-back (and perhaps, this coming season, a multi-dimensional midfielder) at Liverpool. Look at the range of qualities Rice and Bellingham bring to the central-midfield role. Look at Saka, look at Foden. Look at Musiala and Nmecha. Look at the way Colwill, Curtis Jones, Jacob Ramsey, Gordon, Gomes, Gibbs-White and others have illuminated the under-21 finals in a team playing in a distinctly modern style.\nThe technical standard required has never been higher. In stark contrast to a decade ago, English footballers are rising to it.\nIf English football’s “golden generation” stretched roughly from players born in 1974 (Sol Campbell and Paul Scholes) to those born in 1982 (Jermain Defoe), then no fewer than 15 of them won at least 50 England caps and seven of them (Gary Neville, David Beckham, Lampard, Rio Ferdinand, Michael Owen, Gerrard, Cole) won at least 80. Many of them excelled at the very highest level of English and European football for more than a decade.\nOf the generation that came next, born between 1983 and 1992, only seven (Rooney, Glen Johnson, Milner, Hart, Gary Cahill, Henderson and Walker) have reached the 50-cap milestone and only Rooney reached 80, though Henderson and Walker are very close to doing so.\nOf those born since, Kane and Sterling have already passed 80 caps by their late 20s. Stones will do so in the next year or so. Rice, 24, is only seven caps short of a half-century. Mount, 24, Foden, 23, Saka, 21, and Bellingham, 20, already have 36, 25, 28 and 24 caps respectively. Alexander-Arnold and James would have far more if the competition at right-back were not so intense. With so much talent in the under-21 team, this is a generation of players who look capable of thriving at the highest level over the coming years.\nAdvertisement\nIt hasn’t come about by accident. Just as the previous decline in English talent reflected years of complacency when it came to youth development, with nothing like enough emphasis on technical skills, the turnaround reflects a serious (and long-overdue) commitment to addressing the shortcomings Dyke highlighted.\nIn truth, that improvement was already in the pipeline at the time of Dyke’s “call to arms”. A year earlier, the Premier League introduced its Elite Player Performance Plan, designed to modernise and professionalise youth development, demanding greater investment in facilities and coach education, increasing the number of “contact hours” and placing greater emphasis on technical development.\nThe FA would cite changes it made earlier at grassroots level. Southgate was part of a team that lobbied the FA Council to accept the need for increased investment in coach education and a commitment to small-sided games on small pitches, moving away from the previous absurdity of 11-year-olds playing on full-size pitches with full-size goals, encouraged to boot the ball forward as quickly as possible.\nBellingham, Foden and Saka are among those who have developed through a far more enlightened, more structured technical development programme.\nThey have also been brought through an England setup in which international duty is something to be enjoyed rather than endured. It reflects the work done by Southgate and others, such as Dan Ashworth, Dave Reddin, Matt Crocker and Owen Eastwood, to change the culture around the national team, establishing what they called “the England DNA” and creating a more holistic, unified environment in which players feel a far greater sense of belonging.\n“Basically we pinched the Spanish model, where there’s a clear identity right the way through to the senior team,” Dyke says. “In the past, there was no real sense of what the England identity was, but Dan Ashworth and Gareth created much more of a club environment.\n“On top of that, we (the FA) put millions of pounds into it. First of all, it was the decision to build St George’s Park and then we put a lot more money into the England team structure, bringing in analysts, psychologists etc. Dan had a plan and a strategy and a lot of what you see now is what he put in place.”\nAdvertisement\nAmid all the justifiable optimism, there is a nagging concern. Southgate spoke about it a few months ago, pointing out that the number of homegrown players in the Premier League has dropped sharply again.\n“We are pouring millions into youth development and there has been brilliant investment for a long, long period of time and we are seeing some benefit of that,” the England manager said. “But talent has to meet opportunity to get there.”\nSouthgate pointed out that Marcus Rashford might never have got the opportunity at Manchester United had it not been for an injury crisis in early 2016 and Mount and James might have faced the same fate as so many outstanding Chelsea academy graduates in the past had the club not been hit with a transfer ban in 2019. Would Kane have made the breakthrough at Tottenham Hotspur if Roberto Soldado or Emmanuel Adebayor had shown a scoring touch? Probably not.\nAlexander-Arnold, James, Rice, Mount, Saka, Foden and others have excelled since making the breakthrough in the Premier League. Bellingham and Sancho thrived so spectacularly at Borussia Dortmund that they earned big-money transfers to Real Madrid and Manchester United respectively. But the desire to integrate homegrown talent seems to come and go in waves at many clubs. It is nothing like as simple as the appealing notion that “the cream always rises to the top”.\nIn 2020-21, no fewer than 15 English players under the age of 21 (when the season began) started at least 10 games in the Premier League. The following season, that figure dropped to 11. In the campaign that has just finished, there were only five (Saka at Arsenal, Lewis at Manchester City, Harvey Elliott at Liverpool, Gordon at Everton and Newcastle United and Colwill on loan at Brighton from Chelsea). Of those, only Saka started more than half of his team’s matches. At a time when academies are producing players of the required quality, that is a worry.\nIt will be fascinating to see how many of this squad play regularly in the Premier League in the season ahead: James Trafford at Burnley, Gibbs-White at Nottingham Forest and Ramsey at Aston Villa, surely, but others will find it tough.\nColwill is still seeking assurances about his future at Chelsea, who signed another excellent young left-sided central defender, Benoit Badiashile, for £33.7million in January; Curtis Jones and Harvey Elliott will find the competition for midfield places at Liverpool has intensified; injuries and the arrival of some high-class players in attacking positions have raised doubts about Smith Rowe’s prospects at Arsenal; as promising as Taylor Harwood-Bellis, Tommy Doyle and Palmer are, establishing themselves in an all-conquering Manchester City team is a daunting challenge.\nAdvertisement\nThat figure of 33.2 per cent means that, on a typical weekend last season, there were 73 English starters in the Premier League. Some weekends it was as low as 66. That is a big enough pool from which to pick an England squad, but it is also a concern if some of the best homegrown youngsters are not getting a look-in. Beyond the needs of the England manager, Southgate suggests there is an “ethical question” about ensuring there is a pathway for players to develop beyond academy level.\nIt was not easy to make that case at a time when Premier League academies were not producing enough players of the required quality. But a decade on, it is clear the quality is there.\nLast week, Dyke went to the National Theatre to see Dear England, a play based on Southgate’s ongoing mission to restore pride and hope in a team that Time Magazine once memorably described as the most disappointing in world sport.\nDyke was amused to see he was portrayed, briefly, as “a bit of a yobbo”. There are plenty of others who are caricatured far less flatteringly.\nWhat the story really needs — what English football really needs — is a crowning glory like that achieved by the women’s senior team last summer. Success had rarely seemed more remote for England’s men than when Dyke set his target just under 10 years ago (though rock bottom arguably wasn’t reached until that calamitous defeat by Iceland at Euro 2016). It looks far more achievable now.\nDyke’s famous countdown clock at St George’s Park, which ticked down the years, months and days to the 2022 World Cup final, quietly reached zero eight days after England had departed the tournament, ruing Kane’s penalty miss in the quarter-final against France.\n“But we could have won it in Qatar,” the former FA chairman says. “I honestly don’t think we were far away. If Harry Kane could have scored that penalty, I think we would have won it.”\nAdvertisement\nDyke is an optimist by nature. It is why, with English football at a low ebb in 2013, he set targets which many thought were unrealistic. It is why, after seeing England fall at the semi-final stage of the 2018 World Cup, the final of Euro 2020 and the quarter-finals of the 2022 World Cup, he is predicting glory at Euro 2024.\n“I think we will win it,” he says. “I do. The last three tournaments we’ve done well. Now is the time to win.”\nIt is easier said than done, of course; tournament football so often comes down to luck and small margins. In terms of the bigger picture, there are still concerns about whether, even with such a promising crop of young players, English football has the patience to allow those players to flourish and fulfil their potential.\nThe one thing that can be said with certainty is that, from no-hopers a decade ago, England now look like contenders thanks to an exciting generation of players who have thrived in the national team setup, many of them having already tasted success at youth level. Cast your mind back a decade, remembering how bleak things were, and it really does feel as if the tanker has turned.\n(Top photos: Getty Images; design: Sam Richardson)",
  "word_count": 4131,
  "scraped_at": "2026-02-14T02:07:08.868210",
  "_text_extracted": true
}