{
  "article_id": "c0ba6b973524",
  "url": "https://www.fourfourtwo.com/news/everton-in-bid-for-liam-delap-as-david-moyes-scuppers-former-side-report",
  "title": "Everton in bid for Liam Delap , as David Moyes scuppers former side : report",
  "date": "20250502T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Everton in bid for Liam Delap, as David Moyes scuppers former side: report\nEverton are making an unexpected entry to the race for Ipswich Town striker Liam Delap\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nEverton have become a surprise name on the list of potential destinations for Ipswich Town striker Liam Delap this summer, according to a report.\nThe 22-year-old has been one of the rare bright sparks in a difficult season for the Tractor Boys, but with their relegation confirmed, it’s expected he’ll be joining a new club in the upcoming transfer window.\nInterest in him is only accelerated by the widely reported £30m release clause in his contract, made active when Ipswich’s demotion was confirmed.\nEverton boss David Moyes to take on former employer for Liam Delap\nThat makes him affordable to a number of sides, not least Everton, who, as things stand, are set to lose striker Dominic Calvert-Lewin when his contract expires next month and are keen to bring in Delap this summer, according to TEAMtalk.\nBut the cut-price deal available for one of England’s most exciting young forwards has also drawn the attention of the big boys – one of which is very familiar to David Moyes.\nThe Everton boss – ranked at no.10 in FourFourTwo's list of the best Premier League managers ever – will need to brush off interest from Chelsea and his former employers, Manchester United, to land Delap.\nThe same report reveals that the Red Devils have made a similarly big effort to convince Delap of the project at Old Trafford, with the likes of Rasmus Hojlund having a difficult time lately.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nMoyes had similar struggles during his time at the Theatre of Dreams, handed the unenviable task of becoming Sir Alex Ferguson’s replacement in 2013 and lasting just over nine months.\nManchester City are reported to hold a buy-back clause over academy graduate Delap, but are not thought to be in the race with Erling Haaland and Omar Marmoush at their disposal.\nIn FourFourTwo’s opinion, there seems to be little lasting ill will for the 62-year-old in Manchester, but that could be subject to change if he deprives United of a clear answer to their goalscoring woes.\nEverton have an uphill battle in convincing Delap to join Everton over the Red Devils or Chelsea, both of whom could have Champions League football next season.\nBut the young striker may well enjoy a similar seniority he has enjoyed Portman Road this campaign, taking another season or so to build his Premier League stature with the Toffees before taking the next step to one of Europe’s heavyweights – at least that’s the argument Everton will surely be making in the coming weeks.\nDelap is valued at €35m according to Transfermarkt. Coincidentally, Everton next face Delap and Ipswich Town when Premier League action returns this weekend.\nIsaac Stacey Stronge is a freelance football writer working for FourFourTwo, Manchester United and Football League World. He has been a season ticket holder at Stockport County throughout the Hatters’ meteoric rise from the National League North to League One and is a die-hard Paddy Madden fan.",
  "word_count": 638,
  "scraped_at": "2026-02-14T01:58:31.682249",
  "_text_extracted": true
}