{
  "article_id": "c10859548af8",
  "url": "https://www.denverpost.com/2025/12/12/report-colorado-rapids-tottenham-hotspur-assistant-matt-wells-head-coach/",
  "title": "Colorado Rapids to name Tottenham Hotspur assistant Matt Wells as head coach",
  "date": "20251212T210000Z",
  "domain": "denverpost.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Colorado Rapids will name a cross-town organizational rival as their next head coach. And still, it feels like a potential home run.\nThe club is set to hire Premier League club Tottenham Hotspur assistant coach Matt Wells, 37, as its next head coach, sources confirmed to The Denver Post. The Athletic first reported the hire.\nWells was the Champions League club’s top assistant to Ange Postecoglou last season, when the Spurs finished 17th in the Premier League but defeated Manchester United in the Europa League final to clinch a CL berth. His other assistant coaching stops include Fulham, AFC Bournemouth and Club Brugge.\nWells grew up in the Tottenham academy system and has family pedigree in football — his grandfather, Cliff Jones, is a Tottenham legend from the 1960s and played for Wales in the 1958 World Cup. Injuries derailed Wells’ path toward a potential debut with the first team, so he turned to coaching and earned a UEFA B coaching license at just 20.\nTottenham is a top rival to Kroenke Sports & Entertainment-owned Arsenal, but there is proven precedent to Premier League assistants succeeding in their first head-coaching roles in MLS. Current Minnesota United coach Eric Ramsay went from being an assistant at Manchester United to leading his first team in Minnesota in 2024. The Loons have steadily climbed from an 11th place finish before Ramsay joined to fourth place and a Western Conference semifinal appearance this season.\nRamsay, who was 32 when he joined Minnesota, was the youngest-ever head coach in MLS. Wells will be one of the youngest in the league immediately.\nSources added that Wells will travel to Colorado early next week and join the team. Tottenham plays against Nottingham Forest on Sunday, but it’s unclear whether Wells will be on the bench for that match.\nWells will have an exciting, but somewhat disjointed roster to work with in 2026. A talented young spine of Paxten Aaronson, Cole Bassett, Rafael Navarro and Josh Atencio, along with seasoned veterans like Zack Steffen and former Arsenal defender Rob Holding, gives Wells options and the potential to be good from the start of next season. That talent was there at the end of 2025, but was used in a suboptimal way and given too little time to mesh as the Rapids plummeted in the west standings.\nTottenham plays in a 4-2-3-1 system just like the Rapids (mostly) have for the past two years under former coach Chris Armas. Right now, that’s what seems to suit the current roster best, but free agency began this week in MLS and the transfer window will begin in January.\nAfter Armas was hired ahead of the 2024 season, the Rapids brought in Steffen and spent a club-record transfer fee on Djordje Mihailovic. KSE President of Team and Media Operations Kevin Demoff was coy on committing to spend big on the roster during a press conference in October, but that could change with experience and credentials as demanding as someone like Wells, despite this being his first head-coaching stint.\nWant more sports news? Sign up for the Sports Omelette to get all our analysis on Denver’s teams.",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:27:05.511797",
  "_text_extracted": true
}