{
  "article_id": "c110540dd4e4",
  "url": "https://mwnation.com/wanderers-to-join-caf-tourney/",
  "title": "Wanderers to join CAF tourney - Nation Online",
  "date": "20251222T201500Z",
  "domain": "mwnation.com",
  "source_country": "Malawi",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wanderers to join CAF tourney\nDays after winning the 2025 TNM Super League title, Mighty Wanderers have wasted no time to declare their interest to join the 2026/27 Confederation of African Football (CAF) Champions League.\nThe Nomads earned their slot in the elite continental club tournament after sealing the domestic top-flight title with a 6-0 thumping of Mzuzu-based Moyale Barracks on Saturday at Kamuzu Stadium in Blantyre.\nThe club’s director for football David Kanyenda was quoted by Zodiak Broadcasting Station as having said that their target will be to reach the group stages of the competition.\nOn what makes them think they can perform well in the Champions League having failed to make it past the first hurdle in the CAF Confederation Cup earlier this year, he said: “We will have thorough preparations, we know it is for the elite, but we will not be joining just to make the numbers.\n“We will also beef up the squad.\n“It should also be borne in mind that in the Confederation Cup, we were knocked out [by Botswana club Jwaneng Galaxy] on post-match penalties, which are like a lottery. We won 1-0 at home and they beat us by a similar margin away.”\nKanyenda said there were lessons learnt from the tournament.\n“Most of our players are now exposed to playing on the international stage, including those that have played for the national team,” he said.\nFollowing Wanderers’ exit from the Confederation Cup, the club’s president and board chairperson Thomson Mpinganjira, who pumped in K500 million, said: “You do not invest money to lose it. You invest to make more money and in football, you invest to win.”\nFootball analyst Parry Chinyama hailed the Nomads for their interest to join the Champions League.\nHe said: “Good idea for Wanderers to start contemplating joining the CAF Champions League. However, there is need for some homework to improve their standard of play.\n“Yes, they have depth in their squad, but they lack the killer punch upfront. They need to beef up.\n“They also need a towering defender who can command the backline.\n“They should have teams like Mamelodi Sundows of South Africa, Young Africans and Simba from Tanzania as well as North and West African clubs as a yard stick to prepare. In the process, they should arrange friendlies with big clubs from around the continent.”\nSilver Strikers, who won the Super League title last season, competed in the CAF Champions League and were booted out in the second preliminary round by Young Africans.\nAnother analyst Charles Nyirenda said: “In order to make progress, a team has to play against those who offer stiffer resistance which CAF competitions offer.\n“In terms of strength of squad, I would say there is more they need to do such as getting the rihgt balance. Attacks on the left side have been poor because of improvisation of players that side. Hardly did the team register decent crosses to bother opposition teams.\n“Thrust in midfield was not up to scratch because they were staffed with too many holding players. The attack side requires beefing up so that strikers get the service they need allowing for fast transitions that turn defence into potent forward incursions.\n“Last season, they joined Confederation Cup and fell short at the very first step and now they need to closely look at why things didn’t go as planned.",
  "word_count": 563,
  "scraped_at": "2026-02-14T02:12:17.556119",
  "_text_extracted": true
}