{
  "article_id": "c1353bf8f807",
  "url": "https://metro.co.uk/2025/11/03/viktor-gyokeres-misses-arsenal-training-injury-blow-key-teammate-returns-24601866/",
  "title": "Arsenal star Viktor Gyokeres misses training amid injury scare | Football",
  "date": "20251103T133000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal look destined to be without striker Viktor Gyokeres for Tuesday Champions League game against Slavia Prague.\nThe Sweden international ended a six-game goal drought in Saturday’s win over Burnley but was taken off at half-time following what Mikel Arteta described as a ‘muscular injury’.\nGyokeres was absent from Arsenal’s open training session on Monday morning and now faces a race against time to be fit for Saturday’s Premier League game against high flying Sunderland.\nGoalkeeper Kepa Arrizabalaga also missed the session, although Martin Zubimendi, who also failed to complete 90 minutes at Turf Moor, did take part.\nThe Spain international midfielder, however, will miss the game in Czech Republic through suspension having already accumulated three yellow cards in the competition.\nHow Arteta chooses to offset the absence of Gyokeres remains to be seen but his options are far from plentiful.\nNatural replacements Gabriel Jesus and Kai Havertz remain unavailable, while Gabriel Martinelli is also currently nursing a muscle injury.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nLeandro Trossard, who has been a regular on the left wing in recent weeks, represents one option while Mikel Merino could again deputise in the position he filled so capably towards the end of last season.\nTeenager centre forward Andre Harriman-Annous, meanwhile, made an eye-catching debut in last week’s Carabao Cup victory against Brighton and could be included in the matchday squad.\nMore Trending\nThe likely absence of Gyokeres will come as a blow to Arteta whose side will be looking to extend their 100% start to the Champions League group stage and take a significant step closer to securing automatic qualification for the next round.\nAfter an erratic start to life at his new club, the summer signing from Sporting Lisbon produced his most accomplished display in an Arsenal shirt to date against the Clarets, according to his manager.\n‘His high press, his position and his touches, his threading behind, the way he linked play, the way he got us from this situation to transition moments,’ said Arteta in praise of Gyokeres.\n‘I think he was in a really good moment. It’s a shame that he felt something.’\nMORE: Rio Ferdinand disagrees with Gary Lineker over Arsenal’s £64m ‘flat-track bully’\nMORE: Wojciech Szczesny tells Manchester United they are selling ‘unstoppable’ star\nMORE: Pep Guardiola makes Arsenal title claim after Man City and Liverpool wins",
  "word_count": 439,
  "scraped_at": "2026-02-14T02:03:26.538049",
  "_text_extracted": true
}