{
  "article_id": "c138546ea8dc",
  "url": "https://www.yahoo.com/news/why-sir-jim-ratcliffe-second-160436881.html",
  "title": "Why Sir Jim Ratcliffe second year in charge at Manchester United will be even more painful",
  "date": "20241223T163000Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why Sir Jim Ratcliffe’s second year in charge at Manchester United could be even more painful\nIt is exactly 12 months on Christmas Eve since Sir Jim Ratcliffe agreed a deal with the Glazers for an influential minority stake in Manchester United – and to suggest it has been a turbulent past year for the club would be a gross understatement.\nThe United fans who filed glumly out of Old Trafford on Sunday after watching Ruben Amorim’s side lose 3-0 to Bournemouth would be well within their rights to ask what has changed since the club lost by the same scoreline to the same club under Erik ten Hag last December.\nIndeed, some might even argue things have become worse over the intervening period – on and off the pitch.\nResults have spiralled as some ticket prices have soared. Around 250 members of staff have lost their jobs amid an ongoing cost-cutting drive at a time when another £200 million was splurged in the transfer market with little to show for it. A manager was sacked 115 days after signing a new contract and replaced mid-season by a head coach who has no time to work on the training pitch on a completely different system and way of playing.\nMarcus Rashford, the club’s most high-profile player, has revealed he is ready for a “new challenge”, and former sporting director Dan Ashworth, who was heralded as one third of a bright new football management hierarchy, was ousted after 159 days. Morale among the workforce is as low as ever and supporters continue to protest. The team still cannot defend set-pieces for love nor money, goals remain desperately hard to come by and the same players keep getting injured. And mention the word ‘leaks’ and supporters might be unsure whether to direct you to the persistent trailing of the starting XI on social media or the dodgy Old Trafford roof.\nRatcliffe, by his own admission, says United have become a “mediocre” club and that there are no easy or quick solutions to problems that have become increasingly entrenched over a miserable past decade. What’s more, there will be more difficult and unpopular decisions to come. Speak to those close to the Ineos chairman and they will say that “now is the time to start judging us”, with Amorim at the helm, a number of building blocks already in place and changes under way, even if Ashworth’s premature and disconcerting exit was most definitely not part of the plan.\nClub will carry financial burden of stadium rebuild\nAs fans reflect on a chaotic last 12 months and ponder what 2025 might bring, there is a burning question: how can Ratcliffe and United fund the delivery of a world-class team and a new world-class stadium at a time when the club is stuck in a loss-making cycle? There is little resale value in an underperforming, overpaid squad, Premier League and Europe-wide cost controls are biting and there is already a Glazer-induced gross debt of £547 million to finance.\nIt is a twin ambition that feels as bold as it is necessary for a club with a team and stadium that have long stopped being fit for purpose. But a comb through the numbers offers a stark indication of the financial challenges of trying to undertake two enormous tasks in unison that – in all likelihood – will run in direct conflict with each other. United are in ultimate pursuit of a virtuous circle but must first navigate a particularly vicious one. It is why year two threatens to be even harder than a decidedly bumpy year one for Ratcliffe and his Ineos team.\nUnited are expected to make a decision next summer over whether to redevelop their existing 75,000-capacity Old Trafford home or pursue the preferred option of a new 100,000-capacity stadium on adjacent land that they believe could be the catalyst for the wider regeneration of Manchester’s south west.\nThe cost of a new stadium alone is forecast to be around £2 billion to £2.3 billion. With a transformed corporate offering, 25,000 new seats and the potential for naming rights and other lucrative sponsorship opportunities – the SoFi stadium in Los Angeles from which United are drawing inspiration has a roof that doubles as a giant money-spinning LED advertising space, for example – there are plenty of ways of offsetting costs and driving fresh revenue streams. But the reality is that the club will be servicing any stadium debt, not Ratcliffe, not Ineos and certainly not the Glazers and this is where the conflict with future squad building lies.\nUnited fans have already had more than a fleeting glimpse of the impact on squad investment of high, sustained annual interest payments. United had an average annual interest bill of around £67 million during the first eight years of Glazer rule, as the club serviced the Americans’ leveraged buy-out. The consequence of that was Sir Alex Ferguson had little money relatively to invest in signings. That the club was able to remain so competitive, despite the rise of clubs with rich benefactors such as Chelsea and Manchester City, owed much to Ferguson’s genius.\nBetween 2016 and 2022, United’s annual interest had fallen to an average of £18 million but payments ballooned by more than 50 per cent in 2022/23 to £31 million due to higher debt levels during the course of the year and rising interest rates. Last season they reached £36 million, the highest since 2014/15.\nThe majority of United’s existing debt is due for refinancing in 2027 and the challenge for Ratcliffe and company is how they can marry team rebuilding with a costly stadium project if annual interest payments return to those high levels of the early Glazer years, at a time when the club is being squeezed financially in all directions.\nWhat will gall fans is that United have spent a whopping £815 million in interest payments since the Glazers’ takeover in 2005 –money that could have gone towards a new stadium. To put that into context, it is more than three times greater than the next highest interest bill serviced by another Premier League club over the same period (Arsenal). It is also less than the £750 million it is estimated United would need to redevelop the south stand at Old Trafford alone.\nCoupled with the colossal wastage in the transfer market, it is little wonder why rank-and-file staff now paying with their jobs or supporters facing escalating ticket prices are so angry and disillusioned.\n£1.98 billion spent on players for scant reward\nUnited’s full accounts for last season, released in September, revealed the club have reported losses totalling £358 million before tax for the last five years, largely as a consequence of heavy investment in the first-team squad, with more than £900 million has been spent on new signings during that time.\nSince Ferguson retired in 2013, United have bought £1.98 billion worth of players and for what? The team have finished a cumulative 254 points behind the Premier League champions over the past 11 full campaigns and this season is following the same trajectory with United languishing in 13th position, already 17 points behind leaders Liverpool after 17 games. It is proof that without the right people using the right data to recruit the right players for the right money, and to fit the right system, money can disappear down a black hole. But it also does not escape the reality that United’s squad – for all it has had lavished on it – still needs a lot of money spending on it.\nThe respected football finance blogger Swiss Ramble suggests United complied with the Premier League’s profit and sustainability rules (PSR) by “the skin of their teeth” over the past three-year monitoring period. He estimates that United posted an adjusted loss – once allowable deductions were factored in – of £103 million for 2022 to 2024, only £2 million within the permitted range of £105 million.\nAs the next PSR assessment will not include the 2021/22 season – when United’s £150 million loss was the third-highest in English football history – the club will have a little more wriggle room and there have been other revenue boosts this season. For example, the move to bring e-commerce in house through a partnership with SCAYLE, which is expected to be worth an additional £30 million and a new £60 million-a-year shirt sponsorship deal with Snapdragon that represents a minimum £13 million annual upgrade on the previous arrangement with TeamViewer.\nBut insiders feel that years of underperformance both domestically and in Europe are really starting to pinch. Another season out of the Champions League would incur a £10 million penalty in their kit deal with Adidas and rob the club of another hefty income stream. Although United have earned around £233 million in broadcast revenues from European participation in the past five years, it is almost £100 million less than Liverpool have earned over the same period and is dwarfed by the £470 million Manchester City have taken home.\nCity, in particular, have also generated huge profits from player sales (£550 million over eight years) whereas United’s figure of £37 million for last season was their highest for 15 years. They had more success on outgoings last summer, too, but the challenge next year will be to find buyers for high-earning underperforming players such as Marcus Rashford, Casemiro and Antony to raise funds to reinvest.\nIt is also worth remembering that United’s existing transfer debt – the money still owed to other clubs for deals – stands currently at £331 million, its highest ever level, and has almost doubled in just two years. United are among many clubs who use transfer debt as a financing tool but it still means the club’s total gross debt is £878 million, or just shy of £1 billion if the £100-million increase in their revolving credit facility in July is factored in. In that respect, it is little surprise that Ratcliffe is reviewing every source of expenditure and exploring every available revenue stream, right down to taking legal advice to ensure the club can claim compensation in the event Manchester City are found guilty of committing serious breaches of the Premier League’s financial rules next year. United are also likely to play a post season friendly in Malaysia that could be worth around £8 million.\nA world-class team playing in a world-class stadium is the dream for every United fan but how they successfully fund both will be a huge conundrum for Ratcliffe going forward.",
  "word_count": 1762,
  "scraped_at": "2026-02-14T01:58:00.744719",
  "_text_extracted": true
}