{
  "article_id": "c15914400d13",
  "url": "https://www.bbc.com/sport/football/articles/c4gle2vx202o",
  "title": "Champions League : Do Celtic  look ready for knockout football ? ",
  "date": "20241211T073000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Do Celtic 'look ready for knockout football'?\n- Published\nAfter six Champions League games last season, Celtic were out of Europe.\nBottom of their section on four points, with a concluding win over Feyenoord in their final group game not enough to drop into the Europa League.\nThis time around, Brendan Rodgers' side have nine points from six games, and are well-placed to reach the next stage of Europe's elite club competition.\nFollowing a crushing 7-1 loss away to Borussia Dortmund, Celtic are unbeaten in four Champions League outings.\nThe defensive flaws that were so ruthlessly exposed in Germany appear to have been fixed, and they were rarely troubled in their - admittedly drab- goalless draw at Dinamo Zagreb.\n\"The whole job for this campaign is to qualify, and they are doing that well,\" former Celtic goalkeeper Joe Hart said on TNT Sports.\n\"They look like they are ready for knockout football.\"\nCeltic were far from their best in Croatia, but as Hart says, progression is the main objective and a point away from home is not to be sniffed at.\nThe Scottish champions host Young Boys of Switzerland in the new year before finishing their league campaign at Aston Villa, as they try to reach the knockout stages for the first time since the 2012-13 season.\nDinamo were limited to just 17 touches in the Celtic box and only two shots on target in the 90 minutes on Tuesday, as the visitors controlled both possession and the tempo of the game.\nAnd when Marko Pjaca found himself unmarked late on, Kasper Schmeichel was alert to tip his header over the bar.\n\"Their [defensive] performance levels have been really good,\" former Scotland forward James McFadden said on Sportsound. \"Dortmund aside in the first half, I think they've been really good.\"\nCeltic were able to trouble teams in attack in previous seasons, but lacked the solidity to back it up. Now they can grind out results.\n\"My teams will always be referenced for their attacking play,\" Rodgers said afterwards. \"But we're good when we press in the right moments and have that mentality to not want to concede.\n\"We had enough of the ball to create more opportunities, but to have that base collectively is very important.\"\n'It shows how far they have come'\nWith Dinamo suffering something of an injury crisis, Celtic went into the game as favourites, but never truly threatened on a tricky playing surface.\nRodgers conceded that there was a sense that one point could perhaps have been three, and progression to the knockout round could have even closer.\n\"The disappointment will be they've not created as many chances as they'd have liked,\" McFadden added. \"It shows you how far they've come, that they're disappointed to an extent.\n\"Nine points after six games. Before this started, you'd say that's a great position for Celtic to be in.\n\"They are in an unbelievable position to finish exactly where they wanted to finish before this campaign kicked off.\"\nThe players' mood reflected that.\n\"We'll take the point, but we came here for three,\" defender Auston Trusty said. \"It was a solid performance. We thought we could get more from the game.\"\nTrusty has been a big contributor to Celtic's improved defensive displays on the continent, and his assertion that they came to Zagreb to win is indicative of more than just improved performances.\nCeltic now expect to go away from home and win Champions League games.\nThat was almost unthinkable last season when they shipped 10 goals without scoring any of their own away from Parkhead.\nAs McFadden says, it shows just how far they have come.\nHave your say\nWhat did you make of Celtic's performance? Are they now on the brink of the knockout stages?",
  "word_count": 628,
  "scraped_at": "2026-02-14T02:11:20.840547",
  "_text_extracted": true
}