{
  "article_id": "c15f203ea374",
  "url": "https://www.espn.com/espn/story/_/id/46937964/africa-world-cup-playoffs-nigeria-cameroon-field-dramas-scupper-their-chances",
  "title": "Africa World Cup playoffs - Will Nigeria and Cameroon off - field dramas scupper their chances ? ",
  "date": "20251112T084500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Africa's FIFA World Cup qualifying campaign arrives at a fascinating conclusion this week, with four of the continent's tournament hopefuls set to compete in a mini tournament in Morocco.\nAhead of this week's African qualifying playoffs -- to determine CAF's representatives for next year's inter-confederation playoffs -- ESPN examines Nigeria, Gabon, Cameroon and the Democratic Republic of Congo's chances of reaching North America.\nHow do the playoffs work?\nThe expanded 48-team World Cup in the United States, Canada and Mexico next year has opened the door to a greater African representation than ever before at the global high table.\nIn recent tournaments, Africa has boasted five qualifiers at the tournament, but this time around, the 54-member association-strong CAF has nine guaranteed places.\nEgypt, Morocco, Algeria, Tunisia, Cape Verde, Senegal, Cote d'Ivoire, Ghana and South Africa are already confirmed for 2026 after each topping their group during the qualifying campaign.\nHowever, the introduction of FIFA's inter-confederation playoffs next year -- where two sides will qualify via the backdoor -- means Africa's four best placed group stage runners-up keep their World Cup aspirations afloat... for now.\nAfrica's representatives for the inter-confederation playoffs will be decided across three matches in Morocco this week, with Nigeria and Gabon set to meet in one semifinal at the Moulay Hassan Stadium in Rabat on Thursday, before Cameroon and the Democratic Republic of Congo collide at the Al Barid Stadium later in the city on the same day.\nThe winners will then contest a playoff final in the Moroccan capital on Sunday, with the victor of that match advancing to the March playoffs.\nThe fixtures promise to be frantic and tense affairs; with no second legs, no home advantage, no opportunities to compensate for a 'bad day at the office', teams will know that any mistake could prove lethal.\nWith so much at stake and no margin for error, the three matches promise to be unmissable affairs, while the short recovery time adds in an extra dynamic.\nSquad depth may prove to be a critical factor for the two sides who progress to the final, while elements like defensive discipline and, crucially, momentum could also prove decisive as four become one.\nTraditional giants under pressure\nThe four sides preparing to participate in the African playoffs can broadly be put into two groups; those for whom participation in the playoffs represents a gross underachievement, and those who may feel, comparatively, like they have nothing to lose.\nFor Nigeria and Cameroon, two of the most successful sides in the history of African World Cup qualification, second-placed group-stage finishes represent a poor return considering their wealth of talents and tournament heritage.\nThe Super Eagles were powerless as South Africa clinched top spot in Group C, but deserve credit from overcoming a miserable start to the campaign in which they took just three points from the first 12 on offer.\nNonetheless, missing out on top spot to fierce rivals South Africa was a disappointing conclusion, even if only one point separated them.\nCameroon's failure to win their group was more egregious, with the eight-time World Cup qualifiers -- no African side has been at more tournaments -- finishing four points behind 'minnows' Cape Verde as they secured a first ever World Cup qualification.\nLike Nigeria, the Indomitable Lions may point to chaotic organisation at the federation level, with the bubbling civil war between FA president and head coach Marc Brys creating a backdrop of instability against which the Central Africans won just five of their 10 qualifiers.\nThe Lions' squad list was only published four days before the playoff after a disagreement between Brys and Fecafoot -- the latest in a sorry list of confrontations -- about how the head coach would communicate his chose squad.\nRumours swirl domestically that the Belgian coach has already written off his team's chances and is already considering life beyond Cameroon... such is the toxicity surrounding the national team at the moment.\nDon't expect a serene Cameroon camp as they prepare for their World Cup D-Day...\nMeanwhile, Nigeria's week has deteriorated into training boycotts and payment conflict, as the players refused to practice on Monday as they've allegedly not been paid thousands of dollars they're owed.\nNeither African giant will tolerate missing out on a World Cup, and the 'golden ticket' offered by this playoff campaign represents a glorious opportunity of salvation after a testing 2025.\nFor the DRC and Gabon, however, qualification to the playoffs represents just reward for outstanding group-stage campaigns in which they pushed Senegal and Cote d'Ivoire respectively close for top spot.\nIndeed, each would have pipped their more illustrious opponents to automatic qualification had they managed to score one goal more each in their crunch home fixtures against the eventual group winners.\nThe Leopards have been there before -- that iconic Zaire side of 1974 -- but these fallen giants of the African game have rediscovered their swagger under Sebastien Desabre, and will be desperate not to let the rare opportunity of a history-writing qualification pass them by.\nGabon, who have never before qualified, are the outsiders, but they were magnificent during qualification, dropping just five points, and the lethal combination of Denis Bouanga and Pierre-Emerick Aubameyang will give them hope of firing their way through.\nGab & Juls react to Victor Osimhen's hat trick in Galatasaray's 3-0 victory over Ajax in the Champions League.\nEd Dove's Predictions\nPredictions are, as ever, a fool's game in African football given the context, the variables and the unpredictability, with the unique set of circumstances in neutral Rabat set to make for an engrossing five days of action.\nHowever, we're tipping the Super Eagles to come through the playoffs, defeating the Congolese in Sunday's final.\nAdmittedly, the West African giants endured a troubled group-stage campaign, but it's worth noting that the horrible results that condemned them to second place largely took place during the first half of 2024, with significant improvements since.\nNone of the quartet boast the momentum of the Super Eagles right now. They had four different coaches during the campaign, but Malian Eric Chelle, despite his many detractors, has steadied the ship since his January appointment.\nIndeed, Nigeria's full team are unbeaten during their calendar year, and even the 1-1 draw against South Africa in Bloemfontein -- while insufficient to overhaul Bafana Bafana -- was an impressive result.\nThis is still the same squad that reached the final of last year's Africa Cup of Nations, with the likes of Alex Iwobi, William Troost-Ekong, Calvin Bassey, Samuel Chukwueze and reigning African Player of the Year Ademola Lookman offering quality and experience.\nThen there's Victor Osimhen, in fine form for Galatasaray -- he was at his unplayable best with that hat-trick performance against Ajax in the Champions League -- and magnificent for the Eagles when he single-handedly secured progression with three goals against Benin last month.\nGabon have firepower, no doubt, but they're vulnerable as well, notably in their 4-3 victory over The Gambia in Nairobi last month.\nBeyond their sub-par preparations and alleged poor accommodation in Morocco, perhaps the main thing counting against Nigeria is the undoubted weight of expectation, where the pressure of failure may weight heavy on this crop of players.\nIt comes in stark contrast to a Gabon side, who lack the Eagles' experience of elite knockout football, but who may feel they have nothing to lose. By comparison, the underdog tag should be an advantage for DR Congo against a Cameroon side whose brittleness was exposed during qualification.\nThe Indomitable Lions have generally had the edge in this Central African derby, while the absence of injured Yoane Wissa denies Desabre one of his greatest weapons.\nHowever, this Congolese side are youthful and exuberant, but organised well under the Frenchman, with a defence reinforced by the likes of Aaron Wan-Bissaka and Axel Tuanzebe.\nThere's a quiet belief and purpose in this Leopards side -- one of the potential surprise packages for the AFCON next month -- and while few African teams have the capacity to overcome adversity like Cameroon, their individual quality may not be enough to overcome their ongoing dysfunction.",
  "word_count": 1353,
  "scraped_at": "2026-02-14T02:12:17.578342",
  "_text_extracted": true
}