{
  "article_id": "c16de8a03eaf",
  "url": "https://www.90min.com/features/real-madrid-best-players-uefa-super-cup-win",
  "title": "Real Madrid best players in UEFA Super Cup win",
  "date": "20240815T134500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid's best players in UEFA Super Cup win\n- Real Madrid beat Atalanta 2-0 in the UEFA Super Cup\n- Kylian Mbappe marked his debut with goal\n- Analysing Madrid's best players in the victory\nAll eyes were on the curtain raiser of the 2024/25 European football season on Wednesday evening, as Champions League winners Real Madrid faced Europa League holders Atalanta in the UEFA Super Cup.\nAnd while the UEFA Super Cup always garners a bit of attention, there was plenty more interest this year as the game marked Kylian Mbappe's debut for Real Madrid following his blockbuster summer move.\nSo how did he perform in the 2-0 win? Was he Real Madrid's best player?\nWith a little help from 90min's player ratings, let's take a look.\nReal Madrid's best player vs Atalanta\nVinicius Junior: 8/10\nVinicius Junior being Real Madrid's best player in a European game should be no surprise to anyone who has watched any football over the last three years.\nThe Brazilian, as per, was utterly brilliant for Los Blancos in Europe on Wednesday evening - this time against Atalanta in the UEFA Super Cup. Particularly in the second half of the game at the Stadion Narodowy, Vinicius looked fairly unstoppable, bagging an assist for the opening goal by drifting past his marker with ease before finding Federico Valverde.\nHe's the favourite to win the 2024 Ballon d'Or for a very, very good reason.\nHonourable mentions\nJude Bellingham: 8/10\nIt's fair to say that Jude Bellingham hit the ground running upon his return to club action with Real Madrid.\nHaving bagged an assist, won 13 duels, won 100% of his tackles and completed 90% of his passes, Bellingham proved that he can be effective slightly deeper in Madrid's midfield to accommodate Kylian Mbappe's arrival. Something that will be music to Carlo Ancelotti ears.\nFederico Valverde: 8/10\nAnother midfielder who impressed for Los Blancos was Federico Valverde.\nThe Uruguayan netted the opening goal by cleverly bursting late in the penalty area, and put in a decent shift off the ball too - winning 100% of his tackles in the game. Nice one.\nKylian Mbappe watch\n7/10\nHe may not have been Real Madrid's best player in the UEFA Super Cup clash with Atalanta, but we've no doubt that Kylian Mbappe will be pretty pleased with marking his club debut with a goal.\nIt was a beautiful finish too, with Mbappe latching onto a clever Bellingham pass to thump the ball into the top right corner of the net.\nConcerns about how the French star will fit into an already stacked offensive line will certainly have been eased by the showing on Wednesday night. From the goal, to Bellingham's impressive performance deeper in midfield, to Vinicius Junior mimicking his famous celebration, Mbappe and Madrid look like a match made in heaven already.",
  "word_count": 475,
  "scraped_at": "2026-02-14T01:51:48.876318",
  "_text_extracted": true
}