{
  "article_id": "c1d7aed655f7",
  "url": "https://huewire.com/22364-2/",
  "title": "| Huewire",
  "date": "20241225T030000Z",
  "domain": "huewire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Giant Bomb News\nby Marino – Brad Lynch on\nThe mod crew from the official GB Discord have some unique picks for GOTY.\nHello, gamers! Giant Bomb Discord moderator @chucktowski here to introduce the GB Discord Moderators’ Games of the Year. We’re a diverse, slightly chaotic group spread across time zones with wildly varying tastes in games—which makes for a beautifully eclectic list. You’ll find some familiar favorites alongside some stranger picks that just might catch your interest. Video game discussion is a part of our daily lives, and we love it, so we hope you enjoy our selections as much as we enjoyed making them.\nStray\nAs someone with a large backlog, finding time for the new games each year usually takes less importance over games I’ve missed in the previous years. Stray was one of the games I really wanted to get to last year; unfortunately, a surprise passing of my orange tabby cat Cheeto really made playing a game about an orange tabby unsurprisingly quite mentally difficult to play. Things have settled enough now in my life and I finally got a chance to play it.\nFor those like me that take a while to get to games, or haven’t heard about Stray, the quick recap is you play as a cat lost in a futuristic / cyberpunky city full of robots as you try to navigate back to the surface.The story of Stray is engaging enough to keep you wanting to see what happens next and to help the kitty get home.\nStray gameplay can be summarized as pointing your cat in a direction and interacting with the environment; there isn’t any combat, and the intense moments of gameplay will be running away from something. I had a lot of fun playing around with the environment in cat-like fashion. Scratching things, knocking things off shelves, just being a nuisance – the usual. Some puzzles and a few collectibles will also entice you to explore the world around you.\nThe environments they have created are so detailed it makes it a pleasure to just explore and exist in the areas. I appreciate a game that makes the areas feel lived in by the inhabitants and opposite for abandoned places feeling decrepit. It’s this extra detail and care that they put into the game that makes the world come alive. There are a few moments where you get to see the entire city and I just wanted to look around to spot all the places I’ve been.\nMy cat was no exception to the ones getting confused with the on screen one – A few meows and he was staring at the screen trying to figure out how this little pixelated creature got in there. It’s all so well done!\nTsukihime: A Piece of Blue Glass Moon\nAfter playing PARANORMASIGHT last year, I was hooked on the idea of digging deeper into visual novels. Lucky for me, this year Tsukihime got a remake and its first release outside of Japan. It’s considered by many to be one of the most important visual novel games ever made.\nSo, why is Tsukihime my game of the year? It’s the engrossing story of Shiki Tohno, who has the ability to cut anything he sees. After a fateful encounter with a vampire, he’s thrown into an underworld of vampire politics, vampire-hunting nuns, a whole bunch of mysteries to solve—and a little bit of romance to navigate.\nThe magic for me, by the end of my 70 hours, was the characters. The game leans into almost every anime trope for its cast, but because it’s broken up into three distinct story routes, you get to see different perspectives. For example, in the first route, you follow the story of Arcueid Brunestud as she hunts a class of vampires. By the time you reach the second route, Arcueid feels like an entirely different character, shaped by that storyline’s perspective. That’s where the fun of the story comes in. As a novel, it plays with your preconceived notions, subverting and reexamining them in clever ways. And since it’s still a game, you’ll encounter “GAME OVER” screens. When they happened, I was shocked. Even though these are “endings,” they often teach you something about the story that carries you forward—or deliver a funny joke that cuts through an otherwise heavy moment.\nThe main “gameplay” is the writing, but it also boasts quality-of-life features that make the storytelling a smooth experience. The art is expressive and used to great effect, making the words on the screen pop with style. The music and sound effects flow seamlessly from dramatic to soothing beats and are never annoying. It’s a book with visual and musical flair.\nSurprise, surprise—the anime fan likes anime. (Editor’s note: Panda is indeed the Discord’s anime mod.) And Tsukihime brought me the most joy in gaming this year.\nThat said, it’s not without its issues. While it thankfully avoids the worst tropes, there are still moments with strange angles of the heroines that make you go, “Oh, anime.” Fortunately, the game shows some restraint with its fan service. It also contains spelling errors—not egregious ones, but still noticeable. Additionally, it suffers from being part one of a two-part visual novel. We’ll be getting Tsukihime: The Other Side of Red Garden, which will feature four more story routes, but in the meantime, some characters receive setups without payoffs. These unresolved threads can hurt certain story beats as characters vanish or remain underdeveloped. However, the game does drop plenty of hints and jokes about them to tide you over.\nIf you’re a fan of good, old, over-the-top melodrama, Tsukihime delivers—and it’s the game that stuck with me most this year.\nDragon Age: The Veilguard\nDragon Age: The Veilguard is not the game I was expecting after waiting the 10 years between Dragon Age: Inquisition and now. Instead, it is a departure from the grimdark of the older entries and a far more streamlined iteration on the series. It’s turned out to be exactly what I needed after everything that has happened during the last few years.\nI’m not alone in being very concerned about the future of BioWare, so it was a massive relief when the good reviews started rolling in. When I was able to play it myself on PC, I was so impressed with the performance and how great the game looked; this, combined with the Mass Effect: Legendary Edition we got a couple years back, it’s safe to say my faith has been completely restored.\nVeilguard picks up after the Trespasser DLC, and I quickly fell in-step with the combat and mechanics. Playing a mage feels fast and fluid, and having the option to stack combos with teammates like in Mass Effect is a great addition (I only wish we had an equally satisfying “qua-thunk” noise like we had with biotic explosions!)\nThe companions are a little hit and miss, but that’s always been the case for me with BioWare characters, and I actually find it more compelling to have companions I disagree with as well as adore.\nThe story has momentum without feeling like it’s hurrying you along, and the side quests all felt worthwhile and enjoyable instead of throwaway fetch quests like some were in Inquisition. Whilst I would have liked more dialogue and better pacing with the relationships, I was still happy with the choice I made and only wished my Rook had more time with Neve.\nI’m currently having a blast on a second playthrough whilst I keep my greyhound, Tali’Zorah vas Dogbed, company following her recent surgical procedure. I think she likes Neve too now that she’s also missing a leg. I’ll have to see if I can find her a badass cobra prosthesis too!\nWorld of Warcraft: The War Within\nThis was a year where I leaned heavily into comfort and nostalgia, and the games that stuck with me really proved that. I’ll dive deeper into that on my personal blog for the site, but one game hit these notes more than any other—World of Warcraft: The War Within. WoW is in a better place than it’s ever been, now that Blizzard has been purged of plenty of troublesome personnel (even at the very top with Bobby). Dragonflight delivered a fun, albeit slightly lacking in storytelling, expansion that allowed the WoW team to reset and rediscover the exploration and discovery in Azeroth. The War Within is where Blizzard begins to flex their muscles again. With Chris Metzen returning to guide a much-improved story and Ion Hazzikostas now overseeing smaller gameplay teams instead of trying to control every aspect of the game, Warcraft feels brand-new again.\nTwenty years of WoW, and it feels truly rejuvenated for the first time. If you’ve been away from WoW for 10, 15, or even 18 years, now is the time to come back. Solo play is as rewarding as raiding. Delves are the single most exciting and solo-friendly content in WoW history. You can gear up quickly, gear up your alts even faster, and have a ton of fun. Hero talents deliver on class fantasy, cross-faction content is finally implemented, and yes, your foot-fetish mommy dommy Xal’atath is here too. But don’t let her distract you! You have three full expansions to spend with her. So come back to Azeroth—the dwarves kept the beer cold.\nI was told I could only write about one game, but BLOPS 6 also rules—go play it.\nOn a personal note, thank you so much to @marino and the other site mods for inviting the Discord mod team to write a tiny blurb for the Giant Bomb Game of the Year lists. I’ve followed this ragtag bunch since Ryan and Jeff were bleach blondes on GameSpot. As Jan says, “They’re gonna have to drag my ass out of here.” I’m personally very touched that something I wrote will be a teeny tiny part of Giant Bomb Game of the Year history.\nDeath Stranding: Director’s Cut\n- Tree\nI started Death Stranding in February 2024, during a very busy and strange time in my life. My dad was a few months out from having brain surgery to remove a tumor and was still in the thick of recovery. Most of my mornings were spent making sure he was set up for the day—ensuring he had water, took his medication, and had everything he needed—while staying ready to jump in if something happened.\nThis meant I was playing the game in chunks, never knowing if I’d have to pause or quit in the middle of a delivery to take him to an appointment or handle something else. Since I also spent a lot of time on side deliveries in addition to story missions, my playthrough became a long, wandering journey through the world, lugging piles of cargo on my back.\nThose extended treks, combined with the constant reassurances from the game’s characters to “keep on keeping on,” came to a head during my first trip through the woods to the Wind Farm. For those unfamiliar with the game, this is a notoriously disliked section due to the required stealth and the unforgiving environment filled with Beached Things. After crossing the forest, I had to stop and step away. The tension in my chest was overwhelming. The relentless in-game encouragement to push forward and save the world started bleeding into my real life—I felt like everything was on my shoulders, with the game adding even more weight.\nSeveral days later, I decided to try again. To my surprise, walking back out through the forest felt far less tense than I had expected. Once I made it beyond the woods, I stepped back into the journey, and not long after, I acquired the anti-Beached Thing grenades. With those in hand, I never looked back, finally feeling reassured by having the means to fight back and carve my own path.\nDeath Stranding became my companion through the strange, turbulent year I was living. It taught me to take things slow and avoid panicking when facing something daunting. Even through the downturns and traumatic events, I found the strength to pick myself back up. Maybe Death Stranding was simply the right game at the right time, but its mantra to “keep on keeping on” resonated deeply, both in the game and in my life.\nLike a Dragon: Infinite Wealth\nTo be honest, I was on the fence about Like a Dragon: Infinite Wealth before its release, but as soon as they started talking about Dondoko Island, I was completely sold! I’ve always loved the quirky, offbeat side of the Yakuza series, and the idea of an Animal Crossing-style game within this larger universe was just too enticing to pass up.\nI ended up spending a ridiculous number of hours on Dondoko Island and even managed to 100% it before moving on. Honestly, I enjoyed every single moment! But that’s just a small part of the whole game.\nI really appreciated the other elements as well! While I wasn’t a huge fan of the turn-based combat in the first Like a Dragon, the tweaks they made this time around really worked for me. The adjustments felt smoother and more engaging, making battles more enjoyable overall.\nI don’t want to ramble too much, but I truly think this game is worth checking out for the sheer variety it offers. Outside of first-person shooters, Infinite Wealth genuinely has something for everyone. So, if you’re looking for a fun way to spend your next long weekend, why not boot it up, set it to easy, and enjoy everything Infinite Wealth has to offer?\nCheers!\nTotal Extreme Wrestling IX\n2024 was the year I got married, lost my job, had a child with my wife and learned to drive. Which is to say: it was not a great year for getting lots of gaming done. Or at least, it wasn’t a great year for playing the kinds of always-online action-y type games that usually make up a lot of my rotation. Gone were the likes of Destiny 2 and in their place rose ponderous, esoteric strategy games which allowed me to play at a slower pace in between ensuring my child was still alive and that my wife hadn’t wised up and left me.\nEnter Total Extreme Wrestling, a series of games I have played since the mid-2000s, which functions as a sort of Football Manager-but-for-wrestling analogue, wherein you take the role of the booker of a wrestling company and are charged with overseeing every aspect of its fortunes. From talent development and running shows to TV deals and management of the backstage environment, it’s all on you.\nIn August of 2024, developer Adam Ryland released TEW9, the first entry in four years and a more-or-less perfect game at the perfect time for me. When people talk about certain games being spreadsheet simulators, the TEW series is what I compare them to. And – invariably – the comparison renders almost all of these other games positively action-packed by contrast. This is a series about getting lost in the wrestling world of your game – be that the default, fictional “Cornellverse” database or one of the multitude of semi-official mods which allow you to play with real people and companies.\nThere are no animations, nothing flashy, you put a number of people in the ring with each other – refining the details of that match as much as you want – and then the game’s unfathomably complex algorithms calculate a grade for that match. People’s popularity goes up, their skills get better and your company gets more viewers. But while there is undeniably an element of “Numbers go up” to TEW, the real fun is in picking people you like and trying to turn them into superstars.\nThat narrative element – which admittedly requires a lot of input from the player to be at all rewarding – is what distinguishes it from something like Football Manager. Where a player of a sports sim might reminisce about the time they took AFC Wimbledon to the Champions League final, in TEW you will find yourself writing notes about a wrestler’s past feuds and future plans as you propel them from obscurity to the biggest shows. That time you took a 45 year old veteran who everyone thought was done and gave them one last run at the top. The unlikely pairing who became the greatest tag team in your company’s history. When your top star breaks his neck in the first match of your game and forces you to suddenly elevate new talent to keep the company afloat. The emergent narratives are endlessly compelling and only limited by your willingness to explore the game world with different companies and products.\nTotal Extreme Warfare 9 then is a game where you get out of it what you put in. It’s downright impenetrable at first glance, but sticking with it will reward you with a game unlike almost any other on the market right now. An experience which can be as much creative writing as mechanical mastery of the game’s systems, and the perfect solution for an aging millennial with only moments of gaming to snatch between regular life.\nFinal Fantasy VII Rebirth\nWhy didn’t anyone say no? That’s the question I kept asking during the 80+ hours I spent in Final Fantasy VII Rebirth. Sometimes I asked it because what seemed like a small side quest would instead balloon into something grander—with unique enemies or a custom song. Other times, I asked it because the story made a baffling decision that ultimately went nowhere. And sometimes, I simply asked it because the game threw yet another minigame at me after dozens and dozens before. Rebirth is a game of excess—both beautiful and horrible—and that’s exactly why I love it.\nServing as a retelling of the original, a follow-up to it, and a commentary on the subseries as a whole, Rebirth tries to accomplish a lot. Does it succeed at everything? No. In fact, it flops horribly in some major areas. It’s a massive AAA game that’s unafraid to take giant risks, combining standard open-world design tropes with bizarre twists that often don’t pay off. It delivers some of my favorite small character moments of the year, yet still manages to tell an unfocused story that doesn’t seem to know what it wants to say. It can feel like pure chaos, but just as often, it’s pure bliss.\nThe combat is among the best in series history, improving on the systems of Remake and Final Fantasy XIII to create something that made me cackle with joy countless times while still feeling fresh after hundreds of fights. I found myself wandering through every area, searching every nook and cranny to see what completely unnecessary detail the developers had added. There’s so much to love about Rebirth—I haven’t even mentioned the soundtrack—that it’s hard for me to think of another recent game that’s brought me this much joy.\nIt’s a game I deeply love, and a game that’s deeply flawed. Catch me on the right day, and I’ll gush about it for hours. The next day, I’ll complain about it for just as long. It’s a mess and a masterpiece, an epic that somehow amounts to everything and nothing. And it’s also, without question, my game of the year.\nYes, I know it’s already appeared on this list, but as I look back on a year of big releases, I found that while I liked much of what I played, nothing managed to grab me in the same way Final Fantasy VII Rebirth did.\nWhen Final Fantasy VII Remake was initially announced back in 2015—and boy, doesn’t that make me feel old—I won’t lie: I was incredibly skeptical. If it ever managed to release at all (Final Fantasy release timelines being what they are), there was no way it could possibly live up to the expectations the title imposes upon the game. Fast forward a few years, though, and I was extremely glad to have been proven wrong. It hadn’t just managed to meet expectations and do justice to a historical titan of the industry—it absolutely smashed them.\nFinal Fantasy VII Rebirth couldn’t come soon enough, and when it did, I was thrilled to immediately immerse myself back into the world of Gaia. From the wonderfully written and voiced cast of characters to the beautifully realized world with its absolutely stunning vistas, not to mention the expansion of an already beloved story, Rebirth stuns in almost every aspect.\nIn a time when open-world fatigue has well and truly set in, it speaks volumes that Rebirth’s move to an open-world structure was accomplished so successfully. While it is certainly susceptible to the bloat found in many open worlds, it managed to include enough interesting side activities in each area that largely didn’t outstay their welcome. The game kept me engaged, completing every area before moving on. What holds all of this together, however, is undoubtedly the combat system. Blending a modern, real-time action-based system with elements that harken back to its turn-based roots, Rebirth’s combat is fluid and consistently satisfying.\nAll of this combines into an overall package that kept me hooked throughout, bringing me back again and again over the year. Finally, I hope everyone has a very happy holiday season and a great 2025. Now, it’s about time I get back to my boy Chadley—there are still a few combat sim challenges waiting for me…\nIndiana Jones and the Great Circle\n- Chron\nFull disclosure: I have not yet beat Indiana Jones and the Great Circle. This is mostly due to the fact I can’t stop chasing down collectables, photographing aspects of local life, and clocking Nazis over the head with brooms. Or shovels. Or guitars. Or fly swatters?\nThe most shocking aspect of Indy’s newest game is the structure. I had initially assumed this would follow in the footsteps of an Uncharted or a modern Tomb Raider, piecing together linear level design with large set-piece moments and plenty of gunplay (whipplay?). What arrived, though, is a video game-ass video game with open map levels, plenty of stealth, and some surprisingly complex and enjoyable puzzles – especially the secondary ones not tied to the main story.\nAs always, Indy is another example of MachineGames refusing to miss. The writing is witty and sharp (“Fascists can’t be trusted with money”, says Indy when he first steals from the Blackshirts), the visuals and audio design are excellent, and the music is as close as you can get to John Williams. Composer Gordy Haab has become the industry’s premiere Williams-like, having previously worked on the new Battlefront and Jedi series games, and his Indy score recorded with a full orchestra could easily be confused for the real deal. If you’re a music nerd like I am, you know just how impressive that is.\nIndiana Jones and the Great Circle is surprising, refreshing, and exciting. It feels genuinely new in ways AAA experiences from big publishers recently haven’t, yet you’re still punching, smacking, and shooting Nazis in classic Indiana Jones fashion. What’s not to love?\nIndy is my personal Game of the Year, and I’m excited to see more Indy adventures from the MachineGames team – just let them make Wolfenstein 3 first, please.\nBalatro\nLocalThunk’s Balatro defies many bits of conventional wisdom about modern game development: it does not monetize outside of an initial purchase, there is no larger narrative intersecting with the gameplay, and there is no ending in the traditional sense. Instead, Balatro contends as a spiritual successor to the likes of Solitaire, 3D Pinball: Space Cadet, and Minesweeper.\nThe trappings of Balatro—old CRT monitor styling, video poker machine aesthetics—elicit the idea that you’re in for a ludonarrative ride in the vein of Daniel Mullins’ Inscryption, but in the end, Balatro happily plies itself as a pure gameplay dopamine ride. No tricks, no spooky stories—just cards.\nIn Balatro, you score points to defeat Blinds by playing combinations of 1–5 cards, as you would in a game of poker. A Pair, Flush, or Full House are all valid scoring plays, though whimsical “broken” ones can be achieved, like a Flush House or Flush Five (of a kind). The thrill of the game is in breaking it; purchasable Tarot cards can be used to destroy, modify, or transform playing cards, while collectible Jokers can modify the way a hand is scored. With a starting cap of five Jokers and the ability to have “negative Jokers,” which take up no space, the game begs to be scooped up by the player and broken in a multitude of ways with a single goal in mind: joy.\nThose in the hobby can often find themselves at odds with the things they enjoy. Balatro offers no narrative or ending credits; instead, there are a series of challenges players can undertake and achievements to hunt. There are dozens of decks of cards, many unlocked during gameplay, and each deck (with its own quirks) can be played at increasing levels of difficulty, all the way up to “gold stake” difficulty. This difficulty level has you contend with ‘expiring’ Jokers, Jokers that require payment every Blind, or Jokers that, insidiously, cannot be removed at all.\nThe conclusion provided by Balatro, then, is either to play until satisfied or to scale the immense wall of gold stake-able decks in search of some dizzyingly difficult achievements on your platform of choice. For some, this can maintain the game’s sense of joy, but for others, it can become an albatross weighing down the experience. Though seemingly simple and pure in its gameplay, Balatro serves as a mirror for the player’s behaviors and goals, revealing how much enjoyment or frustration they derive from self-imposed challenges. Ultimately, Balatro invites players to reflect not only on their approach to the game but also on their relationship with challenge and satisfaction itself.",
  "word_count": 4329,
  "scraped_at": "2026-02-14T01:52:10.149113",
  "_text_extracted": true
}