{
  "article_id": "c2168f177040",
  "url": "https://www.the42.ie/what-happened-to-harry-kane-6436319-Jul2024/",
  "title": "What happened to Harry Kane ? ",
  "date": "20240715T100000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "WHEN PEOPLE look back on Euro 2024 in many years to come, it may be remembered as the tournament where superstars floundered.\nIndeed, England, it could be said are almost a team of superstars — you could at least count Harry Kane, Phil Foden, Jude Bellingham and Bukayo Saka in that category — and surely that is part of their problem.\nKane is the biggest name and arguably was the most ineffective of the underperforming quartet.\nHowever, he was not the only high-profile striker who invariably flattered to deceive at the tournament.\nFor Portugal and France respectively, Cristiano Ronaldo and Kylian Mbappe were well below their best level and looked more of a hindrance than a help to their teams sometimes.\nBy contrast, Spain were the deserving winners because they played better football throughout and looked like the superior side for much of last night’s tense, enthralling final.\nCompared to England, they are a team without superstars. None of their players have the profile of Kane, Mbappe or Ronaldo, though Nico Williams and Lamine Yamal have the potential to reach those levels in the future.\nConsequently, it felt fitting that in such a pragmatic Euros, the Player of the Tournament award was given to a defensive midfielder, Rodri.\nIt also seemed right that the man who was Spain’s hero, Mikel Oyarzabal, is one of the less well-known strikers in the competition. The 27-year-old has spent his entire career at Real Sociedad and only made his Champions League debut last September.\nIn 26 minutes on the pitch last night, Oyarzabal made a bigger impact than Kane managed in seven matches at the tournament.\nFootball, of course, can be a cruel game and few people know this better than the England striker.\nOn the eve of the final, Tottenham and England’s all-time leading goalscorer was asked whether he would swap his individual accolades for a Euros triumph.\n“Of course, it’s no secret that I haven’t won a team trophy,” he replied.\n“Every year that goes by you’re more motivated and you’re more determined to change that and tomorrow I have the opportunity to win one of the biggest trophies you could ever win and to make history with my nation…I’m extremely proud to be English.\n“So yeah, no question. I’d swap everything in my career to have a special night by winning tomorrow.\n“So it’s a lot of hard work from now until that moment and I’m pretty determined to make tomorrow night special.”\nUnfortunately, it did not go as planned for Kane and England.\nIt was ultimately hard not to feel sympathy for the player after the heartbreaking loss when he said: “It’s extremely painful and it’ll hurt for a long time.”\nKane’s poor performance and inability to influence the game will have exacerbated his woe.\nIt was the third successive match at this tournament that the Bayern Munich star was substituted.\nWhereas he was replaced in the 109th minute against the Swiss and the 81st minute versus the Dutch, Kane was replaced just after the hour mark in probably the biggest game of his career.\n“I think physically it’s been a tough period for him,” Southgate told the BBC afterwards. “He came in short of games and not quite got up to the level we’d have all hoped. The games have been hugely demanding.\n“The games are hugely demanding and we felt Ollie’s freshness would allow us to press a bit better, which we needed to do, and would offer us a threat in behind.”\nTellingly, there were question marks over Kane’s fitness pre-tournament.\nAn ongoing back injury meant Kane was substituted in the Champions League semi-final and the striker was also ruled out of Bayern Munich’s last league fixture. He similarly appeared to be struggling with a foot injury against the Netherlands.\nSunday night is also not the first time Kane struggled in a final. He only looked half-fit after being rushed back for Tottenham’s greatest achievement this century — an appearance in the 2019 Champions League final, which they lost 2-0 against Liverpool. He appeared similarly off the pace three years ago, when England were beaten finalists at home versus Italy amid the climax of Euro 2020.\nYet it is also easy to understand why Southgate decided to start him.\nKane’s decisive penalty against the Dutch means he now has more goals in knockout games at major tournaments than any other European player with nine, taking him just ahead of Gerd Müller, Miroslav Klose, Antoine Griezmann, and Kylian Mbappé (per Opta Joe).\nDespite all his woes at these Euros, had he scored against the Spanish on Sunday, Kane would have finished the tournament as the sole Golden Boot winner. Instead, he shares the award with five others — Dani Olmo (Spain), Cody Gakpo (Netherlands), Georges Mikautadze (Georgia), Jamal Musiala (Germany) and Ivan Schranz (Slovakia).\nYet despite that favourable stat, there is no doubt the tournament has not seen the best of the Londoner and instead, he will be remembered as one of several world-class stars who produced a series of sub-par performances.\nSo how can this be explained?\nKane is hardly over the hill at 30 and was most people’s choice as the standout player in the Bundesliga last season.\nNor can the predicament be likened to a Ronaldo-esque strop — those within the game all hail Kane’s consummate attitude and professionalism, and he has remained generous in his post-match assessments of Southgate despite the manager’s obvious doubts about the player’s ability to complete full games.\nYet it’s worth noting that Sunday’s final was Kane’s 59th match of a season that began competitively on 12 August after the stress of a protracted transfer saga during the summer.\nBut at least he had a less taxing 2022-23 campaign, right? No, Kane played more fixtures the previous season (64), including a deeply inconvenient mid-season World Cup in Qatar.\nThe last Euros final was game 65 of the 2020-21 season. And while this tournament has been an anomaly, he usually does complete 90 minutes for club and country alike.\nMoreover, Kane has played 40-plus games in the last 10 consecutive seasons, and over 50 matches in seven.\nIt took a pandemic to give him ostensibly his last substantial break.\nYet the Spurs legend is far from the exception to this rule. The best footballers invariably tend to play the most games and the sport’s hectic schedule has shown no signs of abating of late.\nAnd so with that in mind, is it any wonder that so many established names looked burned out at this tournament and that the primary attacking inspiration behind Spain’s triumph were Williams and Yamal, a pair of fresh-faced youngsters with far fewer miles on the clock than their more established counterparts?\nPerhaps there is a lesson in there for the sport’s authorities.",
  "word_count": 1135,
  "scraped_at": "2026-02-14T02:08:01.877077",
  "_text_extracted": true
}