{
  "article_id": "c25d7d79449c",
  "url": "https://www.naharnet.com:443/stories/en/312451-cristiano-ronaldo-s-al-nassr-is-chasing-silverware-in-asian-champions-league-elite",
  "title": "Cristiano Ronaldo Al - Nassr is chasing silverware in Asian Champions League Elite",
  "date": "20250428T170000Z",
  "domain": "naharnet.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo's Al-Nassr is chasing silverware in Asian Champions League Elite\nBig-spending Saudi clubs including Cristiano Ronaldo's Al-Nassr are dominating the Asian Champions League Elite, accounting for all but one of the semifinalists in action this week.\nIn three quarterfinals played on the weekend, the three Saudi Pro League teams won with a combined scoreline of 14-1. At least one is guaranteed a place in the final on May 3 as four-time champion Al-Hilal meets two-time finalist Al-Ahli in the first of the two semis at Jeddah.\nOn Wednesday, Al-Nassr takes on Japan's Kawasaki Frontale, the only non-Saudi club still in contention for the continental title. Kawasaki edged 2011 champion Al Sadd of Qatar 3-2 after extra time on Sunday to advance to the semifinals for the first time.\nWith all playoff games taking place in Jeddah, there is home advantage and big crowds supporting the three domestic clubs that are laden with high-profile international stars.\nIn the summer transfer window of 2023, Saudi clubs spent almost $1 billion and it's making a difference in Asian competition.\nAl-Nassr thumped last season's runnerup Yokohama F.Marinos of Japan 4-1 on Saturday, with goals coming from Ronaldo, former Liverpool star Sadio Mane and two from Jhon Duran, who signed from Premier League club Aston Villa in January in a deal reportedly worth more than $80 million.\n\"When you come here, the teams are playing Premier League-level football,\" Yokohama's interim coach Patrick Kisnorbo said. \"I don't think it's a technical issue but sometimes these things happen. We have to move forward.\"\nThe journey to Jeddah was also a punishing one for teams in the middle of domestic seasons in East Asia.\n\"Our local league is our priority,\" Buriram United coach Osmar Loss said after his Thai club lost 3-0 to Al-Ahli on Saturday. \"It's a long trip to Jeddah and back and I needed to protect our main players.\"\nIn the most lopsided of the quarterfinals, South Korean club Gwangju FC, making its first appearance in the tournament, was thrashed 7-0 by Al-Hilal on Friday.\nAl-Hilal now faces Jeddah club Al-Ahli on Tuesday in a bid to reach its 10th title match in the Asian competition. Al-Ahli, fourth in the domestic league, had a 3-2 win over Al-Hilal in February with all three goals scored by England striker Ivan Toney.\nWith other former Premier League stars such as Riyad Mahrez and Roberto Firmino on the scoresheet against Buriram United, coach Matthias Jaissle believes Al-Ahli is well placed to advance to a third final and then to capture a first title.\n\"I congratulated the players for making it to the semifinals but from now on, they have to focus on what's best – rehabilitate, rest, and get back to the best physical level to perform against Al Hilal,\" Jaissle said. \"Everyone knows it's going to be an intense match and we need to be in top shape.\"",
  "word_count": 482,
  "scraped_at": "2026-02-14T01:58:31.695014",
  "_text_extracted": true
}