{
  "article_id": "c25f4bef2a76",
  "url": "https://thepeoplesperson.com/2024/03/26/sir-jim-ratcliffe-mulling-over-approach-for-tottenham-hotspur-manager-ange-postecoglou-278043/",
  "title": "Sir Jim Ratcliffe mulling over approach for Tottenham Hotspur manager Ange Postecoglou - Man United News And Transfer News",
  "date": "20240326T233000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United manager Erik ten Hag’s sophomore campaign has not gone according to plan after a fine debut season. And he is in danger of losing his job at the conclusion of the current season.\nThe team are languishing in sixth place in the Premier League with Champions League qualification looking like a distant dream. Their defence of the Carabao Cup ended at the second hurdle.\nFans were excited to see their team on the biggest European stage after a year’s gap but the Red Devils crashed out in the group stages.\nThe team’s playing style has earned the Dutchman a lot of criticism with the current high-transition style not suited to a lot of players and it leaves the team highly susceptible to counter-attacks.\nEtH’s uncertain future\nThe former Ajax coach’s talent identification has also raised doubts with so many players yet to convince and new co-owners INEOS want to go in a different direction with regards to recruitment.\nOnce the behind-the-scenes changes are made, the playing style could also change as per the ownership’s call with the new sporting director and CEO set to take a call on the manager’s future as well.\nThe likes of Thomas Tuchel, Julian Nagelsmann and even Carlo Ancelotti have been linked with the hot-seat while closer to home, Graham Potter, Roberto de Zerbi and even England boss Gareth Southgate have found mentions.\nHITC Football have gone in a surprising new direction, naming current Tottenham Hotspur boss Ange Postecoglou as a potential target.\nSpurs, despite losing record goalscorer Harry Kane in the summer, have played some attractive football and are currently fifth, ahead of the 20-time English league champions.\n“The club have been doing their due diligence on potential options, as HITC has confirmed – they have admiration for England boss Gareth Southgate, former Chelsea chief Graham Potter and Brighton’s Roberto De Zerbi.\n“HITC is also told that some at INEOS – are also hugely impressed with the work being done at Tottenham by Ange Postecoglou.”\nA few days ago, ESPN had mentioned that Sir Jim Ratcliffe’s ruthless streak has seen the club prise away Omar Berrada from Manchester City and close to agreeing Dan Ashworth’s release from Newcastle United.\nAnge, a shock alert\nAnd he is not intimidated by the prospect of facing off against Spurs chairman Daniel Levy for the Australian manager.\nLevy’s notorious attitude is well-known with Sir Alex Ferguson once claiming it was a nightmare trying to deal with him. United also found that out as recently as last summer when Kane was stopped from joining the Old Trafford side.\nThe former Celtic manager has impressed since moving to North London but managing United is a whole other ballgame and he remains inexperienced.\nThe United dressing room is full of egos and experienced coaches like Jose Mourinho, Louis van Gaal have all failed to consistently get a tune out of this bunch.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 504,
  "scraped_at": "2026-02-14T02:10:47.909737",
  "_text_extracted": true
}