{
  "article_id": "c260a0194bbc",
  "url": "https://thepeoplesperson.com/2024/04/29/juventus-could-secure-mason-greenwoods-signing-from-man-united-for-a-lower-fee-279560/",
  "title": "Juventus could secure Mason Greenwood signing from Man United for a lower fee - Man United News And Transfer News",
  "date": "20240430T021500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are likely going to be more willing sellers than willing buyers this forthcoming summer transfer window due to their financial situation.\nWith hopes of Champions League football all but over, Man United find themselves on a tightrope with regards to adhering to UEFA and Premier League’s financial fair play regulations.\nA report from the Telegraph earlier this morning suggested INEOS are prepared to listen to offers for the majority of their first team squad. Players who are away from Old Trafford on loan to clubs across Europe are also expected to be put on sale.\nMason Greenwood is one of the names who could fetch some significant transfer fees for United.\nHowever, despite a number of clubs, including Barcelona and Atletico Madrid, following the Englishman’s progress at Getafe, there are not many sides who are showing keen interest in spending big on the versatile forward.\nAccording to ESPN, United expect a transfer fee in the region of £30 million for Greenwood. However, it is considered unrealistic due to “financial restrictions across Europe.”\nAmid this, Juventus are supposedly confident of getting their hands on the United academy product for a lower fee.\nLa Gazzetta dello Sport (via Football Italia) report that the Old Lady see Greenwood as one of their priority targets this summer. Juve director Cristiano Giuntoli is convinced about Greenwood’s qualities.\nIt is added that ‘many at Man United no longer want to see’ Greenwood at Old Trafford.\nThis has led to believe that Juventus would be able to sign the 22-year-old for a lower fee than his actual value. The exact figures, however, still remain uncertain.\nAs far as United are concerned, they would hope Greenwood maintains his prolific form in Spain, leading to interest from more European sides. An intense transfer race is their best hope of getting a serious sum.\nThe England international has directly been involved in 14 goals in La Liga so far.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 342,
  "scraped_at": "2026-02-14T01:56:51.539343",
  "_text_extracted": true
}