{
  "article_id": "c27fbdcaa64c",
  "url": "https://thepeoplesperson.com/2024/04/29/peter-schmeichel-backs-thomas-tuchel-to-succeed-erik-ten-hag-at-man-united-279540/",
  "title": "Peter Schmeichel backs Thomas Tuchel to succeed Erik ten Hag at Man United - Man United News And Transfer News",
  "date": "20240429T163000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s legendary goalkeeper, Peter Schmeichel, believes that Thomas Tuchel could be the man to take over from Erik ten Hag in the summer.\nYet another disappointing performance and soul-crushing late equaliser at the weekend means that the Red Devils stand little to no chance of qualifying for next season’s Champions League.\nThis has traditionally meant the end of the road for previous managers in the Old Trafford hotseat and naturally many have speculated Ten Hag will meet the same end.\nThe coach has infuriated and alienated numerous fans with his apparent inability to accept reality when he once again claimed his side played well, in spite of 19th placed Burnley enjoying large portions of possession in the game and coming away with a point.\nHe also hardly endeared himself to whatever support he maintains among the matchday goers as he claimed they “don’t understand” when they booed his decision to replace Kobbie Mainoo on Saturday.\nAs a result, the Red Devils have been linked to numerous managers including Graham Potter, Roberto De Zerbi, Ruben Amorim and Xavi to name a few.\nHowever, one link that will not go away is that of the former Chelsea manager Thomas Tuchel.\nThe German will be leaving his current post at the end of the campaign and he is reportedly keen on taking up the role at Old Trafford and would even be prepared to turn down the bright lights of the Camp Nou.\nThe Bayern coach splits opinion as he is undoubtedly a very successful coach who has won the Champions League and managed huge clubs like Bayern Munich, Chelsea and Paris Saint-Germain.\nNonetheless, he can be a prickly character and controversy tends to follow him wherever he goes. However, one pundit who would support the appointment of Tuchel is Schmeichel.\nSpeaking to beIN sports after United’s disappointing draw with Burnley he revealed his opinion on the 50-year-old coach.\n“I like him. I like Thomas Tuchel. I have had the pleasure of interviewing him a couple of times. His football knowledge is fantastic. I think he has been a little bit unlucky with being at two big football clubs at the wrong time of their history, at times when things were not working at every level.”\nDefending his record further the Dane claimed, “It’s not that he didn’t do well with Chelsea for instance. I mean, he won the Champions League, didn’t he? I just like him. There’s something about him. He projects sort of authority. You never compare people, but he has got the same kind of thing that Klopp has, you know.”\n“If Manchester United were in the market for a manager, he should be somebody mentioned in that respect. He should be. He has that kind of pedigree. He has got, as I said, the authority, he has proven he can win, which I think is really important.\n“He does come with a set system, this is how football has been played. Yeah, of course, he is a big-club manager, isn’t he?”\nINEOS seem to be taking their time with the decision and with Jason Wilcox carrying out an audit on Ten Hag’s future, we can expect a decision after May’s FA Cup final against Manchester City.\nWith a perceived weak managerial class available this summer and options dwindling as other clubs sort out their futures before the season’s end, Tuchel may just be the option Sir Jim Ratcliffe decides to pursue.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 594,
  "scraped_at": "2026-02-14T02:13:49.311363",
  "_text_extracted": true
}