{
  "article_id": "c289fcb073ca",
  "url": "https://www.teamtalk.com/news/leeds-should-try-double-tottenham-raid-fabrizio-romano-confirms-star-will-leave-on-a-free",
  "title": "Leeds United transfers : Farke urged to launch double Tottenham raid as Romano confirms star free - transfer exit",
  "date": "20240521T121500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds should try for double raid on Tottenham as Fabrizio Romano confirms star will leave on a free\nLeeds United should look into the possibility of signing two players from Tottenham this summer with Joe Rodon very much in their focus but now a second star also up for grabs after Fabrizio Romano confirmed he would be jettisoned out by Ange Postecoglou.\nThe north London side made rapid strides under the management of the Aussie this season, though ultimately fell just short of their goal of qualifying for the Champions League after ultimately finishing in fifth. And while a Europa League place represents a fitting reward for the exciting brand of football that Postecoglou has introduced, he wants much more and clearly has ambitions to establish Tottenham among the very best in English and European football.\nWith that in mind, the ruthless Spurs boss has cleared the decks for 10 stars to leave N17 this summer as he looks to streamline his squad and improve their overall quality.\nAs such, Emerson Royal, Pierre-Emile Hojbjerg, Giovani Lo Celso and Bryan Gil are all up for sale this summer and likely to head overseas, while Ryan Sessegnon will be allowed to leave on a free transfer.\nGO DEEPER 👉 New Tottenham midfield general: ‘The Pitbull’, divisive talent and major wildcard all on Postecoglou’s radar\nIn addition, Spurs are also ready to let several stars who spent the 2023/24 season out on loan make permanent moves elsewhere, with Rodon, Djed Spence, Japhet Tanganga, Sergio Reguilon and Tanguy Ndombele also all up for grabs.\nHaving spent £225m to sign the 10 players, Spurs will have to wave farewell to a hefty portion of those outlays.\nHowever, one man they do look set to make a small profit on is Rodon, with the Wales centre-half joining Leeds on loan for the season and proving one of the cornerstones of their push for promotion.\nLeeds learn price to make Joe Rodon move permanent\nThe 26-year-old has proved an absolute rock at the heart of the Leeds defence and he will be crucial to their hopes of overcoming Southampton on Sunday in the Championship play-off final at Wembley.\nVictory in the game will ensure one of the pair will see an instant return to the Premier League after relegation last season and there will be little to separate the pair in what should be a very tight clash in the capital.\nIndeed, Leeds will need Rodon at his best to help shackle the talents of Adam Armstrong, who has struck 23 goals this season, having also hit the back of the net in Saints’ 2-1 win at Elland Road on the last day of the regular season.\nBut play-off success for Leeds would also help secure the futures of a number of their top stars with Archie Gray and Crysencio Summerville both attracting serious interest from Premier League sides.\nDON’T MISS 👉 Five Leeds stars the Whites are vulnerable to losing if they don’t win promotion\nIt would also all-but guarantee the permanent signature of Rodon at Elland Road and TEAMtalk understand the Wales defender has made a move to Elland Road his first priority this summer.\nIn the event they fail to win on Sunday, it would leave them exposed to the possibility of losing the defender elsewhere, with clubs in the Premier League also alerted to the 44-cap Wales international’s fine form.\nLeeds, though, are the favourites for his signature and it’s understood that a deal in the region of £12m, rising to £15m with add-ons, would be enough to secure his signing, handing Tottenham a small profit on their original £11m investment from Swansea in 2020.\nWhites would be shrewd to bring in Ryan Sessegnon too\nHowever, Rodon is not the only Spurs player Leeds should look to bring in this summer and a move to sign Sessegnon as a free agent would certainly make a great deal of sense.\nHis departure – and potential next move – has been clarified by Fabrizio Romano, who has revealed the player is keen to stay in the Premier League.\nThe transfer journalist posted on X, formerly Twitter: ‘Understand Ryan Sessegnon will leave Spurs as free agent as expected, time to part ways with the left-back. It’s already plenty of interest across England and Europe for Sessegnon, but player’s preference is to stay in the Premier League.’\nSessegnon has ensured an injury-plagued spell with Spurs, managing just 57 appearances over his five-year spell following a £25m move from Fulham in summer 2019.\nHowever, still only 24-years-old, the player still has a lot of quality and may just need a change of environment – just like Rodon before him – to get a regular run of games and to build up his confidence and fitness.\nAs suggested Leeds would need to secure promotion to have a good chance of winning the race for the player, but as a free agent, he would represent a low-risk investment if a salary package and length of deal could be agreed.\nHAVE YOU SEEN? 👉 Five Championship standouts Leeds Utd should sign if promoted to the Premier League\nLeeds have had an issue at left-back for a good number of seasons now, though Junior Firpo has come to the fore over recent months with a series of excellent displays during the Whites’ largely-impressive form over the second half of the season.\nThe former Barcelona man has eight assists to his name from 32 appearances this season, finally showing the Leeds fans what he is capable of.\nBut a return to the Premier League represents a major step-up in quality and Leeds would be wise to ensure they have adequate options to play left-back in the event they do beat Saints on Sunday.",
  "word_count": 960,
  "scraped_at": "2026-02-14T02:01:16.460057",
  "_text_extracted": true
}