{
  "article_id": "c29771c1dd21",
  "url": "https://en.vietnamplus.vn/hcm-city-eye-afc-womens-champions-leagues-semi-finals-post298422.vnp",
  "title": "HCM City eye AFC Women Champions League semi - finals",
  "date": "20241017T051500Z",
  "domain": "en.vietnamplus.vn",
  "source_country": "Vietnam",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "HCM City (VNS/VNA) – Ho Chi Minh City want a place in the semi-finals of the AFC Women's Champions League, being the Southeast Asian club with best results so far.\nPlaying internationally for the first time, the Vietnamese champions were in Group C and secured two wins and one loss, putting them in second place and so advancing to the quarter-finals.\nThe results were, according to coach Nguyen Hong Pham, due to the players’ determination and solidarity, along with the key role of three American players and national top scorer Huynh Nhu.\nHCM City defeated Taichung Blue Whale of Chinese Taipei and Odisha of India with same score 3-1, before losing 0-2 to title favourites Urawa Red Diamonds Ladies of Japan.\nHCM City not only advanced to the next round but are also the only club of the ASEAN region going into the knock-out stage of this continental competition. This result makes them one of four seeded teams who will enjoy the advantage of a home game in their next match in March, 2025.\nA draw will be held on January 16 in Kuala Lumpur to know who their quarter-final opponents will be.\nTough quarter-finals\nIncheon Red Angels (the Republic of Korea), Melbourne City (Australia), Urawa Red Diamonds and HCM City are the teams in the round.\nThey will play Abu Dhabi Country Club (UAE), Taichung Blue Whale, Wuhan Jiangda (China) or Bam Khatoon (Iran).\nApart from Taichung Blue Whale, who lost to HCM City in the group round, the remaining three are strong opponents.\nWuhan Jiangda are currently Chinese Women’s Super League champions. Abu Dhabi Country Club is a founding member of a local women's association football league and have achieved several consecutive league titles.\nBam Khatoon are the most titled of the Iranian women's league, having won ten championships.\nMeanwhile, HCM City face huge challenges as contracts with Nhu and three Americans expired after the group stage.\nTalani Barnet, Tatiana Mason and Meghan Root returned home while Nhu, one of top five scorers of the tournament, is said to be in negotiations for a contract with a foreign club.\n\"HCM City are home to senior, but getting old, members and young players who lack international experience. The gap of expertise between them is clear to see, although they are still the strongest club in Vietnam,\" said former midfielder Tran Nguyen Bao Chau.\n\"It is definitely a big problem for HCM City playing without Nhu and the foreigners who were important pieces of the team, showing their big influence in the group stage performance.\"\nCoach Pham said: \"We want to sign other contracts with the Americans and especially Nhu. At the same time, we will recruit more foreign players for the quarter-finals. There are five months to the next match, so we still have time to build a good plan.\"\nDeputy Director of the HCM City Culture and Sports Department Nguyen Nam Nhan said the club would enjoy a large investment in both domestic and Asian competitions, with the department calling for more sponsorship.\nIn addition to local support, HCM City will also pocket a 220,000 USD bonus from the AFC for their participation in the tournament.\nIf Pham and his players make it through to the semi-finals they will receive 120,000 USD./.\nGuam coach targets victory against Vietnam at AFC U20 Asian Cup qualifiers\nAfter two draws, Guam U20 coach Dominic Tacadina is determined to secure a win against Vietnam in their third match of Group A for the 2025 AFC U20 Asian Cup qualifiers, set to take place at Lach Tray Stadium in Hai Phong city on September 25.",
  "word_count": 602,
  "scraped_at": "2026-02-14T02:08:12.413270",
  "_text_extracted": true
}