{
  "article_id": "c2aa31864a6e",
  "url": "https://www.themag.co.uk/2025/01/st-james-park-awaits-newcastle-v-bournemouth-preview-newcastle-united/",
  "title": "St Jame Park awaits - Newcastle v Bournemouth preview",
  "date": "20250118T120000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "St James’ Park awaits – Newcastle v Bournemouth preview\nWelcome to the Newcastle v Bournemouth preview.\nSaturday 18th January – 12.30pm\nNewcastle host Bournemouth in the early kick-off this Saturday, looking to achieve an incredible club record ten wins in a row.\nConfidence is high on Tyneside with six league wins in succession ensuring Newcastle United are the form team of the Premier League.\nThrow in an additional three wins in the cups and the fact we have one of the most in-form strikers in world football at the moment, all the ingredients are there for the Toon to make a real challenge for qualification to the Champions League to go toe-to-toe with the elite of Europe.\nBournemouth may well have something to say about that and will be looking to continue their own recent run of good form, having not lost for ten games in all competitions and finding themselves just four points off the top four.\nForm\nNewcastle United have cruised to six straight Premier League wins in a row. We’ve achieved three points against Leicester, Ipswich, Villa, Man U, Tottenham and Wolves, scoring eighteen goals in the process and conceding just once, in an absolutely incredible run that has seen us rocket from twelfth in the league to the top four. During this time, we’ve also seen off Brentford, Arsenal and Bromley in the cups. We’ll end this weekend’s set of fixtures between third and sixth in the Premier League depending on results elsewhere.\nBournemouth have also been on an unbeaten run of games recently, having won two and drawn four of their past six league matches. Wins have been over Man U and Everton, whilst draws have come against Chelsea, Fulham, Palace and West Ham. They’ve scored nine goals in these six games and conceded five. They’ll end the weekend between fifth and eighth in the league.\nLast time out\nNewcastle played host to Wolves on Wednesday night and ran out 3-0 winners despite not having everything their own way. Isak cemented his place as one of the very best strikers in the world at present with another two goals. He’s now scored eleven in his past eight league appearances and became the first player in Toon’s history to score in eight consecutive league games. A further strike from Gordon completed the scoring in what was ultimately a triumphant night for the Toon.\nBournemouth drew away to Chelsea on Tuesday night and will consider themselves desperately unlucky not to win after conceding in the fifth minute of injury time. They came from behind to lead near the end but, in the end, had to be content with a point in a 2-2 draw.\nStat attack!\nNewcastle have hosted Bournemouth on six premier league occasions, winning two, drawing two and losing two.\nNewcastle are unbeaten in their past five home matches with Bournemouth in all competitions, winning three and drawing two.\nNewcastle have found the net in their past five home games against Bournemouth, scoring eight goals and conceding five.\nThis is only the eleventh meeting between the two sides at St James’ Park in all competitions. Newcastle have won five of the previous ten, the first of which came in the 1972 FA Cup.\nMemorable match\nIn November 2018, Newcastle hosted Bournemouth having only won one of their opening eleven Premier League matches. This was our worst start to a top flight campaign in over a hundred years and Rafa Benitez was staring a relegation battle in the face.\nThe match was only seven minutes old when Salomon Rondon opened the scoring at the Leazes End after great work by Yedlin. Things got even better for Newcastle before half-time when Rondon was on hand to bullet a header into the top corner to put the Toon two goals to the good.\nAny notion that NUFC were going to have things all their own way were soon dispelled when Bournemouth pulled one back on the stroke of half-time.\nThis had the potential to set up a nervy second half but the Toon continued to take the game to the Cherries and Rondon was desperately unlucky not to complete his hat-trick due to a string of fine saves from the Bournemouth ‘keeper.\nThere was to be no further scoring and the three points meant United could breathe a huge sigh of relief at the final whistle. Final Score Newcastle 2-1 Bournemouth.\nPlayed for both\nLeon Best played fifteen games for Bournemouth in 2006, scoring three goals for the cherries. He signed for NUFC in 2010 and scored ten goals in forty two appearances including a hat-trick against West Ham in a 5-0 win in 2011. He also achieved four crucial strikes in the 2011/12 season that saw United finish fifth under Alan Pardew. He scored both goals in a 2-1 win at home to Fulham, the equaliser in a 1-1 draw away at Aston Villa and the only goal of the game in a home win over QPR.\nMatt Richie played for Bournemouth between 2012 and 2016 and scored thirty one goals for the cherries. In 2014/15 he was voted the football league’s player of the season in a poll by ‘Four Four Two’ magazine. He signed for the Toon in 2016 and became an integral part of our midfield as we achieved promotion back to the Premier League under Rafa Benitez. He stayed for eight years and scored twenty five goals. His last goal for the club came in injury time against Bournemouth the last time they visited St James’ Park, as he rescued a 2-2 draw and celebrated in his usual style by booting the corner flag.\nCallum Wilson was a Bournemouth player for five years before signing for the Toon in in 2020. A fantastic striker who certainly knows where the goal is. Fingers crossed 2025 brings a return to full fitness for our number nine who has been plagued with injuries the past year. He’s currently on forty eight goals in one hundred and twelve appearances for the black and whites.\nManagers\nEddie Howe after a 3-0 home win against Wolves:\n“We had to be patient, and we had to play a different way slightly. We had a lot of the ball in the first half, we knew Wolves would be stubborn opponents. We got a lucky break with the first goal, but overall I think we deserved it. Depending on how the game pans out, you need different ways to win. The first goal was so important today, but we had a few scares: Wolves are difficult to play against. Overall, can’t be too picky, it is nine wins in a row now. We know we can play better than today, we did enough of the detailed work to get the win. There’s a lot to be positive about and a lot to improve”.\nAndoni Iraola following a 2-2 draw away at Chelsea:\n“I think we were better than Chelsea in the second half. I think we deserved the turnaround. And I think probably the point is fair, but the way we’ve lost the point, I don’t think it’s fair. I think there is a goal that they score that should be disallowed. When they shoot the free kick, you stop the image and Cucurella is touching our wall. It should be one yard, it’s not, we cannot argue if it’s half a yard or three quarters, he’s touching Semenyo like this. And I understand the referee live, ninety-four minutes, the pressure of Stamford Bridge but one guy in the VAR only has to check this free kick, stop the image when he shoots. They are in a legal position, no, they are not. One second, that’s it. This is not arguable, this is what it is. And to lose the three points here because of this, for me it’s difficult to accept.”\nCharity\nNewcastle United fans food bank will once again be collecting opposite the Gallowgate end and gratefully receiving food, money and toiletries for those in need. Of particular interest are non-perishable food and drink items (such as noodles, pasta, rice, canned food, soup, cereal, cordial, long life milk etc) as well as toiletries such as shower gel, shampoo, toothpaste and sanitary products. Please give whatever you can, any donation is very much appreciated.\nFor further info and/or to donate online go HERE.\nPrediction\nThis is the battle of two of the form teams of the Premier League at present, with neither side tasting defeat for quite some time. A win for Newcastle would set a club record for ten wins in a row and I think we’ll get it in what could be a narrow victory for the black and whites Newcastle 1-0 Bournemouth.\nNewcastle United upcoming matches:\nSaturday 18 January – Newcastle v Bournemouth (12.30pm) TNT Sports\nSaturday 25 January – Southampton v Newcastle (3pm)\nSaturday 1 February – Newcastle v Fulham (3pm)\nWednesday 5 February – Newcastle v Arsenal (8pm) Sky Sports (League Cup)\nSaturday 8 February – Birmingham v Newcastle (5.45pm) BBC1 and BBC iPlayer (FA Cup)\nSaturday 15 February – Man City v Newcastle (3pm)\nSunday 23 February – Newcastle v Forest (2pm) Sky Sports\nWednesday 26 February – Liverpool v Newcastle (8.15pm) TNT Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1553,
  "scraped_at": "2026-02-14T02:20:55.379254",
  "_text_extracted": true
}