{
  "article_id": "c2b23392e097",
  "url": "https://www.teamtalk.com/tottenham-hotspur/spurs-preparing-shock-chelsea-raid-revenge-seeking-superstar-if-man-utd-poach-star-man",
  "title": "Tottenham preparing shock Chelsea raid for revenge - seeking superstar if Man Utd complete £100m - plus transfer",
  "date": "20230225T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nTottenham preparing shock Chelsea raid for revenge-seeking superstar if Man Utd complete £100m-plus transfer\nTottenham are mulling a blockbuster Chelsea raid for a frontman who could do as good of a job as any at replacing Harry Kane if he’s poached by Man Utd, per a report.\nHarry Kane has and continues to be Tottenham’s talisman. The 29-year-old recently surpassed the legendary Jimmy Greaves as the club’s all-time leading goalscorer.\nKane is the definition of a complete centre-forward and as such, is regularly linked with blockbuster moves elsewhere each summer.\nHe came close to joining Man City back in 2021, though multiple bids north of £100m weren’t enough to cajole Daniel Levy into selling.\nKane’s current contract is due to expire in 2024 and as a result, his future is increasingly becoming a point of contention as the current season rolls on.\nHis desire to add silverware to his individual honours is well documented. So too is his wish to keep testing himself in the Champions League – a competition Spurs are embroiled in a fierce fight to simply qualify for next season.\nOne club who stand a better chance of satisfying both of those desires is Man Utd. The Telegraph recently stressed Kane and Napoli’s Victor Osimhen are Erik ten Hag’s two primary striker targets for the summer. Both are expected to cost in excess of £100m.\nTottenham are extremely resistant to the idea of selling Kane to a domestic rival. In the event Kane doesn’t pen fresh terms and Spurs are forced to cash in, they’d much prefer selling to an overseas side, such as Bayern Munich.\nHowever, despite being by far Germany’s biggest side, even Bayern cannot compete with the financial might of England’s heavyweights. As such, the prospect of losing Kane to Man Utd remains a very real possibility.\nNow, according to a report out of Spain, Tottenham have lined up a shock Chelsea target to replace Kane if he’s poached.\nRomelu Lukaku to replace Harry Kane?\nBoth Goal and Caught Offside cite the Spanish source who claim Blues enigma, Romelu Lukaku, is the man in Spurs’ sights.\nThe 29-year-old was a whopping £97.5m signing in the summer of 2021, though his first season at Stamford Bridge disappointed.\nThe Belgian was subsequently loaned back to former side Inter Milan via an £8m loan fee and once again, he’s found the going tough.\nLukaku has notched just four goals from 14 appearances for the Nerazzurri thus far. His game-time has been restricted due to various injuries as well as concerns over his fitness and conditioning.\nIndeed, on the subject of why Lukaku is regularly benched by manager Simone Inzaghi, Inter CEO, Beppe Marotta, recently said (via Fabrizio Romano): “Why Lukaku on the bench? Romelu has 103kg to carry on his shoulders, he must be physically fit.\n“It’s not yet 100 percent fit, he’s getting back to the best form. We expect Romelu to do great things in the second part of the season.”\nHowever, if there’s one manager in world football who knows how to get the best out of Lukaku it’s Antonio Conte.\nConte can bring the best out of Lukaku\nLukaku earned his £97.5m move to Chelsea on the back of an outstanding two-year stint at Inter.\nConte was his manager at the time, with Lukaku notching 64 goals and 16 assists in 95 matches. Inter won their first Serie A title in over a decade during the 2019-20 season with Conte at the helm and Lukaku leading the line.\nThere has been talk of Inter intending to sign Lukaku outright from Chelsea once his loan concludes. However, Inter are in a hole financially and whether they’re able to stump up the type of fee Chelsea will command remains to be seen.\nCaught Offside add Lukaku is ‘keen’ to leave Chelsea for good at season’s end. Clearly, he’s ready to draw a line under his failed return to Stamford Bridge.\nGoal state his preference is joining Inter on a permanent basis, though Spurs ‘will try to bring him back to the Premier League’ if Kane departs.\nWhile replacing a player of Kane’s all-around ability is an unenviable task, a Conte-managed Lukaku may be just as viable of an option as any others.\nOf course, Tottenham’s hope remains Kane committing his long-term future in north London – a scenario that would remove the need to sign Lukaku.",
  "word_count": 737,
  "scraped_at": "2026-02-14T01:46:30.519862",
  "_text_extracted": true
}