{
  "article_id": "c2d68eb3b130",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=309680",
  "title": "Mali AS Mande the first to book ticket to the CAF Women Champions League , Cote dIvoire 2023",
  "date": "20230818T000000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Malis AS Mande the first to book ticket to the CAF Womens Champions League, Cote dIvoire 2023\nMalis AS Mande secured the first spot in Africas premier womens club competition; CAF Womens Champions League, Cote dIvoire 2023 that is scheduled for between 05 19 November this year.\nThe Mandekas, as the Malian side is popularly known, secured their ticket to Cote dIvoire after winning the CAF Champions League WAFU Zone A Qualifiers played in Liberia where they had to fend off stiff competition against hosts, Determine Girls, Dakar Sacre Coeur of Senegal as well as Sierra Leones Mogwemo Queens in a round robin structured qualifier played between 05 13 August.\nThe hard-fought achievement by Mande sees them return to Africas top-flight womens club competition, having made an appearance at the inaugural edition in 2021, where they finished bottom of Group A in a pool that consisted of the eventual runner-up Hasaacas Ladies of Ghana, who lost 2-0 against Mamelodi Sundowns in the final.\nHaving missed last years edition in Rabat, the West Africans will be determined to return to the competition a much stronger and competitive side when they take on Africas best womens football clubs in Cote dIvoire.\nCoach Moustaph Laïcou Traoré will be relying on the continental experience of star striker, Awa Traore, who is familiar with the CAF Womens Champions League, having found the clubs first-ever goal in the competition when they lost 3-1 to Egypts Wadi Degla.\nCompetition in Cote dIvoire is set to be at an all-time high in November, following CAF President Dr Patrice Motsepes announcement last year that the prize money will be increased to USD 400 000 for the winners a significant step in CAFs ongoing efforts of growing the womens game on the continent.\nAbout AS Mande\nAS Mande, also known as The Mandekas is a Malian womens football club based in the capital of Bamako. They compete in the Malian Womens Championship, which is the countrys womens first division league organised by the Malian Football Association.\nFull Name Association Sportive de Mande\nNickname Les Mandekas (The Mandekas)\nHome Bamako\nCoach Moustaph Laïcou Traoré\nDomestic Titles\nMalian Womens Championship (2017, 2021)\nMalian Womens Cup (2012, 2014, 2015, 2016)\nRegional Titles\nCAF Champions League WAFU A Qualifiers champions (2021, 2023)\nContinental\n2021 CAF Womens Champions League (Group stage exit)\n( Press Release Image: https://photos.webwire.com/prmedia/8/309680/309680-1.jpg )\nWebWireID309680\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 417,
  "scraped_at": "2026-02-14T02:10:09.486387",
  "_text_extracted": true
}