{
  "article_id": "c2de8c7d66c1",
  "url": "https://theathletic.com/4304722/2023/03/17/how-scott-parkers-club-bruges-adventure-unravelled-in-67-days/",
  "title": "How Scott Parker Club Bruges adventure unravelled in 67 days",
  "date": "20230317T063000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Scott Parker sat alone on a row of metal airport seats in the departure lounge at Lisbon airport, scrolling through messages on his phone.\nHe had not been told definitively that his time at Club Bruges was over yet, but he knew what was coming when he landed back in Belgium. His team had been beaten 5-1 by Benfica the night before in the second leg of the Champions League last 16, completing a 7-1 aggregate defeat.\nAdvertisement\nBefore boarding the flight, some of the assembled Belgian media grabbed pictures and videos of the lonely Englishman, but one of the players who had grown to like his new manager interjected. “Nothing better to do?” Noa Lang asked protectively.\nAfter the three-hour flight, Parker was called to a meeting with the club’s owner, Bart Verhaeghe, and chief executive Vincent Mannaert at the club’s training ground and told his time was up. As the players, without a coach, went through a slow-paced recovery session on the grass, the media team drafted the sacking announcement. It did not take long.\nBy 4:45pm on March 8, Club Bruges devoted just 50 words to the news on their website. They highlighted the date he had been appointed (December 31, 2022) and that he had previously managed Fulham and Bournemouth, before adding a withering pay-off about his tenure. “Parker won two of his 12 games for Club,” it read.\nThat was that. Parker’s Belgian adventure, aimed at “improving himself” as a manager, was over after just 67 days.\nLast season, Club Bruges won Belgium’s domestic league for a third season in a row. But after relative managerial stability came a period of disruption.\nClub legend Philippe Clement won two of that trio of titles (in 2019-20 and 2020-21) before the former player — who spent a decade there from 1999-2009 — left midway through last season to join Monaco. Alfred Schreuder picked up the baton, finished second and won the title-deciding four-team, six-game play-off.\nLast summer, Schreuder left to replace Manchester United-bound Erik ten Hag at Ajax and Bruges promoted Carl Hoefkens — once a player at Stoke City and West Bromwich Albion — from within. After playing for the club and working with academy prospects, he had assisted Clement. Hoefkens described himself as a “man of the house”, while Mannaert said he was “the right man at the right time”.\nAdvertisement\nThe hierarchy wanted former head coach Christoph Daum as a mentor alongside him, but he fell ill. Instead, another former player, Paul Okon — ex-Middlesbrough, Watford and Leeds — joined forces with Hoefkens.\nWhat unfolded contributed to a tricky situation for Parker to inherit: a team disappointing domestically but exceeding expectations in Europe. Opening Champions League victories over Bayer Leverkusen (1-0 at home), Porto (4-0 away) and Atletico Madrid (2-0 at home) helped secure a last-16 qualification. They last went further than that stage in 1977-78 when they lost 1-0 to Liverpool in the final.\nSuccess on the continent papered over the cracks at home and put an even greater target on their back, with rivals relishing the chance to bring them back down to earth.\nThey had lost four league games by early November, the same as in the entire previous season. The hierarchy were not impressed with the reaction after the World Cup break, including an early Belgian Cup exit. By Christmas, they wanted to make a change. “It eats you up: you live from day to day with no guarantees until you are thrown away like a piece of dirt. A contract means nothing,” said assistant Okon to Belgian publication Humo.\nOkon opened an Italian deli with his wife Yamaira near to the club’s Jan Breydel Stadium and his son was at the Bruges academy. Asked to stay on in a scouting role, he said: “If I told my wife I didn’t love her anymore but still wanted her to stay my wife, that wouldn’t work, would it?”\nFormer Aston Villa boss Steven Gerrard, Roberto Martinez — who had left the Belgium job after Qatar 2022 — and his eventual replacement Domenico Tedesco were linked with the role, along with Parker. The former England midfielder left Bournemouth after antagonising the club’s hierarchy in the aftermath of August’s 9-0 defeat at Liverpool by claiming they were unequipped for the Premier League.\nParker subsequently spent a period of reflection at home with his wife, Carly, and their four sons. Job offers came in but were not the right fit. He wanted a top-tier job after winning two promotions from the Championship. Bruges interviewed him and an agreement was reached after a long-term plan was agreed upon. “We spoke with several coaches and we deliberately decided together to go with Scott, who made us believe he could help us get back to the top of the league,” a spokesperson from Club Bruges told The Athletic.\nAdvertisement\nParker also checked in with former Fulham defender Denis Odoi, who left Craven Cottage for Bruges in February 2022, to gauge his opinion.\nWhen the appointment was announced, three days after the sacking of Hoefkens, there was a conspicuous absence of any supporting quotes from the hierarchy. Mannaert both welcomed and bade a fond farewell to his predecessor. Parker was unconcerned and felt he had been given a clear mandate to set about his work.\nThe 42-year-old had no time to waste, with a hands-on and demanding hierarchy watching him closely. After his appointment on December 31, he immersed himself in club life. For the first three weeks, he lived at the training ground in one of the rooms on site. He brought three members of support staff with him: assistant Matt Wells, goalkeeper coach Rob Burch and analyst Jonathan Hill.\nAfter outlining his plans to the media on January 2, which also included a press call with Mannaert, the next day was his first training session. He had five days to prepare for a meeting at league leaders Genk, who had won 15 of 17 league games since losing to Club Bruges on the opening day.\nIt was a baptism of fire. Bruges led 1-0 after 21 minutes thanks to captain Hans Vanaken’s goal, but Genk ran out 3-1 winners in a tempestuous game during which Parker’s opposite number Wouter Vrancken and Bruges defender Abakar Sylla were both sent off. Parker found that and other atmospheres a culture shock.\nHe prioritised improving his players’ emotional intelligence, having worked with sports psychologist Mike Griffiths during his playing days. He asked the club to enlist a coach to help in this area. He wanted his team to be able to control the game, their bodies and minds to play like “silent assassins”.\nUnfortunately, it would soon be those around Parker targeting him.\nAdvertisement\nIn his previous jobs at Fulham and Bournemouth — where he won promotion in his first full seasons — pre-seasons allowed time to lay out his philosophy, but at Bruges, he had to hit the ground running. Before agreeing to take the job he weighed up the pros and cons of the opportunity, despite the lack of preparation time. It was a risk he was willing to take. But ultimately the gamble delivered a more complex proposition than he or his staff had bargained for.\nParker openly admitted he had expected an upturn in fortunes. The lack of a new manager bounce appeared to spook the hierarchy. One source close to the situation — who did not want to be named to protect relationships — told The Athletic they were surprised by how quickly confidence evaporated.\nAfter Genk came a dominant performance against Anderlecht in his first home game. Bruges led 1-0 until the 79th minute, then Brandon Mechele scored an own goal. The visitors stole a point without having a shot of their own on target. No luck and more early judgment from those above followed in two more draws against mid-table St Truiden (1-1) and Charleroi (2-2).\nGoals from Lang and Vanaken earned Parker a first win against strugglers Zulte Waregem in his fifth game. Left-winger Lang’s season had been disrupted by an ankle injury and his reintegration had been slow under predecessor Hoefkens. He was one of the players in the dressing room on board with Parker’s methods.\nLang clearly wanted his team-mates to pull their weight. After the derby against Cercle Bruges ended 2-2 — Club Bruges had led twice, with Lang scoring the opener — the Dutchman thundered down the tunnel. “Fucking pussies! Every fucking week!” he shouted at his team-mates.\nOther dressing room issues exist, too. Ruud Vormer, an influential captain, had gone on loan to Zulte Waregem, leaving some of his loyalists disillusioned. Vanaken, inheritor of the armband, and former Liverpool goalkeeper Simon Mignolet had to try to manage the group dynamic.\nGoals left the side in the summer, too. Highly regarded attacking midfielder Charles De Ketelaere (18-goal top scorer in 2021-22 in all competitions for Club Bruges) and experienced striker Bas Dost (14 goals and joint-second top scorer with Vanaken) joined AC Milan and Utrecht respectively, and record £14million ($16.8m) signing Roman Yaremchuk did not adapt after joining from Benfica. Parker’s predecessor Hoefkens felt the Ukrainian was not in the right physical condition and played another new signing, Ferran Jutgla, instead.\nAdvertisement\nParker hoped to kickstart Yaremchuk’s season but the forward failed to score under him. The manager tried multiple different combinations, including playing Lang as a false nine. Between the luckless game against Anderlecht and the angry Bruges derby, he made personnel changes in nine consecutive matches. “Scott Parker — read Tinkerman” was the headline in Belgium newspaper HLN.\n“The coach was OK but his ideas were not working because he was trying to bring in too much in such a short time,” one of the players’ agents, who wished to remain anonymous to protect relationships, tells The Athletic. “Then when the results are like this, the football business is very lonely and the finger will always point at the manager.”\nParker knows what he wants. “That’s the biggest thing for me. I sit here with the core principles. Not just made out of thin air — it’s come from 25 years of playing and four years of management,” he explained. “I’ve smelt it, I’ve seen it, to be in an elite environment. That comes with pure commitment. I hope they jump on the train.”\nThe ever-changing team sheets became a stick with which to beat Parker, who admitted his style was “complicated” at times. “I’ll always be judged on the results, but (they) won’t define me or the team. It’s a process that takes time. It doesn’t represent the real team that I want us to be,” he said.\nParker had an “unwavering commitment” to what had got him success before. “I’m fearless in that,” he said. It included showing his squad video clips of previous Bournemouth performances to help get his message across. He wanted them to be more dynamic in the final third, work tirelessly for each other and avoid allowing games to turn into out-of-control, end-to-end basketball matches.\nThe second win (2-0) of his tenure, against Gent, was a step forward. By that point he had moved into accommodation in the Bruges suburb of Knokke and his youngest son had joined the club’s academy. He was plotting a path in Belgium until, at the very least, the summer.\nBut next came a damaging 3-0 defeat at relegation-threatened Oostende. Dejected afterwards, he said he was “shocked” by the performance. Angry fans gathered to show their displeasure. The writing was on the wall.\nAdvertisement\nThe quick turnaround time between that Friday fixture and travelling to Lisbon on Monday for the second leg against Benfica (after a 2-0 first-leg defeat) saved him from being sacked over that weekend. The Athletic was told by a club spokesperson that they had been “continually assessing the situation and performance” and a board meeting was held in the Portuguese capital on the day of the game.\n“I haven’t heard anything from above,” Parker said the night before.\nTrue to form, Parker tinkered with his line-up for the match at the Estadio da Luz and the line-up was leaked after the pre-match meeting at the team hotel, although Club Bruges deny that had come from a club official. By that stage, they were already discussing replacements though and a return for Schreuder — who had only lasted until late January at Ajax — was a topic of conversation.\nAfter the 5-1 defeat, Parker was asked if the next league game against Standard Liege would be his “judgment day”. “I can see where that question is coming from, as I have heard it many times in the past four to five weeks,” he said. “I’m not naive. I’m here to counter these bad times and develop a team capable of winning a series of games in a row. I’m still fully convinced I am able to turn this around.”\nThey would be his last words as the club’s head coach.\nRik De Mil, part of his backroom staff, was appointed interim coach and Parker’s representatives discussed his severance package with club lawyers. One senior figure at the club, who wanted to remain anonymous, told The Athletic that the time to fully assess the decision-making behind the Parker appointment will be at the end of the season. “Working on a solution is the most important thing,” they said.\nDe Mil won 2-0 against Standard Liege in his opening game in charge. The club referred to the “past difficult weeks and months” in its official round-up of the game, with Parker’s replacement commenting on what he had inherited.\nAdvertisement\n“It was important to let the players express their concerns and frustrations,” said De Mil. “We couldn’t possibly get rid of everything in two days, absolutely not, but through some group discussions and also individual conversations, we tried to build on our way back. We can keep being negative, but that’s not going to help us. Only positivity can make sure we get out of this.”\nWithin a couple of days, De Mil got the job until the end of the season. “Rik knows the club and the team like no other. His passion and ambition bring a breath of fresh air with which we want to get the maximum out of the season together with the players and everyone in the sporting staff,” said Mannaert in the statement.\nJust a few weeks earlier, Parker said: “I’m not one to accept how everyone sees football management (with) managers just (getting) the sack. That’s extremely harsh, although we live in that world where you’re always three games away from losing your job.”\nHe is now taking time away and left his coastal home in Belgium soon after his dismissal. Dipping his toe into foreign management proved to be a short, sharp, winter shock. He will hope for a warmer welcome — and a bit more time to breathe — in his next role.\n(Top photo: Gualter Fatia/Getty Images)",
  "word_count": 2502,
  "scraped_at": "2026-02-14T01:59:46.886301",
  "_text_extracted": true
}