{
  "article_id": "c3151eafcfa9",
  "url": "https://www.empireofthekop.com/2025/03/05/liverpool-psg-team-news-champions-league/",
  "title": "Liverpool team news v PSG : Gakpo misses out despite making Paris trip",
  "date": "20250305T193000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool cruised through the new-look league phase of the 2024/25 UEFA Champions League, but now the unforgiving business of knockout football begins for the Reds!\nDespite topping the first round and theoretically getting a favourable draw for this phase of the tournament, Arne Slot’s side must overcome a Paris Saint-Germain team in flying form and who’ve looked like a much more cohesive unit since moving away from their Hollywood transfer policy of previous years.\nBoth teams have 13-point leads at the top of their respective domestic leagues, but one of them will be out of European competition by this time next week.\nLiverpool appeared to have been dealt a sizeable blow on Tuesday when Cody Gakpo didn’t partake in team training, although hopes of him featuring at the Parc des Princes were raised by his inclusion in the travelling squad to the French capital.\nHas he made it into the starting line-up tonight, though? We now know the answer as the team news has been confirmed.\nLiverpool starting XI to face PSG\nSlot makes just one change from the side which began the 2-0 win over Newcastle in the Reds’ most recent outing a week ago.\nAlisson Becker continues in goal, with Andy Robertson coming in for Kostas Tsimikas in an otherwise unchanged back four.\nRyan Gravenberch and Alexis Mac Allister are again partnered in midfield, with Dominik Szoboszlai in the number 10 role and hoping to build upon his superb performance against the Magpies.\nThe forward line has a familiar look to it, with Mo Salah and Luis Diaz out wide and Diogo Jota through the middle. Gakpo isn’t included in the matchday squad, with the Dutchman seemingly losing his battle against time to be fit for tonight’s game.\nRobertson, Konate and Mac Allister (along with substitute Harvey Elliott) all face the risk of suspension for next week’s second leg if they’re booked at the Parc des Princes.\nYou can view the Liverpool starting XI and substitutes below, via @LFC on X:\nThe Reds to take on PSG 💫🔴 #UCL\n— Liverpool FC (@LFC) March 5, 2025",
  "word_count": 348,
  "scraped_at": "2026-02-14T02:18:17.728875",
  "_text_extracted": true
}