{
  "article_id": "c329a8c27a3a",
  "url": "https://www.thisdaylive.com/2025/09/04/bayelsa-backs-prosperity-girlsto-lift-wafu-b-trophy/",
  "title": "Bayelsa Backs Prosperity Girlsto Lift WAFU B Trophy",
  "date": "20250904T041500Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nBayelsa Backs Prosperity Girlsto Lift WAFU B Trophy\nChairman of Bayelsa State House of Assembly Committee on Sports and Youth Development, Hon. Tare Porri, has thrown his weight behind Bayelsa Queens winning the sub- regional title for a second time after first lifting it in 2022.\nThe Prosperity Girls have been having a good run in the tournament that serves as qualifiers for CAF Women’s Champions League and will on Friday at CKB Stadium, Yamoussoukro, meet home side, ASEC Mimosas to determine who among them will be crowned champions of the tournament.\nIn an interview with our correspondent, Hon. Porri declared that he’s happy with the performance of the team and is looking forward to seeing them overrun their Ivorien counterparts in the epic finals even as he congratulated the team for doing the country proud in Cote d’Ivoire.\n“First on behalf of the good people of Bayelsa State, I want to congratulate the Prosperity Girls for not only winning their semi- final match but emerging victorious in all the matches they have played so far in the tournament.\nThey’re not just Bayelsa Queens but representing the biggest country in Africa and we’re looking forward to crown their success with the trophy\n“To be sincere with you, we were not expecting anything less than 5-1 in the semi- finals clash but football being what it is, we came from a goal down to win 2-1 which to me was a great victory.\n“I’m equally impressed with their progression in the tournament. In their first game, the team defeated Police Ladies of Ghana 2-1 before walloping Sam Nelly 4-1 and scored three unreplied goals in the second half against ASKO of Togo after a goalles first half which shows the character and resilience of the team and that’s what we expect to see in the finals “, he stressed.\nHon. Porri who is the member representing Ekeremor Constituency 1 in the state Assembly while urging the team not to underrate their opponents dismissed the fears of home advantage in the game, insisting that the girls are experienced and well prepared for the challenge ahead.\n“The issue of home advantage will not have any role in the encounter because the girls are well prepared for the clash. We’re Bayelsans and have never been conquered before and the Ijaw spirit is burning in the girls and that’s what they will take to the pitch.\n“Although football can be funny at times and everything is possible but there’s no cause for alarm. When you remember the last World Club finals between my team Chelsea and PSG, you’ ll understand what I mean. Nobody gave Chelsea chance in that game but out of determination, they ended up winning 3-0 and that’s what I want our girls to do.\nHe reminded the team that they have the support of everybody back home in Nigeria and that Governor Diri has already promised a handsome reward for them if they bring home the trophy, charging them to go all out for victory.\n“We all know that Gov. Diri is a sports loving governor who rewards excellence and encourages sports men and women to excel. He has already said it that the team will be handsomely rewarded when they win the trophy and I know he will make the award pronouncement once the trophy touches down in Yenagoa.\n“The Governor, His Excellency , Douye Diri, would have loved to be in Cote d’Ivoire for the finals but other national assignments will prevent him from coming but he’s sending the Deputy Governor, Senator Lawrence Ewhrudjakpo, who will lead a high-powered government delegation to the finals to show you how serious he takes sports,” concludes Hon. Porri.",
  "word_count": 618,
  "scraped_at": "2026-02-14T02:09:24.930345",
  "_text_extracted": true
}