{
  "article_id": "c331ebb1e597",
  "url": "https://www.teamtalk.com/news/euro-transfer-gossip-man-utd-to-complete-43m-andre-onana-signing-inter-milan-liverpool-go-all-out-kylian-mbappe-psg",
  "title": "Euro Paper Talk : Man Utd to complete £43m signing of dominant world - beater ; Liverpool go all out for Kylian Mbappe",
  "date": "20230627T134500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro Paper Talk: Man Utd to complete £43m signing of dominant world-beater; Liverpool go all out for Kylian Mbappe\nMan Utd are being tipped to seal the signing of a world class Inter Milan star after their sporting direction flew to England to ‘close the deal’, while Liverpool have been linked with an incredible Kylian Mbappe coup – both in Tuesday’s Euro Paper Talk.\nMAN UTD GOALKEEPER DEAL NEARS\nInter will find it ‘impossible’ to reject Man Utd if and when they table an anticipated bid worth €50m (approx. £43m) for Andre Onana, and sporting director Piero Ausilio has flown to England to seal a deal, per a report.\nUnited are exploring the market for a new starting goalkeeper amid concerns David de Gea will leave as a free agent.\nDe Gea’s current contract is due to expire on June 30 (Friday) and unless he’s willing to take a sizeable pay-cut, an extension won’t be signed.\nAdding fuel to the exit fire is the fact Ten Hag has refused to confirm De Gea will be his starting stopper next season even if he does pen fresh terms. As such, a parting of the ways between United and De Gea after 12 years is looking increasingly likely.\nOn the subject of who Man Utd replace the veteran Spaniard with, Italian outlet Corriere Della Sera claims Inter’s Andre Onana is that man.\nIndeed, the outlet claim Inter will sell Onana to Man Utd for €50m (approx. £43m) despite initially hoping to generate closer to €60m (approx. £51.6m).\nExplaining why, it’s revealed Inter’s delicate financial position and the immediate need to generate funds for the signings of Davide Frattesi and Romelu Lukaku are front and centre in their thinking.\nAs such, Inter’s sporting director, Piero Ausilio, has reportedly landed in England to ‘close the deal’ with Man Utd.\nOnana, 27, led all Champions League keepers in the clean sheets category (eight) last season. His mark of 6.8 also saw him top the goals prevented category ahead of Real Madrid’s Thibaut Courtois (5.9).\nThe Cameroon ace is also a known commodity to Ten Hag having shared time together at Ajax between 2017-22.\nLIVERPOOL IN INCREDIBLE MBAPPE LINK\nFIFA agent, Marco Kirdemir, has remarkably claimed Liverpool are “competing with Real Madrid and want to pay a fortune for [Kylian] Mbappe”. PSG have threatened to sell the French megastar this summer if he refuses to sign a new contract, though a reported €300m transfer fee is clearly beyond Liverpool’s means. (RMC Sport)\nRuben Loftus-Cheek is on the cusp of leaving Chelsea for AC Milan in a deal worth €16m plus €4m in add-ons. (Fabrizio Romano)\nChristian Pulisic could join RLC at the San Siro, with Milan pressing ahead with a deal for the American winger. (TuttoMercatoWeb)\nArsenal have decided to cash in on Folarin Balogun this summer and hope to generate around £35m. Brentford, Crystal Palace, Everton, Fulham and West Ham are all viable destinations. (90min and Football Insider)\nWest Ham have entered talks over the signing of Juventus midfielder, Denis Zakaria. The ex-Chelsea loanee would be viewed as their replacement to Declan Rice. (Gianluca Di Marzio)\nTOTTENHAM STRIKE JAMES MADDISON AGREEMENT\nTottenham have struck an agreement on personal terms with Leicester playmaker, James Maddison. Talks between Spurs and the Foxes over the transfer fee are underway and Tottenham chairman Daniel Levy is taking the lead in negotiations. (Fabrizio Romano)\nHarry Kane has selected Bayern Munich as his preferred next club and the German giant have lodged a bid totalling €70m plus add-ons. (Sky Germany and David Ornstein)\nLeeds Utd could lose Robin Koch to the Bundesliga, with Bayer Leverkusen and Eintracht Frankfurt both interested. Koch can leave Leeds via a relegation clause in his contract and Frankfurt have opened talks with the Whites. (Kicker)\nNeymar has received a substantial offer to become the latest superstar to join the Saudi Pro League. (The Athletic)\nEverton want to sign Leeds Utd winger Willy Gnonto ‘immediately’. The winger’s agent has fanned the flames by revealing Gnonto wishes to continue playing in the Premier League following a breakthrough season. (Gazzetta dello Sport and CalcioMercato)\nMarcus Thuram has landed in Italy ahead of undergoing a medical with Inter Milan. The Borussia Monchengladbach frontman, 25, has agreed a five-year deal and will join Inter as a free agent. (Various)\nLIVERPOOL MIDFIELD DEAL DELAYED\nLiverpool’s move for Nice midfielder Khephren Thuram looks doomed to fail, with the French side determined to retain the 22-year-old for one more year. As such, a move may have to wait until 2024, a development that does nothing for the Reds right here and now. (Get French Football News)\nLiverpool legend Roberto Firmino is closing in on a move to Saudi Arabian side, Al Ahli. A three-year contract has been tabled and a medical prepared. (Fabrizio Romano)\nFirmino could form a tantalising partnership with Man City’s Riyad Mahrez, with the winger poised to be offered colossal wages of £43m-a-year plus bonuses by Al Ahli. (Daily Mail)\nJuventus are willing to cash in on Brazil centre-back Gleison Bremer if offers of around €50m are received. Tottenham are showing interest. (Gazzetta dello Sport)\nBarcelona are disgruntled with both Ansu Fati and Ferran Torres, with the pair refusing to leave the club this summer. Barcelona are struggling to finance deals until players are sold, though neither want out. (AS)",
  "word_count": 889,
  "scraped_at": "2026-02-14T01:56:02.414017",
  "_text_extracted": true
}