{
  "article_id": "c33a510514eb",
  "url": "https://www.90min.com/posts/kim-little-signs-new-contract-arsenal",
  "title": "Kim Little signs new contract with Arsenal",
  "date": "20230418T111500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kim Little signs new contract with Arsenal\nKim Little has signed a new contract with Arsenal, committing her future to the club just a day afer being ruled out for the remainder of the 2022/23 season.\nThe 32-year-old midfielder, who first joined Arsenal in 2008 and has made 290 appearances for the club, scoring 164 goals, has agreed to extend her stay at the north London club.\nShe has won six league titles, three FA Cups and five league cups with Arsenal.\n“I’m delighted to sign a new contract at Arsenal,” said Little. “Thinking back to when I first joined at the age of 17, I’m so proud of the progress that we have made together.\n\"Arsenal has been such an important part of my life and over time this club has become my home. It continues to be a privilege to represent Arsenal and I’m still so motivated to move this club forward and to be a part of its success.”\nHead coach Jonas Eidevall said: “Kim is a world-class player and an exemplary professional. Her contribution here over many years has been outstanding and we are so pleased that she will continue to represent Arsenal for years to come.\n\"On and off the pitch, Kim is such an important part of what we are trying to achieve here at Arsenal Football Club so we are all delighted with this news.”\nLittle's hamstring injury came during Arsenal's 2-0 Champions League victory over Bayern Munich which ruled her out for the rest of the season.\nArsenal currently sit third in the WSL table, three points behind leaders Manchester United, who they face on Wednesday in what could be a defining fixture in determining the league title.\nThe Gunners are also competing in the semi-finals of the Champions League, where they take on Wolfsburg, looking to reach their first European final since their famous 2007 triumph.\nAnalysis\nLittle may be out for the rest of the season, but her presence in the dressing room cannot be understated and her extension will be a boost for Arsenal as they chase their first WSL title since 2019.\nMany felt that Arsenal would struggle this season with key forwards Beth Mead and Vivianne Miedema sidelined since before Christmas, but with Little captaining the side, the team have been as competitive as they can be.\nLittle has consistently been one of the best players in the world, and it was crucial that Arsenal ensured that she stayed as they look to go back to winning trophies every season.",
  "word_count": 423,
  "scraped_at": "2026-02-14T02:06:55.008246",
  "_text_extracted": true
}