{
  "article_id": "c38ae73e1cf2",
  "url": "https://www.aol.co.uk/man-city-liverpool-lead-way-111753120.html",
  "title": "Man City and Liverpool lead the way in early Premier League report card",
  "date": "20240902T114500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City and Liverpool lead the way in early Premier League report card\nDefending Premier League champions Manchester City boast a perfect record ahead of the first international break, but are joined at the summit by old foes Liverpool.\nIt is a different story for other teams eager to be in the top-four mix with Manchester United, Chelsea and Tottenham all suffering early defeats, while none of the newly-promoted clubs have registered a first win of the campaign.\nHere, the PA news agency compiles an early report card on all 20 Premier League clubs.\nFlying colours\nOnly Liverpool and Man City have won three from three 👀 pic.twitter.com/2i16603r3W\n— Premier League (@premierleague) September 2, 2024\nMan City have started in ominous fashion, earning impressive away wins at Chelsea and West Ham in between a three-goal home victory over Ipswich, which were all achieved without Rodri.\nPep Guardiola could not have wished for a better start and this is also the case for Liverpool boss Arne Slot. Life as Jurgen Klopp’s replacement appears easy with a 3-0 win at Old Trafford an early statement to help them also sit on nine points out of nine.\nFabian Hurzeler has made a flying start at Brighton, earning a memorable triumph over Manchester United before they recorded a respectable draw at Arsenal. The 31-year-old has taken to English football like a duck to water, while Eddie Howe has put a difficult summer transfer window behind him to lead Newcastle to two wins and a draw.\nGood progress\nCoolness personified 👏 pic.twitter.com/IqSPMExJqy\n— Arsenal (@Arsenal) September 1, 2024\nArsenal may well have joined City and Liverpool on nine out of nine had Declan Rice not been sent off against Brighton. Mikel Arteta’s team have looked strong – like they did last term – and earned a fine away win at Aston Villa to reinforce their title credentials.\nVilla did have chances in their defeat to Arsenal and sit on six points after solid wins on the road at West Ham and Leicester to continue the feelgood factor under Unai Emery.\nBrentford, Bournemouth and Nottingham Forest are early surprises in the top-10 with Thomas Frank able to mastermind two wins despite speculation over Ivan Toney’s future. Andoni Iraola has also coped well after the departure of Dominic Solane, with Bournemouth still unbeaten and it is a similar story for Nuno Espirito Santo’s Forest, with five points accumulated so far.\nMore to come\nChelsea have produced a trademark mixed bag with an opening-day defeat to City followed by an emphatic display at Wolves, which was preceded by a frustrating draw with Crystal Palace. Enzo Maresca will have to continue to juggle off-field distractions if they are to qualify for the Champions League.\nTottenham have flattered to deceive with dominant displays at Leicester and Newcastle producing only one point on the road with the absence of Solanke proving costly. West Ham will also aim to kick on after a tough set of early fixtures under new manager Julen Lopetegui.\nFulham were active in the transfer window but only have four points to show for their efforts so far. There have been encouraging signs for Leicester and Ipswich despite still waiting for an elusive first win back in the Premier League.\nWork to do\n\"We have to be humble.\"\nErik speaks after our defeat to Liverpool.#MUFC || #MUNLIV\n— Manchester United (@ManUtd) September 1, 2024\nManchester United supporters could be forgiven for feeling it is groundhog day after Erik ten Hag watched his team lose to Liverpool on Sunday. It followed a last-minute defeat at Brighton, with familiar questions being asked and he must improve United’s performances to avoid further scrutiny over his future.\nIt has also been a disastrous time for Everton after they managed to throw away victory at home to Bournemouth to sit at the bottom with no points. Southampton are also pointless with Russell Martin braced for conjecture over his front-foot style of football, which has gained Saints plaudits but no tangible result so far.\nWolves and Crystal Palace lost key figures this summer, which has contributed towards an indifferent start with only a draw to show from their three games. Both Gary O’Neil and Oliver Glasner will be confident of improving now the transfer window is shut and they know what squad they will work with.",
  "word_count": 722,
  "scraped_at": "2026-02-14T02:20:44.350391",
  "_text_extracted": true
}