{
  "article_id": "c3b5c8d29e10",
  "url": "https://www.teamtalk.com/manchester-united/man-utds-de-ligt-transfer-provokes-angry-petition-signed-by-thousands-romano-update-ten-hag-purring",
  "title": "Man Utd transfers : De Ligt deal provokes angry petition signed by thousands as Romano update has Ten Hag purring",
  "date": "20240703T103000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd De Ligt transfer provokes angry petition signed by thousands as Romano update has Ten Hag purring\nThe planned transfer to take Matthijs De Ligt from Bayern Munich to Manchester United has provoked a furious reaction from supporters of Bayern Munich with a petition launched aimed at blocking the move, while a strong update from Fabrizio Romano on the prospective deal will be music to Erik ten Hag’s ears.\nThe Red Devils are looking to put in place the foundations for what they hope will be a much-more successful and consistent 2024/25 season after a somewhat tumultuous campaign last time out that saw them humiliated in the Champions League and also finish eighth in the Premier League – their all-time lowest finish in the competition. But by then overcoming Manchester City to win the FA Cup, Manchester United at least showed themselves capable of mixing it with the best and that Ten Hag could still deliver the club some silverware.\nAnd it was effectively that performance that kept the Dutchman in his job amid strong rumours he was facing the sack. Even then, United took some time to decide to stand by their man, though now appear to be planning for the long-term with him, with talks underway over an extension to his deal.\nDON’T MISS ➡️ Man Utd centre-back targets: Every option linked for a summer switch assessed\nTo that end, TEAMtalk understands an arrangement through to summer 2027 will soon be formally put on the table to the United manager.\nIn the meantime, much of the planning at United is around the summer transfer market. The club has already waved farewell to Anthony Martial and Raphael Varane at the end of their deals, saving the club a whopping £590,000 a week in wages. Further departures too could also add to the pot.\nMan Utd transfers: De Ligt move sees angry petition launched\nWith Varane departing after a largely indifferent three seasons at Old Trafford, United have quickly turned their focus on to the signing of a replacement.\nA move for Jarrad Branthwaite has already been rejected, with United’s initial offer worth £43m including add-ons somewhat short of Everton’s current £70m valuation.\nUnited could yet launch an improved bid but the polarisation of valuations means striking a deal looks unlikely at this point.\nAnd while a move for another option in Jean-Clair Todibo was blocked by UEFA over multi-club ownership rules, United have made serious strides towards a third option in De Ligt.\nTo that end, a strong report on Tuesday revealed United were thundering towards his signing – the first of the Dan Ashworth era – with the player having green lighted the move and with the fee for the Netherlands international well within United’s reach too.\nAnd while PSG remain keen on the 24-year-old, having tracked him themselves for a number of years, it is United who look very much on course to finalise a deal.\nHowever, despite falling down the pecking order at Bayern Munich, with Dayot Upamecano, Kim Min-jae and, more latterly, former Tottenham man Eric Dier, all seemingly ahead of him, not everyone associated with the Bundesliga giants is entirely happy at the prospect of seeing him leave.\nAnd a petition set up by furious Bayern fans angry at his would-be sale has been launched on change.org, which at the time of writing was close to reaching 13,000 signatures.\nBayern fans make their feelings clear on ‘horror’ De Ligt sale\nExpressing their anger at the prospective €60m (£50.8m) deal, Bayern Munich fans wrote: “We all want Matthijs de Ligt to stay at FC Bayern Munich.”\nA second, more detailed response stated: “He has proven that he‘s a world class defender, probably the best in our squad. There is a reason why he was elected as our best player in the 2022/23 season.\n“Furthermore he is only 24 years old and has a bright future ahead, which he is going to use to fulfil his huge potential. Despite his young age, Mattha is already very mature and has a great mentality which will definitely make him a leading figure in defence and probably a competitor for captaincy in some years.\n“His ability to speak English, German and Dutch fluently would help him a lot for that. With 19 years he already brought Ajax Amsterdam to the UCL semi-finals as captain.\n“Selling Matthijs de Ligt would be an absolutely horrible decision and we would definitely regret it. That‘s why we use our voice to call attention that we will NOT make this mistake!”\nDe Ligt himself admits he will carefully consider his future once the Netherlands’ Euro 2024 campaign comes to an end. They are through to the quarter-finals of the competition where they will face Turkey for a place in the semi-finals on Saturday.\n“I’ve already said this is not the time for me to think about it,” De Ligt said during a press conference.\n“We’re playing at the Euros now, and that’s very important for me and the national team. That’s why I can’t say now what I think about this situation. But what I can say is that I’ve now played my second season at Bayern – I’m very happy. For now, I’m focused on the Euros, and then we’ll see what happens.”\nFabrizio Romano drops major transfer update to delight Ten Hag\nWith De Ligt strongly favoured to join United this summer, trusted transfer reporter Romano has dropped another significant update on the potential deal.\nAnd with Ten Hag having worked with the defender while at Ajax, Romano strongly fancies a reunion to be on the cards at Old Trafford as he explained to CaughtOffside’s ‘the Debrief’ podcast.\n“Centre-back, for sure, is one of the priorities [for Manchester United], Romano began. “And so I think it’s the most imminent story for Manchester United. They want to bring in a new centre-back. Matthijs de Ligt is on the list for sure.\nGO DEEPER ➡️ Dan Ashworth: 10 worst signings amid doubts Man Utd director target is worth astonishing compensation fee\n“Man Utdalready, around Friday, Saturday, made contact with the agents of the player to understand also whether the player was keen to maybe leave Champions League football for the upcoming season, but accept Manchester United’s project.\n“What I’m hearing is that Matthijs De Ligt is absolutely keen on this possibility, also knowing when the manager does something important for him to accept Manchester United.\n“Matthijs de Ligt looks like the most likely signing for Manchester United in that position, rather than other players who can be too expensive.”\nDe Ligt is contracted to Bayern until 2027 and earns €15m a season, which equates to a hefty £244,000 a week.",
  "word_count": 1123,
  "scraped_at": "2026-02-14T02:25:54.617404",
  "_text_extracted": true
}