{
  "article_id": "c3e1e0b09711",
  "url": "https://metro.co.uk/2026/01/31/bukayo-saka-injury-update-arsenal-star-misses-leeds-win-warm-up-knock-26633985/",
  "title": "Bukayo Saka injury update as Arsenal star misses Leeds win after warm - up knock",
  "date": "20260131T190000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has provided an update on Bukayo Saka after the winger picked up an injury in the warm-up to Arsenal’s 4-0 win over Leeds United.\nSaka returned to the starting lineup after being rested in midweek, but was a late withdrawal at Elland Road after seemingly getting injured in the warm-up.\nThe winger headed down the tunnel with an Arsenal physio before kick-off, and was ultimately taken out of the matchday squad and replaced by Noni Madueke in the starting lineup.\nAsked for an update on Saka after the match, Arteta told Premier League Productions: ‘He had a little niggle and he wadn’t comfortable to start the game so we made a decision straight away.\n‘We’re going to have to do some tests tomorrow and see how he is.’\nWhile Saka’s injury was a blow, it was an otherwise perfect away day for the league leaders as they opened up a seven-point lead over Manchester City and Aston Villa, who both play tomorrow.\nMartin Zubimendi’s headed home from Madueke’s cross before to open the scoring, before Madueke saw another cross – this time from a corner – find it’s way into the Leeds net after a touch from Karl Darlow.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nViktor Gyokeres made it goals in back-to-back games when he poked home from Gabriel Martinelli’s cross before substitute Gabriel Jesus added Arsenal’s fourth late on.\n‘It was a really impressive performance to come here and win in the manner that we’ve done, it’s very, very difficult to do so big credit to the boys,’ Arteta said post-match.\n‘We needed that win I loved the way the team set up, the mindset that we had, the conviction that we had and how we have to navigate through different moments in the game.\n‘The starters, the finishers, they all made an impact and I’m really happy for that as well.’\nAfter only two points from their last three league games, a win of this magnitude came at the perfect time for Arsenal, and midfielder Declan Rice said his team must not let up to keep their distance from the chasing pack.\nMore Trending\n‘We can control what we can control and we have to keep winning games and keep pushing. What will be will be,’ he said.\n‘So far we are top in the Premier League and won eight out of eight in the Champions League. We can’t complain about where we are.\n‘We are in a really strong position, we know as players we have a really good squad.\n‘Every game is a cup final. We have a long four months ahead but we are prepared. Let’s keep going and give it a good go.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Estevao ruled out of Chelsea vs West Ham and returns to Brazil\nMORE: Man Utd star makes U-turn over transfer exit ahead of January deadline\nMORE: Leeds 0-4 Arsenal: Gunners respond in style to go seven points clear at Premier League summit",
  "word_count": 563,
  "scraped_at": "2026-02-14T01:59:36.851780",
  "_text_extracted": true
}