{
  "article_id": "c3e469e6541e",
  "url": "https://punchng.com/man-city-sign-midfielder-reijnders-in-time-for-club-world-cup/",
  "title": "Man City Transfer : Reijnders Joins for Club World Cup",
  "date": "20250611T093000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City on Wednesday announced the signing of Tijjani Reijnders from AC Milan for a reported fee of £46.3 million ($62.4 million), with the midfielder eligible to play in the Club World Cup.\nThe Dutch international midfielder, City’s fourth signing of the week, said he was “ecstatic” to be signing for Pep Guardiola’s side.\nThe club announced deals for midfielder Rayan Cherki from Lyon and Chelsea’s third-choice goalkeeper Marcus Bettinelli on Tuesday while left-back Rayan Ait-Nouri joined from Wolves on Monday.\nReijnders, 26, joined AC Milan from AZ Alkmaar in 2023 and scored 15 goals for the Italian club in 2024/25.\nHe will bolster Guardiola’s midfield options following the departure of Kevin De Bruyne.\n“I am ecstatic to be signing for Manchester City,” said Reijnders, who has penned a five-year deal.\n“City are one of the biggest teams in the world, with the best coach, world-class players and outstanding facilities.”\nAfter four consecutive Premier League titles, City finished a distant third last season and bowed out of the Champions League early.\nCity chairman Khaldoon Al Mubarak admitted the club “probably should have been more aggressive” in the transfer market ahead of the 2024/25 campaign.\nThe club’s latest transfer activity continues an overhaul of the squad that began with the January signings of Omar Marmoush, Nico Gonzalez, Abdukodir Khusanov and Vitor Reis.\nCity’s director of football Hugo Viana said: “We are very happy that Tijjani has joined us and we’re excited for him to join Pep’s squad.\n“He arrives here with extensive top-level experience in Europe, both at club level as well as on the international stage with the Netherlands.\n“Tijjani adds extra energy, composure and creativity to our midfield and working with Pep and our coaches will only see him go from strength to strength.”\nGuardiola’s men will travel to the expanded 32-team Club World Cup as defending champions after winning the competition under its previous guise in Saudi Arabia two years ago.\nThey open their campaign against Moroccan club Wydad Casablanca in Philadelphia on June 18.\nAFP",
  "word_count": 338,
  "scraped_at": "2026-02-14T01:58:41.945928",
  "_text_extracted": true
}