{
  "article_id": "c3e5775c8843",
  "url": "https://www.90min.com/posts/barcelona-08-09-vs-man-city-22-23-which-pep-guardiola-treble-team-was-better",
  "title": "Barcelona 08 / 09 vs Man City 22 / 23 - which Pep Guardiola treble team was better ? ",
  "date": "20230611T140000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona 08/09 vs Man City 22/23 - which Pep Guardiola treble team was better?\n\"I can't do anything else to top this.\"\nThat was Pep Guardiola's reaction to completing the European treble with Barcelona in 2009. Technically, Guardiola was correct. In Spain, it is impossible to win any more than all three major trophies - La Liga, Copa del Rey and the Champions League - in one season.\nHe may not have been able to top it, but Guardiola could strive to replicate that success. It took 14 years, two job changes and all of his hair, but the son of a humble bricklayer returned to those rarified heights with Manchester City in 2023.\nOnly eight other individuals have ever led their club to the European treble - Guardiola is the first to accomplish the rare feat twice. But which triptych of triumph was better?\nJourney to the treble\nWhile Guardiola's Barcelona side of 2008/09 boast a marginally inferior league record compared to his City vintage (collecting two fewer points), they delivered more emphatic results while claiming the first leg of their treble.\nThe Blaugrana not only routed struggling teams but stamped their authority over the division's elite, beating seven of the top eight clubs by at least a three-goal margin. Most impressively, Barcelona exerted their dominance on the road, infamously thumping Real Madrid 6-2 at the Santiago Bernabeu.\nConversely, Manchester City only registered one win against the Premier League's top nine away from home in 2022/23 - a 3-1 victory over Arsenal at the Emirates which could have easily swung either way.\nBoth Barcelona and City were slightly fortuitous in their respective Champions League finals. Sir Alex Ferguson maintains that his Manchester United side \"should have won that game\" in Rome against Barcelona in 2009 while City relied upon Ederson's brilliance (Romelu Lukaku's misfortune) in the showpiece against Inter 14 years later.\nHowever, City's route to the final was far more convincing than Barcelona's. Guardiola's latest iteration systematically dismantled RB Leipzig, Bayern Munich before producing one of the defining performances of the modern age, humiliating Real Madrid with a 4-0 thumping in the semi-final second leg.\nBarcelona, by comparison, only squeaked into the 2009 showpiece on away goals courtesy of a last-minute equaliser from Andres Iniesta in the semi-final against Chelsea. According to Didier Drogba, it was a 'disgrace'.\nTactics and style\nAfter ending his playing career in Europe, Guardiola lamented that the modern game had moved on.\n\"I think players like me have become extinct because the game has become more tactical and physical,\" he sighed in 2004. \"If I were a 20-year-old at Barcelona, I'd never make it.\"\nHowever, a handful of years later, Guardiola constructed Barcelona’s treble winners in his own image. All three midfielders - Andres Iniesta, Xavi Hernandez and Sergio Busquets - grew up idolising Guardiola from his playing days. The brand of positional play which he implemented as manager shifted the balance from brawn to brains. The use of Lionel Messi as a false nine towards the latter half of the season only increased Barcelona's stranglehold of midfield.\nHowever, there is the real possibility that Guardiola would not be able to slot into his treble-winning Manchester City team.\nWhen Barcelona lined up for the 2009 Champions League final against Manchester United, Guardiola only fielded one natural centre-back. Against Inter 14 years later, he sent out four from the first whistle.\nIn Guardiola’s never-ending quest to entirely eliminate the threat of counter-attacks, he came up with a new innovation; forming a 3-2 trapezoid as the foundation behind City’s fluid front five, with John Stones stepping into midfield alongside Rodri in front of a robust trio; Manuel Akanji, Ruben Dias and Nathan Ake.\nRodri is the closest thing to Guardiola in City’s team but he brings an extra layer of muscle and forward menace to an altogether sturdier side. Guardiola likes to joke about his feeble scoring record as a player, boasting 12 goals in 384 appearances for Barcelona. Rodri has found the net 13 times in the last three seasons, including the Champions League winner against Inter.\nKey players\nA 21-year-old Messi finished as Barcelona's top scorer in 2009 with 38 goals across all competitions despite starting from the right for much of the campaign. Samuel Eto'o (36) and Thierry Henry (24) completed the first-choice front three which combined for 100 goals that season.\nWhile all three of Barcelona's forwards broke the 25-goal barrier in 2008/09, Erling Haaland was the only Manchester City player to achieve that feat. Haaland finished his debut campaign under Guardiola with a sickening 52 goals in 53 games but Julian Alvarez was the only other City player to score more than 15.\nGuardiola was keen to stress that City have evolved to Haaland's game throughout the season but the Nordic power-forward finished the campaign in the midst of his longest goal drought (five games). Stepping up in his absence was the timeless figure of Ilkay Gundogan. City's out-of-contract skipper scored an unrivalled six goals from May onwards, including a pair of volleys to win the FA Cup final against Manchester United.\nBarcelona's captain Carles Puyol played in every position across the backline - starting the Champions League final at right-back - but was hampered by injury in the final months of the season, as was large swathes of the team's defence.\nNo player featured more than Xavi, Guardiola's most fervent disciple, during the treble campaign. The wily midfielder would captain Barcelona to another triplet in 2015 but was closer to his peak in 2009, laying on an unrivalled 31 assists across all competitions.\nConclusion\nBoth played incredible football and deserve to be part of the \"select group of mythical teams\" which Guardiola described in 2009. While Barcelona boasted more flair and freedom, they didn't break into the imperious march towards all three titles which propelled City.\nAnyway, neither side was as good as the 2010/11 Barcelona team that Guardiola created - even if they did lose the Copa del Rey to Jose Mourinho's Real Madrid.\nREAD MORE REACTION TO THE CHAMPIONS LEAGUE FINAL",
  "word_count": 1014,
  "scraped_at": "2026-02-14T01:53:41.887420",
  "_text_extracted": true
}