{
  "article_id": "c404a6046a2d",
  "url": "https://www.anglocelt.ie/2024/06/02/luke-shaw-has-good-chance-of-making-englands-euro-2024-squad-gareth-southgate/",
  "title": "Luke Shaw has good chance of making England Euro 2024 squad – Gareth Southgate",
  "date": "20240602T190000Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luke Shaw has good chance of making England’s Euro 2024 squad – Gareth Southgate\nBy Simon Peach, PA Chief Football Writer\nGareth Southgate says Luke Shaw has gone from a long shot to having a “good chance” of recovering from injury in time to make England’s Euro 2024 squad.\nThe 28-year-old has endured an injury-hit season with Manchester United and has been laid low with his latest muscle issue since mid-February.\nShaw was expected to return in early May only to suffer a setback, leaving the left-back in a race against time to make this summer’s European Championship squad.\nSouthgate included the Euro 2020 final goalscorer in his 33-man training group but admitted he was a “long shot” and somewhat of a “wild card”.\nShaw is set to miss both warm-up friendlies against Bosnia and Herzegovina and Iceland, but the England boss has been enthused by his progress.\n“He’s progressing very well, I have to say,” Southgate told talkSPORT.\n“I think I said last week that until we had the players in front of us working with us, there was a lot of information that we didn’t have.\n“We’re pleased with how he’s progressing. There’s still a bit to do before he can get on the pitch in a game situation.\n“But really pleased with the work he’s doing with our physical performance team and our medics, so, yeah, he’s in with a good chance.”\nShaw has been a key player for Southgate and is the only out-and-out left-back included in the expanded training squad.\nThe England boss has to cut that group down to 26 by Friday night, but the squad being expanded from 23 players gives him the chance to perhaps take a risk on the fitness of a player or two.\n“That’s the thing we have to work out because, of course, if he’s not ready for the first couple of games there’s a chance he could break down further down the line,” Southgate said.\n“You’ve got to make sure you’ve got enough cover in that situation as well, so there is a bit of a numbers game for us to play over the next few days.\n“OK, how many do we need in each position? We’ve got to cover ourselves.\n“Clearly he’s a specialist left-back that’s an incredibly high-level player as well, so you’re more likely to take a chance on a player that’s been a regular starter that we think can really add to the starting XI.\n“But there’s a knock-on, there’s an impact to all of those decisions and that’s why we’ve got to look at the full picture and not just each individual.”\nShaw’s progress is a boost for England, as is the news that Manchester United team-mate Harry Maguire is on track to make the Euros.\nThe experienced centre-back sustained a muscle issue of his own in training that ruled him out of the end of a victorious conclusion to a bumpy season at United.\n“Again, he’s progressing well,” Southgate said. “He won’t be involved tomorrow. Unlikely, I would say, for next Friday.\n“But, yeah, each couple of days that passes, we’ve got a little bit more information on how they’re progressing and how likely that is and the likely return date.”\nAnthony Gordon is another progressing well but he is set to miss Monday’s match at St James’ Park, where Bukayo Saka and John Stones will also be unavailable.\nNewcastle captain Kieran Trippier will skipper England instead of Harry Kane, who has recovered from a back issue.\n“Harry has trained all week,” he said of the Bayern Munich striker. “We feel we don’t need him to start the game tomorrow, but he can be involved in the game.”\nKobbie Mainoo, Kyle Walker and Phil Foden have yet to link up with the camp after last weekend’s FA Cup final, while Jude Bellingham will be another later arrival into camp.\nThe 20-year-old’s dream first season at Real Madrid continued on Saturday as they beat his former club Borussia Dortmund to win the Champions League.\n“He’s had a fantastic season,” Southgate said. “To join the biggest club in the world and perform the way he has throughout the season has been an incredible year for him. Absolutely delighted for him to win last night.”",
  "word_count": 711,
  "scraped_at": "2026-02-14T02:01:16.446945",
  "_text_extracted": true
}