{
  "article_id": "c41597aba688",
  "url": "https://www.cityam.com/nba-europe-open-to-sovereign-wealth-and-in-talks-with-family-offices/",
  "title": "NBA Europe open to sovereign wealth and in talks with family offices",
  "date": "20260118T133000Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NBA Europe open to sovereign wealth and in talks with family offices\nThe NBA is open to sovereign wealth funds buying franchises in its proposed European basketball league, says the US sports giant’s commissioner Adam Silver.\nSpeaking in London ahead of the NBA game on Sunday at the O2 and a presentation to potential commercial partners the following morning, Silver said the league and its advisors were in talks with prominent family offices, private equity firms, existing European teams and football clubs who do not yet have a basketball operation.\nAmong the latter group are the owners of Paris Saint-Germain, Qatar Sports Investments, whose Champions League-winning stewardship drew praise from Silver, his deputy Mark Tatum and the NBA’s managing director of EMEA George Aivazoglou.\nUS sports leagues have only recently relaxed rules prohibiting private equity and sovereign wealth investment but Europe – especially in football – has been more welcoming and Silver said the NBA had not ruled out any investors.\n“We haven’t made the final determinations yet about different sources of capital, types of investments,” he said.\n“I would say, with an opportunity to begin a league from scratch, we’re taking a fresh look. We can see, for example, on PSG, where there’s already been success of sovereign wealth funds who own and operate teams, and I think there’s different traditions that have grown up here.”\nFamily offices eye teams in NBA Europe\nSaudi Arabia has been rumoured to be interested in investing in a team in London, which, with Manchester, has been earmarked for a franchise in NBA Europe, a semi-open 16-team league slated to start next year.\nProminent US family offices, such as owned by Mark Walter, Stan Kroenke and the Glazer family, already own Premier League football teams – in their case, Chelsea, Arsenal and Manchester United respectively.\n“We’re talking to families that currently invest in sports, some who have not had the tradition of investing,” Silver added.\n“In addition to talking to sovereign wealth funds, there’s more traditional investment funds that have had some experience investing in sports, and then some more traditional private equity funds that see sports as an asset class.”\n2027 start ‘ambitious’ but ‘doable’\nEchoing comments made earlier this week in Berlin, Silver stressed that NBA Europe was a “once in forever” opportunity and would require patient investors who agree to reinvest any profits into growing European basketball.\nHe acknowledged that launching the league in late 2027 was an “ambitious” target but “doable” and said the NBA was “where we thought we would be at this point”.\nHe said NBA Europe would likely have a global streaming partner but that it would be shown on multiple broadcasters in order to maximise reach and engagement.\n“Optimising media values would be a blend of streaming parties – potentially a global one, as we have with Amazon Prime, who’s showing games in 200 countries – but partnered with local broadcasters,” he said.\n“I still think over-the-air television is critically important. Maybe it won’t be at some point, but it’s still how many people are watching our games and watching the coverage.”\nO2 likely venue for London NBA Europe team\nA London franchise would likely play at the O2, where the Memphis Grizzlies take on Orlando Magic tonight, with Aivazoglou talking up the venue’s suitability just weeks after the arena’s operators told City AM they would welcome the idea.\nBut elsewhere in Europe the NBA sees opportunity to build new state-of-the-art venues like those in the US, with basketball just the anchor tenant of a year-round entertainment complex.\n“There’s definitely arenas right now where we can see maybe the league starting but obviously, over time, the vision for arenas will be to transform the European arena ecosystem, inclusive of most of the arenas in the big European countries,” said Aivazoglou.\n“In the UK, the O2 is a great arena… and then Manchester has a brand new arena [Co-op Live]. In south Europe, I think there’s a lot of opportunity to design from scratch, and that’s a big part of our thesis.”",
  "word_count": 676,
  "scraped_at": "2026-02-14T02:09:43.003179",
  "_text_extracted": true
}