{
  "article_id": "c41e051c2bc3",
  "url": "https://www.teamtalk.com/liverpool/trent-alexander-arnold-two-key-contract-demands-new-liverpool-deal-real-madrid-instantly-tick-both-boxes",
  "title": "Trent Alexander - Arnold : Two key contract demands to Liverpool emerge as Real Madrid instantly tick both boxes",
  "date": "20240930T170000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nTrent Alexander-Arnold issues Liverpool with two key conditions over new deal; Real Madrid instantly tick both boxes\nLiverpool have been given renewed hope that Trent Alexander-Arnold will sign a new deal to remain at Anfield amid claims he wants the Reds to fulfil two demands first – while one observer has remarkably suggested the right-back should switch positions to truly be considered a global superstar.\nThe 25-year-old star is rightfully considered one of the most influential stars in the Liverpool side, having played a part in an incredible 102 goals (19 scored, 83 assists) in just 317 appearances for the club since making his debut in October 2016. Now regarded as one of, if not the best right-back in world football, Alexander-Arnold is rarely out of the headlines these days owing to a contract at Anfield that is due to expire in exactly nine months time.\nIndeed, Real Madrid have been strongly linked with his signature and will be eligible to open talks with him over signing a pre-contract agreement to move to the Bernabeu from January 1 – just 93 days from now.\nHowever, amid all the speculation suggesting he will be tempted by a lucrative free transfer move, we understand that Alexander-Arnold will give Liverpool – his hometown club and the team he very much still adores – priority when it comes to making a decision over his future.\nWhile any deal will also likely make the player the second-highest paid player in their history – behind only Mo Salah – a new report has outlined the two demands that the homegrown star has asked of Liverpool before putting pen to paper.\nAnd according to Football Insider, Alexander-Arnold wants Liverpool to give assurances to him that they can match his trophy ambitions and with regards to strengthening the side in the transfer market.\nWorryingly for the Reds, Real Madrid can instantly tick both those boxes, given their incredible record of six Champions League triumphs in the last 11 seasons and status as favourites to win the competition once again this time around. Having also brought in Kylian Mbappe as a free agent, their appeal to the game’s elite stars also remains as strong as ever.\nREAD MORE ➡️ Liverpool legend names ‘the big one’ they simply must keep as Van Dijk, Salah, Alexander-Arnold deals near end\nAlexander-Arnold: Reds legend reveals Real Madrid fears; player hints at stay\nWhile Alexander-Arnold has rightfully not declared anything publicly on his contract demands, the player has indicated his willingness to stay with some messages of hope towards supporters of late.\n“I have always said I want to captain the club. That is a goal of mine, whether that happens is out of my hands,” Alexander-Arnold told the media following last weekend’s win over Bournemouth.\n“I want to be a Liverpool player this season (as a minimum) is what I will say.”\nAsked about the conditions that could persuade him to sign a new deal, he added: “The most important thing is always trophies. I want to win trophies.\n“We were close to the title last season and we got a cup. The (quadruple) was on for a while I suppose.\n“This season we are looking really good, it is still early days, but we need a lot of consistency. It will be difficult but we are looking to win as many trophies as we can.”\nDespite that, our sources have confirmed that officials from Real Madrid are in ‘constant contact’ with his entourage and with the player’s financial interests handled by his father, Michael Arnold, himself a die-hard Liverpool supporter.\nFormer Liverpool hero Mark Lawrenson, meanwhile, has come clean on the two factors that will likely see Alexander-Arnold playing for the European giants next season.\n“I don’t think Trent will be at the club at the start of next season – I can see him being attracted to playing at Real Madrid. He has an England teammate in Jude Bellingham there and I can see him playing for them next season,” Lawrenson said.\n“If you really wanted to stay at Liverpool, then would you not have signed your contract by now?\n“…for me, Trent probably wants to go and play somewhere on the continent. I don’t think he’ll turn down the opportunity to play for Real Madrid.”\nReds urged to play Alexander-Arnold in new position / Sevilla star eyed as heir\nWhile operating in something of a hybrid midfield role in the latter months of Jurgen Klopp’s reign, Alexander-Arnold is now considered a right-back first and foremost but with a licence to roam forwards and support the attack as often as possible.\nHowever, pundit Robert Earnshaw reckons a permanent move to become a right-winger would be the best way to get the best from the player and transform him into a truly global superstar.\n“We have to get away from playing Trent Alexander-Arnold as a full-back, for me. In my opinion, the best thing about Trent Alexander-Arnold is everything is going forward,” Earnshaw began on Sky Sports. “I’d play him anywhere in midfield, anywhere, it doesn’t matter. If it’s (for) Liverpool, maybe I’d put him on the right-wing.\n“I saw Gareth Bale go from a fullback who was struggling, couldn’t defend, getting beaten, to this global superstar. He was slowly going up the pitch but he had all the ability in the world – very similar to Trent Alexander-Arnold. But slowly, he went forward, left-wing to attacking midfielder, and then ended up pretty much as a striker.\n“But it’s because everything about him was going forward, same thing with Trent Alexander-Arnold. He has to play in a higher position. Get rid of thinking about him as a defender, because he is a once in a generation type of player and he needs to be in a higher position doing the best things going forward.”\nElsewhere, Liverpool have been linked with a number of different players as a replacement for Alexander-Arnold were he to leave.\nAnd one option who has reportedly emerged on their shortlist is breakout LaLiga star, Juanlu Sanchez.\nThat comes after a report last week claimed Arne Slot had expressed his preference for the capture of Jeremie Frimpong as one of three top targets the Reds were looking at from Bayer Leverkusen.\nHow Alexander-Arnold’s wages have rocketed at Anfield",
  "word_count": 1054,
  "scraped_at": "2026-02-14T01:49:08.092200",
  "_text_extracted": true
}