{
  "article_id": "c4358330e98a",
  "url": "https://thepeoplesperson.com/2024/01/12/what-i-heard-jesse-marsch-reveals-what-ralf-rangnick-shockingly-told-him-about-man-united-274247/",
  "title": "  What I heard ...: Jesse Marsch reveals what Ralf Rangnick shockingly told him about Man United - Man United News And Transfer News",
  "date": "20240112T210000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Leeds United manager Jesse Marsch has revealed that Ralf Rangnick, who previously served as Manchester United’s interim manager, explained to him the full extent of the internal troubles and turmoil at Old Trafford.\nRangnick was appointed as temporary United boss in November 2021 after Ole Gunnar Solskjaer was sacked following a string of dismal performances and poor results.\nHowever, much like his predecessor, Rangnick struggled to make an impact at United.\nThe German coach won just 11 of the 31 matches he took charge of. Under his stewardship, the Red Devils only managed a sixth-place finish, with just 58 points – the lowest tally in the club’s history.\nDuring his brief spell in the United dugout, there were plenty of reports of dressing room unrest and player dissatisfaction with Rangnick’s tactics and training methods.\nThe 65-year-old however became kind of a cult hero with fans, who were impressed with how boldly he spoke and articulated the club’s issues in his press conferences.\nAfter United’s 4-0 loss at the hands of Liverpool in April 2022, Rangnick famously called for “cosmetic surgery” to be carried out on the 20-time English champions – a reference to the massive overhaul that was needed across the board.\nDue to his frequent public utterances, United elected not to honour the initial agreement that would have seen Rangnick ascend into an advisory role for the club. He instead moved on and took up the Austria national team job.\nIn his maiden season in England, Erik ten Hag succeeded to some extent in masking some of the concerns Rangnick raised. However, this term, it’s evident that the Dutchman is struggling. The Red Devils are having a nightmare campaign. They currently sit in eighth position in the Premier League and were already eliminated from both the Carabao Cup and the Champions League.\nMost of the issues pointed out by Rangnick are expected to be sorted out by INEOS and Sir Jim Ratcliffe, when his deal to complete a 25% partial investment into the club is ratified by the Premier League.\nMarsch, who worked as Rangnick’s assistant at RB Leipzig, laid bare the cultural problems his mentor endured at the Theatre of Dreams.\nHe told Simon Jordan’s Up Front show that Rangnick recounted to him first-hand, just how bad the situation is at United.\nMarsch said, “I think he knew he was going into the lion’s den but he couldn’t turn down the opportunity to coach Manchester United. This is a massive opportunity for anyone.”\n“He didn’t play classic Ralf Rangnick football, that was one thing I was a little bit surprised of. He felt early on that it wasn’t going to be easy with that group of players to play the kind of football that he wanted.”\nWhen Jordan suggested that standards at United had “deteriorated dramatically” since Sir Alex Ferguson retired, Marsch completely agreed with him.\nThe American added, “What I heard from Ralf and others that were there at the time is that the cohesion in the club was next to zero. That their communication with the scouting departments and the sporting departments and the directors and that made them feel there probably wasn’t much of a future for them there, which maybe that was the case.”\n“But again with any club and especially the best, this idea of the pressure from within for everyone to understand exactly what the identity is and the commitment to stay disciplined to do that every day is usually what dictates how good they can become.”\nHe finished off by saying, “From afar, and from what I’ve heard, that part has been lost at Man U.”\nSuch a revelation will hardly come as a surprise to most supporters, who have always been quick to call out the Glazers and their cronies’ incompetence.",
  "word_count": 632,
  "scraped_at": "2026-02-14T01:54:27.643190",
  "_text_extracted": true
}