{
  "article_id": "c478331733e5",
  "url": "https://www.globenewswire.com/news-release/2024/02/15/2829941/0/en/Women-s-International-Professional-Volleyball-Reaches-New-Heights.html",
  "title": "Women International Professional Volleyball Reaches New",
  "date": "20240215T133000Z",
  "domain": "globenewswire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "DUBLIN, Ireland and MILAN, Italy, Feb. 15, 2024 (GLOBE NEWSWIRE) -- Brera Holdings PLC (“Brera Holdings”, “Brera” or the “Company”) (Nasdaq: BREA), continues to drive forward women's volleyball as it reaches new heights across the globe. On August 30, 2023, more than 92,000 fans filled the University of Nebraska’s Memorial Stadium to watch the Cornhuskers’ women’s volleyball team play Omaha, setting a world record for attendance at any women’s sporting event in history. Just one month prior in July 2023, Brera, with its keen eye for value, secured a majority stake in UYBA Volley S.s.d.a.r.l., a vanguard Italian Serie A1 women's professional volleyball team, as unprecedented support from an array of prominent global investors has begun to pour into the sport.\nBrera’s strategic investment came at a crucial juncture for women's professional volleyball, a sport that's seeing an influx of high-profile endorsements and investments from luminaries such as Alpine skiing legend Lindsey Vonn, NBA superstars Kevin Durant and Jayson Tatum, WNBA superstar Candace Parker, Linda Henry of the Fenway Sports Group, acclaimed actress Amy Schumer, and tennis icon Billie Jean King. The three professional women's volleyball leagues in the United States have collectively attracted nearly $250 million in investments. Specifically, the Pro Volleyball Federation, League One Volleyball, and Athletes Unlimited have garnered $150 million, $60 million, and $30 million in funding, respectively. These investments are more than financial injections; they represent a seismic shift in the popularity, recognition and valuation of women's sports on a global scale.\n\"Women's professional volleyball is experiencing a boom in popularity, buoyed by the enthusiasm and backing of some of the most celebrated names in sports around the world,\" said Pierre Galoppi, CEO of Brera Holdings PLC. \"With the support of such iconic athletes and personalities, we didn’t just invest in a team; we're championing a global movement that showcases the power, talent, and potential of women in sports. Our majority ownership of and partnership with UYBA Volley aims to amplify this momentum, making a profound impact on the sport's visibility, viability, and vibrancy worldwide.\"\nLocated in the heart of Northern Italy’s Lombardy region, UYBA Volley has been a formidable competitor in the Italian Serie A1 league, since its promotion to the top tier in 2000. Under the prior guidance of celebrated coach Julio Velasco, who recently was called to lead the Italian national team, UYBA has won multiple titles, including the prestigious CEV Cup and the Italian National Championship.\nThe global ascendance of women's volleyball, driven by its soaring popularity and funding from big-name investors, signals a transformative era for the sport. These developments highlight the increasing commercial and cultural relevance of women's volleyball, setting the stage for enhanced investment and global interest in women's professional teams worldwide.\nBy capitalizing on this momentum, Brera Holdings and its majority-owned UYBA Volley subsidiary are poised to contribute significantly to the sport's global growth narrative, leveraging their partnership to elevate the profile of women's volleyball on the world stage. This endeavor is expected to enrich the sport's ecosystem, offering new opportunities for talent development, fan engagement, and international collaboration.\nFor more information on Brera Holdings and its latest venture with UYBA Volley, please visit Brera Holdings and UYBA Volley.\nABOUT BRERA HOLDINGS PLC\nBrera Holdings PLC (Nasdaq: BREA) is focused on expanding its social impact football (American soccer) business by developing a global portfolio of emerging football and other sports clubs with increased opportunities to earn tournament prizes, gain sponsorships, and provide other professional football- and sports-related consulting services.\nThe Company seeks to build on the legacy and brand of Brera FC, the first football club that was acquired by the Company in 2022. Brera FC, known as \"The Third Team of Milan,\" is an amateur football association which has been building an alternative football legacy since its founding in 2000. The Company owns the trademarked FENIX Trophy Tournament, a non-professional pan-European football competition recognized by UEFA, inaugurated in September 2021 and organized by Brera FC. \"FENIX\" is an acronym for \"Friendly European Non-professional Innovative Xenial.\" BBC Sport has called the FENIX Trophy \"the Champions League for amateurs,\" and Brera FC hosted the 2023 finals at Milan's legendary San Siro Stadium. In October 2022, the Internet Marketing Association at its IMPACT 22 Conference named Brera FC as its award recipient for \"Social Impact Through Soccer,\" recognizing the Company's focus at an international level with this distinction.\nIn March 2023, the Company expanded to Africa with the establishment of Brera Tchumene FC, a team then admitted to the Second Division League in Mozambique, a country of nearly 32 million people. Brera Tchumene FC won its post-season tournament and in November 2023 was promoted to Mocambola, the First Division in Mozambique. In April 2023, the Company acquired 90% of the European first division football team Fudbalski Klub Akademija Pandev in North Macedonia, a country with participation rights in two major Union of European Football Association (\"UEFA\") competitions.\nIn June 2023, Brera acquired a strategic stake in Manchester United PLC. In July 2023, the Company completed the acquisition of a majority ownership in the Italian Serie A1 women's professional volleyball team UYBA Volley S.s.d.a.r.l. In September 2023, the Company assumed control of Bayanzurkh Sporting Ilch FC, a team in the Mongolian National Premier League, which will become Brera Ilch FC when the football season resumes in March 2024. In January 2024, the Company announced the launch of a proactive search for an Italian Serie B football club target designed to bring multi-club ownership of the highest tiers of professional sports ownership to mass investors through the Company's Nasdaq-listed shares. The Company is focused on bottom-up value creation from undervalued sports clubs and talent, innovation-powered business growth, and socially-impactful outcomes. See www.breraholdings.com\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements that are subject to various risks and uncertainties. Such statements include statements regarding the Company's ability to grow its business and other statements that are not historical facts, including statements which may be accompanied by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\" \"hopes,\" \"potential\" or similar words. Actual results could differ materially from those described in these forward-looking statements due to a number of factors, including without limitation, the Company's ability to continue as a going concern, the popularity and/or competitive success of the Company's acquired football and other sports teams, the Company's ability to attract players and staff for acquired clubs, unsuccessful acquisitions or other strategic transactions, the possibility of a decline in the popularity of football or other sports, the Company's ability to expand its fanbase, sponsors and commercial partners, general economic conditions, and other risk factors detailed in the Company's filings with the SEC. The forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake any responsibility to update such forward-looking statements except in accordance with applicable law.\nCONTACT INFORMATION:\nFOR MEDIA AND INVESTOR RELATIONS\nPierre Galoppi, Chief Executive Officer, Brera Holdings PLC\nEmail: pierre@breraholdings.com\nGiuseppe Pirola, Chairman, UYBA Volley S.s.d.a.r.l.\nEmail: Giuseppe.pirola@volleybusto.com\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/341ff498-7c4d-4e30-bcd4-789e45c1e8ff",
  "word_count": 1186,
  "scraped_at": "2026-02-14T02:10:42.024575",
  "_text_extracted": true
}