{
  "article_id": "c49a937e9588",
  "url": "https://www.uefa.com/returntoplay/news/0282-182f27b6aaa5-2575480747b8-1000--regions-cup-amateurs-time-to-shine/",
  "title": "UEFA Region Cup : the amateur time to shine | Inside UEFA",
  "date": "20230605T190000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA Regions' Cup: the amateurs' time to shine\nMonday, June 5, 2023\nArticle summary\nSince its inception in 1999, the Regions’ Cup has showcased the dedication and talent of grassroots players from across Europe.\nArticle top media content\nArticle body\nThe UEFA Regions’ Cup is the pinnacle of European amateur football and returns this year for the first time since 2019, its place and value in the football calendar in no way diminished by its four-year absence due to the COVID-19 pandemic. A unique amateur competition, the Regions’ Cup has produced nine different winners in its first 11 editions, Polish side Dolnośląski – who have qualified again in 2023 – claiming their second title in 2019, 12 years after their first.\nPlayers from all walks of life\n\"A tournament like this shows that UEFA recognises amateur footballers, and the level of the Regions’ Cup confirms that football’s governing bodies also appreciate such players,\" says Dolnośląski captain Paweł Słonecki. \"I personally feel that the way we are treated is a reward for our approach to football, commitment and every minute spent on the pitch.\"\nThis is a competition for players who have never featured at any professional level in the football pyramid. Słonecki is an insurance agent, Bavaria captain Sebastian Brey runs his own watch and jewellery business, and Galicia skipper Aarón Rama is a civil engineer, but like every player at this tournament, they come together in a celebration of the sport and to compete at their highest possible level.\nThe Regions’ Cup is contested by the winners of national amateur tournaments, with the smallest countries fielding national amateur teams. It is a showcase for the wealth of talent that exists under the radar in European football and in its 24-year history, more than 6,500 players have appeared in the competition – 595 of them in the current edition.\nBack to action\nUntil the hiatus forced by the COVID-19 pandemic, the tournament had been held every two years, with the hosts drawn from one of the eight qualified teams. Home advantage can make all the difference; five editions have been won by the hosts. So far Italian sides hold the edge with three titles, but holders Dolnośląski are looking to match that feat for Poland and in the process become the first team to lift the trophy three times, previously under the name of Lower Silesia.\nUEFA Regions' Cup: previous winners\n2020/21: edition cancelled\n2018/19: Dolnośląski (POL)\n2016/17: Zagreb (CRO)\n2014/15: Eastern Region (IRL)*\n2012/13: Veneto (ITA)*\n2010/11: Braga (POR)*\n2008/09: Castilla y León (ESP)\n2006/07: Dolnośląski (POL)\n2004/05: Basque Country (ESP)\n2002/03: C. R. Piemonte Valle d'Aosta (ITA)\n2000/01: Moravia (CZE)*\n1999: Veneto (ITA)*\n*winners as hosts\n\"UEFA have got to be congratulated for introducing a tournament like this,\" says Jim Boyce, who as the chairman of the UEFA Youth and Amateur Football Committee attended the first nine editions of the tournament before his retirement. \"This is the Champions League for amateur players. These are lads who play at the weekend and play mainly for fun, but they have an opportunity to play in a European competition, come to new countries and make new friends.\"\nThe record books\nSince 1999 when Veneto claimed the first title on home soil, 27 different nations have produced final tournament contenders. Galicia's debut qualification means that Spain have had a team in a record nine of the 12 final tournaments, while seven distinct Czech regions have been represented at that stage.\nRepublic of Ireland sides are also mainstays, and in this season's intermediate round their captain and goalkeeper Brendan O'Connell equalled the record of 28 overall competition appearances of long-time team-mate Ken Hoey. O'Connell is also within two of Cork postman Hoey's outright finals mark of 15.\nHoey captained Ireland's Eastern Region to victory in 2015 with O’Connell in the team and the pair have appeared in the final a record three times (they were both runners-up in 2011 and 2017). Zoltán Varga’s six goals for Hungary’s Szabolcs Gabona Csoport in 2003 remains a finals record, while Zagreb’s Željko Štulec hit 18 goals overall – twice as many as any other player.\nThose individual achievements stand tall, although the Regions’ Cup has always been about more than just the results for the teams or players. \"Many friendships have been made here and for me that’s what football is all about,\" Boyce explains. \"I know that all the teams go back home with many happy memories of the Regions’ Cup. I hope it makes them better players and better people, and I hope it will continue for years to come.\"\nGraduating with honours\nA number of Regions’ Cup alumni have gone on to make a splash in the professional game; one of the recent graduates being Croatian international Josip Juranović, who made six appearances for Celtic in the Champions League group stage in 2022/23. The right-back joined Union Berlin in January before going on to appear four times in the Europa League knockout phase. He played three times for Zagreb Region in the 2014/15 Regions’ Cup qualifying, and since turning professional, has won leagues titles in Poland with Legia Warszawa and Scotland with Celtic, also being a key part of the Croatia side that finished third at the 2022 World Cup.",
  "word_count": 877,
  "scraped_at": "2026-02-14T02:09:58.136621",
  "_text_extracted": true
}