{
  "article_id": "c5067be9ef08",
  "url": "https://www.planetf1.com/news/sprint-format-success-or-failure-planetf1/",
  "title": "Sprint format , success or failure ? PlanetF1 . com writers have their say",
  "date": "20230501T191500Z",
  "domain": "planetf1.com",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sprint format, success or failure? PlanetF1.com’s writers have their say\nF1 rolled out its tweaked Sprint format for the Azerbaijan Grand Prix, so how was the reception in the PlanetF1.com towers? We have our say…\nAfter struggling with ways to enliven the Sprint Qualifying format over the past two years with limited success, the Azerbaijan Grand Prix saw the roll-out of a new format to make the Sprint a completely standalone event in the GP weekend.\nPractice was a one-hour session on Friday morning, before the GP Qualifying on Friday afternoon – the Sprint having no effect on the starting grid for Sunday’s race.\nWith Saturday’s action self-contained from the Grand Prix-relevant qualifying on Friday, PlanetF1.com looks back over the weekend and weights up whether it’s a yay or a nay!\nMichelle Foster\nI’m not a fan of gimmicks. If you need a gimmick to grab attention than your product is defective – or you have Red Bull on the grid.\nSadly in today’s F1, despite the powers-that-hope introducing a budget cap and changing the regulations, Red Bull have cruised to an advantage that is not likely to be erased this season, some fear not even next year, so gimmicks are needed.\nEnter Sprint races, although more to the point in Baku, sprint days. It was surprisingly better than expected, and yet still not quite there. If you’re going to dance with the devil, tango!\nThe Sprint Shootout was significantly better than an FP2 hour of cars going round and round the track. It yielded a bit of drama in a crash for Logan Sargeant but at the end of it all it was still the same cars inside the top ten, the other Williams of Alex Albon the exception to that.\nThe race also didn’t offer the excitement Formula 1 bosses had hoped from a standalone event because even if a crash wouldn’t have consequences for the grand prix grid, it would still come with financial implications and therefore had to be avoided at all costs.\nNo Hail Mary passes were thrown although Max Verstappen may have a different opinion on that.\nIt was a step in the right direction, but wasn’t a big enough step.\nIf Formula 1 wants to go down the Sprint day route the sport needs to hold up its hand, shout from the mountain top, write in the sky and die on that sword of artificial entertainment.\nGive us qualifying with the top ten in the standings on the hard tyres to the other 10 drivers’ softs, one flying lap for each driver, give us 25 points for the race winner or even a reverse grid. Give us something more than just a shortened version of qualifying and the race.\nIf you want to create drama than create it, because otherwise Sprint day will quickly lose its appeal for the masses.\nThomas Maher\nI barely know where to start with my list of criticisms of the new Sprint format, such is my displeasure at how the sport constantly looks for ways to cheapen its main draw.\nBut start I shall, and I’ll start with the fact that F1 has created a two-race weekend with the Sprint essentially becoming a movie trailer that gives away all the good jokes. Saturday’s Sprint race showed that, over a longer distance, Red Bull were simply faster – thus completely negating the excitement of what might come in the Grand Prix itself.\nWhile a Sprint and a Feature race works well in Formula 2, it’s important to remember the junior category is a spec series and that the point is for the drivers to get plenty of practice in at wheel-to-wheel combat before making it into the premier class. We don’t need to give the F1 drivers that training (at least, we should hope not!).\nThe near-complete removal of the dirtiest word in F1, ‘practice’, is resulting in less-than-optimally set up cars and the parc ferme rules are stopping the teams from fixing those errors – just look at how Carlos Sainz was a complete non-entity due to getting stuck with a bad setup, and the drivers choosing pitlane starts. To a lesser extent, Verstappen was also unhappy with his RB19’s setup after having no chance to hone it in.\nF1 is supposed to be as much an engineering series as it is about the drivers. The Sprint format demands that these multi-million-pound marvels of science are created, only for the sporting rules to prevent them from being run as optimally as possible – where’s the fun in seeing hamstrung drivers and cars that we know are not being run to the very best of their ability?\nAs a fan of F1 for 25 years, I found myself simply not caring about what happened on Friday and Saturday. I may have had to write about it, but I didn’t care. Unheard of! It wasn’t until Sunday that the blood began to pump as normal.\nAnd, no, I’m not in favour of simply ‘learning’ from these shortcomings and evolving the format further. No silly, convoluted rules to open up parc ferme, change the points system more to give the Sprint more importance or to evaluate reverse grids, or any of that nonsense. Football isn’t hosting a 15-minute kickabout separate game for minor points before the Champions League Final, are they?\nIt’s time F1 had confidence in its own product rather than trying to create artificial excitement at every turn. The popularity of the sport grew exponentially without this mindset, so why has the response been to change the DNA of a weekend slowly ramping up to the big race?\nPut it back, please. Just put it back to Practice-Qualifying-Race, and give a Grand Prix weekend back its sanctity.\nOliver Harden\nIn an ideal world F1 would stop this nonsense right here, right now.\nBut the tweaks to the format and even the presentation of the sprint for Baku – anyone else notice a remix of the F1 theme playing just before the start of Saturday’s race? – reveal a clear determination to make it work.\nIf the new version of the sprint in Azerbaijan was meant to be the answer, however, the sport is asking the wrong question.\nThere was nothing to like about it whatsoever, from qualifying being held early on Friday afternoon when thousands of fans were otherwise engaged – it’s only live once, after all, as one broadcaster likes to remind us – to the standalone sprint day, rendering Saturday running a total irrelevance for the first time in F1 history.\nThe attempt to package a shortened qualifying session and race as an attempt to be bold lies at the heart of the problem.\nIf the sprint is ever going to justify its existence, especially now the outcome of the race has no impact on the grand prix itself, it has to offer something out of the ordinary.\nRather than delivering “three days of competitive action”, as the Baku weekend was billed, maybe a less-is-more mantra is required.\nCould a short practice session on Saturday morning, for instance, be followed by a sprint race with a starting grid arranged in reverse Championship order, with the outcome of that setting the grid for Sunday’s grand prix?\nThat might have statisticians recoiling in horror, but at least it would be more watchable. And infinitely more exciting.\nThe sprint cannot continue in its current form.\nThe time has come to go hard or, in the words of Max Verstappen, “just scrap the whole thing”.\nPlanetF1.com recommends\nAzerbaijan GP conclusions: Perez statement, Verstappen struggles, Leclerc future\nAzerbaijan GP driver ratings: Street king Sergio Perez and record low for Nyck de Vries\nJamie Woodhouse\nI am going to go against the grain here and say that actually, this version of the sprint weekend felt like an improvement on the old format.\nTo shine a rare positive light into this very dark tunnel, while there was a feeling of ‘we have already done this on Friday’ by the time that diet version of Q1, Q2 and Q3 took place on Saturday to set the sprint grid, the counter to that is well, is FP1, FP2 and FP3 not just an even bulkier example of repetitive F1 sessions?\nAt least with effectively one-and-a-half times the usual amount of qualifying, it gives that sense that something is on the line.\nAnd as for the sprint itself, it did serve to make the title battle more interesting in the grand scheme of things, Sergio Perez now only six points behind Championship leader and team-mate Verstappen after the sprint and Grand Prix double, instead of eight as it would have been without the sprint.\nSmall margins for sure, especially at this stage, but hopefully Perez can ensure that these little points swings matter come the end of the campaign by keeping up the fight against Verstappen.\nHowever, I still feel like the sprint format in Formula 1 in general is flawed right now, as the series sadly cannot produce the kind of variety needed in order to make the sprint feel anything other than a spoiler for the Grand Prix.\nMany expected that Charles Leclerc’s sprint pole would only deny the inevitable of Red Bull coming through in race conditions, and that is what happened. Okay, he kept Verstappen at bay, but it was quite clear that the huge hole in that Red Bull sidepod after the earlier collision with Russell played a major role.\nSo, with Leclerc on pole again for the Grand Prix, that determined on Friday which did admittedly feel a little odd, we already knew the scenario which would play out. Perez and Verstappen kept their noses clean, and so to the surprise of nobody, Leclerc could do nothing to stop another comfortable Red Bull one-two.\nWithout artificially altering the pecking order between the sprint and Grand Prix, it feels like the sprint simply lets the cat out of the bag for the latter, which then suddenly feels far less worth tuning in for.",
  "word_count": 1671,
  "scraped_at": "2026-02-14T02:12:37.693812",
  "_text_extracted": true
}