{
  "article_id": "c508aa8a3c32",
  "url": "https://www.managingmadrid.com/2023/10/2/23900057/ancelotti-press-conference-champions-league-napoli-real-madrid",
  "title": "Ancelotti :  We have seven midfielders and I can only pick four , youd also criticise me if I picked five  ",
  "date": "20231002T220000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ahead of Napoli vs Real Madrid, Carlo Ancelotti appeared in a press room he knows very well, that of the Stadio San Paolo. Analysing Tuesday’s game, he said: “We’re facing one of the best teams in Italy, one that was champion last year and that has kept a lot of the core together. They have great players and the fans will push the team on a lot. We’ll need to be very professional and we’ll try to do as well as we did against Girona. I think we can take some of the good from the Girona game and use it here. For us, defending well is always important. If we keep a clean sheet, we’re much closer to winning than to losing.”\nAncelotti: “We have seven midfielders and I can only pick four, you’d also criticise me if I picked five”\nThe coach previewed the Napoli game.\nAncelotti on returning to Napoli\nDiscussing his return to Napoli and his departure from the Italian club, he said: “This is our most difficult game in this group stage. I had a positive time in this beautiful city, some moments better than others. I don’t think it makes too much sense to look back on the past. In the end, me leaving was the best decision for me and for Napoli, because they achieved what they did and I eventually returned to the best club in the world.”\nAncelotti on leaving Modrić out\nWith Luka Modrić not having played a single minute against Las Palmas or Girona, Ancelotti was asked about this. He analysed the Croatian’s situation and the competition in midfield in general stating: “He played the first Champions League game and the derby. He didn’t play the last two games, true, but the competition is very high. We don’t have a problem with him and he doesn’t have a problem with us. Sometimes I have to make tough decisions. He didn’t play the last two games for a technical reason, but tomorrow he might play. I’ll always have to leave out a top midfielder, so then there’d be a question about a midfielder every press conference. We have seven midfielders and I can only pick four of them. If I selected five you’d also criticize me.”\nAncelotti on Camavinga at left-back\nOn the subject of Camavinga’s best position and his minutes at left-back, the coach said: “Playing him at left-back is an option. He is a complete player and can play in various different positions. I know he’s content with playing there too because if you ask him if he’d rather left-back or the bench then he’d say left-back. He won’t play at left-back regularly because we have two left-backs who we have confidence in. Fran García did well to start the season and Mendy has recovered now. The left-back position is well-covered, and that includes Camavinga.”\nAncelotti on Bellingham’s status in world football\nWhen Jude Bellingham was brought up, Ancelotti was asked if he thinks he’s already the best in the world. He didn’t give a clear answer and simply said: “I think Bellingham has adapted very well to his new team. He’s doing very well and is showing all of his quality. If someone thinks he’s the best in the world then great. I think we have the best team in the world.”\nAncelotti on Nacho’s tackle on Portu\nAsked again about Nacho’s nasty tackle on Portu, the coach stuck with what he’d said on Saturday. Ancelotti replied: “He has already said sorry and I think the apology has been accepted by the player. So, I think this issue is closed.”\nAncelotti on picking between Rodrygo and Joselu\nThe coach was asked if he knows who to pick out of Rodrygo and Joselu for Tuesday’s game. To that, he replied with a simple “yes”.",
  "word_count": 636,
  "scraped_at": "2026-02-14T02:25:00.757943",
  "_text_extracted": true
}