{
  "article_id": "c52654cdac2c",
  "url": "https://www.france24.com/en/live-news/20231226-chelsea-so-far-away-from-target-pochettino",
  "title": "Chelsea  so far away from target  ",
  "date": "20231226T221500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea 'so far away from target' - Pochettino\nLondon (AFP) – Mauricio Pochettino has accepted Chelsea are failing to meet pre-season expectations after falling off the pace in the race for the Premier League title.\nIssued on:\nThe Blues' home form has been solid enough, with three successive wins in December ahead of Wednesday's match against London rivals Crystal Palace at Stamford Bridge.\nBut Chelsea's results on the road have been a different story, with defeat against Wolves at Molineux on Christmas Eve their fourth straight away loss on the spin following reverses at Newcastle, Manchester United and Everton.\nChelsea now find themselves in mid-table and struggling to qualify for the Champions League, although an English League Cup semi-final against second-tier Middlesbrough in January offers a route to a possible place in the Europa Conference League.\nNevertheless, Chelsea are currently 14 points adrift of the top four -- a position that was not on Pochettino's agenda for his first season in charge of the club.\n\"We're so far away (from the target),\" he said Tuesday. \"Our target was to be on the top, even if no one believed us. But in the circumstance, we are fighting for different things.\n\"We are Chelsea, because our history demands us to be at the top. At the moment, being realistic, we need to increase the way that we compete if we want to win more games.\n\"We need to compete better than (against Wolves). I think the performance from the beginning of the season has not been bad. We can say it's very good. But in terms of competing, we are in the bottom. That's why we are not in a better position in the table.\"\nHe added: \"In football you need to have the knowledge, the quality, the set-up. But at some point in football in 90 minutes, you need to compete. You need to show in the way you play football. We need to improve there, and that's about having all the players (fit), spending time with them together.\n\"We need to finish well, winning the (Palace) game, then to go to Luton (on December 30) and then start the new year with different feelings.\"\nMoises Caicedo is set to return after illness prevented him travelling to Wolves, although Lesley Ugochukwu is still struggling with a hamstring problem that forced him off on Sunday to add to Chelsea's injury problems.\n\"The frustration is there, the disappointment,\" said Pochettino. \"The medical staff are working so hard to anticipate and try to avoid these types of problems.\"\n© 2023 AFP",
  "word_count": 427,
  "scraped_at": "2026-02-14T02:07:27.041690",
  "_text_extracted": true
}