{
  "article_id": "c546551f4b7d",
  "url": "https://news.sky.com/story/money-latest-inflation-to-rise-on-wednesday-experts-say-heres-why-and-what-it-could-mean-for-interest-rates-if-theyre-right-13040934",
  "title": "Money latest : Inflation to rise on Wednesday , experts say - here why and what it could mean for interest rates ( if theyre right ) ",
  "date": "20240213T203000Z",
  "domain": "news.sky.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Amazon rolls out new payment method - but consumer expert says you should think twice | Money blog\nA new way of paying for orders on Amazon may seem convenient, but one consumer expert warns it may not be worth the potential headache later down the line. Read that and all the upcoming consumer and personal finance news in today's Money blog - and leave your comments in the box.\nFriday 13 February 2026 18:48, UK\nToday\n- Think twice before using Amazon's new payment method\n- Savers missing out on hundreds\n- 1.4 million NHS workers to get pay rise\nBest of Money blog\nAsk a question or make a comment\nBigger amounts of pension savings are being converted into a guaranteed fixed income for retirement, known as a pension annuity, new research has found.\nThe Association of British Insurers (ABI) said the average amount for an annuity had passed £80,000 for the first time.\nThis is despite a slight fall in the number being sold.\nThe trend reflects people's desire to secure an income for life.\nWhat is an annuity?\nAnnuities give people certainty over the amount of money they will have to live on when they retire.\nThe product is sold by insurance companies to those aged 55 and over and can be fixed-term or lifetime.\nPayments are made either annually, biannually, quarterly or monthly, and how much you receive depends on the size of your pension savings, the features of your particular annuity and your health and lifestyle.\nWhat did the research find?\nThe total value of premiums paid into individual pension annuities grew by 4% annually to reach £7.4bn last year, the highest level since new pension freedoms were introduced in 2014, the ABI said.\nSales of annuities worth over £250,000 rose by 31% annually, while sales of annuities valued at over £500,000 also rose by 54%, it said.\nAlongside this, there was an 8% annual rise in people aged 70 and over buying an annuity.\nThe ABI said it had seen a growth in escalating annuities - products that increase payments each year - suggesting more customers are looking for protection against the erosion of income over time, including through inflation-linked options.\nWhat do the experts say?\nRob Yuille, head of long-term savings at the ABI, said: \"A striking feature of this year's data is the increase in the size of pots being annuitised, paired with people choosing to secure a regular income at older ages.\n\"It's always been a good idea to 'flex then fix', using savings flexibly in early retirement, then locking in a guaranteed income at higher rates when certainty matters most.\n\"Now, with pensions coming in scope of inheritance tax from April 2027, choosing an annuity means a guaranteed income for life, with the option of providing for loved ones without worrying about potentially penal tax impacts.\"\nSir Steve Webb, a former pensions minister who is now a partner at pension consultants LCP, said annuities were enjoying a \"renaissance\":\n\"The bounce back of annuity rates from the rock bottom levels seen in the 2010s has brought annuities back into favour, and the more recent decision to include pensions in the IHT (inheritance tax) net from April 2027 has added further impetus.\n\"Some savers are no doubt planning to combine a large annuity income with other retirement income to generate 'surplus' cash which they can gift on a regular basis to their heirs.\"\nSantander is the latest lender to offer mortgages with a deposit of less than 5%.\nFirst-time buyers can land a home with a 2% deposit under the \"My First Mortgage\" scheme, which is available at 5.19% fixed for five years with £250 cashback.\nBut the new deal has strict eligibility criteria on deposit size and the type of property you can buy.\nWho qualifies for the mortgage?\nIt's available to first-time buyers, but not anyone who is self-employed or living in Northern Ireland.\nIn order to qualify, you'll need at least £10,000 saved for your deposit and must borrow between £190,001 and £500,000.\nThe scheme is also only available for those buying existing houses.\nFirst-time buyers purchasing flats or new builds can only borrow up to 95% loan-to-value with Santander, as Which? explains.\nHere's a look at how the deal compares with other five-year-fixed-rate mortgages...\nSkipton Building Society offers the lowest rate at 5.09%, but, as Which? notes, Santander's deal is competitively priced.\n\"This is an important addition from a major lender, adding to the growing ranks of mortgages designed to ease the struggles of first-time buyers,\" David Hollingworth of London and Country told Which?\n\"These products do carry eligibility requirements, so won't fit everyone's requirements - and a bigger deposit will still offer a wider choice with lower rates.\n\"However, the new Santander deal should help more people to access homeownership sooner than they may have thought possible.\"\nMorrisons is bringing paper coupons back to its stores.\nUsually, members of the supermarket chain's loyalty programme - Morrisons More - receive promotional offers on an app linked to digital accounts.\nThese also allow them to collect and redeem discount points.\nBut the supermarket will use real-time engagement tech to give members \"personalised promotional offers delivered on paper\" with their bills at the checkouts.\nMoney understands Morrisons could even start sending those paper coupons directly to customers' postboxes.\nThe supermarket's chief commercial officer Matt McLellan says the goal is to \"build deeper connections with shoppers by providing more relevant, timely offers that enhance their experience and reward their loyalty\".\nA railcard is a discount card that allows you to save money on the price of eligible train tickets.\nThe cards are available for either one year or three years. Most people will be eligible for at least one type of card, depending on factors such as your age and who you normally travel with.\nHere's a list of the different cards you can get, what they cost, what they offer, and who is eligible...\n16-17 Saver Railcard\nThis card costs £35 a year and comes with 50% off fares.\nThe 16-17 Saver can be purchased by all 16 and 17-year-olds regardless of nationality. It's valid for one year or until your 18th birthday, whichever comes first.\nIt cannot be used for ScotRail, Eurostar or Caledonian Sleeper services, or with certain Oyster tickets and Travelcards for travel in London. So do check the details and how they apply to you.\n16-25 Railcard\nThis card costs £35 for a single year, or £80 for three years.\nIt offers a third off adult fares and is for those under 26 or full-time students of any age (but mature students only qualify for the one-year card).\nFor travel between 4.30am and 10am Monday to Friday, you'll need to buy a ticket costing at least £12 to use your railcard and get the discount.\nCheck all the conditions here.\n26-30 Railcard\nThis card costs £35 for one year and offers a third off adult fares.\nYou can buy a 26-30 Railcard any time before your 31st birthday and keep using it for a whole year, until its expiry date (sadly, a three-year card isn't available).\nAs above, and with many of the other railcards on this list, you'll need to spend at least £12 to use your discount on journeys between 4.30am and 10am, Monday to Friday.\nFor all the conditions, and to see if you're eligible, check the details here.\nDisabled Person's Railcard\nThis card costs £20 for one year, or £54 for three years and offers you and an adult companion a third off.\nYou will qualify if you receive disability-related benefits and/or have certain disabilities. Click here for more information on eligibility.\nYour companion doesn't need to be a carer to qualify.\nFamily & Friends Railcard\nThis card costs £35 for one year, or £80 for three years.\nIt offers a third off for adults and 60% for children on most rail fares.\nUp to four adults (aged 16+) are eligible when travelling with up to four children (aged five-15).\nTwo adults can be named on the card, but they don't need to travel together to use it. You do need to be travelling with at least one child.\nThere are some restrictions on its use. For example, it cannot be used on weekday mornings at peak time between London and the South East area stations - click here for all the details.\nHM Forces Railcard\nThis card costs £21 for one year and offers a third off for adults and 60% off for a maximum of four children on most rail fares.\nAll members of regular forces and volunteer reserve, as well as non-regular permanent staff, are eligible. Click here to see the full list of those who can get this card.\nYou can use the discount on all journeys, but you will require a minimum £12 fare for journeys 4.30am to 10am, Monday to Friday (except July, August and public holidays).\nThe card is issued directly to HM Forces Personnel by their corresponding Ministry of Defence service unit to whom all enquiries should be made.\nNetwork Railcard\nThis card costs £35 for one year and offers a third off most adult fares and 60% off child fares in the London and the South East area - which might be bigger than you think.\nWith this railcard, you can take up to three adults with you, and they also get up to a third off their fare.\nYou can also take up to four children aged five to 15 with you, and get 60% off their tickets too.\nIt is not valid before 10am on weekdays, except for some services.\nThere is a £13 minimum fare per adult, Monday to Friday, and a £1 minimum fare per child aged five to 15 at all times.\nSenior Railcard\nThis railcard for those aged 60 and over costs £35 for one year, or £80 for three years, though some local councils offer this slightly cheaper.\nLike most of the other cards here, it offers users a third off adult fares.\nIt is not valid on weekday mornings, peak time, between London and stations in the South East - click here for all the details.\nTwo Together Railcard\nThis third off railcard is for two named people aged 16+ travelling together. It costs £35 for one year.\nIt's intended to help people save with the person they travel with most - be that a couple, friend or colleague.\nIt is not valid from 4.30am to 9.30am on weekdays, and both named people must purchase tickets together and start and finish their journeys together - so there's no using it alone.\nClick here for all the details.\nVeterans Railcard\nThis costs £35 for one year or £80 for three years.\nIt offers users a third off adult fares and 60% off for up to four children on most rail fares.\nThose who served one day or more in HM Armed Forces (regular or reserve) are eligible. It is also available to merchant mariners who have served on legally defined military operations.\nCheck the eligibility criteria and who else can benefit.\nHow do I apply for a Railcard?\nYou can apply online with National Rail for a digital or physical card.\nYou can also buy them in person at a staffed station ticket office for a physical card. You can buy a card for yourself or another person.\nFor certain types of railcards, you will need to provide proof of identity - forms of ID accepted are:\n- Passport\n- Driving Licence (excluding Northern Ireland)\n- EEA National Identity Card\nA remote Welsh island has hit the market - and it could cost you less than buying a home in London or the South East.\nYnys Gifftan in the Dwyryd Estuary is up for sale with a guide price of £350,000.\nAccording to the latest Halifax house price index, the average property in London costs £538,600 and £385,086 in the South East.\nThe 17.74-acre private tidal island can be found in the heart of Eryri National Park (Snowdonia) and comes with a former farmhouse that needs extensive renovation, and a stone outbuilding.\nIt lies close to the village of Talsarnau, and is around four miles from the historic coastal town of Harlech. Porthmadog (five miles) and Barmouth (15 miles) are also within reach.\nIt is one of only 43 unbridged tidal islands in Britain which can be reached on foot from the mainland at low tide.\nHugh O'Donnell, partner at Carter Jonas' Bangor office, which is listing the island, said it \"presents a truly unique opportunity for a buyer who appreciates its exceptional location and potential\".\n\"We expect interest from buyers looking for an exciting lifestyle project in one of Wales's most beautiful coastal landscapes or someone who is looking for their very own secluded haven,\" he said.\nMore than 1.4 million NHS workers will receive a 3.3% pay rise from April.\nThe announcement follows the recommendations of the NHS Pay Review Body.\nHealth Secretary Wes Streeting said the uplift was above the Office for Budget Responsibility's forecast inflation of 2.2% for 2026-27, delivering a \"real terms pay rise\" for NHS staff.\nThe current rate of inflation is 3.4% - and that seems to be the figure unions are focusing on.\nHelga Pile, the head of health of Unison, said: \"Hard-pressed NHS staff will be downright angry at another below-inflation pay award.\"\n\"This award is just not enough to make up for more than a decade of pay cuts under the Tories,\" said Rachel Harrison, the GMB national secretary.\nStreeting has said additional pay increases might be coming. Talks on improving the NHS pay structure are continuing with trade unions and employers, he said, suggesting they would lead to new raises for some staff, backdated to 1 April 2026.\nBy James Sillars, business and economics reporter\nFinancial market behaviour this week has been skittish.\nMuch of the noise has been around AI and software-linked stocks as the earnings season continues.\nWall Street had a big wobble on Thursday.\nThe cost of memory chips was a major concern as the technology-heavy Nasdaq Composite shed 2%.\nThe FTSE 100 and others were dragged lower too. The index of leading shares in London ended Thursday's session just shy of 0.7% down after a positive open.\nA stronger dollar also took some gloss off values, including precious metal miners and energy firms.\nThe FTSE has regained 0.3% in early dealing so far on Friday.\nAmong the winners at the open was NatWest.\nIt revealed a 24% rise in profits for 2025 early this morning to £7.7bn, slightly ahead of forecasts.\nNatWest shares were more than 2% up but later turned flat.\nSavers are being urged to look at lesser-known banks to avoid missing out on hundreds of pounds of interest.\nAnalysis by independent comparison site Moneyfacts has found that the biggest banks offer an average rate of 1.19% on their flexible easy access accounts, while the typical rate for challenger banks is 4.12%.\nA saver with £10,000 in an easy access account earning a typical big bank rate could earn just £119 in a year.\nIf they moved that into a challenger bank offering a typical rate, they would earn £412.\nCaityln Eastell, personal finance analyst at Moneyfacts, warned that savings rates were expected to fall, and staying in a low-paying account could amplify that drop.\n\"Switching to a lesser-known challenger bank could help offset this, as they often offer more attractive rates.\n\"By operating digitally with lower overhead costs, challenger banks can pass on cost savings to customers, giving them the opportunity to improve their returns,\" she said.\n\"Savers don't have to take on additional risk by switching to a smaller or digital provider because many challenger banks are also covered by the Financial Services Compensation Scheme (FSCS), which protects deposits up to £120,000.\n\"However, savers should remain alert. Challenger banks often lead the market with headline rates that include limited-time bonuses, sometimes exceeding 2%.\"\nYou might have seen or used it - pay by bank is a new way to buy products online without the hassle of entering any of your card details.\nThis week, we learnt that Amazon had become the latest mega merchant to roll out the payment method for shoppers to use when purchasing products or setting up Prime subscriptions.\nHere's an example of what it looks like...\nPay by bank allows customers to transfer funds directly from their bank accounts to retailers, without the need to enter any credit or debit card details.\nAs well as Amazon, the method is supported by several household names, including Ryanair and Just Eat.\nFor consumers, the new payment method offers speed and simplicity, with no need for a physical card to complete a transaction.\nRetailers also benefit from reduced transaction costs.\nDespite its growing popularity, consumer rights expert Scott Dixon has raised concerns about the protections customers give up when they opt to pay in this way.\nHe says it removes or weakens key consumer protections - Section 75 and chargeback - two of the most powerful refund routes available to consumers.\nThis means that if the seller goes bust, refuses to refund you or delivers faulty goods, you are effectively on your own.\nWhen should you use pay by bank - and when should you avoid it?\nYou don't need to stop using pay by bank completely, but it's not ideal for all purchases, Dixon says.\nBefore deciding whether it's worth plucking your card out, Dixon says you should ask yourself these questions:\n- Do I trust this seller?\n- Can I afford to lose this money if the purchase goes wrong?\n- Why can I not pay by debit or credit card?\n- Am I happy to give up my right to a chargeback or Section 75 protection?\nIf the answer is no to any of those questions, it's worth taking the extra time to pay using your card.\nDixon recommends avoiding it, especially for high-ticket items such as holidays, electronics, cars and sofas, future-dated purchases like concert tickets or hotel bookings, and when buying something from an unfamiliar seller.\nIf you're spending more than £100 on a purchase, Dixon says you get the strongest protection by paying at least the deposit on a credit card.\nFor anything under £100, you should try to pay with a debit card to benefit from chargeback, which covers you for up to 120 days from the date of purchase.\nWhat does Amazon say?\nAn Amazon spokesperson told Money...\n\"Amazon's customer protection policies apply equally across all payment methods, including Pay by Bank, giving customers confidence when they shop.\n\"All purchases directly from Amazon are covered by our standard return and refund policies, and purchases from third-party sellers are covered by Amazon's A-to-Z Guarantee, which protects customers if items don't arrive or don't match the description.\n\"All Pay by Bank transactions are also protected under UK Payment Services Regulations for up to 13 months.\n\"Not only is Pay by Bank an additional secure and convenient payment method it provides customers with several benefits, including faster refunds.\"\nBe the first to get Breaking News\nInstall the Sky News app for free",
  "word_count": 3202,
  "scraped_at": "2026-02-14T01:56:44.632003",
  "_text_extracted": true
}