{
  "article_id": "c55dd555dcec",
  "url": "https://greatbendpost.com/posts/85996fc9-8e8e-449a-94af-e44295b05dc4",
  "title": "Wednesday Sports Headlines and Scores presented by Barton Community College",
  "date": "20250813T170000Z",
  "domain": "greatbendpost.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ORCHARD PARK, N.Y. (AP) — Bills running back James Cook has ended a contract standoff by agreeing to a four-year, $48 million deal, two people with knowledge of the agreement confirmed to The Associated Press. The contract includes $30 million in guaranteed money, one of the people said. They spoke to the AP on condition of anonymity because the contract has not yet been announced. The new deal comes a day after the fourth-year player ended his weeklong standoff by returning to practice. Cook skipped four straight sessions. Cook was the NFL’s co-leader with 16 touchdowns rushing last season.\nParamount and UFC have announced a billion-dollar rights deal, marking a significant shift for the fight company. UFC CEO Dana White is set to meet with Donald Trump to discuss a proposed Fourth of July fight card at the White House. The seven-year deal with Paramount, starting in 2026, is worth $1.1 billion annually. It will feature all UFC content on Paramount+ and select events on CBS. This deal simplifies offerings for fans and could impact fighter pay. White is optimistic about the future, aiming to elevate UFC's status in the sports world.\nOklahoma quarterback John Mateer denies allegations of sports gambling after a report showed he made Venmo payments labeled for “sports gambling” in 2022. Mateer, who was at Washington State at the time, said Tuesday these were inside jokes with friends and not actual bets. He assured his teammates, coaches, and the NCAA that he has never gambled on sports. Oklahoma confirmed there is no NCAA investigation and states they use ProhiBet to monitor gambling activities. Mateer is recognized for his leadership and is considered one of the nation's top transfers, contributing to Oklahoma's No. 18 ranking in the AP Top 25.\nThe 2025 college football season kicks off with thrilling matchups like Texas vs. Ohio State and LSU vs. Clemson. Early losses in September rarely end postseason dreams, especially with the new 12-team playoff format. As the season progresses, the stakes grow. Key matchups include LSU at Alabama on Nov. 8, Texas at Georgia on Nov. 15, and Penn State at Ohio State on Nov. 1. These games could have significant playoff implications. Other notable contests include SMU at Clemson, Arizona State at Iowa State, and USC at Notre Dame. Every win counts in the race for playoff spots.\nMANCHESTER, England (AP) — The Premier League is back after one of the most unpredictable seasons in recent memory saw Liverpool win a record-equaling 20th title, Manchester City go into meltdown and Manchester United hit new lows. The new campaign kicks off Aug. 15 and teams have spent big in an attempt to capitalize on what looks like being a wide open title race after City’s dominance was ended. Defending champion Liverpool hasn’t stood still, Pep Guardiola’s rebuild at City began in January with around $450 million spent since then and perennial runner-up Arsenal has finally secured a top class striker in the form of Viktor Gyokeres.\nUDINE, Italy (AP) — Paris Saint-Germain get back on the hunt for trophies in the UEFA Super Cup against Tottenham. It’s the annual early-season match between the winners of the Champions League and Europa League and PSG starts as the big favorite. The Qatari-backed team from the French capital is coming off winning the treble, including the Champions League for the first time. PSG will look Wednesday to bounce back from losing to Chelsea in the final of the Club World Cup in the United States. Facing them at Stadio Friuli in Udine is another London club in Tottenham, which ended a 17-year wait for silverware by winning the Europa League by beating Manchester United in the final.\nSOUTH WILLIAMSPORT, Pa. (AP) — The Little League World Series features players from Venezuela who got visa exemptions to make the trip to central Pennsylvania, an American team that knocked off the defending champ and once-dominant Taiwan trying for a title run. It all starts with a new ESPN film to get youth baseball fans excited for the annual tournament. Airing the night before the LLWS begins Wednesday, ESPN is releasing the Little League documentary “Big Dreams: Little League World Series 2024.\"\nBALTIMORE (AP) — The Seattle Mariners have extended their winning streak to eight games with a 1-0 victory over the Baltimore Orioles. On Tuesday night, George Kirby led the team, allowing just three hits in seven innings. This win puts Seattle in a first-place tie with Houston in the AL West after the Astros lost to Boston. The Mariners are starting a road trip that also includes games against the Mets and Phillies. They will face Houston again in mid-September.\nANAHEIM, Calif. (AP) — The Los Angeles Angels turned the eighth triple play in team history Tuesday night, capitalizing on a line drive to second by Dodgers slugger Shohei Ohtani. Miguel Rojas was on second and Dalton Rushing was on first for the Dodgers when Ohtani hit a drive right up the middle past reliever Brock Burke. Angels shortstop Zach Neto caught Ohtani’s drive and stepped on second in stride to get Rojas. Neto quickly threw to first, where Nolan Schanuel tagged out Rushing as the Dodgers rookie attempted to sneak back.\nOWINGS MILLS, Md. (AP) — There was so much faux outrage over Rory McIlroy missing the first PGA Tour postseason event. He wasn't the first to skip it. And he didn't even drop in the FedEx Cup. It should be a reminder that golf is not like other sports. There is no defining end to the season like a Super Bowl or a World Series. The PGA Tour originally called the postseason a “championship series” but then went to “playoffs” and it makes no sense. But what it created was incentive for the best to keep playing after the majors. That still works, even without McIlroy.\nFinals\nINTERLEAGUE\nFinal Cleveland 4 Miami 3\nFinal Toronto 5 Chicago Cubs 1\nFinal Kansas City 8 Washington 5\nFinal Arizona 3 Texas 2\nFinal L.A. Angels 7 L.A. Dodgers 6\nAMERICAN LEAGUE\nFinal Seattle 1 Baltimore 0\nFinal N.Y. Yankees 9 Minnesota 1\nFinal Chicago White Sox 9 Detroit 6\nFinal Boston 14 Houston 1\nFinal Athletics 6 Tampa Bay 0\nNATIONAL LEAGUE\nFinal Cincinnati 6 Philadelphia 1\nFinal N.Y. Mets 13 Atlanta 5\nFinal Colorado 3 St. Louis 0\nFinal Milwaukee 14 Pittsburgh 0\nFinal San Diego 5 San Francisco 1",
  "word_count": 1069,
  "scraped_at": "2026-02-14T01:49:44.668606",
  "_text_extracted": true
}