{
  "article_id": "c57999b6e1bd",
  "url": "https://www.spectator.co.uk/article/the-new-champions-league-format-has-been-a-disaster/",
  "title": "The new Champions League format has been a disaster",
  "date": "20250128T151500Z",
  "domain": "spectator.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City and Paris Saint-Germain could be knocked out of the Champions League tomorrow night. So thank God for the tournament’s new format, or so say the pundits. Yes, there’s the glee that most football fans feel when two of Europe’s petro state-owned superclubs are struggling. But the pundits also see Man City’s scrambling as a vindication of the Champions League’s face-lift. Finally, an end to the ‘bore fest we’ve had for years’, says pundit Jamie Carragher. It’s easy to get caught up in the hype and even easier to forget the great tournaments of the past few seasons. Nevertheless, the suits at UEFA – European football’s governing body – decided the tournament needed ‘more drama’ and ‘more entertainment’, so they turned the group stage into a mini-league by squeezing in extra games and then topped it off by adding another qualifying round after that as well.\nThis is the ‘Swiss model’, which was originally developed to organise Zurich chess tournaments in the 1890s. There were too many players to all face one another in a round robin, so they played random opponents of varying quality. This gave competitors a final ranking, but reduced the total number of games. UEFA have conveniently skipped over this part. It didn’t want to increase the number of teams, just the number of matches. Each club’s extra games means there’s another 52 more televised events for UEFA – increasing the prize pot by almost 25 per cent to around £2.2 billion.\nThe clubs are happy with the extra television revenue. UEFA are beholden to the biggest and stroppiest clubs who threaten to form a breakaway ‘Super League’ every time they don’t get their way. The new format drags out the group stage into a league making each team play eight others, removing drama from big matches. Did it matter that Barcelona lost a one-off game to Monaco? They had another seven games to make up for it and now sit comfortably in second place. Of the 36 competing teams, already half have qualified for the next stage of the tournament, more than did so at this stage under the old system.\nThe former group stage was simple and emphasised the gladiatorial atmosphere of the tournament. After all, the Champions League is the pinnacle of club football and should pit European clubs directly against each other to see which would triumph. Four teams played a round-robin, once at home and away, and their final standing determined their fate – a bit like the World Cup. The top two advanced to the knockout stage, the third was exiled to a lower rung of European competition – its frustrated fans forced to fly for fixtures Azerbaijan instead of Spain – and the bottom team eliminated completely. Playing a balance of your games at home could give smaller clubs an advantage and in recent years just as many, if not more, of them supplanted their larger foes in the group stage. Manchester United were kicked out by Copenhagen, Atletico Madrid by Brugge, and Inter Milan by Monchengladbach.\nWhere does this leave the fans? Let’s take Aston Villa. When their fans sat down to track Villa’s path in the Champions League, they had to comb through a meandering list of fixtures: away to Young Boys in Switzerland, followed by Munich and Bologna at home, Brugge away next, then Juventus at home, Leipzig and Monaco away and, finally, Celtic at home. At the end of that, Villa would finish around ninth, or so they would have hoped. Their reward? Yet another round of qualification games against, er, one of the teams they had probably already played. Only this round will be once at home and away, and, if Villa wins overall, they can enter the knockout competition proper where the tournament really gets going.\nCompare that to Aston Villa’s last Champions League run in 1982. Villa had won the tournament the year before so fans went in with high expectations. First they battled Besiktas from Turkey home and away, besting them to go on and do the same to Bucharest. However in the quarter finals they just lost out to a strong Juventus side. That was it. Curtains. Six games, all high stakes. Now it takes 144 games to eliminate just 12 teams from the tournament. And there’s four more months of fixtures to go.\nThe ‘Swiss Model’ doesn’t benefit the Swiss teams who still get thumped every week and turfed out the competition with the rest of their mediocre Mitteleuropean neighbours. The last time an underdog made any serious progress in the Champions League progress was 13 years ago – APOEL from Cyprus squeezed through to the last eight. The new format hasn’t made the tournament more competitive, it serves only to squeeze more money out of an already over-saturated game.",
  "word_count": 802,
  "scraped_at": "2026-02-14T02:11:27.598907",
  "_text_extracted": true
}