{
  "article_id": "c592f983a496",
  "url": "https://www.al-monitor.com/originals/2025/05/al-ahli-beat-kawasaki-frontale-win-asian-champions-league",
  "title": "Al Ahli beat Kawasaki Frontale to win Asian Champions League",
  "date": "20250503T220000Z",
  "domain": "al-monitor.com",
  "source_country": "Israel",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Al Ahli beat Kawasaki Frontale to win Asian Champions League\nAl Ahli were crowned champions of Asia at the third attempt after the Saudi Arabian side overpowered Japan's Kawasaki Frontale 2-0 in Jeddah on Saturday.\nThe Jeddah club, runners-up in 1986 and 2012, triumphed at their King Abdullah Sports City Stadium thanks to two goals in seven minutes towards the end of the first half from Brazilian Galeno and Ivory Coast captain Franck Kessie.\nThe Asian Champions League's latter stages have all taken place in Jeddah.\nWith the win, Roberto Firmino, Edouard Mendy and Riyad Mahrez become the first players to capture both Asian club football's premier title and its European equivalent.\nThe trio won the Champions League with Liverpool, Chelsea and Manchester City respectively.\n\"We are so proud,\" Al Ahli goalkeeper Mendy said.\n\"Once we knew that the final eight would be in Jeddah, it was our goal to be champions in front of our fans. Since I came here 18 months ago, they supported us so much.\n\"As I said when I signed here, it's to make history, to continue to win trophies and make this club as big as it was before.\n\"The secret is the team effort. If someone makes the effort it will make it easier for the one next to him. We just played like this; you saw the fire, you saw the spirit.\"\nAl Ahli, who are majority-owned by Saudi Arabia's Public Investment Fund, are awarded $10 million for clinching the title.\nMatthias Jaissle's side went unbeaten through all 13 matches of the campaign.\nFrontale, meanwhile, were contesting the final for the first time having never previously been beyond the last eight.\n- Al Ahli too strong -\nAl Ahli began on the front foot, summer signing Ivan Toney stinging the palms of Louis Yamaguchi on five minutes before the Frontale goalkeeper then saved Ziyad Al Johani's close-range effort from the resultant corner.\nAt the other end, Frontale's Brazilian forward Marcinho showed some fast feet down his side's left, before sending his effort inches past Mendy's far post.\nYet Al Ahli always looked the more dangerous. Toney lashed wide on the half-volley, defender Roger Ibanez curled narrowly off target and Firmino sent a volley straight at Yamaguchi.\nHowever, on 35 minutes, Firmino rolled a pass to winger Galeno, who curled a spectacular effort from 25 yards into the top corner.\nGaleno, a winter signing from Porto for a reported 50 million euros ($56 million), has actually taken Firmino's spot in Al Ahli's Saudi Pro League squad, meaning the former Liverpool forward is not registered to play in the domestic league.\nThree minutes before half-time, Firmino floated a cross into the Frontale six-yard box for Kessie to power home his header and double Al Ahli's advantage.\nThe assist lifted Firmino, the club captain, to seven in this season's Champions League – and to one behind Mahrez at the top of the tournament's assist charts.\nFrontale, who defeated Cristiano Ronaldo's Al Nassr in the semi-final, did not have a shot on target in the opening 45 minutes.\nIn the second half, Firmino and Mahrez each flashed efforts well wide, with the former substituted on 74 minutes to rapturous applause.\nNot long after, Frontale substitute Tatsuya Ito fired two shots in quick succession inches off target.\nIn the end, Al Ahli celebrated becoming only the third Saudi club to win the Champions League, after record four-time winners Al Hilal and two-time champions Al Ittihad.",
  "word_count": 578,
  "scraped_at": "2026-02-14T02:09:01.832684",
  "_text_extracted": true
}