{
  "article_id": "c5af5f54df31",
  "url": "https://www.asiaone.com/world/harry-kane-says-he-joined-bayern-munich-win-titles",
  "title": "Harry Kane says he joined Bayern Munich to win titles",
  "date": "20230814T053000Z",
  "domain": "asiaone.com",
  "source_country": "Singapore",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 30-year-old Kane, who joined on a four-year deal on Saturday (Aug 12) for a reported 100 million euros (S$148.10 million) plus add-ons, made his debut only hours later as a second-half substitute in Bayern's 3-0 loss to RB Leipzig in the German Super Cup.\nDespite a stellar scoring record he has failed to win any domestic or international titles with Spurs.\n\"In my career I wanted to keep improving, pushing myself and see how far that can take me,\" Kane said in a press conference.\n\"I wanted to play internationally, in the Champions League, and fight for titles every year. Coming to Bayern gives me that opportunity. I am looking forward to that challenge.\"\nThe striker, who has spent the majority of his career at Tottenham after joining at 11, has scored a club-record 280 goals in more than 430 appearances in all competitions and 58 times for his country in 84 games, making him England's all-time record marksman.\nHe is also the second-highest Premier League scorer of all time with 213 goals, 47 behind Alan Shearer, but titles with club and country have so far eluded him.\nBayern had been in search of an out-and-out striker after struggling since the departure of Robert Lewandowski last year.\nThe Bavarians last won the Champions League in 2020, the most recent of their six European Cups. They have also won the last 11 Bundesliga titles in a row.\n\"I was at Tottenham for 19 years of my life. Ultimately I am a professional and I always pushed myself to the limit,\" Kane said.\n\"I needed to be playing in the Champions League, trying to win titles every year. When I thought about it, it was a decision I wanted to make.\"\nTottenham failed to qualify for international football this season.\nKane, however, missed out on the first title of the season on his Bayern debut, coming on just after the hour but managing only three touches in the loss to Leipzig.\n\"It was amazing to see the reception I got,\" he said. \"Ultimately of course I wanted to come here and win last night but it was not the case.\n\"No time to panic, it's a long season ahead,\" Kane said. \"We want to win the title, win the Cup and try to win the Champions League as well.\"\nALSO READ: Most expensive transfers in club football",
  "word_count": 396,
  "scraped_at": "2026-02-14T02:24:50.279183",
  "_text_extracted": true
}