{
  "article_id": "c5ba4c87ab37",
  "url": "https://www.sounderatheart.com/2024/12/winter-transfer-window-wish-list/",
  "title": "Winter transfer window wish list",
  "date": "20241209T214500Z",
  "domain": "sounderatheart.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Seattle Sounders have a lot riding on this coming season, and particularly in this transfer window. Club record signing Pedro de la Vega joined last winter, but wasn’t able to have the kind of impact on the scoresheet or otherwise that he and the club would have hoped for or expected, and Seattle’s attack struggled as a result.\nEven if de la Vega is able to build on his improved performances over the final months of the season, the Sounders will need to make at least one serious addition – and possibly more – to the attack if they want to have a real chance of meeting the standards they claim. With Raúl Ruidíaz’s departure following the end of his contract — to say nothing of the team still working to reach an agreement to bring back Albert Rusnák — there’s at least one Designated Player spot open, and potentially additional flexibility depending on any outbound moves that the window may have to offer.\nBased on where he tended to line up, PdlV seems to be seen primarily as a right winger in Seattle. Jordan Morris has played some of the best football of his career as a No. 9 during the last two seasons and should have a chance to keep that spot, but he can also be deployed on the left wing as can de la Vega. There seems to be a preference within the club’s front office to add an elite striker, but when they’re looking to sign a DP to fill Ruidíaz’s spot it will probably be more useful to be somewhat position-agnostic and sign the best attacking player who fits their plans and vision.\nWith that in mind, here are some players who I think could be potential targets for the Sounders this winter. I’ve put some parameters to guide this search based on what I expect the club will want, to some degree influenced by the challenges the player and club faced this season with de la Vega’s signing. In choosing names I’ve accounted for a likely preference for players in their prime, ideally between 24 and 28. I’ve also looked for players who have experience in multiple countries, or if they’ve primarily played in a single country then they’ve also taken part in international competitions either with their club or national team. The last really notable thing here is that when looking at production I’ve tended to favor players who have a history of production over players who have suddenly broken out over the last season for one reason or another. Nothing is guaranteed, obviously, but the idea here is to try to find a player who can help to elevate the team and players already in place upon arrival without needing too much of an adjustment period.\nLet’s dig in:\nLuis Palma, LW: Luis Palma is maybe the player I’d most like the Sounders to sign this window, and I think he’s pretty genuinely gettable. Palma will turn 25 in January and seems somewhat desperate for a move. The Honduran left winger joined Celtic at the end of August 2023 from Greek side Aris Thessaloniki FC for a transfer fee of roughly $5 million. He absolutely cooked in his first season, scoring 7 goals with 9 assists in the Scottish Premiership in 1,496 and adding a pair of goals in 268 minutes in the Champions League against Feyenoord and Atletico Madrid. Despite those performances, Palma hasn’t been able to get into the team during the 24/25 season as he’s only made 5 appearances for 114 minutes across all competitions with no goals or assists for Celtic. Before joining Celtic he had 13 goals and 5 assists in 2,175 minutes across parts of three seasons in Greece’s Super League.\nThe Scottish Premiership is a pretty lopsided league, but we’ve seen players who do well there translate effectively to MLS. Palma’s experience in Concacaf with Honduras would be a real asset in that adjustment, as potentially could be the season he spent on loan as a 19-year-old with Real Monarchs in 2019. Capable of scoring goals and, possibly even more importantly, setting them up, Palma isn’t exactly a physical mismatch on the wing like Denís Bouanga, but he makes up for it with skill, vision and reading the game well. His game would make for a good stylistic fit with not only the top-end talent in Seattle’s attack, but I think he’d mesh when played opposite any of the team’s wingers. He can create off the dribble or with a pass, and isn’t afraid of getting involved when the team doesn’t have the ball. During last season with Celtic he was in the 88th percentile for possession won in the final third per 90 minutes, which would fit perfectly in the possession and counter-pressing system the Sounders have employed when at their best over the last couple of years.\nDespite moving for about $5 million not too long ago, Transfermarkt puts his current market value at about $3.7 million and he’s clearly not in the team’s plans. With Honduras pushing for World Cup Qualification, and the 2026 tournament being played in the U.S. I think a move to a team like the Sounders could make a ton of sense for Palma, and he could definitely help the team be more dangerous with the ball.\nJavi Puado, LW: Javi Puado is a 26-year-old attacker (he turns 27 in May of 2025) who admittedly sits slightly outside of some of the parameters that I set up above. Puado, who is from Barcelona, has spent his entire career in Spain mostly with Espanyol whose academy he joined as a 16-year-old. He did help Espanyol qualify for the Europa League in 2019, making 3 appearances during qualifying, and has played with Spain at a couple different age levels including playing in the Olympics and scoring in his lone appearance with the full national team back in 2021.\nThe reason he’s still on this list is that he’s a pretty good fit for a “Denís Bouanga” type signing. He’s a couple of years younger than Bouanga was when he made the move to LAFC and hasn’t been quite as prolific, but when comparing their performances on a per-90 basis through their age 26 season (Puado’s current season vs. Bouanga’s final full season before moving to MLS) the two aren’t actually that far a part in terms of actual output (Puado has averaged 0.43 non-penalty goals + assists/90, while Bouanga averaged 0.44/90) and expected production (Puado has averaged 0.38 npxG+xAG, vs 0.45 npxG+xAG in the seasons for which data is available for Bouanga, all according to FBRef). I don’t think it’s unfair to argue that La Liga and La Liga 2 are stronger than their French counterparts, and Puado at least in his time in La Liga has played for a relatively weaker team in the league than Bouanga did in Ligue 1. That’s all to say that some of the differences in production could be attributed to the quality in the competition.\nJavi Puado could easily be the most expensive player I’m including, as Transfermarkt puts his market value around $8.5 million. I think he’d potentially worth it in part because of the Bouanga comparison, but he also seems like a good fit for what the Sounders’ need and want. He’s made more appearances as a LW than anywhere else, but can credibly play on either wing or up top which would allow the Sounders some flexibility in how they use their current talent and could make for a dizzying interchange between him, Morris and de la Vega in a game if they were to play them together. Espanyol are currently in a relegation battle once again, and Puado’s contract is set to expire in the summer so if he can be lured away I think the Sounders could make a compelling pitch along with an astronomical raise if his estimated wages (around $500k a year) are at all accurate.\nTolu Arokodare, ST: Maybe the Sounders don’t want their own Bouanga. Maybe what they want is their own Christian Benteke. Well, if you want a Benteke of your own, where else would you look than in Belgium? Not just in Belgium, but at the club where Benteke turned pro, at KRC Genk 24-year-old Tolu Arokodare has made himself a fixture in the starting XI this season. The 6-foot-6 Nigerian forward’s career has taken him to Latvia, Germany, France, and now Belgium.\nAfter scoring 14 goals and 2 assists in 3,342 Ligue 2 minutes from 2021 to 2023 with Amiens, Arokodare earned a $5.25 million move to Belgium with Genk. He repaid them for the move with 2 goals and 1 assist in 407 minutes to close out the 22/23 season, and has only taken steps forward from there. He followed that first look up with 12 goals and 2 assists in 2,148 minutes the following season, and is well on his way to eclipsing that production this season with 10 goals and 3 assists in 1,396 minutes as he’s started in all 17 games for the league leaders.\nFC Cincinnati have already made waves this offseason by signing Kevin Denkey, the Belgian top tier’s golden boot winner last season. The Togo international is 7 days younger than Arokodare and doubled his output last season with 27 goals and 1 assist, but so far this season Arokodare has been the more productive of the pair.\nTolu Arokodare is the kind of player that doesn’t come around often. He’s big and skillful, already has a range of experience despite his relatively young age, and looks to be the kind of player who, if brought to Seattle, could either be an absolute star for the better part of the next decade or allow the team to more than recoup his transfer fee if he continues to grow his game. Transfermarkt25-year-old puts his transfer value at around $7 million, but the price set as Trabzanspor have apparently come sniffing around is said to be about $13 million. It would still probably be worth it.\nWe're going to move a little quicker from here on out.\nJens Petter Hauge, LW: Jens Petter Hauge, a 25-year-old winger from Norway, is currently on loan back at the club where his career started, Bodø/Glimt, from German Bundesliga side Eintracht Frankfurt. He’s currently absolutely cooking, not for the first time, for Bodø/Glimt as they sit atop the Eliteserien table putting up 10 goals and 6 assists in 2,500 minutes between the Eliteserien and Europa League.\nHauge has had quite the European journey during his career, although it’s not always been fruitful. He moved from Bodø/Glimt to AC Milan for $5 million or so in October 2020 after a dominant first part of the year in Norway where he had 14 goals and 10 assists in 1,551 minutes. He did well in limited minutes, particularly in the Europa League with 3 goals and 1 assist in 5 appearances, for Milan leading to a loan and eventual transfer to Eintracht Frankfurt that saw Frankfurt dish out almost $10.5 million in loan and transfer fees. He’s struggled to break through in Germany and Italy, though, and a dismal loan to Gent in Belgium for the 22/23 season thrown into the mix has seen his estimated transfer value drop to a little over $3 million. He’s got a contract that runs until June 2026 with Frankfurt, and at this point I imagine they may simply want to recoup some of their investment on a player who hasn’t panned out for them but clearly has some ability.\nWe now turn to the 2. Bundesliga...\nRagnar Ache, ST: I still think that Jordan Morris should probably be the starting striker going into next season, but if the Sounders want to go a different direction and bring in a guy who could potentially be the killer No. 9 that some folks insist Morris is not, FC Kaiserslautern’s Ragnar Ache could be worth a shout. At 26, turning 27 in the Summer, Ache could be an answer leading the line for several years. Ache was born in Germany but came up through the Sparta Rotterdam system before earning a move to Eintracht Frankfurt. He never quite got off the ground there, but a productive stint with Greuther Fürth in the second division in which he had 7 goals and 2 assists in 1,902 minutes earned him a move to Kaiserslautern.\nWith Kaiserslautern he’s had 26 goals and 1 assist in 2,827 minutes across all competitions, including 9 goals and 1 assist in 888 all comps minutes this season. Per FotMob he’s in the 96th percentile for goals, xG and non-penalty xG, 100th percentile for shots with 5.49 shots per 90, and 76th percentile for touches in the box with 6.48/90. His duels numbers, both ground and aerial, are good as well, which Brian Schmetzer and his staff would appreciate. His transfer value is estimated by Transfermarkt to be about $4.25 million, which isn’t nothing but could be decent value potentially.\nLinton Maina, LW: 25-year-old Linton Maina has spent his entire career playing in Germany, starting his professional career with Hannover 96 before moving to 1.FC Köln in July 2022. His numbers don’t jump off the page at you – his most productive season was that first with Köln when he had 3 goals and 7 assists in the German top tier in 2,239 minutes. However, with Köln having been relegated last season, Maina is on track to obliterate that career-best output as he has 3 goals and 6 assists in 1,255 minutes.\nI’m not going to claim to be an expert on his game. I don’t watch the 2.Bundesliga, and no one seems to have put together a highlight compilation set to the most 2006 electronic music you’ve ever heard, but his stats this season are intriguing if Seattle are looking for someone to help create chances. His shooting numbers are solid, but his assist and chance creation are what really shine. He’s a passer, rather than a dribbler, and is in the 97th percentile for assists, 98th percentile for expected assists, 98th for key passes and shot-creating actions, and 99th for live ball passes that create a shot. He’s maybe more of a gamble than some of these other guys, but if he hit he could really unlock Jordan Morris in particular.\nRayan Philippe, ST: If the Sounders want to Crash into next season with a new No. 9, they could demonstrate their Cruel Intentions for the rest of the league by going after Rayan Philippe. The 24-year-old French attacker has played primarily as a striker since joining Eintracht Braunschweig in Germany’s second tier in July 2023. Philippe started his career with fruitless stints at Dijon and Nancy in his native France, but a transfer to Luxembourg at the end of August 2021 allowed him to burst onto the scene seemingly out of Nowhere with Hesperange where he had an outrageous 40 goals and 31 assists in 48 appearances across all competitions over about a year and a half. From there he moved to Braunschweig on a free, where he’s scored 17 goals with 5 assists in 2,921 league minutes.\nWith 9 goals and 1 assist in 15 games this season, Philippe could prove a decent answer to the persistent reminder to the team from fans that “I Know What You Did Last Summer” or maybe more pointedly what they didn’t do. Philippe’s contract runs out this Summer, and with an estimated transfer value of about $2 million, he may not even need to be a DP depending on contract length and salary if the Sounders were to go after him. Maybe he can make Seattle a part of the Bang-Bang Club.",
  "word_count": 2628,
  "scraped_at": "2026-02-14T01:52:10.163308",
  "_text_extracted": true
}