{
  "article_id": "c5d4a6790007",
  "url": "https://metro.co.uk/2025/03/07/gary-neville-makes-manchester-united-vs-arsenal-prediction-22683146/",
  "title": "Gary Neville makes Manchester United vs Arsenal prediction",
  "date": "20250307T071500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Neville has revealed his prediction for this weekend’s huge Premier League clash between Manchester United and Arsenal at Old Trafford.\nArsenal will look to keep their fading title hopes alive when they travel to the Theatre of Dreams on Sunday.\nMikel Arteta’s side had the chance to cut Liverpool’s lead at the top of the table to just five points less than two weeks ago but losing to West Ham and drawing with Nottingham Forest has left the Gunners 13 points adrift.\nArsenal fans were wondering where the next goal never mind win would come from after they scored just twice across four games, but a stunning 7-1 victory over PSV in the Champions League in midweek has improved the mood at the Emirates Stadium.\nThe Gunners had six different goalscorers out in Holland on Tuesday night, sealing the biggest-ever away win in the first leg of a Champions League knockout game.\nManchester United, meanwhile, drew 1-1 with Real Sociedad last time out in the first leg of their Europa League last-16 tie in Spain.\nThe Red Devils have won just two of their last seven games in all competitions as they prepare for the visit of title-challenging Arsenal.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRevealing his prediction for this weekend’s intriguing Premier League clash, Neville said on The Overlap’s It’s Called Soccer! show: ‘Manchester United are playing so poorly at the moment but they do sometimes lift their game against big opponents.\n‘I think that will be the case on Sunday. The crowd will be with them, I think it will be 1-1.’\nRebecca Lowe, host of the YouTube show, added: ‘I’m going 2-0 to Arsenal. Sorry Gary!\n‘I know Arsenal haven’t got any strikers but I just don’t see a way that Manchester United win that game.’\nArteta was full of praise for his Arsenal side after they made Champions League history with an incredible victory over PSV.\n‘I really enjoyed the match – thank you to the players for the performance they put in on a big night for us against a really good side,’ he said.\nMore Trending\n‘The way they went through in the last round against Juventus was really impressive so the manner that we’ve done it, the way that we’ve played, the goals that we scored; thank you because it was a special night.’\nAsked how big the PSV win could be for the rest of Arsenal’s season, Arteta added: ‘Well, it obviously gives us a lot of joy, confidence and belief.\n‘But this is football, it’s not what we did three days ago, or today, it’s about what we’re going to do tomorrow, or at Old Trafford, how we behave and able to win again, and that’s it.\n‘Enjoy tonight because it was a very impressive performance, an unbelievable score, so we deserve that, and now take that, and keep improving as a team.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Europa League odds reveal surprise favourites after last 16 first legs\nMORE: Chelsea told to sign Liverpool star who is ‘one of the very best’\nMORE: Jean-Philippe Mateta’s stance on Man Utd transfer as Ruben Amorim eyes move",
  "word_count": 591,
  "scraped_at": "2026-02-14T02:18:17.728154",
  "_text_extracted": true
}