{
  "article_id": "c627704ce16f",
  "url": "https://www.liverpoolfc.com/news/arne-slot-press-conference-head-coachs-verdict-psv-3-2-liverpool",
  "title": "Arne Slot press conference : Head coach verdict on PSV 3 - 2 Liverpool",
  "date": "20250130T021500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ReactionArne Slot press conference: Head coach's verdict on PSV 3-2 Liverpool\nRead Arne Slot’s post-match verdict on Liverpool’s 3-2 defeat against PSV Eindhoven as the Champions League league phase concluded.\nAfter twice taking the lead during the first half – with Cody Gakpo (penalty) and Harvey Elliott getting the goals – the Reds were undone as, following two equalisers, PSV moved ahead in added time before the interval at Philips Stadium.\nThe score remained unchanged in the second period and the visitors were reduced to 10 men late on as debutant Amara Nallo received a red card.\nDespite Wednesday night’s loss in the Netherlands, Slot’s side finished the tournament’s new eight-fixture opening stage at the top of the table with 21 points.\nThere are four possible opponents for Liverpool when the last-16 ties are played in March.\nSee a summary of Slot’s reaction at his press conference after the game below…\nOn his assessment of the night…\nLike expected I think, eventful game with many goals. I think everybody expected that before the game, for two reasons maybe. One of the reasons I think [is] two managers who always want to press high, want to bring the ball out from the back. So sometimes you see then certain mistakes – but it’s always eventful. And for the other reason because both teams, maybe mainly ours, were not playing in the set-up that we usually do, so then you see in some moments that we defend in a way that probably is not expected if we play with all of our starters. But still in the end we were able to definitely make a game out of it, especially with all these youngsters on the pitch. So, ‘eventful’ would be my word to use.\nOn it being ‘a big step forward’ for Federico Chiesa to complete 90 minutes…\nYeah. And he got a knock with the penalty so that took him a few minutes before he got going again. But I think it’s been seven, eight or nine months ago – maybe even longer, I don’t know exactly – since he played 90. It’s the same for Jayden Danns, it was the same for James McConnell. So, we had quite a lot of players that were not used to playing so many minutes in the last six or seven months. So it’s especially for them also important that they make these 90 minutes and were able to keep competing during 90 minutes. OK, Jayden couldn’t manage to play the whole game, but Federico in the end was still sprinting, trying to do his work. So, positive.\nOn it being a ‘cruel’ experience for Nallo to be sent off moments after coming on for his debut…\nYeah, it’s cruel. He has never played first-team football yet and then to make your debut at Champions League level is probably the hardest way of making your debut. I think he misinterpreted the situation and that is immediately a problem at this level or at Premier League level. So, it’s a big moment for him to learn from. It is cruel, indeed. You think in a moment like this, 10 minutes before the end, ‘Phwoar, I’m going to make my debut in the Champions League’ and a few minutes later you go off with a red card. That is always difficult. But a career mainly is not always positive, there are also negatives and he has to fight very hard to make sure he will ever play a second Champions League game again, which is not going to be easy but hopefully he will.\nOn whether any of the young players who featured could head out on loan before the transfer deadline...\nThere’s always a chance in life. At the moment we have most of our players fit, so we will have this discussion tomorrow, me and Richard [Hughes], about these players. There is definitely one of them that will not go on loan – and I think you know which one I mean. James McConnell. I wouldn’t say definitely, but I liked him a lot today, so maybe now the end result today would be it’d be good for him to go somewhere and play. He was also a player that hasn’t played in the last six or seven months 90 minutes because he was injured for a while. He impressed me a lot today.\nOn finishing first in the league-phase table...\nI don’t know if it’s a big achievement, but it is a good achievement to end up top of this league. I have said many times it is so hard to judge a league table after eight games, let alone if all the teams play different opponents. It doesn’t tell me much, to be honest, because some teams have faced easier opponents than others. It’s always nice if there’s a new format that you end up No.1, but it doesn’t give us any assurances for the next round because if I now check the league table and I see the four teams we can face and one of them is one you’re hoping not to face if you end up first in a group like this.\nOn whether he was surprised by McConnell’s performance...\nIf I would have been surprised it would mean during training sessions he is not able to play at this level and that’s not the truth, because he is competitive to the ones we have that were not even here. He is always a very competitive player, so I am not surprised but you always wonder how are you going to react on this stage and at this level. We saw the same with Amara Nallo, which is not a player that has the same impact in training sessions yet as James McConnell. That James plays and is competitive is not a surprise but he definitely deserves credit for his performance today.",
  "word_count": 984,
  "scraped_at": "2026-02-14T02:11:27.596747",
  "_text_extracted": true
}