{
  "article_id": "c65d943f5b72",
  "url": "https://thepeoplesperson.com/2023/02/18/should-manchester-united-pursue-declan-rice-this-summer-259934/",
  "title": "Should Manchester United pursue Declan Rice this summer ? ",
  "date": "20230218T161500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With West Ham United ready to listen to offers for Declan Rice this summer, Manchester United have naturally been presumed to be one of the major suitors for his signature.\nThe club has been consistently linked with the central midfielder throughout the past few years, with his previously astronomical price tag discouraging them from making a potential bid.\nRice’s contract expiration date, however, is now fast approaching. The Englishman’s deal at West Ham runs out in June 2024 (albeit with a one-year option to extend). This summer is, therefore, the perfect opportunity for United to strike a deal.\nShould United engage in transfer talks for Rice? Should he be made a midfield priority signing? And will Erik ten Hag want him in his team?\nUnited’s precarious and undefined ownership situation makes future transfer discussion difficult to navigate. Whether or not United will engage in talks for any high-profile player is entirely unknown; the new majority owners could simply be another investment-shy Glazer-like enterprise or be trigger-happy Todd Boehly-like spenders.\nThe likelihood is that whatever owner comes in will want to make somewhat of a splash in the transfer market. But as we have seen recently at Newcastle United, there are smart ways of announcing your presence as a new money man in town.\nRice is English, young with vast Premier League experience, and highly-regarded amongst top teams. His price will not be cheap, regardless of his contract length.\nWest Ham will do their best to create a saga and push his price up as they pit suitors against each other. Chelsea, Arsenal, and United are already thought to be candidates and will inevitably be caught in the media storm.\nDo United’s new owners need this strenuous activity in their first window as leaders of the biggest club in the world? No. For every €100m Declan Rice, there is a €50m Bruno Guimarães; for every €50m Fred, there is a free agent Christian Eriksen. Shrewd and steady business ultimately prevails in the short and long term.\nUnited had attempted to transition into this sort of strategy last summer under new chief executive Richard Arnold and with director of football John Murtough working in tandem with manager Erik ten Hag. The lack of clear immediate direction, however, did cause some conflated and incoherent movement: see Antony’s eventual €100m cost.\nIf United are to strive to implement a structured and clever approach to the transfer market, then convoluted strategies have to be nullified. Unless, of course, a marquee player – who is also the “right player”, which Ten Hag has reinforced as his sole priority when shortlisting targets – becomes available. Rice will be available, and he will also inevitably be a marquee player due to his nationality and media hype, but would he be the right player? Would he be worth paying over-the-odds and getting caught up in a saga?\nTen Hag needs players who can play football in both the defensive and attacking half for Total Football to be realised. That means that the days of chasing a midfield “destroyer”, which was so desperately craved by fans, are over. A no. 6 has to be a destroyer and a playmaker simultaneously to play under Ten Hag.\nThat is why Casemiro has prospered at United. Surprising to many is the Brazilian’s outstanding passing and, in Ten Hag’s words, verticality. Combined with his superlative defensive capabilities, Casemiro has arguably been the best midfielder in the Premier League thriving within Ten Hag’s system and ideals.\nAt 30 years old, Casemiro still has some years at his peak left in the tank (you would expect/hope). To pay €100m for cover is, therefore, rather wasteful.\nThere are many games in a season, but when resting Casemiro strategically in the coming years could be used to create a new Casemiro.\nThat’s not to say to ‘We should play 17-year-old Kobbie Mainoo in half of the fixtures!’ – well, actually, why not? Ten Hag has a history of trusting youth players and developing them into high quality and reliable first team players. Mainoo could be next in line for this process.\nWest Ham had to give Rice game time before he became an elite Premier League midfielder. Casemiro had to be given game time at Real Madrid for him to become the world’s best defensive midfielder. Rushing into a massive signing limits not only Casemiro’s role in the team, but also the role of upcoming talent.\nA tad naïve? Definitely. But perhaps part of United’s strategy. By next season, Mainoo will have spent one year learning off Ten Hag, soaking up his philosophy, ingraining specific tactics and style of play into his mind – and the benefit of introducing talented youngsters into the first team is that Mainoo will have only fed from Ten Hag’s tutelage; not from multiple managers and senior coaches.\nIntroducing Mainoo as a first team regular is not the answer to ‘should United buy Rice?’, but merely a symbol in the equation.\nAs Ten Hag has shown throughout his career, and already at United, he is not afraid to give precedence to youth players over senior squad members; see Alejandro Garnacho’s rise. Mainoo, at 17 years old, should be allowed to carve his path into becoming a valued squad member gradually, however. If United choose not to invest in a top quality midfielder this summer, Mainoo’s development would also be hindered by being rushed; see Anthony Elanga as a case study for the negative side effects of this.\nUnited need to strengthen their depth in midfield – there are no two ways around this. Scott McTominay, Fred, and Donny van de Beek are all surplus to requirements and United must be ruthless about this reality if they are to become a genuine challenger on multiple fronts.\nVenturing into Europe and unearthing true gems or pinching the top young talents from bottom-half Premier League clubs was Sir Alex Ferguson and David Gill’s Modus Operandi for two decades.\nAnd Declan Rice is a top talent; there can be no debate about that.\nThe 24-year-old is a quintessential dynamic central midfielder – defend, pass, and move.\nHe averages almost two interceptions per 90 minutes, placing him in the elite category compared to other central midfielders across Europe.\nA remarkable pass completion rate of 89% has garnered him plaudits. Some may think this figure is conflated with backwards or sideways passes, but Rice is one of the most progressive passers of the ball in European leagues – he zips forward over seven passes into the final third per game.\nAlthough he primarily operates around the centre circle, his unafraid and composed nature on the ball would appeal to Ten Hag, as he averages over two carries deep into the opposition area every match.\nThese undeniably commendable statistics along with Rice’s age and vast Premier League experience make him an ideal profile to be introduced into United’s weak midfield squadron.\nWhat is cause for concern is his only experience is playing for West Ham, a team that does not play expansive, possession-based football, with David Moyes preferring a resilient and disciplined approach.\nWith Ten Hag and his staff’s coaching pedigree already paying dividends in resurrecting multiple United players’ careers, perhaps this should not be a cause for concern but rather a point to consider when immediately judging Rice should he be purchased this summer.\nAnother potential issue is his price tag. United will without doubt be focussing on signing a world-class striker this summer with Harry Kane, Victor Osimhen, and Dusan Vlahovic already being touted as shortlisted targets.\nWill there be enough money in the bank to purchase two €100m+ signings? The precarious and unknown future ownership situation prevents this from being debated.\nAlthough it would ring similar to Woodward’s cash splashing on whatever shiny object he found to be the flavour of the month, these astronomical prices are becoming the norm for mid-quality players, let alone world-class stars.\nIf United are to compete on all fronts, challenging for cup trophies, Premier League and Champions League, then they need strength in depth. Not just strength – world-class strength in depth.\nRice could be the perfect top-quality addition to a squad crying for midfield supplementation; but the main question, ownership aside, is will Ten Hag forgo his Frenkie de Jong obsession?\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 1475,
  "scraped_at": "2026-02-14T01:53:21.833872",
  "_text_extracted": true
}