{
  "article_id": "c677e84d8930",
  "url": "https://www.caughtoffside.com/2024/02/27/newcastle-mistakes-ian-wright/",
  "title": "Newcastle news : Loris Karius will always be blamed for team mistakes",
  "date": "20240227T131500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For some football players, their careers can be defined by just one moment, and that certainly appears to be the case for one Newcastle United ace.\nThe Magpies were well beaten at Arsenal at the weekend, but given the respective form of both clubs, that wasn’t really a surprise.\nMikel Arteta’s North Londoners are flying at the moment and scoring goals for fun, whereas Eddie Howe’s charges look like they’re wading through treacle in some games.\nCollectively Newcastle were poor, but it appears that substitute keeper, Loris Karius, is having to carry the can once again.\nThe 30-year-old has never really recovered from a disastrous Champions League final showing for Liverpool against Real Madrid, and though he couldn’t have done anything about Arsenal’s goals, that seemingly hasn’t stopped the trolling.\nPundit, Ian Wright, clearly isn’t happy about it.\n“You know what’s really unfortunate about Karius,” he said on Premier League Productions (h/t HITC).\n“He seems to come into games, no matter what happens, he is going to get the blame for it.\n“You put him into a game like that, with an Arsenal coming off a Porto loss and having to get it right at home. They are going to be under a lot of pressure.\n“Newcastle, like you said they do look tired, compared to an Arsenal side that look like they are full of energy and a goalkeeper who is going to be under a lot of pressure.\n“Unfortunately for him, there isn’t much he could have done about those goals, that’s the way it is.”\nNewcastle goalkeeper situation could remain\nIt isn’t clear how quickly Martin Dubravka will be back in the side, and looking more longer term, whether the arrangement with Karius still works for both parties.\nCurrently, the custodian has made just one appearance this season, per WhoScored, to go with the solitary appearance made last season.\nEven if he were a little rusty coming into the side, is it any wonder with so little games over the past couple of seasons…",
  "word_count": 337,
  "scraped_at": "2026-02-14T02:13:34.136220",
  "_text_extracted": true
}