{
  "article_id": "c683e43ab9c4",
  "url": "https://www.teamtalk.com/manchester-united/ten-hag-under-threat-man-utd-ratcliffe-closes-in-coup-appointment-sweeping-changes",
  "title": "Ten Hag  under threat  at Man Utd as Ratcliffe closes in on  coup  appointment amid sweeping changes",
  "date": "20240216T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nTen Hag ‘under threat’ at Man Utd as Ratcliffe closes in on ‘coup’ appointment amid sweeping changes\nNew Manchester United chief Sir Jim Ratcliffe is edging closer to the capture of Dan Ashworth, and the move will reportedly see Erik ten Hag come ‘under threat’ as manager.\nTen Hag has been in charge of Man Utd since July 2022. Since then he has helped the Red Devils win the League Cup, reach an FA Cup final and return to the Champions League, as they finished third in the Premier League last season.\nWhile Ten Hag’s main focus is matters on the pitch, he has also taken a role in several other aspects of the club, including transfers.\nBut with Ratcliffe purchasing a 25 per cent stake in Man Utd from the Glazers, Ten Hag’s role will soon be significantly reduced.\nRatcliffe, along with performance director Sir Dave Brailsford, wants to instil an entire new hierarchy at Man Utd to help them get back to the summit of English and European football.\nCEO Richard Arnold left at the end of last year and has been succeeded by former Man City chief Omar Berrada, while director of football John Murtough is also at serious risk of being replaced.\nDON’T MISS: Frenkie de Jong to Man Utd takes big step forward with Mason Greenwood one of four offered in swap deal\nRatcliffe and Brailsford have identified Ashworth, currently sporting director at Newcastle United, to lead Man Utd’s football operations in the long run.\nShould Ashworth officially join Man Utd, then he wants Sam Jewell to work under him as head of recruitment. The pair previously built up a fantastic reputation together at Brighton.\nErik ten Hag ‘under threat’ at Man Utd – report\nFootball Insider have now provided an update on Ashworth’s plans for Man Utd. They state that while Ten Hag will be safe in his job until the end of the season, a big change could be coming over the summer.\nThe Dutchman is ‘under threat’ of being replaced by a truly elite manager who can get Man Utd challenging the likes of Liverpool, Manchester City and Arsenal.\nThe report does not mention who Ashworth’s ideal target to replace Ten Hag is, though that information will probably emerge in the coming weeks.\nAhead of Newcastle’s home clash against Bournemouth on Saturday, Eddie Howe was quizzed on Ashworth’s possible exit, with the move labelled a ‘significant coup’ for Man Utd.\nWhen asked if there is worry at Newcastle that Ashworth will take inside knowledge to Man Utd, the manager responded: “Your concerns are relevant.\n“I don’t know quite how much I can say on that, but I share your feelings.”\nOn Ashworth being privy to Newcastle’s transfer plans, Howe continued: “Yes, and that’s why I say he’s in a position of power, with a lot of intelligence and information. That’s why it’s a slightly unusual situation.”\nHowe was then asked if the 52-year-old has said he wants to remain at Newcastle amid Man Utd’s interest. “No. Whatever happens, I think we want a quick resolution. It’s better for everybody if that’s the case,” Howe replied.",
  "word_count": 529,
  "scraped_at": "2026-02-14T01:56:44.629059",
  "_text_extracted": true
}