{
  "article_id": "c6901074eff7",
  "url": "https://www.knopnews2.com/2023/08/30/its-volleyball-day-nebraska/",
  "title": "It Volleyball Day in Nebraska",
  "date": "20230830T164500Z",
  "domain": "knopnews2.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Volleyball Day in Nebraska sets new world record attendance for women’s sporting event\nLINCOLN, Neb. (KOLN) - It’s a historic day for Nebraska and women’s sports. Nebraska set the world record attendance for a women’s sporting event with 92,003 in attendance for the Nebraska vs. UNO match Wednesday evening.\nThe iconic Memorial Stadium was transformed from a football field to a volleyball court for Volleyball Day in Nebraska.\n“There is a lot of satisfaction in that to know it’s not me, it’s a celebration of Nebraska volleyball at all levels in this state and we took a chance in playing in Memorial Stadium and to go for the record and break it. So not only did we make a statement to everyone else that we want the record and we did it to the world and so it feels like a great accomplishment for this sport called volleyball played by the women of Nebraska it’s a state treasure and we just proved it,” Nebraska Head Coach John Cook said.\nThe previous world record attendance for a women’s sporting event was 91,648 for the Barcelona vs. Wolfsburg UEFA Champions League match on April 22, 2022 at Camp Nou in Barcelona, Spain.\nThe Huskers also broke other records including the American record attendance, the largest-ever crowd for any NCAA volleyball match and the largest NCAA volleyball regular-season attendance.\nThe American record attendance for a women’s sporting event was 90,185 for the USA vs. China FIFA World Cup final on July 10, 1999 at the Rose Bowl in Pasadena, Calif.\nThe largest-ever crowd for any NCAA volleyball match was 18,755 when Nebraska played Wisconsin on Dec. 18, 2021 in the NCAA Final at Nationwide Arena in Columbus, Ohio.\nThe largest NCAA volleyball regular-season attendance was 16,833 when Wisconsin hosted Florida at the Kohl Center in Madison, Wis., on Sept. 16, 2022.\nFollowing the doubleheader, Country music artist Scotty McCreery will perform at Memorial Stadium.\nThe festivities kicked off Wednesday morning at the Nebraska Coliseum, with the Huskers and school sponsor Adidas hosting a pep rally, allowing the fans to interact with the coaches and players before sending them off to Memorial Stadium.\nVolleyball Day in Nebraska coverage\nCopyright 2023 KOLN. All rights reserved.",
  "word_count": 370,
  "scraped_at": "2026-02-14T02:13:11.437869",
  "_text_extracted": true
}