{
  "article_id": "c6aaa6183dd4",
  "url": "https://www.teamtalk.com/manchester-united/mason-greenwood-man-utd-loanee-reaches-stunning-decision-on-future-getafe-issue-ratcliffe-demand",
  "title": "Mason Greenwood : Man Utd loanee reaches stunning decision on future as Getafe issue Ratcliffe demand",
  "date": "20240224T133000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMason Greenwood: Man Utd loanee reaches stunning decision on future as Getafe issue Ratcliffe demand\nSir Jim Ratcliffe has been challenged by Getafe president Angel Torres over Mason Greenwood amid claims the forward has reached a shock verdict on his future and in a somewhat-futile effort to turn up the dial on the new Manchester United chief.\nGreenwood has not played for Manchester United in over two years following his arrest for attempted rape, controlling and coercive behaviour and assault occasioning actual bodily harm. And while those charges were ultimately dropped by the Crown Prosection Service in February 2023 following the withdrawal of a key witness, it was still deemed best that the 22-year-old continued his career elsewhere.\nAfter a protracted summer transfer battle, the once-capped England international was allowed to leave for Getafe, whom he joined on a season-long loan deal.\nDespite the controversy around his arrival, the LaLiga minnows greeted the player with incredible enthusiasm and amid claims weeks into his arrival that the Bradford-born player was already being considered as their GOAT.\nTo be fair to Greenwood, he has not disappointed since the move; settling quickly both in the Spanish lifestyle and keen to make up for lost time following his lengthy spell out of the limelight.\nDON’T MISS ~ Mason Greenwood: Man Utd return chances reviewed as Real Madrid lurk and Getafe transfer chances are assessed\nSo far, Greenwood has managed an impressive seven goals and five assists from 24 appearances; form which has alerted the likes of Barcelona and Atletico Madrid to his potential signature on a relative-bargain transfer.\nThere has also been suggestions that Greenwood may yet have a future at United, and while any return would be deeemd hugely-controversial, it’s claimed it’s one manager Erik ten Hag would be behind, especially given doubts over the future of alternatives Antony and Jadon Sancho.\nMason Greenwood makes shock decision on Man Utd future\nHowever, according to Getafe chief Torres, Greenwood has indicated to him his desire to remain where he is beyond the end of the current season and would like his club to negotiate terms to either extend his stay on loan for a second season, or potentially even sign him permanently.\nEither situation would be difficult for Getafe to negotiate. The Spanish minnows’ record transfer currently stands at a lowly €11.8m (for Marc Cucurella in summer 2020), while United reportedly value Greenwood at near the €40m mark.\nFurthermore, with his deal at United due to expire in summer 2025, the club knows this summer represents their last chance to negotiate a big-money sale.\nAs such, any loan arrangement would need the Red Devils to first agree to an extension to the player’s contract at Old Trafford in order to protect his valuation.\nRegardless of what the future holds, Torres is now trying to turn the heat up on Ratcliffe to make a decision on the player’s future after making it clear he believes that he intends to stay.\n“He has a clear conscience, he is very comfortable and crazy about staying another year,” Torres told Spanish radio station Cope. “It’s a matter that they [United] have to decide. There is new ownership. They have to decide.\n“In Spain, he has a market but they [Barcelona] have money. Barca’s way of playing would suit him well but it depends on Manchester United. If it’s true, he’ll tell me.”\nRatcliffe has his say on Greenwood future\nDespite Torres’ attempts to turn the heat up on Ratcliffe, the British billionaire is unlikely to be influenced and will instead hold his own internal review into the player’s future and what is best for United as a way forward.\nThe 71-year-old – whose £1.4bn investment into 27.7% of the club will grant him full sporting control – has already discussed the player’s future after the announcement of his purchase into United was confirmed earlier this week.\n“He’s a Manchester United footballer, so we are in charge of football. So the answer is, ‘Yeah, we have to make decisions’. It’s quite clear we have to make a decision. There is no decision that’s been made. He’s on loan obviously, but he’s not the only one. We’ve got one or two footballers that we have to deal with and we have to make a decision, so we will do that.\n“The process will be: understand the facts, not the hype, and then try and come to fair decision on the basis of values, which is basically is he a good guy or not? Could he play sincerely for Manchester United well, would we be comfortable with it and would the fans be comfortable with it?”\nGreenwood has scored 35 times in 129 appearances for the Red Devils since debuting in a March 2019 Champions League tie against PSG.\nREAD MORE: Ten Hag takes shot at mega-money signing Man Utd are prepared to incur eye-watering loss on",
  "word_count": 822,
  "scraped_at": "2026-02-14T01:56:44.619973",
  "_text_extracted": true
}