{
  "article_id": "c6b300d3fe04",
  "url": "https://www.caughtoffside.com/2025/04/18/chelsea-well-placed-sign-serhou-guirassy/",
  "title": "Chelsea well - placed to sign Serhou Guirassy this summer",
  "date": "20250418T103000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are interested in improving their attacking unit with the signing of the Borussia Dortmund striker Serhou Guirassy in the summer.\nThe 29-year-old Guinea international has established himself as one of the best strikers in European football, and he has been outstanding for the German club this season. Guirassy has 28 goals and eight assists in all competitions, but his performances in the Champions League have been splendid.\nHe has picked up 13 goals and five assists in 14 Champions League games this season. He helped Dortmund make it to the Quarter-finals of the competition as well.\nNaturally, there is a lot of interest in the player and clubs like AC Milan and Juventus are keen on him. However, Maurizio Russo has claimed that Chelsea are best-placed to sign the player, and he could be heading to the Premier League.\nChelsea wanted to sign the player before he joined Dortmund as well.\nSerhou Guirassy would improve Chelsea\nGuirassy has a £60 million exit clause in his contract, and it remains to be seen whether Chelsea are prepared to pay up. They have the financial muscle to pay a premium for the striker. It is no secret that they need to improve their squad, and signing a reliable goal-scorer would be a wise decision.\nGuirassy is at the peak of his powers, and he will look to hit the ground running in the Premier League. He could compete with Nicolas Jackson for the starting spot. More competition for places will help Chelsea improve as a team.\nThey will be hoping to fight for the league title in the coming seasons, and they need quality players at their disposal. The Bundesliga striker is a proven performer at the highest level, and he could succeed in the Premier League as well. It remains to be seen how the situation unfolds.",
  "word_count": 307,
  "scraped_at": "2026-02-14T01:52:20.896776",
  "_text_extracted": true
}