{
  "article_id": "c6b960cb1f60",
  "url": "https://playingfor90.com/real-madrid-waited-too-long-and-arsenal-just-closed-the-deal-first-01jxd42wy5wn",
  "title": "Real Madrid waited too long and Arsenal just closed the deal first",
  "date": "20250611T000000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Martín Zubimendi is not coming to Real Madrid. The Real Sociedad midfielder has already tendered his contract with Arsenal, and will play for the Gunners during next season. The news, in Spanish newspaper Marca, confirms the fruition of a transfer agreement in effect already even before the fruition of the European season, despite Real Madrid's attempts, in the last minute, for it to be annulled.\nZubimendi is off to London later in the coming weeks and is already scheduled to be with Arsenal's Asian preseason tour. The schedule features the local derby versus Tottenham for this July in Hong Kong.\nReal Madrid arrived too late in the end. The Spanish club only went formally for more forceful action after all the groundwork had been done for them: convincing the player, showing explicit commitment in terms of approach, involving direct input from the boss, and dealing with all the organizational mechanics. Mikel Arteta, directly already in one-to-one discussions, had done his job in taking it over the line. Madrid had stepped into finished contesting instead.\nReal Madrid started behind\nZubimendi's reputation started more and more being linked with Real Madrid after Spain's victory in Euro 2024, with his performances during the tournament being amongst their most consistent ones. Even scored one of the goals for UEFA Nations League, which Spain had clinched on the penalty shoot-out against Portugal\nNaturally, this display had direct repercussions for his market price. Real Madrid, though, dithered too long too. By the time the club's directors had reached a decision, the transfer window had closed.\nLondon sources insisted nothing had altered, and whatever has been agreed is non-negotiable. All talks Zubimendi did with Arsenal and Arteta will remain intact. That includes his role in the camp next month as well as being included in the team immediately. Arsenal did not leave anything on the table, and Zubimendi did not show any signs of wanting there to be a change of heart after already having set his mind on it despite Spanish football's biggest club's last-minute enticement.\nArteta's accomplishment with vision, instead of the badge\nThere is nothing new in Mikel Arteta becoming one of European coaches' young guns. And there is proof of it all over again in this transfer as well. The Spanish manager had his sights set on Zubimendi in the latter stages of the Champions League, after eliminating none other than Real Madrid from the quarterfinals.\nZubimendi was not enticed by Premier League salaries or publicity. The midfield target was drawn by a clear football vision, with a set role in a side that has been becoming more well-stocked season after season. He will be given playing time, responsibility, and visibility on one side that would like to match up against the European giants man-to-man. The opportunity to be reunited with known faces is also important. He will be playing and having the changing room with his former Real Sociedad teammate, Martin Odegaard, and his Spanish international teammate, Merino. The setting aids in easy integration and accelerates his adaptation.",
  "word_count": 506,
  "scraped_at": "2026-02-14T01:58:41.946398",
  "_text_extracted": true
}