{
  "article_id": "c6bba92d51b2",
  "url": "https://www.aol.co.uk/news/secret-payments-rewarding-set-pieces-070000799.html",
  "title": "From secret payments to rewarding set - pieces : How football bonuses have finally evolved",
  "date": "20240818T074500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "From secret payments to rewarding set-pieces: How football bonuses have evolved\nIt will be there at the back of the mind of every footballer in the Premier League, the Championship and beyond this weekend – a unifying factor in the lives of every professional embarking on a new, or relatively new season. From the great names of the game to those who do not fly on private jets. All of them are, one way or another, playing for their bonuses.\nBonuses have been an enduring feature of the game from its earliest professional days. Football has long been a business that regards incentives as critical to motivating its key employees: goal bonuses, win bonuses, appearance bonuses. Curiously the last is a bonus for doing what is effectively one’s job. A reward for overcoming internal competition for game minutes, either from the start or off the bench.\nInfamous stories abound about off-the-books cash being left in players’ boots for discreet collection and managers offering substitutes a few minutes game time in return for a share of their appearance bonuses. There was the allegation that the rules governing bonuses were broken in 2004 when Roman Abramovich decided on impulse to award the Chelsea players who eliminated Arsenal in the Champions League quarter-finals a one-off payment.\nThen bonus schedules had to be registered before the start of the season and could not be subsequently changed, as per integrity rules. Now all such schedules must be registered after the close of the transfer window.\nEither way, for the most part, bonuses were something clubs budgeted for without much thought as to whether they were getting value for money. It was just one of those things they always did. Players had bonuses written into their individual contracts and a share of the player pool. But little of the latter related to the reality that teams found themselves in. What, for example, is a fair reward for a good attacking player who gets very few chances? Why offer big rewards for a top-10 finish when every indicator confirms that it would need a footballing miracle for a team to achieve it?\nBrentford’s bonuses based on data\nFootball moves on slowly from its past, but finally bonuses are being restructured. In the end, the cost of not doing so is too great for a new brand of ownership obliged to count every penny in the new world of profitability and sustainability rule enforcement.\nAt Brentford, players are incentivised around the set-pieces that are so crucial to Thomas Frank’s tactics. The count of set-pieces from which goals are scored and conceded are recorded as their own goal difference. As long as the team stay in the Premier League, a positive set-piece balance is rewarded with a payment per positive goal into the shared pool. It has been suggested that as much as £200,000 per goal is awarded. Brentford declined to comment.\nThe west London club, under the ownership of Matthew Benham, have built their success on putting data at the centre of all their decisions – from playing style to recruitment. They maximise the advantages they have and set-pieces have been identified as an angle they can profit from, according to the profiles of the players in their squad. Why would they not incentivise it?\nFor others it is more complicated. The simplest bonus calculation is league position at the end of the season, which increases by around £3 million for each place. But that is a blunt instrument that does not take into account the very different aspects of each player’s performance relative to his responsibilities. It does not consider the strength of a squad relative to others. Or the strength of the opposition – and which games might be more crucial to win for a team facing a realistic prospect of relegation.\nAt the top, the basic salaries are so huge that bonuses matter less. They are attainable but they have tended to be more about winning the big trophies that are beyond the reach of less wealthy, less habitually successful clubs. Chelsea, for instance, have switched to a lower basic salary package for their younger squad – but with team bonuses for achievements. They do not pay individual goal bonuses.\nTowards the bottom of the table, the advice to clubs from experts is that they need to load bonuses towards the games they win against fellow lower-half sides. They also need to incentivise winning runs that generate momentum, which means a much higher payment for a second win in back-to-back victories and even more for the third and so on.\nFor the really brave clubs, who, like Brentford, are pursuing a certain style of play, there is the possibility of breaking the age-old connection between result and bonus. Indeed some clubs are considering rewards based on performance data and, in particular, the expected goals metric that measures a team’s goal threat relative to the goals they score. That would mean rewarding a striker for doing the things specifically asked of him – for example, runs or pressing – while acknowledging that, through no fault of his own, he may never get a chances to score.\nAnother courageous move is to reward a manager according to his team’s wage bill and transfer spend. It is being talked about in some circles, but comes with its own problems. Might that discourage a manager from spending, given his own bonus would be linked to restricting how much is paid out.\nEither way, it requires a considerable act of faith between players and manager on one side, and the club on the other. Both have to accept the terms of engagement – and, more critically, both have to trust the data.\nAny material changes with bonuses have always been discouraged. The rule of thumb has been that if it confuses players – or, worse still, upsets them – it is best avoided.\nAll that has ever been guaranteed to change is the value of the bonus pool and that it goes up every year. But the game is changing, and those old certainties are changing with it.",
  "word_count": 1018,
  "scraped_at": "2026-02-14T01:51:48.875142",
  "_text_extracted": true
}