{
  "article_id": "c6c1f266d48d",
  "url": "https://www.caughtoffside.com/2025/11/17/confirmed-star-to-leave-west-ham-in-january/",
  "title": "West Ham star Niclas Fullkrug set to leave the club in January",
  "date": "20251117T150000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Niclas Füllkrug’s brief and turbulent spell at West Ham United is drawing to a close, with Fabrizio Romano confirming that the German striker is set to leave the London Stadium when the January transfer window opens.\nAfter just 18 months in East London and a season marred by injuries, inconsistency, and managerial upheaval, the 32-year-old is already searching for his next destination.\nFüllkrug arrived at West Ham in the summer of 2024 with high expectations, following a brilliant season at Borussia Dortmund in which he scored 15 goals and registered 10 assists in 43 appearances, playing a key role in their run to the Champions League final.\nHis combination of experience, link-up play, and physical presence made him an attractive option for the Hammers especially after they lost key attacking players in the months prior.\nHowever, the move never clicked. Two injury layoffs disrupted his first campaign, limiting him to just six Premier League starts and a further 12 substitute appearances.\nNiclas Füllkrug has struggled at West Ham\nThis season has been even more challenging, Füllkrug has played only 385 minutes under the club’s new managerial regime and has fallen completely out of favour with Nuno Espírito Santo, who replaced the dismissed Graham Potter earlier in the campaign.\nSpeaking on his YouTube channel, Fabrizio Romano revealed that both sides are now aligned on the decision to part ways:\n“Let me start with a player who is set to leave his club in this January transfer window, and it’s Niclas Fullkrug. It’s over between West Ham and the German striker.\n“So a difficult, very difficult first part of the season for West Ham in general, with Graham Potter fired with Nuno Espirito Santo [appointed] as the new manager.\n“The players, apart from a few of them, are not performing as expected. One of these players is Niclas Fullkrug, who joined West Ham United one year ago and is now already out of the project.\n“So Fullkrug will leave West Ham in the January transfer window, looking for opportunities. “Looking for the opportunity to be a starter. That’s a very important point for Fullkrug, who wants to play, and who wants to feel comfortable with the new project he is going to pick.\n“There are some possibilities in Germany, some opportunities in Italy. So let’s see what’s going to happen.”\nAccording to Romano, clubs in Germany and Italy have already expressed interest. A return to the Bundesliga, where his profile is well-established, appears a realistic option, while Serie A clubs are monitoring the situation as they search for experienced forwards at reasonable prices.\nFüllkrug’s desire for regular football has become a major factor, especially with international tournaments on the horizon and strong competition within Germany’s forward ranks.\nFüllkrug will be a striker in demand in January\nFor West Ham, Füllkrug’s departure will free up wages, he currently earns around £112,000 per week, and allow the club to reshape their squad in January.\nThe Hammers are expected to explore attacking reinforcements, though their priorities will depend on outgoing player movements and Nuno Espírito Santo’s tactical plans.\nThe move represents a disappointing end to what once looked like a smart signing. Injuries, managerial changes, inconsistent form, and tactical misfits all contributed to Füllkrug’s decline in East London.\nWest Ham’s loss may soon be another club’s gain, Füllkrug is ready for a fresh start, and January will define his next chapter.\nReport: West Ham have verbal agreement with 28-year-old over January transfer",
  "word_count": 577,
  "scraped_at": "2026-02-14T02:03:26.528598",
  "_text_extracted": true
}