{
  "article_id": "c6c33b747ea7",
  "url": "https://www.twtd.co.uk/blogs/22012/pre-season-preview-shakhtar-donetsk",
  "title": "Pre - Season Preview : Shakhtar Donetsk by ad _ wilkin - Ipswich Town Blog",
  "date": "20240718T154500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Written by ad_wilkin on Thursday, 18th Jul 2024 13:38\nOn Saturday 20th July, Town begin their pre-season preparations abroad in Austria with two 60 minute-matches against Ukrainian heavyweights Shakhtar Donetsk.\nLast season Shakhtar secured their third Ukrainian title in a row and 15th in total, beating closest rivals Dynamo Kyiv by two points. They actually wrapped up the league with two games to spare but only got one point in their last two as they rotated the side.\nThey also won the Ukrainian Cup beating Vorskla in the final. Their Champions League group contained Barcelona, Porto and Royal Antwerp, a group in which they ended up finishing third.\nThey beat Antwerp twice and secured a famous 1-0 win against Barcelona in November before being knocked out after a 5-3 thriller with Porto which left Barcelona and Porto on 12 points each to go through.\nBy finishing third, they qualified for the Europa League knockouts. Those games did not go well with a defeat over two legs to Marseille. Part of that could be due to the fact that the winter break in Ukraine runs from the end of December to the end of February so Shakhtar had only played friendlies before going into those two games.\nRegardless of that, they are a quality team who have competed in the Champions League against the top-end opposition that Town will be facing themselves this coming season. That makes them an excellent yardstick to find out how this Town team will cope against Premier League and European opposition.\nThey are currently managed by former Feyenoord assistant coach Marino Pusic. Pusic interestingly has very close ties with Arne Slot whose Liverpool side Ipswich will face in their first Premier League game.\nThis is likely no accident as Pusic will have picked up a lot from Arne Slot and his Shakhtar side will definitely possess some of the same characteristics that Slot is looking to build at Liverpool. It’s Pusic’s first job as the main man and his record currently reads an impressive 21 wins, three draws and five losses putting his win percentage at 72.4%\nFriendly games are impossible to call and the main aim of this camp will be to get fitness and game time into the legs. It’s worth noting that in terms of match time, Shakhtar are ahead of Town in their pre-season preparation with their season kicking off on 3rd August against Vorskla, whereas Ipswich don’t start until a couple of weeks later.\nSo far, the Ukrainians have begun with a 4-1 win against Bosnian side Sarajevo, a draw against Croatian side Hadjuk Split (neither of those featured players who had been at the Euros) and a 1-0 loss to Serbian side Backa Topola.\nA further two games against Rizespor (5-0 victory) and Besiktas (being played Wednesday afternoon) mean they’re already onto their sixth game of pre-season whereas Town are playing their first, so there could be a bit of a difference in terms of match sharpness.\nGoalkeepers\nThe goalkeeping situation is probably the hardest to call with Shakhtar looking to have a stockpile of goalkeepers. There are five of them in their first team squad currently.\nDymtro Riznik is their number one and started 27 of the 30 league matches last season keeping 13 clean sheets. He started the first pre-season game which Shakhtar played on 29th June and was replaced at half-time by Kiril Feysun, who looks to be the man who will compete with him for the number one shirt this season following a loan spell with another Ukrainian team Kolos Kovalvika where he kept 12 clean sheets in 29 games for a side that finished 11th.\nThat form has seen the 21-year-old called up to the Ukrainian U23 side for the tournament in Toulon this summer, but he spent it on the bench as Ukraine lost the final on penalties to the Ivory Coast having been unbeaten in their group.\nAll of that means that fellow 21-year-old and last year's back-up keeper Denys Tvardovskyi might have slipped down the pecking order. His two starts last season came in the last two games after Shakhtar had already wrapped up the league title and he conceded three goals in those two games ,which won’t have helped his chances. He stands tall at 6ft 7in and a bit. Not quite Tomas Holy height but not far off.\nThe other two members of that goalkeeping unit are Tymur Puzankov (21 years old) and Denys Barchenko (20 years old) who have occupied bench spots for the odd game without making a first team appearance yet.\nDefence\nThe first man in this list could be familiar to Football Manager players. Vinicuis Tobias is a Brazilian wonderkid who joined Shakhtar from Internacional in January 2022, however, given the situation in Ukraine at the time with football stopped, he was loaned out to Real Madrid of all places.\nThat loan was extended in the 2023/24 season for a €500,000 loan fee but that has now expired and he looks to be back and plying his trade in the Ukrainian League once again as Madrid have chosen not to take their €10 million option to buy him permanently.\nDuring his time at Madrid he made the bench for the first team in the Copa Del Rey without getting on the pitch and spent the majority of his time playing for Real Madrid Castilla (Madrid’s B team). He looks set to stay with Shakhtar this season and has featured heavily in pre-season friendlies, so far scoring an excellent goal against Rizespor, drifting into the pitch, receiving a lovely lay-off and slotting left-footed past the keeper after beating a couple of defenders.\nHis competition for the right-back spot will be with Ukrainian international Yukhym Konoplia (15 caps) and Georgian international Giorgi Gocholeishvili (eight caps). The pair shared minutes in the right-back slot last season and have both been at Euro 2024 without getting too much game time. Both are very much defensive right-backs with just two goals contributions in the league between them last season.\nIn central defence two Ukrainian internationals Valeriy Bondar and Mykola Matviyenko will likely form the main defensive pairing. Both went away to the Euros with Ukraine with Matviyenko one of the standout performers captaining his country in the 0-0 draw with Belgium. Both players have been with Shakhtar their entire career and have 303 combined appearances so they’re certain to know each other's games inside out by now.\nThey have two home grown back-ups in Roman Savchenko and Maryan Faryna who were both also playing Ukrainian Premier League football last season on loan at Oleksandria (who finished eighth) and Metalist 1925 (who finished bottom) respectively.\nIt’s also possible that this friendly could be used to give new defensive signing Alaa Ghram some game time. The Tunisia international defender joined this summer in a €2 million deal from CS Sfaxian. He has three caps for Tunisia having made his debut in March 2023.\nThe other centre-back on the books is 21-year-old Israeli Stav Lemkin, who started against Porto in the Champions League but only made one league start last season.\nMoving across to left-back and another Georgian makes an appearance. Irakli Azarovi was Shakhtar’s first choice last season with 18 league starts and an impressive performance in the Ukrainian Cup final where he was incredibly influential, making three key passes and coming away with an assist . He has 18 caps for Georgia but lost his place to Cremonese’s Luka Lochoshvili and missed out on a place in the Euro’s squad.\nHis form has meant that another young Brazilian, Pedrinho, has had to settle for limited game time. The 21-year-old made nine league appearances, six of which were starts and got 13 minutes off the bench in the Europa League against Marseille.\nIn the recent friendly gainst Rizespor both him and Tobias were playing very advanced and he definitely brings more attacking attributes than Azarovi as he has more pace to get back and cover if needed.\nMidfield\nShakhtar operate in a 4-5-1 or 4-3-3 depending on the game situation. Usually, the central three will be made up of one defensive midfielder and two more attacking players.\nWhen they play a more defensive five then Taras Stepanenko tends to be the go-to. The 34-year-old is Ukraine’s ninth highest-appearance maker, ahead of the likes of Sergei Rebrov, Andrei Voronin and Oleksander Zinchenko. He has 85 caps for his country and was once again involved for them in the Euros.\nIn his club career he has been at Shakhtar since 2010, notching up 424 appearances, 28 goals, 25 assists and ten league titles. His role is very much to sweep up and protect his backline as is shown by his zero goal contributions last season. However, three interceptions and 6.8 ball recoveries per game are impressive stats and show what his game is all about, screening the backline and breaking up play.\nThe closest to his style of play in the squad is Yehor Nazaryna who is very much a back-up option in the squad. He made 20 appearances last season and only six of them were starts but with Stepanenko winding down he’ll hope to get more starts next season.\nA good performance against Town could do him a world of good as he looks to build on a decent pre-season so far, covering at centre-back whilst the rest of the squad were still recovering from the Euros and then scoring from a more advanced midfield role in the friendly against Rizespor.\nNazaryna’s six starts were largely due to the fact that when Stepanenko didn’t play Dymytro Kryskiv filled that role. More versatile that the two previously mentioned, the 23-year-old is more of a box-to-box player and capable of playing in all of the midfield roles as and when required.\nHe started the season in a more advance position scoring a brace against Kryvbas, who coincidentally four of his five league goals came against last season, with another brace in the reverse fixture. He was moved deeper following January additions and proved adept in that role as well.\nNew signing Bartol Franjic could also be used in the holding role and looks likely to provide more cover for the ageing Stepanenko. He joins on loan from Bundesliga side Wolfsburg following a loan spell at fellow Bundesliga side Darmstadt.\nThe 24-year-old Croat doesn’t have that much experience with last season his first real taste of football following 82 appearances at Dynamo Zagreb so he’s a bit of an unknown and could well be used as a utility player like Kryskiv as he’s also able to fill in at centre-back and left-back.\nA large part of Kryskiv’s move further back was due to the addition of 20-year-old Brazilian Marlon Gomes in January. Signed from Vasco de Gama for €12 million, the attacking midfielder was slowly introduced into the team and given the structure of the Ukrainian season only managed 11 league games, four of which were starts.\nIn that time, he scored four goals the undoubted highlight being a hat-trick against Chornomorets. His first was a lovely flicked header at the near post following a fierce in-swinging corner as Shakhtar made a fast start in the second minute of the game.\nShakhtar then conceded but Gomes was at it again in the 15th minute as a firmly struck shot was parried back out to him, he made no mistake slamming the follow up into the roof of the net having been lurking in the box.\nThe third goal was the best of the lot. A Sudakov free-kick curled off the inside of the post and managed to bounce all the way back to the edge of the area where Marlon Gomes was waiting to strike a crisp volley into the top right hand corner.\nThere were shades of Massimo Luongo against Blackburn as he struck across the ball with the outside of his boot and the ball flew into the back of the net, off of the crossbar to complete a first half hat-trick.\nHis competition in those more advanced midfield positions are two homegrown players in 23-year-old Artem Bondarenko and 21-year-old Georgiy Sudakov. Bondarenko scored four in 21 games and Sudakov netted six in 23.\nBoth had good seasons but it’s Sudakov who is the one to watch out of the two. He’s an excellent dribbler and drives with the ball through the middle of the pitch. He’s comfortable with both feet and very composed on the ball with ability to turn defenders inside out.\nHis performance against Chornomorets in the Ukrainian Cup demonstrates that with two fine solo goals. For both he picked up the ball deep and drove into the box, slotting one in from the edge of the area and producing a lovely chop to sit down a defender and calmly side foot home for the other.\nHe’s also capable of drifting into the half space on the left side of midfield and delivering dangerous crosses with either foot. His form towards the end of the season was excellent with three goals and an assist in his last four league games. That form continued in the Euros warm-up with two assists and a goal against Moldova.\nHe was unable to score in the Euros themselves but like a lot of Ukraine players put in a very good performance in their last group game against Belgium with two key passes and three shots on target.\nHaving seen the likes of Zinchenko, Mykolenko and Mudryk get Premier League moves in recent times, he’ll hope to continue his good form and try and get a big European move himself.\nI've already mentioned Pedrinho, he’s the left-back. To make things a nightmare for commentators Shakhtar also have another Pedrinho, this time a midfielder. He’s spent the last two seasons on loan at Atletico Minerio in his home country Brazil but is another who is back and looks set to play a part in the squad this season in the advanced midfield role. He only scored two goals in 58 appearances in that loan spell so will be hoping to find the net a bit more often on his return to Ukraine.\nMoving onto the wings and Shaktar’s threat comes from a combination of two Ukrainians and three young Brazilians. Of those five, it’s the experienced Ukrainian Oleksandr Zubkov who’s had the best season ranking as the best player in the Ukrainian Premier League, according to Sofascore.com with a ranking of 7.96.\nHe’s had an interesting career path, coming through the Shakthar youth set-up before being loaned to Ferencvaros in 2019, making that loan permanent in 2020 for a fee of €1 million before returning to Shakhtar in 2022 for double that amount.\nThat investment has paid off as the left-footed right-winger has been a mainstay in the Shakhtar team with five goals and five assists in the league as well as assists against Marseille, Porto and Antwerp in Europe.\nHe’s another who made the Ukrainian Euros squad but only got 23 minutes in the 2-1 win against Slovakia, largely due to the fact that he has Andriy Yarmalenko ahead of him in his position. He loves a chop onto his favoured left foot to either open up a shot or to sneak a reverse pass in to the overlapping midfielder or full-back.\nInverted wingers is very much how Pusic likes his team to play, which means the back-up on the right wing is another left-footed Ukrainian Marian Shved. The 26-year-old began his career in Ukraine with Karpaty Lviv before a spell in Scotland with Celtic where he only made three appearances and was loaned back to Karpaty before another loan spell with Belgian side KV Mechelen.\nHis 23 goals in 57 appearances for Karparty were enough for Shakhtar to see his potential and bring him back to Ukraine a year after he join Mechelen permanently. Despite not playing regularly, he still has seven goals in 31 appearances and provides reliable back-up on the right-hand side.\nThe left wing by contrast looks like someone who is still learning the scouting system on Football Manager has been put in charge and has searched for Brazilian wonderkids but can’t figure out how to take the left-wing filter off.\nShakhtar have three right-footed left wingers, all from Brazil, all between the ages of 18-21. Kevin is the most played of the three. Signed from Palmeiras he made 14 league appearances, contributing three goals and four assists having joined in January and secured the starting berth.\nPrior to that, Newerton Palmeres (signed from Sao Paulo) was in possession of the shirt but he only contributed one goal and one assist in his 15 league games whilst also failing to register either a goal or assist in his four Champions League appearances.\nEguinaldo is the third in the group and made the least league starts with just one and a further 13 substitute appearances but did make the most impact. On top of his two league goals, he also scored against Porto in the Champions League and netted once against Marseille in two rare Europa League starts.\nHe scored in Shakhtar’s first pre-season friendly against Sarajevo with a close-range finish and will definitely be looking to push Kevin for that starting berth coming into this season.\nThere’s potential he may also be used in a more fluid front four as he started as more of a false nine in the pre-season friendly against Rizespor.\nStrikers\nAll of that leaves two out and out strikers. Lassina Traore burst onto the scene with Ajax in the 2020/21 season with some strong Champions League performances and seven goals and six assists in 12 Eredivise appearances.\nHe was linked with a number of big clubs so it was perhaps a surprise when he moved to Shakhtar for €8 million in July 2021. Despite committing a kit crime by wearing the number two, he’s netted a reasonable goal return of 19 goals in 65 appearances.\nHe missed a large chunk of last season, including all of the Champions League group stage with a tendon tear and was reintroduced carefully, meaning he’ll come into this season looking to prove he can recapture his old form.\nIn his absence, Danylo Sikan filled the void and filled it so impressively that Traore will definitely have competition on his hands to reclaim his place.\nSikan scored 10 goals in the league and another couple in the cup. The 23-year-old's form didn’t merit a call-up to the national team but he was called up for the U23 tournament in Toulon. Both Sikan and Traore were on target in their first pre-season friendly against Sarajevo and it’s likely that Town will face each of them in their two games in Austria.\nStyle of Play\nThere is actually very little data that exists on the Ukrainian League so I couldn’t go to my regular sources for this one. Instead, I spent time watching highlights on YouTube.\nWhat was immediately apparent was that it’s going to be hard to judge the goalkeepers as they rarely face that many shots for a Shakhtar team that are dominant in possession.Dynamo Kyiv were the most competitive games with Riznik producing a couple of excellent stops in that one.\nDefensively, Shakhtar like to keep a solid base. The centre-backs don’t come too far forward and the full-backs will advance past the halfway line but no further than that, which is illustrated by no full-back getting more than one goal contribution last season. That said, in the friendly games so far Vincius Tobias and Pedrinho look to have been a lot more attacking and progressive than Konoplya and Azarovi last season.\nWith one sitting number six, they form a solid base and it’s left to the five players in front of them to make the movement and create the spaces.\nConsidering how few attempts there are on the Shakhtar goal they do seem happy to concede possession at times and a lot of their goals come from well-executed counter attacks. Both wingers and the centre forwards (particularly Sikan) like to run in behind.\nWith the wingers inverted and the full-backs not pushing forward, you might think they don’t create much width. However, that is where the unique profile of Sudakov comes in. He is naturally ambidextrous and extremely comfortable with both his left a right foot.\nPlaying in a more advanced ‘eight’ role, he is given the freedom to pick the ball up deep and drive into the box as mentioned previously. But it’s when Shakhtar build up in possession that his other attributes come into play. With the wingers looking to come inside, Sudakov will drift outside and is an expert at delivering balls into the box from the pull back cross area (imagine a winger bombs forward, can’t get a cross in and has to play it back to an advancing full-back, that’s the area I'm on about).\nOne other thing that came across from watching them is that they love a shot from range. Every single highlight package had at least two occasions the ball fell to a player on the edge of the box and they blasted it. Not one of them found the back of the net. Ninety per cent of them failed to test the keeper (that’s not an actual stat).\nThe Teams\nWith two games back-to-back it’s likely we’ll be seeing at very least 22 players with some youngsters being given minutes late on. The only question is whether the two managers will split them into a first and second XI or mix and match and have two half and half sides. I think it’ll be the latter an I've had a go at picking what they could look like.\nNew Signings\nThis will be the first time Town fans will get to see a host of new signings. Everyone knows about Omari Hutchinson but what can Town expect from the rest.\nBen Johnson joins as the most experienced Premier League player in the squad with 69 appearances. Axel Tuanzebe is the only other player in the squad that got promoted from the Championship with Premier League experience, so that could prove very valuable.\nHis other asset is his versatility, despite being a natural right-back he has also filled in at centre-back and left-back in his time at West Ham. He’s strong, athletic and quick to close down and will bring a passing range that is an upgrade on Harry Clarke.\nThe clipped ball over the top to Wes Burns is something he has in his locker but also look out for him playing a cross-field switch to Leif Davis on the alternate flank at times, something he did once every other game in his time in a West Ham shirt. His ball recovery stats are also incredibly impressive with an average of 7.94 recoveries per game.\nJacob Greaves is the perfect centre-back for a Kieran McKenna team and his stats for last season are outstanding. He was named in the Championship Team of the Season and is just 23 years of age. He’s comfortable on the ball making the eighth most passes for a defender in the league, ahead of Cameron Burgess (13th) and Luke Woolfenden (15th).\nHe also completed more dribbles than the Ipswich pair, although some of those were when he was covering at left-back. Defensively he won more duels than any other defender with a win rate of 69%. Burgess won 71% of his but got involved in on average two per game fewer.\nThe thing that stood out most when looking at his stats was the percentage of tackles that he made in the midfield third of the pitch compared to the defensive third with 44% of his tackles made in midfield, which shows how aggressive his press was compared to Woolfenden, who only made 16% of his tackles in the midfield third.\nLiam Delap is the third on the list who is a versatile signing. He played 19 games as a centre forward for Hull last season with a further eight on the right wing. He’s likely to cover both of those positions once again in McKenna’s squad.\nHe has the athleticism and ball-carrying ability to compete with Wes Burns on the right wing but also has an eye for goal as was proved in the 3-3 draw with Town at the MKM stadium where his excellent movement saw him get to the near post to sweep home Hull’s second.\nI don’t expect him to play in the same team as Burns too much. Even as a striker he has a tendency to drift right which will create space for Hutchinson to cut inside if the two play together.\nHis ability to take people on and dribble out of tights spaces will also be very handy for moments where Town are suffering and don’t have much of the ball, something that will definitely be more of an occurrence in the Premier League compared to the Championship.\nPlease report offensive, libellous or inappropriate posts by using the links provided.",
  "word_count": 4181,
  "scraped_at": "2026-02-14T01:48:56.592927",
  "_text_extracted": true
}