{
  "article_id": "c7027f6b30cd",
  "url": "https://www.justarsenal.com/we-got-eaten-a-little-saliba-reflects-on-first-leg-defeat-to-psg/391513",
  "title": "  We got eaten a little  Saliba reflects on first leg defeat to PSG",
  "date": "20250430T210000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "William Saliba has admitted that Arsenal’s poor start to their Champions League semi-final first leg against Paris Saint-Germain was costly and ultimately decided the outcome of the match. The Gunners conceded just four minutes into the game at the Emirates Stadium and were unable to recover as the visitors held on for a narrow 1-0 win.\nPSG executed their game plan to perfection, taking an early lead and unsettling Arsenal in the opening stages. The French side defended well throughout and disrupted many of Arsenal’s attacking efforts, leaving Mikel Arteta’s men frustrated in front of their home crowd.\nArsenal now faces a huge task in the return leg at the Parc des Princes. While they will take confidence from their previous away win in Madrid, they know a similar slow start cannot be repeated in Paris if they are to reach the final.\nSpeaking after the match, Saliba reflected on the team’s performance and outlined the challenges ahead, as quoted by Metro Football.\n“We suffered a lot in the first 20 minutes. We played better in the second half. The tie isn’t over, we hope to win at the Parc des Princes. We weren’t surprised by PSG, we knew they were a strong team. We got eaten a little at the start, we played badly. We must not give up; a lot of things can happen. Dembele is everywhere, he’s moving around a lot. It’s difficult to mark him. We can do better with the first goal. We’ll take the positives and go beat them there. We’ll have to show that we have character.”\nIt has been a difficult campaign for Arsenal in some respects, but their European run remains alive, and the team has shown it can respond to adversity. Fans will hope the players can rise to the occasion in Paris and deliver a performance worthy of a place in the final.\n______________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 389,
  "scraped_at": "2026-02-14T02:09:01.847234",
  "_text_extracted": true
}