{
  "article_id": "c70ca230996c",
  "url": "https://www.themag.co.uk/2023/04/john-aldridge-panicking-as-he-sees-newcastle-united-now-overtaking-liverpool/",
  "title": "John Aldridge panicking as he sees Newcastle United now overtaking Liverpool",
  "date": "20230425T134500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Aldridge panicking as he sees Newcastle United now overtaking Liverpool\nJohn Aldridge has been talking about Newcastle United.\nThe former Liverpool star reacting to the 6-1 hammering of Tottenham.\nThat result for many neutrals, seemingly now rubber stamping the fact that Newcastle United are now a team / club that needs to be taken very seriously.\nJohn Aldridge panicking as he sees Liverpool in the process of potentially being overtaken, as Newcastle get stronger and stronger.\nThe one-time Anfield star saying that ‘This is only the start…’ for Newcastle United and stating how this has left ‘concerned’ Liverpool supporters watching on.\nBefore you read below what John Aldridge has now said today, interesting to compare it to what the ex-Liverpool star was saying five years ago about the plight of Newcastle United under the stranglehold of Mike Ashley.\nJohn Aldridge saying this on 26 December 2018 just hours before Liverpool hammered Newcastle United 4-0 at Anfield, a game incidentally that saw the Premier League debut of Sean Longstaff as a sub:\nBenitez will argue he has no choice other than to park the bus and try to keep the score down at Anfield against the Premier League leaders and believe it or not, I reckon he would be happy to get out of this game with a 2-0 defeat.\nHe’s working with very limited resources at Newcastle and has done a good job to keep them in the Premier League. But I find the negativity he employs in the games against the top six to be a little over the top.\nLiverpool beat Newcastle at Anfield last March despite Benitez deploying a flat back ten in a bid to stop the home side and I remember him telling the media after the 2-0 defeat that he tried to change things and show more ambition when his side fell behind.\nWell, I was at that game and all he did when Newcastle were trailing is make changes designed to ensure his team were not overwhelmed – as he sees these kind of games as crucial in protecting his side’s goal difference. A heavy defeat at Anfield could mean Newcastle end up going down by a goal or two on the final day of the season, so Benitez has to do what he feels he needs to in a bid to survive in the Premier League.\nIt can be frustrating to watch a match featuring just one team trying to win, but I would back Jurgen Klopp’s team to get the job done in what may be a scrappy affair.\nForget the Arsenal and Manchester City games for now and make sure that Liverpool old boy Rafa Benitez does not succeed in his attempt to ruin a game of football at Anfield today.’\nWell, moving forward to the here and now and it is a very different Newcastle United.\nAs John Aldridge indicated back then, Rafa Benitez faced a near impossible job under Mike Ashley, simply a case of trying to survive on very limited levels of investment. Indeed, in the three years he was manager at Newcastle United, Rafa saw zero net investment in the playing squad as Ashley reneged on promises he had made when Benitez agreed to sign a three year deal in summer 2016 when Newcastle United were a Championship club,\nJohn Aldridge talked of Rafa Benitez and Newcastle United ‘ruining’ football.\nWell, the only thing Newcastle United were ruining on Sunday was the fragile egos of everybody associated with Tottenham!\nPlus, in the aftermath, now clearly ruining the complacency that many of the self-entitled ‘big’ six may still have had, when still believing that Newcastle United might not prove to be the threat they had feared…\nJohn Aldridge speaking to the Liverpool Echo – 25 April 2023:\n“Newcastle United appear to be heading in only one direction.\n“Their comprehensive win at the expense of Tottenham Hotspur was absolutely staggering to watch and has, understandably, left some Liverpool supporters concerned of the levels they could reach in the years to come.\n“This is just the start for Newcastle and they are going to improve, of course they will.\n“If they get into the Champions League for next season, they are going to have a lot of money to spend.\n“Their owners are wealthier than Manchester City’s so, if they get into Europe, I expect they will spend really big.\n“Eddie Howe has done a great job, but Newcastle will go out and get one of the best managers in the world should they decide he no longer is the right person for the job at any point.\n“They are going to be a force to be reckoned with in the years to come, make no mistake about it.\n“While other teams have undoubtedly improved, that hasn’t been the case with Liverpool for whatever reason. We still have a really strong squad, but we’re going to be in transition for the next couple of years due to certain big players getting old. We have to see what happens in the summer, too, we don’t know what the plan is.\n“It shouldn’t take us long to get back to competing for the biggest prizes because we shouldn’t be where we are with the squad we have. It seems to be more of a mental issue that has been holding this team back during the current season.”\nI had to laugh when I looked at this John Aldridge piece on the Liverpool Echo, as only one of their fans had commented and said this: ‘Yet again money talks. Like Man City, Newcastle can now buy their way to the top.’\nAs I say, you have to laugh.\nIn my lifetime, Liverpool have done nothing but buy success.\nFor Newcastle United this has been especially the case.\nLiverpool using their financial muscle to build team after team and take the best players off other clubs, for NUFC we have seen the likes of Alan Kennedy, Terry McDermott, Peter Beardsley, Didi Hamann, Andy Carroll, Jose Enrique, Gini Wijnaldum and no doubts others I have missed.\nLeicester City are the exception to the rule in the Premier League era and they have never reached top four again after their shock title win.\nAll of the clubs who have become established (until now…) at the top in the Premier League have done it through spending huge amounts of cash in the transfer market. Liverpool very much one of those clubs.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1090,
  "scraped_at": "2026-02-14T01:55:54.936299",
  "_text_extracted": true
}