{
  "article_id": "c70eb9e927b1",
  "url": "https://www.irontontribune.com/2023/08/30/latest-news-from-around-the-big-ten/",
  "title": "Latest news from around the Big Ten - The Tribune",
  "date": "20230831T000000Z",
  "domain": "irontontribune.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest news from around the Big Ten\nPublished 7:37 pm Wednesday, August 30, 2023\nUNDATED (AP) — The Big Ten’s prestige and power has been firmly grounded in the East Division with all nine conference champions in the current format and eight participants in the College Football Playoff. The West Division has been the place to be for competitive balance with four different winners in the last four years. That makes this season a unique opportunity for Illinois, Iowa, Minnesota, Nebraska, Northwestern, Purdue and Wisconsin and their inviting path to the Big Ten title game. The divisional format will disappear next season when Oregon, UCLA, USC and Washington are admitted to what will be an 18-team super conference.\nLINCOLN, Neb. (AP) — An attendance record of global proportions could be set Wednesday night when the University of Nebraska hosts a celebration of volleyball at Memorial Stadium in Lincoln. The event will feature an exhibition between Nebraska-Kearney and Wayne State and a regular-season match between Omaha and the fourth-ranked Cornhuskers. Nebraska athletic department officials have taken aim at the women’s sporting event world attendance record of 91,648. It was set during a Champions League soccer match in Spain in 2022.\nWEST LAFAYETTE, Ind. (AP) — Purdue coach Ryan Walters is settling into his dream job. When he looks out the office window, he sees a practice field where the Boilermakers sometimes works out. These are his players. They are chasing his vision. On Saturday, the 37-year-old Walters may even jog through the smoke with the train horn blaring for his head coaching debut against Fresno State. Yes, the sixth-youngest coach in the FBS, is eager to get started.\nEVANSTON, Ill. (AP) — Interim coach David Braun says he’s “up to the challenge” of leading Northwestern with the season opener this week. It’s certainly not what he envisioned when Pat Fitzgerald hired him as defensive coordinator last winter. Braun is navigating an unusual and difficult path. It takes another turn when the season opens with a rare Sunday game at Rutgers. Northwestern is facing more than a dozen lawsuits across multiple sports with allegations including sexual abuse of players by teammates, as well as racist comments by coaches and race-based assaults. Fitzgerald was fired July 10 after an investigation concluded the coaching staff should have known about ongoing hazing. Braun spent the past four years at FCS powerhouse North Dakota State.\nLINCOLN, Neb. (AP) — Nebraska tight end Arik Gilbert has been arrested on suspicion of burglary after police received a report of a break-in at a Lincoln store. Gilbert transferred from Georgia and was awaiting a ruling on his eligibility from the NCAA. Police say officers dispatched to SJ’s Liquor and Vape Shop early Tuesday found a glass door shattered with large cement chunks from the parking lot. They saw Gilbert walking toward the exit carrying a bag and arrested him. The bag contained stolen vape products, Delta 8, cigars and lighters with a total value of more than $1,600. Damage to the business was estimated at $650.\nMADISON, Wis. (AP) — New Wisconsin coach Luke Fickell often says that he doesn’t want to build a program by relying on the transfer portal. Yet the Badgers’ success this year ould depend largely on how well Fickell can integrate the 17 transfers he has brought in since coming over from Cincinnati. The 19th-ranked Badgers open Fickell’s debut season Saturday by hosting Buffalo. Former SMU quarterback Tanner Mordecai is one of six projected Wisconsin starters who played at a different school last season.\nUNDATED (AP) — The Big Ten’s final season with a 14-team, two-division setup should play out the way it has since the conference last expanded in 2014. That means an East team will win the championship and it probably will be Michigan or Ohio State. The preseason No. 2 Wolverines and No. 3 Buckeyes have flip-flopped as the team to beat now that Michigan has beaten its hated rival two straight years. No. 7 Penn State also expects to be a factor. No. 19 Wisconsin is the choice to win the West over No. 25 Iowa.",
  "word_count": 686,
  "scraped_at": "2026-02-14T01:48:22.643199",
  "_text_extracted": true
}