{
  "article_id": "c74ec88fd648",
  "url": "https://www.ynetnews.com/culture/article/hjlywsh4ke",
  "title": "Bayern Munich Israeli goalie says plans to stay with team",
  "date": "20241215T223000Z",
  "domain": "ynetnews.com",
  "source_country": "Israel",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“Listen, this isn’t something that happens every day—having a goalkeeper subbed in or sent off in the middle of a match,” says Daniel Peretz. “I’ve prepared myself for moments like this because I approach every game with the mindset that there’s a two- or three-percent chance I’ll get to play. It’s not easy, but I treat every game like it’s a 100 percent certainty. It’s a tough mental approach, but as you can see, it pays off. It paid off for me.”\nUntil recently, we’ve said that Daniel Peretz was living the dream just by being part of a club like Bayern Munich. But over the past month, the stars have aligned, and he’s no longer just touching the glory—he’s breathing it. It all started with two stellar performances for the Israeli national team, which didn’t go unnoticed by Bayern’s coaching staff.\nThe momentum reached its peak last week when Peretz made his Champions League debut. Having had limited chances to start for the Bavarian giants, Peretz was thrust into the spotlight after Manuel Neuer was sent off during a cup match against Bayer Leverkusen. Later, Peretz got the call-up following an injury to Neuer—his idol growing up, whose posters once adorned his bedroom wall.\nAlthough Peretz conceded goals in each of the four consecutive matches he has played recently—including Bayern Munich's first league loss of the season, a 2-1 defeat to Mainz, yet, he's proving he belongs, navigating the deep waters of professional football and steadily building his confidence.\nPatience pays off\nThe journey to this opportunity has been anything but easy for the 24-year-old goalkeeper. Over the past year, Peretz has faced significant challenges—not only watching the war in Israel unfold from afar while worrying about family and friends but also struggling to secure meaningful playing time at Bayern Munich.\n“This required, and still requires, a lot of hard work, sacrifice, patience, and faith,\" Peretz said in an exclusive interview with Yedioth Ahronoth and Ynet. \"But yes, thank God, I’m incredibly happy and fulfilled right now. And now, you know, the goal is to maintain consistency.\"\nEven he acknowledges that the true challenge is only just beginning. \"You can never know what the future holds. Right now, I’m in a very good place. The club suits me, the players, the staff, the management, the city, and the country. So, at this moment, I’m happy. But football, like life, is incredibly fluid.\"\nA possible departure?\nWhen asked whether his position at Bayern might change during the upcoming transfer window, Peretz kept things realistic yet optimistic.\n\"Like anything in life, things can change. As I said, I’m happy here and want to stay. But you know, I can’t predict what will happen in a month or even in two weeks. I can’t make a definitive statement like, ‘I’m staying,’ because I truly don’t know. This is a decision that both the club and I will make together. But to answer your question, I don’t see a scenario in which I wouldn’t stay here.”\nPeretz’s ability to balance ambition with humility, coupled with his strong work ethic, continues to make him a key player to watch—both on and off the pitch.\nAnd what about the summer?\n\"I can’t predict what will happen in a month, so I certainly can’t tell you what will happen in six months. So many things can change and shift by then,\" Daniel Peretz admitted when asked about his future beyond the current season.\n\"I’m not affected by the rumors about other goalkeepers being linked to Bayern. I’m focused on my own path, and I believe in it. I don’t waste energy on ‘what ifs.’ Right now, I have a period where I’m getting to play, and I’m fully focused on how to prepare for the next game and the next training session—how to improve physically, mentally, and energetically, to show up ready and pain-free.\"\nThis isn’t my first interview with Daniel Peretz. Back in late September 2023, on the very day the young goalkeeper moved into his new apartment in Munich, he spoke candidly with Yedioth Ahronoth and Ynet. The article was set to be published on October 8, but in the wake of the terror attack in Israel, it was shelved indefinitely.\nNow, almost a year and a half into his time in Germany, Peretz is a more seasoned professional and a more mature individual. Living far from home has brought its fair share of challenges, and he admits that some of those difficulties persist.\nWhat has changed since that unpublished interview?\n\"My German has gotten a lot better,\" Daniel Peretz answers with a smile when reflecting on his personal growth.\nAnd beyond that?\n\"I’ve been through a lot. I’ve grown so much as a player and as a person. I had never lived abroad before, and suddenly, here I am. There’s a lot of solitude, and it’s not easy,\" he admits candidly.\nIn a year marked by challenges both on and off the pitch, Peretz has had to adapt quickly. When asked about encountering antisemitism, particularly from fans, his answer is refreshingly positive:\n\"Honestly, no, not at all. Every time I’ve experienced something, it’s been the opposite—it’s been positive. I’m incredibly proud to be Israeli. When people ask where I’m from, I don’t try to invent anything; they already know. I tell them straight—I’m from Israel! From Tel Aviv!\"\nPeretz explains that Germany, and particularly Munich, has been notably supportive, even amid the tense global climate. \"People here are so understanding and supportive. When the topic of war comes up, they genuinely empathize with our situation. They ask how my family and friends are doing—even people I don’t know personally, but who are aware of where I’m from.\"\nHis words highlight a sense of belonging in his new home while also acknowledging the unique identity he carries as an Israeli abroad.\nPeretz is far from oblivious to the challenges Israelis face abroad. He was particularly struck by the violence in Amsterdam targeting Maccabi Tel Aviv fans—his former team. \"I see what’s happening in other countries and how things are unfolding. You see what’s going on in Paris, in London,\" he reflects.\nWhen asked if the attitudes toward Israelis and Jews in certain communities might influence his career decisions, he pauses before answering. \"Of course, it’s concerning. You want to feel safe wherever you are. Sure, London and Paris have so many big clubs and glittering names, but here in Munich, I’m also part of a huge club. I’m genuinely very happy here.\"\nLast Thursday, Peretz spent the evening courtside at a basketball game, watching Maccabi Tel Aviv fall to Bayern Munich in the EuroLeague. Sitting in the front row with several Bayern teammates, he appeared relaxed and cheerful.\nBut when asked to name his closest friend on the team, Peretz diplomatically sidesteps. \"Yes, we had a great evening together. We have a group of really good people—positive, professional, and supportive. I honestly can’t single out anyone specific because I have so many good friends here. Whether it’s Neuer, Goretzka, or even Gnabry, I have strong connections with all of them. I don’t want to start listing names because I’m on good terms with everyone.\"\nPeretz’s thoughtful words paint a picture of a player who values camaraderie and thrives in a supportive environment, even as he remains mindful of the world beyond the pitch.\nThe influence of legends\nAfter Bayern Munich’s victory over Shakhtar, teammate Thomas Müller physically nudged Peretz toward the cheering fans. It was a symbolic gesture, and Peretz is keenly aware of the privilege of playing alongside football legends.\n\"We have German and global icons in the team. Manuel Neuer is the greatest goalkeeper of all time, and what Thomas has achieved in football is beyond comprehension. I watch every little thing they do and try to learn from them. It's amazing.\"\nNeuer, Peretz emphasizes, is both a mentor and a competitor. “Our relationship is really good. Whether he’s in goal or preparing for a game, I’m there to support him. There’s a great energy between us, even with the competition. We push each other to be better, and we share the same goal—winning titles together.”\nA Love that crosses borders\nFor Peretz, Noa Kirel isn’t just a superstar; she’s his anchor. “The people closest to me, especially Noa, give me so much. She’s the closest person to me in the world,” he says. Kirel’s support has been invaluable during the challenging months when Peretz found himself benched. “We’re both believers. I do everything I can to succeed, and she helps me stay grounded. She reminds me to focus on the bigger picture—life itself. She gives me the peace I need after long hours of training. I couldn’t imagine life without her.”\nThe couple navigates the challenges of a long-distance relationship with remarkable strength. “The hardest part is the distance. You just want to be with the person who’s closest to you. But it makes us stronger. Noa does everything she can to spend time with me, even cramming her schedule in ways that seem superhuman. It’s tough, but we manage. I can’t picture my life without her—there’s just no chance.”\nWhen Peretz proposed three months ago, it sparked a mix of surprise and skepticism among fans. “People close to us weren’t surprised at all. Noa makes me so happy,” he shares. However, not all reactions were positive. “Some comments were hurtful, especially toward Noa. It’s one thing to criticize a bad game or a song, but when people attack your personal life, it’s tough. Most of the backlash was directed at her, and it wasn’t fair.”\nGet the Ynetnews app on your smartphone: Google Play: https://bit.ly/4eJ37pE | Apple App Store: https://bit.ly/3ZL7iNv\nAs for wedding plans? “We don’t have a specific date yet, but we’ll figure it out soon. It’ll probably be in Israel, and you might even see Bayern stars on the dance floor!”\nThe couple is also dreaming of starting a family. “Noa said she wants to be a young mom, and I want to be a young dad. But we’ll only take that step when the timing feels completely right for both of us. Still, that’s the direction we’re heading in—we’re both very family-oriented.”\nIn every aspect of his life, Peretz’s approach is grounded in balance, faith, and a relentless drive to grow—both as an athlete and as a person.",
  "word_count": 1731,
  "scraped_at": "2026-02-14T01:52:10.156335",
  "_text_extracted": true
}