{
  "article_id": "c74f5f1de287",
  "url": "https://www.teamtalk.com/tottenham-hotspur/us-consortium-launches-jaw-dropping-buyout-bid-timeline-affect-january-transfers-revealed",
  "title": "Tottenham news : US consortium launches jaw - dropping buyout bid - timeline , affect on January transfers revealed",
  "date": "20250926T080000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nUS consortium launches jaw-dropping bid to buy Tottenham – timeline, affect on January transfers revealed\nA US consortium has launched an astonishing £4.5billion (€5.1bn / $60bn) takeover bid for Tottenham Hotspur, with a huge amount set aside for transfers in what could be a transcendent moment for the club.\nTech entrepreneur Brooklyn Earick is heading a 12-man group that has lodged the offer to acquire the Tottenham Hotspur Stadium club.\nThe report in The Sun states that Earick is offering £3.3bn to buy out the current Spurs owners – ENIC and the Lewis family.\nThe proposed new Tottenham owners are also ready to set aside an incredible £1.2bn for transfers, as they look to turn the club into genuine challengers in all competitions.\nEarick has also lined up a £250m stadium naming rights deal for Spurs, with the club currently without a sponsor for their ground since opening it in 2019.\nThe Sun goes onto report that the 41-year-old Earick has assembled a consortium that includes NFL and NBA investors to back his vision for Tottenham.\nAndrew Ashcroft recently purchased 8,023,942 shares in the North London club, which represents a 3.4% stake in Tottenham.\nThe price has not been disclosed but the shares are likely to have cost around £100 million based on recent valuations of the north London outfit.\nEarick will be meeting that valuation with his offer. However, whether the majority owners of Tottenham will be open to selling remains to be seen at this stage.\nDON’T MISS ➡️ Ranking Daniel Levy’s top 10 BEST and WORST Tottenham signings\nLevy exit has opened door to Tottenham bidders\nENIC owns 86.58% of Spurs, with former chairman Daniel Levy, who recently walked away after 24 years at the helm of the club, and his family owning 29.88% of those shares.\nSpurs minority shareholders own the remaining 13.42% of the club between them, but Earick is only keen on the majority shares.\nThe former DJ, who also once worked for NASA, started initial discussions with the Spurs hierarchy – including Levy – some months ago.\nTalks have accelerated since Levy exited, with ex-Arsenal executive Vinai Venkatesham now the main man, and it’s believed the former chairman was the hindrance to a sale because of his desire to remain in charge even in the event of a takeover.\nThe report goes on to state that Earick wants a takeover completed by December to allow him to splash the cash during the January transfer window and hit the ground running – news that will no doubt delight current boss Thomas Frank.\nHowever, that may be wishful thinking as it could take months before everything is finalised, if the club’s current majority owners agree to sell.\nAnd sources close to the Lewis family, who run Tavistock, the company behind ENIC, are said to have told football.london that their stance has not changed and that Tottenham is still not for sale.\nSpurs have made a strong start to the new season under Frank, winning three of their five Premier League outings to sit third in the table, while they also won their Champions League opener against Villarreal.\nREAD MORE ➡️ Premier League signings of the season power ranking: Ekitike rises; brand-new leader\nLatest Tottenham news: Kane return hopes / Bergvall to Real Madrid\nBayern Munich have detailed the only way that Tottenham Hotspur can re-sign Harry Kane in 2026, following Thomas Frank’s insistence that the club would welcome him back, while TEAMtalk have reasoned why that could end up being a bad decision.\nElsewhere, a former Premier League midfielder has told Tottenham “clubs like Real Madrid” will be looking at signing Lucas Bergvall in the future and they’ll “do well to keep hold of him.”\nAnd finally, Leeds United are increasingly confident of tying their uber-talented teenage striker Harry Gray down to his first pro deal and averting the catastrophic loss of the player to join his brother, Archie, at Tottenham Hotspur.",
  "word_count": 663,
  "scraped_at": "2026-02-14T02:12:04.361987",
  "_text_extracted": true
}