{
  "article_id": "c7932a188bad",
  "url": "https://weaintgotnohistory.sbnation.com/2024/4/20/24135359/manchester-city-chelsea-live-stream-time-tv-channels-how-to-watch-fa-cup-semifinal-online",
  "title": "Manchester City vs . Chelsea , FA Cup semifinal : Preview , team news , how to watch",
  "date": "20240420T040000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Almost exactly a month away from the end of the season, Chelsea have a chance to finish things on a positive note, both in the league and in the FA Cup. In the former, we’re within shouting distance of a top-six finish. In the latter, we’re a win away from a(nother) final, and two wins away from ending a previously unfathomable two-year trophy drought.\nManchester City vs. Chelsea, FA Cup semifinal: Preview, team news, how to watch\nWe can be heroes, just for one day\nBoth routes would also lead us back into Europe.\nPredicting the outcome of this final month is surely a futile exercise. Our only consistency (other than injuries) has been inconsistency, though we have put together a pretty decent run in the last few months. We’ve gone eight unbeaten in all competitions and have lost only the League Cup final in our last dozen.\nThat one hurt a bit, so here’s an amazing chance to make up for it, to get one over Manchester City and get back to the FA Cup final.\nDate / Time: Saturday, April 20, 2024, 17.15 BST; 12:15pm EDT; 9:45pm IST\nVenue: Wembley, London\nReferee: Michael Oliver (on pitch); David Coote (VAR)\nForecast: cool, breezy, chance of sunshine\nOn TV: BBC One (UK); none (USA); Sony TEN 2 (India); SuperSport Premier League (NGA); elsewhere\nStreaming: BBC iPlayer (UK); ESPN+ (USA); Sony LIV (India); DStv Now (NGA)\nManchester City team news: With both Arsenal and Liverpool in danger of completely bottling their title challenges, City look set for a fourth consecutive league championship — which would not only be a Premier League first, but a first for the entire history of English football.\nAnd yet, the mood is a bit down after their dramatic elimination from the Champions League at the hands (well, feet) of Antonio Rüdiger and Real Madrid on Wednesday. No Treble for them this time!\nThe defeat took an emotional, as well as a physical toll, with Kevin De Bruyne, Erling Haaland, and Manuel Akanji all doubtful. City obviously have more than enough talent to overcome their absences (or fitness concerns), so we’ll have to be at the top of our game either way.\nView from the enemy: Bitter and Blue\nChelsea team news: Raising our levels to the top of our game hasn’t necessarily been a problem; doing so consistently has. But in this case, we just have to do it for one game (including potentially extra-time), and we’ve managed to play out two draws against City already this season: a ridiculously entertaining 4-4, and a slight less entertaining 1-1.\nRaheem Sterling scored in both of those games, and he’s back from illness, as are Enzo Fernández and Axel Disasi from various knocks, which caused them to miss Monday’s most excellent 6-0 win over Everton, which featured a four-goal effort from ex-City youngster Cole Palmer. If he and we can keep carrying that momentum forward, we could be in for some fun indeed.\nLong-term injury victims Reece James, Wesley Fofana, Levi Colwill, Christopher Nkunku, Roméo Lavia, and Lesley Ugochukwu remain out, but this is the healthiest we’ve been perhaps all season, so perhaps we can take advantage against a relatively more tired opponent.\nPreviously: Two draws in the league this season are certainly good results, but they also mean that we still haven’t beaten City since the 2021 Champions League final. That’s a run of eight games, with six defeats. But there has to be a winner in this one, so perhaps fortune will smile upon us.",
  "word_count": 589,
  "scraped_at": "2026-02-14T02:25:26.758063",
  "_text_extracted": true
}