{
  "article_id": "c79f0bd8fb2f",
  "url": "https://www.caughtoffside.com/2023/04/25/pochettino-chelsea-and-kane-man-utd-transfer-exclusive/",
  "title": "Exclusive : Chelsea in advanced Pochettino talks and how this could impact Kane transfer saga",
  "date": "20230425T133000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are in advanced talks to hire Mauricio Pochettino as their new manager, with things moving quickly, according to Ben Jacobs in his exclusive CaughtOffside column.\nThe Argentine has become the leading candidate despite other big names like Julian Nagelsmann and Luis Enrique also being considered by the Blues, with Jacobs providing some insight into why Nagelsmann in particular was not entirely happy with how the hiring process was managed.\nStill, it now looks like it’ll be Pochettino taking over at Stamford Bridge as the permanent successor to Graham Potter, so fans will undoubtedly be keen to think ahead to how the former Tottenham manager might reshape the squad, particularly in the transfer market.\nIt seems, however, that any move to raid Spurs for Harry Kane is considered unlikely for the moment, even if not entirely impossible for Chelsea, with Jacobs stressing that Manchester United are showing the most concrete interest from an English club.\n“Mauricio Pochettino is in advanced talks to replace Graham Potter at Chelsea,” Jacobs wrote. “Things are moving fast and as of Monday evening final negotiations were underway. It wasn’t quite a done deal as of Monday night, and Chelsea hadn’t issued any kind of contract, but there was real confidence from both sides a deal was close.\n“Things could well progress very quickly now over the coming days, and Pochettino is expected to be joined by his assistant Jesus Perez and his son, Sebastino, who is a sports scientist.\n“Chelsea have considered Pochettino multiple times, both under Roman Abramovich and Clearlake-Boehly. Pochettino was a candidate after Thomas Tuchel was sacked in September, but Todd Boehly and Behdad Eghbali decided to hire Potter instead.\n“Plus, Pochettino was not entirely sold on the project back then. This was due to not wanting to rush straight back into work following his PSG exit, and there being less structure at Chelsea.”\nHe added: “Manchester United are the most concrete English suitor for Kane and are currently doing their due diligence on any deal. Even if they get buy in on the player side, it’s still important to stress a deal could well be done by new owners, instead of under the Glazers, so there are a lot of moving parts.\n“And Levy won’t make things easy – Manchester United know this from when they signed Dimitar Berbatov. And the price is expected to be around £100m if a deal is struck. This isn’t a new or raised number either. It’s really always been that high.\n“Kane will also no doubt be linked to Chelsea if Pochettino joins, and there is certainly admiration for him amongst the Chelsea board. Who wouldn’t want a proven Premier League goalscorer – even from a London rival – if he becomes available on the market?\n“But Kane to Chelsea is seen as unlikely (although not impossible!) at this stage, especially with Chelsea lacking Champions League football next season. And until Kane (and as importantly Levy) makes up his mind, it’s premature to predict the next step.”",
  "word_count": 502,
  "scraped_at": "2026-02-14T01:55:54.936852",
  "_text_extracted": true
}