{
  "article_id": "c7ac0fd895de",
  "url": "https://cartilagefreecaptain.sbnation.com/tottenham-hotspur-previews/66560/tottenham-hotspur-everton-premier-league-preview",
  "title": "Everton vs . Tottenham Hotspur Premier League Preview",
  "date": "20251024T124500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Across 12 competitive matches this season, Tottenham Hotspur has conceded just nine goals, which is a much welcomed change after the disaster of the previous campaign. After all of the crying about the defense from across the fanbase, it feels dangerous to complain too much about this quick turnaround. However, it must be said that the attack has definitely suffered from this revolution and the football right now is none too inspiring.\nEverton vs. Tottenham Hotspur Preview: New fortresses\nSpurs have a new defensive mindset, Everton has a new stadium; results are…fine?\nA clean sheet on Wednesday did rescue a point, but Spurs will not have success this season if they cannot figure out how to move the ball. The quest to build up an attack will not be any easier this weekend, as Everton has been strong in its new home, undefeated through four league contests and allowing just two goals from visitors. Prior to Monaco, Tottenham has found goals on the road, and that must continue on Sunday.\nMatch Details\nDate: Sunday, October 26\nTime: 12:30 pm ET, 4:30 pm UK\nLocation: Hill Dickinson Stadium, Liverpool\nTV: USA Network (US), Sky Sports Main Event (UK)\nTable: Everton (12th, 11 pts), Spurs (t-5th, 14 pts)\nAs has been the case in each of the last four seasons, Spurs beat Everton at home last year in a 4-0 goalfest during MW2, featuring a Heung-Min Son brace and tallies by Yves Bissouma and Cristian Romero. The reverse fixture also followed the four-year trend of dropped points, except the final trip to Goodison Park saw Tottenham’s first loss in this stretch, with a first-half Toffees’ 3-0 lead too much to overcome despite late Dejan Kulusevski and Richarlison goals.\nThree Big Questions\nWill Thomas Frank adapt? Every supporter from the beginning of time has claimed to have more knowledge than their team’s manger, and the current fixation across North London is the Joao Palhinha-Rodrigo Bentancur double pivot. The daunting fixture list alone could bring rotation, but even without necessitated changes, the new manager has to recognize this is not working.\nThe defensive-minded central midfielders have no ability nor inclination to move the ball, isolating star signing Xavi Simons on an island and providing no aid to whoever is tasked with playing up top. Everton have the sixth-lowest xGA in the league this season, and as mentioned before, have been great protecting its own end of the pitch at home. Tottenham must figure out a better plan than the last few showings.\nHow much will Everton threaten? While its goals and xG are near the middle of the league, Everton has been fairly tame over its past five matches, scoring one goal max in four of the last five. Iliman Ndiaye has been the biggest threat with three goals, while six other players have scored exactly once in the league; Jack Grealish has factored into many with his five assists and is the one to watch when the Toffees are threatening.\nThe home side will be confident, though ranks just 16th in average possession. Maybe this means Spurs should be ready for counterattacks, while set pieces seem like another way David Moyes’ side could try to find the back of the net. Coming off of Wednesday’s draw at Monaco, the Tottenham defense is in a good shape. Unfortunately, that remains a clear need as the real chances on the other end may be limited.\nCould the dam break? Time to go macro for a minute. Following Sunday, Spurs will see Newcastle away (League Cup), Chelsea, Copenhagen (Champions League), and United, then return from the international break with trips to Arsenal and PSG. While Frank has his club alive — and in decent position — across multiple competitions, it is not hard to envision this stretch changing things drastically.\nIt is obviously better to play poorly and still get a result (Wolves, Glimt, Monaco) than the reverse, though one could argue that the poor recent performances mean regression is on the way. That is why this upcoming stretch is so massive. If Tottenham can make some adjustments, staying above water on all fronts is realistic. But if no changes happen, it is only a matter of time before these ugly draws become ugly losses, and it is hard to say they would not be deserved.",
  "word_count": 720,
  "scraped_at": "2026-02-14T02:15:53.538004",
  "_text_extracted": true
}