{
  "article_id": "c7bfaca380b6",
  "url": "https://metro.co.uk/2024/09/20/arne-slot-explains-71-000-000-star-isnt-starting-liverpool-21642197/",
  "title": "Arne Slot explains why £71 , 000 , 000 star isnt starting for Liverpool",
  "date": "20240920T131500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot says Darwin Nunez will get his chance in the Liverpool starting XI providing he keeps ‘working really hard’.\nNunez has blown hot and cold since moving to Anfield from Benfica in 2022 in a deal that has so far cost the club £71million and could yet rise to £85m.\nThe centre-forward has so far scored 33 goals and made 17 assists in 100 appearances but has also become renowned for fluffing his lines, missing 27 big chances in the Premier League last season – second only to Erling Haaland.\nThe Uruguay international doesn’t appear to have the trust of new Liverpool boss Slot who has so far stuck with a front-three of Mohamed Salah, Diogo Jota and Luis Diaz in the league.\nCody Gakpo replaced the latter in the Champions League win at AC Milan on Tuesday, but Nunez is yet to start a game under the Dutch manager, playing a total of 84 minutes off the bench.\nSpeaking in his pre-match press conference ahead of the home clash against Bournemouth on Saturday, Slot was asked what the 25-year-old needed to do get a chance in the starting XI.\n‘Same like all the others. Work really hard and then the goals will come,’ he replied.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I think that’s also what he did when he came in against AC Milan. First of all you come in for the team and then as a result of that attackers score goals or assist and that’s also what happened to Cody.\n‘But it happened before with Lucho [Diaz] and with Mo [Salah] and with Diogo [Jota]. If you play in a team like Liverpool you will always score your goals or get your assists.\n‘But for me it’s mainly about the work we do without the ball and that they can score goals and assist I know. That’s the same with Darwin. He will get his chance in the near future.\nHow many goals will Darwin Nunez score this season?\n-\n0-10\n-\n10-20\n-\n20+\n‘We play a lot of games and I think he’s fitter and fitter now [and] understands day by day better what we expect from him. But [he’s] in competition with Diogo, who in my and our opinion has done really well in the last games.’\nMore Trending\nMany thought that Slot’s style of football would be more suited to Nunez than Jurgen Klopp’s was, but that doesn’t appear to be the case so far.\nBut the manager assures the forward will get the opportunity, adding: ‘I think he came back with a lot of confidence from the Copa America, scored some good goals.\n‘Darwin always has confidence and he has every right to have this confidence because everywhere he played he always scored goals. As a striker sometimes you have a few games that you don’t score and then all of a sudden you score a lot.\n‘As long as he brings his work-rate in for the team and we bring him enough in positions I’m 100 per cent sure he or Diogo or one of the others will score goals.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Pep Guardiola gives injury update on Kevin de Bruyne ahead of Manchester City vs Arsenal\nMORE: Enzo Maresca delivers Chelsea team news ahead of West Ham clash\nMORE: Manchester City star Ilkay Gundogan praises ‘intelligent’ Kai Havertz ahead of Arsenal showdown",
  "word_count": 632,
  "scraped_at": "2026-02-14T02:25:58.983818",
  "_text_extracted": true
}