{
  "article_id": "c7c59514fa0e",
  "url": "https://ianslive.in/afc-champions-league-ii-fc-goa-fc-istiklol-face-off-in-final-asian-night-in-fatorda--20251223213521",
  "title": "AFC Champions League II : FC Goa , FC Istiklol face off in final Asian night in Fatorda",
  "date": "20251223T173000Z",
  "domain": "ianslive.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Margao, Dec 23 (IANS) FC Goa return to the Pandit Jawaharlal Nehru Stadium at Fatorda for one final continental night in 2025 as they host Tajikistan’s FC Istiklol in their concluding Group D fixture of the AFC Champions League Two in Margao on Tuesday.\nWith qualification no longer in reach, the encounter represents FC Goa’s last opportunity to put points on the board and close their Asian campaign with pride, purpose, and a performance worthy of their supporters.\nFor the Gaurs, continental nights at Fatorda carry a special resonance. Memories of their last AFC Champions League appearance at home remain fresh, when FC Goa put up a fearless fight against a star-studded Al Nassr side featuring some of world football’s biggest names.\nOn that historic night, Goa not only matched their illustrious opponents for long spells but also made history when Brison Fernandes scored India’s first-ever goal in the AFC Champions League. That performance, built on belief and bravery, remains a defining reference point, one the Gaurs will look to draw inspiration from as they chase their first points of the ACL Two campaign.\nFC Istiklol arrive in India not just having already tasted silverware this season wrapping up their domestic league campaign as champions for a record-breaking 12th consecutive season but also on the back of a 2-0 win in the reverse fixture in Dushanbe earlier in the group stage, something the side will look heavily to draw inspiration from as they remain in the mix for qualification to the knockout stages.\nOn the other side, FC Goa come into this fixture riding a wave of confidence after lifting the Super Cup for the second consecutive year just two weeks ago. That triumph came at the very same Fatorda Stadium, where the Gaurs edged past East Bengal in a tense final decided by penalties, further strengthening their belief and bond with home support ahead of this crucial encounter.\nHead coach Manolo Márquez’s side will be keen to channel that winning momentum into their final continental outing. While the Asian campaign has tested them, the objective is clear: compete with intensity, play with freedom, and give the Fatorda faithful a performance to remember.\nGoalkeeper Lara summed up the squad’s mindset ahead of the clash: “It’s been a difficult journey with the gaps between games and the uncertainty over the future, but we are a strong group, and we are ready to continue to represent India together in this competition.”\nWith pride on the line, trophies recently secured on both sides, and memories of past continental heroics to inspire them, FC Goa vs FC Istiklol promises a compelling finale to group stage one, where the Gaurs will be determined to finish their Asian journey on a high under the Fatorda lights.\n--IANS\nbsk/",
  "word_count": 462,
  "scraped_at": "2026-02-14T02:12:17.555357",
  "_text_extracted": true
}