{
  "article_id": "c7d174d1acb2",
  "url": "https://www.bbc.com/sport/football/articles/cly11qjnx1wo",
  "title": "La Remontada : Can Champions League comeback kings Real Madrid knockout Arsenal ? ",
  "date": "20250416T083000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'La Remontada' - a comeback too far for Real Madrid?\n- Published\n\"Remontada...[comeback] I've heard it about a million times this week, I've seen a million videos online.\"\nReal Madrid's Jude Bellingham was responding to a leading question from a Spanish journalist before Wednesday's Champions League quarter-final second leg against Arsenal when he said that 'Remontada' was \"the most-used word in the dressing room in the last days\".\nIf it was a question designed to allow Bellingham to fuel the narrative and hype building in Madrid despite last week's 3-0 first leg defeat, it certainly worked.\nThe 15-time champions of Europe Real Madrid have a reputation for doing the impossible in recent Champions League campaigns.\nDeclan Rice's sensational free-kick double and Mikel Merino's curled strike mean Madrid must overcome a three-goal deficit to progress at the Bernabeu.\n\"There's not a lot you can do for Real Madrid in the Champions League that hasn't already been done,\" Bellingham, 21, added.\n\"Tomorrow is an opportunity for us to do something for the first time and that's really important to us.\n\"It's a weird environment these last few days. One of the worst results we could possibly imagine away and for some reason everyone thinks it's nailed on that we'll come back.\n\"There's a lot of trust in the talent. There's an expectation from Real Madrid that when we get into these kind of holes we can come back, even if it's a really tough one, a really difficult one.\n\"Just because the club has done it so many times, that's what's so impressive about the size of this club, and the expectations are obviously huge.\"\nReal Madrid coach Carlo Ancelotti, who has won the competition five times as a manager, said he was \"focused, with a very cool head\".\n\"It's not my first night like this and I hope it will not be the last,\" he said.\nReal are comeback kings - but history is against them\nOn three out of the past four occasions on which Real Madrid have trailed after the first leg in the Champions League, they have fought back to reach the next round - against Wolfsburg in 2015-16 and in 2021-22 against both Paris St-Germain and Manchester City.\nBut Arsenal can take belief from the fact this is the joint-largest deficit Madrid have ever trailed by heading into a Champions League second leg.\nThe last time they faced such a task was against Borussia Dortmund in the 2012-13 semi-final, when Robert Lewandowski netted a hat-trick in a 4-1 win for Jurgen Klopp's side in Germany.\nReal won the return match 2-0 in Madrid, but Dortmund progressed to the final on aggregate.\nIn fact, the only time they have fought back from three goals down after a first leg came in the European Cup against Derby County in the last 16 of the 1975-76 edition, winning 6-5 on aggregate following a 4-1 defeat at the Baseball Ground.\nA deficit of three goals or more has been overturned just four times since the European Cup became the Champions League in 1992.\nLiverpool trailed 3-0 against Barcelona going into the second leg of their 2018-19 semi-final at Anfield, but stormed into the final with four unanswered goals.\nDeportivo La Coruna, against AC Milan in 2004, and Roma, in 2018 against Barcelona, are the only other teams to have come back from three goals down after a first leg in the Champions League era.\nBut one team have overturned a four goal-deficit - Barcelona in the game originally christened 'La Remontada' in 2016-17 - when they beat PSG 6-1 at the Nou Camp.\nStats company Opta gives Arsenal an 89.7% chance of progressing to the semi-finals, and Real have lost five games in the competition this season - a tally that equals a club record.\n\"Every single time Madrid did a miracle, the preview said it is not possible,\" said Guillem Balague on the EuroLeagues podcast.\n\"But on this occasion, you are talking about a team that don't defend well, there is no architecture in the midfield, there are no patterns. They depend a lot on the individuals, as always. They haven't got a capacity to react.\n\"There are so many details that suggest it is not possible for them to turn this around, including the amount of running they do - they ran 12km less than Arsenal [in the first leg].\n\"They are still not players who do the work defensively. They think they can just switch on at any minute and turn any game around, and I don't think that's possible, not with this team.\"\nFellow pundit Julien Laurens agreed, telling BBC's Football Daily podcast: \"To get this win, Real Madrid need to do something more special than they have ever done.\n\"This Arsenal team is very good defensively, they are one of the best teams in Europe, even without Gabriel.\n\"Carlo Ancelotti has never been a manager for patterns of play. He is the king of man management and he lets the players express themselves on the pitch.\n\"But this season there does feel like there is no structure. It feels as though this is a group of super talented players individually, but not as a team. There's not that togetherness or cohesion tactically. Unless they play as a team, I find it hard to believe they will overturn this.\"\nThe omens are good for Arsenal\nAs James Horncastle said on the EuroLeagues podcast, there are heavyweights of the European game who are still backing Madrid to progress - including Champions League winners with AC Milan Alessandro Costacurta and Zvonimir Boban, and former Madrid boss Fabio Capello.\n\"Amazing things happen in football, amazing things happen at the Bernabeu,\" said Horncastle. \"I know this Real Madrid side has injuries, it has flaws, it is not balanced.\n\"I was not surprised to see in the Italian papers and on Italian TV, that when they were asked to predict who would reach the semi-finals, three pundits - Costacurta, Boban and Capello - still refused to go against Madrid.\n\"It still says a lot about Madrid's reputation that it is not something you can take for granted that Arsenal will progress at the Bernabeu.\"\nBut the omens are good for Mikel Arteta's outfit.\nArsenal's victory was the 12th time an English side have won by three or more goals in the first leg of a Champions League knockout stage tie, and every time the English side has gone through to the next round.\nThe Gunners also have a good record when leading after the first leg of a Champions League knockout match - they have progressed from six of the eight ties they have won the opening match.\nFurthermore, they remain unbeaten against Real Madrid in European competition, with two wins and a draw, and have not conceded a single goal across their three meetings.\nBut comeback kings say they 'will get it done'\nAfter the first leg at the Emirates, Real's England star Bellingham said: \"One place where crazy things happen is our house.\"\nSpeaking at Tuesday's news conference, Bellingham added: \"It's a night that's made for Real Madrid.\n\"A night that would go down in history but also something that people are familiar with around this part of this world. Hopefully we can add another special night.\"\nNo Champions League campaign epitomised that more than in 2021-22, when Real pulled off sensational fightbacks against PSG, Chelsea and then Manchester City in one of the most incredible runs in the competition's history.\nLast season they were minutes away from losing their semi-final tie with Bayern Munich before turning things around with two late goals at the Bernabeu.\nIn both of those campaigns, Ancelotti's side went on to win the competition.\n\"We know we're strong at home with our fans,\" said goalkeeper Thibaut Courtois. \"If we score one or two, quickly... I think it's possible.\"\nIt is that 'never say die' attitude that has served Real so well over the years.",
  "word_count": 1329,
  "scraped_at": "2026-02-14T02:18:17.723423",
  "_text_extracted": true
}