{
  "article_id": "c7e0f78419ae",
  "url": "https://www.thelocal.es/20230619/spain-beat-croatia-on-penalties-to-win-first-tournament-in-11-years",
  "title": "Spain beat Croatia on penalties to win first tournament in 11 years",
  "date": "20230621T170000Z",
  "domain": "thelocal.es",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spain goalkeeper Unai Simon denied Lovro Mayer and Bruno Petkovic from the spot, before Carvajal cheekily chipped home to earn La Roja their first trophy since Euro 2012 and break Croatian hearts.\nZlatko Dalic's side, runners-up at the World Cup in 2018 and third in 2022, have never won a major trophy and were hoping Nations League success would cap a glittering international career for captain Luka Modric.\nThe victory is a confidence boost for new Spain coach Luis de la Fuente after heavy criticism in March after a defeat by Scotland in Euro 2024 qualifying. It also avenged their 2021 final defeat by France.\n\"For us it was a unique opportunity, we went out early in another tournament (at the World Cup in Qatar) and today we had to take advantage,\" Real Madrid defender Carvajal told Spanish broadcaster TVE.\n\"We had confidence with the penalties and it went well, I knew how I was going to shoot it, and I knew I was going to be sixth... I wanted to take it Panenka style and it went well.\"\nDalic warned over 25,000 Croatian fans were expected to travel to Rotterdam and they filled the majority of the stadium, De Kuip a sea of red and white checkered squares, save for a modest area of Spanish fans.\nThe Croatians chanted Modric's name in the 10th minute, matching his shirt number, a plea for him not to retire from international duty after the tournament, as had been rumoured.\nOn the pitch Spain made the early running, with Gavi drilling narrowly wide after pressing furiously to win the ball back.\nJust when the game started to fall into a slight lull, under the pink haze of smoke from Croatian flares, Spain were nearly caught out by Josip Juranovic's long ball over the top for Andrej Kramaric.\nThe striker ran through on Unai Simon's goal but just as he pulled the trigger, Aymeric Laporte made a superb lunging block.\nDespite 14 goals in the three preceding games, the first half finished goalless, just as in the prior two Nations League finals, won by Portugal and France in 2019 and 2021 respectively.\nDalic's side emerged the stronger and Tottenham wide man Ivan Perisic, playing at left-back, was a constant threat, as was Spain captain Jordi Alba.\nThe former Barcelona defender found Asensio with a dangerous cross which the forward headed on to the roof of the net. La Roja were unable to muster a shot on target in the first 80 minutes.\nMario Pasalic headed wide at the other end before being replaced by Petkovic, who was Croatia's semi-final star against the Netherlands -- to the extent one Croatian newspaper described him as \"Bruce Willis in football boots\". It did not prove the case this time.\nSpain sent on their own semi-final match-winner in response, with Joselu replacing Morata, while Ansu Fati also entered the fray.\nIt was the young Barcelona forward who came closest to scoring in the 90 minutes for either side, with his low strike cleared off the line by the diligent Perisic.\nCroatia appealed in vain for a penalty after Nacho tangled with Borna Sosa, and Spain substitute Dani Olmo, who spent six years with Dinamo Zagreb, hammered over as extra-time continued in the same tight pattern.\nWith the sides inseparable, the match was decided on penalties.\nAfter Simon denied Mayer, Aymeric Laporte had the chance to earn victory but hit the bar.\nAthletic Bilbao stopper Simon flung himself to his right at full stretch to save from Petkovic and set the scene for Carvajal to spark Spanish celebrations.\n\"We're so happy, it was a really tough game and this is so difficult to do,\" said Manchester City's Champions League final goalscorer Rodri, man of the match.\n\"This generation promises a lot. We were very strong mentally. There are things to improve, but winning is always good -- we have to celebrate.\"",
  "word_count": 652,
  "scraped_at": "2026-02-14T02:07:02.886906",
  "_text_extracted": true
}