{
  "article_id": "c7f96e54e445",
  "url": "https://www.france24.com/en/live-news/20240509-kewell-seeks-coaching-redemption-in-afc-champions-league-final",
  "title": "Kewell seeks coaching redemption in AFC Champions League final",
  "date": "20240509T061500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kewell seeks coaching redemption in AFC Champions League final\nYokohama (Japan) (AFP) – Harry Kewell's coaching career has not yet matched the heights he reached as a player but he can take a big step forward in this week's AFC Champions League final.\nIssued on:\nKewell's Yokohama F-Marinos take on Al Ain of the United Arab Emirates in Saturday's first leg, only four months after the former Leeds and Liverpool forward took over at the Japanese club.\nKewell struggled in lower-league English football with Crawley Town, Notts County and Oldham, and he was sacked by fifth-tier Barnet in 2021 after failing to win in his first seven matches.\nThe Australian now has a shot at coaching redemption as he prepares for a battle of wits against another English Premier League favourite -- the coach of Al Ain is former Chelsea and Argentina striker Hernan Crespo.\n\"It's a learning process,\" the 45-year-old Kewell said after Yokohama's semi-final win over South Korea's Ulsan Hyundai that took them to the final of the Asian club championship for the first time.\nAustralian legacy\n\"Every club that I've been at, every single player that I've worked with has been excellent, wanting to learn more about the game, wanting to work harder.\n\"It's something for myself to be able to go out there and learn as well.\"\nKewell is hoping to build on the legacy left at Yokohama by fellow Australians Ange Postecoglou and Kevin Muscat.\nPostecoglou won the J-League in 2019 before joining Celtic and then moving on to Tottenham in the Premier League.\nMuscat set up Kewell for success by guiding Yokohama through to this season's Champions League knockout round before leaving to join China's Shanghai Port in December.\nKewell's previous job was as a first-team coach under Postecoglou at Celtic, and he said he was \"not taking full credit\" for Yokohama's run to the final.\n\"They've had two wonderful managers previously that have done wonderful things,\" Kewell said.\n\"I've walked into the club and even on my first day I said I've got a very solid base.\n\"It just needed something different.\"\nLower-league limbo\nKewell was one of the brightest lights in Leeds' effervescent young team in the late 1990s, before making a controversial switch to Liverpool in 2003.\nHe won the UEFA Champions League in 2005 with the Anfield club and also shone on the international stage, winning 58 caps for Australia and appearing at two World Cups.\nHe got his first start in senior management in 2017 at Crawley, becoming the first Australian to coach an English professional club.\nHe lasted a little over a year at the League Two side and that remains his longest spell in charge of a club.\nHe was sacked after 11 league games at Notts County and seven months at Oldham, and was shown the door even sooner during a disastrous stint at Barnet.\nKewell has a great chance to set the record straight with Yokohama. The club lie 11th in the J-League after 11 matches, but have a game in hand that could lift them to within six points of the top.\nHe said his team have been \"pushed to the limit\" in the Champions League knockout rounds, where they have had players red-carded in three games and needed penalties to get past Ulsan in the semis.\nKewell played under esteemed managers such as Rafael Benitez at Liverpool and Guus Hiddink with Australia, and he said he has tried to emulate their thoughtful approach as a coach.\n\"Sometimes you've just got to sit back, don't let emotions get in the way, think about the situation,\" he said.\n\"Then you can think clearly and make the right decision for the team.\"\n© 2024 AFP",
  "word_count": 619,
  "scraped_at": "2026-02-14T02:17:35.177870",
  "_text_extracted": true
}