{
  "article_id": "c80eaa85dcdf",
  "url": "https://www.nytimes.com/athletic/6696228/2025/10/08/jamie-gittens-chelsea-florent-malouda-interview/",
  "title": "Jamie Gittens has had an underwhelming start at Chelsea . Florent Malouda has some advice",
  "date": "20251008T063000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Florent Malouda understands better than most what Jamie Gittens is going through at Chelsea.\nGittens joined Chelsea for £48.5million from Borussia Dortmund in July, but has not made the start to his career at Stamford Bridge he would have wanted. The left winger has been in the first XI just three times and is the latest member of the social media trolls’ ‘007’ club, the term used to describe a player who has not registered a goal or an assist in their first seven games.\nAdvertisement\nWhen Malouda moved to Chelsea from Lyon for £13.5m in 2007, there was a lot more expectation on his shoulders. He had won Ligue 1 with Lyon four seasons in a row and was in the France side which lost the World Cup final against Italy a year before. At 27, Malouda was also a more finished article. Gittens turned 21 two months ago.\nMalouda, who also predominantly operated on the left flank, contributed just two goals and one assist during his first season in the Premier League. He was on the receiving end of moans and groans from the crowd, just like Gittens.\n“You should not be affected by this,” Malouda tells The Athletic. “They are your fans and have the right to express their feelings.\n“If you play in a club like Chelsea, it could (be like this) home and away and you have to be able to handle that pressure, to understand they want your best. They do not do it for you to perform less, they do it to deliver a message to you, and you need to get the message.\n“How did I win them over? It was a strong relationship based on commitment. I was committed to the club. Every transfer window there were rumours but I was still fighting for the cause, the club, to earn the trust of the fans. The fans gave it back to me because they saw I truly loved the club, saw that I was defending the club with everything I had. I had the opportunity on great European nights and also the Premier League, the FA Cups. They felt I was a reliable player. It was a successful story in the end.”\nMalouda became an important player for Chelsea. As an individual, he registered an impressive 45 goals and 39 assists in 229 appearances. In terms of trophies, he won five with them, including the double of the Premier League and FA Cup in 2010, plus the Champions League two years later.\nHe was watching from the stands last weekend as Gittens perhaps enjoyed his best experience so far courtesy of a late cameo from the bench. Gittens came on against Liverpool with 15 minutes to go and showed better attacking intent, and brought a good save out of Giorgi Mamardashvili. Chelsea went on to win 2-1 in stoppage time.\nAdvertisement\n“It’s a learning process,” Malouda, who is part of a Chelsea Legends squad playing against Liverpool Legends at Stamford Bridge on Saturday to raise funds for Chelsea FC Foundation and the Chelsea Players’ Trust, says. “When you are so young and join a club like Chelsea, you have to build your confidence. It is part of the journey. The talent is there (with Gittens), it is how you are able to perform at this level. When you are young, you have to be fearless, that is the only way.\n“The club believes in him, it is just how he is able to prove to the people at the club who put their trust in him that he belongs to this club. The beauty of football is that with one goal, one assist, a sparkle from Jamie, you can turn things around. You should also believe that you can do it and deliver on a regular basis. He can light the stadium on fire with one goal, and then it starts.”\nGittens was born and developed in England at Reading, Chelsea and Manchester City’s academies. But like Malouda, his only taste of senior football before Chelsea was abroad. He joined Borussia Dortmund at the age of 16.\nMalouda believes it should be taken into account, but is also aware that Gittens cannot take too long to settle. He explains: “It takes time to adjust to the Premier League, but at the same time, you do not have time. Every transfer window is an opportunity for the club to reshape the team.\n“Everybody wants results. When you invest in a new player, the goal is to improve the squad. In England, there is maybe less patience with the players signed in the last window. Everyone wants to be excited about the new players.\n“In other leagues, clubs have to take time to see their signings develop. In England (due to the money available), they have an opportunity in the next window to correct things. That puts more pressure on any player at the club, not just the ones who have just joined. You have to learn very quickly just how competitive playing in England is.”\nAdvertisement\nWhen Malouda moved to Chelsea, he walked into a dressing room full of established winners like John Terry, Frank Lampard, Didier Drogba and Petr Cech. They had helped the club win the Premier League in 2005 and 2006, plus three domestic cups.\nThis Chelsea squad are the youngest in the Premier League. While they won the Club World Cup and Conference League last season, Malouda admits Gittens has it a lot tougher than he had because so many of his teammates are also at an early stage in their careers.\n“This is part of the strategy of the new owners,” he says. “When they came in, they were investing in young players on long contracts. When I joined, it was different. There were more experienced players, ones who had either won at Chelsea, in the leagues they had come from, or were already representing their national team. The squad was way more experienced, had way more character, based on their pedigree.\n“This project is about developing young players here who need to win things together. It’s a different project and that is why there is more pressure on these young players. When you see the amount of money the club has spent and their price tags, I think there is more expectation and weight on their shoulders.”\nGittens has also been hindered by not having a proper pre-season. Unlike early summer buys Joao Pedro and Liam Delap, he could not play for Chelsea at the Club World Cup because of a 13-minute substitute appearance for Borussia Dortmund in the group phase. Due to reaching and winning the final on July 13, Chelsea only reported back for training on August 4, under two weeks before their opening Premier League game.\n“Short term that makes a difference,” Malouda insists. “But it is not about proving yourself over two to three months. You have to look at the bigger picture. If a player belongs to Chelsea, plays on this stage, it does not matter about the pre-season. It is about how you adjust and build your confidence when it is challenging. It is not about being young or more experienced; when you get a chance to play, you need to deliver.\n“Cole Palmer is having some injury issues. Every player should see this as an opportunity and be ready for it. It does not matter where the opportunity comes. Every chance you get to wear this jersey is one to show your talent against the opponent. You always have to be ready.\n“Pre-season is the past; you should not use that as an excuse.”\nAnother factor in Gittens’ lack of starts is the arrival of Alejandro Garnacho from Manchester United. Despite joining at the end of August for £40m, the Argentina international has adapted much quicker, starting three of the last four games.\nAdvertisement\nMalouda believes Gittens must not see Garnacho’s signing as a negative. He concludes: “You need competition to be at your best. The sooner you accept it, the more you are able to deliver. It is not a problem.\n“This is a context that you choose when you come to a club like Chelsea. When I was there, I remember every year Chelsea would sign a new striker. They had Didier Drogba, Hernan Crespo, Andriy Shevchenko and so on. This is what you want because then the squad becomes competitive and then you have to upgrade your game.\n“As a young player, you sometimes don’t see it because you are maybe looking for personal attention. But on the biggest stage, you need a strong squad. You look at Liverpool and Manchester City in recent years, this is why they have been able to compete in every competition. Chelsea want to get there, to be in a position when they start a season that they can win every competition possible. You need quality players.”\nMalouda clearly feels that if Gittens can get over some teething problems, he has what it takes to be one of them. Just like he did.",
  "word_count": 1513,
  "scraped_at": "2026-02-14T02:12:04.355672",
  "_text_extracted": true
}