{
  "article_id": "c8238d35813d",
  "url": "https://thepeoplesperson.com/2024/04/28/sir-jim-ratcliffe-meets-with-agent-jorge-mendes-to-launch-summer-transfer-strategy-279500/",
  "title": "Sir Jim Ratcliffe meets with agent Jorge Mendes to launch summer transfer strategy - Man United News And Transfer News",
  "date": "20240428T173000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United co-owner Sir Jim Ratcliffe is already working on reviving the club by setting a massive summer transfer haul in motion.\nOn Saturday, Man United were held to a disappointing 1-1 draw with Burnley at Old Trafford in what was yet another example of how significant the team’s drop-off has been since last season when Erik ten Hag arrived at the club.\nSitting in sixth place on the Premier League standings, United are six points behind Tottenham Hotspur with Spurs having two games in hand. It is now mathematically impossible for United to qualify for a UEFA Champions League spot next season given the team’s poor record.\nRatcliffe’s efforts to revamp the club and build toward its long-term future have been swiftly set in motion, with the billionaire already changing much of the club’s management. Omar Berrada was brought in as CEO, with Dan Ashworth reportedly taking Newcastle United to arbitration to force his move to Man United where he seeks to become the sporting director.\nJason Wilcox took over as technical director earlier this month, while it appears that Ratcliffe’s comments regarding needing new personnel to bring about change do not bode well for manager Erik ten Hag.\nClearly, no one at the club is safe from the axe, and the players are no exception. Ratcliffe allegedly had a telephone call with FC Barcelona, in which he named four players whom he would be prepared to offload for a “reasonable” price.\nCasemiro’s inclusion came as no surprise given his decline in performances over the season and his exorbitant wages. Raphael Varane was another name. Given his injury issues and his age, it makes sense for United to rather focus on acquiring a younger defender.\nThe long-injured Tyrell Malacia is also believed to have been included in the list, while an ageing Christian Eriksen was also reportedly mentioned.\nOf course, should United choose to offload the aforementioned players among others, some fresh recruits will be needed to rebuild their squad. In order to do so, it appears that Ratcliffe decided to meet with one of the top agents in world football at present.\nThe Mirror reported that Ratcliffe has met with Jorge Mendes, who famously is the agent of Cristiano Ronaldo, Bernardo Silva, and Darwin Nunez.\nAccording to the report, Ratcliffe recognised that Mendes has a specialist knowledge of transfers and has thus decided to get his advice as he formulates United’s summer transfer strategy.\nWith Ratcliffe looking to focus on recruiting young talents as opposed to making big-name signings, gaining the Portuguese agent’s perspective could prove invaluable as he seeks to build a team that can bring United long-term success.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 463,
  "scraped_at": "2026-02-14T01:56:51.541577",
  "_text_extracted": true
}