{
  "article_id": "c857ff875fe6",
  "url": "https://www.theguardian.com/world/2024/nov/07/first-edition-second-trump-administration",
  "title": "Thursday briefing : What lies ahead for the US in a second Trump administration",
  "date": "20241107T073000Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning.\nKamala Harris conceded the US election to Donald Trump overnight. In a speech at Howard University, the vice-president urged supporters not to lose hope, saying “this is a time to organise, to mobilise and to stay engaged for the sake of freedom and justice and the future that we all know we can build together”. Harris, hoarse from the frenzied campaign that began a little over 100 days ago, contrasted sharply with Trump following his defeat in the 2020 election, which he never formally conceded.\nHarris’s speech capped a turbulent election, marked by Trump’s dramatic political comeback. He won decisively, carrying both the electoral college and the popular vote. The Republican party also flipped control of the Senate and while the House of Representatives has not yet been called, the Republicans remain confident. With control over all three branches of government, Republicans could have a much smoother path for passing legislation.\nAs Democrats begin soul-searching (and the inevitable blame game), Trump’s new GOP prepares to take power. For today’s newsletter, I spoke with Guardian US live news editor Chris Michael about what a Trump presidency might look like. But first, the headlines.\nFive big stories\n-\nEnvironment | It is “virtually certain” that 2024 will be the hottest year on record, the European Union’s space programme has found. The prognosis comes the week before diplomats meet at the Cop29 climate summit and a day after a majority of voters in the US, the biggest historical emitter of planet-heating gas, chose to make Donald Trump president.\n-\nMiddle East | Many Israelis were reeling after Benjamin Netanyahu’s decision to dismiss his popular defence minister, Yoav Gallant, in the midst of a multifront war. The prime minister said he had fired Gallant over what he described a “crisis of trust”. Gallant, a member of Netanyahu’s Likud party and a senior general, has been replaced by the foreign minister, Israel Katz, a Likud lawmaker and loyalist who has little military background.\n-\nPolitics | The Reform UK MP Lee Anderson has apologised after parliament’s watchdog on bullying and harassment told him to do so for telling a security guard who asked for his ID to “fuck off, everyone opens the door to me”.\n-\nEconomy | Rachel Reeves has committed not to increase taxes at Labour’s next budget and said the government would need to “live within the means” of her spending plans if public services came under mounting pressure.\n-\nHealth | Doing just five extra minutes of exercise a day could help lower blood pressure, a study suggests. High blood pressure affects 1.28 billion adults worldwide and is one of the biggest causes of premature death. It can lead to strokes, heart attacks, heart failure, kidney damage and many other health problems, and is often described as a silent killer due to its lack of symptoms.\nIn depth: ‘All bets are off’\nReproductive rights\nThroughout his campaign Trump “flip-flopped” on the issue of abortion, Chris Michael says. Sometimes he would brag about the singular role he played in overturning Roe v Wade; other times he publicly created distance from multiple anti-abortion positions and insisted that it was an issue for individual states to decide.\nIn Tuesday’s elections, seven states passed measures that enshrine abortion rights in their constitutions – but this will not be the end of the story. Anti-abortion activists will likely challenge the reversal of bans in court, and will fight even harder to push legislation through before more bans are repealed.\nCrucially, if Trump returns to the White House with Republican control of the Senate and House of Representatives, it could have significant implications for abortion access. “Trump has said he would veto a national abortion ban if one reached his desk, but who knows —he could change his mind,” Chris points out. As his tone suggests, few have been reassured by Trump’s promise not to sign a federal ban. This scepticism stems not only from Trump’s history of lying but also from accusations that his camp is playing a verbal sleight of hand, replacing the term “national ban” with phrases like “national minimum standard”, which would essentially achieve the same goal.\n“But even if he doesn’t do that, the GOP could theoretically use this obscure piece of law called the Comstock Act,” Chris adds. This 150-year-old anti-obscenity law bans mailing abortion-related material and was outlined in Project 2025, an extreme 922-page policy document published by a rightwing thinktank as a way to bypass congress altogether and use the legislation to ban the mailing of abortion pills – in effect a national ban.\nSince Roe v Wade established a constitutional right to abortion, the Comstock Act could not be enforced. However, after Roe was overturned in 2022, anti-abortion groups have pushed the idea that the Comstock Act is valid once more.\nImmigration\nBorder control has always been the key Trump issue. Who can forget “Build the wall” and images of children in cages under the child separation policy. This time around, his crackdown on immigration is set to be even more controversial – and wide-ranging.\nAs ever, much vitriol has been aimed at undocumented immigrants. But the president-elect has expanded his ire to potentially include those who legally live in the US. Trump has outlined a mass deportation plan that could target up to 20 million people. According to estimates, there are 11 million undocumented immigrants. There is little detail on how such an unprecedented policy would be put into practice, but as Trump appoints officials in the coming months, they will have a much easier time pushing through these changes regardless of the indirect consequences and larger fallout.\nTrump’s rhetoric has also become more violent, racist and xenophobic than ever. He has warned that mass deportations will “be a bloody story” and claimed immigrants are “poisoning the blood of the country”. Such language echoes the rhetoric of fascists like Mussolini and Hitler, whom Trump reportedly praised while in office, even lamenting that he didn’t have commanders as loyal to him as Hitler did. Trump’s words carry deeply troubling implications for immigrants who are fearful of reprisals from his second administration.\nThe international stage\n“Autocrats are rejoicing,” Chris says about Trump’s victory. “That probably tells you all you need to know”. Trump has on many occasions praised Russia’s president, Vladimir Putin, and the North Korean dictator, Kim Jong-un. His admiration for other strongman leaders such as Hungary’s Viktor Orbán, China’s Xi Jinping and Turkey’s Recep Tayyip Erdoğan is well documented and long held.\nTrump has said that he would end Russia’s war in Ukraine “in one day”, though he has not provided specific details on how. Expectations are that Ukraine will see a significant reduction in military aid from the US – the Trump team have made clear they have no intention of indefinitely maintaining commitment to Kyiv as the war continues to drag on. Volodymyr Zelenskyy, Ukraine’s president, congratulated Trump on his “impressive” election victory on Wednesday. “I appreciate President Trump’s commitment to the ‘peace through strength’ approach in global affairs.”\nIsrael’s prime minister, Benjamin Netanyahu, was among the first leaders to congratulate Trump on his victory. A Trump win is great news for Netanyahu, as Julian Borger writes in this analysis. His return to the White House “removes a substantial barrier to Israel’s full control and potential annexation of at least part of Gaza and the West Bank”.\nThe US is an anchor for many international organisations and treaties: Nato, the Paris climate accord (again) and other institutions could face upheaval due to Trump’s isolationist worldview. Trump has dismissed the climate crisis as “a big hoax” and has pledged to cut funding for Joe Biden’s Inflation Reduction Act, which he derided as the “green new scam”. Instead, Trump plans to pivot heavily toward resource extraction, prioritising oil and gas drilling – including on public lands and in national parks. In July, he emphasised this shift, vowing to “drill, baby, drill”. Analysts warn that a Trump presidency could add billions of tonnes of heat-trapping gases to the atmosphere, which would have devastating global consequences.\nWith the Cop29 climate conference beginning next week, the pressure is even higher for decisive action.\nDemocratic norms\nIn recent months, Trump was labelled a fascist by Kamala Harris and his longest serving former chief of staff, retired general John Kelly.\n“In a weird way, the one thing that isn’t an issue, for now, is the ‘stop the steal’ movement,” Chris says. “Trump was preparing to contest the results of the election and to undermine democracy itself in order to stay in power but because he’s legitimately won, he doesn’t have to do that. So the whole machinery that was built up around this grievance has potentially had the wind taken out of its sails.”\nTrump, a man famous for never letting go of grudges, will probably continue with his mission to undermine and hollow out democratic norms and institutions. Trump has said in many interviews and rallies that he would mobilise the federal government against his personal political enemies and the army against citizens that he called “the enemy within”. A second Trump administration likely poses a severe threat to independence of the justice department and other institutions like the FBI and the CIA.\nTrump has also pledged to dismantle what he calls the “deep state” – in other words the federal bureaucracy – by firing thousands of non-political civil servants and replacing them with loyalists. This purge “poses a threat to the checks and balances system” that stood in the way of his most destructive instincts in his first term, says Chris.\nFreedom of the press, a cornerstone for any functioning democracy, will also likely be in jeopardy. Trump has threatened to jail reporters who do not give up sources and strip broadcasting licences from news outlets as punishment for coverage that he did not agree with. A CNN review of the president-elect’s interviews and speeches over the past two years found that he has called for every major American TV news network to be punished.\nNow the fevered campaigning is over, the real work begins. Trump will be appointing his top team in the coming weeks, which could even include anti-vaccine conspiracy theorist Robert F Kennedy Jr and Elon Musk. For now “all bets are off”, Chris says.\nFor more details on the consequences of a second Trump presidency, read our Guardian series The Stakes\nWhat else we’ve been reading\n-\nIn the second edition of our Black diaspora newsletter, The Long Wave, Nesrine Malik reflects on Kemi Badenoch’s ascension to leader of the Conservatives, and asks if it really is a win for Nigerians. Charlie Lindlar, acting deputy editor, newsletters\n-\nThe story of the GP Thomas Kwan, sentenced to 31 years in jail yesterday for trying to poison his mother’s partner while disguised as a nurse, is truly bizarre, as Mark Brown describes it: “An Agatha Christie-inspired Columbo episode with a splash of Breaking Bad.” Toby Moses, head of newsletters\n-\n“I’m just running free as a bird to give everyone a giggle” – Simon Hattenstone looks back at the rich history of streaking, meeting those who got their kit off for a cause … or because they just felt like it. Charlie\n-\nAs anyone who has seen the viral clips of Maggie Smith in the Nothing Like A Dame doc knows, she was a character – her friend Fiona Golfar confirms it in this lovingly told recollection. Toby\n-\n“Horrible direction, an appalling script, dreadful performances: it really does have it all” – Catherine Bray is unfestive and unsparing in her review of the so-bad-it’s-still-bad Christmas film Holiday Twist. Charlie\nSport\nFootball | Hakan Calhanoglu scored a first-half penalty to give Inter a 1-0 Champions League win over Arsenal, the Gunners’ first European defeat of the season. Aston Villa also lost 1-0, to Belgian side Club Brugge, after Tyrone Mings gave away a bizarre second-half penalty.\nBoxing | Imane Khelif, who won Olympic gold in women’s boxing amid a gender eligibility row, is taking legal action over media reports allegedly detailing her leaked medical records. Reports published in France this week claimed the 25-year-old has XY (male) chromosomes.\nGolf | Rory McIlroy has suggested Donald Trump’s return to the White House could accelerate peace talks between traditional golf tours and the Saudi Arabia-backed Liv Golf. McIlroy even floated the idea of Elon Musk becoming involved in golf’s elongated merger plans.\nThe front pages\n“American dread” says the Guardian while the Mirror asks “What have they done … again?”. The Express goes full Maga: “He’s been shot, convicted of a crime and branded a fascist … but he’s still the people’s choice”. The Times has “Trump promises golden age after sweeping Harris aside”. “Landslide” – that’s the i while the Daily Mail is a bit obvious: “A comeback to Trump all comebacks!”. The Telegraph calls it “Trump’s clean sweep”. “Trump is back” reports the Financial Times, while in the Metro it’s “America’s golden Age”. And finally, the Sun goes with “You’re rehired”.\nToday in Focus\nWhat will Trump do in power?\nThe Guardian’s Washington bureau chief, David Smith, explains how Donald Trump won a second term and what he intends to do with it.\nCartoon of the day | Ella Baron\nThe Upside\nWhen Abi Wilkinson moved to the US after her partner got a new job, she assumed she could continue her work as a freelance journalist stateside. But when visa issues initially prevented her from continuing in her career, she gained a new perspective. She writes for A moment that changed me: “I don’t think I had fully understood how much my self‑esteem was tied to my work and how preoccupied I was with how I was perceived by strangers.”\nWhen her work permit did come through, Wilkinson “decided to prioritise mental wellbeing over status, ambition or self-aggrandising notions about significance. I found a job as a nanny. I was happier than I had been in years.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2368,
  "scraped_at": "2026-02-14T02:26:24.530182",
  "_text_extracted": true
}