{
  "article_id": "c879c310639c",
  "url": "https://fansided.com/why-champions-league-final-keeps-letting-fans-down",
  "title": "Why the Champions League Final keeps letting fans down",
  "date": "20250521T003000Z",
  "domain": "fansided.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Champions League Final is not only the peroration of another season of European soccer, but it's the deciding match of the biggest competition that club soccer has to offer, making it the most watched annual sporting event worldwide.\nRoughly 400 million people tune into the final each year — the continuous appearance of Real Madrid helps those numbers — and it continues to be an incredibly anticipated event. In addition, many fans believe that winning the Champions League is a major contributor to a players’ Ballon D’or campaign, so for many reasons, the weight of the title is massive.\nIn the last few years, the magnitude of the final has never been clearer. Despite the victories of massive teams like Real Madrid, Manchester City, Liverpool, and Bayern Munich, the game itself has continuously lacked the quality one would expect between two of Europe’s best sides.\nYes, Borussia Dortmund and Inter Milan have managed to make appearances and despite massive fan bases, they came into the game as huge underdogs. But it's been less about the matchup between the two teams and more about the grandiosity of the event that has caused the drop in quality of these games.\nThe biggest difference between the Champions League and the World Cup is that the latter represents an entire country. Everybody knows the passion, pride, and nationalism that goes into representing your country on the world's biggest stage. But the Champions League represents elitism, it's the reason behind why clubs spend hundreds of millions on players that can go on to win them finals.\nThe reason there’s continuous dominance in leagues like the Bundesliga, Ligue 1, and recently the Premier League is because the vast majority of the time, the best team and the team that really deserves to win it, will do so. Mainly because of the 38-game season. But in a knockout setting, any team can have an off-day (or two legs in this case) and face early elimination. Managers know this better than anyone, even Jose Mourinho.\n“The Champions League is not the consequence of a great work, Jose Mourinho said in 2014, via ESPN. “You can win the Champions League in the worst season. You can finish fifth and win the Champions League. Liverpool did and Chelsea too.\n\"So the Champions League is something that you can not say 'this is the direction I want to go'. A knockout competition is something that always has a big percentage of unpredictability.”\nJose Mourinho, one of the best ever in European competitions and one of the most polarizing personalities as well, actually admits that the Champions League is down to a certain degree of luck and also willingness to drop one’s pride.\n“Ajax has its own philosophy, and that is to be respected, but sometimes it is necessary to change something,” Mourinho then said in 2019, via BeIN Sport. “Ajax played the second half against Tottenham as if they were a rival to Vitesse in the Dutch championship. So, with their philosophy, they will now watch the Champions League Final on television.\n\"Philosophy is one thing, and strategy is another. In this match, philosophy lost. There was no reaction, there is no shame in changing something, even though it is not in accordance with philosophy, in order to win a football match of this importance.\"\nAjax were heralded for their vibrant attacking and possession-intense style of play that would go on to eliminate both Real Madrid and Juventus in the knockouts. But Mourinho suggests that a failure to adapt against a team that would no longer take them for granted is what caused their elimination.\nPerhaps the biggest difference from a Champions League Final to a normal league game is the dramatic change in game state following a goal. When a team goes ahead in the game against another big team in the cup, more often than not, they will take their foot off the gas and play more conservatively.\nAccording to Fifa Training Centre, teams with less than 33 percent of possession would win the match 14/19 times during the 2022 World Cup knockouts. Of course, it's a different competition, but the quick elimination mentality remains. In addition, three of the four semi-finalists operated in a mid-block, not willing to expose themselves defensively by playing an aggressive style of pressing or a high line of defense that you often see in domestic league matches.\n\"The target is always to be good in all areas when you have possession of the ball,” Said legendary coach Arsene Wenger, via FIFA. “Teams that dominate possession but do not win games, demonstrate a deficit in efficiency in some positions in their team.\n\"It is easier to be more efficient on the counter-attack. If the team that does not have the ball can be disciplined, and if the team that has the ball doesn't score, slowly, the team with the ball will take more risks, so it is possible to get better quality chances on transition to attack.\"\nThis idea has constantly rang true in Champions League Finals. When notoriously pass-happy Manchester City faced a stubborn defense in Inter Milan playing in a 5-3-2 formation, City would adapt and refuse to let Inter play the counter-attacking game. In that match, the goalkeeper Ederson played 55 percent of his passes over 35 yards, he has only done that seven times over the last 59 Champions League matches.\nLooking at the recent finals, let’s see how many of them finished with a ‘low scoring’ result, and how many shots on target there were.\n2024: Real Madrid (6) 2-0 (3) Dortmund\n2023: Manchester City (4) 1-0 (5) Inter\n2022: Real Madrid (1) 1-0 (9) Liverpool\n2021: Chelsea (1) 1-0 (2) Manchester City\n2020: Bayern Munich (2) 1-0 (3) PSG\n2019: Liverpool (3) 2-0 (8) Tottenham\nThat’s right, both Real Madrid and Chelsea scored with their only shot on target. In all but one, the losing team would have more shots on target than the winning side, proving that when a team takes a lead they tend to sit back and try and protect it.\nSince the English sides have been the most prominent country to feature since the Ronaldo-Madrid days, let’s see the results of the FA Cup finals to see if the ‘Final tactics’ theory remains.\n2025: Crystal Palace (2) 1-0 (6) Manchester City\n2024: Manchester United (5) 2-1 (4) Manchester City\n2023: Manchester City (5) 2-1 (3) Manchester United\n2022: Liverpool (2) 0-0 (2) Chelsea (Liverpool on penalties)\n2021: Leicester (1) 1-0 (3) Chelsea\n2020: Arsenal (3) 2-1 (3) Chelsea\nHow about the DFB Pokal Final, German football’s domestic cup. After all, the Bundesliga featured more teams in the final than France and Italy in the last few years. So will the cup final be representative of the open-ended fast play of Bundesliga football? Or will the consistency of domestic cup complacency remain true.\n2024: Bayer Leverkusen (4) 1-0 (2) Kaiserslautern\n2023: RB Leipzig (3) 2-0 (2) Frankfurt\n2022: RB Leipzig (8) 1-1 (5) Freiburg (RB on Penalties)\n2021: Borussia Dortmund (5) 4-1 (4) RB Leipzig\n2020: Bayern Munich (6) 2-1 (1) Frankfurt\nThe only outlier in this list (A team featuring Erling Haaland and Jadon Sancho who combined to score all four goals) still only had five shots on target.\nOf course, the Copa Del Rey should be included with Real Madrid’s record 15 Champions League\n2025: Barcelona (9) 3-2 (7) Real Madrid (After Extra Time)\n2024: Athletic Bilbao (7) 1-1 (5) Mallorca (Bilbao on Penalties)\n2023: Real Madrid (3) 2-1 (5) Osasuna\n2022: Real Betis (4) 1-1 (4) Valencia (Betis on Penalties)\n2021: Barcelona (8) 4-0 (1) Athletic Bilbao\n2020: Real Sociedad (6) 1-0 (5) Athletic Bilbao\nLastly, it wouldn't be right to not include Italy’s domestic finals in this list. After all, AC Milan have won the second most Champions Leagues in the competition’s history, and they have had a team in the final recently.\n2025: Bologna (5) 1-0 (2) Milan\n2024: Juventus (2) 1-0 (0) Atalanta\n2023: Inter (4) 2-1 (6) Fiorentina\n2022: Inter (8) 4-2 (8) Juventus (After Extra Time)\n2021: Juventus (6) 2-1 (4) Atalanta\n2020: Napoli (0) 0-0 (0) Juventus (Napoli on penalties)\nCup finals for many reasons are played in a completely different sporting universe than the rest of the season. A neutral playing ground and the fact that it would at minimum be the third fixture between the sides in a domestic competition are both big factors.\nBut perhaps the most in-depth one is the fact that the cup final means the end of the season, and nothing in that game will carry on to the next fixture. Any radically different tactics, conservative decisions, or any other commonplace features that make these low-scoring cup finals happen are all one-and-done. The manager doesn’t have to explain why everything he set up in possibly a team’s biggest game of the season was the nearly opposite of how they have been playing the entire season. Even if it completely betrays the belief in the system the manager has worked tirelessly to instill in the players in order to ‘buy in’.\nCall it conservatism, or maybe even cowardice if you’re being harsh, the bottom line is that both teams are often more scared to lose the game than they are to win. That may sound confusing, but what it means is that neither manager is willing to take the risks and play open to cost their team the game, hoping the other team instead will be the ones to make that decision. Perhaps more accurately, a cup final is a game of chicken. Both sides set up to counter-attack, and when an immovable object meets an immovable object, well, nothing moves.\nWhile the stakes are so high, and the beliefs surrounding a domestic cup final remains, fans should be prepared for more drab affairs in cup finals in the future, no matter how exciting the teams featuring have been all year.",
  "word_count": 1661,
  "scraped_at": "2026-02-14T01:55:13.641191",
  "_text_extracted": true
}