{
  "article_id": "c889150dbdcf",
  "url": "https://punchng.com/mid-season-momentum-fuelled-our-npfl-title-dream-remo-captain-nduka/",
  "title": "Mid - season momentum fuelled our NPFL title dream – Remo captain Nduka",
  "date": "20250502T053000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Remo Stars captain, Junior Nduka, recounts his journey with the club from the academy to captaining them to their first-ever NPFL title, in this interview with ABIODUN ADEWALE\nCongratulations on winning the 2024/25 NPFL title. How does it feel to be the captain of a team that is winning their first-ever league title?\nIt’s an amazing feeling for me because, over the years, we have been building the team and striving to make sure we become champions one day. Finally, we are and this feeling will be part of me for the rest of my life.\nFrom the youth team to the senior team and then becoming the captain, how would you describe the journey you’ve had with Remo Stars over the years?\nI joined Remo Stars in 2018 as a youth player. Then, there was no Beyond Limits, just Remo Stars. The team was in the second division then and got promoted to the NPFL in 2019. All those times I was with the youth team with many other players who have passed through the system. At the youth team, it was a building process. I had so many teammates who have come and gone but I have been very patient, I kept working hard and the moment I got promoted into the senior team, I knew it was all about performance. So, moving from the youth team to the senior team and leading Remo Stars to a first-ever NPFL title is a big win for me. I am happy that my patience and hard work are paying off. I will also thank my coach, Daniel Ogunmodede, who was our youth coach for putting me through and believing in me.\nWhat role did the club’s long-term structure and development philosophy play in your growth as a player and leader?\nThe coaches and the club actually. They have played big roles in my career. They made me who I am today. There is no doubt about that. I am happier about the privilege of having led the team over the years. The philosophy of developing is something we have maintained in the club and I must say it’s the way it has shaped a lot of my teammates and me.\nThe gesture from the club owner, presenting you with a car for your loyalty, is rare in Nigerian football. What did that moment mean to you?\nThe moment the club president gave the car to me, I must confess, I was short of words. I didn’t even know what to say, I didn’t see it coming at all. It taught me about patience. That was one of the things he mentioned that day. I remember I got an offer from Lobi Stars then but I decided to stay despite the conditions. I decided to stay because I believed we were going to be promoted that same year. So I believe that was what triggered the presentation.\nDid you have a car before then and do you still drive that car to date?\nI didn’t own a car before the chairman gifted me the car and that is what I still drive.\nHow wide was the gap when you compared the salary Lobi offered and what you were earning at Remo then?\nI didn’t know about the salary but I was playing in the NNL with Remo then and you can’t compare salary in the second division to the first division. I am very sure that there was going to be a huge difference. They came then and negotiated with the club, the chairman called me to explain to me but I told him I wanted to stay instead.\nYou led the team during two seasons when the title slipped away narrowly. How did those near-misses shape your mentality and leadership?\nYes, we lost the title twice. The first in 2023 via goal difference. Last season, we also pushed but we fell short. It was painful, especially when you remember that we lost the title on goal difference in 2023. But it didn’t stop there, we kept on striving till we got what we wanted. Now we have won the league with three matches to go. That shows how resilient we are and the lessons we have learnt as a team over the years.\nCan you share a key moment this season when you felt, “Yes, we can actually win the title”?\nAt first, it was difficult because we were competing with top clubs in terms of pedigree. Clubs like Kano Pillars, Enyimba, Rivers United, Rangers International and others. These are clubs that were bigger than us in this country. But the moment we realised we could do it was when we were leading with nine points after the first round. It showed that winning all home games and picking vital away points would help us.\nHow did the first training session after winning the title go?\nWe won the title on Sunday and went back to training on Monday. All the euphoria ended at the chairman’s birthday party and subsequent posts on social media. We didn’t mix that with training at all. It was the same routine, nothing changed. It was not different from what we have been doing all season. We might have won the league but work continues. I think every one of us understands that we have to keep working too without being carried away.\nAside from Remo Stars, you also captained the Home-Based Super Eagles to qualify for the CHAN tournament. What does it mean to play for Nigeria at that level?\nRepresenting Nigeria in the CHAN qualifiers against Ghana was a big move and another experience I am grateful to God and everyone who made it possible. That was a boost for my CV and I am looking forward to many more appearances for my darling country. It meant a lot to me.\nJust like it happened in the NPFL, you have had two disappointments in the preliminary round of the CAF Champions League. How is the team going to bounce back from that this time around?\nThe memories have come and gone. We have put them behind us over the years. We have picked up the broken pieces and we have moved on. That is why we have been able to work relentlessly to make sure we win the league and go back to play on the continent.\nHow have your experiences shaped your leadership style on and off the pitch, especially with younger players coming through the academy like you once did?\nI must say playing under coach Gbenga Ogunbote also helped me a lot. I was able to understand a few things about Nigerian football and when coach Daniel Ogunmodede came back, it was as if he was putting the icing on the cake. That has helped me to grow and also instil the same mentality into the likes of Ahmed Akinyele and Stanley Joseph who came in through the youth team as well. The mentality is that patience is key. Hard work and consistency will help any player grow and shape them into what they want to be in life. You can’t play under a coach forever, so you must pay attention to details.",
  "word_count": 1203,
  "scraped_at": "2026-02-14T01:52:20.880770",
  "_text_extracted": true
}