{
  "article_id": "c89336807b3c",
  "url": "https://www.jamaicaobserver.com/2025/10/29/marauding-mendes-flourishes-psg-world-cup-sights/",
  "title": "Marauding Mendes flourishes for PSG ; has World Cup in sights",
  "date": "20251029T083000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marauding Mendes flourishes for PSG; has World Cup in sights\nPOISSY, France (AFP) — He does not grab too many of the headlines among Paris Saint-Germain’s plethora of stars but Nuno Mendes has been so impressive charging forward down the left wing for the reigning European champions that he might now stake a claim to be the world’s best full back.\n“I see myself as a good full-back but I don’t like to say I am the best,” the 23-year-old Portugal international told AFP in an interview at the club’s training ground just outside the French capital.\nLeft back Mendes has scored three goals and set up three more in 11 matches this season, including a goal and an assist in last week’s 7-2 Champions League win at Bayer Leverkusen and a brilliant run to set up Senny Mayulu for the equaliser in the 2-1 defeat of Barcelona.\nPerhaps the only other full back on a level with Mendes just now is Morocco’s Achraf Hakimi, who occupies the right back position in Luis Enrique’s PSG side.\n“Achraf and I are in good form but it is a team effort — and we all know how quickly things can change in football,” Mendes said of his and his team’s recent success.\nPSG won the Champions League for the first time in their history last season and are top of the standings in Europe three games into this campaign.\nThey are also top of Ligue 1 ahead of a midweek trip to Lorient, having just welcomed Ballon d’Or winner Ousmane Dembele back into the side after a hamstring injury.\n“I love playing here,” said Mendes of being part of a thrilling young side in which Dembele is the biggest star having recently won the Ballon d’Or, thanks to his prolific form last season.\n“I am very pleased for Ousmane,” added the full back who insists collective success is more important than any dreams he may have himself of winning the sport’s most prestigious individual award.\nPSG’s current success has followed a change in approach by the Qatar-owned club’s hierarchy, with the departures of superstar forwards Kylian Mbappe, Lionel Messi and Neymar between 2023 and 2024 and a focus on signing hungry young players with everything to prove.\nMendes was just 19 when he arrived in Paris at the start of the 2021/22 campaign, initially joining on loan from Sporting with whom he had won the Portuguese title in the previous season under Ruben Amorim.\nThe move was made permanent in 2022 for a reported 40 million euros (US$46.5m), and Mendes is now approaching 150 appearances for the Parisians.\nMendes gives Luis Enrique, who arrived as coach in 2023, huge credit in helping him to develop his all-round game.\n“In the beginning I wasn’t very strong defensively; I knew how to attack with pace. Luis Enrique picked up on that and really helped me defensively, which means that now I am better at both,” said Mendes, who started out playing on the left wing in the Sporting youth system.\n“I try to find a balance when it comes to attacking, take a rest when needed. The coach is doing a great job, and not just for me.\n“Versatility is something that Luis Enrique has brought us and that we will always keep, even if he leaves or we go.”\nIf Mendes is a beneficiary of Luis Enrique’s coaching, Portugal are benefiting from having the player in their side as they build towards next year’s World Cup — one win from two games away to Ireland and at home to Armenia next month will see them secure qualification for the finals.\n“I still have a lot to learn, but I can’t say I really have any flaws at the moment, or that there are things I am doing badly,” says Mendes, who set up a goal for Cristiano Ronaldo in Portugal’s recent draw with Hungary in Lisbon.",
  "word_count": 653,
  "scraped_at": "2026-02-14T01:52:49.010956",
  "_text_extracted": true
}