{
  "article_id": "c8a2cae55056",
  "url": "https://gunnerstown.com/arsenal/2023/07/04/the-summer-diaries-an-arsenal-women-special-cl-draw-ins-and-outs/",
  "title": "The Summer Diaries : – An Arsenal Women special , CL draw , ins and outs … ",
  "date": "20230704T091500Z",
  "domain": "gunnerstown.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hello Arsenal Women aficionados!\nThe traditional Arsenal Women Journal might well be on holidays mode but that’s no reason to rest.\nHas the new season already started? The Champions League draw suggests so.\nAs we finished third in the league, we have to go through two qualification rounds if we want to make it to the group stage and build on the incredible run that saw us getting cruelly close to reach the final, last season. Our journey will start on September 6th against Swedish side Linkoping, who finished third in the Damallsvenskan, the Sweden women’s top-flight.\nShould we make it past Lina Hurtig, Frida Maanum and Stina Blackstenius former team, we will face either one of Paris FC, who finished third in France, or FC Kryvbas, who ended runners-up in the Ukrainian Premier Division and reached the Champions League for the first time in their history.\nGoing through the first knockout game against Linkoping won’t be easy, though, as our opponents will be in the middle of their season, which goes from March to November, hence more advanced in terms of fitness. Also, Linkoping are not sending any players to the World Cup in Australia and New Zealand, while we will have numerous players playing at the other end of the world and likely to get past the group stage and possibly all the way to the semifinals and final. The likes of Caitlin Foord, Steph Catley, Lotte Wubben-Moy, Alessia Russo, Sabrina D’Angelo, Cloé Lacasse, Katherine Kühl, Victoria Pelova, Frida Maanum, Lina Hurtig, Amanda Ilestedt and Stina Blackstenius are playing for national teams that are among the favorites to win the World Cup, so they might not come back on time for this perilous game.\nJonas Eidevall, who is still working in the market to bring additional players to the team, will hope that Kim Little and Beth Mead will be available, even partially, alongside Manuela Zinsberger and Jen Beattie, to make sure that the team is experienced enough not to be too nervous while approaching this game but the starting XI could be very experimental. Much will depend on how far Lia Wälti and Noëlle Maritz will go with Switzerland, or Katie McCabe with Republic of Ireland, but there is a real risk that the team will be depleted, especially upfront.\nThe knock-out stage of the World Cup will start a month prior to our game against Linkoping and will go on until less than three weeks before the game, meaning that any of our players who plays in the quarter finals, semi finals or final is almost certainly out of the round one of the Champions League qualification path.\nAnd that’s only the first hurdle, by the way.\nThe good news is that the first hurdle could well be the most dangerous one and, should we overcome it, we will have a good chance to get past Paris FC or FC Kryvbas, three days later, because our opponents will be in a similar phase of their season to us and not in the middle of their campaign. In that case, our superior technical and tactical qualities should make us strong favourites to get to the next round of the Champions League qualifying journey, in October, against a much stronger opponent.\nLet’s not get carried away, though, because the first game will be played in two months from now and our team, by then, could look very different compared to today. Rafaelle has been the only player who left the club, so far, but some other might follow soon, in search of more playing time or better contractual conditions. The World Cup will be an important time for those who are looking for a new challenge or those that are considered as surplus to requirements by Jonas Eidevall. After releasing Fran Stenson and Mana Iwabuchi, a player that never truly got along with the coach vision, Jonas Eidevall could decide to trim the squad a bit more and it is likely that some offensive players might be on their way out. The arrivals of Cloé Lacasse and Alessia Russo – whose transfer is not official yet – mean that we currently have ten forwards, although some are still recovering from injuries, and that could become difficult to handle for Jonas Eidevall.\nGio Queiroz will certainly leave again on loan, to gain experience and get stronger, and so could do Michelle Agyemang, who appears ready to get senior football, regularly, but I have a feeling that Lina Hurtig could be sold, this summer, with Cloé Lacasse taking her place in the squad and battling out with Katie McCabe, Caitlin Foord and Beth Mead (when available) for the two wide positions. The Swede, who arrived from Juventus last summer, has barely played due to injuries but when she did, she never truly convinced. Jonas Eidevall might give her another chance and hope for an injury-free campaign, but her playing time might be very, very limited given the options available to the coach.\nWe will see who comes and who goes, the club started the summer transfer window very aggressively and we could have some answers very soon.\nThe Summer Diaries will continue throughout the months of June, July and August, then the Arsenal Women Journal will return and there are a few more surprises to come…\nSpeak to you soon!\nItalian living in Switzerland, Gooner since mid-nineties, when the Gunners defeated my hometown team, in Copenhagen. I started my own blog and podcast (www.clockenditalia.com) after after some experiences with Italian websites and football magazines. Covering Arsenal Women with the occasional rant about the boys.",
  "word_count": 934,
  "scraped_at": "2026-02-14T02:07:08.871015",
  "_text_extracted": true
}