{
  "article_id": "c8b160709149",
  "url": "https://metro.co.uk/2025/10/26/jamie-carragher-says-arsenal-star-most-influential-player-premier-league-24529558/",
  "title": "Jamie Carragher claims Arsenal star is the  most influential player in the Premier League  | Football",
  "date": "20251026T173000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher believes Arsenal boast the ‘most influential player in the Premier League’.\nThe Gunners extended their lead at the top of the Premier League to four points with a 1-0 win over Crystal Palace on Sunday.\nEberechi Eze scored his first league goal for the Gunners against the club he left over the summer in a deal worth £67.5m.\nGabriel Magalhaes was an injury doubt ahead of the fixture after suffering a small problem in Arsenal’s 4-0 Champions League win over Atletico Madrid.\nBut the Brazilian started the game and helped Arsenal keep their fifth successive clean sheet and tenth of the season in 13 games.\nAsked whether the Crystal Palace squad would have let out a groan when they saw Gabriel on the Arsenal teamsheet, Carragher told Sky Sports: ‘Yes.\n‘I think you can make an argument that he could be seen as the most influential player in the Premier League right now.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘When you think of the clean sheets and the defensive record Arsenal have and also his threat at set-pieces. He’s as influential as anyone, maybe even Erling Haaland.’\nGabriel, who joined Arsenal in 2020 in a deal worth £27m, was hailed as ‘one of the best centre-backs in the world’ after the European win over Atletico Madrid.\n‘For me, Arsenal have taken it to another level this season,’ former West Ham and Aston Villa midfielder Nigel Reo-Coker said on CBS Sports.\nThey look really hard to beat, they’re well organised, there’s real strength in depth now so there’s no excuses anymore, they have everything they need.\n‘They have the weapons to win top trophies, it’s in their hands. They’ve even taken the defence to a new level and they’re just so hard to beat.\n‘We need to have a conversation about Gabriel and ask if he is now one of the best centre-backs in the world? I think so.\n‘Look at the role he plays in the final third. What I love about him is he’s got so much desire to get to the ball, whether that be at the back or when he goes up.\nMore Trending\n‘The two centre-backs pride themselves on keeping clean sheets and are willing to defend all day long. Arsenal might have the best defence in European football as of right now.’\nArsenal were three points clear of Manchester City before the weekend but now find themselves four points ahead of second-placed Bournemouth, with Sunderland back in third.\nMan City were beaten for the first time since the end of August, suffering a 1-0 defeat at Aston Villa, while defending champions Liverpool also lost away at Brentford.\nBournemouth’s victory over Nottingham Forest seem them climb to second, one point above newly-promoted Sunderland who stunned Chelsea at Stamford Bridge.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal striker Gabriel Jesus admits he is ‘interested’ in joining former club\nMORE: Man Utd make decision as Ruben Amorim asks to sign Barcelona star\nMORE: ‘He has to be taken out’ – Gary Neville says Arne Slot must drop Liverpool signing",
  "word_count": 577,
  "scraped_at": "2026-02-14T01:52:49.013056",
  "_text_extracted": true
}