{
  "article_id": "c8e11778c444",
  "url": "https://theathletic.com/4729253/2023/07/30/rui-vitoria-mohamed-salah-can-play-at-the-top-for-five-more-years-he-leads-for-egypt-and-liverpool/",
  "title": "Rui Vitoria :  Mohamed Salah can play at the top for five more years – he leads for Egypt and Liverpool  ",
  "date": "20230730T061500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Rui Vitoria signed his four-year deal to become Egypt manager in July 2022, the first person to message him was the captain, Mohamed Salah.\n“I started talking with some players but he was the only one who sent me a message,” Vitoria tells The Athletic.\nAs the captain of his national team that may seem obvious but it was the first example to Vitoria as to why he is managing one of the world’s best players.\nAdvertisement\n“The stars sometimes are on the pitch and off it they are not the stars. Salah is both,” says Vitoria.\n“He has a big impact on his colleagues. He has a positive energy and is humble. He is always ready to help the team and his country.”\nThe 53-year-old’s first year in charge could hardly have gone better. Qualification for the 2023 African Cup of Nations was secured in June and Vitoria boasts a 100 per cent record — his seven wins the best start by an Egypt coach.\nSalah has scored four goals and provided four assists in five appearances.\n“He has the details that make all the difference,” Vitoria says. “It is incredible how he decides so fast and how he is always in the right specific space. He is very important for us.”\nSalah is an icon, worshipped as one of the best Egypt has ever had and his levels display no signs of stopping at 31. Two years remain on the Liverpool contract he signed last summer.\n“He will play four or five more years at the top level, because he has the skills that you can’t lose, the decision-making and game intelligence,” says Vitoria\n“He’s a fantastic professional. He looks to keep improving to stay at a high level. Sleep, breakfast, the gym — anything and everything.”\nSalah will hope to represent his country at the 2026 World Cup. His last appearance on the biggest stage was hampered by the shoulder injury suffered in the 2018 Champions League final. Egypt exited the tournament in Russia at the group stage.\nThere is determination born out of the setbacks of 2022. Egypt were beaten by Senegal in the AFCON final on penalties and then failed to qualify for the World Cup in Qatar after another penalty-shootout defeat to the same side. Salah did not get the chance to take a penalty in the first, and missed in the second while being blinded by laser pens.\nAdvertisement\n“He’s determined to win everything,” says Vitoria. “He’s so desperate to do it for the country. He is a winner, never afraid and doesn’t want to miss that opportunity.”\nHis impact is felt on and off the pitch and he is a leader. It is a responsibility he will now have to shoulder more of at Liverpool after the departures of captain Jordan Henderson and his deputy James Milner. While Virgil van Dijk is the obvious candidate, Vitoria has witnessed Salah’s captaincy credentials.\n“Salah is a very good captain, the profile that I like — but I don’t like giving opinions on teams and environments I don’t know. Not only a captain on the pitch he helps to solve all problems at all times,” says Vitoria.\nEgypt’s first aim is to try and win the upcoming AFCON which was postponed until January 2024 due to adverse weather conditions expected in the Ivory Coast this summer. Liverpool could lose their talisman for a month for the second time in three seasons.\nVitoria can see both sides of the tournament scheduling argument. It benefits the national team because they inherit players in mid-season rhythm but understands it affects clubs and the individuals because of the switch in conditions, emotion, mentality and mindset. “It is better to be at the end of the season to stop creating problems,” says Vitoria.\nLiverpool also face the possibility of being without Salah for the start of the 2024-25 season as Egypt have qualified for the Olympics. Under-23 manager Rogerio Micale will select the squad with the FA and Vitoria part of the discussions.\nThat could be Salah’s final season at Anfield and it leads to the topic of Saudi Arabia, who have publicly expressed their desire to add Salah to the players in their league.\nVitoria managed Al-Nassr for nearly two years, leading them to the 2018-19 Saudi League title.\nAdvertisement\nHe was part of conversations with the members of the government in which detailed ambitions to create one of the biggest leagues in the world were made clear.\n“When Cristiano Ronaldo went there, they made a boom (big statement) and had to bring in players. The offers are very high and the players are thinking about their lives and now we see them going,” says Vitoria.\nThere is little surprise at the speed players have joined the revolution given the money on offer.\n“I believe it will be a strong league but I also have doubts,” says Vitoria. “I know the personality of the people and their mindset can change fast. Now they are very motivated to invest but they could one day change their mind and stop. In Europe, things are more planned with organisations, those clubs don’t depend on emotions.”\nThe key objective Vitoria was set when he took the Egypt job was to secure qualification for the 2026 World Cup. He replaced Ehab Galal, who only lasted three games.\n“In the beginning, I felt the people didn’t believe in these players and they thought we didn’t have quality,” he says.\n“I thought differently — I liked the spirit and competitiveness the players had and the play-to-win attitude.”\nHis squad took to his methods immediately and the results on the pitch speak for themselves.\n“When I arrived, I felt the players played very fast and made decisions that would lose the ball. We needed to change that,” he says. “After the first training camp we saw it was possible. We had to choose one way and show that to the players.”\nBelief rocketed after a 2-1 friendly victory over Belgium last November, who were ranked second in the world. Vitoria points out the 2-1 victory over Guinea, their most recent result which secured AFCON qualification as a key moment in their development.\n“Belgium was a risk but it was important to face a big team to check our level,” he says. “The performance was excellent. Then Guinea, it is so tough to play away in Africa and they have a very good team full of players playing in Europe.”\nAdvertisement\nSupporters are enjoying the new style of attacking football which aims to dominate and control games.\nVitoria’s first job as an international manager has taken time to get used to, but he is enjoying the extra time he has to prepare for games compared to club management.\nWork does not stop. Every day his team are reflecting on the last training camp, analysing players, scheduling games to go to, tracking young players and dual nationals, while discussing tactics to plan the next camp. Most days he is attending a game.\nConnections with clubs allow them to share reports of performances and medical information to help them plan camps and individual development. Vitoria occasionally messages his players to check in or give advice.\n“It’s like we are preparing for one or two months for a festival,” Vitoria says. “Nothing can fail. I’m upset when something fails because we have the time to organise everything.”\nIt has not just been on the pitch where Vitoria has wanted change and he has worked closely with the Egyptian FA to implement ideas that will instigate long-term development and create pathways.\n“Egyptian football has potential. The national team is an example for the country. It is difficult to get everybody working together but we try to go step by step,” he says.\n“The aim is to have players with character; fans that love football. We need more professionalism. We have to improve the quality of training facilities and the development of coaches. If you don’t have good coaches it is difficult to have good players. The quality of the training in the youth teams needs work.”\nYouth development is an area that has played a big part in Vitoria’s career. Egypt hosted the Under-20 AFCON this year but went out in the group stages with only one point.\n“The under-21 team has potential but we need them playing for their club teams,” Vitoria says. “If they don’t, and you lose one or two years between age 18 and 21 without senior competition, it is difficult to reach a big level. Those opportunities are difficult.”\nAdvertisement\nHe references the chances available to youngsters in Europe and he has experience at club level, most notably at Benfica. The Portuguese side’s model was to develop and sell young players with high potential for big profits. “Therefore, those players have to play,” Vitoria says.\nVitoria has played a role in the development of players who have had success in Europe’s top leagues, including Manchester City’s Ruben Dias and Ederson, Paris-Saint Germain’s Renato Sanches and Atletico Madrid’s Joao Felix.\n“Players are a global map,” says Vitoria. “If the player is only very strong in the physical and tactical side it is not enough. We work for the players to be strong in all the states; personal, professional, mentality and social.\n“You have to touch the brains of the young players to work on the mindset of education, adaptation; the simple things. When Ruben Dias arrived in Manchester City he could already speak English. Mentality and personality can be the key to developing other areas.”\nThe success of the long-term ambitions for Egyptian football will be assessed over time, but the first big test on the pitch will be the upcoming AFCON.\n“It is more difficult than the World Cup,” says Vitoria. “That is a different style, different environment, more game-focused. Here there is football but more emotion, it is a different culture, the influence of people, fans and the pressure is heightened. There are a lot of good teams but we are going to try and win.”\n(Top photo: Fareed Kotb/Anadolu Agency via Getty Images)",
  "word_count": 1689,
  "scraped_at": "2026-02-14T01:53:51.861207",
  "_text_extracted": true
}