{
  "article_id": "c92aa1306da9",
  "url": "https://www.meathchronicle.ie/2023/10/27/casemiro-in-race-against-the-clock-to-be-fit-for-manchester-derby/",
  "title": "Casemiro in  race against the clock  to be fit for Manchester derby",
  "date": "20231027T164500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Casemiro in ‘race against the clock’ to be fit for Manchester derby\nBy Simon Peach, PA Chief Football Writer\nErik ten Hag revealed Casemiro is in a “race against the clock” to make the Manchester derby and says the squad is behind Alejandro Garnacho as he faces a potential ban for a social media post.\nThe eyes of the footballing world will be on Old Trafford this Sunday afternoon as treble winners Manchester City look to end the Red Devils’ unconvincing three-game winning streak in all competitions.\nUnited have stumbled to those victories against Brentford, Sheffield United and Copenhagen, with a vastly improved performance required if they are to lay a glove on Pep Guardiola’s men.\nThe midfield battle looks key and Ten Hag says his side may be missing Casemiro for a third straight game, with an ankle injury sustained on Brazil duty putting his place in jeopardy.\n“Aaron (Wan-Bissaka is back) in training today and Case is a race against the clock,” Ten Hag said. “No, not 100 per cent.”\nCasemiro had trained ahead of Tuesday’s Champions League clash against Copenhagen – a group match he was unable to play in due to suspension.\nThe Red Devils were made to sweat in a narrow 1-0 victory against the Danish champions, with Andre Onana producing a stoppage-time penalty save that saw the under-fire goalkeeper mobbed by team-mates.\nGarnacho later uploaded a photo on X, formerly known as Twitter, of the United players celebrating with the Cameroon international with a caption featuring two gorilla emojis.\nThe post was quickly deleted and Onana defended his team-mate, who he said was trying to express “power and strength” as he added “this matter should go no further”.\nBut the Football Association has punished players in the past for making racial references on social networking sites and is understood to have sought Garnacho’s observations.\n“Not (concerned about a ban) in this moment,” Ten Hag said. “We are talking with the FA.\n“But what you see and I can confirm that and I want to emphasise, we are together, we are United and we have seen that in the post of Andre Onana.”\nFormer United striker Edinson Cavani was banned for three games and fined £100,000 in 2020 for using the Spanish phrase ‘Gracias negrito’ – which translates as ‘thanks little black’ – below a friend’s Instagram post.\nThe Uruguay striker also underwent a two-hour face-to-face training course for a comment said to be a term of endearment in his native Uruguay.\nThe previous year Bernardo Silva was given a one-match ban and fined £50,000 by the FA for his tweet to Manchester City colleague Benjamin Mendy.\nThe Portuguese tweeted an image of a young Mendy alongside an image of the cartoon brand mascot of Spanish confectionery brand Conguitos, with the caption “Guess who?”\nSilva could be lining up at Old Trafford against Garnacho this weekend in the 191st Manchester derby – a match that could define United’s mood at a key stage of the season.\n“Definitely you see we are back where we wanted to be in that this is a hard team to beat,” United boss Ten Hag said. “They find a way to win, so we are going in the right direction.\n“I think it’s a match above many other derbies. It’s so huge because it’s Manchester, internal.\n“But I think it’s also about world football and all the eyes will be on this game global-wide.\n“In this moment they’re six points ahead, we’re six points back, so we have to catch up.\n“We know we have to progress the team, so we have to make developments.”",
  "word_count": 605,
  "scraped_at": "2026-02-14T02:00:57.107473",
  "_text_extracted": true
}