{
  "article_id": "c93495c83cbb",
  "url": "https://www.teamtalk.com/news/transfer-gossip-newcastle-use-financial-power-deliver-liverpool-body-blow-125m-midfielder-chase-everton-ditch-playmaker-bid",
  "title": "Transfer Gossip : Newcastle to use financial power to deliver body blow to Klopp and Liverpool in £125m midfielder chase ; Everton ditch move for playmaker",
  "date": "20230203T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Transfer Gossip: Newcastle to use financial power to deliver body blow to Klopp and Liverpool in £125m midfielder chase; Everton ditch move for playmaker\nNewcastle are ready to use their financial pulling power to join the race to sign a top Liverpool and Manchester City midfield target, while Friday’s Transfer Gossip reveals why Everton have likely dropped their interest in signing a former Real Madrid free agent.\nTOON LOOKING TO TEMPT ENGLAND MAN TO TYNESIDE\nNewcastle have reportedly joined the race to sign England midfielder Jude Bellingham from Borussia Dortmund next summer and hope their financial power can lure the player to Tyneside.\nBellingham has emerged as one of the most in-demand players in world football. He’s now a regular starter for England and has also captained Dortmund in the Champions League, despite only being 19.\nLiverpool, Manchester City and Real Madrid are thought to be the three clubs at the front of the queue for the teenager’s signature. Indeed, Bellingham’s father Mark was reportedly in talks with the Reds during the January transfer window.\nBut now reports in Germany suggest that Newcastle are ready to throw their ring into the hat.\n“Bellingham has a decision to make and one thing is clear: staying at Dortmund is no longer an issue for him, despite the fact he identifies with the club,” reports SportBild.\n“Real Madrid, in particular, have once again identified a great need in midfield, [but] Newcastle United and now trying to get into a game of poker with the big four clubs.”\nUnclear if Bellingham would join Newcastle project\nBild does not actually mention if Newcastle could lure the England man to St James’ Park. However, Eddie Howe’s men certainly pack a huge financial punch and are clearly a club on the rise in English football.\nTheir fan base is also similarly fanatical to Dortmund’s, which could be of interest to Bellingham.\nNewcastle would likely have to double their current transfer record to sign the midfielder though. They forked out €70m to snatch Alexander Isak from Real Sociedad last summer, but would obliterate that deal if they can tempt Bellingham to join Howe’s project.\nDortmund fully intend to achieve a club-record sale for Bellingham next summer, with the teenager valued at around €140m (£125m).\nThat sort of figure is not expected to be an issue for Newcastle’s owners PIF, however. Indeed, the Toon are still currently valued as the richest club in world football.\nEVERTON RULE OUT PLAYMAKER MOVE\nEverton are unlikely to sign Isco on a free transfer after failing to bolster their squad in the transfer window.\nThey looked at Ghana captain Andre Ayew before he opted to join Nottingham Forest instead. However, it was thought that a potential Isco deal was till on the tbale.\nHowever, a report in The Independent claims that Sean Dyche fears the former Real Madrid playmaker lacks the physicality needed to play in the Premier League.\nThe Toffees thought they had clinched a loan deal for Arnaut Danjuma but ended up waiting for Villarreal to release some papers. That then allowed Tottenham to hijack the transfer, with the Netherlands international already getting off to a flying start in north London.\nEverton were also interested in a host of other forwards.\nThey agreed a fee for Kamaldeen Sulemana but he preferred to join Southampton, while they offered Udinese £20million for Beto but did not believe he was worth his £35 million release clause.\nThat leaves Dyche looking to revitalise a Toffees squad that is in the relegation places.\nPOGBA COULD BE PACKED OFF TO MLS\nPaul Pogba’s future at Juventus is in serious doubt, with the Turin giants reportedly considering the possibility of selling him to and MLS club, or even terminating the Frenchman’s contract.\nThe 29-year-old made his return to Juve last summer, six years after he left them to rejoin Manchester United for a then world record £100m fee.\nWhile United fans rejoiced after getting rid of a player who despite his unbelievable talent was barely even consistent, Juventus supporters are in despair as his return to the club has been even worse than how things went in his final seasons at Old Trafford.\nThat is due to the fact that he has not played a minute for the Bianconeri due to a knee injury. Indeed, he only made his return to the bench as an unused substitute during the club’s shock 2-0 defeat by Monza at the weekend.\nAs a result, the prospect of Pogba’s contract being terminated at the end of the season is no longer impossible, as reported in the Daily Mail. There is also a chance he could be sold to a less competitive league like the MLS.\nIt really would be some downfall for someone of Pogba’s quality if he ended up in America before he even turns 30.",
  "word_count": 805,
  "scraped_at": "2026-02-14T01:59:41.723928",
  "_text_extracted": true
}