{
  "article_id": "c942e9cb07a4",
  "url": "https://www.finanznachrichten.de/nachrichten-2023-05/59097290-britvic-plc-interim-results-12-015.htm",
  "title": "Britvic plc Interim Results - 12 - ",
  "date": "20230516T070000Z",
  "domain": "finanznachrichten.de",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "DJ Britvic plc Interim Results\nBritvic plc (BVIC ) Britvic plc Interim Results 16-May-2023 / 07:00 GMT/BST\n-----------------------------------------------------------------------------------------------------------------------\nBritvic plc Interim Results - 16 May 2023\nFor the six months ended 31 March 2023\n'An excellent start to the year'\nGroup Financial Headlines:\n-- Revenue increased 7.9%1 to GBP794.0m (AER +10.4%)\n-- Adjusted EBIT increased 16.7%1 to GBP85.3m (AER +16.1%), operating profit increased 21.5%1\n-- Adjusted EBIT margin increased 80bps1 to 10.7% (AER +50bps)\n-- Profit after tax increased 21.2%1 to GBP54.4m\n-- Adjusted earnings per share of 22.8p, up 17.5%\n-- Interim dividend of 8.2p, up 5.1%\n-- Adjusted net debt/EBITDA of 2.2x, in line with the same time last year\nHighlights:\n-- Consumer demand for our brands remains strong - Q2 volumes in growth\n-- Successfully managing the challenging inflationary environment\n-- Continued investment in growth capacity, with new lines operational in GB and Brazil\n-- Standout performance from Tango and Pepsi MAX\n-- Robinsons relaunch to accelerate flavour concentrates\n-- Further share buyback programme announced, of up to GBP75m over the next 12 months\n6 months ended 6 months ended Underlying 31 March 31 March % change % change 2023 2022 actual exchange constant GBPm GBPm rate (AER) exchange rate1 Revenue 794.0 719.3 10.4% 7.9% Adjusted EBIT 85.3 73.5 16.1% 16.7% Adjusted EBIT margin 10.7% 10.2% 50bps 80bps Operating profit 80.7 67.1 20.3% 21.5% Operating profit margin 10.2% 9.3% 90bps 120bps Profit after tax 54.4 45.9 18.5% 21.2% Basic EPS 21.0p 17.2p 22.3% Adjusted EPS 22.8p 19.4p 17.5% Interim dividend per share 8.2p 7.8p 5.1% Adjusted net debt/EBITDA 2.2x 2.2x - See glossary on page 15 for definitions of performance measures and appendix 1 for reconciliations of non-GAAP measures\n1. Adjusted for constant currency exchange rates\nSimon Litherland, Chief Executive Officer commented:\n\"We have delivered an excellent start to the year, making great progress on our People, Planet and Performance measures. Our continued focus on lower calorie, healthier drinks has resulted in some standout performances, including Pepsi MAX and Tango in Great Britain as well as Ballygowan 'Hint of Fruit' in Ireland. We have successfully mitigated the impact of the challenging inflationary environment, while continuing to offer consumers great quality and value at affordable prices. Looking ahead, we will be activating a series of exciting marketing and innovation campaigns this summer. We have a fantastic portfolio, a well-invested business, and a very talented team, so I am confident that we will continue to make further strong progress this year and beyond, creating value for all our stakeholders.\"\nFor further information please contact:\nInvestors: Steve Nightingale (Director of Investor Relations) +44 (0) 7808 097 784 Media: Stephanie Macduff-Duncan (Head of Corporate Communications) +44 (0) 7808 097 680 Stephen Malthouse (Headland) +44 (0) 7734 956 201\nThere will be a webcast of the presentation given today at 09:00am by Simon Litherland (Chief Executive Officer) and Chris Hancock (Chief Strategy Officer). The webcast will be available at www.britvic.com/investors with a transcript available in due course. To ask a question on the webcast, please dial +0808 109 0700 or +44 (0) 33 0551 0200 and quote Britvic Interim Results when prompted by the operator.\nNote to editors\nAbout Britvic\nBritvic is an international soft drinks business rich in history and heritage. Founded in England in the 1930s, it has grown into a global organisation with 37 much-loved brands sold in over 100 countries.\nThe company combines its own leading brand portfolio including Fruit Shoot, Robinsons, Tango, J2O, London Essence, Teisseire and MiWadi with PepsiCo brands such as Pepsi, 7UP and Lipton Ice Tea, which Britvic produces and sells in Great Britain and Ireland under exclusive PepsiCo agreements.\nBritvic is the largest supplier of branded still soft drinks in Great Britain and the number two supplier of branded carbonated soft drinks in Great Britain. Britvic is an industry leader in the island of Ireland with brands such as MiWadi and Ballygowan, in France with brands such as Teisseire, Pressade and Moulin de Valdonne and in its growth market, Brazil, with Maguary, Bela Ischia and Dafruta. Britvic is growing its reach into other territories through franchising, export and licensing.\nBritvic is a purpose driven organisation with a clear vision and a clear set of values. Our purpose, vision and values sit at the heart of our company, driving us forward together to create a better tomorrow. We want to contribute positively to the people and world around us. This means ensuring that our sustainable business practices, which we call Healthier People, Healthier Planet, are embedded in every element of our business strategy.\nOur purpose: Enjoying life's everyday moments\nOur vision: To be the most dynamic soft drinks company, creating a better tomorrow\nOur values: We care, We're courageous, Own it, Stronger together, Act with Pace\nBritvic is listed on the London Stock Exchange under the code BVIC and is a constituent of the FTSE 250 index.\nFind out more at Britvic.com\nCautionary note regarding forward-looking statements\nThis announcement includes statements that are forward-looking in nature. Forward-looking statements involve known and unknown risks, uncertainties and other factors including the COVID-19 pandemic, which may cause the actual results, performance, or achievements of the Group to be materially different from any future results, performance or achievements expressed or implied by such forward-looking statements. Except as required by the Listing Rules and applicable law, Britvic undertakes no obligation to update or change any forward-looking statements to reflect events occurring after the date such statements are published. This announcement contains inside information related to a share buyback programme. The person responsible for making this announcement is Clare Thomas, Company Secretary.\nAlternative performance measures\nThe annual financial statements of the Group are prepared in accordance with UK-adopted International Financial Reporting Standards (IFRS). The condensed set of financial statements included in this interim results announcement has been prepared in accordance with UK-adopted IAS 34 'Interim Financial Reporting'. We use certain non-IFRS alternative performance measures to provide additional information about the Group's performance. Non-IFRS measures may be considered in addition to, but not as a substitute for or superior to, information presented in accordance with IFRS and are also used internally to measure and manage the business. Non-IFRS measures are defined in the glossary on page 15 and reconciled to the nearest IFRS measure in Appendix 1.\nMarket data\nGB take-home market data referred to in this announcement is supplied by Nielsen and runs to 25 March 2023. ROI take-home market data referred to is supplied by Nielsen and runs to 26 March 2023. French market data is supplied by Nielsen and runs to 26 March 2023.\nNext scheduled announcement\nBritvic will publish its Q3 trading statement on 27 July 2023.\nChief Executive Officer's Review\nToday we report our results for the six months to 31 March 2023. I am delighted with our progress in the first half, both in terms of key performance measures and our strategic priorities. Once again, the Britvic team demonstrated their passion and commitment, and I want to thank them for this and the crucial part they play in driving our progress. The elevated inflationary environment and global supply chain challenges are well-documented in the media and we have not been immune to these pressures. Our procurement and commercial teams have done an outstanding job of ensuring continuity of supply and effective revenue management, while continuing to offer consumers fantastic, affordable brands.\nRevenue and adjusted EBIT are ahead of last year, at +7.9% and +16.7% respectively, on a constant currency basis. Consumer demand has remained solid, with only a modest volume decline in the first half. Through a combination of revenue growth management actions and cost discipline we have been able to mitigate the cost inflation pressures. More recently, we have seen a sequential improvement, with Q2 volume slightly ahead of last year, up 0.6%. Adjusted EBIT margin was 80bps ahead of last year, aided by the planned phasing of A&P expenditure into the second half. Britvic is a highly cash-generative business with a robust, well-financed balance sheet. With confidence in our strategy and growth momentum, we are confirming a further share buyback programme of up to GBP75m over the next 12 months, following the completion in February 2023 of the initial GBP75m buyback announced last year.\nHealthier People, Healthier Planet is a key pillar of our strategy. Across our portfolio, we continue to expand our offering of healthier choices with lower sugar reformulations and the introduction of an 'added benefits' Robinsons range. Our focus on the planet will see Ballygowan in Ireland produced using 100% locally-sourced renewable electricity. In GB, we are investing GBP8 million in an industry leading heat recovery system at our Beckton site, which will save 1,200 tonnes of carbon annually and decarbonise 50% of the site's heat demand. Our Aqua Libra business launched London's first WasteShark in Canary Wharf to clear plastic waste from the area's bodies of water.\nA growth strategy\nWith a portfolio of market-leading brands, multi-channel routes to market, collaborative customer relationships and a well-invested supply chain, we set out our strategic framework as follows:\nOur future focus remains on four key strategic priorities:\n-- Build local favourites and global premium brands\n-- Flavour billions of water occasions\n-- Healthier People, Healthier Planet\n-- Access new growth spaces Each of our markets has a defined role to play:\n-- GB - to lead market growth\n-- Brazil - to accelerate growth and expand our presence\n-- Other International - to globalise premium brands and improve profitability in Western Europe Underpinning this strategy are three critical enablers:\n-- Generate fuel for growth through efficiency\n-- Transform organisational capability and culture\n-- Selective M&A to accelerate growth\nMarket review\nGreat Britain\nIn GB, we have delivered a strong performance, growing revenue across both our own brands and the PepsiCo portfolio. The retail and hospitality channels increased revenue by 9.7% and 12.5%, respectively.\nWe went early with price movements in Q1 this year, to offset double digit cost inflation and to avoid the lag we experienced last year, when cost of goods increases impacted us from the start of the financial year but we were only able to respond through pricing in Q2. We have seen a sequential improvement in volumes as we moved into Q2, returning to volume growth and building momentum as we head towards the key summer trading period. Importantly we have carefully managed promotional activity, pack architecture and mix, ensuring that our brands continue to provide consumers with great quality and value at affordable price points.\nPepsi MAX has continued to lead the cola category growth. Our taste challenge results show that 70% of consumers prefer the taste of Pepsi MAX, and our range of appealing flavours continue to drive incremental brand and category growth. In Champions League football and music festival sponsorship, MAX has proven marketing platforms with strong consumer appeal, providing fantastic in-outlet activation opportunities.\nTango has continued its success this year, with 39.7% revenue growth. Brand retail sales value, at GBP84m, has grown by GBP53m since 2019. Much of the growth has been driven by our range of great-tasting, sugar-free variants, such as Berry Peachy, Dark Berry and, more recently, Paradise Punch. The focus on flavour innovation means that new flavours account for 50% of brand value, compared to 20% in 2019. Our new Dark Berry advertising campaign is now live, and our Berry Peachy emoji parody PeachPolice campaign won Best Social Strategy at the prestigious 2023 Campaign Media Awards. Led by our in-house studio INFUSED in collaboration with our agency mSIX and content partners LADbible Group, this was one of the first campaigns to take insights from our marketing excellence programme and create a digital-first ecosystem that genuinely engaged with our targeted Gen Z audience.\nWe have commissioned another can line at our Rugby factory to meet demand for our carbonates brands. Not only will this support increasing consumer demand for our multi-pack cans, but it has also enabled us to bring Rockstar production in-house. Since taking on the brand in 2021 under a co-pack model, we have suffered several issues that have impacted our ability to supply customers and effectively activate marketing campaigns. The energy category is a significant opportunity for us, and with PepsiCo, we will continue building brand equity. This year we are increasing investment, resourcing a new regional field sales team to deliver outstanding execution in outlet. We will soon be announcing an exciting new music partnership.\nThe new line also allows us to launch Lipton Ice Tea in a can format. Widely available in Europe, this will be a brand-new pack format for Lipton in GB, enabling us to continue to grow the brand. Our plant-based brand, Plenish, continued to build scale. Being part of Britvic has enabled the brand to expand distribution and gain listings, leveraging our strong customer relationships. The retail sales value for the shots range increased by 62%, and plant-based milk was up by 26%. London Essence has expanded distribution in retail, and the Freshly Infused fount can now be found in 1,200 outlets. AquaLibra Co also continues its growth and, ahead of Global Recycling Day on 18 March, launched London's first WasteShark in Middle Dock at Canary Wharf in partnership with the Canary Wharf Group. The WasteShark is a marine robot designed to be harmonious with the environment, which will clear plastic waste from the area's bodies of water while collecting data to improve the surroundings.\nIn the second half of the year, we have some exciting plans. We recently started the relaunch of Robinsons to accelerate our flavour concentrates business and lead the squash category in GB. Established in 1823, Robinsons has a retail value of GBP200m. Bought by nearly half of all UK households, with over nine million glasses consumed daily, the brand has firmly secured its position in homes nationwide. Our latest activity, building on the success of the recent good/better/best portfolio segmentation, is designed to disrupt the category norms by making the squash aisle more exciting and easier to navigate. As well as a new brand visual identity to improve shelf standout, we are bringing to market a new range of innovations, pack formats and an exciting new marketing campaign.\nAlso in the second half, our new small PET line will go live in Beckton, facilitating the acceleration of our targeted growth in Immediate Consumption. Beckton will also be the home for our innovative new heat recovery system. The GBP8m investment is part funded by a GBP4.4m government grant from the Department for Energy Security and Net Zero. This is one of the largest grants ever awarded, reflecting the innovative nature of the technology. The system will enable us to switch our heating from natural gas boilers to carbon free heat extractors.\nBrazil While Brazil is an identified growth market within our strategy and has delivered double digit revenue growth over several years, the extreme inflation experienced last year required a correction in margin. Brazil is particularly reliant on juice pricing, especially our fruit processing business, which has been hit hardest by the extreme volatility in agricultural commodities driven by poor crop yields. Achieving the margin shift required several levers to be pulled at the same time, including increasing headline price at multiple points during last year, and flexing our recipe agility to manage cost of goods. We have also been proactively managing our mix, such as by building our higher margin categories such as flavour concentrates, premium grape juice and Fruit Shoot. At the same time, we have maintained our commercial and operational discipline, sharpening our focus on superior in-store execution, and increasing production capacity on growth brands such as Fruit Shoot.\nWe have invested in sponsoring Carnival, a vast series of events that brings people out onto the streets to celebrate. In addition, we have activated our brands around sport, sponsoring events such as Circuito das Estações (The Circuit of the Stations), which is synonymous with street racing across the major cities of Brazil. There are four stages, each representing a new season of the year and a time to seek a new goal. Other sports sponsorships have included the Maguary football team and the South American volleyball championships.\nOther International\nIreland delivered a strong first half, with growth across the portfolio and successful revenue management activity. I am particularly pleased with the success of Ballygowan's 'Hint of Fruit'. Leveraging the strong brand equity of Ireland's leading water brand, we innovated into the growing flavoured water category. Sugar-free, and with less than 3 calories per serve, Ballygowan with a 'Hint of Fruit' is sourced locally and available in 3 great tasting flavours: Strawberry, Summer Fruits, and Mango and Passion Fruit. A year after launch, it has achieved an 18% share of the flavoured water category and nearly EUR6m of retail sales value, making it the number one soft drink launch in Ireland.\nAs part of our healthier planet strategy, and in keeping with the Ballygowan brand, we've recently entered into an agreement for Ballygowan production to be 100% wind powered, helping to reduce our direct carbon emissions by 90%. This has been achieved through a new Customer Corporate Power Purchase Agreement (CPPA) with Flogas Enterprise, and is the first Irish-based CPPA of its kind with a drinks brand in Ireland. It will allow Britvic Ireland to fund electricity generation, producing enough electricity annually to power our production facility in Newcastle West. Every Ballygowan bottle is also made from 100% recycled plastic and is fully recyclable.\nIn France, trading has been more challenging in the highly competitive retail market. Pricing discussions have been difficult and have concluded much later than in our other markets. In the first half, we faced double-digit inflation with minimal price benefit to mitigate the impact; while pricing has now gone through, it is not sufficient to cover inflation and we are also yet to observe volume impacts in market. Strategically we continue to build resilience, simplifying the Teisseire range globally, with a strong new visual identity, and consistent branding across all markets. Going forwards, this will improve supply chain resilience and manufacturing benefits, as well as support customer negotiations. In addition, we continue to focus on innovation, with lower sugar and natural ingredient ranges to meet consumer needs.\nOur global premium brands, London Essence and Mathieu Teisseire, continued to make progress in the first half. London Essence has secured an exclusive pouring agreement with Ennismore Hotels, a premium global hospitality brand majority-owned by Accor, as well as Ritz Carlton listings in Melbourne and Hong Kong. The crafted soda range has expanded with two new flavours - Aromatic Orange & Fig, and Raspberry & Rose. While Mathieu Teisseire recently won gold at the prestigious Monde selection awards 2023 for four of our new flavours. New listings have also been secured for two tea chains across China as well as new listings in Thailand, Indonesia, and Malaysia.\nOutlook\nWhile all companies have faced significant economic uncertainty and considerable inflationary pressures, the soft drinks category continues to demonstrate high levels of resilience. Soft drinks are an affordable staple, offering great quality and value choices for all occasions. We have a portfolio of leading brands enjoyed by millions of consumers. Our strategy is building momentum, and we will continue to invest to unlock growth.\nThis year and into the future, I am confident we will continue to make further progress, creating value for both our shareholders and all our stakeholders.\nFinancial Review\nOverview\nWe have delivered a strong start to the year, with revenue, adjusted EBIT margin, and adjusted EBIT ahead of last year. Group revenue increased 7.9% year-on-year on a constant currency basis. We saw a sequential improvement with second-quarter revenue increasing 8.4% year-on-year and volume returning to growth, up 0.6%.\nWe have successfully executed pricing plans in each of our markets through the first half. In addition to base price, we have used other levers to help mitigate inflationary pressure, including pack mix, promotional optimisation, productivity initiatives and disciplined cost management. Brand contribution is ahead of last year, aided by the favourable phasing of A&P into the second half of the year.\nAdjusted EBIT, on a constant currency basis, increased 16.7% to GBP85.3m, resulting in an adjusted EBIT margin of 10.7%, an 80bps improvement year-on-year. The increase in adjusted EBIT margin reflects the strong trading performance and phasing of A&P into the second half.\nAdjusted EPS increased 17.5% year-on-year. The interim dividend equates to 8.2p per share, a year-on-year increase of 5.1%, reflecting multiple factors including the accelerated profit delivery in the first half. We remain committed to a 50% dividend pay-out policy.\nSince 31 March 2022, we have paid dividends of GBP75.3m and executed a share buyback of GBP75.0m, while maintaining our leverage with an adjusted net debt/EBITDA ratio of 2.2x at 31 March 2023. Our confidence in the prospects of the business and cash generation has resulted in the Board's decision to confirm a further share buyback programme of GBP75.0m over the next 12 months, subject to market conditions and other uses of capital.\nBelow is a summary of the segmental performance and explanatory notes related to items, including taxation, interest, and free cash flow generation.\n% change 6 months ended 6 months ended GB actual 31 March 2023 31 March 2022 exchange rate Volume (million litres) 820.7 827.1 (0.8)% ARP per litre 66.3p 59.6p 11.2% Revenue (GBPm) 544.2 493.0 10.4% Brand contribution (GBPm) 218.6 187.8 16.4% Brand contribution margin 40.2% 38.1% 210bps\nSee glossary on page 15 for definitions of performance measures.\nIn GB, we have delivered strong revenue growth, 10.4% ahead of last year through both owned and PepsiCo brands. While volume in the first half was down 0.8%, performance improved in the second quarter with volume growth of 1.2%. ARP growth of 11.2% was driven by an improved mix and the benefit of price and promotional actions implemented during the half. In mainstream carbonates, Tango, and Pepsi were the main drivers of growth, with revenue increasing 39.7% and 9.2% respectively. Tango benefited from the addition of new, sugar-free variants, while no-sugar MAX continued to lead the growth for Pepsi. Rockstar was a drag on performance, with revenue down 25.1% on last year, partly due to the third-party supply issues. Rockstar production moved in-house during Q2 and we will be activating an upweighted marketing and field sales plan in the second half. J2O revenue increased 20.9% following a strong Christmas, while Robinsons RTD continued to build scale, with revenue up 67.0% on last year, partially due to the planned delist of Drench. Brand contribution margin increased 210bps, largely from the planned phasing of A&P spend into the second half of the year.\n% change % change 6 months ended 6 months ended like-for-like Brazil actual 31 March 2023 31 March 2022 at constant exchange rate exchange rate Volume (million litres) 143.4 154.8 (7.4)% (7.4)% ARP per litre 52.8p 41.8p 26.3% 6.5% Revenue (GBPm) 75.7 64.7 17.0% (1.4)% Brand contribution* (GBPm) 18.2 13.7 32.8% 12.3% Brand contribution margin* 24.0% 21.1% 290bps 290bps\n*Brand contribution for the 6 months ended 31 March 2022 restated by +GBP4.4m from GBP9.3m to GBP13.7m to correctly present certain costs that are fixed in nature (see fixed costs below). Brand contribution margin for the 6 months ended 31 March 2022 adjusted accordingly from 14.3% to 21.1%.\nIn Brazil, revenue declined 1.4%, with volume down 7.4%. This was due to a weaker performance of the fruit processing business known as 'Be Ingredient', where revenue was down over 50%, reflecting the impact of poor weather on crop supply and a competitive trading environment.\nOur branded portfolio delivered a solid performance, with revenue 7% ahead of last year, benefiting from the price realisation actions taken in the last year. Our high-margin flavour concentrates revenue was +26.2%, Fruit Shoot +50.1% and Seleção grape juice +40.8%. This was partly offset by a 15.6% revenue decline in the competitively priced, lower margin, RTD juice pack formats. Consequently, the combination of price realisation and positive mix has resulted in brand contribution margin increasing by 290bps.\n% change % change 6 months ended 6 months ended like-for-like Other International actual 31 March 2023 31 March 2022 at constant exchange rate exchange rate Volume (million litres) 190.0 193.7 (1.9)% (1.9)% ARP per litre 91.6p 83.4p 9.8% 6.8% Revenue (GBPm) 174.1 161.6 7.7% 4.7% Brand contribution (GBPm) 42.7 48.0 (11.0)% (13.0)% Brand contribution margin 24.5% 29.7% (520)bps (500)bps\nNote: Other International consists of France, Ireland and other international markets. Concentrate sales are included in both revenue and ARP but do not have any associated volume.\nIn Other International, volume declined 1.9%, revenue increased 4.7%, while brand contribution declined 13.0%. Performance in Ireland was robust, with growth in the key metrics of volume, ARP, revenue, and brand contribution. Margin declined, reflecting inflationary cost pressure and brand mix, with Ballygowan water and carbonates growing ahead of higher margin products, such as MiWadi and Robinsons. We also generated revenue growth in the USA, Middle East and Asia. Performance in France was weak, with both volume and revenue down year-on-year, led by the higher-margin Teisseire brand. Price increases have been especially difficult in the French retail environment and could only be achieved at the end of the half, while cost inflation impacted from the start of the year.\n% change 6 months ended 6 months ended % change like-for-like Fixed costs - pre-adjusting items 31 March 2023 31 March 2022 actual at constant GBPm GBPm exchange rate exchange rate Non-brand A&P (6.0) (5.2) (15.4)% (15.4)% Fixed supply chain* (70.2) (68.6) (2.4)% 0.2% Selling costs (45.3) (37.9) (19.5)% (16.5)% Overheads and other (72.8) (64.3) (13.2)% (11.1)% Total (194.3) (176.0) (10.4)% (8.0)% Total A&P investment (21.8) (25.7) A&P as a % of own brand revenue 2.7% 3.6%\n* Fixed supply chain costs for 6 months ended 31 March 2022 restated by +GBP4.4m from GBP64.2m to GBP68.6m to correctly present Brazil costs that are fixed in nature.\nOverall, our fixed cost base increased 8.0% on a like-for-like basis. Total A&P was GBP3.9m lower year-on-year, which reflects the planned phasing into the second half of the year. During the period we increased production capacity, adding a new can line in GB and additional capacity in Brazil. We invested in additional resource for the field sales team to support our channel growth strategy. Our people costs have also increased reflecting both changes to headcount and salary investment to retain and recruit the best talent. We adopted a tiered approach to ensure those on lower salaries received a higher percentage increase, in recognition of the increased costs of living people face.\nFinance costs\nThe net finance charge for the period ended 31 March 2023 was GBP11.4m, compared with GBP7.8m in the comparative period, primarily due to the higher cost of borrowing on floating rate debt.\nAdjusting items - pre-tax\nIn the period, the Group incurred, and has separately disclosed, a net charge of GBP4.6m (2022: GBP6.4m) of pre-tax adjusting items. Adjusting items comprised:\n-- restructuring costs of GBP0.4m;\n-- strategic M&A credit of GBP0.1m in relation to the remeasurement and utilisation of historic provisions;and\n-- acquisition-related amortisation of GBP4.3m.\nTaxation\nThe adjusted tax charge for the period was GBP15.0m (6 months ended 31 March 2022: GBP13.8m), which equates to an adjusted effective tax rate of 21.5% (6 months ended 31 March 2022: 22.4%). This decrease in the effective tax rate is mainly due to the change in profit mix in overseas jurisdictions and a small prior year adjustment. The reported net tax charge was GBP14.9m (6 months ended 31 March 2022: GBP13.4m), which equates to an effective tax rate of 21.5% (6 months ended 31 March 2022: 22.7%).\nEarnings per share (EPS)\nAdjusted basic EPS for the period was 22.8 pence, an increase of 17.5% (at actual exchange rates) on the prior year, due to higher operating profits in the half and the impact of a lower number of shares in issue because of the share buyback. Adjusted diluted EPS improved 16.5%. Basic EPS for the period was 21.0 pence, an increase of 22.3% on last year. Diluted EPS for the period was 20.9 pence, an increase of 22.2% on the same period last year.\nDividends\nThe Board is proposing an interim dividend of 8.2p per share, with a total value of GBP21.2m. The interim dividend for 2023 will be paid on 5 July 2023 to shareholders on record as of 26 May 2023. The ex-dividend date is 25 May 2023.\nShare buyback programme\nOn 23 May 2022, the company commenced an initial share buyback programme to repurchase ordinary shares with a market value of up to GBP75.0m. The purpose of the programme was to reduce share capital and, accordingly, the shares repurchased were subsequently cancelled. During the half year ended 31 March 2023, the company has completed the initial share buyback, returning GBP37.3m to shareholders this half year, excluding transaction costs. Adjusted net debt leverage at 31 March 2023 is 2.2x and is within Britvic's long-term policy for leverage to be maintained within a range of 1.5x to 2.5x.\nIn the context of Britvic's expected free cash flow and its capital requirements over the next three years, the Board believes it is appropriate to commence a further share buyback of up to GBP75m over the next 12 months. Britvic will continue to assess the strength of the balance sheet on an annual basis, in the context of its growth ambitions. The company's dividend policy remains unchanged.\nFree cash flow\nFree cash flow (defined as cash generated from operating activities, plus proceeds from sale of property, plant and equipment, less capital expenditure, interest and repayment of lease liabilities) was an outflow of GBP9.0m, compared with an inflow of GBP2.0m in the 6 months ended 31 March 2022.\nCash generated from operating activities before changes in working capital and income tax paid was GBP110.6m compared with GBP95.2m in the comparative period, reflecting an improved operating performance and continued disciplined cash management during the half year.\nThis half year there was a working capital outflow of GBP65.3m (6 months ended 31 March 2022: GBP47.6m outflow), comprising an outflow from increases in inventory of GBP48.8m (6 months ended 31 March 2022: GBP36.2m outflow), an inflow from decreases in trade and other receivables of GBP43.2m (6 months ended 31 March 2022: GBP2.8m outflow), an outflow from decreases in trade and other payables of GBP58.9m (6 months ended 31 March 2022: GBP5.7m outflow) and an outflow from decreases in provisions of GBP0.8m (6 months ended 31 March 2022: GBP2.9m outflow).\nThe increased inventory levels since year-end were due to inflation and an increased level of both raw materials and finished goods stock to protect our customer service levels as we approach the summer period.\nNet income taxes paid were GBP9.6m (6 months ended 31 March 2022: GBP9.2m).\nCash capital expenditure increased slightly from GBP24.6m during the 6 months ended 31 March 2022 to GBP29.4m for the current half year, reflecting our continued investment. Lease payments increased from GBP4.7m to GBP6.0m.\nTreasury management\nThe financial risks faced by the Group are identified and managed by a central treasury department, whose activities are carried out in accordance with Board approved policies and subject to regular Audit and Treasury Committee reviews. The department does not operate as a profit centre and no transaction is entered into for trading or speculative purposes. Key financial risks managed by the treasury department include exposures to movements in interest rates, foreign exchange rates and commodities, while managing the Group's debt and liquidity profile. The Group uses financial instruments to hedge against interest rate and foreign currency exposures as well as commodity exposures, including aluminium, sugar, gas, power, diesel and certain resin components.\nIn December 2022, private placement notes with a principal amount of USUSD43.0m reached maturity, resulting in a cash outflow of GBP27.8m, net of the impact of derivatives.\nOn 31 March 2023, the Group had GBP933.8m of committed debt facilities, consisting of a GBP400.0m bank facility and a series of private placement notes, with maturities between February 2024 and May 2035. GBP83.0m was drawn under the bank facility at 31 March 2023. GBP366.7m of the bank facility matures in February 2027 and the remaining GBP33.3m will mature in February 2025. The next maturity for the company's private placement notes is in February 2024, when notes with outstanding principal amounts of USUSD39.0m and GBP15.0m will be due for repayment.\nOn 31 March 2023, the Group's adjusted net debt, including the impact of interest rate currency swaps hedging the balance sheet value of the private placement notes, was GBP593.4m, which compares with GBP474.8m at 30 September 2022. The increase in net debt reflects the seasonality of the business, where profits and operating cash flow are higher in the second half of the year, and that during the first half of the year the company has paid dividends of GBP54.6m and purchased own shares of GBP55.5m.\nExcluding derivative hedges, net debt was GBP615.0m, comprising GBP555.4m of private placement notes, GBP83.0m of borrowings under the bank facility, GBP3.9m of accrued interest, offset by net cash and overdrafts of GBP25.0m and unamortised debt issue costs of GBP2.3m. Adjusted net debt to EBITDA leverage at 31 March 2023 was 2.2x, maintaining the same level as at 31 March 2022.\nPensions\nAt 31 March 2023, Britvic plc had IAS 19 pension surpluses in GB, ROI and NI totalling GBP108.4m and an IAS 19 pension deficit in France of GBP1.2m (30 September 2022: pension surpluses of GBP138.9m and pension deficits of GBP1.4m). The decrease in the net pension assets is primarily attributable to a net remeasurement loss of GBP39.0m, of which GBP36.6m relates to the GB scheme.\nThe net income for defined benefit schemes recognised in the income statement for the 6 months ended 31 March 2023 was GBP3.2m (6 months ended 31 March 2022: net income of GBP0.7m).\nThe defined benefit section of the GB plan was closed to new members on 1 August 2002 and closed to future accrual for active members from 1 April 2011, with new employees being invited to join the defined contribution scheme. The Northern Ireland scheme was closed to new members on 28 February 2006 and future accrual from 31 December 2018, and new employees are eligible to join the defined contribution scheme. All new employees in Ireland join the defined contribution plan.\nContributions are paid into the defined benefit section of the GB plan as determined by the trustee, agreed by the company and certified by an independent actuary in the schedule of contributions. As noted in the Group's Annual Report and Accounts 2022, no further deficit funding payments are due to be paid except for the GBP5.0m annual partnership payment which will continue until 2025. The triennial valuation as of 31 March 2022 was finalised in April 2023 and did not result in any change to the schedule of contributions.\nThe triennial valuation reflects that, in April 2023, an agreement in principle has been reached between the trustee and the company that all pension increases (excluding GMP) under the plan should be based on the RPI measure of inflation. This is expected to result in an amendment to the plan's trust deed and rules to clarify that the company does not have the power to set an alternative rate of pension increases. The triennial valuation also reflects revised demographic assumptions, including mortality base tables. The company expects to incorporate revised pension increase and demographic assumptions in its forthcoming actuarial valuation at 30 September 2023 prepared in accordance with IAS 19 'Employee Benefits'. The company is at an early stage in quantifying the impact of the revised assumptions on the defined benefit pension surplus recognised in the consolidated balance sheet. Initial high-level estimates suggest that the revised RPI pension increase assumptions would decrease the pension surplus by approximately GBP20m and that revised mortality assumptions would positively impact the surplus by approximately GBP13m. The revised mortality assumptions take into consideration the latest plan-specific and wider UK population mortality experience.\nRisk management process\nAs with any business, Britvic faces risks and uncertainties. We believe that effective risk management supports the successful delivery of our strategic objectives. The management of these risks is based on a balance of risk and reward, determined through assessment of the likelihood and impact, as well as the Group's risk appetite. The Executive team performs a formal robust assessment of the principal risks facing the Group bi-annually, which is reviewed by the Board. Similarly, all business units and functions perform formal risk assessments that consider the Group's principal risks and specific local risks relevant to the market in which they operate.\nRisks are monitored throughout the year with consideration given to internal and external factors and the Group's risk appetite. We continue to further refine and embed our risk management approach across the breadth of the organisation, focussing on driving the effectiveness of the risk management framework across the organisation. Updates to risks and mitigation plans are managed agilely, with changes made as required. In response to the volatile and uncertain external environment, the risk team has continued to support each of our markets and functions in identifying and managing existing and emerging risks to the organisation.\nThe principal risks and uncertainties facing the Group are set out on pages 73 to 75 of the Britvic Annual Report and Accounts 2022. These principal risks and uncertainties include: consumer preference; health concerns; retailer landscape and customer relationships; supply chain; sustainability and environment; market; quality of our products and the health and safety of our people; legal and regulatory; technology and information security; treasury, tax and pensions; and talent.\nThe nature and potential impact of the principal risks and uncertainties facing Britvic did not change in the six months ended 31 March 2023 and are not expected to change during the second half of the financial year.\nGlossary\nA&P is a measure of marketing spend including marketing, research and advertising.\nAcquisition-related amortisation is the amortisation of intangibles recognised as part of a business combination.\nAdjusted earnings per share (Adjusted EPS) is a non-GAAP measure calculated by dividing adjusted earnings by the average number of shares during the year. Adjusted earnings is defined as the profit/(loss) attributable to ordinary equity shareholders before adjusting items. Average number of shares during the year is defined as the weighted average number of ordinary shares outstanding during the period excluding any own shares held by Britvic that are used to satisfy various employee share-based incentive programmes.\nAdjusted effective tax rate is a non-GAAP measure and is defined as the income tax charge(credit), excluding the tax effect of Adjusting items, as a proportion of the Adjusted profit before tax.\nAdjusted EBIT is a non-GAAP measure and is defined as operating profit before adjusting items.\nAdjusted EBIT margin is a non-GAAP measure and is defined as Adjusted EBIT as a proportion of Revenue.\nAdjusted EBITDA is a non-GAAP measure calculated by taking Adjusted EBIT and adding back depreciation, amortisation and loss on disposal of property, plant and equipment and deducting payments of lease liabilities as an estimate for pre-IFRS16 rental charges.\nAdjusted net debt is a non-GAAP measure and is defined as net debt, adding back the impact of derivatives hedging the balance sheet debt.\nAdjusted net debt/EBITDA is a non-GAAP measure and is defined as the ratio of Adjusted net debt to Adjusted EBITDA (calculated for the preceding 12 months).\nAdjusted profit before tax is a non-GAAP measure and is defined as profit before tax, excluding Adjusting items, with the exception of acquisition-related amortisation.\nAdjusting items are those items of income and expense set out in Appendix 1 that have been identified because of their size, frequency and nature to provide shareholders with management's view of the underlying financial performance in the period.\nAER are changes in measures at actual exchange rates.\nARP is defined as average revenue per litre sold, excluding factored brands and concentrate sales.\nbps is basis points and is a measure used to describe the percentage change in a value. One basis point is equivalent to 0.01%.\nBrand contribution is a non-GAAP measure and is defined as revenue, less material costs and all other marginal costs that management considers to be directly attributable to the sale of a given product. Such costs include brand specific advertising and promotion costs, raw materials and marginal production and distribution costs. Brand contribution is reconciled to profit before tax in note 6 of the interim financial statements.\nBrand contribution margin is a non-GAAP measure and is a percentage measure calculated as brand contribution divided by revenue. Each business unit's performance is reported down to the brand contribution level.\nConstant exchange rate is a non-GAAP measure of performance in the underlying currency to eliminate the impact of foreign exchange movements.\nEPS is Earnings Per Share.\nFMCG is Fast Moving Consumer Goods.\nFree cash flow is a non-GAAP measure and is defined as cash generated from operating activities, plus proceeds from the sale of property, plant and equipment, less capital expenditure, interest and repayment of lease liabilities.\nGB is Great Britain.\nGMP is Guaranteed Minimum Pension.\nGroup is Britvic plc, together with its subsidiaries.\nImmediate Consumption is defined as pack formats to be consumed on purchase, rather than deferred packs which are purchased and consumed later.\nInnovation is defined as new launches over the last five years, excluding new flavours and pack sizes of established brands.\nM&A is mergers and acquisitions.\nNet debt is the sum of interest-bearing loans and borrowings, overdrafts and cash and cash equivalents.\nNI is Northern Ireland.\nNon-GAAP measures are provided because they are closely tracked by management to evaluate Britvic's operating performance and to make financial, strategic and operating decisions.\nOperating profit margin is operating profit as a proportion of revenue, both as reported in the consolidated income statement.\nPET is polyethylene terephthalate plastic.\nRCF is revolving credit facility.\nRevenue is defined as sales achieved by the Group net of price promotional investment and retailer discounts.\nROI is Republic of Ireland.\nrPET is recycled polyethylene terephthalate plastic.\nRTD is ready to drink.\nVolume is defined as number of litres sold. No volume is recorded in respect of international concentrate sales or Brazil fruit pulp sales.\nBRITVIC PLC\nRESPONSIBILITY AND CAUTIONARY STATEMENTS\nCompany number: 5604923\nRESPONSIBILITY STATEMENT\nThe Directors confirm that to the best of their knowledge, this unaudited condensed set of consolidated interim financial statements has been prepared in accordance with United Kingdom adopted International Accounting Standard 34 'Interim Financial Reporting' and that the interim management report herein includes a fair review of the information required by DTR 4.2.7R (indication of important events and their impact during the first six months and description of principal risks and uncertainties for the remaining six months of the year) and DTR 4.2.8R (disclosure of related parties' transactions and changes therein).\nCAUTIONARY STATEMENT\nThis report is addressed to the shareholders of Britvic plc and has been prepared solely to provide information to them.\nThis report is intended to inform the shareholders of the Group's performance during the six months to 31 March 2023. This report contains forward-looking statements made in good faith based on knowledge and information available to the Directors at the date the report was prepared. These statements should be treated with caution due to the inherent uncertainties underlying any such forward-looking information and any statements about the future outlook may be influenced by factors that could cause actual outcomes and results to be materially different.\nDIRECTORS\nThe Directors of Britvic plc are:\nJohn Daly\nIan Durant\nSimon Litherland\nSue Clark\nEuan Sutherland\nWilliam Eccleshare\nEmer Finnan\nHounaida Lasry\nBy order of the Board,\nSimon Litherland\nChief Executive Officer\nDate: 15 May 2023\nINDEPENDENT REVIEW REPORT TO BRITVIC PLC\nConclusion\nWe have been engaged by the company to review the condensed set of financial statements in the half-yearly financial report for the six months ended 31 March 2023 which comprises the Condensed Consolidated Income Statement, the Condensed Consolidated Statement of Comprehensive Income, the Condensed Consolidated Statement of Changes in Equity, the Condensed Consolidated Balance Sheet, the Condensed Consolidated Statement of Cash Flows, and related notes 1 to 21.\nBased on our review, nothing has come to our attention that causes us to believe that the condensed set of financial statements in the half-yearly financial report for the six months ended 31 March 2023 is not prepared, in all material respects, in accordance with United Kingdom adopted International Accounting Standard 34 and the Disclosure Guidance and Transparency Rules of the United Kingdom's Financial Conduct Authority.\nBasis for Conclusion\nWe conducted our review in accordance with International Standard on Review Engagements (UK) 2410 \"Review of Interim Financial Information Performed by the Independent Auditor of the Entity\" issued by the Financial Reporting Council for use in the United Kingdom (ISRE (UK) 2410). A review of interim financial information consists of making inquiries, primarily of persons responsible for financial and accounting matters, and applying analytical and other review procedures. A review is substantially less in scope than an audit conducted in accordance with International Standards on Auditing (UK) and consequently does not enable us to obtain assurance that we would become aware of all significant matters that might be identified in an audit. Accordingly, we do not express an audit opinion.\nAs disclosed in Note 2, the annual financial statements of the group are prepared in accordance with United Kingdom adopted international accounting standards. The condensed set of financial statements included in this half-yearly financial report has been prepared in accordance with United Kingdom adopted International Accounting Standard 34, \"Interim Financial Reporting\".\nConclusion Relating to Going Concern\nBased on our review procedures, which are less extensive than those performed in an audit as described in the Basis for Conclusion section of this report, nothing has come to our attention to suggest that the directors have inappropriately adopted the going concern basis of accounting or that the directors have identified material uncertainties relating to going concern that are not appropriately disclosed.\nThis Conclusion is based on the review procedures performed in accordance with ISRE (UK) 2410; however future events or conditions may cause the entity to cease to continue as a going concern.\nResponsibilities of the Directors\nThe directors are responsible for preparing the half-yearly financial report in accordance with the Disclosure Guidance and Transparency Rules of the United Kingdom's Financial Conduct Authority.\nIn preparing the half-yearly financial report, the directors are responsible for assessing the group's ability to continue as a going concern, disclosing as applicable, matters related to going concern and using the going concern basis of accounting unless the directors either intend to liquidate the company or to cease operations, or have no realistic alternative but to do so.\nAuditor's Responsibilities for the review of the financial information\nIn reviewing the half-yearly financial report, we are responsible for expressing to the company a conclusion on the condensed set of financial statements in the half-yearly financial report. Our Conclusion, including our Conclusion Relating to Going Concern, are based on procedures that are less extensive than audit procedures, as described in the Basis for Conclusion paragraph of this report.\nUse of our report\nThis report is made solely to the company in accordance with ISRE (UK) 2410. Our work has been undertaken so that we might state to the company those matters we are required to state to it in an independent review report and for no other purpose. To the fullest extent permitted by law, we do not accept or assume responsibility to anyone other than the company, for our review work, for this report, or for the conclusions we have formed.\nDeloitte LLP\nStatutory Auditor\nLondon\n15 May 2023 BRITVIC PLC\nCONDENSED consolidated income statement\nFor the 6 months ended 31 March 2023\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 (unaudited) (unaudited) (audited) Note GBPm GBPm GBPm Revenue 6 794.0 719.3 1,618.3 Cost of sales (487.5) (427.4) (952.4) Gross profit 306.5 291.9 665.9 Selling and distribution expenses (126.6) (128.4) (266.8) Administration expenses (99.2) (96.4) (206.7) Operating profit 80.7 67.1 192.4 Finance income 0.4 0.4 0.9 Finance costs (11.8) (8.2) (18.2) Profit before tax 69.3 59.3 175.1 Income tax expense 7 (14.9) (13.4) (34.9) Profit for the period attributable to the equity shareholders 54.4 45.9 140.2 Earnings per share Basic earnings per share 8 21.0p 17.2p 52.6p Diluted earnings per share 8 20.9p 17.1p 52.5p\nBRITVIC PLC\nCONDENSED CONSOLIDATED STATEMENT OF COMPREHENSIVE INCOME/(EXPENSE)\nFor the 6 months ended 31 March 2023\n6 months 6 months 12 months ended ended ended 31 March 31 March 30 September 2023 2022 2022 (unaudited) (unaudited) (audited) Note GBPm GBPm GBPm Profit for the period attributable to the equity shareholders 54.4 45.9 140.2 Items that will not be reclassified to profit or loss Remeasurement (losses)/gains on defined benefit pension schemes 15 (39.0) 24.1 (2.1) Current tax on pension contributions - - 0.1 Deferred tax on defined benefit pension plans 9.5 (5.3) 2.3 Deferred tax on other temporary differences 0.1 - - (29.4) 18.8 0.3 Items that may be subsequently reclassified to profit or loss (Losses)/gains in the period in respect of cash flow hedges 18 (30.4) 18.5 56.6 Amounts reclassified to the income statement in respect of cash flow 18 (6.1) (2.1) (23.8) hedges Current tax in respect of cash flow hedges accounted for in the - - 0.5 hedging reserve Deferred tax in respect of cash flow hedges accounted for in the hedging 18 7.3 (2.7) (6.8) reserve Exchange differences reclassified to profit or loss on disposal of 18 (0.3) - (0.8) foreign operations Exchange differences on translation of foreign operations 18 (3.9) 15.7 28.9 Tax on exchange differences accounted for in the translation reserve 18 (0.2) (0.3) 0.5 (33.6) 29.1 55.1 Other comprehensive (loss)/income for the period, net of tax (63.0) 47.9 55.4 Total comprehensive (loss)/income for the period attributable to the (8.6) 93.8 195.6 equity shareholders\nBRITVIC PLC\nCONDENSED CONSOLIDATED BALANCE SHEET\nAs at 31 March 2023\nRestated* Restated* 31 March 2023 31 March 2022 30 September 2022 (unaudited) (unaudited) (audited) Note GBPm GBPm GBPm Non-current assets Property, plant and equipment 9 516.6 479.1 513.9 Right-of-use assets 63.9 70.2 68.7 Intangible assets 9 410.9 403.9 416.4 Other receivables 8.3 7.3 6.0 Derivative financial instruments 13 18.1 23.3 45.9 Deferred tax assets 4.1 3.5 4.4 Retirement benefit assets 15 108.4 164.0 138.9 1,130.3 1,151.3 1,194.2 Current assets Inventories 218.8 179.7 172.0 Trade and other receivables 394.7 384.9 445.2 Current income tax receivables 6.7 12.2 10.9 Derivative financial instruments 13 17.6 22.3 38.9 Cash and cash equivalents 48.0 33.3 97.4 Other current assets - - 3.1 685.8 632.4 767.5 Assets held for sale 19 16.8 16.8 16.8 702.6 649.2 784.3 Total assets 1,832.9 1,800.5 1,978.5 Current liabilities Trade and other payables (473.1) (425.6) (508.8) Commercial rebate liabilities (111.3) (121.1) (137.0) Lease liabilities (7.5) (10.2) (8.6) Interest-bearing loans and borrowings 10 (50.4) (36.1) (42.2) Derivative financial instruments 13 (8.6) (1.5) (11.2) Current income tax liabilities - (2.1) (0.2) Overdrafts (23.0) (9.3) (9.8) Provisions 16 (0.9) (2.3) (1.9) Other current liabilities (5.6) (10.2) (11.1) (680.4) (618.4) (730.8) Non-current liabilities Lease liabilities (61.9) (65.0) (65.3) Interest-bearing loans and borrowings 10 (589.6) (543.9) (563.1) Deferred tax liabilities (107.2) (114.4) (123.1) Retirement benefit obligations 15 (1.2) (1.9) (1.4) Derivative financial instruments 13 (1.1) - (0.4) Provisions 16 (1.0) (0.6) (0.9) Other non-current liabilities - (5.7) (5.5) (762.0) (731.5) (759.7) Total liabilities (1,442.4) (1,349.9) (1,490.5) Net assets 390.5 450.6 488.0 Equity Issued share capital 11 51.7 53.5 52.7 Share premium account 157.2 157.2 157.2 Own shares reserve (16.8) (0.9) (7.2) Other reserves 18 77.5 81.3 106.0 Retained earnings 120.9 159.5 179.3 Total equity 390.5 450.6 488.0\n* Comparative figures for overdrafts and cash and cash equivalents have been restated as set out in Note 2 'basis of preparation'.\nBRITVIC PLC\nCONDENSED CONSOLIDATED STATEMENT OF CASH FLOWS\nFor the 6 months ended 31 March 2023\n6 months 6 months 12 months ended ended ended 31 March 31 March 30 September 2023 2022 2022 (unaudited) (unaudited) (audited) Note GBPm GBPm GBPm Cash flows from operating activities Profit before tax 69.3 59.3 175.1 Net finance costs 11.4 7.8 17.3 Other financial instruments (2.9) (1.7) 0.8 Depreciation of property, plant and equipment 21.7 20.1 40.9 Depreciation of right-of-use assets 5.1 5.2 10.9 Loss on disposal of property, plant and equipment and intangible assets 1.7 0.3 0.9 Amortisation 8.0 7.6 15.6 Share-based payments charge, net of cash settlements 5.8 2.9 4.2 Net pension charge less contributions (8.8) (6.3) (7.6) Net foreign exchange differences (0.4) - 2.0 Exchange differences reclassified to profit or loss from other (0.3) - (0.8) comprehensive income Increase in inventory (48.8) (36.2) (26.0) Decrease/(increase) in trade and other receivables 43.2 (2.8) (56.4) (Decrease)/increase in trade and other payables and commercial rebate (58.9) (5.7) 84.3 liabilities Decrease in provisions (0.8) (2.9) (3.2) Income tax paid (9.6) (9.2) (18.4) Net cash flows from operating activities 35.7 38.4 239.6 Cash flows from investing activities Purchases of property, plant and equipment (25.5) (21.8) (72.9) Purchases of intangible assets (3.9) (2.8) (11.7) Interest received 0.3 0.1 0.2 Net cash flows used in investing activities (29.1) (24.5) (84.4) Cash flows from financing activities Interest paid, net of derivative financial instruments (9.3) (7.1) (14.8) Net movement on revolving credit facility 10 83.1 - - Payment of principal portion of lease liabilities (5.0) (3.8) (9.3) Payment of interest portion of lease liabilities (1.0) (0.9) (2.1) Other derivative cash receipts/(payments) - 0.9 (0.8) Repayment of private placement notes, net of derivative financial (27.8) - - instruments Issue costs paid 10 - (0.3) (0.3) Proceeds from employee share incentive schemes 0.9 0.9 1.0 Purchase of own shares related to share schemes (16.7) (3.3) (9.0) Share buyback programme (38.8) - (36.7) Dividends paid to equity shareholders 12 (54.6) (47.2) (67.9) Net cash flows from financing activities (69.2) (60.8) (139.9) Net (decrease)/increase in cash and cash equivalents (62.6) (46.9) 15.3 Cash and cash equivalents at the beginning of the period 87.6 71.1 71.1 Net foreign exchange differences on cash and cash equivalents - (0.2) 1.2 Cash and cash equivalents at the end of the period 25.0 24.0 87.6 Presented in the balance sheet as: Cash and cash equivalents(1) 48.0 33.3 97.4 Overdrafts(1)(2) (23.0) (9.3) (9.8) Cash and cash equivalents at the end of the period 25.0 24.0 87.6 1. Comparative figures for overdrafts and cash and cash equivalents have been restated as set out in Note 2'basis of preparation'. 2. Bank overdrafts are included in the cash and cash equivalents presented in the statement of cash flowsbecause they form an integral part of the Group's cash management.\nBRITVIC PLC\nCONDENSED CONSOLIDATED STATEMENT OF CHANGES IN EQUITY\nFor the 6 months ended 31 March 2023\nFor the 6 months ended 31 March 2023 (unaudited) Other reserves Issued Share Own Capital Hedging Translation Merger Retained share premium shares redemption reserve reserve reserve Total reserve earnings capital account reserve GBPm GBPm GBPm GBPm GBPm GBPm GBPm GBPm GBPm At 1 October 2022 52.7 157.2 (7.2) 0.9 27.3 (9.5) 87.3 179.3 488.0 Profit for the period - - - - - - - 54.4 54.4 Other comprehensive loss - - - - (29.2) (4.4) - (29.4) (63.0) Total comprehensive (loss)/ - - - - (29.2) (4.4) - 25.0 (8.6) income Share buyback programme (1.0) - 1.1 1.0 - - - (38.7) (37.6) Own shares purchased for share - - (16.4) - - - - 9.8 (6.6) schemes Own shares utilised for share - - 5.7 - - - - (4.8) 0.9 schemes Movement in share-based schemes - - - - - - - 4.6 4.6 Current tax on share-based - - - - - - - 0.1 0.1 payments Deferred tax on share-based - - - - - - - 0.2 0.2 payments Transfer of cash flow hedge - - - - 4.1 - - - 4.1 reserve to inventories Payment of dividend - - - - - - - (54.6) (54.6) At 31 March 2023 51.7 157.2 (16.8) 1.9 2.2 (13.9) 87.3 120.9 390.5 For the 6 months ended 31 March 2022 (unaudited) Other reserves Issued Share Own Hedging Translation Merger Retained share premium shares reserve reserve reserve Total earnings capital account reserve GBPm GBPm GBPm GBPm GBPm GBPm GBPm GBPm At 1 October 2021 53.5 156.2 (1.5) 4.5 (38.1) 87.3 148.8 410.7 Profit for the period - - - - - - 45.9 45.9 Other comprehensive income - - - 13.7 15.4 - 18.8 47.9 Total comprehensive income - - - 13.7 15.4 - 64.7 93.8 Issue of shares - 1.0 (1.0) - - - - - Own shares purchased for share schemes - - (3.2) - - - 3.2 - Own shares utilised for share schemes - - 4.8 - - - (12.0) (7.2) Movement in share-based schemes - - - - - - 2.8 2.8 Current tax on share-based payments - - - - - - 0.2 0.2 Deferred tax on share-based payments - - - - - - (1.0) (1.0) Transfer of cash flow hedge reserve to - - - (1.5) - - - (1.5) inventories Payment of dividend - - - - - - (47.2) (47.2) At 31 March 2022 53.5 157.2 (0.9) 16.7 (22.7) 87.3 159.5 450.6\nBRITVIC PLC\nnotes to the financial information\nFor the 6 months ended 31 March 2023 1. General information\nBritvic plc (the 'Company', together with its subsidiaries, the 'Group') is a public limited company, incorporated and domiciled in the United Kingdom. The address of the registered office is Britvic plc, Breakspear Park, Breakspear Way, Hemel Hempstead, Hertfordshire, HP2 4TZ.\nThe Company is listed on the London Stock Exchange.\nThe interim financial statements were authorised for issue by the Board of Directors on 15 May 2023. 2. Basis of preparation\nThe annual financial statements of the Group will be prepared in accordance with United Kingdom adopted International Financial Reporting Standards. The condensed set of financial statements included in this interim financial report has been prepared in accordance with the Disclosure and Transparency Rules of the Financial Conduct Authority and with the United Kingdom adopted International Accounting Standard (IAS) 34 'Interim Financial Reporting'. The interim condensed financial statements comprise the condensed consolidated balance sheet as at 31 March 2023 and the condensed consolidated income statement, condensed consolidated statement of cash flows, condensed consolidated statement of comprehensive income/(expense), condensed consolidated statement of changes in equity and the related notes 1 to 21 for the 6 months then ended of Britvic plc (the 'financial information').\nThese interim condensed financial statements do not constitute statutory accounts as defined by Section 434 of the Companies Act 2006. They have been reviewed but not audited by the Group's auditor. The statutory accounts for Britvic plc for the year ended 30 September 2022 have been delivered to the Registrar of Companies, and were audited by the Group's previous auditor, Ernst & Young LLP. The auditor's opinion on those accounts was unqualified, did not draw attention to any matters by way of emphasis and did not contain a statement made under section 498 (2) or (3) of the Companies Act 2006.\nRestatement of overdrafts and cash and cash equivalents\nThe Group has identified that the balance sheet presentation of its notional cash pooling arrangements did not comply with the requirements of IAS 32 'Financial Instruments: Presentation'. The Group has previously presented cash and overdraft balances subject to notional cash pooling arrangements on a net basis within cash and cash equivalents. However, following a review of this facility and guidance issued by the IFRS Interpretations Committee, it was determined that the balances did not meet all of the criteria in IAS 32 for offset. The prior period balance sheets have therefore been restated to show cash and overdraft balances on a gross basis. The impact is to increase both cash and cash equivalents and overdrafts by GBP9.8m at 30 September 2022 and by GBP9.3m at 31 March 2022. There is no impact to the Group's net debt position, income statement or earnings per share for the affected periods. There is also no impact on previously presented statement of cash flows, as the overdrafts are repayable on demand and form an integral part of the Group's cash management and are therefore included in the cash and cash equivalents presented in the statement of cash flows. 3. Going concern\nThe Directors are satisfied that the Group has adequate resources to continue to operate as a going concern for the foreseeable future and that no material uncertainties exist with respect to this assessment. In making this assessment, the Directors have considered the Group's balance sheet position and forecast earnings and cash flows for the period from the date of approval of these financial statements to 30 September 2024. Further details of the Directors' assessment are set out below.\nThe business has faced the challenges posed by a prolonged period of high inflation. The Group has been able to respond by successfully implementing revenue growth management actions, including price increases and optimising promotions. Inflationary pressures are expected to persist throughout the 2023 financial year, which have required price increases and other actions. This has been reflected in Britvic's strategic plan and stress test sensitivities.\nAs part of the going concern assessment, inflation scenarios have been combined with the potential impact of key risks that could reasonably arise in the period. The Group has modelled both a base case scenario and a severe but plausible downside scenario, to assess the extent to which mitigating actions would be required, all of which are within management's control. Mitigating actions can be initiated as they relate to discretionary and investment spend, without significantly impacting the ability to meet demand.\nAt 31 March 2023, the Group was operating within the banking covenants related to its revolving credit facility and private placement notes. The consolidated balance sheet reflects a net asset position of GBP390.5m and the liquidity of the Group remains strong. In 2022, the Group successfully secured a one-year extension of its GBP400.0m revolving credit facility with six of the seven participating banks. As a result, GBP366.7m of this facility now matures in February 2027, with the remaining GBP33.3m maturing in February 2025. As of 31 March 2023, GBP83.0m was drawn on the revolving credit facility. The Group's next debt maturity is in February 2024 when GBP39.2m of private placement notes mature, net of derivative financial instruments. Both the Group's revolving credit facility and private placement notes have a net debt/EBITDA covenant limit of 3.5x, excluding IFRS 16 impact. Based on adjusted net debt of GBP593.4m and adjusted EBITDA of GBP268.4m for the preceding 12 months, the net debt/EBITDA ratio at 31 March 2023 was 2.2x and well within the covenant limit.\nUnder all the scenarios modelled, including the impact of the share buyback programme, and after taking available mitigating actions, our forecasts did not indicate a covenant breach or any liquidity shortages.\nOn the basis of these reviews, the Directors consider it is appropriate for the going concern basis to be adopted in preparing the interim financial statements. 4. Accounting policies\nThe accounting policies applied by the Group in these interim financial statements are consistent with those applied by the Group in its financial statements for the year ended 30 September 2022. There were no new amendments, standards or interpretations that had a material effect on the financial position or performance of the Group in the period.\nThe Group has not identified any changes to its key sources of accounting judgements or estimations of uncertainty compared with those disclosed in the 2022 Annual Report and Accounts. 5. Seasonality of operations\nDue to the seasonal nature of the business, higher operating profits are usually expected in the second half of the year than in the first half. 6. Segmental reporting\nOperating segments are reported in a manner consistent with internal reporting provided to the chief operating decision-maker. The chief operating decision-maker, who is responsible for allocating resources and assessing performance of the operating segments, has been identified as the plc Executive team and Board of Directors of the Company.\nFor management purposes, the Group is organised into business units and has five reportable segments:\n-- GB (United Kingdom excluding Northern Ireland)\n-- Brazil\n-- Ireland (Republic of Ireland and Northern Ireland)\n-- France\n-- International\nThese business units sell soft drinks into their respective geographical markets. Management monitors the operating results of its business units separately for the purpose of making decisions about resource allocation and performance assessment. Segment performance is evaluated based on brand contribution. This is defined as revenue less material costs and all other marginal costs that management considers to be directly attributable to the sale of a given product. Such costs include brand specific advertising and promotion costs, raw materials and marginal production and distribution costs. All other costs, including net finance costs and income taxes, are managed on a centralised basis and are not allocated to reportable segments.\nThe 'Other International' subtotal comprising the Ireland, France and International reportable segments has been presented to provide linkage to the Financial Review section of the interim results.\nOther International GB Brazil Ireland France International Subtotal Total 6 months ended 31 March 2023 GBPm GBPm GBPm GBPm GBPm GBPm GBPm Revenue from external customers 544.2 75.7 74.0 77.0 23.1 174.1 794.0 Brand contribution 218.6 18.2 22.9 15.1 4.7 42.7 279.5 Non-brand advertising & promotion(1) (6.0) Fixed supply chain(2) (70.2) Selling costs(2) (45.3) Overheads and other costs(1) (72.7) Adjusted EBIT 85.3 Net finance costs pre-adjusting items (11.4) Adjusting items(3) (4.6) Profit before tax 69.3 Other International 6 months ended 31 March 2022 GB Brazil(4) Ireland France International Subtotal Total (restated(4)) GBPm GBPm GBPm GBPm GBPm GBPm GBPm Revenue from external customers 493.0 64.7 63.7 76.1 21.8 161.6 719.3 Brand contribution(4) 187.8 13.7 21.1 21.2 5.7 48.0 249.5 Non-brand advertising & promotion(1) (5.2) Fixed supply chain(2)(4) (68.6) Selling costs(2) (37.9) Overheads and other costs(1) (64.3) Adjusted EBIT 73.5 Net finance costs pre-adjusting items (7.8) Adjusting items(3) (6.4) Profit before tax 59.3 Other International GB Brazil(4) Ireland France International Subtotal Total 12 months ended 30 September 2022 (restated(4)) GBPm GBPm GBPm GBPm GBPm GBPm GBPm Revenue from external customers 1,100.4 143.0 143.9 179.4 51.6 374.9 1,618.3 Brand contribution(4) 426.0 32.4 49.6 45.9 11.5 107.0 565.4 Non-brand advertising & promotion(1) (10.3) Fixed supply chain(2)(4) (135.7) Selling costs(2) (82.0) Overheads and other costs(1) (131.4) Adjusted EBIT 206.0 Net finance costs pre-adjusting items (17.3) Adjusting items(3) (13.6) Profit before tax 175.1\n(1) Included within 'administration expenses' in the condensed consolidated income statement. 'Overheads and other costs' relate to central expenses including salaries, IT maintenance, depreciation, and non-acquisition amortisation.\n(2) Included within 'selling and distribution expenses' in the condensed consolidated income statement. 3. See appendix 1 for further details on adjusting items. 4. The Group has restated the classification of certain prior period costs in Brazil within the segmentalreporting note. For the year ended 30 September 2022, GBP9.7m of costs that are fixed in nature previously includedwithin brand contribution have been reclassified to fixed supply chain. For the six months ended 31 March 2022,GBP4.4m of costs have been reclassified from brand contribution to fixed supply chain. There has been no impact ofthis disclosure change on the consolidated income statement. 7. Income tax\nThe total tax charge for the period is GBP14.9m (6 months ended 31 March 2022: GBP13.4m) which equates to an effective tax rate of 21.5% (6 months ended 31 March 2022: 22.7%).\nTax charge by region 6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm UK 16.0 10.7 31.7 Foreign (1.1) 2.7 3.2 Total tax charge in the condensed consolidated income statement 14.9 13.4 34.9 Analysis of tax charge 6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm Current income tax charge 13.7 4.8 15.3 Deferred income tax charge 1.2 8.6 19.6 Total tax charge in the condensed consolidated income statement 14.9 13.4 34.9\nThe effective tax rate for the 6 months ended 31 March 2023 has decreased compared to the effective tax rate for the 6 months ended 31 March 2022. This is mainly due to the change in profit mix in overseas jurisdictions and a small prior year adjustment.\nThe deferred tax charge has decreased compared to the 6 months ended 31 March 2022. This primarily relates to the inclusion in the prior year of the impact of the tax rate increase in the UK and a restatement following an accounting policy change. The current year includes an increase in the deferred tax asset on employee incentive plans. 8. Earnings per share\nBasic earnings per share amounts are calculated by dividing the net profit for the period attributable to the equity shareholders of the parent by the weighted average number of ordinary shares in issue during the period.\nDiluted earnings per share amounts are calculated by dividing the net profit attributable to the equity shareholders of the parent by the weighted average number of ordinary shares outstanding during the period plus the weighted average number of ordinary shares that are potentially issuable in connection with employee share-based payment plans.\nThe following table reflects the income and share data used in the basic and diluted earnings per share computations:\n6 months 6 months 12 months ended ended ended 31 March 31 March 30 September 2023 2022 2022 Basic earnings per share Profit for the period attributable to the equity shareholders (GBPm) 54.4 45.9 140.2 Weighted average number of ordinary shares in issue for basic earnings per 258.6 267.4 266.5 share (millions) Basic earnings per share (pence) 21.0p 17.2p 52.6p Diluted earnings per share Profit for the period attributable to the equity shareholders (GBPm) 54.4 45.9 140.2 Effect of number of dilutive potential ordinary shares - share schemes 1.6 0.6 0.5 (millions) Weighted average number of ordinary shares in issue for diluted earnings per 260.2 268.0 267.0 share (millions) Diluted earnings per share (pence) 20.9p 17.1p 52.5p 9. Property, plant and equipment and intangible assets\nProperty, plant and equipment\nDuring the 6 months ended 31 March 2023 the Group:\n-- capitalised property, plant and equipment additions at a cost of GBP27.5m (6 months ended 31 March 2022:GBP22.5m); and\n-- disposed of property, plant and equipment with a net book value of GBP1.7m (6 months ended 31 March 2022:GBP0.3m) resulting in a loss on disposal of GBP1.7m (6 months ended 31 March 2022: loss on disposal GBP0.3m).\nThere were no impairments or reversals of impairments recognised during the 6 months ended 31 March 2023 (6 months ended 31 March 2022: nil). See note 17 for details of the Group's capital commitments.\nIntangible assets\nDuring the 6 months ended 31 March 2023, the Group capitalised GBP3.8m of software additions (6 months ended 31 March 2022: GBP2.8m).\nThe Group performed its last annual impairment test for goodwill and intangible assets with indefinite lives in September 2022. The key assumptions used to determine the recoverable amount for the different cash generating units were disclosed in the Group's Annual Report and Accounts 2022.\nSince the last annual impairment test, management have evaluated whether there are any indicators that the Group's assets may be impaired. This evaluation included a review of business performance for the 6 months ended 31 March 2023 and latest forecasts for the full year ended 30 September 2023 against the budgets used in the last impairment test. Changes in the applicable discount rates to determine value in use were also considered.\nDuring the 6 months ended 31 March 2023, Britvic France has been challenged by cost inflation as well as a decrease in sales volumes, resulting in a decrease in brand contribution compared to the prior year (see note 6). The Group has updated its estimate of recoverable amount at 31 March 2023 to take into consideration latest forecasts and discount rates. The five-year cash flow forecasts used to assess the value in use of the business assumes that Britvic France is able to grow revenue and improve operating margins. Should these short-term forecasts not materialise, there is a risk that a reasonable change in discount rate or long-term growth rate could lead to an impairment. Sensitivity analysis was performed to assess the impact of a reasonable change in key assumptions to the impairment headroom of GBP29.5m. A 1.1% increase in the pre-tax discount rate to 10.6% or a 1.1% decrease in the long-term growth rate to 0.9% would eliminate the headroom.\nDuring the 6 months ended 31 March 2023, although Britvic Brazil has significantly improved brand contribution (see note 6), sales volumes and revenue (in constant currency) were lower than the prior year. Brazil remains a growth market and some of the categories that Britvic Brazil participate in continue to show high growth, however, growth in some of the business's traditional categories is now expected to be more modest. The Group has updated its estimate of recoverable amount at 31 March 2023 to take into consideration latest forecasts and discount rates. The five-year cash flow forecasts used to assess the value in use of the business assumes that Britvic Brazil is able to grow revenue and improve operating margins. Should these short-term forecasts not materialise, there is a risk that a reasonable change in discount rate or long-term growth rate could lead to an impairment. Sensitivity analysis was performed to assess the impact of a reasonable change in key assumptions to the impairment headroom of GBP4.6m. A 1.0% increase in the pre-tax discount rate to 22.0% or a 1.2% decrease in the long-term growth rate to 0.8% would eliminate the headroom.\nNo impairment charges have been recognised during the 6 months ended 31 March 2023.\nOther than disclosed above in relation to the goodwill held in Britvic Brazil and Britvic France and as previously disclosed in the Group's Annual Report and Accounts 2022 in relation to the Plenish and Ballygowan intangibles, the Directors do not consider that a reasonable possible change in the assumptions used to calculate recoverable amounts could result in any impairment. 10. Interest-bearing loans and borrowings\nComponents of interest-bearing loans and borrowings:\n31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm 2010 Notes - (34.0) (39.4) 2014 Notes (107.5) (101.8) (117.2) 2017 Notes (175.0) (175.0) (175.0) 2018 Notes (120.1) (118.7) (120.1) 2020 Notes (152.8) (150.6) (152.7) Bank loans (83.0) - - Accrued interest (3.9) (2.8) (3.5) Unamortised issue costs 2.3 2.9 2.6 Total interest-bearing loans and borrowings (640.0) (580.0) (605.3) Current (50.4) (36.1) (42.2) Non-current (589.6) (543.9) (563.1) Total interest-bearing loans and borrowings (640.0) (580.0) (605.3)\nThe next maturity for the Group's private placement notes is in February 2024, when 2014 Notes with outstanding principal amounts of USUSD39.0m and GBP15.0m will be due for repayment. These borrowings are classified as current at 31 March 2023 and had a carrying amount of GBP46.5m.\nBritvic has a committed GBP400.0m multi-currency revolving credit facility. A one-year extension to the maturity of the facility was approved by six of the seven lenders in February 2022 extending the maturity of GBP366.7m of this facility to February 2027. The remaining GBP33.3m will mature in February 2025. Borrowings drawn against the facility incur interest at a market reference rate plus a margin based upon a financial covenant ratio. Amounts drawn can be repaid and redrawn during the term of the facility.\nAnalysis of changes in interest-bearing loans and borrowings:\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm At the beginning of the period (605.3) (579.1) (579.1) Net movement on revolving credit facility (83.1) - - Repayment of private placement notes* 36.6 - - Issue costs - 0.3 0.3 Amortisation of issue costs (0.3) (0.3) (0.6) Net translation gain and fair value adjustment 12.5 (0.9) (25.2) Net movement in accrued interest (0.4) - (0.7) At the end of the period (640.0) (580.0) (605.3) Derivatives hedging balance sheet debt** 21.6 22.2 42.9 Debt translated at contracted rate (618.4) (557.8) (562.4)\n* During the 6 months ended 31 March 2023, the Group repaid GBP36.6m of the 2010 private placement notes. GBP7.8m was also received on maturity of derivatives hedging the 2010 Notes and GBP1.0m was received in respect of the firm commitment for the 2010 Notes, resulting in net cash outflows presented in the consolidated statement of cash flows of GBP27.8m.\n** Represents the element of the fair value of cross-currency interest rate swaps hedging the balance sheet value of the notes. This amount has been disclosed separately to demonstrate the impact of foreign exchange movements which are included in interest-bearing loans and borrowings. 11. Share capital and own shares reserve\nThe issued share capital is wholly comprised of ordinary shares carrying one voting right each. The nominal value of each ordinary share is GBP0.20. There are no restrictions placed on the distribution of dividends, or the return of capital on a winding up or otherwise.\nThe movements in the Company's issued share capital were as follows:\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 No. of shares No. of shares No. of shares At the beginning of the period 263,300,881 267,314,637 267,314,637 Shares issued relating to incentive schemes for employees - 428,785 445,546 Shares cancelled pursuant to share buyback (5,015,350) - (4,459,302) At the end of the period 258,285,531 267,743,422 263,300,881 6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm At the beginning of the period 52.7 53.5 53.5 Shares issued relating to incentive schemes for employees - - 0.1 Shares cancelled pursuant to share buyback (1.0) - (0.9) At the end of the period 51.7 53.5 52.7\nOf the issued and fully paid ordinary shares, 1,996,643 shares (30 September 2022: 720,838 shares, 31 March 2022: 99,306 shares) are own shares held by an employee benefit trust. This equates to GBP399,329 (30 September 2022: GBP144,168, 31 March 2022: GBP19,861) at GBP0.20 par value of each ordinary share. These shares are held for the purpose of satisfying the Group's share schemes.\nThe movements in the Company's own shares reserve are as follows:\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm At the beginning of the period 7.2 1.5 1.5 Shares issued/purchased for share schemes 16.4 4.2 10.1 Shares used to satisfy share schemes (5.7) (4.8) (5.5) Shares purchased pursuant to share buyback 37.4 - 37.7 Shares cancelled pursuant to share buyback (38.5) - (36.6) At the end of the period 16.8 0.9 7.2\nThe own shares reserve represents shares in the Company purchased from the market and held by an employee benefit trust to satisfy share awards under the Group's share schemes as well as shares purchased for cancellation as part of the share buyback programme. Shares purchased for cancellation are included in the own shares reserve until cancellation, at which point the consideration paid is transferred to retained earnings and the nominal value of the shares is transferred from share capital to the capital redemption reserve.\nShare buyback programme\nOn 23 May 2022, the Company commenced a share buyback programme (the Programme) to repurchase ordinary shares with a market value of up to GBP75.0m. The purpose of the Programme was to reduce the Company's share capital and therefore the shares purchased pursuant to the Programme were subsequently cancelled.\nDuring the six months ended 31 March 2023, the Company completed the Programme, purchasing 4,862,360 ordinary shares at an average price of 768.0p per share and an aggregate cost of GBP37.6m, including GBP0.2m of transaction costs. In aggregate under the Programme, 9,474,652 shares were repurchased at an average price of 791.6p and at a total cost of GBP75.5m, including GBP0.5m of transaction costs. 12. Dividends paid and proposed\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 Declared and paid in the period Dividends per share (pence) 21.2p 17.7p 25.5p Total dividend (GBPm) 54.6 47.2 67.9 Proposed after the balance sheet date Dividend per share (pence) 8.2p 7.8p 21.2 Total dividend (GBPm) 21.2 20.9 54.6 13. Derivatives and hedge relationships\nThe Group's outstanding derivatives were as follows:\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm Consolidated balance sheet Non-current assets: derivative financial instruments USD GBP cross currency fixed interest rate swaps* 14.2 15.3 31.1 Forward currency contracts* - 0.1 0.4 Commodity contracts* 2.5 6.6 11.0 Interest rate swaps* 1.4 1.3 3.4 18.1 23.3 45.9 Current assets: derivative financial instruments USD GBP cross currency fixed interest rate swaps* 7.6 3.6 7.4 USD GBP cross currency floating interest rate swaps*** - 2.3 4.4 Forward currency contracts** - - 0.5 Forward currency contracts* 0.9 0.6 3.3 Forward currency contracts - 1.5 0.2 Commodity contracts* 5.5 14.3 11.6 Commodity contracts**** 1.9 - 11.5 Interest rate swaps* 1.4 - - Forward currency contracts 0.3 - - 17.6 22.3 38.9 Current liabilities: derivative financial instruments Forward currency contracts* (0.7) (1.0) - Forward currency contracts (0.1) - (1.3) GBP euro cross currency floating interest rate swaps** - (0.4) (1.0) Commodity contracts* (7.7) (0.1) (8.2) Commodity contracts**** (0.1) - (0.7) (8.6) (1.5) (11.2) Non-current liabilities: derivative financial instruments Commodity contracts* (1.0) - (0.4) Forward currency contracts* (0.1) - - (1.1) - (0.4) Total net derivative financial assets 26.0 44.1 73.2\n* Instruments designated as part of a cash flow hedge relationship.\n** Instruments designated as part of a net investment hedge relationship.\n*** Instruments designated as part of a fair value hedge relationship.\n**** Instruments for which cash flow hedge accounting has been discontinued.\nThe above derivatives and associated hedge relationships are described in further detail on pages 169 to 171 of the Group's Annual Report and Accounts 2022. At 31 March 2023, the Group is party to a range of commodity derivatives to hedge price risk associated with aluminium (cans), diesel (logistics), sugar, natural gas, power and paraxylene (PET plastic) and has designated these derivatives as cash flow hedges.\nDiscontinued cash flow hedges\nIn September 2022, the Group discontinued hedge accounting for certain commodity derivatives that were hedging purchases during the period from October 2022 to March 2023 as there is no longer an economic relationship between the hedged item and hedging instrument because of new commercial arrangements with suppliers. Prior to the discontinuation of hedge accounting, the Group had accumulated a gain of GBP13.8m through other comprehensive income in the hedging reserve. This gain has been reclassified to profit or loss during the six months ended 31 March 2023 as\nthe hedged purchases occurred. 14. Fair value of financial instruments\nThe Group uses the following valuation hierarchy when measuring financial instruments at fair value:\nLevel 1: quoted (unadjusted) prices in active markets for identical assets or liabilities.\nLevel 2: other techniques for which all inputs which have a significant effect on the recorded fair value are observable, either directly or indirectly.\nLevel 3: techniques which use inputs which have a significant effect on the recorded fair value that are not based on observable market data.\nThe financial instruments which the Group measures at fair value on a recurring basis comprise the derivatives set out in note 13. All derivatives are valued based on level 2 in the hierarchy, i.e. using valuation techniques with market observable inputs; this covers cross-currency interest rate swaps, interest rate swaps, foreign exchange forwards, foreign exchange swaps and commodity swaps. The most frequently applied valuation techniques include forward pricing and swap models using present value calculations. In assessing the fair value of derivatives, the non-performance risk of both the Group and its derivative trading counterparties has been taken into consideration. Default credit risk has been measured and the potential impact on derivatives valuations quantified. As at 31 March 2023, the potential impact from non-performance risk on the fair value of the derivatives portfolio is not material.\nAs in the prior year, the carrying value of financial assets and liabilities other than derivatives (trade and other receivables, cash and cash equivalents, overdrafts, interest-bearing loans and borrowings and trade and other payables) are considered to be reasonable approximations of their fair values, except for fixed rate borrowings, which have a book value of GBP393.2m and a fair value of GBP337.6m at 31 March 2023 (30 September 2022: GBP442.3m book value compared to a fair value GBP367.1m, 31 March 2022: GBP420.3m book value compared to a fair value GBP403.2m). The fair value of the Group's fixed rate interest-bearing borrowings and loans are determined by using discounted cash flow methods using discount rates that reflect the Group's borrowing rate as at the end of the reporting period. The own non-performance risk as at 31 March 2023 was assessed to be insignificant. 15. Retirement benefit schemes\nAt 31 March 2023, Britvic plc had IAS 19 defined benefit pension surpluses in GB, ROI and NI totalling GBP108.4m and an IAS 19 defined benefit pension deficit in France of GBP1.2m (30 September 2022: pension surpluses of GBP138.9m and pension deficits of GBP1.4m, 31 March 2022: pension surpluses of GBP164.0m and pension deficits of GBP1.9m). The decrease in the net defined benefit pension asset is primarily attributable to a net remeasurement loss of GBP39.0m, of which GBP36.6m relates to the GB scheme.\nThe net income for defined benefit schemes recognised in the income statement for the 6 months ended 31 March 2023 was GBP3.2m (6 months ended 31 March 2022: net income of GBP0.7m).\nThe defined benefit section of the GB plan was closed to new members on 1 August 2002 and closed to future accrual for active members from 1 April 2011, with new employees being invited to join the defined contribution scheme. The Northern Ireland scheme was closed to new members on 28 February 2006 and future accrual from 31 December 2018, and new employees are eligible to join the defined contribution scheme. All new employees in Ireland join the defined contribution plan.\nContributions are paid into the defined benefit section of the GB plan as determined by the trustee, agreed by the Company and certified by an independent actuary in the schedule of contributions. As noted in the Group's Annual Report and Accounts 2022, no further deficit funding payments are due to be paid except for the GBP5.0m annual partnership payment which will continue until 2025. The triennial valuation as of 31 March 2022 was finalised in April 2023 and did not result in any change to the schedule of contributions (see note 20). 16. Provisions\nThe movement in the Group's provisions during the 6 months ended 31 March 2023 was as follows:\nRestructuring Other Total GBPm GBPm GBPm At 1 October 2022 1.9 0.9 2.8 Provisions created during the year 0.2 0.2 0.4 Provisions utilised during the year (0.7) - (0.7) Unused amounts reversed (0.3) (0.3) (0.6) At 31 March 2023 1.1 0.8 1.9 Current 0.9 - 0.9 Non-current 0.2 0.8 1.0 1.1 0.8 1.9\nRestructuring provisions at 31 March 2023 primarily relate to the implementation of historic group-wide strategic restructuring and provisions related to the closure of the Group's Norwich site.\nOther provisions at 31 March 2023 relate to certain provisions recognised on acquisition of subsidiaries in Brazil, including regulatory and legal claims. 17. Capital commitments\nAt 31 March 2023, the Group has capital commitments of GBP26.7m (30 September 2022: GBP26.6m) for the acquisition of new plant and machinery, primarily relating to new production lines at Beckton, Rugby and Crolles (France) and also a new heat recovery system at Beckton. 18. Other reserves\nThe movement in the Group's other reserves was as follows:\nCapital redemption Hedging Translation Merger Total reserve reserve reserve reserve GBPm GBPm GBPm GBPm GBPm At 1 October 2022 0.9 27.3 (9.5) 87.3 106.0 Losses in the period in respect of cash flow hedges - (30.4) - - (30.4) Amounts reclassified to the income statement in respect of - (6.1) - - (6.1) cash flow hedges Deferred tax in respect of cash flow hedges - 7.3 - - 7.3 Exchange differences reclassified to profit or loss on - - (0.3) - (0.3) disposal of foreign operations Exchange differences on translation of foreign operations - - (3.9) - (3.9) Tax on exchange differences - - (0.2) - (0.2) Movements included within other comprehensive income - (29.2) (4.4) - (33.6) Transfer of cash flow hedge reserve to inventories - 4.1 - - 4.1 Shares cancelled pursuant to share buyback 1.0 - - - 1.0 At 31 March 2023 1.9 2.2 (13.9) 87.3 77.5 Capital redemption Hedging Translation Merger Total reserve reserve reserve reserve GBPm GBPm GBPm GBPm GBPm At 1 October 2021 - 4.5 (38.1) 87.3 53.7 Gains in the period in respect of cash flow hedges - 18.5 - - 18.5 Amounts reclassified to the income statement in respect of - (2.1) - - (2.1) cash flow hedges Deferred tax in respect of cash flow hedges - (2.7) - - (2.7) Exchange differences on translation of foreign operations - - 15.7 - 15.7 Tax on exchange differences - - (0.3) - (0.3) Movements included within other comprehensive income - 13.7 15.4 - 29.1 Transfer of cash flow hedge reserve to inventories - (1.5) - - (1.5) At 31 March 2022 - 16.7 (22.7) 87.3 81.3\nCapital redemption reserve\nThe capital redemption reserve relates to the repurchase and cancellation of shares of the company pursuant to the share buyback programme (see note 11). Upon cancellation, the nominal value of shares cancelled is transferred from share capital to the capital redemption reserve.\nHedging reserve\nThe hedging reserve records the effective portion of movements in the fair value of commodity swaps, forward exchange contracts, interest rate and cross-currency swaps that have been designated as part of a cash flow hedge relationship.\nTranslation reserve\nThe translation reserve includes cumulative net exchange differences on translation into the presentational currency of items recorded in Group entities with a non-sterling functional currency net of amounts recognised in respect of net investment hedges.\nMerger reserve\nThe merger reserve arose as a result of the non-pre-emptive share placement which took place on 21 May 2010. It was executed using a structure which created a merger reserve under Section 612-613 of the Companies Act 2006. 19. Assets held for sale\nAs previously reported, on 8 October 2020, contracts were exchanged for the sale of the Britvic Norwich production site (jointly owned with Unilever). The sale of the Norwich land and buildings (which form part of the Group's GB operating segment) is subject to conditions precedent, including certain planning consents being obtained by the buyer. On 1 February 2022, the Company signed a variation agreement to allow the buyer additional time to obtain the necessary consents as certain planning processes have taken longer than initially anticipated. Accordingly, the sale may now take up until October 2024 to complete. The assets continue to be classified as assets held for sale under IFRS 5 as the assets are available for sale in their present condition and the sale is highly probable. In line with IFRS 5, assets held for sale are measured at the lower of carrying value and fair value less costs to sell. The carrying value of the Norwich land and buildings is GBP16.8m (30 September 2022: GBP16.8m, 31 March 2022: GBP16.8m). 20. Events after the reporting period\nGB defined benefit pension plan\nIn April 2023, the triennial valuation for the Group's GB defined benefit pension plan as at 31 March 2022 was finalised. The valuation, which is prepared based on assumptions determined by the plan's trustee for the purpose of setting the appropriate level of future contributions, indicated that the market value of the plan's assets exceeded technical provisions. Taking into consideration the results of the triennial valuation, the Company and trustee agreed a schedule of contributions setting out the payments that the Company will make to the plan over the period from April 2023 to March 2031. As detailed in the Group's Annual Report and Accounts for the year ended 30 September 2022, the plan benefits from an interest in a pension funding partnership under which the Group contributes GBP5m per annum to the plan in December of each year, up to and including December 2025. The schedule of contributions confirms that no additional payments will be due to the plan in the period up to 31 March 2026. Beyond 31 March 2026, an annual process to assess the funding position has been agreed for the purpose of assessing whether any additional contributions are due.\nThe triennial valuation reflects that, in April 2023, an agreement in principle has been reached between the trustee and the Company that all pension increases (excluding GMP) under the plan should be based on the RPI measure of inflation. This is expected to result in an amendment to the plan's trust deed and rules to clarify that the Company does not have the power to set an alternative rate of pension increases. The triennial valuation also reflects revised demographic assumptions, including mortality base tables. The Company expects to incorporate revised pension increase and demographic assumptions in its forthcoming actuarial valuation at 30 September 2023 prepared in accordance with IAS 19 'Employee Benefits'. The Company is at an early stage in quantifying the impact of the revised assumptions on the defined benefit pension surplus recognised in the consolidated balance sheet. Initial high-level estimates suggest that the revised RPI pension increase assumptions would decrease the pension surplus by approximately GBP20m and that revised mortality assumptions would positively impact the surplus by approximately GBP13m. The revised mortality assumptions take into consideration the latest plan-specific and wider UK population mortality experience. Further disclosure will be provided once the next IAS 19 valuation has been completed at 30 September 2023.\nContinuation of share buyback\nOn 15 May 2023, the Board approved a second share buyback programme to repurchase ordinary shares with a market value of up to GBP75.0m, to be carried out over the next 12 months. The purpose of the programme is to reduce share capital and therefore the shares repurchased will be subsequently cancelled. 21. Related party transactions\nA full explanation of the Group's related party relationships is provided in the Group's Annual Report and Accounts 2022. There are no material transactions with related parties or changes in the related party relationships described in the last annual report that have had, or are expected to have, a material effect on the financial performance or position of the Group in the six month period ended 31 March 2023.\nAppendix 1\nNON-GAAP RECONCILIATIONS\nAdjusting items\nThe Group excludes certain items, referred to as adjusting items, from its non-GAAP measures because of their size, frequency and nature to allow shareholders to understand better the elements of financial performance in the year, so as to facilitate comparison with prior periods and to assess trends in financial performance more readily.\nAt March 2023 these items primarily relate to strategic restructuring and amortisation of acquisition-related intangibles. Additionally, the expense associated with the change in accounting policy for SaaS arrangements are considered to be adjusting items in FY22, but form part of underlying results from 2023 onwards.\nAdjusted KPIs are used to measure the underlying profitability of the Group and enable comparison of performance against peers. They are also used in the calculation of short and long-term reward schemes.\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September Note 2022 GBPm GBPm GBPm Implementation of SaaS accounting guidance (a) - (3.2) (7.5) Strategic restructuring - business capability programme (b) (0.4) (0.3) (0.5) Strategic restructuring - organisational capability transformation (c) - - 1.5 Credits in relation to the acquisition and integration of (d) - 0.2 0.3 subsidiaries Strategic M&A activity (e) 0.1 1.2 1.0 Acquisition-related amortisation (f) (4.3) (4.3) (8.4) Total included in operating profit (4.6) (6.4) (13.6) Tax on adjusting items included in profit before tax 0.1 0.4 1.2 Net adjusting items (4.5) (6.0) (12.4) a. In FY22, a change in accounting policy was implemented in relation to customisation and configurationcosts of SaaS: due to the change in policy, these costs were presented as adjusting items. In H1 2023 the costshave been recorded in underlying performance as the costs now form part of normal business activity. b. 'Strategic restructuring - business capability programme' relates to a restructuring of supply chain andthe operating model across the Group, initiated in 2016. Costs in the period of GBP0.4m relate to the closure of theNorwich site and are primarily site running costs. FY22 costs were of a similar nature. c. 'Strategic restructuring - organisational capability transformation' in the prior period relates tocontract termination costs in relation to the closure of the Counterpoint business. All activity is now completeand hence no costs were recorded in HY23. d. FY22 included the release of provisions for Bela Ischia Alimentos Ltda (Bela Ischia) and EmpresaBrasileira de Bebidas e Alimentos SA (Ebba) which have been fully utilised. e. A release of GBP0.1m has been recorded in HY23 relating to Strategic M&A activity, similar to the credit ofGBP1.2m in FY22 relating to the remeasurement of historic provisions. f. Acquisition-related amortisation relates to the amortisation of intangibles recognised on acquisitions inBritvic Ireland, Britvic France, Britvic Brazil, Aqua Libra Co and Plenish.\nAdjusted profit\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm Operating profit as reported 80.7 67.1 192.4 Add back adjusting items in operating profit 4.6 6.4 13.6 Adjusted EBIT 85.3 73.5 206.0 Net finance costs (11.4) (7.8) (17.3) Adjusted profit before tax and acquisition-related amortisation 73.9 65.7 188.7 Acquisition-related amortisation (4.3) (4.3) (8.4) Adjusted profit before tax 69.6 61.4 180.3 Taxation (14.9) (13.4) (34.9) Less adjusting tax credit (0.1) (0.4) (1.2) Adjusted profit after tax 54.6 47.6 144.2 Adjusted effective tax rate 21.5% 22.4% 20.0% 6 months 6 months 12 months ended ended ended 31 March 31 March 30 September 2023 2022 2022 Adjusted basic earnings per share Profit for the period attributable to equity shareholders (GBPm) 54.4 45.9 140.2 Add: net impact of adjusting items (GBPm) 4.5 6.0 12.4 Adjusted earnings (GBPm) 58.9 51.9 152.6 Weighted average number of ordinary shares in issue for basic earnings per 258.6 267.4 266.5 share (millions) Adjusted basic earnings per share (pence) 22.8p 19.4p 57.3p Adjusted diluted earnings per share Adjusted earnings (GBPm) 58.9 51.9 152.6 Effect of dilutive potential ordinary shares - share schemes (millions) 1.6 0.6 0.5 Weighted average number of ordinary shares in issue for diluted earnings per 260.2 268.0 267.0 share (millions) Adjusted diluted earnings per share (pence) 22.6p 19.4p 57.2p\nFree cash flow\n6 months ended 6 months ended 12 months ended 31 March 2023 31 March 2022 30 September 2022 GBPm GBPm GBPm Net cash flows from operating activities 35.7 38.4 239.6 Purchases of property, plant and equipment (25.5) (21.8) (72.9) Purchases of intangible assets (3.9) (2.8) (11.7) Interest paid, net of derivative financial instruments (9.3) (7.1) (14.8) Repayment of principal portion of lease liabilities (5.0) (3.8) (9.3) Repayment of interest portion of lease liabilities (1.0) (0.9) (2.1) Free cash flow (9.0) 2.0 128.8\nAdjusted net debt\n31 March 2023 31 March 2022 30 September 2022 Note GBPm GBPm GBPm Cash and cash equivalents* (48.0) (33.3) (97.4) Overdrafts* 23.0 9.3 9.8 Derivatives hedging balance sheet debt 10 (21.6) (22.2) (42.9) Interest-bearing loans and borrowings 10 640.0 580.0 605.3 Adjusted net debt 593.4 533.8 474.8\n* Comparative figures for overdrafts and cash and cash equivalents have been restated as set out in Note 2 'basis of preparation'.\n----------------------------------------------------------------------------------------------------------------------- Dissemination of a Regulatory Announcement, transmitted by EQS Group. The issuer is solely responsible for the content of this announcement.\n-----------------------------------------------------------------------------------------------------------------------\nISIN: GB00B0N8QD54 Category Code: IR TIDM: BVIC LEI Code: 635400L3NVMYD4BVCI53 OAM Categories: 1.2. Half yearly financial reports and audit reports/limited reviews Sequence No.: 243830 EQS News ID: 1633641 End of Announcement EQS News Service =------------------------------------------------------------------------------------\nImage link: https://eqs-cockpit.com/cgi-bin/fncls.ssp?fn=show_t_gif&application_id=1633641&application_name=news\n(END) Dow Jones Newswires\nMay 16, 2023 02:00 ET (06:00 GMT)\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 16742,
  "scraped_at": "2026-02-14T02:29:17.112786",
  "_text_extracted": true
}