{
  "article_id": "c99d0b015716",
  "url": "https://metro.co.uk/2025/06/07/man-utd-set-beat-arsenal-signing-60million-transfer-target-23353444/",
  "title": "Man Utd set to beat Arsenal to signing of £60million transfer target | Football",
  "date": "20250607T080000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are in pole position to win the race to sign Viktor Gyokeres ahead of Arsenal and Chelsea.\nThe Red Devils endured a season of almost unprecedented misery which culminated in their failure to qualify for Europe after losing the Europa League final against Tottenham in Bilbao last month.\nDespite the grim picture, United are confident of being able to spend significantly in the transfer window and arm Ruben Amorim with a squad capable of competing for a top eight finish at least.\nA deal to sign Matheus Cunha from Wolves has already been completed while a second bid for Brentford’s Bryan Mbuemo has been tabled.\nUnited struggled for goals last season with summer signing Joshua Zirkzee showing only flashes of potential, while the previous year’s headline recruit, Rasmus Hojlund, has been an unmitigated disaster.\nThe Denmark international’s future looks destined to lie away from Old Trafford with Inter showing genuine interest in a player who looked totally bereft of confidence at the end of last season.\nUnited will hope to recruit a readymade replacement for the former Atalanta striker and now, according to The Sun, are in pole position to sign Gyokeres.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Sweden international thrived under Amorim’s tutelage at Sporting Lisbon and is keen on a move to the Premier League.\nWith Arsenal making concrete progress in their attempts to Benjamin Sesko and Chelsea looking to follow up the signing of Liam Delap with the addition of Hugo Ekitike, the path is suddenly clearing for United to land Gyokeres.\nUnited, meanwhile, are understood to be confident that they can continue to strengthen their squad this summer after making reductions in the player wage bill and other cost savings.\nThe club posted a pre-tax loss of £3.1million for the third quarter of the fiscal year in results published on Friday, way down on losses of £83.6m for the same period in the prior year.\nExpert analysis: Viktor Gyokeres\nGyokeres is a bunch of different strikers blended into one. He’s a bulldozer, but he’s also got that turn of pace and knack of finding himself in shooting areas. Some strikers, you can see they overthink things, but he’ll shoot first and ask questions later.\nAt 6ft 2in, he could definitely add an aerial presence to his game to take himself to the next level, but he’s very good at using his chest as a magnet to win these aerial duels.\nHe may not be as fearless as others when it comes to aerial duels, but he knows how to use his strengths to his advantage to hold up the ball and bring others into play.\nHe’s not someone like Roberto Firmino who is going to be dropping deep, so if Arsenal need to change certain things to get the best out of Gyokeres then they should.\nZach Lowy, European football expert\nTotal operating costs were down 20.4 per cent compared to the same quarter last year, driven by a reduction in the wage bill due to United’s involvement in the Europa League instead of the Champions League, plus the January loan exits of the likes of Marcus Rashford and Antony.\nMore Trending\nThe reduction in costs was also attributable to the redundancy programme affecting non-playing staff, which began last year.\nChief executive Omar Berrada admitted the club’s 15th-place finish in the Premier League this season was ‘below our standards’ and said there was a ‘clear expectation of improvement’ next season.\nChanges in personnel seem certain to be required to achieve that and, while United insiders say the club intend to be disciplined about any investment they make this summer in order to remain compliant with the Premier League’s profitability and sustainability rules (PSR), the reduction in operating costs alongside a 17.4 per cent increase in revenue does give them room for manoeuvre in the transfer market.\nMORE: Man Utd told to join race to sign £42m Arsenal transfer target\nMORE: Thierry Henry’s warning to Arsenal and Chelsea over signing ‘amazing’ £60m striker\nMORE: Next Tottenham manager odds: Premier League boss favourite to replace Ange Postecoglou",
  "word_count": 730,
  "scraped_at": "2026-02-14T01:58:41.954809",
  "_text_extracted": true
}