{
  "article_id": "c9a29dbf451e",
  "url": "https://metro.co.uk/2023/10/24/rasmus-hojlund-is-biggest-strength-in-man-utd-squad-says-fc-copenhagen-boss-19710553/",
  "title": "Rasmus Hojlund is  biggest strength in Man Utd squad , says FC Copenhagen boss | Football",
  "date": "20231024T083000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FC Copenhagen manager Jacob Neestrup has labelled Rasmus Hojlund as the ‘biggest strength’ in Manchester United’s squad ahead of their Champions League clash on Tuesday night at Old Trafford.\nThe 20-year-old started his professional career at Copenhagen before moving on to Sturm Graz, Atalanta and then Old Trafford this year.\nHojlund is yet to score in the Premier League, but has netted three times in the Champions League for the Red Devils and Neestrup know that he will be a serious threat to his former team.\nAsked how he hopes to handle Hojlund, Neestrup told The United Stand: ‘The plan is we know that Hojlund is the biggest strength in the Manchester United squad, and what remains is that we have to be true to ourselves.\n‘I know we are not going to have the ball as much as we normally have in the Danish league, but when we have the ball we need to show that we are a proper football team. Manchester United are a team with high speed players, and players that are top, top, level in football.’\nThe 35-year-old manager added: ‘It is a massive game for all the players, for FC Copenhagen and for all Danish football but we are 95 minutes away from getting a good result as a team and for me as a manager.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nManchester United boss Erik ten Hag is hoping that facing his old club will inspire Hojlund, telling a press conference on Monday: ‘You know it’s a special game for him. He grew up there and you know he will be highly motivated.\n‘Against Galatasaray, it was two brilliant goals as well as the one in Munich.\n‘He is always in scoring positions. I am sure – the same with Marcus Rashford – that when we as a team do what we have to do, they will be in scoring positions. Then it’s about the finishing.’\nMore Trending\nCopenhagen have begun their Champions League group stage campaign with a draw at Galatasaray followed by a narrow 2-1 defeat at home against Bayern Munich.\nIt is one more point than the Red Devils have managed, with Manchester United in desperate need of victory on Tuesday to kickstart their challenge for the knockout stages.\nMORE: Manchester United assistant manager makes decision on taking vacant Ajax job\nMORE: Copenhagen player reveals warning from Manchester United star ahead of Champions League clash\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 474,
  "scraped_at": "2026-02-14T02:10:28.704824",
  "_text_extracted": true
}