{
  "article_id": "c9c063c85465",
  "url": "https://www.90min.com/posts/dominik-szoboszlai-reveals-pick-win-premier-league-title",
  "title": "Dominik Szoboszlai reveals his pick to win the Premier League title",
  "date": "20230827T144500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dominik Szoboszlai reveals his pick to win the Premier League title\n- The Hungarian midfielder reveals his ambition to win every trophy available at Liverpool\n- Szoboszlai joined Liverpool from RB Leipzig after £60m release clause activated in his contract\n- Jurgen Klopp's side travel to Newcastle on Sunday looking to maintain unbeaten start\nSummer signing Dominik Szoboszlai has backed Liverpool to win the Premier League title, claiming he always thinks positively when it comes to lifting trophies.\nThe Hungarian is one of the standout arrivals in England this summer, with a whirlwind move that \"came about really quickly\" seeing him depart Bundesliga upstarts RB Leipzig for the pressure cauldron that is Anfield.\nSzoboszlai's price tag is a hefty one at £60m but is reflective of his standing in the game - the 22-year-old has long been tipped to reach the top of European football after leaving home at the age of 14 to move to Austria and join Red Bull Salzburg.\nHe's arrived at a time of transition for Liverpool, who have ripped up their midfield copybook in favour of heading in a brand new direction. Jordan Henderson, Fabinho and James Milner among the heavyhitters to leave the club this summer; Naby Keita and Alex Oxlade-Chamberlain too.\nSzoboszlai, Alexis Mac Allister and Waturu Endo represent a new era on Merseyside, and they are tasked with getting Liverpool competing at the top of the table again after they missed out on a top-four finish and Champions League qualification last year.\nScaling those heights doesn't seem to worry or phase Szoboszlai, who has openly revealed his ambitions to win absolutely everything on offer at Liverpool.\n\"Us,\" he quipped, when asked by reporters about who he thinks will come out on top in the race for the Premier League title. \"\"I am thinking it. I always think that way.\" he continued when probed over whether or not he was joking. \"Even if this is hard and there are very good teams in the Premier League, but we are also very good, we have a very good coach and players. We are going to do our best and at the end I want to be first.\n\"We will see. We have a lot of games. [Manchester City] mainly have a lot of games and we have to play against them as well. I think everybody in the Premier League who has a chance to win, they are going to want to win anyway. We are thinking the same. Like, I am thinking the same but probably the other guys are going to think the same if you ask them.\n\"If they ask me if I want to win the Premier League, of course I want to win it. If I want to win the Europa League and the FA Cup, the same. Everything we can do this year. I want to win everything because nobody is going to ask you how it feels to be second.\"\nREAD THE LATEST LIVERPOOL NEWS, TRANSFER RUMOURS & GOSSIP\nThe only surprising element of Szoboszlai's move to Liverpool was the suddenness of the deal. Within days of the news breaking that Jurgen Klopp's side were interested, the deal was done - the six-time European Cup/Champions League winners moving swiftly to tie up a move to Merseyside before any other interested party could muscle in.\n\"It came about really quickly,” Szoboszlai admitted. \"It happened in two or three days. I did my things with the club and then my agent spoke to the club and then the two clubs had to figure out how we do it. The manager called me and that was the final decision to say: ‘OK, I want to join them.’\n\"Because of this energy, what I said before, how Klopp talks with the players, on and off the pitch, so of course I am really happy.\nSzoboszlai's impact at Liverpool has been immediate, with no player running further than he did during the 3-1 win over Bournemouth. He also put in a good shift on the opening weekend of the season against Chelsea, drawing praise from his manager for his progress.\n\"His energy, combined with technique, desire...pretty much all attributes you want to see,\" Klopp said of his new arrival. \"The last thing you would think when you see him playing is that he is only 22. So there's a lot more to come, when he settles in.\n\"Obviously he has no problem to adapt to everything in an instant. There's still more to come and we are really pleased. From the first day he is full of energy, in the middle of the team already.\"\nLISTEN NOW TO 90MIN'S TALKING TRANSFERS PODCAST\nOn this edition of Talking Transfers, part of the 90min podcast network, Scott Saunders is joined by Toby Cudworth and Graeme Bailey to discuss Mohamed Salah's huge offer from the Saudi Pro League, Liverpool's stance on a sale, Ryan Gravenberch, Matheus Nunes, Romelu Lukaku, Folarin Balogun & more!\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 841,
  "scraped_at": "2026-02-14T01:56:26.901974",
  "_text_extracted": true
}