{
  "article_id": "c9ff0b838127",
  "url": "https://www.justarsenal.com/what-arsenal-thinks-about-giving-liverpool-a-guard-of-honour-at-the-weekend/391872",
  "title": "What Arsenal thinks about giving Liverpool a guard of honour at the weekend",
  "date": "20250506T220000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool received their first guard of honour after securing the Premier League title last weekend, with Chelsea paying tribute to their success. The newly crowned champions are set to face Arsenal at Anfield this weekend in a fixture that carries significant importance for the visiting side.\nArsenal, while placing a strong emphasis on their Champions League campaign, still require additional points in the Premier League in order to secure a top-two finish. Recent domestic results have been disappointing, with the team dropping vital points, including a loss to Bournemouth in their previous league outing.\nDespite the high stakes of the upcoming match, Arsenal will still provide Liverpool with a guard of honour before kick-off. This comes amid speculation that the gesture might not be extended due to the rivalry between the two clubs and the competitive nature of the title race. However, as reported by the Daily Mail, Arsenal will go ahead with the guard of honour, viewing it as a display of proper sportsmanship.\nThe report notes that the club considers the gesture to be a sign of respect, and it reflects the values upheld at the Emirates. Although Arsenal were Liverpool’s closest challengers this season and may feel unfortunate not to have secured the title themselves, they are prepared to acknowledge their rivals’ achievement in the spirit of the game.\nSuggestions that the Gunners might opt out of the tradition were unfounded, and the club’s stance reinforces the importance of humility and mutual respect in professional football. Players are expected to participate fully in the honour, as the club anticipates finding itself in a similar position of success shortly.\nThis moment will serve as a reminder that excellence should be recognised, even in the face of disappointment. For Arsenal, the match remains a crucial opportunity to recover lost ground in the league, but the act of saluting Liverpool’s triumph demonstrates their commitment to maintaining the integrity of the sport.\n______________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us here…",
  "word_count": 394,
  "scraped_at": "2026-02-14T01:49:39.552690",
  "_text_extracted": true
}