{
  "article_id": "ca0c1d641892",
  "url": "https://thepeoplesperson.com/2024/12/17/official-alejandro-garnacho-wins-fifa-puskas-award-for-stunning-overhead-kick-vs-everton-288719/",
  "title": "Official : Alejandro Garnacho wins FIFA Puskas Award for stunning overhead kick vs . Everton - Man United News And Transfer News",
  "date": "20241217T184500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United winger Alejandro Garnacho has won the FIFA Puskás Award 2024 for his sensational overhead kick against Everton.\nGarnacho as been feated for the amazing, acrobatic bicycle kick, which he netted at Goodison Park in November 2023.\nThe stunning strike claimed United’s Goal of the Season award as well as the Premier League’s best goal last term.\nNow, it has been recognised as the finest goal anywhere in the world during the relevant qualifying period (August 2023-August 2023).\nThe last time @ManUtd took on Everton, Alejandro Garnacho produced something extra special 🤌\n🎙️ @ESPNFutbolArg pic.twitter.com/wrrRwXCoKe\n— Premier League (@premierleague) March 9, 2024\nGarnacho was announced as the winner of the FIFA Puskas Award for 2024 by Juventus legend Alessandro Del Piero at The Best FIFA Football Awards ceremony in Doha, Qatar.\nThe voting for this edition was evenly divided between fans and a panel of FIFA legends, with Garnacho triumphing over 10 other goals to secure the accolade.\nReacting to the achievement, Garnacho said [via Fabrizio Romano on X], “It was a great goal, of course.”\n“But there is a lot more to come, and a lot more to look forward to.”\n“Thank you for all the support.”\n🚨✨ 2024 Puskas Award by FIFA as Goal of the Year: Alejandro Garnacho.\n“It was a great goal, of course. But there is a lot more to come, and a lot more to look forward to. Thank you for all the support”. pic.twitter.com/FGzddn0k2L\n— Fabrizio Romano (@FabrizioRomano) December 17, 2024\nGarnacho is only the second Argentinian recipient of the prize after former Tottenham Hotspur man Erik Lamela, who won it in 2021 for his Rabona goal in the North London derby against Arsenal.\nThe 20-year-old academy graduate is also only the second United player to win the award, following in the footsteps of his football idol Cristiano Ronaldo.\nRonaldo won it in 2009 for his rocket at Porto in the 2008/09 Champions League quarter-final.\nUnited are back in action on Thursday when they take on Spurs in the Carabao Cup at the Tottenham Hotspur Stadium.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 349,
  "scraped_at": "2026-02-14T01:52:10.155133",
  "_text_extracted": true
}