{
  "article_id": "ca2537691872",
  "url": "https://www.caughtoffside.com/2024/11/06/arne-slot-liverpool-wataru-endo/",
  "title": "Arne Slot refuses to sell Liverpool duo in January despite lack of minutes",
  "date": "20241106T214500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool will not part ways with Federico Chiesa or Wataru Endo in January despite the duo not being key to the impressive start to life for Arne Slot at Anfield.\nThe Dutch coach currently has the Reds top of both the Premier League and Champions League tables, while the Merseyside outfit have also reached the quarter-finals of the Carabao Cup.\nA big part in Slot’s success with Liverpool so far is the fact that the former Feyenoord boss knows his best 11 and hasn’t rotated heavily throughout the opening part of the campaign.\nTwo players that have not played a big role in the Reds’ season have been Chiesa and Endo, with injury issues allowing the Italian to play just 78 minutes, while the Japanese international has racked up 163 minutes of action across seven games.\nDespite this, Slot will not sell the duo in January and has blocked clubs from trying to lure the stars away, reports Football Insider. The Dutch coach does not want to weaken his squad in any way, therefore, the Liverpool pair are expected to stay.\nBoth have been linked with moves away from Anfield in recent months and interest is likely to remain heading into 2025.\nArne Slot keen to keep Trent Alexander-Arnold for the remainder of the season\nTrent Alexander-Arnold has also been linked with a January exit amid interest in the full-back from Real Madrid, however, the report states that the 26-year-old will be going nowhere until at least next summer.\nThe full-back is out of contract at the end of this season and there has been no concrete update on the defender receiving a new deal, although work continues to be done behind the scenes.\nEveryone in the football world has been impressed with the start Slot has made at Liverpool and in order to continue it, it is key that the new Liverpool boss keeps his squad together.",
  "word_count": 318,
  "scraped_at": "2026-02-14T02:02:07.199633",
  "_text_extracted": true
}