{
  "article_id": "ca4531eee90c",
  "url": "https://www.marieclaire.com/celebrity/royals/prince-george-prince-william-boys-trip-paris-surprise-appearance/",
  "title": "Prince George and Prince William Are on a Boy Trip to Paris as They Make a Surprise Appearance That  Really Important  to the Royal Dad",
  "date": "20250410T010000Z",
  "domain": "marieclaire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Prince George and Prince William Are on a Boys' Trip to Paris as They Make a Surprise Appearance That's \"Really Important\" to the Royal Dad\n\"I've left the other two at home.\"\nSelect the newsletters you’d like to receive. Then, add your email to sign up.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nDelivered daily\nMarie Claire Daily\nGet exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more.\nSent weekly on Saturday\nMarie Claire Self Checkout\nExclusive access to expert shopping and styling advice from Nikki Ogunnaike, Marie Claire's editor-in-chief.\nOnce a week\nMaire Claire Face Forward\nInsider tips and recommendations for skin, hair, makeup, nails and more from Hannah Baxter, Marie Claire's beauty director.\nOnce a week\nLivingetc\nYour shortcut to the now and the next in contemporary home decoration, from designing a fashion-forward kitchen to decoding color schemes, and the latest interiors trends.\nDelivered Daily\nHomes & Gardens\nThe ultimate interior design resource from the world's leading experts - discover inspiring decorating ideas, color scheming know-how, garden inspiration and shopping expertise.\nPrince George, Princess Charlotte and Prince Louis are currently on a school break, and while royal watchers have been wondering what the Wales family has been up to, it turns out Prince William and his eldest child escaped for a little father/son time in the City of Light. Passionate Aston Villa FC fans William and George were spotted in the stands during the UEFA Champions League quarter final first leg match on Wednesday, April 9.\nJoined by the Prince of Wales's longtime friend Thomas van Straubenzee, the father/son duo are taking in the match between Paris Saint-Germain and Aston Villa at Parc des Prince stadium. The outing marks 11-year-old Prince George's first public appearance since Christmas 2024.\nAhead of the game, the Prince of Wales gave an interview to TNT Sports, joining football legend Rio Ferdinand to discuss the exciting match in an Instagram Reel. When it was pointed out, “You came with a few mates, is it a bit of a lads tour?\" the future King replied with a laugh, “Well I've got my son here as well, I’m on best behavior as well.\"\nNoting that \"it's been 43 years\" since Aston Villa won the Champions League, the Prince of Wales said it was \"important\" for him to have his son along for the moment. “I want George to experience a night out away from home in a big European competition,\" Prince William said. \"I hope it’s not 43 years before the next time it happens. I think those memories are really important to create.\"\nA photo posted by on\nFerdinand inquired if he was \"one of those dads\" who insists on his kids being fans of his favorite team, but Prince William answered very diplomatically.\n\"I’m generally very open to whoever they support, but obviously I’m a bit biased,\" he said, adding, \"But also they come to games with Villa they’re probably going to support Villa.\"\nAs for Prince Louis and Princess Charlotte—who have never publicly shared their love for any particular football team—the Prince of Wales said, \"I’ve left the other two at home, probably watching tonight, so we’ll wait and see who they support.\"\nGet exclusive access to fashion and beauty trends, hot-off-the-press celebrity news, and more.\n\"Home\" may have been a relative term, as it was exclusively reported by Paris Match on April 9 that the Wales family had taken a ski holiday in France for their school break. The outlet shared exclusive photos of the family outside their villa on April 2 and 3, with the princess wearing a gray and red sweater with the word \"Ski\" across the front.\nAlong with discussing his kids, the Prince of Wales jumped into an incredibly astute analysis of Aston Villa's chances during the match, and even Ferdinand was impressed. \"Do not go for a punditry job,\" the former football player joked, adding that the Prince of Wales could give him a run for his money.\nFootball fans were equally impressed, with one commenter writing, in part, \"Mate he's actually got serious ball knowledge\" and another adding, \"He should work for BT Sport. Man, I was shocked at his analysis.\"\nKristin Contino is Marie Claire's Senior Royal and Celebrity editor. She's been covering royalty since 2018—including major moments such as the Platinum Jubilee, Queen Elizabeth II’s death and King Charles III's coronation—and places a particular focus on the British Royal Family's style and what it means.\nPrior to working at Marie Claire, she wrote about celebrity and royal fashion at Page Six Style and covered royalty from around the world as chief reporter at Royal Central. Kristin has provided expert commentary for outlets including the BBC, Sky News, US Weekly, the Today Show and many others.\nKristin is also the published author of two novels, “The Legacy of Us” and “A House Full of Windsor.” She's passionate about travel, history, horses, and learning everything she can about her favorite city in the world, London.",
  "word_count": 840,
  "scraped_at": "2026-02-14T02:05:46.993214",
  "_text_extracted": true
}