{
  "article_id": "ca6368db02c3",
  "url": "https://www.teamtalk.com/news/real-madrid-transfers-cristian-romero-tottenham-kylian-mbappe-attack",
  "title": "Real Madrid : â ‚ ¬100m  offer  for Tottenham star prepared as Mbappe launches scathing attack on teammates",
  "date": "20260129T233000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid ready stunning €100m ‘offer’ for Tottenham star as Mbappe launches scathing attack on teammates\nReal Madrid are determined to sign one of Tottenham Hotspur’s most important players, but there is turbulence at the Bernabeu, with Kylian Mbappe brutally criticising his teammates.\nThe post-Xabi Alonso era is underway at Real Madrid, but things certainly haven’t gone perfectly for interim manager Alvaro Arbeloa.\nLos Blancos dramatically lost 4-2 to Jose Mourinho’s Benfica on Wednesday night, which means they’ll have to qualify for the Champions League knockouts via the play-offs. This was a big source of Mbappe’s frustrations.\nBut the Spanish giants aren’t resting on their laurels and reports suggest they’re planning a blockbuster raid on Tottenham, while a Manchester United star is also on their radar.\nReal Madrid determined to sign Tottenham star\nThere have been few players in world football linked more with Real Madrid in recent years than Tottenham star Cristian Romero, and a seismic offer for the centre-back is said to be in the works.\nRomero’s defensive partner, Micky van de Ven, is another player Real Madrid are huge admirers of, but the Argentine is reportedly the man their focused on.\nA new report from Fichajes has stunningly claimed that Real Madrid are seeking ‘immediate solutions’ to fix their recent problems. Club president, Florentino Perez, has therefore ‘decided to intervene’ by offering Tottenham a hefty €100m (£86.6m, $120m) fee to convince them to sell Romero.\nThe belief is that the offer may be too high for Spurs to turn down. Indeed, the report adds that the signing of Romero is seen by Perez as a ‘vital necessity to inject aggression and character’ into their back four and ‘the €100m offered is intended to overcome any resistance from the English club’.\nHowever, while Romero is undoubtedly a player Real Madrid admire, the claims of the supposed €100m bid must be taken with a pinch of salt.\nNo other outlets have reported the offer and Fichajes have a history of making outlandish claims that turn out to have no truth to them.\nTherefore, while Romero is a player to keep an eye on, it still seems unlikely he’ll be leaving Tottenham this month.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nMbappe highlights major ‘problem’ for Real Madrid\nThe 4-2 defeat against Benfica on Wednesday couldn’t have been more painful for Real Madrid, with Mourinho heaping the pressure on his former side, who must now win in the play-offs to continue their Champions League campaign.\nMbappe, though, can hold his head high. He notched a brace on the night, putting his team in front before getting one back later on when his side were behind, to make it 3-2.\nBut Benfica were certainly the better team, and managed to qualify for the play-offs themselves, but only on goal difference, after goalkeeper, Anatoliy Trubin, incredibly scored a crucial header in the 98th-minute to make it four for the Portuguese giants.\nThese are difficult times for Real Madrid, and Mbappe didn’t hold back in venting his anger.\n“It isn’t about quality, and it isn’t about tactics. It’s about having more desire than your opponent,” Mbappe told reporters, as cited by GOAL.\n“You could see that everything was on the line for Benfica, and you couldn’t see that for us, and that’s a problem. Before the game, both teams had something to play for: us being in the top eight, and Benfica being among the 24. We saw it from Benfica, but you didn’t see it from us.\n“I don’t have a clear explanation. It wasn’t the same [at Benfica] as against Villarreal, and that’s a problem. We aren’t being consistent in our play. We have to solve that. We can’t do it one day, and then not another. A team of champions doesn’t do that. We have two more games, and that hurts a bit. We wanted to have time in February to work on our play, and instead we’ll play the play-offs.”\n“What we did today was not normal. We had a clear goal of finishing in the top eight to have two fewer games and lighten the load, but we started very poorly.\n“They deserved to score first. We had one chance and scored. I thought that would get us into the game, but it was the opposite. They were better and if they had gone into the break 5-1 up, it wouldn’t have surprised anyone.\n“We came out with the intention of changing what had happened. We conceded a goal that hurts a little because it came from a direct play, and from there the game was over. When you’re a goal down, you try to push, but the opponent wastes time and that’s part of the game. We didn’t set the pace or show enough creativity to create clear chances.”\nReal Madrid ‘serious’ about signing Man Utd star\nIn other news, Fichajes claim in another report that Real Madrid are “seriously considering” signing Diogo Dalot from Manchester United this month.\nA new right-back is said to be a ‘priority’ for Arbeloa’s side, amid the lacklustre form of Trent Alexander-Arnold.\n“A convincing offer in the last days of January could open the door to negotiations,” the report states.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 911,
  "scraped_at": "2026-02-14T01:53:15.576591",
  "_text_extracted": true
}