{
  "article_id": "ca94e1d920a2",
  "url": "https://www.teamtalk.com/news/liverpool-explode-past-man-utd-101m-global-phenom-ratcliffe-now-very-optimistic-alternative-deal",
  "title": "Man Utd transfers : Liverpool explode into lead for £101m midfield superstar with Ratcliffe now  very optimistic  of alternative deal",
  "date": "20240710T203000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool explode past Man Utd for £101m global phenom with Ratcliffe now ‘very optimistic’ of signing Plan B\nManchester United are in growing danger of missing out on the signature of top summer target Joao Neves after the chances of Liverpool hijacking the move were revealed – though solace will come quickly for Sir Jim Ratcliffe with confidence growing that a bargain deal for an alternative is quickly falling into place.\nThe British billionaire is now at the Manchester United wheel having bought out a 27.7% stake of the Glazers’ shareholdings earlier this year in a £1.3bn deal that grants Ratcliffe full sporting control. And while he has spent his first few months in charge both assessing the future of Erik ten Hag as manager and assembling a crack team of specialists behind the scenes to elevate the club back among the English and European elite, work is now poised to begin in earnest on strenghening their squad.\nHaving brought in Jason Wilcox (technical director) and Dan Ashworth (sporting director) to oversee their business, United have very quickly identified not just the positions they wish to strengthen, but also a long list of players to target to help turbo-charge the new era.\nDON’T MISS ➡️ Euro Paper Talk: Five dazzling Man Utd transfers green lit with attacking duo first\nTo kick things off, the club are understood to have negotiated personal terms over the signings of Matthijs de Ligt and Joshua Zirkzee, with the Dutch duo likely to sign once the Netherlands’ Euro 2024 adventure is over.\nAnd while a fee for Zirkzee will be easy to negotiate, owing to the €40m clause in his Bologna deal, United do still need to thrash out terms with Bayern Munich over a deal for De Ligt. However, with the player giving the green light over the move, it’s thought to be a case of if not when De Ligt signs on the dotted line.\nMan Utd overtaken by Liverpool in race to sign Joao Neves\nThat will leave United free to focus on their third priority of the summer window – a new central midfielder, with a long-term partner for Kobbie Mainoo also high up on their summer wishlist.\nOne name persistently linked with a move is Benfica’s supremely-talented teenage star Joao Neves, who has quickly established himself as one of the leading young midfielders in the world game.\nIf all goes to plan, Ratcliffe would like to offload the costly Casemiro and bring in the younger, far more energetic Portuguese star. And while £250,000 a week star Casemiro is in no hurry to leave, United are wasting little time in trying to bring in Neves as a prospective replacement.\nTo that end, it was reported that an opening offer of €60m (£50.7m) rejected by Benfica for the 19-year-old.\nWith a €120m (£101.2m) exit clause in his deal, they are unlikely to be talked into a cut-price sale at this stage the window.\nAs a result, claims that United are willing to launch an improved take-it-or-leave-it €70m (£59.1m) offer in the coming days will also fall on deaf ears, despite Benfica’s admission that they will likely need to make a sizeable sale this summer.\nNow, however, United’s hopes of a deal have suffered a new setback after the teenage star was also linked with a move to Liverpool.\nTheir new boss Arne Slot has identified the base of his midfield as an area of weakness and one he would like to address this summer.\nAnd amid claims in Portugal that the Merseysiders have made contact over a prospective deal, Liverpool are now thought to be in the driving seat owing to both their strong relationship with Benfica following the summer 2022 transfer of Darwin Nunez, together with the fact that Liverpool can offer the player something United can’t right now: Champions League football.\nMan Utd transfers: Belief grows that deal for Manuel Ugarte is on\nWith United unwilling to be drawn into an auction or a protracted summer-long chase for Neves (memories of the failed Frenkie de Jong saga still burn bright at Old Trafford, despite the club now being under a new regime), the Red Devils are instead quickly set to turn their focus towards a Plan B in the shape of Manuel Ugarte.\nThe Uruguayan star has been one of the Copa America’s stand-out stars this summer, thriving under the coaching of Marcelo Bielsa, who will be looking to steer the nation into the final against Argentina when they tackle Colombia in Wednesday’s semi-final.\nAnd while he only signed for PSG last summer, featuring 37 times across the campaign, it is understood that Luis Enrique is prepared to move him on if a suitable offer comes in for his services.\nTo that end, strong reports have claimed Ugarte has already given his agent the green light to pursue a possible move to United, with the Red Devils emerging as the top candidates for his signature after their fellow suitors, Bayern Munich, opted instead to sign Joao Palhinha from Fulham.\nREAD NEXT ➡️ Who is Manuel Ugarte? Man Utd’s potential €60m Casemiro replacement\nNow reports in France claim Ugarte is ready to put pressure on PSG to accept any proposal that comes their way from United. And amid claims that United have ‘made progress’ in the prospective deal, it is now reported they are ‘very optimistic’ of concluding a deal for Ugarte in the coming weeks.\nFurthermore, new reports from Le10 Sport on Wednesday afternoon claim Enrique has now decided Ugarte does not fit the profile of midfielder he wants to build his side around at PSG and that, as a result, the player can now very much see himself at Old Trafford in the ‘coming weeks’.\nThey also claim the prospective deal is ‘getting closer’ and the possibility of him joining United is ‘gaining more weight’.",
  "word_count": 976,
  "scraped_at": "2026-02-14T02:08:01.880308",
  "_text_extracted": true
}