{
  "article_id": "caaabc5d6fd0",
  "url": "https://www.themag.co.uk/2026/01/delayed-en-route-to-paris-and-wondering-whether-to-have-a-e10-beer-or-psg-newcastle-united/",
  "title": "Delayed en route to Paris and wondering whether to have a €10 beer or … ",
  "date": "20260128T134500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Delayed en route to Paris and wondering whether to have a €10 beer or…\nI’m not feeling too fresh this morning, I reckon I got about four hours sleep last night before an early morning departure and I’m sat here in Schipol airport debating whether to have a €10 beer or just hang about for my transfer.\nI wouldn’t have it any other way. This is mint.\nObviously I’m en route to Paris for the conclusion of this year’s Champions League group.\nIf you are lucky enough to be eligible to get tickets, it’s always a decision where to travel to, as you manage the three pillars of away games: time off work, time away from the family and of course, the cost.\nMy crew picked Paris and PSG from the group stage for a few reasons. The availability of tickets for the bigger ground was a factor for my lower-pointed friends and the relative accessibility to Paris also appealed (Dortmund was an epic set of travelling a couple of years ago). The big factor though was the prospect of going to one of the European giants in one of the world’s great cities for a proper UCL ripsnorter.\nI realise not everyone gets this opportunity for personal reasons, or due to the ticket situation, but surely we can all appreciate that this is mint? The prospect of being in a meaningful match with the European champions was a foreign concept a few years ago and not just because of the international travel.\nI appreciate this season hasn’t gone brilliantly and there I are some valid concerns around in-game management, the approach to shooting at goal, away form and potentially the prospect of signings. But times like these are part of life’s great moments and they have come thick and fast the past few years. Given the caveat of PSR and our meagre income compared to our main rivals, it’s even more remarkable that we’re about to find out the opposition in our first ever Champions League knockout tie.\nThere’s difficult conversations going on already about how much annual leave we’ll all burn if this run goes through a few rounds, but if the coming stages throw up Bayern Munich or Real Madrid, my wife and work are going to have to develop a sense of understanding.\nCurrent accepted stance is to gamble on progress through the play-off and go all in on the last 16.\nBut then there’s the thought of next year and the adventures that a return to any sort of European competition could offer. These may be more unusual destinations than the Euro elite we’re talking about here…but appealing in a different way. The latest conversations are bouncing around farflung spots like Vilnius and Riga, or a return to lovely Germany, maybe somewhere a bit more straightforward to get to than Dortmund or Leverkusen.\nI suppose my point is, life goes by you fast. The amount of football boots I’ve had to buy my ever-growing son is testament to that. Sometimes you’ve to put the bad thoughts in a box and just enjoy the better times when they come. My flight to Paris is delayed. Never mind, it’s an opportunity for another Heineken, I’m on holiday.\nI hope we’ve all got something to be happy about after tonight’s game, but either way I’m enjoying this trip, both in terms of the actual travel today and the wider picture. My match report will follow and I reserve the right to switch to miserable old sod mode if it’s terrible. See yez in France.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 610,
  "scraped_at": "2026-02-14T01:50:01.808401",
  "_text_extracted": true
}