{
  "article_id": "cabb02ff82db",
  "url": "https://www.ewn.co.za/2024/10/29/rodri-wins-mens-ballon-dor-as-real-madrid-boycott",
  "title": "Rodri wins men Ballon dOr as Real Madrid boycott",
  "date": "20241029T043000Z",
  "domain": "ewn.co.za",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rodri wins men's Ballon d'Or as Real Madrid boycott\nAFP\n29 October 2024 | 3:24Rodri, 28, played a key role as City held off Arsenal to win the Premier League title last season and was named player of the tournament at Euro 2024 as unfancied Spain emerged triumphant in Germany.\nPARIS - Manchester City and Spain midfielder Rodri was awarded the men's Ballon d'Or on Monday after winning a fourth consecutive Premier League title and Euro 2024, but Real Madrid boycotted the ceremony.\nThe decision to award the prize for the world's best player to the midfielder came as a surprise, with Real Madrid's Liga and Champions League double winner Vinicius Junior widely seen as the favourite.\nHours before the ceremony in Paris, the Spanish club announced its delegation would not attend the ceremony at Chatelet Theatre because of what it perceived as a snub of Vinicius.\nRodri, 28, played a key role as City held off Arsenal to win the Premier League title last season and was named player of the tournament at Euro 2024 as unfancied Spain emerged triumphant in Germany.\nRodri was diplomatic when addressing the question of Real's no-show in his post-award press conference.\n\"They have their decision, they didn't want to be here for their reasons,\" he said. \"I just focus on my club and my teammates.\"\nDespite the French organisers insisting that the identity of the winner was a closely-guarded secret this year, the news appeared to have leaked ahead of the festivities.\nBarcelona and Spain star Aitana Bonmati earlier won her second successive women's Ballon d'Or, after leading her club to a historic continental quadruple of titles and claiming the Nations League with her country.\nREAL MADRID NO-SHOW\nThe drama started hours before the ceremony as Spanish and European champions Real said if Vinicius was not the winner, then the award should go to his teammate Dani Carvajal.\nLike the Brazilian, Carvajal scored in the 2-0 victory against Borussia Dortmund in the Champions League final at Wembley.\nVinicius scored 24 goals and made 11 assists in 39 matches across all competitions for Madrid as he led the club to three titles last season.\n\"If the award criteria doesn't give it to Vinicius as the winner, then those same criteria should point to Carvajal as the winner,\" Real Madrid told AFP.\n\"As this was not the case, it is clear that Ballon d'Or-UEFA does not respect Real Madrid. And Real Madrid does not go where it is not respected.\"\nThe Madrid contingent of nominees also included Kylian Mbappe, Antonio Rudiger, Fede Valverde and Jude Bellingham.\nThe winner of the Ballon d'Or is chosen from the shortlist by an international jury of 100 specialist journalists.\nThe organisers, the Amaury group which owns the L'Equipe sports daily and France Football magazine, denied to AFP that the name of the successor to last year's men's winner Lionel Messi had leaked and insisted that \"no player or club\" knew in advance who had won.\nWhen Real were named as the men's team of the year, a video played on the stage in the absence of any club representatives.\n'BEST IN HIS POSITION'\nCity manager Pep Guardiola has described Rodri as \"in his position, the best\".\n\"He can do everything. The quality, he reads the game, his mentality, he is always ready,\" Guardiola has said.\nIn addition to his metronomic passing and ball-winning capabilities, the former Atletico Madrid player has a knack of popping up with crucial goals for club and country.\nHis goal won City their first Champions League in 2023 but he also scored vital goals for Spain, such as the equaliser in their last-16 Euro 2024 tie against Georgia.\nSo central is Rodri to Manchester City that their past four Premier League defeats have all come when he was absent.\nCity are top of the Premier League but their chances of winning a fifth straight domestic title were dented in September when Rodri suffered an anterior cruciate ligament injury, ruling him out for the season.\nBonmati, 26, joins her Barcelona team-mate Alexia Putellas as the only women to win the Ballon d'Or twice since the award's inauguration in 2018.\n\"This cannot be achieved alone, I am very lucky to be surrounded by players who make me better every day,\" Bonmati said.\nThe Catalans won every trophy available to them last season - the Spanish league, Cup, Super Cup and a second-successive Women's Champions League.",
  "word_count": 738,
  "scraped_at": "2026-02-14T01:51:57.632236",
  "_text_extracted": true
}