{
  "article_id": "cac15632bfe3",
  "url": "https://www.90min.com/posts/power-rankings-the-best-teams-in-europe-week-28-2023-24",
  "title": "Power Rankings : The best teams in Europe",
  "date": "20240510T073000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Power Rankings: The best teams in Europe - Week 28\n- Real Madrid and BVB booked their place in the Champions League final\n- Sporting CP and PSV Eindhoven won their respective league title\n- 90min ranks the ten best football teams in Europe right now\nThe UEFA Champions League semi-final second legs, as well as domestic league action, provided European football fans with plenty to sink their teeth into over the last week.\nThere were surprising winners, surprising losers, and surprising heroes galore in one of the last weeks of the season.\nAnd after all of that fun, we at 90min have decided to rank the ten best football teams in Europe.\n10. Galatasaray (-)\nAnother week and yet another win for Galatasaray.\nTheir thumping 6-1 win over Sivasspor at the weekend took their Super Lig record for the season to:\nPlayed: 35\nWon: 31\nDrawn: 3\nLost: 1\nGoal Difference: +64\nPoints: 96\nAll things considered, that's fairly impressive, isn't it?\n9. Feyenoord (-)\nLiverpool fans that have been on Arne Slot watch in recent weeks will probably have been pretty impressed by what they've seen.\nSlot's Feyenoord have been in top form in the Netherlands, with their 5-0 win over PEC Zwolle being their 24th game unbeaten in all competitions. Nice one.\n8. PSV Eindhoven (re-entry)\nDo you know what's more impressive than Feyenoord's unbeaten run? The fact that they enjoyed that unbeaten run and yet PSV Eindhoven still won the Eredivisie title.\nAnd they've managed to do that thanks to their unbelievable goalscoring ability, netting an astonishing 107 goals in 32 league games this season.\n7. Sporting CP (re-entry)\nFrom one title winner on the power rankings to another, Sporting CP secured Liga Portugal at the weekend thanks to a combination of their win over Portimonense and Benfica's shock defeat to Famalicao.\nAnd yes, of course Viktor Gyokeres scored in the victory.\n6. Girona (re-entry)\nConsidering who funds Girona (the answer: the next club on this list), it's hard to label their ascent into the top four in La Liga a 'fairytale', but it's impressive nonetheless.\nThe City Football Group-owned club secured their place in next season's UEFA Champions League in the most dramatic fashion too, coming from behind late on to secure a 4-2 win over regional rivals Barcelona.\n5. Manchester City (up 1)\nIt seems a bit inevitable that Manchester City are going to win the Premier League now, doesn't it?\nWith Erling Haaland back to his best and scoring four-goals-a-game, there may be no stopping City in their quest to win an unprecedented fourth consecutive Premier League title.\nThey're simply too good.\n4. Bayer Leverkusen (-)\nYep, Bayer Leverkusen are still unbeaten in the Bundesliga.\nDespite wrapping up the title weeks ago, Xabi Alonso's side have shown no signs of slowing down ever since.\nTheir 5-1 win over Eintracht Frankfurt, despite not starting Florian Wirtz, Jeremie Frimpong or Alex Grimaldo, was one of their most impressive so far - which is saying something.\n3. Borussia Dortmund (up 4)\nHands up if you thought Borussia Dortmund would make the UEFA Champions League final this year?\nPut your hands down, don't be ridiculous, no one did.\nAnd yet, they've managed it.\nTheir shock triumph over Paris Saint-Germain was lucky in part, sure, but you can't deny that BVB's back four played out of their skin in both legs - deservedly earning themselves two clean sheets as a result.\n2. Arsenal (down 1)\nAlthough it seems inevitable that Man City will win the Premier League, Arsenal deserve plenty of credit for taking the title race to the wire.\nThe Gunners have been fantastic in recent weeks, with victories over the likes of Tottenham Hotspur and Chelsea proving that they are good enough to win the league this season...even if City don't let them.\n1. Real Madrid (up 2)\nIt's been quite the week for Real Madrid.\nHaving scooped their record 36th La Liga title at the weekend, Los Blancos then booked their place in a record 17th UEFA Champions League final a few days later with a dramatic comeback win over Bayern Munich thanks to a brace from Joselu...of all people.\nThey're now huge favourites to win a 15th European crown in early June.",
  "word_count": 708,
  "scraped_at": "2026-02-14T02:05:12.745304",
  "_text_extracted": true
}