{
  "article_id": "cadd0058b4fa",
  "url": "https://www.the42.ie/ange-postecoglou-spurs-6089579-Jun2023/",
  "title": "Clarity , ruthlessness and a chip on the shoulder - what to expect from Ange Postecoglou",
  "date": "20230610T133000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“IS THIS A wind up?” a red-faced Alan Brazil asked as he struggled to pronounce Ange Postecoglou’s name live on TalkSport when he was announced as Celtic manager.\nHe didn’t know who the Australian was (despite having played against him), former Rangers manager Ally McCoist giggled in the background. It was all a big joke.\nThat’s what Celtic had become in the year prior to Postecoglou’s appointment in June 2021, and this was a continuation of the skit.\nCeltic fans too – myself included in that – were baffled by the decision. Having spent months chasing Eddie Howe, this is who the club came up with? A manager in the J-League who didn’t even hold a UEFA Pro Licence.\nWe’d all learn that this wasn’t going to be a comedy. This was going to be a thrilling romance.\nClarity\n“I bring here what I bring to every club, every organisation I’ve worked with and that is a clear idea of how I want a team to play, and a clear idea of how success comes from that.”\nWhen Postecoglou took the reins at Celtic, the club was a mess.\nThe squad was bloated, there were major changes going on at board level, fan discontent was at its peak, and the general feel around Parkhead was one of dismay.\nIt’s difficult to comprehend how a club the size of Celtic had mismanaged itself and gone from such a position of strength into such confusion.\nIt would’ve been easy for the situation to overwhelm any new manager.\nPostecoglou didn’t approach it as a problem. He approached it as an opportunity.\nWhen your house is at its messiest, sometimes you end up doing a bigger clean-up than you would normally. This was his chance to do just that. A deep clean, a fresh start.\nThe turning point\n“We never stop. We stop at half time and we stop at the end of the game when we celebrate. If the opposition wants to stop that’s good for us.”\nA mic’d up Postecoglou strolls around Lennoxtown belting out instructions.\nWhat could’ve just been another piece of content fed into the machine turned into an unofficial (and later official) slogan of the team.\nThe video released by the club showed some clips from Postecoglou’s first week training with the squad. It was a turning point in the narrative.\nCeltic fans had been told by those who had followed Ange’s career that he was a serious guy. But being told something, and seeing it in the flesh is another.\nNo more joking around – time to get down to business.\nA ruthless streak\n“I understood what he wanted within two days. That’s how clear his message is. There’s no black or white – there’s just black…This is what we’re doing.” – Harry Kewell\nAt most clubs, winning games is enough. The more often you win, the less likely you are for the fans to turn on you. At Celtic, winning alone is not enough. The way you win is just as important.\nPostecoglou didn’t get off to a winning start. Before the league season even started, Postecoglou’s side were knocked out of the Champions League by FC Midtjylland.\nThe fans felt that he was set up to fail, and Postecoglou hinted similarly.\nHaving been promised a rebuild by new chief executive Dominic McKay and the Celtic board, the club had secured just one new player – Carl Starfelt – who arrived just a few days before the Midtjylland clash.\nMcKay departed the club just a few months later.\nThat set the precedent that would be followed over the next two seasons. If you’re not fully on board with what he’s trying to do – you won’t be around.\nEven if it hurt the side in the short-term, Postecoglou was willing to take the hit to maintain control and unification in the dressing room.\nAngeball\nMcKay’s departure marked an important point for Postecoglou at the club.\nLike Succession’s Logan Roy, he was in charge, and he was taking control.\nSuddenly Celtic’s transfer business was supercharged and with that, so was their football.\nIn just a few short months, the squad was completely rebuilt with a strong Japanese influence and a new star-striker in Kyogo Furuhashi.\nAfter a shaky start, not only were Celtic winning games, they looked unbeatable domestically.\nA League Cup triumph just before Christmas was concrete evidence that the trust given to Postecoglou was well placed, but it was after the winter break when fans started to dream.\nUnusual for Celtic, their winter transfer business was done swiftly as they welcomed three new Japanese names to the fold in Reo Hatate, Daizen Maeda and Yosuke Ideguchi.\nHatate and Maeda in particular added a new dimension to the squad. It gave some badly needed athleticism up front and in the midfield.\nMaeda scored just four minutes into his debut in a 2-0 win over Hibernian, Hatate scored an absolute screamer the following week as Celtic got through a tricky fixture away to Hearts.\nNext came the derby.\nA Thursday evening fixture meant an unusual 7:45pm kick-off for the Glasgow Derby.\nCeltic Park was pitch-dark with a green spotlight illuminating the team’s pre-match huddle. The tension was palpable.\nFive minutes in. Hatate, 1-0. Pandemonium.\nThe joy, the rage, the grief of everything that happened throughout Covid came out in a sea of green and white.\n42 minutes. Hatate, 2-0.\n44 minutes. Abada, 3-0. Game over, good night.\nAngeball was here.\nThe duality of man\nAnge is the ultimate old-school father-figure type.\nHe demands respect.\nThe message is clear. Follow me, trust me, I am your leader.\n“Ange’s massive strength is his ability to be able to bring players along that journey and buy into what he does,” former Brisbane captain Matt Smith told BBC Sport about his former manager.\n“There’s zero tolerance for players that don’t want to follow . . . It didn’t matter if you were the biggest player in the dressing room or the youngest – if you weren’t pulling your weight or following his principles, he was very ruthless.”\nDuring the week he takes a hands on approach, but at the weekend it’s all about the players.\nHe doesn’t enter the dressing room on matchday, for example. That space belongs to the team.\nPostecoglou doesn’t get too close to the players because he knows that some day, either by his choice or theirs, they will run out of use for one another.\nDo you want chips with that?\nIf there’s one thing to expect from Postecoglou at Tottenham, it’s the unmissable chip that he’ll be carrying on his shoulder the entire way.\nAt every step of his career, he had his doubters.\nAs a manager in the A-League, he was told his style was too ambitious. When he took over Australia, he was told that the players weren’t good enough for his tactics.\nAs he moved from Japan to Glasgow, he had pundits quite literally laughing at his expense.\nNow, as he takes the leap into the Premier League, he faces the same doubters, the same naysayers, and the same people who are almost wishing failure upon him.\nThe Aussie leans heavily into that, he thrives on it.\nIf history repeats itself, the final message is: doubt him at your peril.",
  "word_count": 1217,
  "scraped_at": "2026-02-14T01:53:41.888980",
  "_text_extracted": true
}