{
  "article_id": "caf5a3ebcb7b",
  "url": "http://thepeninsulaqatar.com/article/21/02/2023/vinicius-a-joy-to-behold-for-ancelotti-in-face-of-racism-rows",
  "title": "Vinicius a joy to behold for Ancelotti in face of racism rows",
  "date": "20230220T233000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nReal Madrid's Brazilian forward Vinicius Junior celebrates after scoring a goal that was later annuled during the Spanish League football match between CA Osasuna and Real Madrid CF at El Sadar stadium in Pamplona, on February 18, 2023. (Photo by CESAR MANSO / AFP)\nLiverpool: Real Madrid coach Carlo Ancelotti said Vinicius Junior should be cherished by football fans around the world rather than targeted by racist abuse.\nThe Brazilian has been abused regularly in Spain this season with La Liga taking six cases of \"racist insults or chants\" to public prosecutors.\nA group of Atletico Madrid ultras hung an effigy of the 22-year-old from a bridge near Real's training ground, a matter being investigated by police, while numerous instances of racism aimed at Vinicius have been filmed.\nVinicius scored the winner as Madrid beat Liverpool 1-0 in last season's Champions League final.\nAnd Ancelotti believes he will rise to the occasion once more when the sides face off again in Tuesday's Champions League last 16, first leg at Anfield.\n\"You can only change people through culture, a common purpose and feeling of humanity. Don't blame Spain for this, it happened in every country,\" Ancelotti said at his pre-match press conference on Monday.\n\"Vini is managing really well, he is focused on the game and loves to play football and this doesn't affect on the pitch. When games are important we see the best of him and it is obviously going to be a big game tomorrow.\n\"At the moment it is wonderful to be watching Vinicius as every football fan likes his quality.\n\"They like to see Pedri, Gavi, (Kylian) Mbappe, (Erling) Haaland. Vinicius is up there with these players and we can enjoy quality players like that.\"\nMadrid's La Liga title challenge has faded since the World Cup break with Barcelona opening up an eight-point lead at the top of the table.\nThe Spanish giants often save their best for the latter stages of the Champions League, but have been dealt a blow with Aurelien Tchouameni and Toni Kroos not making the trip to England due to illness.\n\"Without Kroos and Tchouameni we are forced to make changes we wouldn't want,\" added Ancelotti.\n\"But it doesn't bother me because there is a good feeling in the team and we have played well without them in the past.\n\"Those that have come in have done well and we have confidence in them.\"\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 471,
  "scraped_at": "2026-02-14T02:24:32.669973",
  "_text_extracted": true
}