{
  "article_id": "cb1a6ecf2eea",
  "url": "https://menafn.com/1108576234/East-Bengal-FC-To-Take-Part-In-AFC-Challenge-League-Group-Stage-Draw",
  "title": "East Bengal FC To Take Part In AFC Challenge League Group Stage Draw",
  "date": "20240819T183000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "East Bengal FC To Take Part In AFC Challenge League Group Stage Draw\nThe 2024/25 season is the first edition of the revamped third-tier men's club competition, which gives a chance to teams from the Continent's emerging leagues and their diverse range of talents.\nEast Bengal FC have been included in the Group Stage after their campaign in the AFC Champions League Two Preliminary Stage came to an early end a few days back. The top Indian club went down to Turkmenistan's Altyn Asyr FC 2-3 at the floodlit Yuba Bharati Kriangan.\nThey will not be included in one of the five groups in the Group Stage -– three comprising four teams from the West each and two involving three teams from the East each -– that is set to be played over three Matchdays between October 26 and November 2, with each group taking place at a centralised host as each side face their opponent once.\nOf the 18 teams in the hat for the draw, three have qualified for an AFC club competition for the first time: Turkmenistan's FC Arkadag, Mongolia's SP Falcons and Bhutan's Paro FC.\nThe Group Stage cast – comprising 16 teams that qualified directly and two Preliminary Stage winners – will be separated into pots within each region\nThe country protection principle will be in force and a bespoke draw software will be utilised to prevent any deadlock situations from occurring, the AFC informed in a release on Monday.\nEight teams will progress from the Group Stage – the three Group winners and best-ranked runners-up from the West, and the top two finishers of each Group from the East – to the Quarterfinals, which take place between March 5 and 13, 2025. The double-legged Semifinals will unfold from April 9 to 17, 2025 and the winners will advance to the coveted Final on May 10, 2025.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 368,
  "scraped_at": "2026-02-14T02:10:58.955524",
  "_text_extracted": true
}