{
  "article_id": "cb1f9b59f68e",
  "url": "https://www.westmeathindependent.ie/2023/12/22/premier-league-big-six-distance-themselves-from-joining-european-super-league/",
  "title": "Premier League  Big Six  distance themselves from joining European Super League",
  "date": "20231222T130000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League ‘Big Six’ distance themselves from joining European Super League\nBy Jamie Gardner, PA Chief Sports Reporter\nThe Premier League’s ‘Big Six’ have all now distanced themselves from the possibility of joining any new European Super League.\nArsenal became the last of the clubs who joined the original Super League in 2021 to confirm their position on Friday.\nThe Gunners issued a statement saying they will continue in UEFA competitions despite a European Court of Justice ruling which has at least opened the possibility of a club-led tournament to rival the Champions League being launched.\nLiverpool have not commented directly since Thursday’s ruling but the PA news agency understands legal consent on the issue of joining new competitions has rested with the recognised supporters’ trust, the Spirit of Shankly (SoS), since the Reds’ withdrawal from the Super League two years ago.\nSoS’ statement on Thursday said Liverpool’s position had not changed since 2021. Manchester United, Manchester City, Chelsea and Tottenham all issued statements on Thursday pledging commitment to UEFA competitions.\nThe original Super League plan fell apart within 72 hours, as the English clubs withdrew one by one amid fan protests, pressure from the British government and opposition from UEFA and FIFA.\nThe company behind the original project, A22, announced details for new “open and meritocratic” men’s and women’s competitions within hours of the ECJ ruling on Thursday morning. In the men’s competition, 64 teams would be involved with 20 places available each year to teams based on their domestic performance.\nUEFA president Aleksander Ceferin mocked the proposals and said the format was “even more closed” than the one put forward in 2021, but A22 founder John Hahn told PA the principles of relegation and promotion were in line with domestic competitions across UEFA’s 55 member associations.\nReal Madrid and Barcelona, key supporters of the 2021 project, are on board. Juventus and AC Milan, two of the other 12 involved, have not commented yet but Inter Milan have strongly rejected it, so too Spanish side Atletico Madrid.\nThe president of Italian champions Napoli, Aurelio De Laurentiis, said his club was ready to hold talks over the new project. Napoli were not part of the 2021 project.\nCeferin said “football was not for sale” at a press conference on Thursday, which significantly featured executives from all the key stakeholder groups – clubs, leagues, players and fans.\nClubs have gained considerable concessions since 2021 – a new Champions League format starting next season featuring more matches, and the scope for even more in the future, and the establishment of a joint venture between clubs and UEFA to control commercial matters linked to the Champions League and other club competitions.\nThe ruling on Thursday clearly empowers clubs, but in the short term may be the catalyst for further reform in their favour rather than revolution.\nThe Saudi-led takeover of Newcastle effectively means the Premier League now has a ‘Big Seven’, but Magpies boss Eddie Howe said he was against the idea of a Super League.\n“I’d probably say I’m against it if you want a clear decision because I like the structure as it is,” Howe said.\n“I think the big thing in England was our supporters of football let their feelings be known the previous time that this was mentioned, and really I think ultimately it’s their call which way they want this to go.”",
  "word_count": 564,
  "scraped_at": "2026-02-14T02:25:08.289635",
  "_text_extracted": true
}