{
  "article_id": "cb2518eb06b6",
  "url": "https://www.empireofthekop.com/2025/11/25/wirtz-absent-liverpool-training-psv/",
  "title": "Florian Wirtz absent from Liverpool training ahead of PSV clash",
  "date": "20251125T170000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Florian Wirtz now appears to be a serious injury doubt for Liverpool’s Champions League clash against PSV Eindhoven on Wednesday night.\nThe German playmaker missed the weekend defeat to Nottingham Forest due to a muscle issue, although Arne Slot was hopeful that the summer arrival from Bayer Leverkusen wouldn’t be sidelined for long.\nHowever, as per Liverpool World, the Reds’ number 7 was conspicuous by his absence from the squad’s training session in Kirkby on Tuesday ahead of our fifth European fixture of the season tomorrow night.\nWirtz misses Liverpool training but returning youngster is involved\nHaving not trained today, it seems doubtful that Wirtz will be involved against PSV in what undoubtedly comes as a setback to Liverpool’s plans for a game which fits the description of ‘must-win’ in order to regain confidence and momentum.\nAs is often the case ahead of Champions League matches, several youngsters trained with the first-team squad on the eve of the fixture, including one man who’s only just returned to Merseyside.\nJames Norris was among those involved, having been on loan at League of Ireland club Shelbourne. Their domestic season, which runs on a calendar year basis rather than the August-May format of most European leagues, ended at the start of November.\nFrustrating for Wirtz and Liverpool\nIt’ll be hugely frustrating for Wirtz and Liverpool that the German seems likely to miss out against PSV on Wednesday, as the 22-year-old had given arguably his best performance for the Reds so far in our previous Champions League fixture against Real Madrid.\nSlot will almost certainly provide a more detailed update on the playmaker when he speaks to the media later this afternoon, but our number 7’s absence from training today would suggest that we might have to wait until at least the West Ham clash next weekend for him to return to action.\nAs for Norris, he’s actually played in European competition already this season, with Shelbourne participating in the Conference League. Sadly for him, his final match with the Dublin outfit saw him sent off in their 1-0 defeat to Kosovan club FC Drita earlier this month.\nHe won’t be able to feature for Liverpool in the league phase of the Champions League as he isn’t in our UEFA squad and, at 22, is overage for the criteria to be eligible for List B, the secondary group of young players who can be included independently of the main squad.\nHe’s only played twice for the Reds’ first team, and the latter of those appearances came against Shrewsbury nearly four years ago (Transfermarkt), but at least his involvement in training today illustrates that he hasn’t been completely forgotten on Merseyside.\nAn exit in January (either on loan again or permanently) seems likely, but having had a regular supply of football at Shelbourne, hopefully it’ll be the same again for him in 2026, wherever that may be.",
  "word_count": 482,
  "scraped_at": "2026-02-14T02:03:26.522713",
  "_text_extracted": true
}