{
  "article_id": "cb2716d04a97",
  "url": "https://metro.co.uk/2025/10/21/jamie-carragher-brutally-rules-huge-team-champions-league-not-good-enough-24489051/",
  "title": "Jamie Carragher brutally rules huge team out of Champions League :  Not good enough ! | Football",
  "date": "20251022T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher has brutally ruled Barcelona out of the Champions League trophy race, insisting that their defence isn’t ‘good enough’.\nHansi Flick’s side conjured up a 6-1 victory over Olympiakos on Tuesday thanks to goals from Fermin Lopez, Lamine Yamal and Marcus Rashford.\nThe Catalan club reached the Champions League semi-finals last season, with Barcelona beaten by Inter Milan in extra time of the second leg.\nBarcelona won La Liga, the Copa del Rey and the Supercopa de España in 2025 and currently sit second in the top-flight of Spanish football this term.\nBut Carragher is ‘not sure’ Barcelona’s back four can win the Champions League in 2026 – and feels they’ll struggle against teams like Arsenal.\n‘They lost [the Champions League semi-final last season] through naivety, really, maybe having a lot of young players,’ Carragher told CBS Sports.\n‘When you look at the back four who played tonight (Kounde, Cubarsi, Garcia and Balde), I’m not sure this back four can win the Champions League.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s not just about playing with a high line – which gives them problems as well.\n‘Whenever you watch them, you always feel the opposition has a chance. It’s not just how they set up tactically.\n‘I’m not quite sure the defenders are good enough when they come up against a real elite team like Arsenal, PSG and Bayern Munich.’\nFlick hails Barcelona star after Olympiakos win\nMeanwhile, Barcelona boss Flick was full of praise for Lopez after seeing the youngster register a hat-trick against Olympiakos.\n‘He scores, he runs, he’s very complete,’ Flick said. ‘His performance was sensational.\n‘Three goals, the first one very important, gave us confidence. He has it all – he’s dynamic, he has speed.’\nMore Trending\nFlick feels the victory over the Greek side will give his team ‘confidence’ ahead of El Clasico against Real Madrid on Sunday.\n‘We had some problems at the beginning of the match [against Olympiakos, but we deserved the victory,’ he added.\n‘Every goal and every victory is important. The first thing is that we won today, which was the important thing, and this should give us confidence for the match [against Real Madrid].\n‘It’s a tremendous game. We don’t have time to waste.’\nMORE: Mikel Arteta hails four Arsenal players after ‘tough’ win over Atletico Madrid\nMORE: Diego Simeone makes Arsenal, Real Madrid and Liverpool claim after Atletico Madrid defeat\nMORE: Alan Shearer ‘alarmed’ by Viktor Gyokeres stat as Arsenal thrash Atletico Madrid",
  "word_count": 463,
  "scraped_at": "2026-02-14T02:09:24.905821",
  "_text_extracted": true
}