{
  "article_id": "cb32f871327f",
  "url": "https://news.yahoo.com/premier-league-live-team-news-120521351.html",
  "title": "Premier League LIVE : Team news and latest updates as Leeds , Everton and Leicester face relegation battle",
  "date": "20230528T124500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League relegation battle LIVE: Results and reaction as Everton survive\nThe Premier League is set for a blockbuster final day as Everton, Leeds United and Leicester City all fight for a place in the top-flight next season.\nThe Toffees are in pole position to survive the drop, sitting 17th in the table with a two-point advantage over their relegation rivals. They face Bournemouth in this afternoon’s clash and with the Cherries already safe Everton have a strong chance of claiming victory.\nElsewhere, Leicester (18th) take on West Ham knowing that only three points - and an Everton loss - will be enough to keep them in the Premier League. The good news for Dean Smith’s side is that the Hammers are focused on their upcoming Europa Conference League final so may field a weakened team.\nThe final contender in this relegation battle is Leeds. They have arguably the most difficult challenge as they take on Tottenham. Home advantage can play it’s part and the Elland Road faithful will bring the noise. Like the Hammers, Leeds must win and hope Everton lose, the difference is that Spurs are also chasing three points as they have a chance to earn European football next season.\nFollow all the action from the Premier League final day below and see which team avoids the drop:\nPremier League relegation battle\nThe 2022/23 Premier League season reached its climax on final day\nFull-time scores: Arsenal 5-0 Wolves\nAston Villa 2-1 Brighton\nBrentford 1-0 Man City\nChelsea 1-1 Newcastle\nCrystal Palace 1-1 Nottingham Forest\nEverton 1-0 Bournemouth\nLeeds 1-4 Tottenham\nLeicester 2-1 West Ham\nMan Utd 2-1 Fulham\nSouthampton 4-4 Liverpool\nAllardyce speaking to BT Sport on his future at Leeds\n18:57 , Ben Fleming\n“I don’t know. I can only come to that decision when I know if they want me and what the outlook and the strategy of the club are going to look like and what direction they want to go in.\n“Those are some pretty big things that need to be talked about and sorted out before next season. If that’s all going in the right direction for me and the board then we’ll see.”\n‘It’s professional suicide’ says Allardyce after Leeds United relegation\n18:53 , Ben Fleming\nSpeaking to BT Sport after his side’s 4-1 defeat against Tottenham, Sam Allardyce was hugely critical of his side’s performance which saw Leeds relegated from the Premier League after a three-year stay.\nHe said: “It’s professional suicide - you prepare for a game and give the players tactics and then make huge errors. So we messed up again. We tried to fight our way back but messed up in a big way again because we couldn’t find the back of the net.\n“We had 21 shots but two on target - that tells you everything about our capabilities of attacking - yes we can create opportunities but our quality of finishing was poor and then at the other end switching off and, in the end, Tottenham had better quality than we had.\n“I wanted to go out with a sense of pride today but unfortunately I didn’t see that .”\nLeeds’ relegation confirmed as Harry Kane hits double in Tottenham win\n18:53 , Mike Jones\nLeeds’ three-season stay in the Premier League is over after a 4-1 home defeat to Tottenham confirmed their relegation.\nHarry Kane and Pedro Porro scored early in either half to put Spurs 2-0 up and, although Jack Harrison reduced the deficit, Kane struck a game-clinching second in what could be his last game for the London club.\nTottenham substitute Lucas Moura rubbed salt into Leeds’ wounds by waltzing through a porous defence in stoppage time to complete their misery.\nLeeds’ relegation confirmed as Harry Kane hits double in Tottenham win\nHow the final day played out as Everton survive and Leicester relegated with Leeds\n18:47 , Mike Jones\nThe final day of the Premier League was always set to be a dramatic one at the foot of the table, with the last two remaining relegation spots the only major matter left to be concluded.\nWith Southampton already down, Leeds United, Everton and Leicester City were fighting it out to survive - with the Toffees in the driving seat at the beginning of the afternoon and knowing that a win for themselves made everything else irrelevant.\nWhat unfolded though saw one side quickly out of the running and one doing their job, but needing to wait to confirm their future.\nHere’s how the final day played out at the bottom of the league:\nHow the final day played out with Everton surviving relegation fight\nLeicester relegated from Premier League seven years after winning title\n18:43 , Mike Jones\nLeicester have equalled the record for most relegations from the English top flight with 12 the same amount as Birmingham City.\nEverton remain in Premier League after avoiding last day relegation\n18:42 , Mike Jones\n‘It’s relief’ says Coady after Everton secure survival\n18:39 , Mike Jones\nEverton’s Conor Coady gave a post-match interview saying that keeping the club in the Premier League was a big relief but they need to be better to avoid this feeling in the futer.\n“It’s relief,” he said. “We don't want to make it a thing, we need to improve. It's the hardest season of my life, it's a lot of relief.\n“We had a plan, we worked so hard, it’s important. Loads of pressure, but relief, this giant of a football club going down, you don’t want to be part of that. This club has to rise and get better now.\n“It's been so hard emotionally, we have to be better. It needs to be better. I’m not imagining that [relegation], we are where we are. We don’t want this to happen again, it has to improve, this club is a giant.”\nLeicester relegated from Premier League seven years after winning title\n18:35 , Mike Jones\nLeicester have been relegated from the Premier League to the Championship after a dramatic final day of the 2022/23 season.\nAbdoulaye Doucoure’s thunderous strike earned Everton victory over Bournemouth, meaning Leicester’s win over West Ham was in vain.\nThe results left Sean Dyche’s side two points clear of the Foxes, with Dean Smith’s team unable to close the gap facing them entering the final game of the campaign.\nThe 2015/16 champions, who join Leeds and Southampton in next season’s Championship, started positively and a superb Harvey Barnes goal had them moving out of the relegation zone on goal difference after 34 minutes.\nLeicester relegated from Premier League seven years after winning title\nFull-time: Everton 1-0 Bournemouth - LEICESTER RELEGATED FROM THE PREMIER LEAGUE\n18:33 , Mike Jones\nIt was a day full of twists and turns but Everton earn their spot in the Premier League next season! Abdoulaye Doucoure’s wonderful strike gave Sean Dyche’s men the lead and that goal is enough to keep them out of the relegation zone.\nIt also dooms Leicester City to the drop. They defeated West Ham 2-1 but it wasn’t enough to keep them in the league.\nFull-time: Leeds 1-4 Tottenham - LEEDS RELEGATED FROM THE PREMIER LEAGUE\n18:28 , Ben Fleming\nThe full-time whistle blows and Leeds United’s three-year spell in the top flight is over. In truth, they needed a lot to go their way today but they never looked likely to turn things around after Kane’s goal in the second minute.\nPorro added another two minutes into the second half and, despite Harrison’s goal, Kane’s second sealed Leeds’ fate before Moura’s solo effort in the final minute of added time wrapped up a miserable day for the Elland Road faithful.\nFull-time: Leicester 2-1 West Ham\n18:28 , Mike Jones\nIt’s all over at the King Power Stadium and Leicester have done what they needed to. West Ham have been beaten but the Foxes need a Bournemouth goal to stay up.\nThree minutes or so to play at Goodison Park.\nGOAL! Leeds 1-4 Tottenham (Moura, 90+5)\n18:26 , Ben Fleming\nIt’s not to be for Leeds but what a moment for Spurs and Lucas Moura. It’s his last game in a Spurs shirt and he marks his cameo appearance in style with a wonderful solo effort.\nThe whole Spurs bench run onto the pitch to celebrate with him and hoist him up in front of the jubilant away stands.\nEverton 1-0 Bournemouth\n18:26 , Mike Jones\n90+4 mins: Save! Jordan Pickford comes to the rescue for Everton. A floaty diagonal pass comes into the box and is nodded down by Kieffer Moore.\nIt comes to substitute Matias Vina who volleys one at goal only for Pickford to drop to his left and punch it clear! Massive moment for the Toffees.\nLeicester 2-1 West Ham\n18:24 , Mike Jones\n90+3 mins: There’s six additional minutes to play at the King Power Stadium. Leicester look relatively comfortable though West Ham are seeing more of the ball.\nThe Foxes can only hold out to win the game. Fate is out of their hands.\nLeeds 1-3 Tottenham\n18:22 , Ben Fleming\n90 mins: A double change for Spurs late on. Porro comes off for Lucas, who makes his final appearance in a Spurs shirt. Young George Abbot is also introduced to make his Spurs debut, with Skipp making way.\nFive minutes of added time.\nEverton 1-0 Bournemouth\n18:21 , Mike Jones\n90 mins: 10 minutes of added time at Goodison Park to play!\nLeeds 1-3 Tottenham\n18:19 , Ben Fleming\n87 mins: A slight pause in play as Harrison is down receiving treatment. Many Leeds fans see that as their queue to head for the exit. Harrison makes way to some applause as Gnonto replaces him.\nLeicester 2-1 West Ham\n18:17 , Mike Jones\n86 mins: Leicester are hanging on aganist West Ham who win a free kick on the left side of the final third. The ball is fizzed into the box but Wout Faes jumps up and flicks it behind for a corner.\nThe Foxes are still relying on Bournemouth to score. They need Everton to at least draw with the Cherries.\nLeeds 1-3 Tottenham\n18:16 , Ben Fleming\n84 mins: SAVE! Richarlison has another chance and forces another good save from Robles late on.\nGOAL! Brentford 1-0 Man City (Pinnock, 85)\n18:15 , Ben Fleming\nA great story could be developing in southwest Londoner as Ethan Pinnock’s finish means Brentford are on course to complete the league double against champions Manchester City.\nEverton 1-0 Bournemouth\n18:13 , Mike Jones\n82 mins: Everton are dropping deeper as Bournemouth pump long balls into the penalty area. Dango Ouattara curls in a cross from the right side and almost finds Kieffer Moore but Yerry Mina does just enough to stop him from reaching the ball.\nLeeds 1-3 Tottenham\n18:11 , Ben Fleming\n80 mins: Substitute Rutter has a half-chance but he can only fire wide on the spin from inside the Spurs box. Up the other end, Richarlison goes through on goal but Robles makes the save from a tight angle.\nLeeds 1-3 Tottenham\n18:11 , Ben Fleming\n77 mins: There’s a pause in play as a pitch invader gets on the pitch. Following that, Spurs make a double change as Richarlison and Craig come on for Son and Bissouma.\nGOAL! Leicester 2-1 West Ham (Fornals, 79’)\n18:10 , Mike Jones\nThere’ll be a few nerves around the King Power Stadium now! Pablo Fornals collects the ball on the left side of the pitch, he carries it up to the penalty area the drills it home off the inside of the far post!\nWest Ham have one back and Leicester need to keep this lead intact.\nGOAL! Arsenal 5-0 Wolves (Kiwior, 79)\n18:09 , Ben Fleming\nWolves’ miserable day at the Emirates gets worse as Jakub Kiwior nets his debut goal for Arsenal from a corner. They now have five!\nLeicester 2-0 West Ham\n18:08 , Mike Jones\n76 mins: Kelechi Iheanacho flicks the ball into the path of James Maddison who hits one with the outside of his right foot and forces a corner when the shot is deflected wide.\nIheanacho is then taken off with Jamie Vardy brought on for Leicester.\nEverton 1-0 Bournemouth\n18:06 , Mike Jones\n75 mins: There’s been a stoppage of five minutes or so at Goodison Park while Jordan Pickford gets some treatment for his hand. That could come back to haunt the Toffees as there’ll be plenty of stoppage time added on.\nGOAL! Southampton 4-4 Liverpool (Jota, 73’)\n18:04 , Mike Jones\nTwo goals in one minute and Liverpool are level again! They back in this game from 4-2 down and with over 15 minutes to play either side can win it!\nDiogo Jota has a brace, Mo Salah with the assist.\nGOAL! Southampton 4-3 Liverpool (Gakpo, 72’)\n18:03 , Mike Jones\nTrent Alexander-Arnold is the supplier for Cody Gakpo as Liverpool fight back into their clash with Southampton.\nEverton 1-0 Bournemouth\n18:01 , Mike Jones\n69 mins: Save! It’s all kicking off at Goodison Park. The cross comes in from the left wing and Bournemouth substitute Kieffer Moore wins it in the air.\nHe nods it towards goal where Dominic Solanke looks to turn it home but Jordan Pickford palms it away before Conor Coady scoops it off the line.\nWords are said between Pickford and Solanke and both men earn yellow cards.\nGOAL! Leeds 1-3 Tottenham (Kane, 69)\n18:01 , Ben Fleming\nWhatever small hope that was conjured up by Harrison’s goal has disappeared in an instant. Leeds leave themselves wide open at the back and Spurs take full advantage with Kane netting his second of the game calmly passed Robles.\nSilence around Elland Road.\nGOAL! Leeds 1-2 Tottenham (Harrison, 67)\n17:59 , Ben Fleming\n67 mins: Well, maybe they do have some ideas! Harrison finds some space on the right and flashes a low effort across goal and into the far corner. They need so much to happen in other games to stay up but it’s a start.\nMoments prior Kulusevski comes off for Sarr.\nLeeds 0-2 Tottenham\n17:58 , Ben Fleming\n66 mins: Leeds are desperate for something to happen but there’s a complete lack of ideas out there on the pitch. Harrison jinks through a crowd of players but his clipped cross is not attacked by anyone in a white shirt and it drifts out for a goal kick.\nGOAL! Crystal Palace 1-1 Nottingham Forest (Hughes, 66’)\n17:58 , Mike Jones\nWill Hughes meets the cross from Michael Olise and despite an attempt to block from Willy Boly, the ball finishes in the back of the net and Crystal Palace have their equaliser!\nGOAL! Southampton 4-2 Liverpool (Armstrong, 64’)\n17:57 , Mike Jones\nAdam Armstrong sweeps in from the left to drill home a low effort for the Saints who are leaving the Premier League in style this afternoon.\nLeicester 2-0 West Ham\n17:55 , Mike Jones\n63 mins: Despite that second goal at the King Power there’s some glum faces in the crowd. Leicester are relying on Bournemouth to at least score against Everton.\nGOAL! Leicester 2-0 West Ham (Faes, 62’)\n17:53 , Mike Jones\nLeicester have a secure grip on their match against West Ham now! They win a free kick over on the left wing that Youri Tielemans curls into the middle of the box.\nWout Faes leaps highest and glances his headed effort into the bottom corner! Leicester need to see out this match and hope Bournemouth can score against Everton.\nLeeds 0-2 Tottenham\n17:52 , Ben Fleming\n60 mins: It’s a triple change from Leeds as Aaronson, Rutter and Firpo come on for McKennie, Wober and Struijk. Moments later, the home side force a corner as Rodrigo’s effort from a tight angle is saved by Forster.\nLeeds 0-2 Tottenham\n17:50 , Ben Fleming\n58 mins: Leeds look to be readying a number of subs on the bench. They need a minor miracle at this point, however, with Everton also taking the lead against Bournemouth.\nGOAL! Arsenal 4-0 Wolves (Jesus, 58)\n17:48 , Ben Fleming\nMinutes after Partey’s disallowed effort, Arsenal do have their fourth after Jesus nods home at the back post from Trossard’s cross.\nGOAL! Everton 1-0 Bournemouth (Doucoure, 57’)\n17:47 , Mike Jones\nMassive goal! Abdoulaye Doucoure take a bow. Idrissa Gueye floats the ball into the box looking for Alex Iwobi. The ball is nodding down and bobbles out of the box before sitting up for Doucoure.\nHe nails it on the half-volley and fizzes his effort past Mark Travers to send Everton ahead!\nGOAL! Man Utd 2-1 Fulham (Fernandes, 55’)\n17:46 , Mike Jones\nManchester United are emulating the Saints. They’ve come from behind against Fulham to lead at Old Trafford.\nLeeds 0-2 Tottenham\n17:46 , Ben Fleming\n54 mins: CHANCE! Wober floats a ball in from deep on the left-hand side. Ayling sneaks in at the back post but he’s unable to make the right contact and a combination of Davies and Lenglet denies Leeds a much-needed goal.\nEverton 0-0 Bournemouth\n17:45 , Mike Jones\n54 mins: David Brooks slips down the right wing and whips a cross into the middle Dango Ouattara is the target but he can’t get around James Garner who manages to deflect the ball wide of the box post.\nBournemouth are just starting to step up a gear.\nArsenal 3-0 Wolves\n17:44 , Ben Fleming\n56 mins: Partey thinks he’s added another for Arsenal after the break as he smashes the ball in from close range but there was a foul in the build-up and the goal is disallowed after a VAR check.\nEverton 0-0 Bournemouth\n17:42 , Mike Jones\n51 mins: Chance! Oh my, Everton should be in front. The ball bounces up inside the Bournemouth box and Demarai Gray is wide open.\nHe looks timid as he goes for the header and nods it down, straight at Mark Travers who turns it wide!\nGOAL! Leeds 0-2 Tottenham (Porro, 47)\n17:38 , Ben Fleming\nCould that be that for Leeds? They conceded in the first two minutes of the first half and they’ve done so again in the second half.\nKane creates the goal with a wonderful bit of creativity, lifting it over Cooper in the middle of the park before sliding through Porro. He smashes it across goal and into the far corner and Leeds now have a mountain to climb.\nGOAL! Southampton 3-2 Liverpool (Sulemana, 48’)\n17:38 , Mike Jones\nKamaldeen Sulemana has another one! It’s a wonderful run from the Ghanaian winger who receives the ball on the halfway line, drives up the pitch, skips past a defender and curls onto into the top corner!\nSecond half: Back underway in the Premier League\n17:36 , Mike Jones\nThe second half begins at Goodison Park, Elland Road and the King Power stadium and others. Leicester have jumped ahead of Everton but they could yet be relegated.\nThe last 45 minutes of the Premier League season kicks off around the country.\nHalf-time around the Premier League\n17:31 , Mike Jones\nThings are looking bleak at Goodison Park. Are Everton heading to the Championship?\nHalf-time around the Premier League\n17:27 , Mike Jones\nLeicester City have scored to get themselves in a position to stay up. They still need help from Bournemouth but it’s so far so good for Dean Smith’s side.\nEverton have created a couple of chances but continue to struggle in the final third, Bournemouth look equally threatening and you feel if they score Everton’s chances of staying up evaporate.\nLeeds are losing against Tottenham and have a mountain to climb.\nHalf-time around the Premier League!\n17:23 , Mike Jones\nAs it stands:\n17th: Leicester, 34 (-17 GD)\n18th: Everton, 34 (-24 GD)\n19th: Leeds, 31 (-28 GD)\n20th: Southampton, 25 (-37 GD)\nHalf-time: Leeds 0-1 Tottenham\n17:21 , Ben Fleming\nA smattering of boos from the Elland Road faithful as the players head off for the break. Their behind after Kane’s second-minute strike and have created few chances of their own.\nAs things stand, they are down unless they can turn this game around and results in other games start going their way.\nHalf-time: Everton 0-0 Bournemouth\n17:20 , Jack Rathborn\n45+3 mins: Save! Everton swing the ball into the penalty area but Mark Travers punches it away from Yerry Mina. The ball comes out to Alex Iwobi who rolls it into the feet of James Garner.\nGarner drills one at goal but Travers flaps it wide of the post to keep it level at half-time!\nLeeds 0-1 Tottenham\n17:19 , Ben Fleming\n45+2 mins: Another half-chance from a corner as the ball drops to Kristensen but he can only slice the effort over the bar.\nLeeds 0-1 Tottenham\n17:18 , Ben Fleming\n45+1 mins: Ayling wins the flick-on from the long throw-in and Rodrigo gets on the second ball around the penalty spot. He’s got a lot to do from there but can’t generate the power nor the accuracy and the header goes well wide.\nHalf-time: Leicester 1-0 West Ham\n17:18 , Mike Jones\nLeicester City could not have asked for a better first 45 minutes. Harvey Barnes and Kelechi Iheanacho have been brilliant and they combined to get the Foxes ahead.\nAs it stands they’re ahead of Everton and will remain in the Premier League. There’s a big 45 minutes to come at the King Power Stadium.\nGOAL! Aston Villa 2-1 Brighton (Undav, 39’)\n17:15 , Jack Rathborn\nDeniz Undav is having quite the day. He’s had a goal disallowed already then finds the back of the net once again. This one is flagged against him on the pitch but VAR overturns it and Brighton have one back!\nGOAL! Man Utd 1-1 Fulham (Sancho, 39’)\n17:13 , Mike Jones\nJadon Sancho gets the equaliser for Manchester United!\nEverton 0-0 Bournemouth\n17:10 , Mike Jones\n38 mins: Penalty shout!\nJust before Leicester scored at the King Power stadium Lloyd Kelly brought Demarai Gray down inside the Bournemouth box at Goodison Park.\nEverton wanted a penalty but the referee says Gray went down too easily and waved for play to go on. As it stands Everton are in the bottom three.\nLeeds 0-1 Tottenham\n17:10 , Ben Fleming\n37 mins: Wober wins a header at the near post from the corner but Forster is able to tip the looping effort over the bar.\nGOAL! Crystal Palace 0-1 Nottingham Forest (Awoniyi, 31')\n17:08 , Mike Jones\nTaiwo Awoniyi’s runs onto Morgan Gibbs-White’s long ball, goes past a defender smokes his effort past Sam Johnstone to send Forest ahead.\nLeeds 0-1 Tottenham\n17:07 , Ben Fleming\n35 mins: McKennie receives the ball on the edge of the box but it’s a speculative effort from the American which drifts harmlessly wide.\nGOAL! Leicester 1-0 West Ham (Barnes, 34’)\n17:05 , Jack Rathborn\n34 mins: Huge, huge goal from Harvey Barnes!\nHe brings the ball down the left wing before cutting inside and sending it to Kelechi Iheanacho. Barnes continues into the box and collects the return pass before slotting past Fabianski’s outstretched arms to put the Foxes in front!\nSouthampton 2-2 Liverpool (Sulemana, 28’)\n17:03 , Mike Jones\nWhat a comeback for the Saints! 2-0 down to 2-2. Kamaldeen Sulemana has his first Southampton goal to bring them level, slotting in past the Liverpool goalkeeper.\nLeeds 0-1 Tottenham\n17:03 , Ben Fleming\n31 mins: It’s fair to say the life has been somewhat sucked out of this Leeds crowd but there has been precious little to shout about since Koch’s early chance.\nGOAL! Chelsea 1-1 Newcastle (Trippier OG, 27’)\n17:02 , Mike Jones\nChelsea needed some luck and they’ve got it as Kieran Trippier deflects Raheem Sterling’s shot into his own net. The Blues are level against Newcastle.\nGOAL! Arsenal 3-0 Wolves (Saka, 27’)\n17:01 , Mike Jones\nBukayo Saka gets on the scoresheet as Arsenal end their fine season in wonderful fashion in front of their home supports. The Gunners are three goals to the good against Wolves now.\nGOAL! Aston Villa 2-0 Brighton (Watkins, 26’)\n16:59 , Mike Jones\nAston Villa have extended their lead over Brighton and look set to be playing in Europe next year!\nOllie Watkins is left with a tap-in after Jacob Ramsey dances into the box and slips him the ball.\nLeeds 0-1 Tottenham\n16:59 , Ben Fleming\n26 mins: Kane finds a pocket of space inside the box but Cooper does well to close down the space and Kane’s effort is subsequently blocked with Robles able to claim to the loose ball.\nLeicester 0-0 West Ham\n16:56 , Mike Jones\n24 mins: Lovely hold up play from Kelechi Iheancho sees him receive the ball just inside the penalty area. His back is to goal but he manages to lay the ball off to Harvey Barnes who cuts in from the left.\nBarnes shoots but drills a low effort straight at Lukasz Fabianski who clings onto it.\nGOAL! Southampton 1-2 Liverpool (Ward-Prowse, 19')\n16:55 , Mike Jones\nJames Ward-Prowse pulls one back! With Southampton already relegated the England midfielder will have quite a few suitors over the summer and he’s doing himself no harm by trying to get the Saints back into this match.\nLeeds 0-1 Tottenham\n16:54 , Ben Fleming\n21 mins: Leeds are certainly not leaving things to chance and throwing plenty of numbers forward. Kristensen is left in a two-versus-one against Kulusevski and Son but does superbly to prevent a goal-scoring opportunity.\nUp the other end, Forshaw’s long-range effort is deflected behind by Sanchez.\nGOAL! Man Utd 0-1 Fulham (Tete, 19’)\n16:53 , Jack Rathborn\nIt’s a good job Manchester United have already secured Champions League football. There would have been a lot of nerves inside Old Trafford right now as Kenny Tete gives Fulham the lead.\nLeicester 0-0 West Ham\n16:50 , Mike Jones\n18 mins: Still goalless at the King Power Stadium but Kelechi Iheanacho has come close for the home side. He blazes a shot from the front edge of the box past the opposite post but it’s a good sign for the Foxes.\nThey need to win to stay up.\nGOAL! Southampton 0-2 Liverpool (Firmino, 14’)\n16:48 , Mike Jones\nTalk about departing stars. Roberto Firmino is ending his spell at Liverpool in equally brilliant fashion and has doubled Liverpool’s lead over the Saints.\nThis could turn into a big score.\nLeeds 0-1 Tottenham\n16:47 , Ben Fleming\n15 mins: Wober also goes into the book in the early stages for Leeds after he brings down Kulusevski as the Swede looks to spin behind him.\nGOAL! Arsenal 2-0 Wolves (Xhaka, 14’)\n16:46 , Mike Jones\nGranit Xhaka again! It’s a brace for the departing midfielder as Arsenal take complete control of their match against Wolves.\nGOAL! Southampton 0-1 Liverpool (Jota, 10’)\n16:45 , Jack Rathborn\nSouthampton attempt to play out from the back but Romeo Lavia messes it up and Liverpool’s pressing yields an open goal for Diogo Jota.\nGOAL! Arsenal 1-0 Wolves (Xhaka, 11’)\n16:43 , Jack Rathborn\nGranit Xhaka looks to end his time with the Gunners in perfect fashion as he opens the scoring at the Emirates. He’s moving on in the summer and has scored in his final game for Arsenal.\nThey lead Wolves 1-0.\nLeeds 0-1 Tottenham\n16:42 , Ben Fleming\n9 mins: Spurs look to break from a Leeds corner but the move is halted as Struijk hauls back Lenglet. He receives the game’s first yellow card.\nGOAL! Chelsea 0-1 Newcastle (Gordon, 9’)\n16:41 , Jack Rathborn\nNewcastle have the lead too! Anthony Gordon meets the pass from Elliot Anderson to put the Toon in front. Chelsea’s poor season continues.\nLeeds 0-1 Tottenham\n16:40 , Ben Fleming\n7 mins: WIDE! The home fans have been in fine voice since going a goal down and as they continue to sing, Leeds go close to an equaliser.\nKoch ghosts into the box between the Spurs centre-backs and is found by Rodrigo’s cross. He makes good contact with the header but it drifts just wide of the post.\nA massive chance for Leeds!\nGOAL! Aston Villa 1-0 Brighton (Douglas Luiz, 8’)\n16:40 , Jack Rathborn\nIt’s a perfect response to Tottenham’s goal for Aston Villa who take the lead against Brighton to maintain their place in the Europa Conference League spot!\nDouglas Luiz tapping home from close range.\nEverton 0-0 Bournemouth\n16:38 , Mike Jones\n6 mins: These opening stages aren’t going Everton’s way as Bournemouth sweep forward again down the right wing. A cross is whipped over to Dango Ouattara who rises above James Garner and nods the ball across to Jefferson Lerma.\nLerma meets the pass and smokes it over the crossbar!\nEverton 0-0 Bournemouth\n16:36 , Mike Jones\n3 mins: As news comes through of a goal in the match between Leeds and Tottenham, Bournemouth’s Dango Ouattara drives down the left wing before slipping the ball inside to Dominic Solanke.\nHe shifts to the right and looks to play in Ryan Christie but the forward loses possession on the edge of the penalty area.\nGOAL! Leeds 0-1 Tottenham (Kane, 2)\n16:33 , Ben Fleming\nThe worst possible start for Leeds who find themselves behind inside two minutes. Porro finds some space down the right flank and is found by the pass. He drifts inside and offloads it to Son.\nSon drives into the box but feeds Kane who, on perhaps his last game for the club, smashes home past Robles.\nKick off! Premier League final day\n16:31 , Mike Jones\nThe last 10 fixtures of the Premier League season get started. Leeds, Leicester and Everton are all fighting to remain in the top-flight with Aston Villa and Tottenham vying for seventh and a spot in the Europa Conference League.\nThere’s sure to be lots of drama to come as the Premier League heads to it’s conclusion. Who will be relegated, who will stay up?\nPremier League relegation battle\n16:28 , Mike Jones\nA final update on the permuatations before kick off:\nIf Everton beat Bournemouth they survive with Leeds and Leicester relegated.\nIf Leicester win and Everton lose they will stay up with the Toffees and Leeds being relegated regardless of the result at Elland Road. The Foxes will also stay up if they win and Everton draw due to their better goal difference.\nIf Leeds win and both Everton and Leicester lose then they will stay up with the other two clubs going down. If Leeds win and Everton draw then the Whites would need to be victorious by four or more goals to stay up on goal difference (provided Leicester also fail to win).\nManchester United vs Fulham\n16:26 , Mike Jones\nAntony will probably be fit for the FA Cup final after his ankle problem proved less damaging that Manchester United initially thought.\nThe winger came off in Thursday’s 4-1 win over Chelsea with an ankle problem manager Erik ten Hag said he thought was “serious” but scans provided good news for United.\n\"We have all seen he came out last Thursday, so it's quite soon, but we think it's not too bad,\" Ten Hag said. \"He probably will be available for the cup final next week.\n\"We've all seen how he came off and it didn't look great but the first assessment is not too bad, there is a good opportunity he is available for the cup final.\"\nThe Brazilian, an £86 million signing from Ajax last summer, has scored eight goals in 44 appearances for United.\nLeicester vs West Ham\n16:25 , Mike Jones\nJamie Vardy has scored seven goals in eight Premier League appearances on the final day of a season but starts on the bench this afternoon.\nDeclan Rice is set to play his 204th Premier League match for West Ham, moving him joint-fifth alongside Steve Potts in the club’s leading appearance makers in the competition. Will it be his final league for the Irons?\nLeicester vs West Ham\n16:22 , Mike Jones\nLeicester boss, Dean Smith, is without a win in six Premier League meetings with David Moyes, drawing one and losing five.\nHowever, James Maddison has been directly involved in 19 Premier League goals this term, with 10 goals and nine assists, more than any other Leicester player.\nHe starts for the Foxes today.\nEverton vs Bournemouth\n16:18 , Mike Jones\nBournemouth started a day bottom of the table as recently as 11th March but have already secured a spot in the top-flight next year.\nThey have conceded a club record-equalling 70 Premier League goals this season. Only four teams have conceded more often in a campaign and avoided relegation.\nEverton vs Bournemouth\n16:15 , Mike Jones\nEverton have lost their final league match in five of the last six seasons but Sean Dyche has won six of his eight Premier League matches as a manager versus Bournemouth, losing the other two.\nHowever, he has lost on the final weekend in each of his last five Premier League seasons, with four of those defeats coming at home.\nPremier League final day 2022/23\n16:11 , Jack Rathborn\nLeeds vs Tottenham\n16:09 , Mike Jones\nHarry Kane has scored on the final day in each of the past five Premier League seasons.\nBut, Tottenham are winless in nine away games in all competitions, drawing two and losing seven.\nLeeds vs Tottenham\n16:06 , Mike Jones\nLeeds have lost on the final day in just one of their last 15 top-flight seasons (seven wins, seven draws).\nAlthough that 1-0 defeat to Chelsea came when they were last relegated from the Premier League in 2003/04.\nEverton stare into the relegation abyss – a mess of their own making\n16:02 , Mike Jones\nIf the first 11 have presented a problem, the greater warning came on page 11. Page 11, that is, of Everton’s annual financial report.\n“Conditions indicate the existence of a material uncertainty that may cast significant doubt about the group’s ability to continue as a going concern,” it read. Those conditions, in the curious way Everton phrased it, were “if the assumptions in the relegation scenario were not achieved”.\nTheir assumptions were that a storied club, founder members of the Football League and the club who have played more top-division games than any other in England, would stay up.\nWith one game to go, they are one place above the relegation zone, their fate in their hands but dicing with disaster. A win against Bournemouth will keep Everton up.\nAnything else would doom them if Leicester win; lose and Leeds would leapfrog Everton with a victory of their own.\nEverton stare into the relegation abyss – a mess of their own making\nPremier League final day 2022/23\n15:58 , Jack Rathborn\nEverton vs Bournemouth\n15:53 , Mike Jones\nThe Toffees have 33 points; the Premier League record for the fewest points by a team that avoided relegation is 34, set by West Brom in 2004/05.\nClick here to read the full blog on The Independent's website",
  "word_count": 5847,
  "scraped_at": "2026-02-14T01:48:17.244230",
  "_text_extracted": true
}