{
  "article_id": "cb62f7081062",
  "url": "https://www.managingmadrid.com/2023/2/22/23609597/three-answers-three-questions-real-madrid-win-liverpool-champions-league",
  "title": "Three answers and three questions from Real Madrid win over Liverpool",
  "date": "20230222T040000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Well, that was breathtaking. After producing comeback after comeback through all their Champions League ties last season, Real Madrid this time decided to sort out a comeback by halfway through the first leg, responding to a poor start by winning 5-2 against Liverpool at Anfield. There are so many talking points from this game, so let’s take a look at three pre-match questions that were answered and three new questions to emerge from this seven-goal thriller.\nThree answers and three questions from Real Madrid’s win over Liverpool\nThe talking points from one of the wildest ever Champions League first legs.\nThree answers\n1. Would Ancelotti opt for defensive solidity or a stronger attack?\nIn the pre-match press conference held on Monday night, Ancelotti revealed that he still hadn’t decided on his starting XI. He admitted that he was conflicted, as he wasn’t sure whether to play Valverde in attack and opt for a more conservative midfield or to play Rodrygo in midfield and play a more attacking midfield with Valverde in it. “That’s my big doubt,” he admitted. So, what would he go for? Well, to the surprise of many, Ancelotti went really offensive. As much as this cost Real Madrid initially, having so much attacking quality on the pitch absolutely paid off in the end. As the coach himself reflected in his post-match press conference: “I had been thinking a lot about the line-up. I knew this was different to the final, because it’s a two-legged tie, so I knew scoring here would be important. That’s why I opted for a dangerous forward line. We wanted this to be an open game.” Well, an open game it certainly was!\n2. Could Real Madrid exploit Liverpool’s terrible set piece defending?\nReal Madrid have been poor at offensive set pieces for some time, but Liverpool’s set piece defending has been so poor this season that there was an opportunity there. So, could Real Madrid capitalise on this? Yes, yes they could. A terrible attempt to play zonal marking was what allowed Éder Militão to make a short and smart run and head in one of the simplest corner kick goals he’ll ever score in his career. This game was won through all the chaos of the night, but it was also partly won on the training ground beforehand.\n3. Would Alexander-Arnold get suspended?\nOne of the interesting pre-match questions - that doesn’t mean so much now - was whether Trent Alexander-Arnold would pick up a yellow card. He was the only player from either squad who was one booking away from a suspension, and the English right-back had to go up against Vinícius, a player who has burned him every time they’ve faced off. However, from a Liverpool point of view, having Alexander-Arnold was still better than not having Alexander-Arnold. So, would the right-back pick up the yellow card that would rule him out of the second leg at the Bernabéu? Well no, he didn’t, so Trent can take to the pitch in Madrid. But, given the huge scoreline, that little pre-match detail that we thought might matter suddenly seems insignificant.\nThree questions\n1. Is Vinícius the most decisive player in world football now?\nThe headline quote from Ancelotti’s post-match press conference was when he said: “Vinícius is the most decisive player in world football right now.” The Italian was full of praise for the Brazilian, who scored the two goals that made it 2-2. One of his goals was an absolutely perfect crisp finish through a sea of bodies. The other goal was scored without him knowing much about it, as he was facing the other way when Alisson’s attempted clearance hit the pressing Vini and went in. But, both those goals exemplify exactly what Ancelotti was saying. Vinícius makes a difference through both his skill and his perseverance. Whether he is the number one most decisive player in all of world football is another question, but he might just be.\n2. Should Nacho have started the match?\nThere are several explanations for why Real Madrid started so poorly and for how they turned it around so quickly. But, one of them might be the change of left-back. Unfortunately for David Alaba, he suffered an injury and had to go off for Nacho in the 27th minute. But, it was round about then that Real Madrid finally started to look more solid defensively, finally getting a handle on Mohamed Salah. When he came on, Nacho was absolutely superb, just as he has been for several weeks now. You have to wonder if Nacho actually deserved to start this match. He certainly made a case for that once he came on.\n3. Why would you want to abolish nights like this with a ‘Super League’?\nDid you enjoy tonight? Was that exhilarating? Well, savour it, because if the ‘Super League’ happens then nights like this are going to become as extinct as the dinosaurs. It really is incredible to think that Florentino Pérez, the president of the club that has produced more great Champions League victories than any other, would want to abolish this competition and the unique thrill that is Champions League knockout football. If Pérez gets his way, and replaces the Champions League with a new ‘Super League’, would there still be games between Real Madrid and Liverpool? Yes. But, would we get a game like this one, which was as wild as it was because of the jeopardy and pressure that only exists in two-legged continental knockout football? No. Not a chance.",
  "word_count": 924,
  "scraped_at": "2026-02-14T01:59:41.702852",
  "_text_extracted": true
}