{
  "article_id": "cb6eacb23749",
  "url": "https://www.90min.com/posts/favourites-best-fifa-mens-player-ranked-2023",
  "title": "Favourites for the Best FIFA Men Player",
  "date": "20231012T193000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Favourites for the Best FIFA Men's Player - ranked\n- The 12 nominees for the Best FIFA Men's Player were announced in September\n- There are a few clear favourites to get their hands on the trophy\n- Erling Haaland, Kylian Mbappe and Lionel Messi are all nominated\nIndividual awards are normally incredibly controversial in modern football. The advent of social media has given fans a way to spread their opinions far and wide, no matter how vehement.\nUndoubtedly, such an array of strong feelings will come to the fore when the winner of the 2023 Best FIFA Best Men's Player is announced.\nThe usual candidates are up for the award - bar the omission of a certain Cristiano Ronaldo - with a few rogue shouts thrown in there for good measure. However, only one man can win the accolade, and there have been just four different victors since the award's inception in 2016.\nHere are all 12 Best FIFA Men's player nominees for 2023 - ranked.\nBest FIFA Men's Player nominees - ranked\n12. Marcelo Brozovic - Inter/Al Nassr & Croatia\nIt's important to note that, according to FIFA, these nominations are based on achievements between 19 December 2022 and 20 August 2023, so any early season form from either this season or last season should be ignored.\nWhile Marcelo Brozovic was part of an Inter team that reached the Champions League final and a Croatia side that finished third at the World Cup and lost the UEFA Nations League final to Spain, it feels incredibly unlikely that the midfielder will get his hands on the trophy.\nGiven Luka Modric was omitted from the nominees, it seems surprising that Brozovic was included, albeit Inter did go one step further than Real Madrid in Europe last term. Regardless, there is no real chance of the now Al Nassr player claiming the prize.\n11. Khvicha Kvaratskhelia - Napoli & Georgia\nKhvicha Kvaratskhelia was an enormous reason why Napoli won their first scudetto in 33 years last season, netting 12 goals and providing 13 assists in Serie A. While Napoli were dumped out of Europe in the quarter-finals by Milan, the winger still managed a combined six goals and assists in nine matches in the Champions League.\nHowever, despite his brilliance, Napoli's European exit and Georgia's lack of presence on the international stage means Kvaratskhelia is very unlikely to win the award.\n10. Declan Rice - West Ham/Arsenal & England\nDeclan Rice's £105m Arsenal move came off the back of a hugely impressive season with West Ham United, with the midfielder captaining the Hammers to the Europa Conference League trophy. The Irons beat Fiorentina 2-1 to lift their first European silverware since the 1964/65 season, with Rice playing a huge part in their journey.\nHowever, the defensive midfielder remains some way off the levels achieved by other nominees, despite a strong start to the new season in north London. England also struggled to make a significant impact at the 2022 World Cup, meaning Rice is likely to be overlooked.\n9. Victor Osimhen - Napoli & Nigeria\nSimilarly to Kvaratskhelia, Nigerian forward Victor Osimhen was sensational for Napoli during the 2022/23 campaign. However, for the same reasons as his teammate, he is likely to be overlooked.\nOsimhen's individual quality helped Napoli to the Serie A title, scoring 26 goals in 32 matches, but Napoli's underwhelming European performance and the fact that Nigeria didn't win a game at the 2022 World Cup will harm his chances greatly.\n8. Bernardo Silva - Manchester City & Portugal\nOne man that Pep Guardiola will always turn to in big games is Bernardo Silva. The diminutive midfielder has the grace, quality and tactical intelligence needed to thrive at the highest level, skills he frequently exhibited for Man City's treble-winners last season.\nSilva's performance in the second leg of Man City's Champions League semi-final against Real Madrid is probably worthy of this award alone, but, unfortunately for the 29-year-old, he is competing with some of his own unbelievably talented teammates.\nAlso, Portugal's quarter-final World Cup defeat to Morocco has likely impacted his chances.\n7. Julian Alvarez - Manchester City & Argentina\nJulian Alvarez has been much more readily used as a starter this season than he was last, partly due to his increasingly impressive performances towards the end of the 2022/23 campaign. The forward was instrumental in Argentina's World Cup victory and played his part in Man City's treble win.\nAlvarez was brilliant across the course of last season, but it's really the beginning of the new campaign that has seen him become a regular for Man City. The 23-year-old has been the Cityzens' most in-form player, but arguably didn't do quite enough last year to merit the Best FIFA award.\n6. Ilkay Gundogan - Manchester City/Barcelona & Germany\nEvery great team has to have that one underrated star player, Ilkay Gundogan was exactly that for Pep Guardiola's Man City. The German's consistency in midfield was unbelievable, but he also popped up with crucial goals towards the end of last season.\nNo more so than in the FA Cup final, scoring twice - including the fastest ever goal in a FA Cup final - to beat bitter rivals Manchester United and complete the second part of City's treble. Guardiola has certainly missed his calming influence in midfield this season, although Germany's terrible World Cup showing may count against him in the votes for this award.\n5. Kylian Mbappe - Paris Saint-Germain & France\nAnyone who scores a World Cup final hat-trick probably deserves to be nominated for this award, let alone when it's Kylian Mbappe. The Paris Saint-Germain forward almost lifted a second World Cup trophy, but France lost to Argentina on penalties despite Mbappe's heroics.\nMbappe also managed 41 goals in all competitions for PSG last season, helping them to the Ligue 1 title, despite another disappointing Champions League campaign. It was a year of close calls and controversies for Mbappe, but he still remains arguably the greatest player in world football. Unfortunately, his teammates couldn't meet his standards.\nHowever, the voting is includes a public ballot, so there is a good chance that Mbappe ranks highly among the nominees.\n4. Kevin De Bruyne - Manchester City & Belgium\nKevin De Bruyne sums up everything that is good about Man City when he's fit and firing, with last season's showings among some of his best in sky blue. The Belgian registered 18 assists and seven goals in the Premier League, adding another 14 goal contributions across the Champions League and FA Cup.\nBelgium's disappointing World Cup performance aside, De Bruyne was in magnificent form once again, proving an integral part of a record-breaking Man City team. The 32-year-old has been sorely missed due to injury this season, but there are few better players in world football when in their groove.\n3. Rodri - Manchester City & Spain\nThe heartbeat of this unbelievable City team, Rodri is the one man Guardiola can't replace. This has been well-documented in the past, but has been particularly noticeable recently given the treble-winners have lost three consecutive domestic matches without the Spaniard.\nRodri's ability to dictate the tempo and tidy up in midfield make him the most complete and efficient defensive midfielder in the world, and not to mention that he popped up with the winning goal in the Champions League final against Inter last June.\nThere is nothing the 27-year-old can't do, but there's plenty that City can't do without him.\n2. Erling Haaland - Manchester City & Norway\nDo you remember at the beginning of last season when Erling Haaland was Man City's problem? Yep, that didn't age too well.\nThe Norwegian scored 52 goals in just 53 matches during his first season at the Etihad, including smashing the Premier League's single season goalscoring record by netting 36 in 35 games. Add the treble to his impressive and growing cabinet of collective and individual silverware and there are few that could argue he doesn't deserve this award.\nHowever, football awards are often a popularity contest, and there might be someone who's a little more popular...\n1. Lionel Messi - Paris Saint-Germain/Inter Miami & Argentina\nErling Haaland is unfortunate to have performed so well in the year that Lionel Messi finally won the World Cup. The Argentine scored twice in the final and was the player of the tournament in Qatar - the crowning moment of a rollercoaster international career.\nForget what he did with PSG, or what happened in the Champions League, Messi will win this award because he finally lifted the World Cup. It probably helps that he's the most loved player on the planet too.",
  "word_count": 1446,
  "scraped_at": "2026-02-14T01:51:09.239432",
  "_text_extracted": true
}