{
  "article_id": "cb83399d9869",
  "url": "http://thepeninsulaqatar.com/article/27/04/2024/depleted-milan-hold-juve-to-close-in-on-champions-league",
  "title": "Depleted Milan hold Juve to close in on Champions League",
  "date": "20240427T233000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nJuventus' Italian forward #07 Federico Chiesa controls the ball during the Italian Serie A football match between Juventus and AC Milan at The Allianz Stadium in Turin on April 27, 2024. (Photo by MARCO BERTORELLO / AFP)\nTurin, Italy: AC Milan took another step towards Champions League qualification after Saturday's goalless draw at Serie A rivals Juventus.\nStefano Pioli is close to guaranteeing Milan, in second, a spot in Europe's top club competition in what will almost certainly be his final season at the club.\nPioli is reportedly set to be replaced by Julen Lopetegui after a campaign which has ended in disaster, with a Europa League exit at the hands of Roma and a humiliating city derby defeat which gave the league title to Inter Milan.\nHowever, with a top-five finish guaranteeing Champions League football Milan are 16 points ahead of sixth-placed Atalanta, who have six games left to play starting with Sunday's home clash with struggling Empoli.\n\"I'm pleased with what the players showed today... they kept fighting to the end,\" said Pioli to DAZN after his team failed to register a single shot on target.\n\"I'm happy with the spirit. They carried out our plan with a great attitude in a difficult period in the season for us.\"\nA place in the Champions League basically assured before kick-off, Milan had little to play for and a host of absences following a stormy end to their painful loss in Monday's derby with Inter.\nPioli had a threadbare defence with Theo Hernandez, Davide Calabria -- both sent off late on in the derby -- and Fikayo Tomori all suspended, while Simon Kjaer and Pierre Kalulu were also unavailable.\nTo make matters worse Milan then lost France goalkeeper Mike Maignan to a hamstring problem suffered during the pre-match warm-up.\n\"A lot of the noise has been caused by Inter winning the league. If it had been Juve or Napoli there wouldn't have been so much chaos,\" said replacement goalkeeper Marco Sportiello, who ended up being crucial to Milan getting a point.\n\"The Europa League was the biggest disappointment, but we've had a good league season. We've had so many injuries... but we go again and now we're going to try and secure second place.\"\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 442,
  "scraped_at": "2026-02-14T02:13:49.314657",
  "_text_extracted": true
}