{
  "article_id": "cbe9b0ee71b1",
  "url": "https://www.the42.ie/athlone-town-glasgow-city-preview-6811967-Sep2025/",
  "title": "Athlone out to  keep historic run going  in Europa Cup after managerial upheaval",
  "date": "20250910T083000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THE LAST TWO weekends have been very different for Athlone Town.\nTheir magical European run continued in one. Then, a managerial reign abruptly ended.\nTwo polar opposite Sundays, both following 2-0 Saturday wins.\nOn Sunday 31 August, Athlone learned their Uefa Women’s Europa Cup qualifying fate, having secured their progression by beating Red Star Belgrade. When Glasgow City came out of the hat, they would have been relatively happy and relishing the challenge.\n- Live – Uefa Women’s Europa Cup first qualifying round, first leg: Glasgow City v Athlone Town, 7.35pm, LOITV\nOn Sunday 7 September, a bombshell statement arrived confirming Colin Fortune’s departure.\nShock was the initial reaction in most quarters, with eyebrows raised at the timing.\nThree days out from the historic first leg against Glasgow City. In the middle of their Women’s Premier Division title defence, 24 hours on from a crucial win over Shamrock Rovers which extended their lead at the top of the table. In the thick of the business end, with five league games to go and an FAI Cup semi-final also looming.\nFortune told the Westmeath Independent he felt “undermined” during his time as manager, and detailed a contract extension request amidst a lack of clarity around his future at the club.\nAthlone Town responded to the comments, describing the contract extension request as “an ultimatum” before an end of season review.\n“The timing and manner of this departure are regrettable, but they stem solely from individual interests being placed ahead of the collective progress of the team and club,” a statement noted. “That is something we cannot and will not accept.”\nJohn Sullivan now takes interim charge until the end of the season, having previously worked with the men’s team and served as assistant coach at DLR Waves. The former League of Ireland player will be assisted by Gordon Brett, Fortune’s head coach.\nAmidst the fallout and upheaval, the show goes on.\n“I think everybody was a bit surprised with the news, but things happen in football like that so we have to take it and move on and focus on our next game against Glasgow,” Athlone midfielder Sarah Rice said before boarding the short flight on Tuesday morning.\n“Obviously things like that are going to be a big shift but we’re really just focused on our next game, playing our best, staying together as a team and continuing to play the way that we play and navigating that challenge together.”\nAthlone have overcome disruption before in their short five-year history, and have been galvanised in the face of adversity: Tommy Hewitt stepped down mid-season in 2023, and Ciarán Kilduff took the reigns to deliver their maiden FAI Cup success. After leading the Midlanders to their first league title last October, Kilduff departed for the Dundalk men’s managerial job.\nFortune entered the fray thereafter, the on-field transition appearing seamless as Athlone picked up where they left off domestically and hit unprecedented heights in their debut Champions League campaign.\nEmphatic home wins over Cardiff City (4-0) and ŽNK Agram (3-0) saw them become the first Irish side since Raheny United in 2014/15 to progress from the first qualifying round. Icelandic champions Breiðablik ended their Champions League hopes after a 3-1 defeat in the Netherlands, but Athlone impressed and were only undone by two goals in a minute. A 2-0 victory over Red Star Belgrade means they are now the first Irish side to compete in the inaugural Women’s Europa Cup.\n“We’re super excited to be representing the league and to keep our historic run going,” said US native Rice, one of 11 players to feature in each of Athlone’s four European games so far.\n“This is another opportunity to show ourselves, keep playing well and test ourselves against a really good side.”\nGlasgow City await in the first qualifying round, with two-legged ties the format. The winner progresses to another home-and-away double-header in the second round, with a place in the last-16 on the line there.\nGlasgow are a familiar name to those in Irish women’s football circles.\nThey have a long history of welcoming Irish players, with Erin McLaughlin and Emily Whelan the two on their books currently. (McLaughlin scored her first competitive goal for the club in a 5-0 win over Montrose on Sunday) Katie McCabe and Denise O’Sullivan are among those to have played there in the past, while Eileen Gleeson spent a stint in charge of the Scottish side, who were 14 in a row league champions up to 2021. Other opposition have since improved, with City finishing second to Hibernian last season.\nThe Glaswegians have vast European experience thanks to their domestic dominance, reaching the Champions League quarter-finals in 2014/15 and 2019/20. They have met Irish opposition along the way, beating Shelbourne 2-0 in 2023 and needing a penalty shootout to overcome Peamount United after a 0-0 draw in 2020.\n“We definitely know a little bit more about the team going into it which will be a great advantage to us, so we know more than we did about the other teams (we previously played in Europe),” Rice added.\n“I definitely think it will be a great challenge as we both match each other really well, so it will be really fun to see how that plays out. We’re getting better each game, the team is adapting and growing all of the time.”\nAthlone have shown they are more than capable for this level, and will look to go toe to toe with Leanne Ross’s side at Petershill Park and bring the tie back to Lissywollen with all to play for next week.\nLed by the attacking triple threat of Madie Gibson, Kelly Brady and Roisin Molloy, and midfield maestro Hannah Waesch, they must now put the managerial upheaval to one side, block out the noise, and do their talking on the pitch.\nMore history beckons. The whirlwind continues.",
  "word_count": 981,
  "scraped_at": "2026-02-14T02:09:24.928294",
  "_text_extracted": true
}