{
  "article_id": "cbf16d6eb0cf",
  "url": "https://www.themag.co.uk/2024/12/thank-you-to-amanda-staveley-for-delivering-us-from-evil-newcastle-united-fans/",
  "title": "Thank you to Amanda Staveley for delivering us from evil",
  "date": "20241225T134500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thank you to Amanda Staveley for delivering us from evil\nAn ideal time in the heart of the festive season to get a snapshot of views from Newcastle United fans on how they think things are going.\nSo we sent out various questions to a small number of regular/irregular contributors to The Mag.\nAsking these Newcastle United fans some of the important questions of the day.\nAs well as some with a seasonal twist.\nHere we have Wor Lass giving his answers:\nIn 2024 what have been your three worst Newcastle United moments?\nThe 13th of January was definitely unlucky for us. I didn’t think anything was going to come close to feeling as bad as the Nunez strikes that sank us in August 2023 but Kevin de Bruyne and Oscar Bobb managed it in City’s excruciatingly cruel 3 – 2 win in the New Year.\nThe FA Cup final unbelievably saw Man Utd defeat their noisy neighbours 2 – 1. Not only did it give those entitled “B’s” yet another trophy but it meant they took Chelsea’s UEFA Cup place and they in turn took our Conference League spot – hence no European footy of any description for us. The only up side was that it secured Eric ten Bob the manager’s job for a few more months.\nThe other thing that really got my goat was the long drawn out Marc Guehi saga in which Steve Parrish embarrassingly messed us about, much to the amusement, no doubt, of the “oil money” brigade.\nWhat would be a perfect Newcastle United Christmas present to unwrap?\nDefinitely Kate Bryan in an NUFC duvet! Not that I’d be able to do the moment justice.\nIn 2024, what have been your three best Newcastle United moments?\nI’m spoilt for choice regarding my first pick here.\nOur 3 – 0 drubbing of the Mackems at the Stadium of Plight would have to be a highlight in any year. However, the result (a bit of a foregone conclusion really) was eclipsed by the incredibly embarrassing rebranding of the Black Cat suite as a Magpies bar and the cheap and tacky tinsel display at kick off (Wearyside, indeed!). Oh, how we laughed (and still are).\nBack in March I was in the depths of despair as West Ham took a 3 – 1 lead at St James’ Park but that turned to ecstasy as Harvey Barnes scored his second in the 90th minute to complete an incredible turnaround as we won 4 – 3.\nWe usually lose to last gasp goals where Liverpool are concerned, so when Salah notched on 83 minutes back in December, I thought, “Déjà vu all over again”! However, when Caoimhin Kelleher uncharacteristically let the ball go and the Fab One slid in to gratefully slide home Bruno’s cross a few minutes later there was suddenly red wine on the ceiling at Chateau Lass. It felt like we’d won. It was so good to see the Liverpool players hanging their heads and feeling hard done by.\nOnce we get Christmas out of the way, the Newcastle United hierarchy have promised an update early in the New Year, regarding what their plans are for delivering a significantly bigger/better stadium. What do you hope they say? (Not just whether staying at SJP or new site but also capacity, timescale, progress they might have made on the quiet regarding their plans, whatever)\nI feel like this topic has been done to death and I can’t wait to finally hear what the reality is going to be.\nOne thing’s for sure – whatever the decision, there will be people moaning (especially in the Monkseaton area, I expect).\nPersonally, I would like to see a new build but only if it’s within walking distance of the town centre, 80,000 seems to be the “itk” figure quoted and that would do nicely. This is going to be literally a once in a lifetime event so it needs to be worth it from an enhanced capacity point of view. It needs to be state of the art so attractive as an international and big event venue.\nIt also, as Tottenham have realised and capitalised on, needs to offer lots of alternative usage to maximise stadium-generated income. It would be excellent if the owners put some serious thought as to how to involve younger fans and also develop safe standing.\nThe 2025/26 season will be the tenth since Newcastle United last had a Premier League derby match. Have you any seasonal black and white goodwill for our Mackem friends finally making it back to the top tier, from what looks the most appalling quality second tier for many years. Or even just because the amusing FA Cup stroll on Wearside last season whetted your appetite for the return of the derbies?\nI’m probably in the minority on The Mag in that I’m in favour of all NE teams being in the Premier League but AS LONG AS we’re top dogs and regularly putting the others in their places. I think the Mackems would make a great yo-yo club, coming up for a couple of drubbings then dropping down again – rinse and repeat.\nI watch Championship games and find the division good to watch but the gulf between the PL and the Championship has definitely widened in recent years so I believe less and less promoted teams will be able to survive for more than that first season.\nI’m back in Blighty visiting friends and family. Unfortunately, I can’t make it up to the Land of Milk and Honey but my mate in the Ribble Valley has got me a ticket for the Boxing Day match at Ewood Park – Rovers v the Mackems. For the first time ever I’ll be cheering on Blackburn.\nIf you could guarantee five NUFC players to be fit for the rest of the season (including all those currently unavailable), who would you choose and in what order\n1 Isak 2. Callum 3. Bruno 4. Tonali 5. Botman – with no disrespect to anyone else. Fine margins – but I’d like the spine of the team to have its top players with options.\nIf you could invite three Newcastle United connected people, past or present, around to yours for a social gathering at Christmas, who would you invite and why? Thinking of fans (famous or not), past (not present) players, managers, owners, whoever.\nI would have to invite Rafa to be general MC and wine waiter, Penfold to organise the tea and biscuits and David Ginola …… well, because Mrs Lass told me to for some reason!\nA knock on your door on Christmas Day, your place beautifully Xmas decorated, roaring fire, table laden with more food and drink than anybody could eat and drink. You open the door and freezing cold, snow bleaching down, which three cold and starving Newcastle United connected characters (past or present) would you still turn away?\nI won’t waste a nomination for the most obvious one!\nI would definitely say Richard Dinnis for being probably the most useless manager I can remember – beating some stiff opposition in the likes of Gordon Lee, Bill McGarry and Graeme Sourness.\nMichael Owen wouldn’t get a look in because he was a bigger rat than even Dan Ashworth.\nFinally, I’d regretfully send Micky Quinn on his way because I wouldn’t want the food to run out.\n(Steve Bruce would be barred for a combination of all of the above reasons!)\n(Actually, I’d let Quinny in because he’s a real gent).\nAssuming you don’t think that position has been reached already… what would it take for you to think Newcastle United needed to consider replacing Eddie Howe?\nIt certainly hasn’t got anywhere near that point as far as I’m concerned.\nThere would have to be a catastrophic run of results putting us too near the relegation zone or a very obvious case of the players losing confidence in Eddie and stopping playing for him. I can’t see either case happening, to be honest. Eddie has to stand up to scrutiny, though, and I don’t think there’s anything wrong with constructive criticism. What I like to see when people criticise Eddie’s decisions is them putting forward their alternative rather than just moaning.\nIf you were granted three New Year’s wishes (apart from the obvious of winning something!) to come true in 2025…\nIce Cold Alex signs a new contract and declares that he has no desire whatsoever to leave us – especially not for Arsenal.\nAn announcement that a new, state of the art, 100,000 seater stadium is to be built within walking distance of the city centre.\nA mysterious Tibetan faith healer arrives in town and fixes up Calum Wilson, Jamaal Lascelles, Little Joe and Matt Targett and stays on hand for Alex’s inevitable next breakdown!\nYour New Year’s resolution that is Newcastle United related…?\nTo at least wait until Mrs Lass has got her morning coffee before regaling her with the latest club crisis/triumph (delete as necessary on a daily basis).\nWin the FA Cup or League Cup sometime in the next five years AND finish between 8th and 10th in each of these five seasons, or win nothing AND finish between 2nd and 4th in every one of these five seasons?\nWe both need and deserve European football, preferably at the top table of the CL, for our continued development. We haven’t won anything worth writing home about for 55 years and counting so I could wait a bit longer. Wallowing between 8th and 10th is out of the question for me. We would be having a succession of rubbish managers if that was our level and we certainly wouldn’t be keeping or attracting top players.\nObviously it takes a ‘little’ bit of imagination but if there was a scenario where on the last day of a Premier League season… a Sunderland victory (against whoever) would mean Newcastle United qualified for the Champions League instead of Europa League BUT also meant the Mackems won the Premier League. What would you want to happen?\nI don’t need to bother too much with this one because it’s pure fantasy.\nIn your lifetime, the five people associated with Newcastle United (anybody, on or of the pitch, inside or outside the club) who you would like to say thank you to and why?\nBobby Moncur for lifting the only worthwhile trophy within my living memory. We won the FA Cup 3 times during my first 4 years but I don’t remember anything about that.\nSupermac for just being the most exciting, dynamic player I’ve ever seen live.\nKK for getting a hold of the club and making everyone believe again. I really wish the owners would get him along to a game so everyone can show him how much he means to us.\nAmanda Staveley for delivering us from evil. She should be invited back at some stage as well.\nEddie Howe for being such an honest and honourable leader of the club and raising press conferences and interviews back into the realm of adult, intelligible conversation. He never fails to do us proud.\n(Special mention to Bobby Mitchell for unbarring me at the Lochside after 24 hours).\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1887,
  "scraped_at": "2026-02-14T02:14:55.042703",
  "_text_extracted": true
}