{
  "article_id": "cc2b497d2b20",
  "url": "https://www.espn.com/espn/story/_/id/47637712/senegal-coach-pape-thiaw-begs-sadio-mane-reconsider-international-retirement",
  "title": "Senegal coach Pape Thiaw begs Sadio Mane to reconsider international retirement",
  "date": "20260117T134500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Senegal head coach Pape Thiaw has urged Sadio Mané to reconsider his decision to call time on his international career, saying he would do anything in his power to get the legendary forward to extend his time with the Teranga Lions.\nThe 33-year-old Mane has played a key role for Senegal at the ongoing Africa Cup of Nations, registering three assists and scoring twice en route to Sunday's final against Morocco at the Prince Moulay Abdellah Stadium in Rabat.\nThe veteran was influential as Senegal won their first ever Nations Cup title in Cameroon in 2022, but announced after the semifinal victory over Egypt that, while he will contest the FIFA World Cup later this year, this would be his last AFCON with the national side.\n\"The country is not in agreement [with his decision], and I am not in agreement,\" Thiaw told ESPN on Saturday.\n\"We want to keep him as long as possible. He represents Africa, the world, and when we say it's his decision, it doesn't just belong to him, he belongs to the people of Senegal, and they want to see him carry on.\n\"Considering his example, we need such people like this in the country,\" Thiaw continued, his voice cracking with emotion. \"He gives lessons, his humility, his education, how he gives his sweat for Senegal.\n\"He gave his life for this team to get to the World Cup in 2022, he gave his life to win the first AFCON and get the first star.\n\"If I had to sign a paper to allow this player to leave, I would say 'no', and his teammates would say 'no' as well.\"\nSince making his international debut in 2012, Mane has helped Senegal reach new ground, while also enjoying success in European football, winning both the Champions League and Premier League with Liverpool, as well as clinching two African Footballer of the Year awards.\nHe played a key part in their return to the AFCON final in 2019, before they went one further and won the title -- defeating Egypt on penalties -- two and a half years later.\nHe's also been essential to Senegal's three consecutive World Cup qualifications, having ended their wait to return to world football's high table for the 2018 edition.\n\"I don't have enough time to describe what he's done for African football and, above all, Senegalese football,\" defender Moussa Niakhaté told ESPN. \"I don't want to repeat the same obvious things, but he's an exceptional player, and deserved to win the Ballon d'Or.\n\"Beyond being a football, he's an incredible human, and as he declared after the Egypt game, this will be his last AFCON match, but it's his sixth tournament, and it shows his consistency.\n\"There are other things that I will keep to myself, but we want to do it for him to add a second star [to our shirt], he's one of the best players that we've ever known.\"\nNiakhate also shared how the Al-Nassr forward was influential in his arrival in the national team, going out of his way to ensure that the centreback was included in the World Cup trip to Qatar.\n\"He's a person who had a huge responsibility in my coming to the Senegal national team,\" the former France U21 international continued. \"He contributed strongly in allowing [then head coach Aliou] Cisse to take me.\n\"When you have a player of his level knocking at the door to take you, it shows his humility and the absence of ego for the person, as well as defining his love for his country, and his work for Senegal.\"\nMane, who was named Man of the Match in the semi against Egypt, outlined after the match his happiness at playing in his last AFCON final, and shared his determination to \"take the trophy back to Dakar.\"\nSunday's match will be Senegal's fourth final, with the Teranga Lions having been defeated finalists in 2002, before now reaching three of the last four finals.",
  "word_count": 665,
  "scraped_at": "2026-02-14T02:09:43.004212",
  "_text_extracted": true
}