{
  "article_id": "cc31b1fa2221",
  "url": "https://www.myjoyonline.com/braving-the-odds-mukarama-abdulais-journey-of-resilience/",
  "title": "Braving the odds : Mukarama Abdulai journey of resilience",
  "date": "20240522T081500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nThe year was 2018 and Mukarama Abdulai was the most recognisable name on the lips of many Ghanaians, having become the poster girl of Ghana football while representing the Black Maidens at the FIFA U-17 World Cup.\nAt the time, many believed she was destined for the big stage, and she might still get there, but the journey for the young, enthusiastic goal-getter has been riddled with hurdles, that have at times seemed impossible to scale.\nShe burst onto the scene at a young age, starring for the University for Development Studies (UDS) women's team, as well as Northern Ladies in the Ghana Women's Premier League before eventually finding her way into the national teams where her recent success was scoring the winner against Nigeria at the 2023 African Games football final to seal a gold medal for the Black Princesses.\nHer journey to scoring that decisive goal embodies the spirit of daring to dream and taking action to achieve those dreams.\nHowever, being in the team for the competition was never part of her to-do list.\n\"For me personally, it was something I was not expecting,\" she told Joy Sports as she narrated how the opportunity came. \"Coach [Basigi] called me to inform me I will be taking part [in the competition.\n\"I was excited because coming back injury [that kept me] out for two years, this was an opportunity for me.\"\nDespite facing setbacks and challenges along the way, she persisted and ultimately succeeded on the grand stage. That according to her, will never be erased.\n\"I think it is something that will be a very part of me -- winning the African Games. It's like the Olympic games so it is something important for me,\" she would go on to say.\nHer inclusion in the squad, despite being over 20, was a twist of fate that would go on to open doors for her to showcase her talent once again.\n\"CAF brought a communique that we can add two over-aged players. Not only us but all the participants we can add people born in the years 2002 and 2003,\" Yussif Basigi recalled.\nThe gaffer saw something special in her, a testament to her abilities both on and off the field.\n\"I opted for Mukarama because I needed bite upfront because most of my strikers were not available so I needed to bring her on board to bring her expertise and experience to help the team and of course, she did,\" the trainer would go on to say.\nMukarama's path to success at the 2023 African Games hasn't been without obstacles.\nThe awareness of Maafia Nyame to pick out Abdulai Mukarama - I absolutely love these girls, man.\n— Lawrence Degraft Baidoo (@kweku_lawrence) March 21, 2024\nGood stuff from the Black Princesses.#AfricanGames pic.twitter.com/TtZ1bzlnDK\nFrom her promising rise at the U-17 World Cup to battling injuries and criticism, she has faced adversity head-on.\n\"She mentioned some point in time…that was before the U-17 World Cup where she blew up. She was telling me how she sometimes had to go sell sachet water and make sure she sold everything at a certain point in time then run to the pitch, put her bowl somewhere and join the guys on the pitch,\" Ayishatu Zakaria Ali, a women's football expert told Joy Sports.\n\"She mentioned how at a certain point in time, she had to put on the big Muslim hijab, the one that covers all parts of the body because her mum was against the idea of playing football.\n\"That part is unexplainable. It's a tough situation but in all at the end of the day if you have the right people around you and as an individual you are strong enough to go through the struggle…it's something that I can't explain, it's tough but Alhamdullah,\" Mukarama said of that period in her life.\nAfter her exploits on the local scene, she joined the national team and jetted to the 2018 U-17 World Cup where she won the top scorer award with her seven goals and two assists.\nA year after the success on the world stage, she moved to the United States on scholarship to continue her education while also continuing her football career. She played for Tyler Apaches during her time at Tyler Junio College.\nIn her inaugural season playing for the Tyler Junior College women's soccer team, she netted an impressive 27 goals and delivered 13 assists. Her remarkable contributions were pivotal in securing victories at the 2019 NJCAA Gulf South District Championship and the NJCAA Women's Soccer Championship, where she notably scored a brace in the final.\nUndeterred by high expectations, she continued her stellar performance in her second season, tallying 23 goals and 10 assists. Her exceptional skills played a crucial role in securing back-to-back triumphs at the 2020 NJCAA Gulf South District Championship and the NJCAA Women's Soccer Championship.\nFast forward to 2021, she signed for Spanish outfit Alaves, in what many believed was a career-making move. But that proved to be, to date, the most challenging period in her career.\n\"I think it was a good place for me but it wasn't a smooth ride,\" Mukarama recalled. \"There were difficulties. There were challenges but [I thought] this was a good step for me.\"\nIn many ways, Mukarama has always had to fight adversity. After an uneventful first game at the African Games, for example, some fans at the Cape Coast stadium, during Ghana's second game, were left frustrated.\nHaving seen her play with fewer threats more than halfway through the game against Tanzania, they called on Basigi to take her off.\nThe coach didn't oblige and a determined Mukarama eventually got onto the scoresheet to silence her critics.\n\"I saw messages later on after that game and I was surprised because I didn't hear anything about me particularly about being booed,\" she said.\n\"If they were for me, I don't think [it affected me]. It's part of the game, I am not the first player to be booed so it's something I took normally.\"\nBasigi's unwavering belief in Mukarama's capabilities speaks volumes about her talent and character.\nA call with a legend. pic.twitter.com/WE3WYBBEmJ\n— Hasaacas Ladies FC (@HasaacasLadies) September 26, 2023\nThe first was signing her for Ghana Women's Premier League side, Hasaacas Ladies. Then, taking her to the African Games.\n\"I think coach [Basigi], has been helpful and the team, Hasaacas, has been welcoming since I joined them and they have been a great part of my comeback,\" Mukarama mentioned.\n\"She has been with me at the club and I’ve been working with her. I know her temperament. She has the character and these are the players that we are looking for. Despite the injury that she had and returned to the field, I feel mentally she’s tough to work with,\" Basigi said.\n\"At times, it’s not only about the player on the field of play but off the field of play she’s also a mentor. She is someone who unites the players and I felt there was a need to bring her on board…We needed such a player to augment the team and of course, she lived up to my expectations.\"\nNow, as they shift their focus to club football, Mukarama and Basigi are determined to continue their winning partnership.\nWith their sights set on reclaiming the Women's Premier League title and possibly returning to the CAF Women's Champions League - a stage the Hasmal Ladies were three years ago, they remain committed to their journey of success.\n\"[Hasaacas Ladies' season] has been great as a team and as you know, players and coaches have different minds on how we read the game and how we want the team to be. The coach may not be satisfied with the performances,\" she stressed.\n\"As an individual, I won't say I am satisfied because there have been some few setbacks as a team and I think it's part of the game. But the name, Hasaacas, is a big name. I think we are on the right path.\"\nBasigi added, \"I want to win the league first then I will see the kind of preparations I will do for the Champions League. I have been there and I got to the final.\n\"I am just waiting to win the league. If I win, I will know the sort of preparations in order to get to the final again and win.\"\n\"This particular place is a good step for me coming back. Working towards where I want to be and where I am starting from, [this] is the place I should be,\" Mukarama concluded.\nMukarama's current form may not match her previous heights, but with the support of her team, she continues to strive for excellence.\nHer eight goals for Hasaacas Ladies highlight her ongoing contribution to the team's success, serving as a reminder of her undeniable talent and determination.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n10 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n35 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n37 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 1711,
  "scraped_at": "2026-02-14T02:01:16.459221",
  "_text_extracted": true
}