{
  "article_id": "cc472a1b6e45",
  "url": "https://metro.co.uk/2025/10/26/arsenal-vs-crystal-palace-predicted-lineup-today-confirmed-team-news-24519413/",
  "title": "Arsenal vs Crystal Palace : Predicted lineup today and confirmed team news",
  "date": "20251026T083000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eberechi Eze scored the winner against his former club as Arsenal beat Crystal Palace 1-0 on Sunday to extend their lead at the top of the Premier League table.\nPlaying against the Eagles for the first time since his £67.5million summer transfer, the England international found the back of the net with a beautiful half-volley in a tense encounter at the Emirates.\nIt was the south London side that started the better, Jean-Philippe Mateta proving to be a handful as Oliver Glasner’s side played with their trademark energetic counter-attacking.\nIsmaila Sarr and Daniel Munoz on the right side both tested David Raya, while the Gunners struggled to break down a stubborn defence and when they did, Leandro Trossard’s effort was comfortably saved by Dean Henderson.\nAs has so often been the case, it was a set-piece that found the back of the net for Arsenal, as Declan Rice’s free-kick was headed into the path of Eze to score his first Premier League goal for the club.\nThat gave the home side some much needed confidence going into half-time and though William Saliba was forced to come off at the break, that didn’t deter them.\nBukayo Saka was denied a tap-in at the far post before Gabriel Magalhaes struck the crossbar from a corner, with Henderson beating away Rice’s rebound.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPalace grew back into the game but chances were at a minimum thanks to resolute defending and smart goalkeeping from Raya, with Mikel Arteta content to see out the narrow win.\nMore Trending\nSaturday’s surprise defeats for Liverpool and Chelsea were a welcome boost for Arsenal, as was Manchester City’s 1-0 loss at Aston Villa.\nAs a result the Gunners are now four points clear at the top of the table after nine games, with fans dreaming that this year might really be their year.\nRelive all the action from the Emirates with Metro’s matchday blog\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nFollow El Clasico\nThat concludes our coverage of Arsenal vs Crystal Palace. There is one more Premier League game this weekend as Everton host Tottenham.\nAlternatively, if you want to follow all the action from Real Madrid vs Barcelona, check out our El Clasico LIVE blog.\nArsenal five points clear\nThree points for Arsenal and their afternoon gets even better – Man City have lost to Aston Villa.\nThe Gunners now have a five point lead at the top of the Premier League. Bournemouth are second after beating Forest 2-0.\nFull-time! Arsenal 1-0 Crystal Palace\nNot Arsenal’s best performance of the season but it’s enough to get the three points.\nPalace never recovered from going behind and Eze has increased his new club’s advantage at the top of the Premier League!\n90+5 mins: Arsenal 1-0 Crystal Palace\nUche does well to outmuscle Lewis-Skelly on the flank but his cross is straight at Raya. Seconds remain…\n90 mins: Arsenal 1-0 Crystal Palace\nSIX minutes added on.\nGlasner is going all out. Lerma, Sosa, Uche on. Mitchell, Wharton, Munoz off.\n87 mins: Arsenal 1-0 Crystal Palace\nThe whole of the Emirates applauds Eze as he’s subbed off for Lewis-Skelly.\nPalace have been on top and Arteta wants to see this win out now.\n83 mins: Arsenal 1-0 Crystal Palace\nConcern for Arteta here as Rice goes down and receives some treatment and he can’t continue. Merino replaces him.\nAnd there’s a Premier League debut for Hincapie who replaces Calafiori\n80 mins: Arsenal 1-0 Crystal Palace\nLet off for Palace as Lacroix chests the ball down perfectly for Gyokeres but the defenders manage to stop him before he can get a shot away.\nUp the other end, Nketiah surges forward and finds Mateta who wins a corner.\nGuehi gets his head on the delivery but its over the bar.\n75 mins: Arsenal 1-0 Crystal Palace\nAnother change for Palace. Hughes replaces Kamada.\nThe Eagles are starting to come back into the game but aren’t showing the quality needed in the final third. Story of their season.\n71 mins: Arsenal 1-0 Crystal Palace\nFirst sight of goal for Palace in the second-half as Munoz sends in a good cross for Nketiah but it’s a smidge high and Raya is just about able to claim it.\n69 mins: Arsenal 1-0 Crystal Palace\nGoal? No!\nA dangerous corner is sent in toward several Gunners at the far post. Gabriel gets the last touch but it’s just gone wide.\nThe defender collided with the post and looks in pain but is continuing for now.\n66 mins: Arsenal 1-0 Crystal Palace\nA second sub for Arsenal as Saka is replaced by Martinelli.\nA quiet game for the winger today.\n64 mins: Arsenal 1-0 Crystal Palace\nIt’s taken a while but Arsenal have their first corner of the game.\nRice to take… doesn’t beat the first man. Arteta will not be happy with that…\n60 mins: Arsenal 1-0 Crystal Palace\nPalace need to make a change and do. Pino is off for Nketiah.\nCan he haunt his old club just like Eze?\n59 mins: Arsenal 1-0 Crystal Palace\nTrossard nearly gets the second as he gets in behind the defence. He knows he can’t beat Henderson from a tight angle so puts it across goal for saka but Palace just about clear it in time.\nArsenal look much, much better this second-half and the Eagles are struggling to contain them.\n50 mins: Arsenal 1-0 Crystal Palace\nSo close to 2-0!\nThey win a free-kick on the edge of the box as Munoz accidentally handballs. Its played short and Gabriel heads it onto the bar.\nThe rebound isn’t cleared and Rice thumps it goalward but Henderson saves well before Saka curls one just wide of the post!\nSaliba subbed off at half-time\nWe’re back underway at the Emirates.\nOne change for Arsenal at the break as Saliba is replaced by Mosquera. That is a surprise and the Gunners will be hoping its not injury related.\nAround the grounds\nPlenty of goals elsewhere so far this afternoon and Arsenal fans will be delighted to know that Man City are trailing at Villa Park.\nHere are the other half-time scores:\n- Aston Villa 1-0 Manchester City\n- Bournemouth 2-0 Nottingham Forest\n- Wolves 2-2 Burnley\nHalf-time! Arsenal 1-0 Crystal Palace\nNot the most entertaining 45 minutes you’ll ever watch but the Gunners won’t care too much.\nThey have the lead through Eze’s wonderful finish but they’ll want more after the break.\nPalace were the better team in that half but has that goal knocked their confidence? A big team talk from Glasner is needed.\n45 mins: Arsenal 1-0 Crystal Palace\nTwo minutes added on for the first-half.\nArsenal looking more confident now.\nMORE: Jamie Carragher says Arsenal star is the ‘most influential player in the Premier League’\nMORE: Grimsby stunned Manchester United but Brentford will end their Carabao Cup run\nMORE: Matheus Cunha lifts lid on Ruben Amorim’s mood before Man Utd’s winning run",
  "word_count": 1222,
  "scraped_at": "2026-02-14T01:59:14.382727",
  "_text_extracted": true
}