{
  "article_id": "cc55f5614dbc",
  "url": "https://www.westmeathexaminer.ie/2024/06/06/james-maddison-and-curtis-jones-cut-from-englands-euro-2024-squad/",
  "title": "James Maddison and Curtis Jones cut from England Euro 2024 squad",
  "date": "20240606T154500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "James Maddison and Curtis Jones cut from England’s Euro 2024 squad\nBy Simon Peach, PA Chief Football Writer\nJames Maddison and Curtis Jones have left the England camp after being informed they will not be going to Euro 2024.\nThe pair were selected by Gareth Southgate as part of a 33-man training group gearing up for this summer’s tournament in Germany.\nMaddison was introduced as a 61st-minute substitute in Monday’s 3-0 friendly win over Bosnia and Herzegovina at St James’ Park, where uncapped Jones was an unused substitute.\nThe midfield duo will not be involved in Friday’s send-off friendly against Iceland, having been informed they will not be part of the 26-man final squad submitted later that evening.\nThe Football Association said in a statement: “James Maddison and Curtis Jones have departed the England camp, having been told they are not part of our final Euro 2024 squad.\n“We thank them for being an important part of our pre-tournament preparation.”\nMaddison, who went to the 2022 World Cup but did not make an appearance and has won seven caps in total, admitted he was “devastated” to be left out and felt he could have brought “something different” to the squad.\nHe wrote on social media: “Devastated doesn’t quite cut it. Trained well and worked hard all week but if I’m honest with myself, my form for Spurs when coming back from injury in the second half of the season probably wasn’t at the levels I had set which gave Gareth a decision to make.\n“I still thought there would be a space for me in a 26 man squad as I feel I bring something different & had been a mainstay in this whole qualifying campaign for Euro 2024 in Germany but the manager has made the decision and I have to respect that.\n“I’ll be back, I have no doubt. Wishing the boys all the luck in the world out in Germany, unbelievable group and lads that I literally call some of my best friends. I genuinely hope football comes home.”\nThere were 27 players involved in training on the eve of the Iceland match, with Real Madrid midfielder Jude Bellingham the only one yet to link up with England following his Champions League final win.\nAnthony Gordon was able to train after missing Monday’s match against Bosnia through injury, but Lewis Dunk, Harry Maguire and Luke Shaw followed individual programmes on Thursday.\nSouthgate has until 11pm on Friday to submit his final squad to UEFA, with the 26-man selection scheduled to be announced on Saturday morning.",
  "word_count": 428,
  "scraped_at": "2026-02-14T02:01:16.443686",
  "_text_extracted": true
}