{
  "article_id": "cc6703da3b79",
  "url": "https://thepeoplesperson.com/2025/10/06/how-mason-mount-has-become-a-vital-cog-in-amorims-system-299767/",
  "title": "How Mason Mount has become a vital cog in Amorim system - Man United News And Transfer News",
  "date": "20251006T223000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mason Mount opted to move to Manchester United in the summer of 2023 from Chelsea, hoping to reignite his career at the Theatre of Dreams.\nFans were initially excited about his arrival, especially since he had won the Champions League and the FIFA Club World Cup with the Blues. The Red Devils desperately needed that winning pedigree in the squad after years of struggle.\nIn a summer where Declan Rice moved to Arsenal and Jude Bellingham joined Real Madrid, the Red Devils’ decision to sign Mount soon came back to haunt them. The Englishman was handed the fabled No. 7 shirt at Old Trafford, but it weighed heavily on his shoulders.\nMount endured an injury-riddled debut campaign, registering just one goal and one assist from 20 games. It was a sign of things to come, with the 26-year-old managing only 26 appearances last season, racking up three goals.\nA lack of identity\nWhile injuries were his bane, Mount’s biggest issue was a lack of identity rising from inconsistent positioning. The player was deployed as an 8 and a 10 under Erik ten Hag, and even as a wide playmaker on occasions, but failed to convince in any of those roles.\nHe appeared to be a misfit in the Dutchman’s system, struggling to cope with the manager’s tactics. Mount soon looked like an expensive flop, another victim of United’s recent poor recruitment.\nTables turned following Amorim’s arrival\nWhen Ruben Amorim took charge of United in November 2024, Mount was a peripheral figure in the squad. But the Portuguese quickly took the player under his wing, showering the Englishman with praise in his press conference.\n“Mason Mount… I have to tell you I love that kid. You can look in his eyes that he wants this so bad. And this is the most important thing for me,” said Amorim.\n“I know he was suffering from injuries, he was not on the pitch, but now he’s trying to stay fit and we hope he can continue to be fit, to show all the talent that he’s shown, for example, in Chelsea.”\nMount would be in and out of the team in the following games before being sidelined with a hamstring injury. When he returned in the final weeks of the season, the Englishman was heavily involved, even featuring in the Europa League final, which United lost.\nIt was clear that Amorim was backing Mount to excel at the Theatre of Dreams.\nTailor-made for the 3-4-3 system\nMount previously operated in the 3-4-3 system under Thomas Tuchel at Chelsea, and is well aware of the requirements of the formation. Amorim’s arrival has thus, worked like a reset button for the Englishman.\nThe Englishman has mostly operated as one of the No. 10s in Amorim’s frontline, and has regained his identity. He now has clear-cut responsibilities, but has also been afforded the freedom to express himself.\nThis season, Mount appeared in seven of United’s eight games, missing the defeat to Manchester City with a knock. He has started four games, and the Red Devils have won two of them.\nHe has also briefly been deployed in the wingback position while also played as a false nine, adjusting his approach to suit the demands of the team.\nA pressing monster\nAmorim’s system demands that every player contribute off the ball, but Mount has taken this responsibility to a whole new level.\nThe Englishman’s relentless pressing has been one of his key attributes and has set the mood for the rest of his teammates, helping United keep their opponents on the back foot.\nTwo of United’s best first-half performances this season were against Arsenal and Burnley, and Mount started both those games.\nThe Englishman’s off-the-ball work has also set him apart from Matheus Cunha, who is another option for the left forward role under Amorim. The Englishman has often dropped deep to take the ball from Casemiro, helping Bruno Fernandes bomb forward.\nMount’s willingness to run has also been a bonus for United during opposition breaks.\nFlourishing under a manager who trusts him\nMount’s struggles with injuries since arriving at Old Trafford have been well documented. The Englishman has missed 50 games for the Premier League giants over the past two seasons, and managed 952 minutes of first team action last season.\nIn contrast, he has already racked up 300 minutes of football this season. Amorim has managed Mount’s load quite well, with the player yet to spend more than 70 minutes on the pitch.\nThis has helped the Englishman maintain his rhythm while keeping his fitness intact. Mount is also playing to his strengths under Amorim, focusing on controlled aggression and trying to be decisive in the final third.\nA masterclass against Sunderland\nMount had one of the best games of his United career over the weekend against Sunderland, where he started in the left forward role. It is his ideal position in Amorim’s set-up, and helps the player find pockets of space in the final third, as well as bring other forwards into play.\nMount featured for 65 minutes, registering an 84% pass accuracy and making three passes into the final third. The Englishman also registered four touches in the opposition box and scored the opening goal in the eighth minute.\nThe former Chelsea man regularly dropped deep to cover for Bruno Fernandes, and his pressing was outstanding as usual. Matheus Cunha, understandably, will be worried. While the Brazilian is a superior attacking outlet, he lacks Mount’s work ethic.\nA team player United desperately need\nWhile the Cunha-Mount paradox will have fans divided, it will be a luxury problem for Ruben Amorim. The Brazilian will be raring to go to prove his worth following the Englishman’s rise, which will help the team as well.\nMount, meanwhile, is unlikely to kick up a fuss if he fails to nail down a place in the starting XI, but one can be assured that he will give his all when on the pitch. His tactical flexibility will also be an asset for the Red Devils as the season progresses.\nMount has become indispensable at the Theatre of Dreams in recent weeks, and it is no wonder that the team play better with him on the pitch. The Englishman is the player Manchester United desperately need at the moment, and he could even turn out to be Amorim’s secret weapon this season.\nFans could be in for a treat if Mason Mount manages to stay fit for the entire campaign.\nFeature image Gareth Copley via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1111,
  "scraped_at": "2026-02-14T01:55:21.384764",
  "_text_extracted": true
}