{
  "article_id": "cc7104a6bfff",
  "url": "https://playingfor90.com/2023/05/08/champions-league-familiar-foes-meet/",
  "title": "Champions League Semifinals : Familiar foes meet again",
  "date": "20230509T081500Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "And then there were four. The semifinals of the 2022/23 UEFA Champions League are upon us. Among the four teams left, three are former winners, while the other is still looking for their first UCL triumph.\nHere is a preview ahead of the two semifinals. We take a look at each team’s path to this stage, how things look for them domestically, their previous experience in this round in the UCL, as well as a prediction as to who will be in Istanbul next month for the final.\nReal Madrid vs Manchester City (first leg 9 May, second leg 17 May)\nThese two are getting quite familiar with each other at this point. A third meeting in the last four UCL campaigns await the two. Once more, a place in the final is on the line.\nReal Madrid (8-1-1 in Champions League this season)\nFor the 32nd time, Real Madrid will feature in a European Cup/UEFA Champions League semifinal. That is more than the three remaining teams combined (27). It seems as if Los Galacticos never get tired of deep runs in the Champions League. This is the 11th time in the last 13 campaigns that Real has reached this stage (at minimum).\nThe defending champions and record holders have the best record in the UCL this season (8-1-1) of the four remaining teams. Their sole defeat came on Matchday 5 of the group stage, where they lost 3-2 to RB Leipzig. They have won all five matches since.\nComing off a Copa del Rey final win on Saturday, Carlo Ancelotti’s side is all but assured a place in the Champions League next season via LaLiga, where they currently sit third with five games to play.\nOf their 31 EC/UCL previous semifinals, Real has won 17. The last time the Spanish side failed to progress from this round was two years ago, where they were beaten by the eventual winners Chelsea. A sixth final in the last 10 years is what Real will be pushing for.\nManchester City (6-4-0)\nFor the third season running, Manchester City finds themselves part of the final four in the Champions League. They are also the only team remaining not to have lost in the competition in 2022/23. Bayern Munich (2029/20) was the last team to lift the UCL trophy while going unbeaten.\nOf City’s six wins in the UCL this term, only one of them has come on the road. That also happened against the other Spanish side Pep Guardiola’s men faced, a 4-0 thumping of Sevilla on Matchday 1. The Cityzens have scored 12 of their 26 goals in the Champions League this campaign in the knockout round.\nLeading the Premier League by 1 point over Arsenal with a game in hand, it is looking likely that City will win their fifth league title in the past six years, and a third on the trot. Add to the fact they have an FA Cup final date with crosstown rivals Manchester United, City is still in for the treble. They are also on a 20-match unbeaten run, winning their last five.\nThis is Man City’s fourth UCL semifinal appearance. Remarkably, two of those three previous three showings came against Real Madrid. On both occasions in which they faced Real in this round, the English club fell to defeat. They won their other UCL semifinal, topping Paris St. Germain in 2020/21, before ultimately losing to Chelsea in the final.\nPrediction\nAcross the eight meetings Real Madrid and Manchester City have had, both clubs have won three apiece, drawing the other two. Real has scored one more goal across the head-to-heads (13 to 12), which goes to show just how tight this matchup has been historically.\nThe situation is eerily similar to 12 months ago. Man City is chasing the Premier League title, while Real has little to play for domestically. The only difference is Los Blancos will not be winning LaLiga this time around. So, the advantage is with Real in this case. However, I see things going differently this time. I am going to tip City to win this tie.\nAC Milan vs Inter Milan\nEvery season, Serie A fans are treated to (at least) two meetings between these storied clubs. Among the biggest rivalries in world football, one could not have asked for a more entertaining Champions League semifinal.\nAC Milan (5-3-2)\nThe last time Milan went this far in a UEFA Champions League season, the Rossoneri went on to win the title (2006/07). In fact, this is only the second time since that 2006/07 triumph that Milan has reached the quarterfinals or further. Now, they have a massive opportunity to reach a 12th UCL final.\nStefano Pioli’s side enters this semifinal showdown on a six-game UCL unbeaten run. They have conceded just twice in that run, keeping a clean sheet in four of their last five outings. Four of their five victories in the competition have come at the San Siro, where they will play both of their semifinals.\nAs things stand, Milan is the only one of the four semifinalists not to be in the top four of their league domestically. Sitting 2 points behind Inter for fourth in the Serie A, this tie could have much more implications than just bragging rights. That in mind, the Rossoneri is unbeaten in their last nine across all competitions, putting them in a rich vein of form heading into the tie.\nMilan has played in six semifinals in the Champions League era, including a matchup against Inter in 2002/03 which they won on away goals (1-1). The only occasion they failed to successfully negotiate a semifinal was against Barcelona back in 2005/06 (the Catalans went on to win that year).\nInter Milan (5-3-2)\nHolding an identical record to their Milan rivals in the Champions League this year, the Nerazzurri is back in this stage for the first time since they last won it in 2009/10. A steady return to the top, Inter is back and looking to make their sixth final in the EC/UCL.\nClinching a spot in the last 16 with a game to spare, Inter has been something of an exciting watch in the UCL this campaign. Since falling to Bayern on Matchday 1, Simone Inzaghi’s men have lost just one match in the competition, also to Bayern on Matchday 6. They have kept six clean sheets in that period, which has played a crucial role in getting them to this point.\nInter is 6-3-1 in their last 10 games across all competitions, winning their last four. They also are fourth in the Serie A with four games to play. Furthermore, they will face Fiorentina in the Coppa Italia final as they look to successfully defend the cup.\nOn the three occasions in which Inter lost in the semifinals of this competition, each time they fell to the teams still alive this term (Real Madrid twice and AC Milan). This is just their third Champions League semifinal (excluding European Cup). Back in 2009/10, the Nerazzurri defeated Barcelona 3-2 on aggregate en route to the title.\nPredictions\nAcross their four head-to-heads in Europe, Inter has never defeated Milan. In 2002/03, Milan prevailed on away goals. Two years later, the Rossoneri triumphed in the quarterfinals, albeit the second leg was a forfeit. Yet, when considering all competitive matches between the two historically, it is Inter who has the edge, 87 to 79 (69 draws).\nWho will be in Istanbul for the final between these two? Inter has won three of the last four matches involving these two. But, I like Milan in this one. More is on the line for the Rossoneri as this could be their last chance at Champions League football in 2023/24.",
  "word_count": 1292,
  "scraped_at": "2026-02-14T02:27:27.338416",
  "_text_extracted": true
}