{
  "article_id": "cc75e08ed264",
  "url": "https://www.nytimes.com/athletic/6258510/2025/04/06/nottingham-forest-wuno-wood-awoniyi-strikers/",
  "title": "Nottingham Forest have just two strikers – they need to sign another this summer",
  "date": "20250406T124500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Taiwo Awoniyi’s contribution to Nottingham Forest’s recent history has been significant.\nHe scored six goals in the final four matches of the 2022-23 season to help Forest survive in the Premier League and avoid an immediate return to Championship.\nThe Nigeria international had been sidelined for almost three months with a groin problem, but pushed hard to return swiftly and play a crucial role in the run-in. Without those goals, they would not be pushing for Champions League qualification.\nAdvertisement\nBy November 2023, the striker had to have surgery to repair the problem, leaving him to face another 10 weeks on the sidelines.\nHe deserves more respect than he got on social media when the news broke that he would not be available to face Aston Villa after suffering a hamstring issue in the final stages of the 1-0 win over Manchester United on April 1. It prompted demands from some fans for him to be moved on.\nBut another striker has to be at the top of Forest’s shopping list this summer. What followed in the 2-1 defeat at Villa Park was a perfect demonstration of why it is imperative Forest add a third natural forward to their squad.\nFor so long this season, the rampaging form of Chris Wood has meant there were long spells when Forest almost did not always require a second striker, never mind a third.\nThe absence of Forest’s 18-goal top scorer has never been felt as keenly as it was in the West Midlands, particularly with Awoniyi missing too.\nForest had 19 shots. Three hit the target. It felt like almost every other effort fell into the same category: a shot fired across goal, narrowly the wrong side of the post. Anthony Elanga, Callum Hudson-Odoi, Elliot Anderson, Neco Williams and Morgan Gibbs-White all had at least one head-in-hands moment, as they watched the ball fizz just wide.\nThe first half was dominated by the home side, as they powered into a 2-0 lead within 15 minutes. Both of Villa’s goals via attacks down the Forest right, with full-back Ola Aina sorely missed after suffering a calf strain.\nNuno Espirito Santo’s key tactical change was to man-mark Villa across the entire pitch in the second half. It was transformative, with Forest having created enough chances to have won the game, never mind take a point, by the final whistle. Of their 19 efforts on goal, 13 came after the interval. Forest’s expected goals (xG) went from 0.44 in the first half, to 1.04 in the second.\nAdvertisement\nBut they had only Jota Silva’s neatly taken turn and shot — angled across goal and, for once, inside the post — to show for their efforts. Murillo again came close to netting a goal-of-the-season contender, but his 25-yard dipping shot bounced off the top of the bar.\nWould things have been different had Wood or Awoniyi been available?\n“We tried to find solutions. But football is about strikers. We miss Chris and we miss Awoniyi, because the way we play, the way we do things, we need a reference-point player,” said Nuno, when asked that question in his post-match press conference. “It is harsh on Elanga, Hudson-Odoi, Jota and Ramon Sosa to do the same job.”\nForest are hopeful Wood will soon return from the hip problem he suffered on international duty with New Zealand. It was not initially thought he would be sidelined for long. They are awaiting the result of further tests to discover how long Awoniyi will be absent.\nIn their absence, Gibbs-White began by playing just behind Elanga and Hudson-Odoi in a 3-4-3 formation. Elanga added to the injury concerns when he was withdrawn as a precaution at half-time and Jota was drafted into the forward line.\nForest looked better for his presence, with his energy and persistence frequently giving Villa a headache. If 33-year-old Wood is not fit to face Everton on Saturday, Jota put on a good audition for a starting role, as Nuno’s side look to maintain their push for Champions League qualification.\nForest did make an unsuccessful £22million ($28.3m) offer for Brentford’s Yoane Wissa in January. Signing him in the summer seems unlikely, given the London club’s valuation of the player is far higher.\nThey will hope the summer window proves to be a more straightforward marketplace in their search for another front man. If they do secure European football for the first time in three decades, the additional fixtures mean the need will be even greater.\n(Top photo: Elanga went off at half-time of the defeat to Villa. Dan Istitene/Getty Images)",
  "word_count": 764,
  "scraped_at": "2026-02-14T02:02:35.586495",
  "_text_extracted": true
}