{
  "article_id": "cc9f070c1d7c",
  "url": "https://advanced-television.com/2024/10/22/viaplay-making-steady-progress-towards-proftiability/",
  "title": "Viaplay  making steady progress towards proftiability  ",
  "date": "20241022T150000Z",
  "domain": "advanced-television.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Viaplay “making steady progress towards proftiability”\nOctober 22, 2024\nViaplay has reported total reported Q3 group net sales of SEK 4,412 million (€386.5m) and total operating income before associated company income (ACI) and items affecting comparability (IAC) of SEK -56 milllion.\nThe Nordic streaming service saw 6 per cent organic sales growth for core operations (Nordics, Netherlands and Select) in the quarter, with reported sales of SEK 4,209 million and operating income before ACI and IAC of SEK -49 million. Total reported operating income stood at SEK 2 million including ACI of SEK 52 million and IAC1 of SEK 5 million. Full-year financial targets remain unchanged.\nIn a press statement, Jørgen Madsen Lindemann President & CEO, said: “We have continued along our path to retransform Viaplay Group into a competitive and value-creating company. As agreed with those who supported our recapitalisation, and together with our key partners, we have rolled out new products that are relevant and right priced for our customers, and we are taking a wide range of actions to control costs and prevent value leakage. We are streamlining our operations to drive efficiency improvements and make the organisation fit for purpose. Where we extend, enhance, or renegotiate partnerships with suppliers and distributors of our content portfolio, we are ensuring that the terms are sustainable and to the long-term benefit of all parties. Where this is not possible, we partner with other suppliers and distributors. There is still much more to be done, but we remain on track and have made no changes to our full year guidance.\nWorld-class motor racing remains a key driver of audience engagement across all our core markets, ranking as the most-viewed content both in terms of unique users and total viewing minutes. The new football season kicked off with the Champions League returning to Viaplay in Sweden, the launch of our new Premier League studio, and the opening games of the Superliga, Europa League, Conference League and NHL. We have a strong Q4 line-up, which will also feature coverage of the Junior Ice Hockey World Championship, Women’s EHF Euro Handball, and FIS winter sports.\nOn the non-sports side, our revised content strategy with its increased focus on non-scripted formats is paying off with higher viewing and return on investment levels. The new seasons of reality formats Paradise Hotel, Robinson and Charter Fever all performed well in Sweden, Denmark and Norway, respectively. The Q4 slate includes new seasons of proven formats like Efterlyst, Lyxfällan and Come Dine with Me, as well as the premieres of new formats such as Summer in Magaluf and Swedish drama The Street Where I Live.\nOur efforts to monetise our unique content portfolio included the pan-Nordic rollout of our HVoD tier on Viaplay. It is still early days, but this competitively priced tier, which includes advertising, has so far attracted new customer segments, led to reactivation by former subscribers, and complemented our existing subscriber base. We have also launched our new premium sports news channel in Denmark, which is available to premium subscribers on Viaplay and as a linear channel through key distribution partners, with whom we have signed new agreements.\nThe measures that we are taking to reduce account sharing were implemented in Denmark, Sweden and Norway in the quarter, and are now active in all of our core markets. It is still early days, but the level of sharing has already decreased, and the majority of former account sharers have retained their subscriptions.\nWe are continuing to discuss with both our current and new distribution partners how we can build long-term and mutually beneficial partnerships based around the popularity of our current content offering and the launching of innovative new products. We have extended and expanded some agreements, found new partners and discontinued other partnerships. This applies to both our content suppliers and distribution partners and we have much more to do in this area.\nThe 6 per cent organic sales growth for our core operations reflected growth in our combined linear and Viaplay subscription revenues, as well as the sale of sports and non-sports content to third parties.\nCombined linear and Viaplay subscription revenues were up 1 per cent organically and driven by price increases and new agreements with partners. Our Viaplay D2C ARPU was up in each of our core markets, and we experienced the usual subscriber churn and return patterns during the summer months when several major sports are also between seasons.\nOur advertising revenues were slightly down, as the growth in our radio and digital advertising revenues did not fully offset the decline in linear TV advertising markets and the impact of the coverage of key sports events on rival channels. The launch of our HVoD offering across the Nordics has increased our digital inventory, and we are focused on accelerating growth in our digital ad sales.\nThe substantial increase in sublicensing revenues was driven by ongoing sales of our scripted formats and the sublicensing of parts of our sports content. This demonstrates our commitment to partnerships that help us maximise the return on our investments.\nCore sales growth, along with our cost reduction efforts enabled us to reduce our EBIT losses year on year and sequentially. The underlying improvement was even better when considering the substantial negative FX effects we continue to face, and the fact that we have sold or closed most of our studios businesses over the past year. We are working to exit our non-core operations as quickly as possible and minimising the adverse cash impact as much as possible.\nWe had net debt of SEK 1,465 million at the end of the quarter, and our free cash flow of SEK -1,523 million was in line with our plan and reflected the usual seasonal content payment patterns.\nOur content offering is gradually becoming more relevant and attractive, as we develop and enhance our storytelling. Our products must be priced right and paid for fairly. Our partnerships must be mutually beneficial. Our culture must reflect our position and our ambition. We are focused on making the improvements that are needed to turn compelling storytelling into strong and sustainable business.\nOverall, we are making steady progress towards our long-term goals of retransforming Viaplay Group back into a successful, competitive, profitable, cash flow positive and shareholder value creating company. Much remains to be done, and this work is led by our smart and engaged people who are boldly changing the way we do things by being constantly curious and challenging convention.”\nOther posts by :\n- Amazon Leo gets approval for 4,504 extra satellites\n- SpaceX gets a portion of India\n- TerreStar wants to build LEO network\n- Musk: “No Starlink phone”\n- Russia accused of eavesdropping on satellites\n- FCC welcomes Musk’s 1m satellite plan\n- Telesat has problems with an LEO\n- Orbital debris a real danger\n- India boosts space budget",
  "word_count": 1144,
  "scraped_at": "2026-02-14T02:25:58.968360",
  "_text_extracted": true
}