{
  "article_id": "ccaa762cae7c",
  "url": "https://motorcyclenews.uk/motogp-manchester-city-marc-marquez-meets-pep-guardiola/",
  "title": "MotoGP & Manchester City : Marc Marquez meets Pep Guardiola | Superbike News - Our Archive Motorcycle News Site",
  "date": "20231227T103000Z",
  "domain": "motorcyclenews.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The eight-time World Champion is joined by Alex Marquez to visit Manchester City Football Club ahead of the British GP.\nWinning is a mentality and ahead of the Monster Energy British Grand Prix, some sporting heroes used to doing just that got chance to come face to face as eight-time World Champion Marc Marquez (Repsol Honda Team) and Alex Marquez (LCR Honda Castrol) met Manchester City manager Pep Guardiola.\nAs well as meeting Guardiola, Marc and Alex Marquez also turned spectator to watch a training session, and then got chance to meet some of the players in a Covid-19 safe environment as two sporting worlds connected.\nPep Guardiola: “We are lucky to have Marc here, and he arrived in the sunshine and normally here it’s foggy or raining! But it was nice to welcome a World Champion like him, have the pleasure of him visiting us and share a few moments. It’s an honour, so thanks for coming.\n“We play with a ball, he is on a bike – of course, that’s completely different but if you want to win, to do something better and raise your standards, raise your level you have to be in the right mindset. When you are Champion many times, you know it’s because you’re something special. Unfortunately he’s been injured but he’s getting better, and I’m sure he’ll extend his career longer and make the people who love the sport happy.\n“We met each other for the first time before the Champions League final in Barcelona, I think in 2011, 2012. For him to visit is an incredible compliment for us.”\nMarc Marquez: “Today I feel really lucky to have this day, to follow Manchester City training from up close, it was impressive to see the way Pep coaches and trains the players. As a big fan of football, it was a pleasure. And it’s impressive where we are and how City are organised, trying to be the best team.\n“Pep Guardiola is one of those people you try to analyse, to learn about him, the way he is, the way he speaks and the way he coaches… he’s a trainer, but for me the way he does it is impressive. It was a nice chat with him and we learned a few things!\n“Passion is the most important thing, and the things you can share between the two: experience, pressure, all these things. We spoke a bit with Pep about these things, and I was very interested to understand how he manages all these things.”\nFor more MotoGP info checkout our dedicated MotoGP News page\nOr visit the official MotoGP website www.motogp.com",
  "word_count": 439,
  "scraped_at": "2026-02-14T02:13:24.769507",
  "_text_extracted": true
}