{
  "article_id": "ccacbcb43c70",
  "url": "https://www.unitedinfocus.com/transfer-news/bryan-mbeumo-has-staggering-wage-demands-for-man-utd-transfer-five-fold-increase-eyed-by-prolific-star/",
  "title": "Bryan Mbeumo has  staggering wage demands for Man Utd transfer , five - fold increase eyed by prolific star",
  "date": "20250604T103000Z",
  "domain": "unitedinfocus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United want to conduct business quickly this summer.\nThat much is already evident with Manchester United confirming the signing of Matheus Cunha from Wolves at the beginning of the transfer window.\nNow, there is more excitement building around summer signings because United are understood to be working on a second summer signing.\nBrentford star Bryan Mbeumo has prioritised a move to United over other Premier League clubs such as Newcastle, Arsenal and Tottenham Hotspur. That means he is willing to turn down teams in the Champions League to move to Old Trafford.\nIt shows that United still have that pull factor even without European football next season, after finishing 15th in the Premier League.\nMbeumo could join a side that has been lacking in the goals department for two seasons. United managed just 44 goals in 38 league matches last term.\nBryan Mbeumo sets sights on 250k deal at Manchester United\nThere was always going to be a catch – one way or another, with this deal, as it all seemed too good to be true.\nMbeumo is expecting a hefty wage increase if he is to leave Brentford this summer.\nThe 25-year-old is keen on a move to Old Trafford and United are still expected to make contact with Brentford over a potential deal.\nHowever, Mbeumo has set ambitious demands for United to match if they are to sign the Cameroon international.\nAccording to The Times, Mbeumo is hoping for a five-fold wage increase to £250,000 a week if he leaves Brentford ahead of the 2025/26 season.\nIt would mark a significant increase on the £50k a week Mbeumo currently earns at Brentford.\nBrentford are said to be asking for a transfer fee of at least £60 million for Mbeumo.\nWith United trying to get rid of Marcus Rashford and Jadon Sancho, who are both on about £300k a week, Mbeumo would become one of the club’s top earners if he gets the salary he wants at Old Trafford.\nMbeumo’s stats suggest he is ready for big move\nAfter spending six years at Brentford, it’s time for Mbeumo to get a move to a big club.\nThe Cameroonian forward’s stats in the Premier League suggest he is ready for the top level.\nWith 20 goals in the Premier League last season, United could be getting their hands on a player with the ability to address the existing problems in front of goal.",
  "word_count": 404,
  "scraped_at": "2026-02-14T01:52:26.348690",
  "_text_extracted": true
}