{
  "article_id": "ccd67ef00a9d",
  "url": "http://www.china.org.cn/2025-11/25/content_118193663.shtml",
  "title": "Big games for Spanish trio in Champions League",
  "date": "20251125T030000Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In Champions League action on Tuesday, Barcelona will travell for a key match away to Chelsea, while Athletic Bilbao has to forget its poor domestic form in a visit to Prague and Villarreal may produce its top domestic form in Europe.\nTwo wins, a draw and a defeat from four games have left Barcelona 11th in the 36-team group, so the five-time champion needs a win away to Chelsea that has the same points, to take a step closer to the top-eight and avoid an extra play-off round in February.\nJulian Alvarez(R) of Atletico de Madrid vies with Alex Baena of Villarreal CF during the LaLiga football match between Atletico de Madrid and Villarreal CF, in Madrid, Spain, Jan. 25, 2025. (Photo by Gustavo Valiente/Xinhua)\nBarcelona travels to London after returning to the Camp Nou with a 4-0 win at home to Athletic on Saturday. Raphinha is back after injury and the Brazilian is likely to play some part on Tuesday night.\nFrenkie de Jong will return to the side after missing out on Saturday due to suspension, while Ronald Araujo has the option of returning in central defense.\nPedri is still out with a muscle problem, but Lamine Yamal's display on the weekend implied he should have few problem with his long-standing groin problem.\nChelsea moved second in the Premier League on the weekend and the game is a good early test of both sides' title credentials.\nAthletic needs to recover quickly from its weekend defeat in Barcelona, and above all cut out the defensive errors which gifted Barca its first three goals in that game, when Ernesto Valverde's side travels to Slavia Prague.\nAthletic is currently a point outside of the play-offs and a win against a rival that only has two draws so far this campaign is absolutely vital to its qualification hopes.\nValverde will bring Gorka Guruzeta back into his side, while Jesus Areso and Aitor Paredes could come into defense, although his options are limited by injuries to Inaki Williams, Benat Prados, Maroan Sannadi.\nMeanwhile, Nico Williams continues to have problems with pubalgia and after starting at the weekend, Valverde may not risk giving his star player two starts in four days. Williams scored the only goal as Athletic beat Slavia Prague in last season's Europa League, but it needed a fine display from goalkeeper Julen Agirrezabala to secure the win.\nVillarreal's domestic form has been outstanding and Marcelino Garcia Toral's side is currently third in La Liga. However, its form in Europe has been very different and the side from the east of Spain has only got one draw and three defeats.\nVillarreal's last game was a painful defeat to Pafos and another setback away to Borussia Dortmund would be a huge setback. Marcelino is likely to make squad rotations to his side with Pape Gueye coming into midfield and Georges Mikautadze giving Gerard Moreno a rest in attack.\nReal Madrid travels to face Olympiakos on Wednesday, looking to end a worrying run of form. Atletico Madrid is under pressure when it meets high-flying Inter Milan in one of the most attractive games of the week in the tournament.",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:03:26.523434",
  "_text_extracted": true
}