{
  "article_id": "cce870958c95",
  "url": "https://www.aol.co.uk/articles/thursday-briefing-city-slickers-reach-043054342.html",
  "title": "Thursday briefing : City slickers reach Wembley while Rangers remain on a Rohl",
  "date": "20260205T063000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thursday’s briefing: City slickers reach Wembley while Rangers remain on a Rohl\nManchester City set up a Carabao Cup final showdown with Arsenal after breezing past holders Newcastle to book their trip to Wembley next month.\nThere was joy too for Rangers as they eased themselves above Old Firm rivals Celtic, whose William Hill Premiership trip to Aberdeen was postponed.\nElsewhere, Cristiano Ronaldo appears to have returned to training after a reported stand-off with Saudi club Al Nassr.\nQuestion Marc\nPep Guardiola wants Manchester City to ask the Football League for permission to play Marc Guehi in their Carabao Cup final showdown with Arsenal.\nThe ineligible Guehi, a January signing from Crystal Palace, had to watch from the sidelines as City beat Newcastle 3-1 at the Etihad Stadium on Wednesday night to complete a 5-1 aggregate semi-final win on a night when fellow new boy Antoine Semenyo could play despite previously lining up for Bournemouth in this season’s competition.\nGuardiola, who acknowledged he did not expect City to be successful, said: “Why should he not play? Why not? He’s our player, we pay his salary, we hired him…\n“We want to ask. I said to the club we have to ask definitely. I don’t understand the reason why he cannot play in the final of the Carabao Cup in March when he has been here a long time…\n“Of course we are going to ask because it’s pure logic. (But) to change the rule, no way. But we will try.”\nGers on a Rohl\nRangers closed the gap on William Hill Premiership leaders Hearts to three points with a 5-1 win over 10-man Kilmarnock.\nAfter the Jambos had lost at St Mirren on Tuesday night to open the door and Celtic’s trip to Aberdeen on Wednesday night was postponed, Danny Rohl’s side leapfrogged the Hoops, but only after taking their time to subdue the lowly visitors at Ibrox.\nCaptain James Tavernier’s fifth-minute penalty set the ball rolling, but it was not until the 59th minute that striker Bojan Miovski drove home a second and new signing Andreas Skov Olsen scored his first goal for the club in the 74th minute after coming off the bench.\nA terrible blunder by Light Blues goalkeeper Jack Butland allowed Greg Kiltie to score a consolation goal for second-bottom Killie, but Rangers substitute Oliver Antman and Mikey Moore struck late to put a sheen on the scoreline.\nHere’s Ronny\nCristiano Ronaldo looks set to return to Al Nassr duty in Friday’s match against Al Ittihad after training with the Saudi Pro League club following his frustration over a lack of transfer activity.\nThe 41-year-old Portugal forward missed Monday’s 1-0 victory at Al Riyadh having featured in every previous league game this season, scoring the opener in last Friday’s victory over Al Kholood, and was not even named in Jorge Jesus’ squad.\nThe Press Association understands Ronaldo was unhappy with the running of the club by Saudi Arabia’s Public Investment Fund, which also owns rivals Al Hilal, Al Ahli and Al Ittihad, amid concerns other teams have been given preferential treatment in the transfer market.\nBut the former Real Madrid and Manchester United star could well have put his concerns behind him and made up with the Al Nassr hierarchy in time to feature in their next match at home to Al Ittihad on Friday after posting a picture of himself on X controlling the ball in training, also including two love-heart emojis in blue and yellow – the Riyadh club’s colours.\nWhat’s on today?\nThe cup action on Thursday comes on the continent with Real Betis hosting Atletico Madrid in the Copa del Rey quarter-finals, Juventus travelling to Atalanta in the last eight of the Coppa Italia and Strasbourg and Monaco meeting in the last 16 of the Coupe de France.\nOn the domestic front, Salford make the short trip to Sky Bet League Two rivals Accrington.",
  "word_count": 652,
  "scraped_at": "2026-02-14T01:53:15.569715",
  "_text_extracted": true
}