{
  "article_id": "ccfc75f68f1b",
  "url": "https://news.yahoo.com/epl-talk-antonio-conte-meltdown-fun-bad-guy-074636987.html",
  "title": "EPL Talk : Conte meltdown great fun , but he the bad guy too",
  "date": "20230320T083000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EPL TALK: Antonio Conte’s meltdown great fun, but he's the bad guy too\nSpurs manager may have sealed his fate with latest rant, but he also has to shoulder the blame with his staid tactics\nEVERYBODY loves Antonio Conte, except Tottenham Hotspur fans. He produces more memes for social media than scoring opportunities for Harry Kane. He’s an entertaining mess of contradictions. What are Spurs supposed to do with this guy?\nClearly, the Tottenham manager seeks an early severance package. With his contract expiring after the season, the Italian only gets a few dollars more if he’s fired now so his theatrical performances are reaching Trump-ian levels of denial and irrational behaviour.\nBorrowing the hair from Tom Cruise and the voice from The Count on Sesame Street, he went full B-movie villain in his press conference, calling everything at Tottenham “unacceptable”. The players’ lack of “fire in the eyes” was unacceptable. Their late collapse against Southampton was unacceptable. The dressing room décor at St Mary’s, the half-team tea and the coach driver were unacceptable. It’s all so unacceptable.\nFor anyone paying to watch his turgid fare, Conte is the most delusional martyr around North London since Jose Mourinho, a man utterly convinced that he’s above all those around him. Like the Czar of Russia in 1917, Conte might have failed to read the room. The mutiny is real. Spurs fans are done with him.\nFor everyone else, he’s a bit of a laugh between the latest Liverpool and Manchester United slumps. His repeated use of the word “unacceptable” alone is worth repeat visits to YouTube.\nIt’s all a giggle until someone gets hurt. And Tottenham supporters are hurting. The neighbours are twisting the knife. With every masterful finish from Gabriel Martinelli and Bukayo Saka, Arsenal turn the blade again, showing what they have become whilst reminding Spurs of what they should be.\nNorth London anticipated an upward trajectory, but it has come from the wrong club.\nConte’s Tottenham finished above Mikel Arteta’s Arsenal last season, but the Gunners forged ahead. Arteta’s long-term commitment to youth development and strategic purchases, built around an established, attacking template leaves the folks at Spurs with a nasty dose of déjà vu. Mauricio Pochettino attempted something similar at Tottenham. He asked for patience and time. He was given the sack. The Tottenham way.\nOr, to be more accurate, the Daniel Levy way, the club chairman and a name noticeably absent from Conte’s recent tirade (the Italian presumably wants his payoff in full). And while Tottenham are never likely to trouble the two Manchester clubs in the transfer market, they can compete with Arsenal for highly prized signatures.\nBut Arteta’s approach to squad additions has been remarkably thoughtful and restrained. Tottenham, as always, continue to treat the transfer market like a drunk ordering doubles for everyone before the pub closes. It’s scattershot, inconsistent and someone usually gets rinsed.\nRant cannot hide boring tactics\nConte can’t go after Levy, obviously. So he raised his voice to castigate those without one. Players are denied a right of reply. They can only make their displeasure known through “dressing room sources”.\nWith no fear of public rebuttals, Conte has been free to savage his players, ridiculing their lack of heart, eyes, fire and anything else borrowed from the Roy Keane Big Book of Psychological Putdowns. Such opaque criticisms are handy in their vagueness. How does one define “fire in the eyes”? How can one know when it’s even present, let alone missing?\nIt’s much easier to focus on the intangible, the internal and the unseen, rather than pay too much attention on what’s measurable and self-evident: i.e. Spurs are dreadful.\nMore in Sports\nThey’re not dreadful in the bottom-of-the-table Southampton sense. On the contrary, the Saints are currently behaving like Cinderella at the ball, dashing from one wealthy participant to another, in a borrowed dress, breathlessly hoping that they can stick around for a little longer. It’s stirring stuff.\nNo, Tottenham are something closer to the Ugly Sisters. They have more money and privilege than most. They could be rather pretty if they complained less about their perceived shortcomings and injustices and made more of an effort. Instead, they are boring, entitled and wearily predictable.\nConte’s love of relentless wingbacks led to Pedro Porro’s arrival in January and the Spaniard was lively enough against Southampton, but Spurs were otherwise flat. They moved in static lines, like rows of plastic players welded together on a fussball table. They cannot press or break or create something on the fly in this formation. They are rooted, with Conte standing at the side, his hands on all the handles, keeping them in line. Rigid.\nKane remains isolated. Richarlison doesn’t fit. And Son Heung-min can only look on in horror at the lines of bodies behind him and the lack of opportunities ahead of him. He’s running out of time. A Ballon d'Or for Asia seems further away than ever.\nDetailed analysis of Tottenham’s recent games are no longer necessary. Opposing managers can take a snapshot of the fussball table in the staff canteen. Spurs adopted the same pattern against Sheffield United in the FA Cup, AC Milan in the Champions League and in recent EPL games and gained nothing. A 15th consecutive season without a trophy is guaranteed. A top-four finish is not a done deal either.\nThat’s the really unacceptable bit for Spurs supporters. Even Buzz Lightyear was capable of falling with style. Tottenham are just falling. Their descent is dull.\nConte continues to behave like a thoroughbred trotting around a knacker’s yard, but disillusioned supporters increasingly see a stubborn one-trick pony, unwilling or unable to adapt to new tactical trends. They also see a hypocrite, a manager that calls for a greater “sense of responsibility” from his players, but not from himself.\nConte has already checked out. He’s currently on a short break in Italy. It’s probably in the best interests of all parties if he stays there.\nNeil Humphreys is an award-winning football writer and a best-selling author, who has covered the English Premier League since 2000 and has written 26 books.\nFollow the new EPL season with the \"Footballing Weekly\" show on YouTube, Spotify and Acast.\nFor more football news, visit our Football page on Yahoo!\nYou can also follow us on Facebook, Instagram, TikTok and Twitter. Also check out our Southeast Asia, Food, and Gaming channels on YouTube.",
  "word_count": 1069,
  "scraped_at": "2026-02-14T01:53:35.636398",
  "_text_extracted": true
}