{
  "article_id": "cd1f45a2221c",
  "url": "https://www.barcablaugranes.com/fc-barcelona-transfer-rumors-news/2023/11/17/23963972/ilkay-gundogan-agent-denies-reports-of-meeting-with-galatasaray",
  "title": "Barcelona midfielder Ilkay Gündogan agent denies Galatasaray rumors",
  "date": "20231117T044500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ilkay Gündogan has been in the news a lot in recent week for reasons not to do with football, and the Barcelona midfielder was once again the topic of a big story in the last few days as a big name in Turkish media reported that the German’s agent had a meeting with Galatasary officials to discuss a possible future transfer before the team’s recent Champions League match against Bayern Munich.\nIlkay Gündogan’s agent denies reports of meeting with Galatasaray\nThe Barcelona midfielder was the center of a big story in Turkish media\nEver since his post-game rant aftet the loss in El Clásico followed by a report of his supposed unhappiness with the club, which was vehemently denied by Gündogan and his wife, there has been a lot of noise about Ilkay’s situation at Barça and there is already talk of a potential exit. This latest report about a meeting with Galatasaray only added more fuel to the fire, but Gündogan’s agent came out to publicly deny the rumors.\n“The news circulated in the press in recent days about Ilkay do not reflect the truth. I did not meet with anyone from Galatasaray before the game against Bayern Munich to talk about Ilkay. There hasn’t been any movement, anyone that has come to us about this topic. I want to make that clear. Ilkay and I do not understand how this news came to light. Ilkay is very happy in Barcelona and focused on achieving his goals there.”\nSource: Mundo Deportivo\nLooks like the Gündogan stories will never stop.",
  "word_count": 260,
  "scraped_at": "2026-02-14T01:48:34.036072",
  "_text_extracted": true
}