{
  "article_id": "cd2046022c70",
  "url": "https://www.67hailhail.com/news/brendan-rodgers-speaks-in-first-press-conference-of-japan-tour-the-test-ahead-for-celtic/",
  "title": "Brendan Rodgers speaks in first press conference of Japan Tour ; the test ahead for Celtic",
  "date": "20230718T113000Z",
  "domain": "67hailhail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Japan Tour is now finally underway. The Celtic players landed in the country yesterday and can now look forward to preparing for the first match against Yokohama F Marinos tomorrow.\nThe tour holds a lot of intrigue for the country with Celtic having six players from the country at the club with five currently in the first-team squad.\nAnd this morning, Celtic manager, Brendan Rodgers has addressed the Japanese media ahead of the 7pm kick-off (11am BST) tomorrow night.\nRodgers said [Daily Record], “Firstly, I would just like to say a big thank you and we’re very, very happy and privileged to be here in Japan.\n“And also to be here playing when we have our Japanese players and to be able to Celtic Football Club to Yokohama here is really special for them and for us.\n“Our preseason is our fitness and we are playing a fantastic team that is coached so well by Kevin [Muscat] and his staff. And it’s the perfect game for us at this stage of our preparation.”\nYokohama F Marinos will give Celtic a good test\nDespite their 1-0 weekend loss to Kawasaki Frontale, Yokohama are still flying high in the J League, second only to Vissel Kobe on goal difference.\nThe Japanese side have lost just four games this season as they bid to retain the J League title. Celtic will have to wary of Brazilian striker, Anderson Lopez who is the league’s top goalscorer so far this season with 15 in 21 appearances.\nYokohama also have three players who are in the league’s top five for assists. Another Brazilian, Yan Matheus has created eight goals, whilst fellow countryman Elber is on seven alongside Japanese midfielder, Kota Mizunuma. [J League]\nSo it does look like Celtic will be in for a defensive test tomorrow morning and it is one that we will have to face without Cameron Carter-Vickers. The defender is still recovering from surgery but is expected to be ready for the start of the new season.\nIf anything, at least we will be able to see who can step into the US defender’s boots and the test against the Japanese side will give us a good indication of where we are in terms of preparing for the season ahead.\nIn other news, Bemz on being left star-struck at the Celtic POTY awards; how the Jota song enhanced his career",
  "word_count": 399,
  "scraped_at": "2026-02-14T02:24:50.287353",
  "_text_extracted": true
}