{
  "article_id": "cd258e34734b",
  "url": "https://www.fourfourtwo.com/features/the-chelsea-squad-exodus-every-player-leaving-staying-or-being-released-this-summer",
  "title": "The Chelsea squad exodus : Every player leaving , staying or being released this summer",
  "date": "20230502T153000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Chelsea squad exodus: Every player leaving, staying or being released this summer\nThe Chelsea squad is perhaps the most expensively assembled mess in football – well this summer, it's going to face major changes\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Chelsea squad is a real mix like nothing in the Premier League. Homegrown talent that rose through the ranks, expensive signings from the continent, free transfers and loan obligations, with some future stars sprinkled in for good measure.\nAnd that doesn't touch on those actually fighting abroad in the Blues' famed \"loan army\", ready to return every summer to any old Airbnb before departing for more temporary accomodation next term. The west Londoners have arguably the most business of any club to conduct this summer, with a whopping 45 players in contention for first-team football next season.\nSo who does the new manager have to rely on? Who's for the chopping board? And whose future is anyone's guess right now?\nThe Chelsea squad in full, with who's staying and going\nEdouard Mendy\nAge: 31\nContract expiry: 2025\nAn emergency signing because Kepa was performing quite so poorly, Edouard Mendy became one of the best goalkeepers in the world under Thomas Tuchel. Now he's out of the side for, err, Kepa.\nBoth Mendy and Kepa have contracts up until 2025, meaning that selling one of them would be ideal. Whether there are any takers, is anyone's guess.\nKepa Arrizabalaga\nAge: 28\nContract expiry: 2025\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe same boat as Mendy, though arguably a bigger symbol of Chelsea's reckless transfer nonsense of recent years. Kepa has actually captained the Blues this season, too, after being deemed not good enough by multiple previous managers.\nIt would never have happened in the Roman era, would it? Upgrading in goal is key for Chelsea but shifting those wages will be difficult. Why, oh, why did they spend so much money on him…\nGabriel Slonina\nAge: 18\nContract expiry: 2028\nA huge talent for the future but far too young to hit the ground running at such a huge club in absolute turmoil. Slonina is still probably due another loan or two.\nWho knows? Maybe Kepa will be out of contract by the time he's ready…\nMarcus Bettinelli\nAge: 30\nContract expiry: 2026\nQuietly sitting on the bench here and there, while the other two keepers take all the flack, former Fulham custodian Bettinelli is at the Bridge for another three years as emergency backup. He looks likely to remain there until his contract ends.\nWesley Fofana\nAge: 22\nContract expiry: 2029\nOne of the biggest defensive talents in the world and a cornerstone for the next manager: as long as he can sort out his injury problems.\nWesley Fofana was a good signing – if a little pricey – but can play in either a back four or a three, making him invaluable to whoever manages the Blues next. Just as well, considering he has another six years on his contract.\nBenoit Badiashile\nAge: 22\nContract expiry: 2030\nImpressive despite being unregistered for the Champions League knockouts, one would imagine that Benoit Badiashile will partner Fofana at the heart of the new Chelsea manager's defence – perhaps with another player between them in the case of using a back three. Next season will be his first full campaign in England after joining in January.\nKalidou Koulibaly\nAge: 31\nContract expiry: 2026\nAfter years of links to the Premier League, Kalidou Koulibaly has been underwhelming to say the least. But he's undoubtedly on big wages and has three more years left to run: finding a buyer may well be hard.\nIt seems as if the Senegalese is set for a sequel season. Unless an offer comes in: you'd image Chelsea would entertain terminating his contract altogether, even.\nTrevoh Chalobah\nAge: 23\nContract expiry: 2028\nTrevoh Chalobah has never let Chelsea down. Long-term, he may not be of the level that Terry, Carvalho or even Cahill reached but he looks like a solid squad player.\nWith that though, he's one potentially to move on. He's rumoured to be on £50,000 a week: one would imagine that there could be interest in him, however. It could all depend on how expendable the likes of Koulibaly will end up being…\nBaba Rahman\nAge: 28\nContract expires: 2024 (currently on loan at Reading)\nNo, seriously: Baba Rahman is still an employee of Chelsea football club. And he will be for another year. Hats off to that agent.\nThiago Silva\nAge: 38\nContract expiry: 2024\nDespite recent comments criticising the new revolving door policy, Thiago Silva is contracted for another year. It seems likely that he will be staying for that final season.\nGiven how vital he's been to Chelsea over the years, the next manager will likely want to keep a leader like this around: but should Silva wish to go elsewhere before retiring, oddly, he might well be more sellable than some players half his age. Chelsea won't actually be gaining much by actively seeking to oust him – so expect him to see out his deal.\nMalang Sarr\nAge: 24\nContract expires: 2025 (currently on loan at Monaco with an obligation to buy under conditions)\nAfter featuring sporadically last season, Malang Sarr was deemed unready and sent on loan to Monaco. With Chelsea buying a Monaco defender in January in Badiashile, it's difficult to imagine that opinion has changed.\nSarr will become a Monagasque permanently, should he play a certain number of games, though that hasn't been revealed. After making 13 league appearances, it's unknown whether he'll return this summer. If he does, he'll likely be shipped back to Ligue 1 once more.\nMarc Cucurella\nAge: 24\nContract expiry: 2028\nHe's failed to hit the heights thus far after Chelsea gazumped Manchester City for his signature… could the Blues offload him to Manchester?\nUnlikely. Marc Cucurella has started a lot in Ben Chilwell's absence, with his ability to play in a back three or wingback being a valuable asset this season. With Mauricio Pochettino looking likely to step in, Cucurella will become his Ben Davies: not a first-choice left-back but a versatile defender capable of stepping in for system changes.\nBen Chilwell\nAge: 26\nContract expiry: 2027\nInjuries have blighted Ben Chilwell's Chelsea career. He might not even be the same player he was back at Leicester City. But as the club's best left-back, he'll be leant on heavily next season.\nThat is, assuming, that Manchester City don't want to buy him. There's potential to raise some funds here, so it can't be ruled out, with Chelsea looking to trim the squad. A smart director would certainly look to sell a player on the cusp of him declining and too many knocks may have had their toll on the England international.\nA sale seems unlikely… but this isn't exactly a predictable football club, is it?\nLevi Colwill\nAge: 20\nContract expires: 2025 (currently on loan at Brighton & Hove Albion)\nLevi Colwill is one of the best left-footed centre-back prospects in the world – so as good as Badiashile is, signing the Frenchman seemed slightly short-sighted in January… especially when Brighton wanted to sign Colwill permanently last summer but were rebuffed by the Blues, who compromised with a loan.\nHe seems destined to go permanently this time, with two years left on his contract, now. One would imagine Brighton will push to sign Colwill once more but there could well be bigger fish circling for him. This is a player who could bring in a lot of money for Chelsea – at which point, it all makes perfect sense to bring in Badiashile, up the price for Colwill and sell an asset for £40m+. Well done, lads.\nLewis Hall\nAge: 18\nContract expiry: 2025\nIt's incredibly difficult fighting for places in the Chelsea side. Lewis Hall appeared in an injury crisis, did sufficiently well at left wing-back… and may never get another chance.\nWith two years left on his deal, the Blues are at a crossroads with the Cobham product. Either they sign him up long-term and loan him or just raise some funds. The latter seems sensible with a buy-back clause.\nIan Maatsen\nAge: 21\nContract expires: 2024 (currently on loan at Burnley)\nIan Maatsen has sparkled at Burnley. You would imagine that they would take him back in a heartbeat.\nLuckily for the Championship champions, Chelsea don't have much of a hand to negotiate with. The Dutch left-back is out of contract next summer, making a sale inevitable. Every little helps.\nReece James\nAge: 23\nContract expiry: 2028\nThe jewel in the crown. The one player that they don't want to let go.\nWith another five years left on his newly-negotiated contract, Chelsea are the ones with the power, should a Real Madrid, Paris Saint-Germain or Manchester City come in for Reece James. Given his connection to the club, he seems unlikely to force a move after missing the Champions League once.\nGive it a couple more duff campaigns and he might be knocking on Todd Boehly's door asking for an exit. Right now though, it seems unthinkable that James will leave.\nMalo Gusto\nAge: 19\nContract expires: 2030 (currently on loan at Olympique Lyonnais)\nSensible, long-term cover for James was going to be key to sort sooner or later. With Malo Gusto joining properly in the summer, the Blues have managed to fix that. Cesar Azpilicueta's and Trevoh Chalobah's futures are in doubt now, though.\nCesar Azpilicueta\nAge: 33\nContract expiry: 2024\nHe's been there for yonks and won everything there is to win. It's likely that next term will be the final hurrah for Dave – though there's no obligation for the next manager to start him much.\nA true leader is needed more than ever right now. Chelsea are lucky he's not leaving now.\nEthan Ampadu\nAge: 22\nContract expires: 2027 (currently on loan at Spezia)\nEthan Ampadu could still be heading out on loan for another three years, you know. Sooner or later, surely someone will make a permanent offer?\nHe likely won't stick around. Chelsea will send Ampadu away on loan once more but would be sensible to sell him and just collect whatever they can for him. They have FFP regulations to satisfy, after all.\nEnzo Fernandez\nAge: 22\nContract expiry: 2031\nEnzo Fernandez is on his first year of eight at Chelsea. he's not been bad so far but hasn't really shown us why he cost nine figures.\nThe World Cup winner perhaps lacks the physicality to be the lone No.6 to build around but he's certainly one for a two-man midfield or right side of a three. He's an excellent first building block for the midfield, however. Now to buy another two or three as good as him – hopefully for what Enzo cost combined…\nN'Golo Kante\nAge: 32\nContract expires this summer\nN'Golo Kante would be one of the first names on the team sheet if everyone was fit. The problem is, he's not often fit these days.\nKante looks likely to leave west London this summer for three reasons. His wages are incredibly high, he won't be willing to accept a short-term deal and he's got a bad injury history. It would be unfortunately for the incoming manager not to have a player of that quality at their disposal – but it doesn't make much sense to extend his contract, either.\nDenis Zakaria\nAge: 26\nReturns from loan to Juventus this summer\nDenis Zakaria has not shown much to make Pochettino or whoever comes in that they should sign him permanently. A handy midfielder signed at a time when cover was necessary, the situation has changed entirely. Back to Juventus, he goes.\nMateo Kovacic\nAge: 28\nContract expires: 2024\nDrawing interest from a number of big teams, there might be a fee to be had, here. Even £20m could be important for balancing the books – especially for a player who's given just about everything he can now for the Blues.\nIf City are interested, however, maybe that tells you something. The next manager is going to need a calm, experienced, tempo-setter in midfield – Chelsea's decision is whether it's worth losing Mateo Kovacic for nothing in order to give their next manager someone who could be key to their midfield.\nConor Gallagher\nAge: 23\nContract expires: 2025\nWith such a lot of interest in Conor Gallagher in January, it seems silly that Chelsea didn't sell in the context of FFP to consider. This will be the penultimate summer to do so.\nIf Chelsea need the money, flogging Gallagher for £40m is a no-brainer. If not, sending him on loan once more and waiting for him to add another £20m could work, too. It seems unlikely that the next manager will make him the cornerstone of a midfield that boasts Enzo Fernandez and Mason Mount, otherwise.\nTiemoue Bakayoko\nAge: 28\nContract expires: 2024 (currently on loan at AC Milan)\nAnother for the \"how the hell is he still contracted there\" pile. Next year will be Tiemoue Bakayoko's final on loan before leaving for nothing. It's not been a fruitful deal.\nRuben Loftus-Cheek\nAge: 27\nContract expires: 2024\nHe's been here and there on loan before becoming a bit-part in the Chelsea squad. Next year, however, his contract comes to an end.\nThere's not much incentive for Ruben Loftus-Cheek to sign another season for a club who have brought in two players in Enzo and Gusto who limit his ability to play in either midfield or right-back. One would imagine from the prolific loan spells that a midtable club would be interested in him for around £20-25m. Losing him for nothing doesn't seem worth it.\nCarney Chukwuemeka\nAge: 19\nContract expires: 2028\nOne of the most exciting players of his age group internationally for England, one wonders just how much game-time Carney Chukwuemeka thought he'd get this season. He's now in one of two camps.\nEither Mason Mount leaves and the next manager builds around the precocious Chukwuemeka on the lefthand side of central midfield – or, much more likely, he goes on loan and hones his craft to fill that role in future years. With five more years on his deal, the latter is sensible.\nCesare Casadei\nAge: 20\nContract expires: 2028 (currently on loan at Reading)\nExtremely well thought of, Cesare Casadei is one for the future, currently at Reading. It seems unlikely that Paul Ince will get the job at Chelsea and want to build around the one player he knows, however.\nAnother loan move feels inevitable. He may be ready by next summer to play a part in the squad, though.\nMason Mount\nAge: 24\nContract expires: 2024\nMason Mount might just be the highest profile and most unpopular sale that Chelsea have made since Eden Hazard. A Cobham graduate, his place in the side has come under question – and he's not looking like signing a deal just yet.\nIf Chelsea can get £60m for him, that represents something, given that they'd lose him for nothing next year. But if Pochettino gets the job, there's not a chance he's telling Boehly and co. to sell a young England international pivotal in a Champions League win from a young age.\nThe Blues need to back down on this one. There are some players you persist with through poor form and Mount is one of those for Chelsea, given that he's homegrown, got that connection with the fans and the very model of what they want to foster at the club. He deserves the deal he wants, rather than something stupidly long-term. Right now, he looks like going – but that could all change with a new manager at the helm.\nTino Anjorin\nAge: 21\nContract expires: 2025 (currently on loan at Huddersfield Town)\nAnother who looks unlikely to ever storm into the first team, Tino Anjorin is now at Huddersfield, having been given a debut under Frank Lampard. He looks set for another loan spell after this one – but if Chelsea can sell him, all the better.\nAndrey Santos\nAge: 18\nContract expires: 2030 (currently on loan at Vasco Da Gama)\nAndrey Santos is 18 and has never played in Europe. It would be bold to bring him back and integrate him into the squad next season, having signed him in January – so don't rule out these owners from doing just that.\nAnother loan move seems sensible, however. He's contracted until the end of the decade: there's time.\nKai Havertz\nAge: 23\nContract expires: 2025\nKai Havertz is an incredibly strange case. He's been the first choice striker at Chelsea since he joined, more out of necessity than being outstanding. His best position is probably just behind the striker – but Joao Felix plays there now, with Christopher Nkunku heavily rumoured for the summer. So… where do you put him?\nIt's likely that the new manager will want to have a go finding out, such is Havertz's technicality – but realistically, selling him wouldn't be a bad thing. If a big club can offer £50m, Chelsea would be wise to cut this experiment short. That doesn't seem like something that's going to happen any time soon, though.\nThe Blues will likely keep Havertz around for another 12 months and have the same conversation next year. Where exactly does he fit?\nMykhaylo Mudryk\nAge: 22\nContract expires: 2031\nPipping Arsenal to his signing sure was fun, wasn't it? Mykhaylo Mudryk hasn't actually delivered anything yet but time is on his side.\nIt wouldn't make sense to loan him out next season. He needs a run of games, to acclimatise to English football and to find his feet. There's a lot of money riding on this one but he's one of the brighter talents that a new manager would be excited to work with, for sure. If not, there's always offloading him to the Emirates Stadium…\nRaheem Sterling\nAge: 28\nContract expires: 2027\nRaheem Sterling has played here and there, not disappointed but not exactly set the Bridge on fire. A year on, he's one of several players in the same boat.\nIf an offer comes in, that would be great: if not, it's not the end of the world to have an established international with considerable experience in the Premier League at your disposal. Sterling might be for the chop next season but he's good enough that he's worth keeping around this time around.\nChristian Pulisic\nAge: 24\nContract expires: 2024\nChristian Pulisic just hasn't been available enough for Chelsea. He's had his moments but with his deal ending next summer, now's the time to cut their losses.\nLuckily, there are plenty of clubs who would jump at the chance of signing America's biggest soccer star. Chelsea may be able to recoup half of the £60m they spent on the Pennsylvanian, which actually wouldn't be too bad a result, considering he's barely played in the last two years. Staying at Stamford Bridge would be more of a shock, right now.\nNoni Madueke\nAge: 21\nContract expires: 2030\nA strange signing, really. Chelsea didn't need Noni Madueke desperately but he'll provide useful cover for the next manager. Sticking around this squad feels like the only option.\nHakim Ziyech\nAge: 30\nContract expires: 2025\nHe very nearly left on loan for PSG in January. It would be a surprise if he was still here next season.\nHakim Ziyech has been fine but nothing more in Chelsea blue. At 30, the time is right to move on. Two years left on his contract means the west Londoners might receive a decent enough fee, all considering.\nOmari Hutchinson\nAge: 19\nContract expires: 2025\nPoached from Arsenal, no one expected Omari Hutchinson to play this season, let alone against Manchester City. No one expects him to play next season, either. A loan is all but certain.\nCallum Hudson-Odoi\nAge: 22\nContract expires: 2024 (currently on loan at Bayer Leverkusen)\nThey could have sold him for £40m to Bayern Munich before he'd even played for the first team. Now, they'll be lucky to get half of that.\nCallum Hudson-Odoi's career has stalled. He needs to get out now with a year left to go and Chelsea would be wise to sell. Unless Pochettino is a huge fan of the winger, it's inevitable that he'll head either to the Bundesliga or a midtable Premier League side for £10-15m, surely?\nJoao Felix\nAge: 23\nReturns from loan to Atletico Madrid this summer\nHe's looked good in patches considering he's not a proper striker and Chelsea don't have a proper striker for him to partner. There were rumours that he could join permanently but surely, there are other holes to fix – especially if Nkunku joins as yet another player in that position.\nIf Diego Simeone leaves Atletico, it's likely that their next boss will want to build around the likes of Felix. Chelsea might be better off asking for another loan deal, should they want the Portuguese that desperately… but it's unclear as to why they would, right now.\nArmando Broja\nAge: 21\nContract expires: 2028\nAfter an awful injury, Armando Broja's only likely option is to stay in the fold. With Chelsea lacking any striker like him, that might be his best chance for minutes next season.\nOne would imagine that his next move could come in January on loan or next summer. Right now, recovery is the only thing on his mind.\nDavid Datro Fofana\nAge: 20\nContract expires: 2029\nHe's not had a lot of time or opportunity to impress but David Datro Fofana could prove to be a valuable squad addition in preseason. Otherwise, a loan seems likely.\nFofana is only 20, after all. Another for the future, next season will depend on how much impresses the new boss over the summer.\nPierre-Emerick Aubameyang\nAge: 33\nContract expires: 2024\nYeah, he's not sticking around, is he?\nPierre-Emerick Aubameyang is the very symbol of everything wrong with Todd Boehly's Chelsea era. Signed for Thomas Tuchel just before Tuchel was sacked, given a few opportunities by Graham Potter and subsequently hung out to dry, left out of Champions League squads and unable to leave in January. What was the point?\nUnlike his Arsenal tenure, you can't exactly blame any of it on him, either. Auba looks like having his contract terminated if he can't actually force a move.\nRomelu Lukaku\nAge: 29\nContract expires: 2026 (currently on loan at Inter Milan)\nChelsea are stuck with a £100m millstone around their necks for three more years. The next manager has a stark decision and it doesn't involve selling Romelu Lukaku, since that isn't realistic.\nHe could be brought into the fold as the answer to Chelsea's striking options. He's done it across his career, especially in the Premier League and he's not a bad forward to have at your disposal. More likely though, he'll be heading out on loan again once more.\nIt's sad that Lukaku hasn't worked out for the Blues this time. Maybe this is a conversation we'll be having for another two years, given the length of his contract.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 4051,
  "scraped_at": "2026-02-14T01:50:29.456143",
  "_text_extracted": true
}