{
  "article_id": "cd2c0448e26f",
  "url": "https://www.uefa.com/uefachampionsleague/news/0286-194ebf918fa5-fdad65c9e4af-1000--quarter-final-draw-live-from-12-00-cet/",
  "title": "UEFA Champions League quarter - final , semi - final and final draws : When are they , where are they , who is involved ? | UEFA Champions League",
  "date": "20240315T081500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA Champions League quarter-final, semi-final and final draws: When were they, where were they, who was involved?\nFriday, March 15, 2024\nArticle summary\nWhen were they? Which teams were involved? When were the fixtures? All you need to know about the 2023/24 UEFA Champions League quarter-final, semi-final and final draws.\nArticle top media content\nArticle body\nThe 2023/24 UEFA Champions League quarter-final, semi-final and final draws took place at 12:00 CET on Friday 15 March 2024.\nQuarter-final and semi-final draws\nQuarter-finals\nArsenal vs Bayern München\nAtlético de Madrid vs Borussia Dortmund\nReal Madrid vs Manchester City\nParis Saint-Germain vs Barcelona\nSemi-finals\n1: Atlético de Madrid / Borussia Dortmund vs Paris Saint-Germain / Barcelona\n2: Arsenal / Bayern München vs Real Madrid vs Manchester City\nCan teams from the same country play each other in the Champions League quarter-finals?\nYes, it was an open draw. There were no seedings and no country protection, so clubs could face opposition from the same national association and teams they previously came up against in the group stage.\nHow did the Champions League quarter-final draw work?\nEight balls containing the names of the quarter-finalists were placed in a large central bowl and shuffled. The first team drawn plays its first match at home, against the second team drawn. The procedure was repeated with the remaining balls in the bowl to complete the quarter-final pairings.\nHow did the Champions League semi-final draw work?\nFor the semi-final draw, four balls containing slips of paper marked 'Winners of quarter-final 1' to 'Winners of quarter-final 4' were placed in a large central bowl and shuffled. The first and second balls drawn determined the first semi-final pairing, the first ball drawn representing the home team for the first leg. The procedure was repeated with the remaining balls in the bowl to complete the semi-final pairings.\nWhy was there a draw for the Champions League final?\nA third draw was held to determine the 'home' side in the final for administrative reasons. This will be the winners of semi-final 1.\nHow could I watch the draw?\nThe draw was streamed live on UEFA.com.\nWhen do the quarter-final and semi-final games take place?\nQuarter-final first legs: 9/10 April 2024\nQuarter-final second legs: 16/17 April 2024\nSemi-final first legs: 30 April/ 1 May 2024\nSemi-final second legs: 7/8 May 2024\nWhere is the 2023/24 final?\nThe 2023/24 Champions League final will take place at London's Wembley Stadium on Saturday 1 June. Known as the 'Home of Football', Wembley has hosted seven previous European Cup finals – more than any other stadium.",
  "word_count": 428,
  "scraped_at": "2026-02-14T02:10:47.914140",
  "_text_extracted": true
}