{
  "article_id": "cd46b60ed44d",
  "url": "https://metro.co.uk/2026/02/01/john-terry-makes-huge-chelsea-claim-thrilling-west-ham-win-26648326/",
  "title": "John Terry makes huge Chelsea claim after thrilling West Ham win | Football",
  "date": "20260201T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Terry confidently declared ‘Chelsea are back’ after their thrilling Premier League comeback win over West Ham.\nLiam Rosenior was on course for his first league defeat as Chelsea boss as West Ham took a commanding 2-0 lead at Stamford Bridge.\nJarrod Bowen gave the visitors an early lead and West Ham were sensing a huge win to boost their survival hopes when Crysencio Summerville scored a second before half time.\nBut Joao Pedro got Chelsea back into the game shortly after the break and Marc Cucurella’s diving header saw the hosts equalise with 20 minutes remaining.\nDropping points to relegation-battlers West Ham still looked likely until Chelsea captain Enzo Fernandes scored an injury-time winner to send Stamford Bridge into frenzy.\nThe win was Chelsea’s sixth in seven games since Rosenior replaced Enzo Maresca, with the new manager’s only defeat coming against Arsenal in the Carabao Cup.\nClub World Cup holders Chelsea were fifth when Maresca departed but Rosenior has taken the Blues back into the top-four while also securing the club’s place in the knockout stages of the Champions League.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nReacting to Chelsea’s comeback against West Ham, Stamford Bridge legend Terry said on TikTok: ‘What a result for Chelsea, what a result.\n‘We are back, we are back. Chelsea are back. What a result and how good are late goals, especially when you come from behind.\n‘Chelsea are back, West Ham are gone. The most important thing is Chelsea are back. Great result boys, well done.’\nRosenior hailed Chelsea’s ‘heart and spirit’ after the impressive West Ham turnaround, saying: ‘That’s football – it was a game of two halves.\n‘West Ham were by far the better team in the first half. Our energy and quality wasn’t there. We were lethargic, made tired decisions, our shape wasn’t good enough and they deserved to be 2-0 up.\n‘But all of the things I asked of the players in terms of reacting to setbacks, I saw.\n‘Tactics went out of the window – it’s about heart and spirit, fight and to hear the Stamford Bridge atmosphere, the fans got behind the players. Hopefully that can kick-start us into a really good end to the season.’\nMore Trending\nBlues goalscorer Cucurella added: ‘At half-time we spoke. In the end, it’s about our mentality and the desire we showed in the second half.\n‘We are very happy. [Liam Rosenior] said it’s about us. If we go to press, want the ball, play with confidence, we will get the chances to win.\n‘We have very good players and a very good team, since the start of the second half we showed a lot of energy and desire. If we play with this energy we are able to win at lot of games.’\nChelsea return to action on Tuesday night, hoping to overturn a one-goal deficit in their Carabao Cup semi-final against Arsenal.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Mikel Arteta dealt injury blow as Arsenal star is ruled out for ‘sustained spell’\nMORE: Premier League responds to Arsenal star Noni Madueke’s request after Leeds thrashing\nMORE: Chelsea make opening transfer offer to sign £43m defender",
  "word_count": 590,
  "scraped_at": "2026-02-14T01:55:32.911231",
  "_text_extracted": true
}