{
  "article_id": "cdb40fb9d3ab",
  "url": "https://gamerant.com/playstation-outspends-xbox-marketing/",
  "title": "PlayStation Outspends Xbox for Marketing , Says Exec",
  "date": "20240720T183000Z",
  "domain": "gamerant.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Summary\n- Xbox EMEA region struggles with marketing funds compared to PlayStation.\n- Sony's strong marketing presence in EMEA poses a challenge for Xbox's market share growth.\nXbox's marketing chief for the EMEA (Europe, Middle East, and Africa) region has lamented the lack of marketing funds from Microsoft, stating that the trillion-dollar company finds itself being outspent by rival PlayStation. This development comes at an interesting time, as recent reports have suggested that Microsoft may be considering winding down marketing for Xbox consoles entirely in the EMEA region.\nIt's not much of a secret that the Xbox Series X/S consoles aren't selling as well as the PlayStation 5. Ever since the current-generation systems launched back in 2020, the PS5 has regularly outsold the Xbox Series X/S by a substantial margin in most major regions. Even sales trends in the United States, which has historically been a strong territory for Xbox, have been increasingly favoring the PS5. This has led to some consternation about Xbox's commitment to future hardware iterations, even though Microsoft Gaming CEO Phil Spencer has assured players that a next-generation Xbox console is in the works.\nPhil Spencer Fuels Rumors About an Xbox Handheld Console\nWith a simple comment, Phil Spencer further fuels speculation that Xbox is planning to announce a handheld console sometime soon.\nThe trepidation comes from a recent report that alleged Microsoft could scale back marketing efforts for Xbox consoles in the EMEA region, which is currently dominated by its direct competitor, PlayStation. While the source of this claim was a tip and therefore not very reliable at the time, some recent comments from Xbox's EMEA marketing lead Michael Flatt might lend it some credence. In an interview with Marketing Week, Flatt remarked that from \"a funding point of view,\" his division has to work \"really hard\" to compete with PlayStation in the EMEA.\nXbox's EMEA Division Isn't \"Blessed\" With Marketing Funds Like PlayStation\n\"They're blessed with marketing funds that we're just not able to enjoy,\" said Flatt. The executive went on to clarify how Xbox takes a \"more fiscally responsible approach\" to marketing, stating that it has to be \"scrappy and tenacious\" to have funds allocated to itself that would've likely gone elsewhere. Sony, meanwhile, has always fired on all cylinders when it came to marketing in the EMEA. For instance, PlayStation's long-running collaboration with the UEFA Champions League football competition has allowed the company to advertise the PS5 in front of hundreds of thousands of spectators at every match.\nFlatt's comments aren't very confidence-inspiring for Xbox fans in the EMEA, and could hint to Microsoft slowly losing interest in spending marketing funds on a region where Xbox consoles are commercially underperforming. However, this pattern isn't exclusive to the EMEA, as Xbox hardware sales have been declining on a global scale. Microsoft doesn't report sales figures for the consoles, but educated analyst estimates place the Xbox Series X/S between 25-30 million units sold, which is approximately half of the PS5's install base.\n- Brand\n- Microsoft\n- Original Release Date\n- November 10, 2020\n- Hardware Versions\n- Xbox Series X\n- Original MSRP (USD)\n- $499",
  "word_count": 523,
  "scraped_at": "2026-02-14T01:48:56.592520",
  "_text_extracted": true
}