{
  "article_id": "cdb5696a4c9e",
  "url": "https://metro.co.uk/2023/05/30/chelsea-mauricio-pochettino-makes-decision-over-denis-zakaria-buy-option-18871202/",
  "title": "Chelsea : Mauricio Pochettino makes decision over Denis Zakaria buy option | Football",
  "date": "20230530T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mauricio Pochettino does not view Chelsea’s on-loan midfielder Denis Zakaria as part of his plans for the club and he will return to Juventus at the end of next month, according to reports.\nThe Switzerland international arrived at Stamford Bridge last summer on deadline day, with the west London club forced into the transfer market after N’Golo Kante sustained a hamstring injury.\nZakaria had only joined Juve seven months earlier for a fee of around £7.5million, having had just six months left on his contract with previous club Borussia Monchengladbach.\nThe 26-year-old showed some flashes of promises, netting against Dinamo Zagreb in the Champions League and delivering a particularly impressive display against Premier League champions Manchester City.\nBut four different Chelsea coaches – Thomas Tuchel, Graham Potter, Bruno Saltor and Frank Lampard – all used him sparingly and he struggled to make a mark in west London.\nIn total, Zakaria played just seven times in the league, twice in Europe and made two further appearances in the Cup competitions for a combined total of 11 outings – though he was hampered by some injury niggles.\nNevertheless, it appears Pochettino feels much the same way as his predecessors and does not intend to keep Zakaria at the club.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAccording to transfer expert Fabrizio Romano, the new Chelsea manager has already informed the club’s recruitment team that Zakaria does not feature in his plans.\nAs part of the loan move, Chelsea had the option to sign the midfielder permanently for a fee in the region of £30million, but the Blues will not be triggering their buy clause.\nInstead, Zakaria will return to Juventus at the end of June and assess his options, having found himself on the fringes of the first teams at both Juve and Chelsea since leaving Gladbach.\nMore Trending\nPochettino needs to trim a heavily bloated Chelsea squad – particularly with no European football on offer next season – and has already decided to ditch Joao Felix as well.\nThe Portuguese attacker showed plenty of flashes of his skill and creativity, but ultimately Potter and Lampard both struggled to find a position for him and Pochettino does not want to fork out £88m to sign him permanently – which is what Atletico Madrid are still demanding.\n‘Yesterday we had the news that the new Chelsea manager does not [want] Joao Felix,’ Atletico president Enrique Cerezo revealed on Tuesday. ‘He’ll come back here and we’ll see. We don’t have anything planned.’\nChelsea could also lose contract rebel N’Golo Kante, who is yet to pen fresh terms, while Mateo Kovacic and Mason Mount could be sold, leaving Pochettino in dire need of midfield reinforcements.\nMORE: Chelsea ready to offload 12 players as Mauricio Pochettino starts summer clear out\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 532,
  "scraped_at": "2026-02-14T02:00:19.988714",
  "_text_extracted": true
}