{
  "article_id": "cdcaff9f7dcf",
  "url": "https://www.fourfourtwo.com/news/is-nottingham-forest-full-back-ola-aina-injured-premier-league-injury-update",
  "title": "Is Nottingham Forest full - back Ola Aina injured ? Premier League injury update",
  "date": "20250417T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Is Nottingham Forest full-back Ola Aina injured? Premier League injury update\nThe race for Champions League football is on but Nottingham Forest may be without one of their key men when they face Tottenham\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nNottingham Forest full-back Ola Aina is a doubt for their upcoming game against Tottenham Hotspur, but all hope is not lost.\nFew would have expected Nuno Espirito Santo to be eyeing up Champions League football with Forest at the start of this season, but that’s exactly where they are as the final day draws closer.\nThey come up against a stuttering Spurs side on Monday night, following Ange Postecoglou suffering another damaging league defeat, this time against fellow strugglers Wolverhampton Wanderers.\nIs Ola Aina injured for the Spurs game?\nThe London-born Nigeria international is having a season to remember at Forest, having notched two goals and provided an assist in his 30 starts this season.\nBut the 28-year-old’s progress was stopped in its tracks when he went down off the ball against Manchester United and had to receive treatment on the pitch before hobbling off.\nWith Nuno ruling him out for ‘a while’ with a calf injury, Aina then missed following meetings with Aston Villa and Everton.\nBut speaking ahead of the Spurs outing, the Forest manager did provide some hope of a return for his star full-back.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nSpeaking to NottinghamshireLive, Nuno said: “For the next one [against Spurs], we hope.\n“It is going to be assessed day by day. I don’t know how many hours he spends at the training ground receiving treatment, so we are trying to have him back as soon as possible.”\nWhether he’s available to start, come in off the bench or even make the matchday squad remains to be seen.\nIsaac Stacey Stronge is a freelance football writer working for FourFourTwo, Manchester United and Football League World. He has been a season ticket holder at Stockport County throughout the Hatters’ meteoric rise from the National League North to League One and is a die-hard Paddy Madden fan.",
  "word_count": 461,
  "scraped_at": "2026-02-14T02:02:35.575287",
  "_text_extracted": true
}