{
  "article_id": "cdcdccc18c66",
  "url": "https://thepeoplesperson.com/2025/05/22/bullish-ruben-amorim-fires-defiant-statement-after-man-uniteds-europa-league-final-collapse-vs-tottenham-hotspur-294377/",
  "title": "Bullish Ruben Amorim fires defiant statement after Man United Europa League final collapse vs . Tottenham Hotspur - Man United News And Transfer News",
  "date": "20250522T001500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United boss Ruben Amorim has insisted he is now more confident than ever that he is the right man to turn things around at Old Trafford, despite his side’s crushing 1-0 defeat to Tottenham Hotspur in the Europa League final.\nBrennan Johnson’s first-half goal was all Tottenham needed to win the trophy and secure their spot in next season’s Champions League.\nTottenham have also brought an end to their 17-year wait for a major piece of silverware.\nMeanwhile, United will be without European football next term and even worse, the Red Devils could finish in 17th place in the Premier League table this season, capping off a truly calamitous campaign.\nQuestions will undoubtedly be asked of Amorim and his role at the club moving forward.\nSpeaking in his post-match press conference, the Portuguese coach told reporters he is willing to step down – without seeking compensation – if the club’s hierarchy and fans no longer want him in charge.\nHowever, in his interview with TNT Sports, Amorim expressed was defiant, stressing that he is sure he has what it takes to restore United to their past glories.\nThe 40-year-old said [as quoted by BBC], “We suffered a goal. In the second half we were in control of the game we had situations to score.”\n“I think we started quite well for the first five or seven minutes but then lost a bit of control of the game. We then suffered a goal but then the rest of the game we had clear chances to score.”\n“We started the second half quite well so change just for people to see that I change something is not my way of doing things. When I felt we needed a different player I put on a different player.”\nAmorim continued, “I am confident I am still the guy, more than in the beginning. I know the patience of the fans will be really short in the next season but I guarantee you I will not quit and I will not go away.”\n“I am really confident.”\n“I know the club, I know what it means to coach this club and I understand what this team needs. If they say it is better to change I will leave in the next day.”\n“I am really confident in myself to continue to do the job if the board wants me.”\nUnited are back in action on Sunday when they host Aston Villa in their final Premier League game of the season.\nFeatured image Justin Setterfield via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 428,
  "scraped_at": "2026-02-14T02:26:38.634315",
  "_text_extracted": true
}