{
  "article_id": "cdddf8c1e84c",
  "url": "https://www.france24.com/en/live-news/20240419-roma-s-interrupted-match-at-udinese-to-be-finished-on-april-25",
  "title": "Roma blast  hardship  as interrupted Udinese match to be finished on April 25",
  "date": "20240419T214500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Roma blast 'hardship' as interrupted Udinese match to be finished on April 25\nMilan (AFP) – Roma criticised on Friday Serie A's decision to stage the final 18 minutes of their match at Udinese, which was suspended after defender Evan Ndicka collapsed on the pitch, on April 25 as their domestic and European commitments pile up.\nIssued on: Modified:\nThe two teams will reconvene at 2000 local time (1800 GMT) that evening in Udine to complete last weekend's fixture as Serie A applied a regulation that states interrupted matches must be finished within 15 days of play being halted.\nBut Roma wanted the match be finished in mid-May as after facing Bologna on Monday they then travel to Napoli next weekend -- a match which is yet to be given a kick-off time -- and face the first leg of their Europa League semi-final with Bayer Leverkusen on May 2.\n\"Roma's European results and four consecutive (continental) semi-finals contributed more than most other clubs to Italy's UEFA ranking and as a result to the fifth slot in next season's Champions League,\" said Roma in a statement.\n\"Despite this, Serie A president Lorenzo Casini made today an unfair decision which forces Roma to play Bayer Leverkusen at a disadvantage. This is a clear backwards step for the whole of Italian football.\"\nRoma said it would fight what it perceived as an \"unjustified hardship\", but did not specify how it would do so.\nThe capital club currently sit fifth in Serie A, which is now officially the division's final Champions League spot but both fourth-placed Bologna and Napoli are rivals for a place in Europe's top club competition.\nSerie A had said in its earlier statement that \"the date of Napoli v Roma will as a result be set taking into account of Roma's needs\".\nNdicka collapsed with chest problems in the 70th minute of Roma's fixture at Udinese, which was locked at 1-1 when referee Luca Pairetto decided to suspended play.\nThe Ivory Coast international was initially feared to have suffered a heart attack but Roma later said that tests revealed \"a thoracic trauma with minimal left pneumothorax (trapped air between the lung and chest wall)\".\nNdicka was well enough on Thursday to celebrate Roma's 3-1 aggregate triumph over AC Milan in the Europa League quarter-finals, appearing on the Stadio Olimpico pitch with his teammates during the post-match festivities.\n© 2024 AFP",
  "word_count": 401,
  "scraped_at": "2026-02-14T02:07:51.325514",
  "_text_extracted": true
}