{
  "article_id": "ce052359e15e",
  "url": "https://www.orissapost.com/manchester-city-sign-midfielder-mateo-kovacic-from-chelsea/",
  "title": "Manchester City sign midfielder Mateo Kovacic from Chelsea",
  "date": "20230628T063000Z",
  "domain": "orissapost.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester: Manchester City completed the signing of Mateo Kovacic from Chelsea on a four-year contract for 25 million pounds ($31.9 million) plus add-ons.\nThe 29-year-old Croatia midfielder, who was part of Chelsea’s Champions League-winning team of 2021, becomes City’s first signing since it won a treble of trophies last season.\nPep Guardiola’s team captured the Premier League title, Champions League and FA Cup, becoming only the second English team to achieve that feat.\n“This is a brilliant move for me, and I cannot wait to get started with City,” Kovacic said. “Anyone who has watched this team under Pep knows how good they are — for me, they are the best in the world.\n“The trophies they have won are clear for all to see, but they are also the best footballing side out there. To be joining this squad really is a dream for any footballer.”\nKovacic will add depth in midfield with the signing coming one day after Ilkay Gundogan ended his trophy-laden seven-year stay with City by agreeing to join Barcelona on a free transfer.\nKovacic previously played for Inter Milan and Real Madrid. He was part of the Madrid squad that won three successive Champions League titles from 2016-18.\nHe is part of what is expected to be a slew of departures from Chelsea this summer.\nN’Golo Kante (Al-Ittihad) and Kalidou Koulibaly (Al-Hilal) have left to play in Saudi Arabia, while Kai Havertz and Mason Mount remain targets for Arsenal and Manchester United, respectively.\nKovacic made 227 appearances for Chelsea and scored six goals. As well as the Champions League, he won the Europa League, Super Cup, and Club World Cup.\n“He can play as a 6 or an 8, has plenty of experience at top-level clubs and he understands the Premier League. It was a very simple decision to bring him to City because he has the tactical and technical qualities we are looking for in a midfielder,” said Txiki Begiristain, City’s director of football.\n“He is someone we have monitored for a very long time and always we were impressed whenever we watched him.",
  "word_count": 350,
  "scraped_at": "2026-02-14T01:56:02.405508",
  "_text_extracted": true
}