{
  "article_id": "ce0cd18431d2",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-news-coverage/75948/hugo-ekitike-on-settling-at-liverpool-and-galatasaray-challenge",
  "title": "Hugo Ekitike On Settling at Liverpool and Galatasaray Challenge",
  "date": "20250930T154500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Following a summer that saw Liverpool smash their record transfer signing twice bringing in first Florian Wirtz from Bayer Leverkusen for £116M and then Alexander Isak from Newcastle for £125M, it has instead been new striker signing Hugo Ekitike who has made the greatest impact in the early going.\nHugo Ekitike On Settling at Liverpool and Galatasaray Challenge\nHaving settled quickly at his new club, striker Hugo Ekitike will be the focal point in attack against Galatasaray.\nIll-judged shirt-off celebration against Southampton that earned him a suspension via second yellow aside, it has been a perfect start to life at Liverpool for the 23-year-old French international, who already has five goals and an assist in eight appearances for his new club and will be expected to start tonight against Galatasaray.\n“I think I’ve settled well,” Ekitike noted ahead of kickoff. “Obviously I’ve had a good adaption. The boys, the staff, everybody in the club has helped me so much to adapt to this new environment. I would say everything is going well but you know how football is, you need to keep going and stay consistent.\n“To say I knew I would perform like this, no—but it is what I expected. I work for this. Obviously I’m happy that it has worked and I want to keep going and do even more. When I first played Champions League with PSG I was young, on the bench, I was more watching. Now it’s my time to be someone who can help the team.“\nLiverpool will need Ekitike at his best on the road against a Galatasaray side that are currently a perfect 7-0-0 domestically to start the 2025-26 season—though a 5-1 defeat in the Turkish club’s European opener against Frankfurt two weeks ago does perhaps hint at the differences between the leagues.\nEven if the Turkish Super League isn’t amongst Europe’s elite, though, Galatasaray’s Rams Park is known as one of Europe’s tougher venues. And their squad has plenty of recognisable names from Mauro Icardi to Leroy Sané to İlkay Gündoğan and Victor Osimhen. It is, not to put too fine a point on it, a very strong group.\n“Every game is different but I think it is going to be a tough game here in Galatasaray,” Ekitike added. “Playing away from Liverpool is more difficult and it’s the start of the season, so we still have to find our connections and to adapt to each other. I think that in time it will always be better but I’m confident.”",
  "word_count": 419,
  "scraped_at": "2026-02-14T02:26:56.617595",
  "_text_extracted": true
}