{
  "article_id": "ce4558bce052",
  "url": "https://www.arsenal.com/news/every-word-mikels-pre-aston-villa-presser",
  "title": "Every word from Mikel pre - Aston Villa presser",
  "date": "20230217T114500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Before heading up to Birmingham to prepare for tomorrow's game against Aston Villa, Mikel Arteta held his pre-match press conference at London Colney.\nThe boss discussed the reaction to the defeat to Manchester City, gave injury updates and the challenges of playing at Saturday lunchtime after Wednesday night.\nHere is everything he had to say:\non Thomas Partey’s injury:\nWe have to assess him again today. He has some muscle discomfort and we have to see how he is.\non fitness updates for Emile Smith Rowe and Gabriel Jesus:\nEmile will be training today and if he’s fine, he’ll be in the squad. Gabi is still not there.\non the fresh challenge of being second in the league table:\nThat’s an opportunity. We’ve talked about it for a few months now, the position that we’re in, the way the team is playing, and all the right things that we have to continue to do to earn the right to be there. We've seen where the level is, we want to be at that level and we are on that journey together. There were a lot of positives to take from [the Man City] match.\non whether he thinks our squad can match Man City week after week:\nI've seen it with my eyes in two games, but the level of efficiency has to be extremely good every single ball to beat them at the end. We are on a journey, we want to be there again. The team is highly motivated because just in case you didn't see it on the pitch or didn't feel it after the game because of the result, I showed them yesterday.\non whether Champions League football is the minimum:\nThe minimum is that today they train exceptionally well.\non whether individual errors were why we lost:\nYou have to give credit to a team when they beat you, but when you analyse the game again, I think we lost it.\non the atmosphere in the stadium on Wednesday:\nOur fans were extraordinary in the game, supporting and inspiring the team. Obviously, there was an incident at the end that nobody's going to tolerate in our stadium and the club is investigating that issue.\non our results for the past three games:\nYou want to get maximum points and we didn't in the last three games. We have to look at ourselves. We have to be more efficient; with the amount of play and situations we have made, we haven't generated enough points and that's down to us. We have to improve that because we want to win more games.\non whether a quick turnaround will hope us move on from the City game:\nThat's what we want to do. The schedule is a bit unusual, but is what it is. The players are highly motivated for tomorrow's game because we want to perform well and win the game.\non facing Unai Emery:\nHe will always put up a very difficult test. He’s a very good manager and I have huge respect for what he's done in every club and the success that he'd had.\non the team’s high level of motivation after Wednesday’s defeat:\nBecause they realised on the pitch, and how they feel on the pitch when they are coming up against the best team that this league has had in decades - and how they performed against them. I sensed a lot of belief. They were hugely disappointed not to get the result. But not that long ago, we were looking there and saying: “guys, we are so far - we still need to improve” and now we are closer. But it wasn’t enough because they were much more efficient than us.\non how big the gap is between us and Man City:\nI don’t know - in terms of points we don’t know. The feeling I had on the pitch was in many situations we matched them and in many situations we were better than them but, in the boxes, they were far better than us.\non what’s giving him belief in his players:\nThat when it comes to a [match] like the other day against that team, who I know pretty well, and the players are able to produce what they produced, it gives me a lot of belief that we are going in the right direction.\non how impressed he was by Jorginho on Wednesday:\nHe’s really good - he’s come into the team and earned the respect of everybody. You see his leadership, his understanding of the game, how he’s coaching everybody. I think he had a really good game.\non if Leandro Trossard deserves to start a game soon:\nHe’s had an impact every time he’s been on the field, so he’s an option.\non if it’s frustrating to play on Wednesday night and then on Saturday lunchtime:\nIt’s very difficult to play tomorrow [but] we will have full energy. It’s not a worry - I want the players to be in the best possible mindset and physically ready to get that challenge going.\non if the players can be at their physical best having played on Wednesday night:\nThey are young - they have a lot of energy!\non if the pressure of the title race could take its toll on inexperienced players:\nIf you want to be at the top, you have to go and [experience] it. Looking at what they did the other day, it gives me a lot of encouragement to think they are ready.\non if he’s tempted to freshen up the team on Saturday:\nEvery week, we consider the best possible option for players and where they are in terms of performance, mentally and physically and for sure tomorrow we’ll do it again.\non if teams playing more direct against us is a compliment to the way we’ve played this season:\nSometimes it’s the opponent’s gameplan. Sometimes they have a completely different gameplan that they have to adapt during the game. Possession is very important, depending on where it is and what you produce with it. We’re a team that wants to have the ball and we want to dominate games.\non whether he will continue to play out from the back:\nIn the right areas against the right players pressing - yes. If not - no.\non whether it is better to be the hunter rather than be hunted in the title race:\nI want to have as many points as possible as early as possible. It’s not about looking at the table, it’s about performing every single day and winning matches. What you’ve done so it doesn’t matter - at the end of the day at the end of May you have to have a certain amount of points to win it.\non his thoughts on going to Aston Villa:\nVilla Park is a very difficult place to go, that’s for sure.\non whether we struggle against low blocks:\nHow many low blocks have we faced this season? 16 - and we have won a lot of those games and we have merited at the end to have won most of those games but then it is about efficiency. When they block everything and the ball doesn’t go into the net it’s great if you win 2-0 then you played the low block really well. It is always going to depend on certain things, there are always things that we have to improve and our efficiency in the box has not been as good as it was to win football matches and tomorrow it will have to be really high to beat them.\non the reaction in the room when the squad watched the Man City game back:\nMore clarity, just in case they had any doubts.\non if the players will be more motivated after losing on Wednesday:\nI think so.\non needing our previous title winners to step up:\nYou need players with those experiences that can guide, lead, give them reassurances and show them the path of how it gets done. That’s what we’re talking about, if you want to win the league, you have to dig deep. Sometimes you have to lose one or two matches and merit to win it and then lose it, sometimes you have to win it in the 96th minute, sometimes you have to play with 10 men. You have to win in many different contexts.\non if he felt we were always going to suffer at some point:\nI cannot show you now, but I could show you in pre-season because I knew what was coming!\non if the league should review their schedules to avoid tight turnarounds between games:\nWell there are certain rules with the Champions League where if you play on a Wednesday night, you cannot play on a Saturday. I think that should apply to any competition.\non if that has been discussed in Premier League manager meetings:\nYes, that’s why I think the changes were made towards the Champions League teams especially, but following the same principle you’re talking physiologically that it is very difficult to turn around in that period to get the best outcome and reduce the anger there is for players.\non if he’ll have to make changes against Villa:\nWe knew that we would be playing within that timeframe, and that’s not an excuse.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1591,
  "scraped_at": "2026-02-14T01:59:41.707421",
  "_text_extracted": true
}