{
  "article_id": "ce5d3b0d525b",
  "url": "https://menafn.com/1107474983/Italy-Promises-To-Take-Risks-Against-Ukraine-With-Euro-2024-Spot-At-Stake",
  "title": "Italy Promises To Take Risks Against Ukraine With Euro 2024 Spot At Stake",
  "date": "20231123T044500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Italy Promises To Take Risks Against Ukraine With Euro 2024 Spot At Stake\nItaly beat North Macedonia 5-2 on Friday to overtake Ukraine to move to second in the group. Italy needs only a draw to secure automatic qualification for Euro 2024.\n“We are more positive under Spalletti,” said Federico Chiesa who scored twice.“We take a few more risks in defence.”\n“We want to play against Ukraine with this mentality.”\nThe Euro 2020 champions have failed to qualify for the past two World Cups and a loss to Ukraine would see the war-torn Eastern European nation qualify for the Euros, leaving Italy facing a play-off tournament in 2024 to have a shot at defending their title.\nWhile keeping a clean sheet would book the Azzurri a ticket to Germany for next year's tournament, Spalletti's attack-minded side have pledged not to sit back and defend like Italian teams of the past.\n'Beauty of attacking football'\nDespite a flattering scoreline against North Macedonia, the two-time European Champions left the door open for its bogey team.\nLeading 3-0 at half-time, Italy conceded two second-half goals to Jani Atanasov, allowing North Macedonia back into the match.\nThe attack-minded approach is typical of Spalletti, who masterminded a fearsome offensive machine at Napoli last season as they won the Scudetto for the first time since the days of Diego Maradona.\nWinger Chiesa was dangerous throughout and scored a first-half brace. He was not concerned about his side's defensive performance.\n“The important thing is that we won” said Chiesa.\n“We are more positive under Spalletti, and that means we take a few more risks in defence. We showed that we wanted to dominate the play and we deserved to win.”\nChiesa praised Spalletti's attacking approach saying conceding goals was“part of the beauty of attacking football”.\nChiesa promised more of the same on Monday.\n“We want to play against Ukraine with this mentality and win in Leverkusen.\n“We must not miss this goal.”\n'A great Italy'\nItaly's second-half wobble was also of little concern to Spalletti after Friday's match.\n“It was a great Italy, both in terms of character and the quality of the game.\n“I expected us to suffer, to freeze up and try to hang on. Instead we got back to charging up the pitch, putting moves together and scoring goals. Along with the two that we did score, there were several other big opportunities.”\nSpalletti called the match against Ukraine a“final”.\n“Whoever has the better of the match will go to the Euros,” he said.\nUkraine's journey through the qualifiers has been nothing short of remarkable, considering the team has had to take home games on the road due to the ongoing conflict.\nDespite playing almost 2,000 kilometres from Kyiv, Ukraine are likely to enjoy a home atmosphere in Leverkusen.\nThe German Federal Office for Migration estimates that more than one million refugees have fled Ukraine for Germany since February 2022.\nUkraine's Shakhtar Donetsk have played their home Champions League fixtures in Hamburg this season, attracting large crowds to the city's Volkspark Stadium.\nUkraine has lost just one of seven fixtures dating back to March, although that defeat did come at the hands of Italy who beat Serhiy Rebrov's men 2-1 in Milan.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 594,
  "scraped_at": "2026-02-14T02:20:16.284707",
  "_text_extracted": true
}