{
  "article_id": "ce63a964a7b1",
  "url": "https://www.teamtalk.com/liverpool/exclusive-top-two-summer-centre-back-targets-revealed-klopp-still-reeling-for-real-madrid-mauling-fri",
  "title": "Liverpool exclusive : Top two summer centre - back targets revealed as Klopp forced into major rethink over defensive meltdowns",
  "date": "20230224T184500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool exclusive: Top two summer centre-back targets revealed as Klopp forced into major rethink over defensive meltdowns\nTrusted reporter Ben Jacobs has given us the lowdown on Liverpool’s summer transfer business and the likelihood of Jurgen Klopp revamping the centre-back position, as well as his struggling midfield.\nThere is expected to be a high turnaround of players at Anfield this summer after a hugely disappointing season that sees the Reds currently eighth in the Premier League, out of both domestic cups and struggling badly to stay alive in the Champions League.\nIndeed, Tuesday evening’s debacle against Real Madrid pretty much summed up their season so far.\nKlopp’s men were flying in the first leg of their last-16 clash on Merseyside, going 2-0 up early on. However, a combination of slack defending and a woeful Alisson error allowed the cup holders to reel off five goals without reply.\nThe likes of Joe Gomez and Joel Matip have already been deemed not good enough to be regular starters, while Virgil van Dijk does not quite look like the same player who was once such a dominant force.\nA fully fit Ibrahima Konate is still to return, but it’s no secret that Klopp is looking at defenders and midfielders as he looks to make the Reds contenders again.\nAnd speaking to Jacobs, the transfer insider revealed the main two centre-backs who are on Klopp’s radar.\nHe said: “The first thing to say about Liverpool is that they don’t change their targets or strategy based upon one bad result.\n“So the need to revamp the defence has been there for some time, but midfield is the priority. And if Liverpool can turn around their domestic season and qualify for the Champions League, then they may well be able to have a productive transfer window in terms of spending, but midfield is the top priority.\n“They will be pushing hard for Jude Bellingham. And if they succeed, then naturally, that will be a big chunk of money much like they did with Cody Gakpo in January, and that can affect other areas.\n“We therefore have to look at Liverpool’s window, in terms of the financials, born potentially out of a lack of Champions, League football, and a top marquee signing, like Bellingham, and then kind of work out what is remaining within their budget.\n“That’s not to say that Liverpool can’t spend big, but every club will almost have to have two strategies come the summer window, one with Champions League football and one without and because in previous seasons, Liverpool have always been able to near automatically budget with Champions League football and bigger spending.\n“If they miss out on Champions League football, it will be interesting to see how that affects their overall spending.\n“So a midfield revamp will still be a big priority for Liverpool, the top one, but defence is definitely up there in terms of names that Liverpool will be looking to sign.”\nCroatia stars tops Klopp’s wanted list\nAnd with that leaky defence, it’s no surprise that a World Cup star is potentially on the agenda for the Reds, even if Josko Gvardiol will cost them a pretty penny.\nJacobs added: “I think creeping into the conversation increasingly, is the centre-back position from Liverpool’s perspective, and trying to bring in somebody that can, you know, ultimately help now, but at the same time, is a little bit younger, and can be bred for the future, as well.\n“And there’s a few names therefore to consider, with Josko Gvardiol the pricier center-back name that Liverpool, along with many top European clubs have looked at.\n“They’ve sent scouts to him many, many times, along with the likes of Chelsea and Manchester City have taken a look as well. And he very obviously impressed at the World Cup.\n“He’s been linked with a big money move for quite some time and there is a buyout clause they’re at just under £100million.\n“So the 21-year-old has that sort of value in the market set. I don’t see a club like Liverpool triggering that clause, but it helps inform the market value and what makes Gvardiol so special.\n“He is a left-footed center-back, very composed on the ball, technical, physical, and a pretty cool mentality as well. And this is why many clubs including Liverpool, think that he could perform on the big stage.\n“He’s also a center-back who has tremendous passing accuracy, composure on the ball and is not afraid to play a direct pass.\n“All of these qualities that Gvardiol has are attracting him to top, top teams, and we wait and see whether Liverpool are in the mix.”\nBellingham budget could have impact on Liverpool spending\nMuch depends, however, on whether Liverpool can capture Bellingham and how much they will need to spend to do so, with Jacobs adding: “Like I said before finding budget for Gvardiol and Bellingham would be very, very difficult for Liverpool without Champions League football, but we know that Gvardiol is absolutely one name that they are looking at.\n“And then the other one, Evan Ndicka, who is going to be an absolute bargain for somebody because as things stand at the moment, he’ll be available from Eintracht Frankfurt on a free transfer.\n“I think Spurs are one to watch as well, as we know that they want a centre-back as well. But Ndicka is out of contract at the end of the season.\n“Also left-footed and another one to keep a close eye on as far as Liverpool are concerned. Because he also has that modern center-back attribute and profile and has drawn a lot of attention because you know Liverpool will always look for value in the market. And as things stand Ndicka is exactly that.\n“I also don’t even think that the wages would be particularly high either by Premier League standards. So you know, we have to wait and see on that one now. But I think that centre-back after midfield, or in conjunction with midfield, will be very important for Liverpool.”\nThe Reds are back in action on Saturday evening when they take on Crystal Palace in the Premier League.\nREAD MORE: Fallen Liverpool star Klopp knows is finished tipped to be biggest casualty in eight-man clear-out",
  "word_count": 1051,
  "scraped_at": "2026-02-14T01:55:49.892178",
  "_text_extracted": true
}