{
  "article_id": "ce6c22a72f45",
  "url": "https://www.dailybreeze.com/2024/06/29/euro-2024-switzerland-knocks-out-defending-champ-italy/",
  "title": "Euro 2024 : Switzerland knocks out defending champ Italy",
  "date": "20240630T001500Z",
  "domain": "dailybreeze.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "BERLIN (AP) — Defending champion Italy crashed out of the European Championship after losing to Switzerland 2-0 in the last 16 on Saturday.\nGoals in each half from Remo Freuler and Ruben Vargas gave the Swiss their first win over their southern neighbor for 31 years and set up a quarterfinal against England or Slovakia in Düsseldorf on July 6.\nItaly’s elimination means the titleholder has gone out in the last 16 for the third successive Euro after Portugal in 2021 and Spain in 2016.\nSwitzerland hadn’t beaten Italy since 1993, and notched only a ninth win from 62 attempts.\n“We showed from the first second that we really wanted to win this game. The spirit is incredible,” Switzerland midfielder Fabian Riedler said. “Everyone is happy. Everyone runs for the other one.”\nHis team dominated in terms of possession, shots, attacks and passes.\nBy the time Italy responded in the second half, the aggressive Swiss defense was able to deal with it. Coach Murat Yakin’s gameplan worked to perfection and he repaid the faith his federation showed him when there were calls for him to go in November.\n“Football gives so much to us, gives so much to us in our lives. I don’t know how to pay back football for everything it’s given me and my life,” Yakin said. “I’ll always remember tonight.”\nAll Italy counterpart Luciano Spalletti could do was put his hands out in exasperation on the sideline.\n“The team were timid in terms of the intensity of the game. We didn’t do a good job. We weren’t able to maintain a high level of intensity,” Spalletti said.\nFreuler deservedly broke the deadlock in the 37th minute when he set up Vargas’ cross with his first touch and smashed it in with his next.\nItaly goalkeeper Gianluigi Donnarumma, who had earlier denied Breel Embolo in a one-on-one, produced a flying save to deflect Fabian Riedler’s free kick onto the post before the break.\nBut the second half had barely started before Vargas curled a shot from the edge of the penalty area inside the top right corner.\nItaly was immediately more proactive and Switzerland defender Fabian Schär was relieved to see his attempted headed clearance rebound off the post minutes later.\nFans tried to get a Mexican wave going through the Olympiastadion but the Italian fans were not in the mood.Their team pushed forward in search of a way back only to find none. Gianluca Scamacca went closest when he hit the post but looked offside in any case.\nSpalletti spoke of his team’s “ beautiful suits ” before the Spain game, but this time, after substitute Mattia Zaccagni’s last-second equalizer against Croatia, he was unable to pull a rabbit out of Italy’s hat.\n“If we failed, we failed. And we failed because of my team selection. And in terms of the way I conducted myself, it’s never down to the players,” Spalletti said.\nGerman 2, Denmark 0\nToni Kroos gets another game before he retires. Germany’s Euro 2024 title challenge looks more real than ever.\nOne of the most decorated players in modern soccer with six Champions League titles and a World Cup, Kroos wasn’t flashy as Germany beat Denmark 2-0 on Saturday, but he was a calm, assured presence holding the midfield together.\nKroos already won the Champions League with Real Madrid this season. Now he’s three games away from one final trophy and could face his Madrid teammate, Spain’s Dani Carvajal, in his next game.\nSome fans already have their eyes on the final in the German capital and sang about heading to Berlin as Germany saw out the win.\nJust like another Real Madrid great, Zinedine Zidane in 2006, Kroos is ending his storied career at a major tournament in Germany. He came out of international retirement in February for one last tournament. Each game Germany plays in the knockout stage could be the last of his career.\nGermany weathered a thunderstorm, hail and stubborn Danish resistance Saturday to ensure the 34-year-old midfielder will play again. Germany faces either Spain or Georgia in the quarterfinals July 5.",
  "word_count": 684,
  "scraped_at": "2026-02-14T02:13:55.806736",
  "_text_extracted": true
}