{
  "article_id": "ce9901e4c88f",
  "url": "https://www.caughtoffside.com/2024/08/17/west-ham-snubbed-target-saudi/",
  "title": "West Ham transfer news : Tammy Abraham is off to Saudi Arabia",
  "date": "20240817T063000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s been one of the best transfer windows that West Ham have ever had, and yet it could still end in disappointment for Tim Steidten and Julen Lopetegui.\nNot content with already landing the likes of Luis Guilherme, Niclas Fullkrug, Crysencio Summerville and others, technical director, Steidten, was believed to be searching for more talent to bring to the London Stadium before the end of the transfer window.\nThe Julen Lopetegui era gets underway on Saturday evening in earnest, with Unai Emery’s Aston Villa the first visitors of the season.\nEmery has seen his side go from a shell of a team under Steven Gerrard, into the Champions League under the Spaniard’s direction in around 18 months, and if Lopetegui can have a similar impact in East London, he’ll be lauded by the Hammers faithful.\nWest Ham set to lose out on Tammy Abraham\nThe first look at what’s to come will offer a reasonable guide as to how Lopetegui likes his teams to play football, and even though the squad will take time to gel, Irons fans are likely to be making their minds up quickly about whether a return to the West Ham way is on the cards or not.\nAS Roma Live were just one of many outlets to link Tammy Abraham with a move back to London, however, it seems that the former Chelsea and Aston Villa ace might not be heading back to the English capital after all.\nAccording to La Repubblica, the 26-year-old has actually been persuaded to move to Saudi Arabia and, as such, has snubbed the offer of joining the Lopetegui revolution.\nWith a move for Villa’s Jhon Duran also thought to have collapsed, it leaves West Ham with less than two weeks to land another striker.",
  "word_count": 295,
  "scraped_at": "2026-02-14T01:57:35.684086",
  "_text_extracted": true
}