{
  "article_id": "ce9ce39cdb77",
  "url": "https://www.teamtalk.com/arsenal/gunners-big-strides-towards-sealing-incredible-raid-london-rivals-arteta-lulls-edu-crazy-offer",
  "title": "Arsenal take big strides towards sealing incredible raid on London rivals as Arteta lulls Edu into crazy offer",
  "date": "20230222T171500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal take big strides towards sealing incredible raid on London rivals as Arteta lulls Edu into crazy contract offer\nArsenal are positioning themselves right at the front of the queue for a spectacular summer signing that will see them poach one of world’s elite stars from their Premier League rivals.\nMikel Arteta’s side have enjoyed an excellent campaign to date. As things stand, they are top of the Premier League with a two-point buffer on Manchester City. The Gunners also boast a match in hand.\nIf they can maintain their excellent run of form, they could land a first Premier League crown in 19 years – and make Simon Jordan, for one, eat his words.\nWhether they land the Premier League title or not, it is safe to say that the 2022/23 campaign has exceeded expectations for Arsenal. Indeed, at the start of the season, their first aim will have been to secure enough points to break into the top four.\nAnd having seemingly blasted through that target, it surely will not be long now before Arteta’s troops can celebrate a return to the Champions League.\nWith UCL football on offer, the club are busy making plans to further strengthen their squad in the summer window.\nAs a result, the Gunners have seemingly leapt to the front of the queue to sign in-demand West Ham star Declan Rice.\nThe England international appears destined to leave the London Stadium this summer after rejecting a new deal. That arrangement is currently due to expire in summer 2024, though West Ham do have a one-year option on that.\nHowever, Rice has made it clear he wants to test himself in the Champions League.\nAs a result, Manchester City, Manchester United, Chelsea, Real Madrid and Barcelona are all reportedly on his trail.\nREAD MORE: Arsenal confirm midfield deal and prepare ‘mega-money offer’ to sign Serie A bruiser\nArsenal ready massive contract offer for Declan Rice\nWidespread reports, though, claim a move across London to Arsenal is now Rice’s preference.\nAnd trusted reporter Ben Jacobs, speaking to Caught Offside, claims the Gunners are ready to do whatever it takes to sign the midfielder.\n“Arsenal’s midfield priority will be Declan Rice and West Ham are resigned to losing him,” Jacobs said. “David Moyes has been quick to argue if Rice leaves it should be for a British-record fee. But suitors are hoping for a fee of £70-80m. This is ultimately because Rice’s contract expires in summer 2024.\n“But Chelsea’s big-spending could inflate the market and thus Rice’s price. You can understand why selling clubs, especially for top-tier central midfielders, will point to Enzo Fernandez’s £107m fee. They all intend to ask for something similar.\n“I still think Rice will go for cheaper than that, but how much so will depend on whether West Ham get a bit of a bidding war.\n“Chelsea also really want Rice. Manchester United and Newcastle United can’t be ruled out either. But I understand Rice’s preference is to stay in London. That won’t be a deal-breaker, but Arsenal and Chelsea can certainly use it to their advantage.\n“Rice also wants Champions League football. Whether or not that means instantly remains to be seen. But Arsenal can clearly use this to their advantage given where they are heading. Rice has also spoken glowingly about Arteta.\n“So it’s probably fair to term Arsenal the favourites right now, but as we saw with their pursuit of Mykhaylo Mudryk that doesn’t always mean a huge deal this far out. If Chelsea offer big or above market value money, Arsenal would have to go against their transfer-market principles.”\nArsenal ready to pay Rice premium\nWith Rice’s future attracting attention in Spain, reports there also believe the star is destined for Arsenal.\nAnd one such report there claims that the Gunners are ready to offer Rice a ‘truly crazy contract’ to snub all other offers and move to Emirates Stadium.\nCiting potential interest from Real Madrid, Los Blancos are reportedly unwilling to match the wages on offer to Rice by Arsenal.\nAt Arteta’s request, he’s urging Edu to make what is described as an ‘XXL offer’ to lure him to Arsenal.\nAnd despite the January addition of Jorginho, Arteta is willing to do whatever it takes to sign the 24-year-old.\nRice’s England teammate Kieran Trippier recently suggested Rice is better than Gunners midfielder Thomas Partey.\nWhen asked who is the more elite player, Trippier was firm in his response.\n“Declan! Declan’s unbelievable,” he told Vibe with FIVE YouTube channel.\n“I don’t know if you watched the game the other day when we [Newcastle] played West Ham, just his intelligence, the way he breaks up play, how he travels with it, powerful, unbelievable.\n“Probably one of the best in the world in what he does.”\nREAD MORE: Arteta desperate to sign new right-back, as Arsenal target Southampton man and sensational Spaniard",
  "word_count": 818,
  "scraped_at": "2026-02-14T01:36:07.211466",
  "_text_extracted": true
}