{
  "article_id": "ceaa5964aaed",
  "url": "https://thepeoplesperson.com/2024/03/17/graham-potter-emerges-as-surprise-ajax-managerial-target-alongside-erik-ten-hag-277598/",
  "title": "Graham Potter emerges as surprise Ajax managerial target alongside Erik ten Hag - Man United News And Transfer News",
  "date": "20240317T060000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are currently lying sixth in the Premier League and in real danger of missing out on Champions League qualification for next season.\nThe FA Cup currently represents the club’s best chance at European football for next season but even that might not be enough to keep Erik ten Hag in the hot seat.\nConsidering the season the club had last time out, a lot was expected from the Dutchman in his sophomore outing but a mixture of injuries and strange tactics have played spoilsport.\nINEOS, the new minority stakeholders, are expected to be ruthless with their approach and apart from a summer clearout, the manager’s position also remains on shaky ground.\nEtH’s future uncertain\nThe Peoples Person has relayed in the recent past that should Ten Hag be sacked, he would not be short of offers with Bayer Leverkusen and his former club eyeing his services.\nThe Eredivisie giants also have other names on their list like Liverpool assistant manager Pepijn Lijnders and former Chelsea boss Graham Potter as The Daily Mirror revealed.\nThe former Brighton and Hove Albion manager has also been linked with a move to Old Trafford as a replacement for Ten Hag due to his connection with incoming sporting director Dan Ashworth.\nCurrent Ajax boss John van ‘t Schip is expected to depart once the season concludes having joined as an interim manager with Ajax’s new chief executive Alex Kroes searching for the right heir.\n“Former Chelsea and Brighton boss Graham Potter has joined Liverpool assistant Pep Lijnders and Manchester United’s Erik ten Hag on Ajax’s managerial wish-list.\nPotter now in the fray for Ajax job\n“New Ajax chief executive Alex Kroes was surprised to be informed that Potter would consider moving to Holland to resurrect his career following his sacking at Stamford Bridge almost a year ago.”\nKroes, in a bid to understand what is required to get Ajax back to the top of the Dutch league, has visited Manchester and specifically United and City, ending up far less impressed with the facilities at United as compared to City.\nWhich manager ultimately ends up joining the 36-time record league champions in the summer will be intriguing to see.\nOnce the new team is in place at United, a call on Ten Hag’s future is expected to be taken. But the Dutchman must keep winning games until the end of the season to have any chance of staying on.",
  "word_count": 405,
  "scraped_at": "2026-02-14T01:54:34.174029",
  "_text_extracted": true
}