{
  "article_id": "cecb96bb5b60",
  "url": "https://theathletic.com/4376183/2023/04/04/chelsea-next-manager-nagelsmann-pochettino-ancelotti/",
  "title": "Chelsea next manager : Nagelsmann ? Ancelotti ? Pochettino ? Our expert verdicts",
  "date": "20230404T113000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is not even a year since Chelsea’s new owners, the Todd Boehly-Clearlake Capital consortium, took charge at Stamford Bridge and they are already searching for their second new manager.\nGraham Potter’s sacking on Sunday, just seven months after he succeeded Thomas Tuchel, suggested the ownership’s stated aim of being different to the ruthless hire-and-fire culture of Roman Abramovich is a long way from being realised.\nAdvertisement\nBut with Potter now cast aside, who should Boehly and co be looking at when it comes to his successor? We asked our panel of experts to reveal their chosen ones and to explain their reasons why…\nLuis Enrique\nFootball works in cycles, particularly at Chelsea. When players haven’t warmed to a particular approach, if a new manager comes in and does the opposite, it’ll generally have an immediate positive impact.\nIf Chelsea were seriously looking for someone to be in charge for the next five years, you’d get a different answer from me, but they’re not. They hire different types of managers; some work out in the short term, maybe they win a trophy or even a league or two, then their methods stop working and they’re replaced with a guy who does the opposite and the cycle repeats itself. And all along the club spends enough money on great players to ensure they’re never far away from challenging for silverware. It’s the Chelsea way.\nGraham Potter’s arm around the shoulder, nice-guy approach with confused tactics hasn’t worked. So, right now, Chelsea need someone who is used to managing top-level players, isn’t their friend and has a clear tactical approach. It’s Luis Enrique. He doesn’t mess around.\nEnrique has been described as someone who “does not get very close to his players” and is “more like an old-school English manager“. That feels like what Chelsea need. And the rest of us need his Twitch content.\nTim Spiers\nGO DEEPER\n'There were so many players, some had to change in corridor' - Potter's surreal Chelsea reign\nNot Julian Nagelsmann\nWould Julian Nagelsmann be a good fit for Chelsea? Possibly. Would Chelsea be a good fit for Julian Nagelsmann? Certainly not.\nConsider this. Nagelsmann, 35, is still a very young coach with limited experience at the top level and none outside Germany. At Bayern, he put the system — and, by extension, his own ideas — ahead of the needs of the players at times. Managing egos was also an issue. The same problem is bound to come up at Chelsea, but only worse.\nAdvertisement\nUnlike at Bayern, there are no seasoned operators with strong footballing fundamentals available as a sounding board and authoritative figures to help Nagelsmann control the dressing room. Instead, you have two meddlesome owners, a quartet of sporting directors and technical directors and a squad that isn’t so much deep than a bottomless mess of layers upon layers of different players. Better coaches than Graham Potter would have struggled to find a starting XI while keeping another 20-odd pros happy at the same time.\nMaking head or tail of this dysfunctional situation calls for a man who can keep those below and above him in check by force of his personality and standing in the game — a Zinedine Zidane maybe, or Carlo Ancelotti. Nagelsmann, by contrast, shouldn’t risk his reputation as one of the biggest talents by signing up for a largely impossible job.\nChances are this Chelsea will chew up plenty more managers before things settle. Better let someone else bite the bullet first.\nRaphael Honigstein\nMauricio Pochettino\nA manager who truly enjoys building from the ground up and is passionate about developing young players (although the same could be said of Potter), Pochettino has been on Chelsea’s managerial shortlists before. But this time, it feels like there’s been enough of a gap between his 2019 exit from Spurs for his north London allegiance not to be as much of a “thing” as it perhaps once was.\nHis passionate heart-on-sleeve demeanour is the perfect antidote for those riled by Potter’s measured manner and it’s not hard to imagine his presence having a galvanising effect on a dressing room that is sorely in need of a lift.\nPochettino’s work at Tottenham — turning them into Premier League contenders and Champions League finalists, and his attacking, eye-catching football — would surely please those in the boardroom as well as the stands at Chelsea. His experiences with PSG (winning the first league title of his managerial career and dealing with a dressing room filled with big names and egos) will also have given him a taste of dealing with the expectations and challenges that come with this job.\nAdvertisement\nThe Argentinian has made no secret of his love of living in London. And while his name has also been linked with a return to Spurs (and the Real Madrid job, should it become available), Pochettino might well view Chelsea as an opportunity to show Tottenham just what they could have won.\nSarah Shephard\nOliver Glasner\nIf Chelsea are looking for a manager to get the best out of their talented wing-backs, Glasner could provide an interesting solution.\nDespite relative inexperience in the managerial world, the 48-year-old shot to prominence last season, leading his Eintracht Frankfurt side past Barcelona, West Ham and Rangers to a Europa League crown. A further run into this season’s Champions League knockout stage — only dispatched by a rampant Napoli — added another feather to Glasner’s cap.\nThe Austrian rarely strays too far from his trusty 3-4-2-1: a system that allowed the likes of Filip Kostic and Ansgar Knauff to flourish during that Europa League run. The former scored seven and registered 14 assists before a summer move to Juventus, making him the most prolific attacking player throughout that historic campaign.\nGO DEEPER\nEintracht Frankfurt: Cuddly customers at domestic level but packing a punch in Europe\nHaving also lost the lethal Andre Silva on his arrival, Glasner has shown a particularly shrewd eye for players to fit his setup. As Randal Kolo Muani and Jesper Lindstrom arrived before deals for the talented Knauff and Philipp Max (both loans) as well as Aurelio Buta were secured. The coach certainly knows how to keep things ticking amid wholesale change.\nJust as when Glasner took over the reins in Frankfurt, the squad seems ready-made for his style: a rampaging Reece James opposite the touchline-clinging Ben Chilwell, three imperious central defenders, a progressive, combative double pivot with technically gifted inverted playmakers. His ideas would not represent a radical shift.\nAdvertisement\nRecently turning down a contract extension at his current club, there’s no doubt Glasner could be tempted. He could be an astute appointment if big-name first choices can’t be convinced.\nThom Harris\nCarlo Ancelotti\nSpare us the talk of a project and the need to trust the process. Two managers have lost their jobs at Stamford Bridge already this season and Chelsea currently have almost as many first-team players as points — it feels like a bit of a mess rather than some sort of grand plan.\nIt is hard, and arguably unrealistic, to picture everything falling into place at Chelsea anytime soon given there has been so much change on and off the pitch in such a short space of time. Cue the need for experience and a cool head to get the club back on track.\nStep forward Ancelotti. “What they hire me for is my ability to calm the situation at a club by building relationships with the players, which is one of my biggest strengths,” Ancelotti wrote in his book Quiet Leadership.\nAged 63, Ancelotti managed Chelsea more than a decade ago and won the double. In that sense, he knows the club and, unlike Potter, will not be fazed by the pressure that comes with the job (the Italian’s CV reads like a who’s-who of Europe’s top teams).\nCurrently in charge at Real Madrid, who face Chelsea in the Champions League quarter-finals next week, Ancelotti is unlikely to become available until the summer, when there is talk of him taking the Brazil job.\nIn all likelihood, Chelsea will be targeting a younger manager. But they could do a lot worse than appoint a man who is synonymous with bringing stability, creating harmony and delivering success.\nStuart James\nThomas Frank\nSections of Chelsea’s fanbase will groan about being linked with another manager who does not have previous experience at an elite side so quickly after Potter’s chastening tenure, but Frank has demonstrated his pedigree over the past few years.\nAdvertisement\nHe transformed Brentford into one of the most attractive sides in the Championship but was pragmatic enough to change their style when they reached the top flight. Frank’s tactical flexibility is one of his core strengths as he switches formations between 4-3-3, 3-5-2 and 3-4-3 depending on the opposition.\nBrentford have not won a game yet this season where they have had more possession than their opponents, though. Given Chelsea are expected to dominate matches, it would be interesting to see how Frank would adapt.\nThe key to success at Chelsea is developing the vast amount of expensive young talent within the squad. Frank has an excellent track record of improving players that stems back from his time coaching Denmark’s Under-16, Under-17 and Under-19 sides. Look at the conveyor belt of talent Brentford has produced during his reign, too. Ivan Toney and Ollie Watkins have gone from lower-league strikers to England internationals, while David Raya went to the World Cup with Spain.\nFrank has strong relationships with Brentford’s owner Matthew Benham, director of football Phil Giles and technical director Lee Dykes. They have a similar structure to Chelsea and that familiarity could work in his favour.\nBrentford finished 13th last season with the lowest wage bill in the division, but that’s where the uncertainty lies. Would Frank be able to cope with a bigger budget, higher expectations and more egos?\nJay Harris\n(Top photos, left to right: Mauricio Pochettino, Carlo Ancelotti, Julian Nagelsmann, Luis Enrique; all Getty Images)",
  "word_count": 1671,
  "scraped_at": "2026-02-14T01:53:35.629997",
  "_text_extracted": true
}