{
  "article_id": "ceeab2f8ed4b",
  "url": "https://www.newkerala.com/news/2023/43506.htm",
  "title": "Proud to represent Indian Football at highest level in AFC Champions League , says Mumbai City coach Des Buckingham",
  "date": "20230407T100000Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Proud to represent Indian Football at highest level in AFC Champions League, says Mumbai City coach Des Buckingham\nManjeri, April 5\nMumbai City FC head coach Des Buckingham said that his side is extremely proud of representing the country's football at the highest level in Asia at the AFC Champions League Group Stage, something which his side has done twice.\nWhile 4,000 may seem to be a lower number as compared to the grand atmosphere in the Kerala Blasters home games, it must be noted that this was an altogether neutral crowd that had come to witness good football at a time when most of their families would rather be breaking their daily fast during the month of Ramzan.\nMumbai City FC head coach Des Buckingham was enthralled by the support his side received in Kerala.\n\"A massive thank you to everyone for the reception and hospitality that we have received here in Kerala. Every time we are here, we are treated so well, people greet us at airports, they want to take pictures, it is just a great feeling,\" said Buckingham, according to AIFF press release.\n\"And the atmosphere in the stadium was also great. If we can have more of that in the Super Cup, our games would be great,\" added the coach.\nMumbai City will now have the distinction of playing in the AFC Champions League Group Stage twice, something that has made Buckingham proud.\n\"We are extremely proud to not just represent our club, but also Indian Football at the highest level of club football in Asia,\" he said. \"Playing the Champions League is a proud moment and puts many opportunities in front of us,\" he added.\nMumbai City had put up a spirited show in the 2022 AFC Champions League, where they finished second in Group B, behind Al-Shabab (Saudi Arabia), and ahead of Al-Quwa Al-Jawiya (Iraq), and Al-Jazira (UAE).\n\"Looking back at the last 12 months, it has been a special journey where we have had a good outing in the (AFC) Champions League. We won two games and drew another one, to finish second in our group. That is three results from six games at the top level,\" he said.\n\"Now that we have won the league (ISL Shield) and won the playoff too, we have come full circle to play the Champions League again. It is an exciting year in front of us,\" added the coach.\nMumbai City looked in control of the game for the most part; after a stalemate in the first half, the Islanders scored through an Ahmed Jahouh penalty, which was earned by Lallianzuala Chhangte. While Alberto Noguera doubled Mumbai City's lead, Jamshedpur captain Eli Sabia pulled one back at the other end with just 80 minutes to go, before Vikram Partap Singh settled the affair with an injury-time goal for Buckingham's side.\nJamshedpur FC head coach Aidy Boothroyd believes that though his side started well, their second-half performance left more to be desired.\n\"We started very well and kept things tight, but Mumbai put in a much better performance in the second half. They got stronger as the half went on, and it became more difficult for us,\" said Boothroyd.\nBuckingham, on the other hand, lauded his players for keeping their cool towards the end of the match, where things could have got a little too close for comfort.\n\"Jamshedpur has some good players and they are a very strong side on the set plays. The main thing is that there was very little panic from our end, and we were able to achieve the things we wanted on the pitch. Our boys remained calm and clear,\" said Buckingham.\nBoth teams will now participate in the Super Cup Group Stage, which will begin on March 8. Jamshedpur FC will play in Kozhikode in Group C against ATK Mohun Bagan, FC Goa and the winners of the Qualifier between Gokulam Kerala and Mohammedan Sporting, while Mumbai City will return to Manjeri to face their Group D opponents - Chennaiyin FC, NorthEast United FC, and winners of the Qualifier between Real Kashmir FC and Churchill Brothers FC.\nDisclaimer: This story was supplied by an external content provider; we do not endorse or accept responsibility for its accuracy, completeness, or any outcomes from relying on it. It is for informational purposes only and does not constitute legal, financial, medical, or other professional advice. Laws and regulations vary and may change; readers should verify accuracy and compliance with local requirements and consult a qualified professional for tailored guidance.",
  "word_count": 757,
  "scraped_at": "2026-02-14T02:09:52.180176",
  "_text_extracted": true
}