{
  "article_id": "cf217798ce11",
  "url": "https://thepeoplesperson.com/2025/09/20/bryan-robson-one-unpopular-ineos-decision-could-be-exactly-what-ruben-amorim-needs-to-succeed-at-man-united-299173/",
  "title": "Bryan Robson : One unpopular INEOS decision could be exactly what Ruben Amorim needs to succeed at Man United - Man United News And Transfer News",
  "date": "20250920T151500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eleven months into his tenure at Manchester United, Ruben Amorim finds himself in almost the same predicament as many of his predecessors.\nUnited fans have begun to lose faith, with some already pushing the “Amorim out” agenda.\nBrought in to replace the struggling Erik ten Hag, there were high hopes that Amorim would turn things around at Old Trafford.\nAt Sporting Lisbon, he had played an exciting brand of high‑flying, attacking football, conquering the Portuguese league while going toe to toe with Europe’s best in the Champions League.\nThe expectation was that he would gradually mould this United side into one that controlled games through possession and pressing, catching opponents on the break and punishing them.\nAt times, there have been glimpses of progress, such as the 2025/26 league opener against Arsenal and the first half against Burnley (before the September international break).\nHowever, there have also been poor displays, such as those against Fulham and Manchester City, which have led many to claim that nothing has really changed.\nThis inconsistency has left United struggling to compete, unable to string together the results they need.\nAnd in football, results are everything. With Amorim failing to deliver them, calls for his dismissal have grown louder.\nThe pressure is now on INEOS to make a tough decision, with some convinced he is not the right man for the job.\nSo far, however, the United hierarchy have resisted the clamour to sack the Portuguese tactician.\nReports suggest he has three games to save his job, while others claim his fate will be sealed by whether he can clinch European football.\nYet amid the noise, United have also heard a more measured voice of reason.\nAmorim needs time\nSpeaking to The Telegraph, legendary United midfielder Bryan Robson urged the club to resist the calls for change and instead give Amorim what he truly needs: time.\nRobson explains: “We have changed managers that many times since 2013.\n“I feel you have to stick and say, ‘No, we are not sacking the manager. We are not blaming.’\n“When you have a little bit of money and the club are going to allow you to change your squad, you need three years to get the team right.\n“For me, three years at Manchester United should be enough.\n“Look at the money we spend. It’s up to you to go around the world and get top players who are going to improve you.”\nSame old story\nSince Sir Alex Ferguson’s departure in 2013, managerial change has become the constant theme at Old Trafford.\nEach new boss has arrived with his own tactics, and to implement them has demanded his own players.\nThe club has adapted, invested heavily, and then pulled the plug before projects could mature, starting afresh, time and again.\nINEOS have already invested heavily in Amorim’s project, spending over £200 million in less than a year. Reports suggest they are prepared to continue backing him, targeting the midfield generals he wants.\nTo dismiss him now would be to return to square one, the same old story.\nAs Robson advises, maybe United should give Amorim the time he deserves. Even he admitted early on that it would not be smooth sailing.\nBefore the derby defeat, the statistics painted an encouraging picture of improvement. And if the numbers do not lie, then Amorim’s project may yet deliver sooner or later.\nFeatured image Michael Regan via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 574,
  "scraped_at": "2026-02-14T01:55:21.389825",
  "_text_extracted": true
}