{
  "article_id": "cf2c246eda86",
  "url": "https://www.arsenal.com/kai-havertz-interview-watch-premier-league",
  "title": "Havertz :  This team has a family mentality  ",
  "date": "20230628T210000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kai Havertz revealed his excitement at joining the 'Arsenal family', in his first interview with us since becoming a Gunner.\nThe 24-year-old Germany international has made the move from west to north London, joining us from Chelsea after three years at Stamford Bridge, and is already eager to meet his new teammates, staff and our supporters.\nSpeaking exclusively to Arsenal.com, Kai said: \"It's super exciting for me personally. I'm so glad to join this amazing club. This club has such a big history, and I hope we we can achieve lots of things, and I'm just looking forward to meeting all the players, the staff, and yeah, it's going to be exciting.\"\nWe asked our newest recruit about his past experiences of playing against us during his time at Chelsea, something that Kai admitted was always a challenging experience, citing our 'family mentality' as a crucial factor in our contests against the Blues.\n\"I think the family mentality that the team has on the pitch is one of the reasons why it so hard to play against Arsenal,\" he said.\n\"I guess they have it off the pitch as well. So the team mentality in the squad is very, very high and you can feel that. Obviously there's so many talented players and there’s big room to achieve big things as well.\"\nKai has chosen to wear the number 29 shirt for us, a number he's had throughout his professional career, and we quizzed our new man on the significance behind his \"lucky\" number.\n\"I have had it now for many years,\" he said.\n\"I chose it when I became professional in Germany, and since then, it's always given me luck. When I became professional I took it because it has some history with my brother. We used to take it always when we played some video games together. I think it's the perfect number!\"\nNext season will mark our return to the Champions League after a six-season absence, a competition that Kai knows well, having won it back in 2021, scoring the decisive goal in the final v Manchester City.\nOur No. 29 is excited to take to the pitch against Europe's elite once again, but this time in our red and white shirt.\n\"I think the Champions League is a special tournament and I think every football player just loves to play there,\" he said.\n\"I was fortunate to win the trophy and for me it was the best feeling I've ever had. So to play there again next season with Arsenal is very exciting for me. Hopefully I can bring some good attributes into the team, hopefully to win the trophy again. Because I think it's the most special trophy to win.\"\nClick the play button on the video above to watch Kai's first interview as an Arsenal player.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 499,
  "scraped_at": "2026-02-14T01:50:37.771870",
  "_text_extracted": true
}