{
  "article_id": "cf97a12005ed",
  "url": "https://www.globaltimes.cn/page/202507/1338069.shtml",
  "title": "Japanese man arrested for assaulting Chinese fan during intra - continental football match",
  "date": "20250710T163000Z",
  "domain": "globaltimes.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "SPORT / SOCCER\nJapanese man arrested for assaulting Chinese fan during intra-continental football match\nWu Xi (in white) of Shanghai Shenhua and Tatsuya Ito (left) of Kawasaki Frontale compete for the ball during the Asian Champions League Elite Round of 16 second-leg match between Kawasaki Frontale and Shanghai Shenhua at Todoroki Stadium on March 12, 2025 in Kawasaki, Kanagawa, Japan. Photo: VCG\nA Japanese man was arrested on Wednesday on charges of assaulting a Chinese man during the Asian Champions League Elite match between Kawasaki Frontale and Shanghai Shenhua in March, multiple Japanese media reported, as video clips of the incident began trending on Chinese social media on Thursday.Police in Japan's Kanagawa Prefecture arrested 53-year-old Atsushi Kubota, a construction worker from Kawaguchi, Saitama, on charges of assault during the match that was held at the Todoroki Athletics Stadium in Kawasaki, Japanese media Asahi Shimbun reported Wednesday.\nThe report cited Japanese authorities as saying the Japanese man violently attacked a 41-year-old employee of a Chinese company seated in the Shanghai Shenhua supporters' section.\n\"He punched the man in the face, breaking his nasal bone and causing injuries that required about six weeks to heal,\" the report said.\nThe report said the Chinese fan \"applauded\" rather than booed when Kawasaki Frontale scored, leading to a confrontation with nearly spectators.\nKubota then appeared and suddenly assaulted him before fleeing the scene. A video of the incident, shot by a spectator and later posted on YouTube, helped authorities identify the suspect, the report said.\nMany Chinese netizens were puzzled by the Chinese fan's apparent support for Kawasaki Frontale, before noting such football violence should be strictly prohibited.\nIn response, the club announced that it would impose a \"permanent ban from all club-hosted matches\" for the Japanese attacker.\n\"The occurrence of such behavior at a match venue is absolutely unacceptable under any circumstances,\" the club was quoted as saying in a statement by Japanese football news outlet soccerdigestweb.com on Thursday.",
  "word_count": 325,
  "scraped_at": "2026-02-14T01:49:44.681926",
  "_text_extracted": true
}