{
  "article_id": "cfa76f32b867",
  "url": "https://thepeoplesperson.com/2023/06/01/why-erik-ten-hag-wants-mason-mount-and-where-he-fits-in-at-manchester-united-264787/",
  "title": "Why Erik ten Hag wants Mason Mount and where he fits in at Manchester United",
  "date": "20230601T160000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Remember all those games Bruno Fernandes played on the wing? How about Wout Weghorst at number ten? If not, there is a decent chance that United fans will be seeing those oddities again on Saturday against Manchester City.\nFresh off the reports that The Red Devils have agreed personal terms with Mason Mount, Sky Sports now believe that a formal approach to Chelsea is imminent. The Peoples Person assesses the ways in which the Chelsea man, a very good midfielder in his own right, can help get the most out of the players already plying their trade at Old Trafford.\nThe England international is well-valued by a number of top coaches for his diligence off the ball, with his ability to fit into a number of roles and be at the forefront of his team’s pressing structure a rare quality. He is up there with the best in the division for possession-adjusted pressures, despite playing in a wide range of positions for a poor Chelsea side this season.\nPossession-Adjusted Pressures, Premier League 2022/23 pic.twitter.com/7ULfyTJTtC\n— StatsBomb (@StatsBomb) March 9, 2023\nBruno Fernandes’s versatility and work rate have often been used in a similar way to Chelsea’s usage of Mount during his time under Thomas Tuchel, arguably to the detriment of both United and their talisman.\nTen Hag has regularly deployed Fernandes’ energy and pressing intensity to limit the influence of key facilitators of an opposing side’s build up, and when that includes a right back, the Portugal star tends to find himself starting on the left. When Antony was unavailable through injury, Bruno even started on the right for much the same reason.\nThe problem with this is twofold. Firstly, United would ideally like to play Fernandes in an advanced midfield role, where he can more easily be found by his teammates. In central areas, he is able to view more of the pitch, making his passing range more dangerous to the opposition. As a chance creation machine, the playmaker has been an essential part of Ten Hag’s squad and, while he has proven himself versatile enough to put in good performances in a number of roles this season, there is no doubting where he is at his best on the ball.\nSecondly, Bruno’s work rate in central areas is a factor that must be compensated for when he is shuffled around the pitch. It is no good moving your most intense runner out wide and leaving the opposition free to waltz through the middle of the park as a result. This means that, when Bruno has been shifted around, Ten Hag has made some outlandish selection calls in the number ten role. As mentioned, Weghorst has been one of them, but even Scott McTominay ended up playing the position in an ill-fated experiment at St. James’ Park.\nThat call in the 2-0 defeat against Newcastle came from a desire to use Bruno Fernandes deeper in midfield to cover the loss of United’s primary ball progressor from deep, with Christian Eriksen out through injury. The relevance remains, however, as whenever Ten Hag has felt forced to move his star creator into a different role, Man United have suffered elsewhere.\nMason Mount is an even more diligent presser than Bruno Fernandes, meaning that when the Kieran Trippiers or Trent Alexander-Arnolds of the world come to Old Trafford, the Portuguese playmaker will be far less likely to find himself on the wing. And, just as pleasingly, should Bruno still be needed deep, it will not be Scott McTominay or Wout Weghorst playing in the ten role.\nAnd the 24-year-old plays these roles to good effect. Under Tuchel, Mount was most regularly played in a 3-4-2-1 system as one of the two behind the striker. A flexible coach, the German would adjust the width of his two tens game-by-game, meaning Mount was as likely to be playing by the touchline as he was to be in central areas. During his last full season under the Tuchel, Mount scored 13 goals and provided 13 assists in all competitions on the way to his second Player of the Season award in a row at Stamford Bridge.\nA switch-blade capable of playing anywhere in the final third, providing both quality and selflessness, Mount is also more than capable of establishing himself in a central midfield role.\nA quick look at his SmartScout data from the 2020/2021 season (the last campaign in which he played more than 1500 minutes in central midfield in the Premier League, and the first in which he scooped Chelsea’s Player of the Season award), shows just how effective he can be in the engine room.\nSmarterScout calculates an Attacking Output rating by using two mathematical models, one for shot-creation and one for ball-progression, and measures an individual player’s contribution to his team’s Expected Goals For stat based on these factors. That contribution is then compared to other players in the same position and adjusted to Premier League standard. Mount’s rating of 89/100 shows genuine top-level creativity, with his ability to progress the ball up the pitch and create goalscoring opportunities among the best midfielders in Europe at the time.\nIt also outperforms Christian Eriksen’s contributions for Manchester United this season, as seen in the image above. The difference is not incredibly high, but when considering the overall package, it is plain to see why Ten Hag might consider Mount an upgrade in a number eight role.\nThe Defending Quantity and Quality ratings (which use similar models, but measure a player’s contribution in limiting a team’s Expected Goals Against stat), point to Mount being a far more useful player in defensive situations. Mount was both busy and effective, while Eriksen rarely puts himself about. This certainly passes the eye test as, while the Danish star has been crucial to Man United’s successes this season, it has been clear that the defensive side of the game is not his forte.\nMount’s data is also significantly more impressive in terms of Ball Retention (the measure of how likely the team is to keep possession after the player touches the ball), although a glance at the Style Ratings of the two players reveals why. Eriksen is a high-risk ball player, with a large proportion of his touches featuring passes that attempt to move his team more than 20 metres towards the opposition goal. Conversely, Mount’s profile is more balanced, with more Link-up play and a higher volume of Dribbles contributing to a more considered approach.\nThat could make the England star an ideal partner alongside Bruno Fernandes in matches where United aim to keep the ball under pressure, rather than spring forward at the slightest opportunity. Notable also, is Mount’s goal threat, with greater shot-volume and receptions in the opposition penalty area potentially a new route to scoring for the Red Devils.\nAll of this points to a slight change in style under Erik ten Hag. Last summer’s obsessive pursuit of Frenkie de Jong is well and truly at an end, and given the unique skill set of the Barcelona midfielder, it would appear that any notion that the United boss would try to recreate his Champions League semifinal-run Ajax side can be put to bed.\nThe midfield shaping up under Ten Hag now is far more similar to the Ajax side that bagged its fourth consecutive Eredivisie title. The Edson Alvarez role of breaking up play is filled by Casemiro, while the high-risk creativity supplied by Steven Beghuis is built upon by Bruno Fernandes. Ryan Gravenberch supplied box-to-box runs at Ajax, while using his ball carrying ability and threat in the opposition penalty area, and this is a role Mason Mount is very well suited to. Arguably, that version of Ajax, with its added physicality and intensity, was always more likely to succeed in English football than the De Jong/Lars Schone/Donny van de Beek axis.\nThe most important thing to remember is that Mason Mount gives Erik ten Hag options. Manchester United will have played 62 matches this season by the end of Saturday, while Bruno Fernandes will have played his 71st game of the season for club and country. If United are to go deep into several competitions again next season, the manager will need to be confident that he can rotate players without a significant drop-off in quality. He will also need players who can offer tactical flexibility to cover roles when needed and exploit specific patterns in opposition sides. A switch-blade midfielder, Mount can do just that.\nImagine an FA Cup Final programme, but 100% online!\nWith just a couple of clicks you could be reading the FA Cup final special edition of United Matchday Magazine, right here on your device. All the latest news, meet the teams, tactical preview, opinion, debate, transfer news, quiz and much more! Get yours now for just £3/$3.75 and\nbe in the know about everything in red!",
  "word_count": 1481,
  "scraped_at": "2026-02-14T02:00:19.986513",
  "_text_extracted": true
}