{
  "article_id": "cfb1d0bec681",
  "url": "https://metro.co.uk/2025/04/17/arsenal-star-slammed-utter-madness-despite-brilliant-real-madrid-performance-22923139/",
  "title": "Arsenal star slammed for utter  madnes despite brilliant Real Madrid display",
  "date": "20250417T073000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal will have to cope without one of their key players for the first leg of their Champions League semi-final against Paris Saint-Germain.\nMikel Arteta’s side celebrated an historic win over Real Madrid last night that saw them seal a place in the last four of Europe’s elite club competition for only the third time in their history.\nGoals from Bukayo Saka and Gabriel Martinelli secured a 2-1 win on the night and a resounding 5-1 aggregate victory over the holders.\nAfter the dust settles, attention will quickly turn to the challenge of PSG who have emerged as one of the favourites for the competition after knocking out Arsenal’s Premier League rivals Liverpool and Aston Villa in successive rounds.\nArsenal’s already threadbare squad is likely to be tested to the limit and Arteta will have to cope without Thomas Partey at the Emirates after the Ghana international picked up a needless yellow card in the closing stages.\nAfter Antonio Rudiger’s cynical foul on Mikel Merino, Partey became embroiled in an altercation with Jude Bellingham and was cautioned by referee Francois Letexier.\nUnfortunately for the 31-year-old, that booking represented his third yellow card of the knockout stages and he will, therefore, be unavailable in a fortnight’s time.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Madness,’ said TNT co-commentator Ally McCoist, in the immediate aftermath of Patey’s lack of discipline.\n‘Declan is saying, what are you doing, why get involved. We’re through, there’s 5 mins to go. He’s played every so well, what a blemish for him.’\nArteta now faces a major conundrum against PSG with both Partey andJorginho, who could miss the rest of the season following the injury he sustained against Brentford last weekend, unavailable.\nFormer Arsenal winger Theo Walcott fears Partey will be a big miss against the French champions and is concerned that the only option to Arteta appears to be Mikel Merino who has done an excellent job as a makeshift striker.\nHow will Arsenal cope without Thomas Partey?\n‘Arsenal and Paris St-Germain are definitely the two best teams in this season’s Champions League, and the semi-final is going to be a completely different story to when Mikel Arteta’s side beat them 2-0 at the Emirates in October,’ Walcott told the BBC.\n‘PSG hadn’t really clicked then, but they have now. Arsenal will be ready for them, but I think they might miss Thomas Party, who is suspended after his yellow card tonight.\nMore Trending\n‘He was so important at the Bernabeu, not just with the way he was getting back into the back-line and to help out with the amount of crosses he was dealing with tonight.\n‘Partey was also helping Arsenal to slow the ball down and to control the midfield. The PSG game is all going to be about the midfield for me and Declan Rice is now probably going to play a game with someone who he is less familiar with.\n‘Mikel Merino can drop in there, but that might affect the forward line more because of where he has been playing recently.\n‘This is what Mikel Arteta will be thinking about now, and he might tinker with a few things against Ipswich and Crystal Palace, to try things out before the semi-final.’\nMORE: Mikel Arteta ‘wanted to slap’ Arsenal star after what he did against Real Madrid\nMORE: Theo Walcott names ‘favourite’ to win Champions League after Arsenal beat Real Madrid",
  "word_count": 616,
  "scraped_at": "2026-02-14T02:02:35.575764",
  "_text_extracted": true
}