{
  "article_id": "cfde955b3982",
  "url": "https://www.caughtoffside.com/2024/11/26/shirt-deal-newcastle-premier-league/",
  "title": "Newcastle are predicted to be able to execute a £90m shirt deal",
  "date": "20241126T143000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A re-framing of the Premier League’s Profit and Sustainability Rules could see Newcastle able to complete a £90m deal according to a football finance expert.\nOne former Premier League CEO believed that the Magpies might have to sell players in order to get around the new elements of this particular area of Financial Fair Play, however, a potential rule change could be of benefit to the owners of the club, the Saudi Public Investment Fund (PIF).\nNewcastle could benefit from new PSR loophole\nWith PIF’s vast wealth estimated to be a mammoth $925bn (per PIF’s official website), it’s clear that the PSR rules have hamstrung the owners from being able to effectively buy whomever they want.\nAs a result, the Magpies are still flirting with success rather than actually winning anything significant in that regard.\nNotwithstanding a recent Champions League group stage which at least saw them secure a win for the ages when demolishing Paris Saint-Germain at St. James’ Park, there’s been little in the way of true progress from Eddie Howe and his side.\nWhether the owners make a change in the dugout at some stage is a moot point, as Howe is clearly working to the best of his ability within the confines of the FFP framework.\nNewcastle make new appointment in order to combat PSR rules – READ MORE!\nThere could be some light at the end of the tunnel, however, with recent movement in terms of what’s acceptable for Associated Party Transactions (APT).\n“I think the additional information now available to clubs will allow them to see the upper limit of the upper limit, as it were,” football finance expert, Kieran Maguire, told TBR Football.\n“It well let them see just how far they can negotiate before the Premier League says this is not acceptable.\n“If Man United have a £90m shirt deal, presumably it would be acceptable for Newcastle United and Man City to also have a £90m shirt deal given that the Premier League specifically states that the rules are there to ensure competitive balance.\n“I don’t know how they can keep a straight face when they say that.”",
  "word_count": 356,
  "scraped_at": "2026-02-14T02:11:20.848890",
  "_text_extracted": true
}