{
  "article_id": "cfee5222c53f",
  "url": "https://dailytimes.com.pk/1086088/manchester-city-hit-their-stride-for-tilt-at-manchester-uniteds-treasured-treble/",
  "title": "Manchester City hit their stride for tilt at Manchester United treasured treble",
  "date": "20230421T061500Z",
  "domain": "dailytimes.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LONODN: Manchester United remain the only English club to have won the prized treble of Champions League, Premier League and FA Cup, but Manchester City are closing in on the same feat. City stormed into the Champions League semi-finals for the third consecutive season on Wednesday, completing a 4-1 aggregate triumph over Bayern Munich. Mighty Real Madrid, who eliminated Pep Guardiola’s men in the last four last season, await in the semi-finals. If City can slay the defending champions, they would be huge favourites to finally end their quest to conquer Europe, with AC Milan or Inter Milan waiting in the final in Istanbul on June 10.\nDomestically, City are already the dominant force as they go in search of a fifth Premier League title in six seasons. Long-time pacesetters Arsenal hold a four-point lead at the top of the table but are showing signs of nerves after costly draws against Liverpool and West Ham. City have a game in hand and home advantage next week when the Gunners visit the Etihad for a potential title decider. Before then, Guardiola’s men make the trip to Wembley on Saturday for what should be a routine passage to the FA Cup final.\nSheffield United are on the brink of securing a return to the Premier League next season, but it would be a huge surprise if the Championship side end City’s 15-game unbeaten run, which stretches back to February. Despite the arrival of Erling Haaland, who scored the 48th goal of his debut season in a 1-1 draw in Munich on Wednesday, there were plenty of doubts about City just a few months ago.\nHunger: Guardiola uncharacteristically took aim at what he saw as his side’s lack of hunger after a 4-2 win over Tottenham in January. Less than a month later, Spurs beat them — City’s most recent defeat — with Kevin De Bruyne, Ilkay Gundogan and Ruben Dias among those left on the bench. All three have since been restored to Guardiola’s most trusted starting line-up and City have achieved defensive solidity without blunting the effectiveness of Haaland. “We’re very confident, in a very good moment, the best moment of the season for the team,” said midfielder Bernardo Silva. “We struggled until February because we couldn’t get in that usual run of the past years of winning 10, 15, 20 games in a row. Now the team is very consistent the way we are playing, we feel we have a chance in every competition and we are going for them.”\nThe odds on City matching Alex Ferguson’s greatest achievement of his 26 years in charge of United have been slashed, with the club now the bookmakers’ favourites for all three competitions they are in the hunt for. But Guardiola has warned in recent weeks of the tightrope City must walk in chasing down Arsenal at the top of the Premier League, with one slip potentially proving fatal. “We know how tough it is to get to this part of the season where if you drop your performance for one part of the game, you are out of one competition,” said Silva. “Next game is Sheffield, then it’s Arsenal so it’s going to be tough, but it’s going to be fun. When you are a little kid you work to get to these moments and to enjoy as a football player. We’re going to work very hard to bring some titles back home.”",
  "word_count": 572,
  "scraped_at": "2026-02-14T01:50:29.477343",
  "_text_extracted": true
}