{
  "article_id": "d0010d990775",
  "url": "https://www.caughtoffside.com/2024/04/21/tottenham-want-gabriel-osho-luton/",
  "title": "Tottenham Transfer News : Spurs keen on Gabriel Osho",
  "date": "20240421T093000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are looking to further reinforce their defence by signing Gabriel Osho.\nAnge Postecoglou’s team are currently fighting for a top-four finish in the Premier League. It has been a great first season for the Australian manager in the English top flight. While the focus is on securing Champions League football for next season, Spurs have already started to plan for the upcoming summer transfer window.\nThe North London club are looking to reinforce their defence ahead of next season and according to a report by GiveMeSport, Spurs are plotting a bargain move for Gabriel Osho. The 25-year-old Luton Town centre-back has managed to put in impressive performances in the ongoing season and he is on the radar of a few clubs.\nGabriel Osho would be a bargain buy for Tottenham\nWhile Osho has struggled with injuries and has only featured in 19 matches, he has managed to impress one and all with his performances. The 25-year-old’s contract with Luton runs out at the end of the season. The chances of him penning down a new deal with Luton are slim and Spurs are looking to sign him as a free agent in the summer.\nHe will want to compete at a higher level and a move to Tottenham would be ideal. The Londoners have already made two impressive signings at the back. Micky Van de Ven and Radu Dragusin have arrived at the club over the past two transfer windows. But, Postecoglou still feels the need for more depth and Osho is a target.\nThey are looking at the free-agent market in order to avoid any concerns related to the Premier League’s profit and sustainability rules. Gabriel Osho certainly fits the profile for them and it remains to be seen whether they can get the deal done. Signing him on a free transfer would allow them to improve the other areas of their squad as well.",
  "word_count": 318,
  "scraped_at": "2026-02-14T01:56:51.548921",
  "_text_extracted": true
}