{
  "article_id": "d0162ffaa38b",
  "url": "https://www.teamtalk.com/newcastle-united/eddie-howe-newcastle-latest-as-amanda-staveley-weighs-in-on-poor-run-and-chris-sutton-delivers-sack-verdict",
  "title": "Eddie Howe Newcastle latest as Amanda Staveley weighs in on poor run and Chris Sutton delivers sack verdict",
  "date": "20231231T211500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nEddie Howe Newcastle latest as Amanda Staveley weighs in on poor run and Chris Sutton delivers sack verdict\nA report claims Eddie Howe will not be removed as Newcastle United manager after being backed by the board, with pundit Chris Sutton in full agreement.\nHowe has overseen a huge turnaround in the Magpies fortunes since replacing Steve Bruce at the helm. Heavy investment has helped the former Bournemouth chief put the club at the right end of the standings. And last season’s top-four finish saw them in the Champions League ahead of schedule.\nThat did not work out quite as planned this season, with the north-east outfit crashing out of Europe after the group stage.\nAnd they have struggled in the Premier League of late, with four defeats from their past five matches.\nInjuries have taken their toll although Howe has not tried to hide behind a lack of numbers.\nRumours have already begun to circulate that the board may be on the lookout for his replacement.\nBut a report by The Mirror claims co-owner Amanda Staveley visited the dressing room to offer her support after the Nottingham Forest defeat.\nA 3-1 loss at home to Nuno Espirito Santo’s men was hard for the fans to take.\nREAD MORE: Newcastle, Tottenham suffer January setback but door not completely closed for star likened to Messi\nAnd, following on from a 1-0 defeat to Luton, Howe appeared to be under pressure.\nHowever, it has been suggested he has been told there is no pressure coming from the Newcastle United boardroom as they understand the situation.\nHowe needs time to put things right\nNews that his job looks safe will have given Howe a boost ahead of a tough period. Many pundits have had their say on the situation.\nAnd former Blackburn striker Sutton believes the manager needs to be given an opportunity to continue the work he is doing.\n“I think you have to look at the bigger picture,” he said on the ‘It’s All Kicking Off’ podcast.\n“The football which he’s played since he’s come in has been an attractive brand of football and there needs to be patience.\n“There are always parts of a season for most clubs where there’s a bit of turbulence and there’s a bit of turbulence at Newcastle.\n“But when you go back and look at their summer spending they’re not in the top six in terms of recruitment and the players they brought in\n“So until Eddie Howe is really helped by bringing in an abundance of top class players, I think it’s very hard to judge him at this moment in time.”\nNext up for the Magpies is a daunting trip to Anfield to face Liverpool on Monday evening.\nThe Reds are in excellent form and have serious title ambitions this term.\nAn FA Cup third round match on January 6 might seem a welcome distraction for Newcastle.\nBut the fact it is against Sunderland at the Stadium of Light means Howe’s charges will not be able to drop their guard for a minute.\nThe Black Cats would love to down their fierce north-east rivals and heap further pressure on the boss.\nREAD MORE: Eddie Howe issues response to Newcastle doubters with ‘strong’ claim ahead of Liverpool challenge",
  "word_count": 550,
  "scraped_at": "2026-02-14T01:48:34.021217",
  "_text_extracted": true
}