{
  "article_id": "d04fff252fe0",
  "url": "https://theathletic.com/4710325/2023/07/21/bonmati-spain-putellas-costa-rica/",
  "title": "Aitana Bonmati is Alexia Putella true successor – together they could win the World Cup for Spain",
  "date": "20230721T203000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aitana Bonmati played in Spain’s opening game at the World Cup as if oblivious to the cold and the rain that fell on the Wellington Regional Stadium while those looking on huddled in their seats.\nWhen you talk to Bonmati she seems to have the answer to everything. As if she has it all under control. As if anything you could say to her she has already thought of 10 times. As if you could never catch her off guard.\nShe plays as she talks, with everything under control.\nAdvertisement\nBonmati is one of the most ambitious players in elite football. She is so clear about everything that it is sometimes overwhelming to listen to her.\nThis season was to be her season. She promised the Barcelona fans that they would bounce back after losing the UEFA Women’s Champions League final in 2022 and she dedicated her efforts to keeping that promise; a woman of her word. She came back, and did so by winning her second Champions League in the best season in living memory. And as a final flourish, an already glorious season culminates with the FIFA Women’s World Cup.\nSpain have yet to get beyond the round of 16 at a World Cup but they already have a good part of what they need to achieve it this time around: their own names. For the first time in a World Cup Spain have the best players in the world in several positions. And the actual best in the world, according to the Ballon d’Or, Alexia Putellas.\nFew teams can boast of having the best. Even fewer see that player suffer serious injury, but then are able to call upon another player in the team to pick up that leadership role: Aitana Bonmati.\nBonmati was born to be a leader and she knows it. And so does the player who plays that role at Barcelona and in the national team: Putellas.\nPutellas is coming back little by little since recovering from the ACL injury she suffered on the eve of Euro 2022, and her coach has already warned that they are going to take it slowly with her. They don’t want to risk it. They don’t want to lose her again.\nPutellas has hardly played all season. She returned on 30 April against Sporting Huelva, and has since collected minutes in dribs and drabs.\nSpain’s opening game against Costa Rica seemed like a game designed to give Putellas the minutes she needs to get back into a rhythm. But she had only done two training sessions with the squad in the build-up to the World Cup and Costa Rica is the least demanding game they will have. It made sense not to risk her, especially with the leadership Bonmati has shown this season.\nThat thinking was confirmed when the line-ups came out and Putellas was on the bench.\nAdvertisement\nBonmati seized the moment and did her thing again. You could tell it was going to be a big night for her just by the look on her face before the game started.\nIn the seventh minute she gave warning of her intentions with Spain’s first shot (of 46 overall) of the match. During a season marked by the absence of Putellas, Bonmati has learned how to be more effective as an offensive player, to focus her game closer to the opponent’s penalty area. Something shown by the fact that she provided the most assists (7) in the Champions League in 2022-23 and tied with four other players as second top scorer with five goals.\nIn the 21st minute against Costa Rica a delicate Bonmati backheel on the edge of the box to Esther Gonzalez led to a cross which saw Costa Rica’s Valeria del Campo put the ball into her own net.\nAnd just two minutes later Bonmati scored a lovely goal to kill the game. Receiving a pass inside the box she worked the ball cleverly to create the space to score emphatically with her left foot.\n“It was beautiful, wasn’t it? I haven’t seen it yet,” she joked in the mixed zone afterwards.\nThe Catalan teamed up well with Jennifer Hermoso in midfield and in the final minutes she did the same with Putellas.\n“Both are players who understand football the way I understand it, they are players who play with a touch, who receive the ball at their feet. They know how to read the game. It’s easy to play with people like that,” she said after the match about the differences between playing alongside the two.\nA touch map comparison between Spain and Costa Rica in that #FIFAWWC match. ⬇️ pic.twitter.com/tuPGQWE6Kz\n— Opta Analyst (@OptaAnalyst) July 21, 2023\nIt’s not easy to shine in a team with an outstanding leader like Putellas and to do it well. And even more so when that player has been the face of the ascent of Spanish women’s football. The very proof that things were being done well. The face of Barcelona’s professionalisation and the face of the club’s Champions League wins.\nAdvertisement\nWith a figure like that in a team, normally the players who want to stand out have to leave the club in order to shine. But not Bonmati.\nBoth her and Putellas are La Masia-trained. Both are midfielders and both are Catalan.\nBoth are football obsessed too. They plan their rest, planning and leisure around football. According to their coaches, both are players who are difficult to define purely in terms of statistics.\nAnd both want to be the leaders of their club and national team.\nOne might think it is inevitable that they will have to compete for the position.\nBut Bonmati’s virtue is that in Putellas’ absence she has been able to create her own identity as a leader. This season, she has been decisive in a team shorn of Putellas’ leadership. Now she is ready to be the same — if necessary — at the World Cup, a tournament she was prepared to miss.\n“Of all the years I’ve been playing football, this has probably been my best year. The experience helps me to make better decisions, to know how to control the tempo of the game better and to know where the spaces are. Physically, I also feel very good,” Bonmati told The Athletic in the mixed zone after the match.\n“I don’t focus on what I can achieve individually, but on focusing my performance to help the team.\nSpain now have the best player in the world and the leading candidate to take her place. Bonmati has set her sights on making this her World Cup and, on current form, she looks capable of doing so.\n(Top photo: Jose Breton/Pics Action/NurPhoto via Getty Images)",
  "word_count": 1124,
  "scraped_at": "2026-02-14T02:00:36.692733",
  "_text_extracted": true
}