{
  "article_id": "d05f78bfc720",
  "url": "https://theathletic.com/5062842/2023/11/16/damien-comolli-interview-toulouse/",
  "title": "Damien Comolli on Toulouse and his career in England :  I really feel now that Im at peace  ",
  "date": "20231116T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s been a 31-year journey — taking in recruitment and director roles at Arsenal, Tottenham Hotspur and Liverpool — and Damien Comolli, now the president of Toulouse FC, cuts a content figure.\n“I really feel now that I’m at peace,” he says.\nWhy? “Those years in different jobs and countries are now my toolbox that I peek inside and choose the right tool for the solution.”\nAdvertisement\nHe’s never felt this way before. “I can control more or less everything that is happening day to day but, even in a crisis, there’s no panic. The key is having good people around me and listening to them. Speaking is easy, listening is more difficult.”\nToulouse’s success reflects a well-run and rejuvenated club, rising from the foot of France’s second division just over three years ago to become a top-tier, French Cup-winning, Europa League outfit. “We got promoted (as 2021-22 Ligue 2 champions) and French football noticed; after the cup, European football noticed; after beating Liverpool, the world of football noticed,” says Comolli with a smile.\nThe 51-year-old Frenchman spent two years at Anfield as director of football strategy. The deadline-day signings of strikers Luis Suarez and Andy Carroll in January 2011 were the most eye-catching deals of his tenure.\nFast forward almost 13 years and the 3-2 group-stage win over his former side last Thursday, especially after October’s reverse fixture had ended in a 5-1 defeat, was equally surprising. Or was it? “Without sounding arrogant, we planned for it. We knew the game at Anfield was going to be hell, but we thought, ‘We can do something at home’, so we approached it differently. It was not unexpected.”\nWhy such confidence? “We are extremely data-driven on all our football decisions. How we recruit coaches, players; the way we attack, defend; shoot, don’t shoot; cross, press; even optimise our wage bill. Data is part of our culture.”\nAlong with Premier League clubs Brighton & Hove Albion and Brentford, Toulouse are the sport’s data disrupters. “Our competitive advantage is we decided to go with data and we stick with it. Even when things appear counter-intuitive to the so-called football wisdom.”\nBefore facing Liverpool in this season’s Europa League, Comolli met his football strategy department to debate a two-game plan, which meant no worry after that defeat on Merseyside: “We never look at the results, we look at the underlying data. For a club like us to leave Anfield with an xG (expected goals) of 1.4 showed that, even in that game, we could create.”\nAdvertisement\nOnly one visiting team have registered a better xG than 1.4 at Anfield in the Premier League this season — Brentford, another data-driven side, who achieved 1.68 in Sunday’s 3-0 loss.\nCarles Martinez Novell — previously in academy roles in Spain, Qatar and Kuwait before being promoted from an assistant this summer after the firing of last season’s cup-winning boss Philippe Montanier — set the tone immediately after Liverpool’s four-goal triumph. “In the changing room, our head coach said, ‘It might sound crazy, but I want you to be as crazy as me in two weeks’ time. With a different mental approach, we can win it’. That’s where it all started.”\nIn-game, data-driven decisions helped the longer-term plan too.\n“I’m in a WhatsApp group with the analyst and at 4-1 down, I checked when (forward) Thijs Dallinga was coming off. They said he was heading into the ‘red’ (physically fatigued), so it would be two minutes,” he explains. “We want players to perform at their peak and avoid overload, so he came off on 80 minutes. If he’d stayed on, maybe he would get injured.”\nDallinga scored to make it 2-0 in the return against Liverpool and a haul of three goals in his four Europa League games has seen the 23-year-old rewarded this month with a first senior call-up by the Netherlands.\nThe comments of manager Jurgen Klopp after Liverpool’s 100 per cent record in Europe this season bit the dust highlighted the change in Toulouse’s mental approach: “They won all the decisive battles and challenges. They fought harder. It’s deserved, so congratulations.”\nToulouse’s plan worked, and human emotion kicked in for Comolli. “Usually you feel relief, but this was pure enjoyment. The togetherness with the Violets (the club’s nickname) community was incredible.“\nThe buzz went further afield than the 33,000-capacity Stadium de Toulouse. “I got texts, messages and emails from all over the world — from South Africa, Ghana, Australia, the U.S., South America, everywhere. The repercussions that win had on the global stage for the city of Toulouse is tremendous.”\nAdvertisement\nComolli’s football experiences have been a learning curve.\nStarting as a youth coach at Monaco in 1992 under Arsene Wenger, he joined his countryman at Arsenal four years later as a European scout. He then spent a season as technical director back in French football with Saint-Etienne (2004-05) before Daniel Levy appointed him director of football at Tottenham after the departure of Frank Arnesen. He spent three years there, until Harry Redknapp replaced Juande Ramos.\nThe premise was that the manager would be given greater control.\nThen and now, it’s not a model Comolli agrees with.\n“Definitely not. The manager is the worst person in the club to make that type of decision,” he says. “For the good of Tottenham, Daniel never listened to what Harry was saying. Otherwise, he would have destroyed the club. He didn’t want Gareth Bale, didn’t want (Luka) Modric, he didn’t want all of these players. Daniel is too strong. That was the key to Spurs’ success going forward.”\nRedknapp admits he didn’t want a director of football in the organisation, and that led to Comolli’s dismissal after a conversation with Levy. He says he was keen to build his team around future Real Madrid great and Ballon d’Or winner Modric, who he regards as one of his favourite players, and always felt Welsh icon Bale, who followed the Croatian to the Bernabeu, was going to be a superstar. Redknapp says his record at Spurs speaks for itself.\nToulouse are controlled by U.S. investor RedBird Capital, which has an 85 per cent stake in the club. It also owns Italy’s AC Milan, and European football’s governing body UEFA ruled the two sides must not collaborate. (They could meet in the Europa League’s first knockout round in February, if Toulouse advance as group runners-up — they are second behind Liverpool with two games to go — and Milan finish third — their current position after four of the six matches — in their Champions League group.)\nAdvertisement\nNevertheless, Comolli, who was speaking at Web Summit in Lisbon, where he contributed to a panel session on data analytics in football alongside former Tottenham and Chelsea manager Andre Villas-Boas, is at the top of the tree at his club and that is all that matters to him.\n“I’m now in a position where everyone is aligned with me at the club. I don’t need to be aligned with someone, if you see what I mean, because the buck stops with me at the end. If I, or we, decide something, then everything has got to fall into line at the club and that’s a big difference with everything that I’ve gone through before and that’s maybe why we are a success.”\nHe admits he was “useless” when people micromanaged him in the past and that could lead to clashes. It means now he tries not to interfere or dictate. He believes in “responsibility, empowerment and delegation” — but on one condition. “They have to be aligned with the vision we have. That’s a massive difference-maker compared to everything I’ve encountered before. It’s simple.”\nIt reminds him of his time on the red side of north London.\n“The only time I witnessed this type of alignment, it was with David Dein (former Arsenal vice-chairman) and Arsene Wenger and all the way through Arsenal, with all the success they had when I was there. It makes a massive difference and it cannot come from a head coach or manager, it has to come from the top.”\nComolli is happy to reflect but prefers working out what is coming next. “I’m thinking about how to be better every day. I’m pushing everyone — including myself — at the club to find an edge and a competitive advantage.”\nToulouse’s recruitment policy may be data-driven but Comolli believes the numbers will also lead you to the right characters. “We want good people and data helps us assess a lot of personality traits in players and their characters. If they do a lot of stuff off the ball, make runs to open space for another player, he’s a team player. If he constantly wants the ball, he’s got the personality when the going gets tough to say, ‘Just give me the ball’, so his team-mates can rely on him.”\nAdvertisement\nLikewise, he says: “The way we play offensively, if a player is selfish, it will destroy our model and our playing style.”\nToulouse are openly discriminatory when it comes to players’ ages — they want them to be 25 or below (only five members of the squad are older). When the decision — underpinned by data — is made, softer skills come in. “We spend a lot of time with the player, as much as we’re data-driven we are culture-driven as a club. We want to make sure the player’s culture fits into our culture and vice versa. Data is key but the human side is also very important.”\nAnd data, says Comolli, still has blind spots when it comes to recruitment. “We constantly talk about how to measure the performance of a very good young player in a poor team in a non-big five league. That’s a $1billion question and we are trying to solve it.”\n(Top photo: Patricia De Melo Moreira/AFP via Getty Images)",
  "word_count": 1648,
  "scraped_at": "2026-02-14T02:17:09.422968",
  "_text_extracted": true
}