{
  "article_id": "d09e0749a59e",
  "url": "https://playingfor90.com/2023/05/16/arsenal-latest-injury-form-transfer/",
  "title": "Arsenal : Latest injury news , form , and transfer looks",
  "date": "20230517T060000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Injury bug biting Arsenal\nOn Sunday, May 14, Arsenal dropped points at a crucial moment in the season yet again as the side suffered a loss to a powerfully developing Brighton Hove Albion.\nA concerning development in this match was a Gabriel Martinelli injury suffered less than a quarter into the match due to a risky challenge from Brighton’s Moises Caicedo, an Arsenal target for the next transfer window.\nGabriel Martinelli now joins key players such as Oleksandr Zinchenko, William Saliba, and Takehiro Tomiyasu on the injury list.\nGunners doctor Gary O’Driscoll was quite curt with his comments on the tackle stating, “Terrible foul, disgraceful, disgraceful foul,” according to The Sun.\nDespite the indignation and palpable disappointment in the atmosphere at the Emirates, O’Driscoll believes Martinelli should be okay. The Brazilian’s return is still under review.\nInjuries have led to subsequent dips in form for Arsenal as of late, which is reminiscent of last season’s failure to qualify for the UEFA Champions League. In 2021-2022, the team choked down the league stretch after losing both starting full-backs to injury.\nThough the Premiere League seems lost as dusk nears with the north London side unable to regain pole position ahead of Manchester City, notable progress has been achieved with Mikel Arteta. Still, similar problems plague Arsenal with their squad depth needing a few more additions.\nFuture at Arsenal\nThe transfer windows have proven fruitful for Arsenal the last few seasons as the club has strayed from big money gambles and settled for reliable, cheaper acquisitions.\nCosting €45 million , Gabriel Jesus has performed spiritedly this campaign with 10 goals and a knack for assertive hold-up play and high defensive work rate.\nZinchenko, a fellow former City ally, also made a move to Arsenal for €32 million , where he has proved pivotal in an inverted full-back system, over-loading midfield play. This is a tactic Guardiola employs, which allows for another possession outlet through the center pitch and more numbers to quickly reclaim the ball on 50/50 opportunities.\nMany Arsenal fans were ecstatic about talks surrounding Ukrainian target, Mykhailo Mudryk, and the 2022 FIFA World Cup Young Player of the Tournament, Enzo Fernandez, until both exciting youths received larger bids and signed for deep-pocketed London rivals, Chelsea.\nArsenal then shifted attention to cheaper, already established Premier League talents, Leandro Trossard and Jorginho, both whom have contributed positively to the shift rotation this year, enabling the team to run further with ambition.\nThe times when Arsenal made questionable transfer moves seem over as smart signings have gradually been purchased over the last few seasons. After some big spending flops in years past, the caution was understandable.\nThe club currently has its eyes on a collection of diverse, promising players, such as Bayer Leverkusen’s dangerously electric Moussa Diaby, attacking phenom Pedro Neto, deft technician Youri Tielemans, West Ham captain Declan Rice, and Brighton’s aggressive and dynamic Caicedo, according to Football Transfers.\nFollowing this season’s drop in performance – seemingly provoked by a Saliba injury and a drop in confidence from players like Bukayo Saka and Thomas Partey – it appears sensible for the Gunners, like the previous years’ dominating squads of Liverpool and Manchester City, to load the starting rotation with quality players.\nInstead of high-priced superstars, the club would be better served targeting affordable, promising, and seasoned hard-working players, who really punch in for the side. A continuation of a deeper bench could be the ticket to another, and more sustainable, attempt at the Premier League title in 2023-2024.",
  "word_count": 586,
  "scraped_at": "2026-02-14T02:00:19.997023",
  "_text_extracted": true
}