{
  "article_id": "d0d05424c945",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/30-under-30-young-people-28356268",
  "title": "30 under 30 : The young people inspiring the next generation",
  "date": "20240203T093000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "30 under 30: The young people inspiring the next generation in Merseyside\nWe are celebrating the young people who are carving out their own path\nIt is without argument, Merseyside is awash with inspirational and talented young people who are paving the way for generations to come.\nThese young people are working to change the shape of our futures whether it be through telling their own stories, the stories of others or working to make the world a nicer place. Here we have rounded up 30 people, under the age of 30, who are doing Liverpool and Merseyside proud.\nThis list, which is in no particular order, couldn't possibly include every single amazing person under 30 out there, so please add others and their incredible stories in our comments section below for other readers to see. Or drop us an email at news@liverpool.com\nREAD MORE: Win a £100 Aldi voucher to help with those shopping essentials\nREAD MORE:\nYou can read our last year's 30 under 30 list here, 2020's list here, 2019's list here and 2018's here.\nGeorgia Morgan\nGeorgia Morgan, 30, is the co-founder of PR, Communications and Event Management company Propel PR. Since creating the business in March 2019 with her sister Jade Morgan, Georgia has been the driving force behind PR strategies from a plethora of Liverpool businesses including award-winning restaurant-bar group GSG Hospitality.\nGeorgia, who started her career as a journalist before moving to PR, has helped many Liverpool companies including working with a range of hospitality businesses including Laros on Bold Street and in Mossley Hill, and has hosted events on behalf of Dash and new restaurant-bar Zenn, while also working with local businesswoman Kate Stewart who is currently focussing on her bid to help as many people in Liverpool during the cost of living crisis with complimentary Community Events each week at The Sandon Complex in Anfield.\nMollie-May Cartwright\nMollie-May started her fashion business from her mum’s kitchen table in 2017. Since then, CARAMELLA has become one of the North West’s leading fashion brands.\nFocusing on empowering women to feel their best in her pieces, Mollie-May has recently changed the brand's direction by hiring a fashion designer and appointing UK production factories. CARAMELLA is now predominantly produced in the UK and size ranges ranging from XS to XXL with the aim to be a truly British label with exclusive and unique designs to fit all sizes.\nGrace Whitford\nGrace Whitford was this year named the best busker in Merseyside.\nThe 23-year-old discovered she had a brain tumour when she was four-years-old, and began to lose her sight. And after a further two brain tumours were found, Grace completely lost her sight. However, she didn’t let this stop her. She knew music was her passion and dismissed advice to learn braille, instead choosing to learn to play to Grade 8 piano standard entirely by ear.\nGrace, originally from Hertfordshire, visited The Cavern Club in 2018 and decided she wanted to move to Liverpool for University to study popular music. Since then, she has performed in restaurants and at parties, and is now a regular busker in Liverpool city centre.\nBecca Abe\nNoticing that the majority of social activities and events for young people revolved around alcohol, 23-year-old Becca Abe decided to try and change this.\nTaking inspiration from women’s walking group Girls Who Walk Manchester, Becca, who moved to Liverpool aged 17, started her own walking group Girls Who Walk Liverpool for girls looking to chat and make friends in an alcohol free space.\nSince the group’s first meeting in Sefton Park, where 15 women turned up, the number of women who have shown up recently has shot up to upwards of 50 women. Becca said: “I never thought I'd pull something off like this. I just stopped and froze and nearly started crying, because I felt so proud of myself that I'd started something like this.”\nGaby Mendes\nGaby Mendes had the idea to run her own event after feeling let down by the education system. The 28-year-old living in Upton began her studies at a university in Birmingham, and found post graduation that there was no guidance for graduates looking to enter into the working world.\nAfter temporarily entering a teaching position, admittedly still clueless about what she really wanted to pursue, Gaby decided to start a podcast during the pandemic called ‘TalkTwenties,’ aimed at 20 something year olds in a similar position who felt at a loss after graduating.\nOnce restrictions had lifted Gaby created her own festival ‘TwentiesFest,’ where people got the opportunity to discuss mental health, travelling, relationship advice and how to transform their passion into a career. The event included talks from industry experts and entrepreneurs, with a ‘pay what you can,’ scheme to ensure that nobody missed out.\nLuke Littler\nThe 17-year-old darts prodigy, who hails from Runcorn and now lives in Warrington, was always destined for the top after he reportedly hit his first 180 after he joined a darts academy in St Helens. The star hasn't looked back since as he this year shocked the world by becoming the youngest player to reach the PDC World Darts Championship final, aged 16 years and 347 days.\nThe teenager, who has been hailed by former darts star Glen Durrant as “better than Michael van Gerwen”, lost 7–4 in the final against the newly crowned world number one Luke Humphries.\nFollowing the tournament, Littler was announced to be part of the 2024 Premier League Darts as one of the four chosen wildcards by the PDC.\nEllie Fenlon\nEllie Fenlon, 25, runs her own home interior business, Fenlon Interiors, which has racked up more than 1,000,000 likes on TikTok and 20,000 followers on Instagram.\nAfter dubbing herself the “queen of interior dupes”, Ellie’s followers regularly tune in to find the latest bargains on the market. From gift guides to helping people create styling arrangements, Ellie has dominated all things interior decorating.\nIn 2023 she was able to host her own styling masterclass which was sold out. In the future she will be holding more, due to demand.\nEllie said: \"It has definitely been a rollercoaster. I know social media shows my highlights, but I don’t think it's a job for the faint hearted.\n\"It's been extremely hard work but most definitely worth it and I get to share it with all my followers who have supported my through it all and I couldn’t be more grateful for that as I’m now living my dream. My advice to anyone would be you are capable of turning whatever passion or dream you have into your career.\"\nJude Riordan\nThe 12-year-old actor has made it onto the 30 under 30 list for yet another year as he continues to be a fan favourite on Coronation Street playing his on-screen character Sam Blakeman.\nJude’s acting career started in 2017 when he appeared on The Secret Life of 4, 5, and 6 year olds, a documentary on Channel 4.\nThe young actor from St Helens has won several awards for his performance on the ITV show, including an Arts award for Pride of St Helens in 2021, and the ‘Newcomer,’ award at the National Television Awards that same year.\nIn 2024, Jude will celebrate his fourth year of acting on the ITV soap.\nRuben Landim\nRuben is a 25-year-old from Toxeth who has made his way into the modelling world internationally. He is signed with MGM Models, representing huge names like JD, Nike, Gymshark and BoohooMAN.\nWhen he was 17, Ruben was approached in town and encouraged by family and friends to go for it. Before he knew it he was travelling all over the world as a model, with a highlight being a Nike seasonal campaign in Tokyo.\nGrace Warton\nGrace, 12, from Moreton, Wirral became one of the youngest models with Down Syndrome at just six years old.\nMum, Cheryl wants to challenge misconceptions of Downs Syndrome. She said: “She’s our little girl and that’s all we see. We don’t wake up in the morning and think about Downs Syndrome, she’s just our little girl.”\nGrace has modelled for huge names like the BBC, Disney, Marks & Spencer and Very.\nOliver Jude\nThis 18-year-old launched his own clothing brand four years ago, aiming to spread positivity through fashion.\nThe teenager from St. Helens faced frequent bullying at school, and believed he was viewed by other students as a “health and safety risk” because of his Autism and Tourettes.\nThe bullying took a huge toll on Oliver’s mental health, which led him to contemplate ending his own life in 2017. He said: “I had one thing that stopped me, and this was my inner passion.”\nThe business owner decided to release a clothing line of t-shirts adorned with positive affirmations, with slogans such as “Believe in yourself” and “Your potential is endless,” which has encountered huge success, supported by TOWIE star Gemma Collins.\nOliver’s brand was modelled on a runway at London Fashion Week in 2020, and the young entrepreneur has since been recognised for his achievements, winning the St Helens Borough Business award for ‘Entrepreneur of the year,’ and becoming a ‘Young person in Business’ finalist in the 2022 LGBTQ+ North West business awards\nTyler Morton\nThe 21 year old midfielder from Wallasey was scouted by Liverpool Academy aged just 7 years old.\nHe made his debut for Liverpool in 2021 and has featured in the Champions League, Premier League and Carabao Cup. He is now on loan from Liverpool, playing for Hull City.\nDys Alexia\nDys Alexia fled their home country of Romania at 14 years old.\nThe now professional drag queen came out at the age of 12, and experienced bullying including homophobic insults, as well as being pushed and spat at.\nThe 21-year old started a new life in Liverpool with the drag persona, continuing to be authentic and true to themself, even appearing in TV series Funny Girl on Sky. His struggles as a teenager contributed to his strong, flamboyant personality today. He has a successful drag career and two businesses behind him, meeting boyfriend, drag queen Linda Gold, at Pride in Manchester.\nCharlie McDonough\nCharlie sold his first pair of trainers as a teenager but it wasn’t until a terrible car accident that he decided to pursue it full time. Despite starting from his bedroom with just £12 in his bank account, The Block P has delighted Scousers with its fine range of 110s, as well as its own brand t-shirts, hoodie, clocks and baby grows.\nThe shop can be found on Renshaw Street. Speaking to the ECHO recently, the 26 year-old from Aigburth revealed he plans to expand to either Milan or Amsterdam.\nAaron Scarth\nAaron Scarth, 17, is from Liverpool and for the last six years he has been campaigning for the rights of children of prisoners around the world. This year he was selected to be on the shortlist of three and was runner up for the KidsRights International Children’s Peace Prize, which showcases young changemakers fighting for children’s rights across the world.\nHe has been trying to eliminate the stigma that is associated with parental imprisonment and wants to reduce the risks of others being bullied like he was, due to his father’s circumstances. Aaron told the ECHO: “What has happened to you is not your fault, and having a parent in prison does not define you.\n\"It might be part of your story but it’s not your whole story. Most importantly children with a parent in prison must not be referred to as future offenders. This is highly stigmatising and many children with a parent in prison go on to live extremely successful lives.”\nHe has spoken at multiple public events and in 2018, he helped rewrite the Council of Europe Recommendations concerning children of imprisoned parents so that it was available in child-friendly language. He also supported the development of the Child Impact Toolkit for children of prisoners which is now used across the country and endorsed by the UK’s Children’s Commissioner.\nHe has helped Liverpool City Council’s Child Friendly City Forums and Liverpool John Moores University’s Thinktank. This has led to getting funding for a research project run by the LJMU Journalism programme, which has the goal of creating a ‘best practice guide’ for journalists when reporting the crime of an offender with dependents.\nRio Boothe\nRio Boothe didn’t start seriously competing in sport until he started college. Now, he’s a world record holding para-athlete, working alongside various charities to provide a role model for those like him.\nThe 20 year-old has Cerebral Palsy Right-Sided Hemiplegia, which causes paralysis on the right side of his body. The John Moores student competes in a number of sports, such as the 100m, 200m and long jump. He is also a 2023 Para Laser Run World Champion, a sport which involves mid-range sprints broken up by laser pistol shooting, and a world record holder in his class. Through his popularity on TikTok, Rio has been able to work with charities such as Cerebral Palsy Sport and UP The Cerebral Palsy Movement, becoming an inspiration for many young children with Cerebral Palsy.\nJade Smith\nJade Smith, from St Helens, has developed her own braille for teaching the alphabet to children with visual impairments.\nThe 30-year-old has developed PRIOR, which takes its name from her grandmother’s surname.\nIt is her own system of tactile letter shapes that takes a simplified shape approach to braille dot formations. This helps visually impaired and blind children with extra additional needs to learn braille letter shapes through holding enlarged versions. The idea helps learners get used to the shape and link it to braille dot formations in the future.\nThis pre-braille method is already being used by young people in Liverpool, Lancashire, London, Wales and even in Missouri, in the US.\nThe SEN teacher is now a Qualified Teacher of Visual Impairment for the Royal School for the Blind in Liverpool and is studying for her MA in Teaching learners with visual impairments at Liverpool John Moores University.\nTrent Alexander-Arnold\nLiverpool FC's Trent Alexander-Arnold has shone this season, whatever position Klopp has played him in.\nA player that fans can relate to, the right-back was born in Liverpool, raised in West Derby and went to school in Crosby and Rainhill.\nAfter playing in Liverpool’s youth setup, he broke into the Reds’ first team back in 2017 and never looked back, going on to win every trophy in English football along with having a Champions League title under his belt.\nA man of the people, Liverpool’s number 66 helped volunteers tackling homelessness in December, calling it a “no brainer”. At only 25 and in the prime of his life, there’s surely plenty more to come from the Reds’ vice-skipper on and off the pitch.\nJamie Webster\nJamie Webster is at the top of his game. The Liverpool singer-songwriter headlined the city’s On The Waterfront music festival as thousands descended on the Pier Head for two nights of spectacular music last year. He also performed at the Left Field stage at Glastonbury and made the decision to step away from singing LFC songs, although still very much part of his musical identity, in August in order to focus on his original music. In a recent interview with the ECHO, Jamie admitted that 2023 was the year it all began to feel real for him. He said: “It’s a happy, happy time looking back, from the gig at Glastonbury and then within four or five days playing to 24,000 people in my hometown.“I’ll never ever take it for granted. Last year has probably given me another three years in this career - for a career that is very short lived, that's absolute gold. I've still got a platform to do what I love every single day.”2024 promises to be another spectacular year for the musician. His third album, 10 For The People, will be released on February 2, while another set of gigs is scheduled for Sefton Park this summer on July 12, marking the end of another UK tour.\nPaddy Pimblett martial arts\nUFC star Paddy the Baddy has achieved world fame through his brash and boisterous personality and his hunger for a world title in the planet’s biggest MMA promotion. While his dreams of a UFC belt have not yet been realised, the lightweight fighter’s self-belief is infectious and the 29-year-old has the backing of an entire city behind him.\nOn December 16, Paddy beat the legendary Tony Ferguson in Las Vegas after just over a year without a fight. Now, he and fellow UFC scouser Molly McCann are getting their own BBC reality series which will document both of their journeys inside and outside of the octagon as the best friends prepare to take on the “biggest fights of their lives”.\nThe Baddy’s next fight has not been confirmed yet but if the past is anything to go by, the hype and occasion will be huge.\nChloe Watson boxer\nProfessional boxer Chloe Watson made history in December by becoming the first female British European champion.\nThe 23-year-old, from Birkenhead, Watson landed the EBU European flyweight title after sealing a unanimous decision victory over Justine Lallemand in Bolton. Watson who is trained by former world champion Ricky Hatton, came on strong in the second half of the bout and was awarded victory by the ringside judges with scores of 97-93, 97-93 and 96-94.\nAfter her victory, Watson said: “There is still a lot to work on, but my first title at the age of 23 can only get better from here. It was really my first big fight, and everyone was excited for me, and I was excited for myself, but it was an experience as well.”\nMissy Bo Kearns - footballer\nOne of Liverpool FC Women’s fan favourites, local hero Missy Bo Kearns, at only 22, is still young and could have the potential to have a brilliant career.\nKearns, nicknamed ‘Bo Salah’, grew up surrounded by boys in the family, eventually joining boys team, Mossley Hill - the same team as Curtis Jones - before being scouted for Liverpool.\nKearns impressed for the Reds on their crusade to the Championship title in the 2021/22 campaign.\nHowever, it took some time for the 22-year-old to really find her feet in the top flight, however Kearns came into her stride in the second half of the season, with only Katie Stengel scoring more goals across the course of the campaign.\nJames Garner - EFC\nEverton’s young central midfielder James Garner was born in Birkenhead. After joining the Manchester United Academy at under-8 level, he made his Premier League debut for the Red Devils back in 2019, aged just 17.\nThe now 22-year-old joined Everton in September 2022, planting both feet back in Merseyside.\nOn September 27, 2023 the local lad scored his first goal for Everton in a 2-1 win away at Aston Villa in the Carabao Cup before scoring his first Premier League goal in October during a 3-0 defeat of Bournemouth at Goodison Park.\nA regular starter for the Toffees, Garner has the youth and potential to go far.\nKhan Odita\nKhan Odita founded the Mulgrave Street Action Group (MSAC) and concentrates his efforts on making a difference in his community.\nMSAG was established as a Community Interest Company (CIC) in August 2021 by Khan when he was just 14. The group was formed in response to a sharp increase in flytipping. He and a group of volunteers have also built a community garden on Mulgrave Street. The group, headed up by Khan, launched UrbanScape in April 2023.\nBethany Wainwright\nBethany Wainwright is a 27-year-old entrepreneur from Maghull.\nThe businesswoman created her brand Boosted - a high quality, supportive and inclusive breast tape and accessory brand - as a sideline project in August 2022 after growing tired of struggling to find supportive alternatives.\nBethany, who studied Fashion Promotion at University of Central Lancashire, couldn’t believe her luck when she went viral on TikTok after launching her first product.\nBoosted specialises in supportive and inclusive breast tape and accessories including its signature tape in shades Latte, Tan, Mocha, Coffee and Black, as well as the White shade for brides to be, Boosted Tape’s Removal Oil, Petals and Double Sided Body Tape.\nInitially having Boosted’s signature tape made from a factory for her own personal use, Bethany then set about creating more products that would solve the problem of wearing outfits that needed support in order to help real women, with real body shapes and types. Since then, the Merseyside entrepreneur has turned over six figures as well as securing a huge deal with fashion powerhouse PrettyLittleThing in November 2023.\nIn just over 12 months, Bethany secured a 600sqft unit with two floors that serves as her office and warehouse space and hired her first employee. Having previously managed and personally undertaken every single aspect of the business from building the website to managing TikTok shop, all of Boosted’s social media channels, creating content, customer service and packing and sending orders, Bethany has relished in the extra support with her first and very valued employee helping with all areas of the business, allowing Boosted to facilitate more orders, upload more products communicate directly with customers.\nSince the PLT deal, Bethany is now on the hunt for a bigger unit to cope with the overwhelming demand and orders that Boosted is enjoying.\nAfter thriving on TikTok shop, 2023 has seen Bethany focus on diversifying the brand and growing the business on other platforms and continues to push the boundaries as a woman in business.\nLiam Quirk\nLiam Quirk is a 26-year-old entrepreneur and owner of his SEO company Quirky Digital as well as being an Associate Director of Tranmere Rovers Football Club making him one of the youngest directors in the English Football League.\nLiam, from New Brighton, started his SEO business back in May 2020 after realising there was a huge gap in the UK market for performance-based SEO and took the plunge to start his own company. The day before Boris Johnson announced the UK’s first national lockdown during the pandemic, Liam handed in his notice, used his life savings and worked from the spare room in his parents’ house to get Quirky Digital off the ground.\nNow providing SEO and Digital PR to over 50 clients across the UK in various sectors including healthcare, SAAS, investments, real estate, addiction, e-commerce and professional services, Quirky Digital has 14 employees, has an office in Oriel Chambers on Water Street and is projected to turnover £1.2m in 2024.\nHaving left school with three GCSEs, Liam utilised his passion for business after being introduced to SEO by his uncle whilst he was still in senior school. He started building his own websites and committed himself to understanding algorithms and pushing the boundaries online.\nLeighton Need\n12-year-old Leighton Need has created a clothing brand that is gaining an army of followers, including some celebrities. Leighton, from West Derby started his own company, 'Mountain Eclipse', after asking his grandad for a small investment.\nThe schoolboy-turned-entrepreneur has been referenced online by several famous faces, including O Beach owner and brother of Gary, Wayne Lineker and comedian Adam Rowe. He's also agreed to sponsor his Saturday league football team's kits.\nLeighton's dad, Craig Need, told the ECHO: \"Leighton's always drawn and designed. One day he came to me and said that he wanted to make his own brand, so I told him to go for it.\n\"He went to his grandad and asked for a £100 investment - which he gave him. He went and bought some caps and found an embroidery shop. He came up with the logo and arranged for 12 hats to be made, which all sold out in a day to his mates and people he knows.\"\nSahan Aslan\nSahan Aslan, 22, is the manager of the highly successful Anar Turkish BBQ Restaurant on Prescot Road in Fairfield. The restaurant has been shortlisted for the “best kebab restaurant regional” award for the second year running. It won last year, in 2023, and Sahan is confident that it can do so again.\nSahan is also keen for Anar and the L7 Village Market to help strengthen the community of Fairfield. He previously told the ECHO: \"[Winning the award] will help Kensington to show successful businesses come out here and encourage investment into the community.”\n“I’d just love to grow the area and make a name for Kensington. When we started out, people said it would never work and we would close down right away, but we proved everyone wrong.”\nJamie Cook\nJamie Cook ditched her full time job to run a business now loved by a Strictly Come Dancing star Ellie Leach. Jamie is the owner and founder of Dorathy & J, a jewellery and accessory brand which specialises in ear stacking and ear design based in Kirkby and over the years, the 29-year-old's business has become a huge success across Merseyside.\nBut the mum-of-two said it's taken several years to get where she is today. Her business started as a side hustle while she worked a full-time job at Barclays bank.\nSpeaking the ECHO she said: \"I started with making pompom keyrings. I think it was a year after I had my daughter. I was only 21-years-old and working at Barclays [bank]. I wanted to do something that fulfilled me.\"\nJamie sells dainty jewellery and ear stacking and named the business Dorathy & J after her nan. She said: \"I never had any [business advice] It wasn't a fast growth. It's been years and years.\" Jamie added: \"D&J has been a slow and steady project, but I grew it all organically myself and I've learnt so much along the way without feeling overwhelmed.\n\"I constantly have plans of expanding and bringing you even more amazing pieces, piercings, experiences and spaces.\"\nSafiullah Sadiqi\nSafiullah Sadiqi, 19, was born in Afghanistan but fled the country after the withdrawal of US and UK troops in 2021 led to the collapse of the Western-backed Afghan government and the resurgence of the Taliban.\nDetermined to provide a better future for himself and his family, Safi left the country. Speaking to the ECHO, Safi said: “I came from Greece, to Germany, to France, I lived for three months in a forest, I risked my life. It’s risky leaving Afghanistan. You might die.”\nIn 2022, Safi arrived in the UK. At first he lived in London, before being transferred to Warrington and then Liverpool, where he has been studying in English and Maths at the City of Liverpool College. Joking, he said: “It was quite hard at first to live in Liverpool because of the accent. Now I'm more confident. I can speak and communicate far better now.”\nHowever, Safi had a passion which he was determined to continue in his new city. Safi said: “My father is a boxer. I’ve done boxing since I was 10 or 11.”\nSafi’s record speaks for itself - a three-time Afghan national champion and three-time Greek national champion. Safi discovered the Golden Gloves boxing gym on Lodge Lane in Toxteth and he has quickly become an invaluable member. He has the responsibility of opening and closing the gym and training a women’s class there too.\nSafi is already preparing for his next fight, which will take place at the Liverpool Olympia on West Derby Road on February 24. He claims that the pressure of matches is nothing compared to what he has already been through.\nDon't miss the biggest and breaking stories by signing up to the Echo Daily newsletter here",
  "word_count": 4619,
  "scraped_at": "2026-02-14T02:10:42.029782",
  "_text_extracted": true
}