{
  "article_id": "d0f889f0618b",
  "url": "https://www.managingmadrid.com/2025/7/28/24475988/road-to-madrid-part-i-calamari-cortado-and-the-kings-of-europe",
  "title": "Road to Madrid - Part I : Calamari , Cortado and the Kings of Europe",
  "date": "20250728T214500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bus 126 took just three stops—eight minutes in total—from my hostel to the closest point near the Bernabéu. On the Metro ride from Barajas airport, I had been a mess of nerves. I had barely tossed my bags onto the hostel bed before sprinting out again—as if I were chasing a 90th-minute equalizer in a Champions League semifinal second leg.\nRoad to Madrid - Part I: Calamari, Cortado and the Kings of Europe\nNothing prepares a first-time visitor for the moment the Bernabéu comes into view.\nThe bus hissed to a halt. The doors opened on the right. I stepped off, eyes glued to my GPS, seeking the next turn. When I finally looked up, the bus had pulled away—and there it was. No fanfare, no warning. Just the silent, paramount presence of it: the Estadio Santiago Bernabéu. Towering, gleaming, unapologetically grand. The home of the 15-time kings of Europe, the ultimate showcase of Spanish football.\nIt took a moment to register that I was standing before it—not in a photo, but in the flesh. For as long as I can remember, I had imagined this. When it struck me, it did so with all the weight of memory. And I didn’t mind. Not one bit.\nThis was my first time in Madrid. My first time in Spain. My first time in Europe, in fact. The layover at Schiphol Airport in Amsterdam had already offered a teaser of the continental shift—the architecture, the advertisements, the giant cheese stores. Madrid didn’t break the spell.\nI live in downtown Toronto, where the traffic is diabolical. Renting a car in Madrid was out of the question. This trip was half work, half vacation—and fully not worth the stress of navigating another city’s chaos including the headache of parking. Instead, I bought a week-long Zone T transit pass at the airport. Metro, buses, trains—virtually everything covered. It was the first thing I sorted after collecting my carry-on at Terminal 2.\nThe word that came to define my first few hours in Madrid was character. It was defined in everything—the streets, the buildings, the people. The architecture stood apart from anything I’d known in North America: bold, sun-aged, full of detail and personality.\nEven the fashion had its own language—colourful, confident, striking a balance between flair and restraint. Nothing felt forced, yet everything made a statement.\nBack home, Montreal and Quebec City have always been my favourite escapes. Pockets of French charm that almost touch the spirit of Europe. But this was no approximation. Madrid was the real thing. Europe, lived-in and layered.\nPuerta del Sol and Gran Vía sit just one Metro stop apart—stations named, fittingly, Sol and Gran Vía. The square felt less like a landmark and more like a stage—alive, expressive, unfiltered. People danced, debated, embraced, protested. A celebration of presence and permission—the freedom to speak, to believe, to simply be.\nBetween all that, I sat down with my first cortado in the country that gave it to the world. It tasted like a really good cortado.\nJet-lagged and running on fumes, I still had time to kill before heading to Valdebebas for Ancelotti’s press conference. So I walked. Gran Vía in the early hours felt like a different place—its daytime buzz replaced with a quiet stillness. My destination—Cibeles—the square where Sergio Ramos once dropped the Copa del Rey from a bus and later lifted the Champions League trophy three times in a row.\nMy first game as a journalist at the Bernabéu came a day later. One of the few things I’ll ever admit to being proud of: I am anxiously early to everything. Especially things that matter. Kickoff against Leganés was at 9 p.m. CET. Media access opened at 7. I got there well before that. But I was not alone. There were fans everywhere. The scarf vendors had already set up shop.\nI hovered by the media gate, collected my pass, and was directed to the eighth floor. It took a few turns and a decent walk to reach my section of the press box. When I finally stepped inside, the view hit me: Real Madrid spelled across the seats, the stillness before the storm. The stadium was almost empty. I took a breath and let it land.\nFrom that vantage point, high above the pitch yet close enough to read the rhythm of the game, everything felt clear. But what struck me most wasn’t what I could see—it was what I could hear.\nThe Bernabéu is loud. That doesn’t always translate through a screen. When the crowd chants Cómo no te voy a querer or Así gana el Madrid in perfect unison. A wall of noise that moves through you.\nAnd then there’s Hala Madrid y nada más. Hearing it live is one thing. Living it is another. During the chorus, the speakers cut out completely. No instrumentals. Just 70-80 thousand voices carrying the anthem on their own. If you’re a Real Madrid fan, it’s one of the most surreal experiences you can have.\nThe vending machine coffee at the stadium wasn’t much to speak of—but it did the job. Not that I needed help staying alert at that point. They also handed out complimentary water bottles—the same blue ones you’ve seen Pep Guardiola nervously sipping from when Manchester City are conceding late goals at the Bernabéu.\nPost-game protocol meant heading two levels below ground to the press conference room. Just minutes after wrapping a podcast segment with Kiyan Sobhani, I rushed down to catch Carlo Ancelotti’s post game press conference. He wasn’t particularly pleased with his team’s showing, and his tone left no doubt. The press room matched the rest of the stadium: sleek and spacious.\nBy the second game—against Real Sociedad in the Copa del Rey semifinal—I had the routine down. But that night added something extra. I met Sid Lowe and Alex Kirkland. Sid is someone I’ve read for years—a writer whose ability to translate the soul of Spanish football into English remains unmatched. And I’ve been listening to Alex on the Spanish Football Podcast for just as long.\nAfter the game, Sid and I ended up having a long chat in the press room about Real Madrid’s comeback DNA. Midway through, I caught myself thinking: Is this really happening?\nLa Campana is a small bar tucked into a side street near Plaza Mayor, open since 1870. It predates both world wars and even Real Madrid itself. From the outside, it looked like a rugged, no-nonsense eatery. I joined the queue. My very limited Spanish vocabulary included uno, which I pronounced with misplaced bravado when the server asked how many (I think). I found a seat and ordered two: one for here, one to go. The second one was basically my stadium meal during the La Real game.\nThe sandwich arrived with mayo and olives on the side. I skipped the olives and went straight in. One and a half bites were enough to convince me: this was the best calamari I’d ever had. Crispy, fresh, perfectly seasoned—probably a touch of MSG—but each element stayed in its lane. The bread didn’t smother the calamari. The batter didn’t drown the flavour. It was balanced. Fried calamari at its finest.\nStay tuned for part II—where we will explore Valdebebas.",
  "word_count": 1212,
  "scraped_at": "2026-02-14T02:26:46.356736",
  "_text_extracted": true
}