{
  "article_id": "d11170923cd4",
  "url": "https://www.themag.co.uk/2024/07/if-we-could-make-this-one-happen-wed-add-a-world-class-talent-to-right-hand-side-of-newcastles-attack-newcastle-united/",
  "title": "If we could make this one happen , wed add a world - class talent to right - hand side of Newcastle attack",
  "date": "20240704T183000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If we could make this one happen, we’d add a world-class talent to right-hand side of Newcastle’s attack\nWith the surprisingly stressful PSR deadline now in the rearview, Newcastle United can turn their attention to incoming players ahead of the new season.\nIt has universally been reported that we are prioritising an upgrade to the right wing position which, given Minteh has already departed and Miggy continues to be linked with a move to the Saudi Pro-League, makes a lot of sense.\nExactly who we are targeting seems to be a source of much debate and the club has been pretty tight-lipped about most of our transfer targets since the change in ownership. With the exception of maybe Sven Botman, there weren’t really any prolonged rumours ahead of our “big” signings in the past 2+ years.\nThat being said, we have seen plenty of names linked with a move to Newcastle United, all credible in their own way.\nI love a bit of transfer gossip and some stats, so I’m going to have a bit of a dive into some of the players Newcastle United have been linked with and throw out a suggestion of my own at the end (albeit an outlandish one).\nI’m primarily going to compare the players discussed with the Miggy Almiron position, as the consensus seems to suggest he is the player likely to make way for a new big arrival.\nJarrod Bowen (West Ham United; 27 years old; Market Value £42 million; Likely Fee £50-60 million; Contract Remaining 6 years)\nHad it not been for Mike Ashley’s tight pockets, Jarrod Bowen may well have been a Newcastle Player already.\nAllegedly all terms were agreed with the player back in 2020 but Ashley and Charnley typically failed to get this one ‘over the line’.\nA predominantly left-footed player who plays on the right, most of us will be familiar with Bowen as he’s been one of West Ham’s leading players over the past 3 seasons netting double figures in each. The biggest advantage Bowen has over our current RW options is his goal contributions.\nIn the Premier League last season, Bowen hit 16 goals and 6 assists, comfortably outperforming his combined xG and xA of 17.2. Expected stats have their flaws but, I think when you hold them up against actual goals and assists, they give you an indication of how efficient a player is in the final third and Bowen is consistently ruthless.\nOne characteristic of our wide players under Eddie Howe is the ability and willingness to contribute to the team defensively, and Bowen is probably the strongest player on this (my) NUFC list in that regard. His defensive actions are spread evenly in each third of the pitch, a little surprising given West Ham’s generally negative play, and his tackle success rate is only marginally behind Almrion’s at 37.1%.\nBowen’s weakness is probably his ball control and dribbling, he holds a successful take-on rate of 35.1%, quite a bit lower than Miggy, although he does attempt more take-ons. While he may not be the greatest dribbler, as can be seen by his 6 assists, he does cross the ball into the box far more than Miggy (75 vs 24) so he does plenty of work in the final third.\nWith his long contract and importance to West Ham, Bowen is probably the most expensive and least likely option on this list, but arguably is the best fit.\nRaphinha (Barcelona; 27 years old; Market Value £42 million; Likely Fee £50 million; Contract Remaining 3 years)\nAnother player familiar from his time in the Premier League, Raphinha has been loosely linked with Newcastle over the past few transfer windows, in part because of Barcelona’s financial struggles.\nLike Bowen before, Raphinha is a left-footer who plays off the right. The Brazilian doesn’t have the same goal output as Bowen but is definitely the best technician with the ball on this list.\nHe picked up 9 assists last season in La Liga for Barcelona, coupled with 6 goals, which meant he outperformed his combined xG and xA of 12.3.\nWhile he’s not a frequent dribbler of the ball, Raphinha is very successful when he does, beating his man 52.2% of the time.\nAs I already mentioned, Raphinha’s biggest strength is his ability on the ball. An accomplished set-piece taker he also contributes heavily in terms of chance creation when he’s on the pitch, creating 5.9 shots a game for his team (compared with 2.4 for Miggy and Bowen).\nStatistically, Raphinha’s defensive output is probably the weakest area of his game, only winning 22.2% of his challenges, but his time, and success, in Bielsa’s high pressing system at Leeds show at the very least a willingness to commit to his defensive work.\nWith the emergence of Lamine Yamal at Barcelona, Raphinha is very much a realistic target this summer. I’d expect Barcelona would want to at least recoup the £50 million they paid to Leeds for him, but in the current market, I think that is probably quite good value.\nA lack of Champions League football could be a potential stumbling block but hanging onto his international teammate Bruno Guimaraes could persuade him of our intentions.\nFederico Chiesa (Juventus; 26 years old; Market Value £30 million; Likely Fee £30-40 million; Contract Remaining 1 year)\nChiesa burst onto the scene 3 years ago at the delayed Euro 2020 tournament as Italy’s key attacking threat.\nHe pretty much exclusively operates as a RW for Italy and, in what was a very disappointing tournament for the Azzurri this summer, has shown some flashes of his quality.\nDomestically, Chiesa has played as a second striker alongside Vlahovic but tends to come off the left. This positional flexibility is something Howe has favoured in recent recruits, with all our forward players able to fulfil multiple roles across the front line if needed.\nChiesa performed slightly under his combined xG and xA of 11.9 last season, registering 9 goals and 2 assists, but in terms of the chances he is creating, Chiesa is second on this list only to Raphinha with 4.8 per game. He is also a prolific crosser of the ball, putting in 117 crosses despite largely operating in a more central position. If he could reproduce these numbers in the black and white of Newcastle, then you would imagine having the quality of Isak in the middle would see a big uptick in his numbers.\nContrary to Bowen and Raphinha, Chiesa’s biggest strength is his dribbling. As a naturally right-footed player he would operate a little differently to the left-footed options, but Jacob Murphy creates a high volume of chances from the RW position and Chiesa’s quality means he is undoubtedly the better player.\nHis take on success rate for Juventus last season sat at a respectable 36.8% but when you look at his numbers off of the right for Italy, they are exceptional, winning his individual battles over 56% of the time at a much higher volume than Raphinha.\nDefensively, his numbers are the lowest of the players on the list for last season but, this will be impacted heavily by the more advanced role he plays for Juve and being an Italian international you would expect he would be able to adjust to Howe’s style of play.\nGiven Chiesa has entered the last year of his contract there is plenty of talk around whether Juventus may decide to cash in on his talent rather than face the risk of letting him leave for free. Perhaps the biggest obstacles here would be the lack of European football and potential wage demands but, if we could make this one happen, it would add a world-class talent to the right-hand side of our attack.\nBryan Mbeumo (Brentford; 24 years old; Market Value £33 million; Likely Fee £40 million; Contract Remaining 2 years)\nWhat many would consider as the first of the two more realistic options on the list, Brentford’s Mbeumo will be a familiar face to all of us.\nHe led the line for the Bees effectively in Ivan Toney’s absence but ordinarily operates off the right-hand side, cutting in and onto his favoured left foot. Another player who outperformed his xG and Xa stat of 13.3 for last season, Mbeumo registered 9 goals and 6 assists in a tough year for Brentford, despite missing a number of games through injury.\nA quick and powerful runner down the right, Mbeumo manages to create plenty of chances, 3.77 shots per game, despite still being a little rough around the edges. He’s not the strongest player defensively only winning 26.3% of his challenges and contributing the fewest defensive action per 90 minutes of any of the players on this list. This particular stat would suggest that if we were to sign Mbeumo, I would expect to see Jacob Murphy start the season until Mbeumo earns Howe’s trust.\nHe is only 24 years old though and given Eddie’s record of improving players through coaching, I think there is a high ceiling for Mbeumo. His take on success rate is a solid 33.3% and he gets plenty of crosses into the box, so you would expect Isak to enjoy that aspect of his game.\nA probable £40 million outlay is obviously a bit of a gamble for a player who perhaps hasn’t reached his full potential yet but I’m sure I’ve heard that one before?\nAnthony Elanga (Nottingham Forest; 22 years old; Market Value £19 million; Likely Fee £30+ million; Contract Remaining 4 years)\nA name that popped up as part of the discussions around Elliott Anderson’s move to Forest last week, I was pretty impressed with Elanga’s development over the second half of last season.\nBlessed with incredible speed and able to operate down both flanks, Elanga is still far from the finished article but has fantastic potential.\nDespite Forest flirting with relegation pretty much all season, Elanga also put up some solid numbers from his 25 starts, slightly outperforming his combined xG & xA of 13.3 with 5 goals and 9 assists. He matched Chiesa’s stats for successful take-ons, winning 36.8% of his duels, but perhaps surprisingly only put in a modest 58 crosses despite having Chris Wood to aim at.\nOne area that is a surprising standout for Elanga is his defensive output. You would expect Forest players to get through plenty of defending, but Elanga was able to come away with a tackle success rate of 47.2% and his numbers for interceptions and where on the pitch he is winning the ball, compare favourably to our current RW options.\nFor a young player who doesn’t score a lot of goals he still needs to work on the quality of his final ball, creating a modest 2.6 shots per game but as the youngest player here, he has an excellent level of potential.\nPerhaps the biggest question about Elanga is, if we can get Forest to part ways with the young Swede, is can he be the player we need right now to make the next step?\nAnd that brings me to my suggestion…\nJeremie Frimpong (Bayer Leverkusen; 23 years old; Market Value £42 million; Likely Fee £40 million (alleged release clause); Contract Remaining 4 years)\nYes, I know he’s mostly played as a right wing-back.\nYes, I’m aware he’s about to play in the Champions League next season.\nYes, I’m aware he’s attracting interest from the likes of Arsenal and Man City.\nI’ll be honest, despite reports that Frimpong has a release clause active for £40 million pounds during July, this is certainly a very unlikely deal. However, we were told Bruno, Botman, Isak and Tonali were all unlikely, so I still think the Dutchman is worth a mention here and if there was any way to secure his signature, I’d pull out all the stops to do so.\nFirst off, let’s talk position.\nFrimpong is often listed as a right-back but if anyone has watched Leverkusen over the past year, they will know this is a very misleading label. He plays as a very advanced wing-back for the German champions, emphasis on the wing, and bagged 9 goals and 7 assists in the Bundesliga on a combined xg and xA of 14.\nFor the Netherlands he has often featured as part of their front 3, bagging a goal against Canada in a warm up game before the Euros.\nIf anyone watched West Ham come up against Leverkusen in Europe this year you will have seen Frimpong bag an 89th minute equaliser to send the Hammers packing, so he has the ability to operate at the top end of the pitch.\nGareth Bale started life as a left-back and found glory as a winger, I would be surprised if Frimpong didn’t find his home on the wing moving forward.\nHe generated 3.4 shot-creating actions per game across the course of the season and his crossing from open play and dead-ball situations were very good. He’s also a prolific dribbler, attempting more take-ons than anyone on this list, with a 45.3% success rate to boot.\nFurthermore, he is excellent in the tackle, winning 40% of his challenges.\nThe advantage of targeting a player like Frimpong is that he would be able to complement Tino Livramento down our right-hand side in the long run.\nI fully expect Trippier to start the season at right-back but having a player like Frimpong in our squad gives you a top-level player able to cover anywhere down the right-hand side of the pitch and would add a level of tactical flexibility when shifting formations during a game.\nAs I said before, I think the chances of this one are very slim to none, but if I could pick one player to sign this summer, it would be Jeremie Frimpong.\nI know there are a few names that have cropped up that I haven’t mentioned here; Gibbs-White and Madueke for example, but I think I’ve covered some of the best options that we have been linked with.\nIt wouldn’t surprise me if we go and sign someone completely off the radar but for what it’s worth, I think any of these lads would help take us on next season in their own way.\nA quick thank you to fbref.com and www.transfermarkt.co.uk for the stats and transfer values.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 2403,
  "scraped_at": "2026-02-14T02:01:23.798151",
  "_text_extracted": true
}