{
  "article_id": "d12e941e7f6d",
  "url": "https://dailyexpress.com.my/news/232854/kane-hits-33rd-goal-in-bayern-stroll/",
  "title": "Kane hits 33rd goal in Bayern stroll",
  "date": "20240422T060000Z",
  "domain": "dailyexpress.com.my",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "BERLIN: Harry Kane claimed his 33rd league goal of the season and Thomas Mueller scored twice as Bayern Munich thrashed Union Berlin 5-1 away in the Bundesliga on Saturday.\nJust a week after Xabi Alonso’s Bayer Leverkusen broke Bayern’s 11-year title run, the visitors were dominant and clinical in the German capital.\nKane curled in an excellent free-kick and laid on a second-half goal for Mathys Tel. The England captain is eight shy of Robert Lewandowski’s single-season Bundesliga goals record with four games remaining.\nBayern rested Jamal Musiala after Wednesday’s 1-0 win over Arsenal sent them through to the Champions League semi-finals but they had no difficulty creating chances against Union.\n“We’re happy—it was a perfect week. It was by no means guaranteed that we’d win like that,” said Bayern coach Thomas Tuchel.\nHanded a rare start, French teenager Tel set up Leon Goretzka’s 29th-minute opener, with Kane doubling the lead in first-half stoppage time.\nMueller, playing his 470th Bundesliga game for Bayern, scored both of his goals in the second half, either side of a strike from Tel.\n“We fought hard from the get go and played well right up until the end,” said Goretzka.\n“We’ve still got a huge target in the Champions League and we want to keep the season alive.”\nUnion, who faced Real Madrid and Napoli in the Champions League this season, pulled one back late through Yorbe Vertessen, have now won just one of their past eight and sit three points clear of the relegation places.\nEarlier, RB Leipzig tightened their grip on fourth place, the final guaranteed Champions League spot, with a 2-1 win at Heidenheim as Lois Openda scored his 23rd goal of the season.\nLeipzig striker Benjamin Sesko opened the scoring shortly before half-time, pouncing on some disorganised defending from the home side for his 10th league goal this term.\nHeidenheim, who have beaten Bayern Munich and drawn with Dortmund twice in their first season in the top division, struck back with 20 minutes remaining, Nikola Dovedan heading in following a free-kick.\nLeipzig, who are in a battle with Champions League semi-finalists Dortmund for fourth place and host them next week, grabbed the winner with five minutes remaining when Openda tapped in a Mohamed Simakan pass.\nLeipzig sit three points clear of Dortmund who host champions Leverkusen on Sunday. Fourth place guarantees play Champions League football but fifth could also be enough due to the strong performances of German sides in Europe this season.\nRB captain Willi Orban was pleased his side made it through an “incredibly difficult match”, telling Sky “plenty of top sides have dropped points here, but we’ve taken all three—it was deserved.”\nElsewhere, a hat-trick from Borussia Moenchengladbach’s Robin Hack was not enough as his side lost 4-3 at Hoffenheim.\nHoffenheim led 3-1 midway through the second half before Hack scored twice in 11 minutes to level the score with just a minute remaining, but Anton Stach scored in stoppage time for the home side to snatch victory.\nBottom side Darmstadt won their first league match since October, beating second-last Cologne 2-0 thanks to goals from Oscar Vilhelmsson and Cristoph Klarer.\nDespite the win, Darmstadt remain 10 points from safety with four games remaining.\nCologne’s chances of beating the drop are falling fast. They are five points away from 15th-placed Bochum, the final safe spot.\nBochum lost 1-0 at Wolfsburg, with Ralph Hasenhuettl’s side winning thanks to a goal from Jonas Wind.\nWind’s goal deepened Bochum’s woes a week after sacking coach Thomas Letsch, with the side just one point clear of the relegation spots.",
  "word_count": 598,
  "scraped_at": "2026-02-14T02:07:51.321495",
  "_text_extracted": true
}