{
  "article_id": "d135a1f43f0f",
  "url": "https://thenationonlineng.net/forza-napoli/",
  "title": "Forza Napoli | The Nation Newspaper",
  "date": "20230506T114500Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nMay 6, 2023 by Oluwamayomikun Orekoya and The Nation\nForza Napoli\n- Osimhen, Kvaratskheli become Napoli greats like Maradona\n- How wine-loving eccentric Spalletti ended club’s years of hurt\n- Revealed: Unsung heroes in title glory\nVictor Osimhen and Khvicha Kvaratskhelia stand alongside Diego Maradona as Napoli greats after powering southern Italy’s biggest football club to just their third Serie A title. Osimhen and summer signing Kvaratskhelia, 22, have struck up a devastating partnership this season which has been central to Napoli winning their first league crown since 1990 and fulfilling the dreams of a generation of supporters.\nOsimhen has become one of the most devastating centre-forwards in European football, clattering in goals left and right and leading the team through the example of his immense hard work both on and off the ball.\nThe 24-year-old has netted 22 times in 26 league appearances, three more than his nearest rival for this year’s ‘Capocannoniere’, or league top scorer, with five games remaining.\nInjury on international duty has slowed down the Nigeria forward’s scoring rate but between returning from a thigh injury in mid-October and the most recent round of African Cup of Nations qualifiers last month he averaged a goal a game.\nOsimhen scored 23 times in 23 matches in all competitions over that period, propelling Napoli to the brink of a historic Scudetto and becoming a bona fide fan idol even before he scored the goal that secured the title on Thursday.\nCakes, coffees and easter eggs began to be made in his honour while children around the city wear face masks similar to his own.\nCardboard cut-outs of him and Kvaratskhelia pop up alongside long-standing murals of Maradona around Naples, as do separate depictions of Napoli’s new dynamic duo.\n“You can boot the ball at him or in behind him and he always manages to get hold of it,” said Napoli coach Luciano Spalletti earlier this month. “He’s also a fan favourite so when he plays he creates a wave of enthusiasm for the whole team… Players like him are just made of something different.”\nBut although Napoli and Naples are currently on top of the world, Italian football hasn’t been the world’s richest and most powerful for decades, and the idea of players of their quality staying for the seven years Maradona did now feels like a fantasy.\nBetween them Nigeria striker Osimhen and Kvaratskhelia have scored just under half of Napoli’s 69 league goals, the Georgian wing wizard also setting up 10 and providing the kind of individual brilliance which already has the world’s top club’s circling.\nPerhaps put under too much pressure to deliver in his first season in a major championship, Kvaratskhelia’s form has wobbled in recent weeks but both he and Osimhen have shone so brightly this season questions over their futures are already being asked.\nNapoli are one of the few Serie A clubs on a stable financial footing but owner Aurelio De Laurentiis is eventually going to want to cash in on his most valuable playing assets.\nRumours are already swirling of nine-figure sums being offered for Osimhen, whose contract expires in two years’ time and who said last month that it is his “dream to play in the Premier League someday”.\nLate last month De Laurentiis blasted local reporters who asked the film mogul about a renewal to Kvaratskhelia’s contract which runs all the way to 2027, calling them “pains in the neck who… only think about filthy money”.\nHowever in reality Napoli are preparing a one-year extension to Kvaratskhelia’s deal, more than doubling his salary of 1.2 million euros a season in a bid to stave off attention for Europe’s richer clubs.\nAnother run at the Champions League after reaching the quarter-finals for the first time might yet convince Osimhen to stay a little longer, enough time to for Napoli to trying going from a romantic storyline to establish themselves as a serious force at home and abroad.\nMeet wine-loving eccentric Spalletti who ended Napoli’s years of hurt\nNapoli’s historic Serie A title might be victory for some of Europe’s most passionate, long-suffering fans and a downtrodden city, but it is also personal triumph for Luciano Spalletti, the man they said could not win.\nIn a country full of big football personalities Spalletti might just be the quirkiest; a wine-making, highly-quotable eccentric who has earned the big-time success his long and eventful coaching career deserves.\nAt 64 years old, Spalletti is the oldest ever coach to win the Italian title but his vibrancy and the modern, free-wheeling way his Napoli team play bely his advancing years.\nHe is also one of the most camera-friendly coaches around, his oak-coloured pate and world-weary smile as instantly recognisable as the enjoyable football his teams play.\nAs a lower league player the closest he got to greatness was pulling Diego Maradona’s shirt in an Italian Cup match, now he leads a team ready to emulate the one inspired by Naples’ Argentine icon.\n“I haven’t been travelling around in first class, gazing out of the window. I’ve had to hitch-hike,” said Spalletti after the last-gasp win at Juventus which all but sealed the title. Being in a position to win the Scudetto is repayment for all the sacrifices I’ve made over the years.”\nBefore Napoli, Spalletti was best known for his two spells at Roma, where he won two Italian Cups and the Italian Super Cup for a success-starved club, one which had gone through four managers and almost got relegated the season before he first arrived there in the summer of 2005.The previous year he had led tiny Udinese into the Champions League positions and at Roma he would do the same, while also being the man behind one of this century’s most significant tactical developments.\nYears before Lionel Messi became Barcelona’s fabled ‘false nine’, Francesco Totti was playing the exact same role under Spalletti, a move which would make Roma one of the most exciting teams in Europe and turn the Italy forward from a classic number 10 into a goal machine.\nRead Also:\nTotti won the European Golden Boot in 2007 and the most prolific period of his career coincided with cup wins that year and in 2008, when Spalletti’s Roma took the league title race with Inter Milan to the final day of the season.\nIt was the third time in as many years that Roma finished second behind Inter, who won four Serie A crowns in a row in the aftermath of the 2006 ‘Calciopoli’ match-fixing scandal which led to Juventus being relegated.\n“Spalletti has deserved to win the title for years, when he was in charge of Roma they played great football,” said Udinese’s all-time top scorer Antonio Di Natale to the Gazzetta Dello Sport last month.\n“I’ve not known many coaches as passionate and skilled as him, he used to stay at the training ground 12-13 hours a day just to take care of every possible detail.”\nSpalletti also has no problem butting heads with players who question his dressing room authority.\nAntonio Cassano recounted in 2021 that Spalletti once dropped him from the Roma squad for refusing to turn down the volume of his music in the training ground gym, and when he returned to the capital in January 2016 after winning two league titles at Zenit Saint Peterburg he clashed with an ageing Totti.\nA club-record 87 points in 2017, this time behind all-conquering Juventus, meant almost nothing to Roma fans due to his massive falling out with their iconic captain, who retired the day Spalletti was loudly booed before securing yet another second-placed finish and leaving for Inter.\nHe took Inter into the Champions League in both his two seasons at the San Siro, which were tarnished by another row with another powerful skipper.\nSpalletti stripped Mauro Icardi of the captain’s armband after a long, and very pubic, spat over a contract renewal complicated by Icardi’s showgirl wife – and agent – Wanda Nara being a television pundit.\nHe was removed in 2019 and spent two years on gardening leave, playing paddle and managing his Tuscan vineyard, before taking over at Napoli and finally creating a title-winning vintage.\n“No disrespect to my previous coaches but what Spalletti has done here can’t be compared to anything else I’ve seen elsewhere. He’s a genius,” Victor Osimhen told France Football earlier this month.\n“The day we manage to apply 99 percent of what he teaches us we will obliterate any team we come up against.”",
  "word_count": 1419,
  "scraped_at": "2026-02-14T02:00:20.001440",
  "_text_extracted": true
}