{
  "article_id": "d1372387fee6",
  "url": "https://www.nytimes.com/athletic/6682654/2025/10/02/goncalo-ramos-psg-enrique-supersub/",
  "title": "Goncalo Ramos : The supersub upon whom Paris Saint - Germain rely",
  "date": "20251002T204500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There were 72 minutes on the clock and central midfielder Fabian Ruiz was limping when Luis Enrique broke the figurative emergency glass. He called for Goncalo Ramos.\nParis Saint-Germain and Barcelona were tied 1-1. For over an hour the Champions League holders had produced an impressive and energetic display with a makeshift starting XI that featured three teenagers, a trio of second-choice forwards, and no Joao Neves nor club captain centre-back Marquinhos.\nAdvertisement\nThat in itself is proof of how well coached and versatile PSG are a little over two years into the Luis Enrique era. They produced some scything moves to cut through Barcelona at the Estadi Olimpic Lluis Companys in Montjuic, and maintained the high press they have become known for in spite of their absentees.\nWinning, though, is a team effort, and Ramos has cemented himself as a player with one of the game’s most specialised roles in the game: come off the bench and score.\nAt most other clubs, the 24-year-old would have the attack built around him. He has 18 senior Portugal caps and scored a hat-trick on his full international debut in a 6-1 World Cup round of 16 win over Switzerland in December 2022. At PSG, though, Ramos has become the joker in the pack. And he reaffirmed that by scoring the winner in Catalonia.\nPSG launched another attacking wave as 89 minutes turned to 90.\nVitinha sprayed the ball wide right to Achraf Hakimi, the advancing full-back, and Ramos jogged forwards into an offside position. There was daylight between him and the aggressively high Barcelona back four.\nHakimi took a big first touch forwards to catch up with the Portugal international, and bent a low ball right onto the 18-yard box line.\nHakimi placed it perfectly, with just enough weight, enticing Wojciech Szczesny from his goal and bypassing the recovering Andreas Christensen.\nRamos, having held his run just right, did not break stride as he punched a left-footed finish with his instep past Szczesny. After one check over his shoulder to make sure the assistant referee did not have their flag up, he wheeled away flicking gun fingers at the home fans.\n\"If you do it against a team with PSG, with all their pace and power, you're going to get exposed\" ⚠️\nJoe Cole, @LaurensJulien, and Joe Hart dissect Hansi Flick's persistence with a high defensive line following Barcelona's late defeat to PSG.\n🎙️ @msmith850\n📺 @tntsports &… pic.twitter.com/fWId31g1E8\n— Football on TNT Sports (@footballontnt) October 1, 2025\n“He’s a wonderful player, capable of very high performances. If he plays a minute, he plays it very well,” Luis Enrique said of him in May. “I would call him a guarantee.”\nAdvertisement\n“That’s the type of goal you score in training,” Thierry Henry said on CBS of Ramos. “That’s what a team is about. Throughout a season, you need a bench to bail you out — that’s why he signed for PSG, to come on and change the game.”\nThe numbers summed Ramos up versus Barcelona: 10 touches in 18 minutes, five passes, three fouls won, one shot, and one goal.\nHe was the one to pop up with the 94th-minute equaliser in the Super Cup against Tottenham Hotspur at the start of the season, too.\nSuch a deep and compact low Spurs block meant PSG had to go round the outside. They overloaded left wing-back Djed Spence two-v-one, with Hakimi slipping a pass through to Ousmane Dembele.\nRamos timed his run between Kevin Danso and Cristian Romero, crashing a header in from Dembele’s hard-hit cross.\nOn matchday one in the Champions League, he put the gloss on a 4-0 PSG win at home against Atalanta as a 58th-minute substitute.\nOf Ramos’ 36 goals for Luis Enrique (in a little over two seasons), almost half (17) have been from the bench, and he has scored 16 of them from beyond the 80th minute.\nThis was his fourth Champions League goal as a sub since the start of 2023-24 — only Angel Correa of Atletico Madrid can match that.\nHe is an invaluable piece of the PSG puzzle. Much of their success owes to tactically flexible attackers operating in a high-possession system built on rotations, and players with the physical capacity to press man-to-man for a whole match.\nRamos’ specificity — a pure No 9 who lives for one-touch finishes in the penalty area, a threat with both feet and his head, and a long ball magnet — is exactly why he works better as a substitute than a starter.\nHe has more sub appearances (52) than starts (43) at PSG having completed just 15 full matches since first joining on loan two summers ago. Ramos assumed the impact sub role from day one. His first PSG goals came after being subbed on at half-time in Le Classique in September 2023.\nIn Barcelona on Wednesday, PSG were without first-choice No 9 Dembele, the newly-crowned Ballon d’Or winner, who was unavailable due to injury. Luis Enrique did not begin with Ramos and, instead, opted to hand Senny Mayulu, 19, his first Champions League start.\nAdvertisement\nMayulu, Paris-born and PSG-bred, is a much more complete player and typically operates in midfield. Against Barcelona, he operated as a withdrawn No 9, trying to release the speedy Bradley Barcola on the left wing.\nHis goal, PSG’s equaliser on 37 minutes, capped a scintillating move from the back where they built down the left and Mendes combined with Barcola for a one-two, underlapping the winger before racing into the final third.\nThere, he picked out Mayulu who, after two deft touches, wrong-footed Szczesny with a far-post finish.\nWhen Ramos came on in the second half, Mayulu shifted back to his more traditional central midfield role. Injuries had thinned PSG’s squad, with a nine-man bench featuring two goalkeepers.\nAs such, one of Luis Enrique’s second-half solutions was not to substitute the yellow-carded Mendes — who bundled over Lamine Yamal to stop a counter attack on 44 minutes — but shift him up to left wing and bring Barcola off in place of Lucas Hernandez, who provided assurance at left-back.\nThe late win gives PSG maximum points from their opening two league phase games, more than they earned in their first five Champions League matches last term when they needed a perfect final three matches just to qualify for the knockout rounds.\nIronically, this reduces the pressure of PSG needing to call on Ramos for a goal.\nYet Luis Enrique knows the No 9 is there when he needs him.\n(Top photo: David Ramos/Getty Images)",
  "word_count": 1095,
  "scraped_at": "2026-02-14T02:19:01.977317",
  "_text_extracted": true
}