{
  "article_id": "d158de5ae70b",
  "url": "https://www.france24.com/en/live-news/20230131-ten-hag-slams-carroll-tackle-that-sidelined-man-utd-s-eriksen",
  "title": "Ten Hag slams Carroll tackle that sidelined Man Utd Eriksen",
  "date": "20230201T003000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ten Hag slams Carroll tackle that sidelined Man Utd's Eriksen\nManchester (United Kingdom) (AFP) – Erik ten Hag has urged football authorities to stamp out the type of reckless tackle that left Manchester United midfielder Christian Eriksen sidelined for three months.\nIssued on:\nEriksen suffered an ankle injury when he was caught by an ugly challenge from Reading striker Andy Carroll during United's FA Cup fourth round win on Saturday.\nThe 30-year-old Denmark star had played a vital role for United in his first season at the club, making 31 appearances in all competitions.\nBut now United say Eriksen will be out until \"late April or early May\", hampering Ten Hag's hopes of a successful end to the season.\nCarroll avoided a booking for the tackle in the second half, but the former Liverpool player still ended up being sent off after bookings for fouls on Tyrell Malacia and Casemiro.\n\"I am disappointed about that,\" Ten Hag said of the lack of a booking for Carroll's challenge. \"I think football has to set limits, restrictions, that you protect the players.\n\"I think what football wants is the best players being available on the pitch.\n\"This tackle and the two tackles after, they don't belong on the football pitch because it's a high risk to injure your colleague, so I think it's worse. So, I am wondering about that.\"\nTen Hag said it was not the first time he has noticed players in the Premier League getting away with aggressive fouls.\n\"For instance, I am wondering more in Crystal Palace when there is an elbow on (Lisandro) Martinez and I don't even know if it was a whistle for a free-kick. But no one is interfering then,\" Ten Hag said ahead of Wednesday's League Cup semi-final second leg against Nottingham Forest.\n\"I am wondering about such things because it's a risk of injury for the player.\"\nUnited hold a 3-0 lead over Forest from the first leg but the League Cup is not their only priority.\nQualifying for the Champions League via a top four finish in the Premier League is the main aim and Eriksen's absence is a blow.\nWhen Ten Hag was asked if United could replace Eriksen's qualities, he said: \"I think you can never fill that because every player has his own characteristics, identity.\n\"Another player will always fill it in a different way but that doesn't mean you have to be less successful.\n\"It's quite clear that Christian Eriksen brings top quality to our squad and especially he has some specifics that are hard to replace.\n\"For instance, his impact in the final third with the final ball.\"\n© 2023 AFP",
  "word_count": 445,
  "scraped_at": "2026-02-14T01:59:41.728412",
  "_text_extracted": true
}