{
  "article_id": "d1610473172e",
  "url": "https://www.euronews.com/2024/03/14/euro-2024-three-months-to-go",
  "title": "Euro 2024 : Three months to go",
  "date": "20240314T190000Z",
  "domain": "euronews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Football fans in Europe and around the world are gearing up for an exciting Euro 2024 in the summer.\nThe UEFA European Championship 2024 is just around the corner, and it's Germany's turn to host the international tournament.\nGermany is home to the Bundesliga, which is considered one of the top five leagues in the world. The teams in Bundesliga 1 and 2 play in world-class arenas that are ready to showcase the footballing extravaganza that is the EUROS.\nTen magnificent stadiums await fans ahead of the tournament, including the Allianz Arena, which is no stranger to the tournament and hosted vital matches in 2012 and 2020\nAdditionally, Olympiastadion Berlin will host the EURO 2024 final. The 71,000-seat stadium previously hosted the 2015 Champions League final between Barcelona and Juventus.\nGermany has suffered a significant lack of form in international competitions over the last few years. Fans questioned the leadership and quality loss of their national team due to back-to-back World Cup Group Stage exits, and a Round of 16 loss against England in the last edition of the competition were some of the lowest points in German football's history. The hosts and fans alike will be hoping they can bounce back from international tournament heartbreak.\nRaphael Honigstein, a German football writer for The Athletic, told FOOTBALL NOW, \"There's still optimism, but there will be more optimism if the next couple of friendlies go well… the next two games in March are really key to shape the mood going into the Euros.\"\nJulian Nagelsmann will lead Die Mannschaft out this summer. The international manager has a strong pedigree and previously managed Bayern Munich and RB Leipzig, most notably guiding them to a Champions League Semi-Final in 2020.\nAn exciting summer awaits football fans worldwide, with an endless list of top players ready to write their names in the history books of European football.",
  "word_count": 313,
  "scraped_at": "2026-02-14T02:10:47.914662",
  "_text_extracted": true
}