{
  "article_id": "d196cb72a993",
  "url": "https://www.themag.co.uk/2024/04/manchester-united-in-disarray-and-liverpool-in-transition-newcastle-united-can-take-advantage/",
  "title": "Manchester United in disarray and Liverpool in transition - Newcastle United can take advantage",
  "date": "20240411T123000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United in disarray and Liverpool in transition – Newcastle United can take advantage\nManchester United have been in decline ever since Sir Alex Ferguson retired, after guiding the Salford club to their last Premier League title in 2013.\nEven if you detested the man and his motives (I did and still do), you have to admit that he was always going to be a tough act to follow.\nI believe Liverpool are going to be put in a similar predicament at the end of this current campaign, when Jurgen Klopp says Auf Wiedersehen to Anfield and the Kop.\nThe one advantage Klopp’s successor will have over the men that tried to follow in Fergie’s footsteps at Old Trafford, is that he won’t have the former boss and club legend hanging around the place.\nWith Manchester United seemingly in disarray on and off the pitch and Liverpool set to go through a transitional period, I think that Newcastle United can take advantage next season.\nWith a good summer of trading and the correct players being brought into the club, I think Newcastle will be challenging for and are well capable of achieving a return to the Champions League, possibly at the expense of Liverpool.\nWhen Kevin Keegan resigned as our manager in January 1997, his legacy and footprint on the club meant that he was initially irreplaceable.\nTried and tested big names Kenny Dalglish and Ruud Gullit were consecutively hired and quickly fired.\nIt took the appointment of Sir Bobby Robson in 1999 to steady and guide HMS Toon into calmer waters, then another couple of seasons and Newcastle were riding the crest of a wave again towards the top end of the Premier League.\nThere had been times over the last few months when I have had my own doubts as to whether Eddie Howe had taken us as far as he could.\nI have though come around to the conclusion that he hasn’t and that Eddie is the right man to carry Newcastle United forward into the next phase of the project that was set out by the NUFC owners.\nI believe that Eddie and his staff have done a fine job for the best part of the last 30 months.\nHe is not beyond criticism and has made mistakes that have cost us but I honestly cannot think of any manager who could have done a better job.\nEddie has been compared to King Kev but Kevin is a far more emotional man that constantly wears his heart on his sleeve.\nWould Eddie be irreplaceable like Kevin, if England came calling after the Euros? Probably not but that isn’t the point I’m trying to make.\nWhat I do think is that Eddie Howe will be steadfastly backed by our owners this summer in the transfer market and that he would knock the FA back anyway if approached to replace Southgate.\nYou can see that Eddie feels a natural attachment to the supporters and the region just like KK.\nHe is also fondly thought of by all of us. Apart from being a good manager and coach he is also a bloody nice bloke.\nA strong finish in our last seven league games will give us all a lift going into the summer.\nAs I contemplate life without proper football for a few months (I’m not interested in the Euros), I’m confident that large strides will be taken to ensure that Newcastle United are in the best possible shape to launch an assault on the top four and have a real blast in the domestic cups next season.\nAt present, there is only one man capable of managing and handling the expectations and demands of the Newcastle United owners and supporters.\nThat man is Eddie Howe and he has earned the right to carry on leading us forward in this brave new era.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 659,
  "scraped_at": "2026-02-14T01:56:51.556871",
  "_text_extracted": true
}