{
  "article_id": "d1a5c6456491",
  "url": "https://metro.co.uk/2025/05/02/mikel-arteta-sends-message-max-dowman-amid-martin-odegaard-struggles-23016910/",
  "title": "Mikel Arteta sends message to Max Dowman amid Martin Odegaard struggles",
  "date": "20250502T170000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has dropped his strongest hint yet that Max Dowman is set to be part of Arsenal’s first team plans next season.\nThe 15-year-old has shot to prominence this season on the back of his exploits for Arsenal’s Under-18s.\nDowman has trained regularly alongside his senior colleagues at various points over the last eight months and was included as part of the squad that enjoyed a warm weather training camp in Dubai back in January.\nPremier League rules mean the attacking midfielder isn’t able to make his senior debut this season but if could be a different story next term.\nMyles Lewis-Skelly and Ethan Nwaneri have shown there is a pathway under Arteta and the Arsenal boss believes Dowman looks increasingly likely to be part of his plans going forward.\nSpeaking about Arsenal’s perceived lack of creativity speaking ahead of Saturday’s game against Bournemouth, he said: ‘We have a lot of options there, Mikel can play in that position, Declan, we have Ethan there in his main position.\n‘We have players that can play in that position, we have Max [Dowman] coming up as well very soon as well so I think we are good in the position.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nOn the teenager specifically, he added: ‘For the near future, yeah, let’s see how this evolves but we certainly have a big talent there.’\nDowman’s rapid progress could help ease the burden on ailing skipper Martin Odegaard who has struggled to regain his best form following the ankle injury he picked up earlier this season.\nMore Trending\nOdegaard again struggled to exert any influence in Tuesday’s disappointing Champions League semi-final first leg defeat against Paris Saint-Germain but Arteta remains confident his skipper can get back to where he was prior to his surgery.\nHe said: ‘There were many factors I think, obviously the injury, the long-term injury doesn’t help to give you the consistency and the platform to continue in the season but it’s very difficult.\n‘The level of consistency shown is unbelievable for an attacking player to be constantly there, very rare because there are always ups and downs.\n‘Especially the players that are very creative and they rely on a spark and creating moments in-game but there are other aspects of his games that remain intact and he continues to do every week.’\nMORE: Jamie Carragher names dark horses who could rival Liverpool for the Premier League title next season\nMORE: Ousmane Dembele injury update ahead of Paris Saint-Germain vs Arsenal\nMORE: Arsenal make approach to sign Manchester United attacking target with £66m clause",
  "word_count": 479,
  "scraped_at": "2026-02-14T02:02:35.570308",
  "_text_extracted": true
}