{
  "article_id": "d1d968147f37",
  "url": "https://www.geo.tv/latest/514640-british-billionaire-to-get-shares-in-man-utd-as-fans-worry-for-times-ahead",
  "title": "British billionaire to get shares in Man Utd as fans worry for times ahead",
  "date": "20231016T013000Z",
  "domain": "geo.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "October 16, 2023\nA leading group of fans have demanded to be provided with clarity on the ownership of Manchester United as British billionaire Jim Ratcliffe was set to acquire minority stakes in Red Devils, a day after media reports showed Qatar's banker ceasing his bid for the club.\nQatari billionaire stopped his bid because of \"a fanciful and outlandish valuation\", reports indicated Saturday.\nRatcliffe — who is the founder of petrochemicals behemoth Ineos — will now settle for a 25% stake for around Â£1.3 billion the BBC said Sunday.\nThe Qatari banker Shiekh Jassim and the British billionaire were the top contenders to buy Machester United after a number of bids in 2022.\n\"It would be wildly optimistic to think the Glazers are acting in the interests of supporters or are making ownership decisions which don´t centre on their own priorities,\" the Manchester United Supporters Trust said in a statement.\n\"However, what supporters should expect at the very least now is some clarity and an end to this process.\n\"Furthermore the outcome must include new investment into the club. It cannot be solely about the interests of shareholders, whether existing or new.\"\n\"We call upon all parties to put Manchester United's interests before their own interests.\"\nThe worth of the United is at about $3.2bn, with Sheikh Jassim’s offer nearly double that. The billionaire also pledged a further $1.7bn to finance transfers, intentions for a new stadium and training centre facilities.\nCurrently, he stopped his bid until the owners improvised their price which could reinvigorate his interest.\nAbout a year ago, the English club announced that it was looking for \"strategic alternatives to enhance the club's growth, with a sale one of the options”.\nThere have been intermittent protests against the Glazer family’s ownership of the English football club by the United’s fans, forcing them to sell the stakes.\nIn August, the fans of the Red Devils were infuriated after the Glazers — who have owned the club since 2005 — refused to take the offer in excess of £5bn from these two parties.\nThe Americans have owned the English giants since a leveraged takeover in 2005 for Â£790 million ($961 million) saddled the club with huge debts.\nFigures in March showed United’s debts have grown to Â£970 million.\nHowever, the Glazers are believed to be holding out for a world record fee for a football club in excess of Â£6 billion.\nSheikh Jassim’s bid was for full control of United and promised to clear the club’s debt.\nBy contrast, Ratcliffe is reportedly willing to buy a smaller stake to break the impasse ownership of the 20-time English champions.\nThe Red Devils' fortunes on the field have also faded under the Glazer’s tenure.\nUnited have not won the Premier League since former manager Alex Ferguson retired in 2013 and last won the Champions League in 2008.",
  "word_count": 477,
  "scraped_at": "2026-02-14T02:07:14.740453",
  "_text_extracted": true
}