{
  "article_id": "d1e1b78dc465",
  "url": "https://playingfor90.com/2023/06/09/manchester-city-standing-cusp-treble/",
  "title": "Manchester City look to beat Inter Milan to complete the treble",
  "date": "20230610T013000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City is one win away from making history.\nHaving sealed up the Premier League and beating Manchester United to win the FA Cup, Pep Guardiola’s side is one win away from becoming only the second English team to win a treble.\nHowever, the last win is shaping up to be the toughest as they need to beat Inter Milan in the Champions League final to complete the set. The last time Manchester City reached the final, they lost 1-0 to Chelsea. A result largely remembered for Guardiola’s inexplicable decision to not play either Fernandinho or Rodri in the center of midfield.\nGuardiola appears to have learned his lesson and seems calm less than 24 hours into the much anticipated final.\n“It’s absolutely a dream. Absolutely,” Guardiola said about reaching the final and winning it. “To achieve things always have to have the correct portion of obsession, desire. Obsession is a positive word. It’s a dream for all of us.”\nTo reach this stage, Manchester City had to beat the likes of Bayern Munich and Real Madrid. Against the German champions, Manchester City all but won the tie in the first leg at home with a 3-0 result.\nAgainst Real Madrid, it was a similar story except the second leg took place at the Etihad. The first half of that match was perhaps the best half of any team in the Champions League. City completely dominated Real Madrid from start to finish and were unfortunate to only head into the break up 2-0. In the end, City obliterated Madrid 4-0, a result that still didn’t reflect the play on the pitch.\nNo matter which way one looks at it, Inter Milan are the underdogs. Guardiola knows it but isn’t going to let it affect his players.\n“Every single game we play during the season, this press conference, how many people here. We know how important the competition is,” Guardiola said. “I don’t control what the people have an opinion about, just focus on what we have to do. I saw as many Inter games to see what we have to do. At the end it’s a football game.\n“The team who perform better over 95 minutes will win. Over history, Inter are bigger than us. It’s not important. Important is tomorrow at 10pm Istanbul time we do the best performance as possible.”\nGuardiola is right in that Inter have more history in the Champions League and are a more historic club than City. Recently, however, that hasn’t been the case.\nAn argument can be made, and it has, that City wouldn’t be where they are now if it wasn’t for their ownership who is able to invest large quantities of resources. Resources that other teams can’t count on.\nAt the same time, we’ve seen other team owners invest heavily with abysmal results. One doesn’t have to look far either with Chelsea being a prime example.\nThe key is using those resources wisely and City have done that.\nPlayers like Ilkay Gundogan, Kevin De Bruyne, Jack Grealish and Erling Haaland have all been important pieces. Guardiola’s tactics have also played an important role in how the team functions as well as improving some of his players with John Stones serving as the standout.\nAgain, City have been tremendously boosted by owner Sheikh Mansour and, yes, the criticism thrown their way is warranted. In this scenario, two things can be true.\nOn the sporting side, as mentioned, City is one win away from completing a treble — it would be Guardiola’s second after he did it in his first season with Barcelona.\nShould City go on and accomplish such a feat, those who want to put an asterisk on it can do so. At the end of the day, asterisk or not, the only thing that will matter to Guardiola and his players is that they won the Champions League and join Manchester United as the only two English sides to do so.\nBut Inter, who are deserved finalists, will undoubtedly have a say.",
  "word_count": 672,
  "scraped_at": "2026-02-14T02:07:02.899067",
  "_text_extracted": true
}