{
  "article_id": "d1fe7097b46d",
  "url": "https://thechronicle.com.gh/tomorrows-champions-league-final/",
  "title": "Tomorrow Champions League Final : - The Chronicle News Online",
  "date": "20230609T144500Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Treble-chasing Manchester City face Inter Milan\nEighteen years on from Liverpool’s miracle of Istanbul, treble-chasing Manchester City will strive to emulate their Merseyside counterparts’ feats in the same city when they butt heads with Inter Milan in the final of the 2022-23 Champions League on Saturday night.\nThe two continental behemoths clash for the first time in competitive action at the Ataturk Olympic Stadium on the back of differing domestic fortunes, as Pep Guardiola added another two English football trophies to his cabinet, while the Nerazzurri’s title charge in Serie A was fleeting at best.\nThe Premier League champions obliterated holders Real Madrid 5-1 over two legs in the semi-finals to punch their ticket to the showpiece event, while Inter earned the local bragging rights with a 3-0 aggregate triumph over fellow San Siro tenants AC Milan.\nCHAMPIONS LEAGUE HOODOO\nAdding yet another Premier League trophy and FA Cup crown to his distinguished CV in 2022-23, Guardiola’s list of domestic achievements at the Etihad is endless, but the coveted continental honour has consistently eluded him since he left the comfort of Camp Nou behind.\nUp until the 2020-21 campaign, Guardiola had never taken Man City beyond the quarter-finals of Europe’s premier competition, the perennial Premier League winners have come close, but no cigar.\nMan City fell victim to the Real Madrid juggernaut in the 2021-22 semi-finals, but revenge was a dish best served with a side of four unanswered goals during their reunion at the same stage this time around.\nMan City tore the reigning champions to shreds, making them the firm favourites to finally end their Champions League hoodoo in Turkey.\nGUNDOGAN FINAL ADIEU?\nMan City successfully defended their Premier League title with 89 points to stave off the threat of Arsenal – before winning just their second FA Cup under Guardiola versus rivals Manchester United. With no new contract agreed, Saturday’s game could very well be Gundogan’s Man City adieu.\nAmid incessant speculation surrounding his future, Man City’s end-of-season specialist Ilkay Gundogan sparkled in the Wembley sunshine – netting a beautiful opener within just 12 seconds – before letting fly with another volley in the second half to put Man City on the brink of a terrific treble of trophies\nINTER’S INTENT\nInter’s attempts to thwart Napoli’s Serie A title mission proved futile, but while the pre-match discussions may be centred on Man City’s bid for a domestic and continental treble, a similar haul of success is on the line for Simone Inzaghi‘s knockout gurus.\nFour months on from trouncing city rivals Milan in the Supercoppa Italiana, Inter posted an identical triumph over their Rossoneri foes in the final four of the Champions League to return to Europe’s grandest stage in some style.\nInter have also clinched Supercoppa Italiana and Coppa Italia double by putting Fiorentina to the sword and will be out to win when they step out for just their second Champions League final.\nDRY SPELL\nTwo-time winners of the European Cup in its old format, Inter’s dry spell in the Champions League now stands at 13 seasons since serial continental champion Jose Mourinho oversaw a win over Bayern Munich in the 2010 final.\nInter’s dogged defence has kept five clean sheets in six Champions League knockout matches. The Nerazzurri board the plane to Istanbul having won 11 of their last 12 games across all competitions, while they have only failed to make the net ripple in one of their last 17 contests.\nWHO’S IN WHO’S OUT\nKyle Walker was recently reported by Guardiola, who confessed that the right-back had been experiencing trouble with his back. However, Walker himself has since alleviated concerns regarding his fitness, and should form part of a fully-fit contingent for the Citizens.\nAs for the Nerazzurri, Inter lost midfielder Henrikh Mkhitaryan to a thigh injury, but the Armenian playmaker is reportedly winning his battle to be fit for the final. The same can be said for Argentine attacker Joaquin Correa, who picked up a calf issue against Fiorentina in the Coppa Italia final, although a spot on the bench will await the 28-year-old if he is given the green light to make the journey.\nMISFIRING LUKAKU\nIndeed, Inzaghi appears to have settled on Martinez and Dzeko as his established strike pairing for crunch matches – meaning that misfiring Chelsea loanee Romelu Lukaku will also aim to provide impetus from the bench before he bids farewell for a second time – while Mkhitaryan may force Marcelo Brozovic out of the XI if he can prove his fitness.\nLeft-wing back Federico Dimarco was not even in the squad to meet Torino on the final matchday in Serie A due to muscular fatigue, but the Italian is expected to line up and his duel with Walker down the flank promises to be a riveting watch indeed.\nHEAD-TO-HEAD RECORD\nIncredibly, Saturday’s final will represent the maiden competitive showdown between Man City and Inter in any competition, with the two sides only locking horns in two friendly matches down the years.\nA couple of months on from their 2010 Champions League final triumph, Inter put three past Man City without reply in the Pirelli Cup. One year later, the Citizens avenged that loss with their own 3-0 friendly win in Dublin.\nPREDICTION\nWith Man City winning the ball back higher up the field on average than any other Champions League team this season (47.2m from their own net), and Inter doing so closest to their goal (38.4m), a classic attack-versus-defence encounter may ensue in Istanbul.\nThe Nerazzurri’s counter-attacks can often prove devastating, though, and their recent purple patch in front of goal should also benefit their chances of breaching the Man City backline, but quelling Guardiola’s potent frontmen will be a different matter entirely.\nDespite Inter’s previous rearguard solidity in Europe, Guardiola’s charges possess the attacking wherewithal to finally propel themselves to European stardom and join their formerly noisy neighbours Man United in the exclusive treble-winning club.\nPOSSIBLE STARTING LINEUP\nManchester City: Ederson; Walker, Dias, Akanji; Stones, Rodri; Silva, Gundogan, De Bruyne, Grealish; Haaland\nInter Milan: Onana; Darmian, Acerbi, Bastoni; Dumfries, Barella, Mkhitaryan, Calhanoglu, Dimarco; Martinez, Dzeko\nCredit: sportsmole.co.uk",
  "word_count": 1023,
  "scraped_at": "2026-02-14T02:00:19.981408",
  "_text_extracted": true
}