{
  "article_id": "d1fe2eecf10e",
  "url": "https://www.indiatimes.com/trending/booed-by-fans-shielded-by-security-donald-trump-marks-assassination-anniversary-at-fifa-club-world-cup-crowns-chelsea-as-winners-663756.html",
  "title": "Booed by fans , shielded by security : Donald Trump marks assassination anniversary at FIFA Club World Cup ; crowns Chelsea as winners",
  "date": "20250714T044500Z",
  "domain": "indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Booed by fans, shielded by security: Donald Trump marks assassination anniversary at FIFA Club World Cup; crowns Chelsea as winners\nTrump was joined by his family and advisers at the tournament, and he also presented medals to players and handed the championship trophy to the team Chelsea on Sunday. According to reports, the couple arrived flying over the stadium in Marine One before taking their seats alongside FIFA President Gianni Infantino and his wife, Leena Al Ashqar.\nMoreover, the stadium with a seating capacity of about 80,000 people was hosting the final match between Paris Saint-Germain and Chelsea FC.\nDonald Trump was welcomed with loud boos at the FIFA Club World Cup Final\nThe appearance of Trump at the FIFA Club World Cup Final received a mixed reaction from fans at the stadium. The president attended the event in his trademark red tie and was seen standing beside FIFA President Gianni Infantino to hand over the trophy to Chelsea captain Reece James.\nHe smiled and cheered for the players as they celebrated their victory. However, as he walked onto the pitch for the presentation, loud boos were also heard among the loud applause from the crowd.\n🚨BREAKING: Loud boos ERUPT the moment Donald Trump appears on the Jumbotron during the National Anthem at the World Cup Final. The camera cut away almost instantly. The world is watching and MAGA is crumbling. pic.twitter.com/d18apcplYQ\n— CALL TO ACTIVISM (@CalltoActivism) July 13, 2025\nDonald Trump attends the FIFA Club final after one year of assassination attempt\nApart from the Trump family, other notable personalities present in the VIP box at MetLife included Attorney General Pam Bondi, Transportation Secretary Sean Duffy, Homeland Security Secretary Kristi Noem, media executive Rupert Murdoch, and former football star Tom Brady.\nThe game was attended by President Donald Trump. PSG entered the match as clear favourites, having just arrived in the United States following their UEFA Champions League triumph that included a dominant 4-0 victory over Real Madrid in the semi-finals.\nDonald Trump's assassination attempt in 2024\nOn July 13, 2024, eight shots were fired at Donald Trump during a public rally. One bullet grazed his ear, causing heavy bleeding. Well, at first, people feared that he had been hit several times.\nHowever, the retired firefighter Corey Comperatore was killed in the crowd, and two others were left wounded.\nMarking the anniversary (July 13, 2025) of the assassination attempt, a new Government Accountability Office (GAO) report has highlighted multiple critical errors made by the Secret Service both leading up to and during the Butler rally.\nDonald Trump's presence at key sports events\nMeanwhile, the president has said that he plans to attend multiple matches during next year's World Cup as he maintains a close relationship with Gianni Infantino, the FIFA head. Moreover, since he took office earlier this year, Trump has made sports events a key part of his public appearances.\nLately, he attended the Super Bowl in New Orleans, the Daytona 500 in Florida, UFC fights in Miami and Newark, and the NCAA wrestling championships in Philadelphia.\nCole Palmer shone as the star performer from Chelsea in the FIFA Club World Cup Finals\nIf we see the match stats, it is important to note that Cole Palmer from Chelsea scored two goals and made another as Chelsea stunned Paris Saint-Germain in the final of the Club World Cup on Sunday, beating the European champions 3-0.\nPalmer opened the scoring midway through the first half and struck again to make it two on the half-hour mark.\nBy Nillohit Bagchi\nBy Nillohit Bagchi\nBy Saloni Jha\nBy Saloni Jha\nBy Saloni Jha\nBy Saloni Jha\nBy Karen Noronha",
  "word_count": 608,
  "scraped_at": "2026-02-14T01:49:44.680951",
  "_text_extracted": true
}