{
  "article_id": "d22c15d29f2d",
  "url": "https://www.theguardian.com/world/2023/feb/23/first-edition-ukraine-anniversary",
  "title": "Thursday briefing : How the first year of war in Ukraine unfolded , month by month",
  "date": "20230223T073000Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning.\nA year ago, no one could have predicted the way that Russia’s war in Ukraine has panned out. The west stands firm in its support and the Ukrainian resistance has proved itself to be agile and adaptive, inflicting losses on Russia that few would have seen coming.\nToday’s newsletter takes a month by month look at the war so far through the Guardian’s reporting from Ukraine. That’s right after the headlines.\nFive big stories\n-\nUK news | Shamima Begum, who left the UK to join Islamic State when she was 15, has had her appeal over the decision to remove her British citizenship denied. The special immigration appeals commission (Siac) ruled that the decision was ultimately one for the home secretary.\n-\nStrikes | The union Unison has said up to 32,000 of its members across the NHS in England, including ambulance staff, paramedics and some nurses, will be striking on 8 March.\n-\nEnvironment | A major mapping project has revealed that high levels of potentially toxic “forever chemicals”, which don’t break down in the environment, have been found at 17,000 sites across the UK and Europe. Two of the chemicals have been linked to an array of health problems including kidney and testicular cancer.\n-\nCrime | A senior off-duty police officer has been shot at a sports complex in Northern Ireland, the first shooting of an officer since 2017. He remains in critical but stable condition in hospital. Ireland’s taoiseach, Leo Varadkar said: “I utterly condemn this grotesque act of attempted murder.”\n-\nHousing | Mayors of the three biggest cities in England have called for an immediate rent freeze and a ban on evictions to help alleviate the pressures of the cost of living crisis on renters. The move would bring the country in line with Scotland, where emergency measures have been ushered in to protect tenants.\nIn depth: Twelve months of conflict, losses, destruction – and international solidarity\nFebruary\nAfter months of growing tension and speculation, the worst fears become real: on 24 February 2022, Vladimir Putin begins a devastating offensive on Ukraine after announcing a “special military operation”. Explosions are reported in Kyiv, Kharkiv, Odesa and the Donbas. As the world scrambles to rally behind a country under attack, Russia is hit by a litany of sanctions causing the rouble to crash by more than 40%.\nMarch\nRussia captures Kherson, the first major Ukrainian target to fall.\nAfter reports of Russia targeting civilian sites, the prosecutor of the international criminal court (ICC) announces an investigation into possible war crimes.\nThe two countries eventually agree on 10 humanitarian corridors to allow citizens to evacuate. Some 350,000 civilians in Mariupol are stranded with little food and water – Daniel Boffey’s piece charts the horror of the besieged city through diary entries from residents.\nApril\nThe stakes continue to rise – Russia’s offensive in Kyiv has failed, exposing how ill-prepared they were for Ukrainian resistance. For the first few weeks of April, Russian forces regroup, marking the first period of relative calm, until Putin’s focus shifts to eastern Ukraine and fears grow that the conflict will become a protracted war. Meanwhile, stories about what has been happening in Bucha begin to emerge, with Ukraine accusing Russia of war crimes – Daniel Boffey again speaks to people from the city.\nMay\nAfter months of darkness, there is a small glimmer of hope as Ukraine wins Eurovision. Back home things are not as positive, as Ukrainian forces fall back from some of their positions in the Donbas region, with officials conceding that Russia has the “upper hand” in the east.\nThe toll of the war on Russia’s forces is revealed by the UK Ministry of Defence, which states that in three months, Russia’s death toll is akin to the losses suffered in its nine-year war in Afghanistan.\nJune\n1 June marks the 100th day of war, which has entered a new phase, with Ukraine under significant pressure as it runs low on ammunition. Joe Biden answers Ukrainian president Volodymyr Zelenskiy’s requests, confirming that he will send more advanced rocket systems to Kyiv. Russian forces control 80% of the tactically important eastern city of Sievierodonetsk.\nPjotr Sauer and Andrew Roth speak to some of the 90,000 Ukrainians still in Mariupol, who have been living for a month with little access to basic necessities like electricity, water or healthcare.\nJuly\nEntering its sixth month at war, Ukraine steps up pressure to isolate and recapture Kherson from Russian occupation, while Russia responds by sending 25 missiles into Ukraine from Belarus. In a significant symbolic victory, Ukrainian forces recapture Snake Island and raise their flag.\nElsewhere in Ukraine, however, things look more bleak. After weeks of relentless fighting in Luhansk, Putin declares victory, which brings Russian forces closer to Ukrainian-controlled Donetsk.\nAugust\nRussia shells the Zaporizhzhia nuclear plant, Europe’s largest atomic plant, in an attack that UN chief António Guterres calls “suicidal”. The shelling eventually leads to fires that temporarily disconnects the plant from Ukraine’s national grid for the first time in nearly four decades.\nAs the war reaches a deadlock, Luke Harding reports on the Russian prison camps where Ukrainian soldiers are being tortured and dozens have burned to death.\nSeptember\nUkraine unleashes a lightning counteroffensive in the north-east that forces the Russian military to pull back after a series of battlefield defeats. Its success is described as a key turning point in the war, but the momentous achievement is marred by destruction and death.\nReeling from this defeat, Putin mobilises 300,000 reservists and threatens nuclear retaliation, bringing the war to the home front. The decision is met with widespread protests that lead to the arrests of 1,300 Russians – Andrew Roth’s dispatch from Moscow gives great insight into the feeling in the country at this point. Putin does not stop there, however, announcing there will be four “sham” referendums in Russian-occupied regions in Ukraine, about them formally joining the Russian federation.\nOctober\nUkraine continues to make comprehensive gains in the east and south, bringing Russia to its weakest point in the war so far. In a major blow to Russia, Ukrainian forces blow up the Kerch bridge, described as Putin’s “crown jewel” as it had connected Ukraine to Crimea.\nNovember\nLorenzo Tondo and Luke Harding report on the moment Kherson was reclaimed by Ukrainian forces – its recapture “set the stage for a critical phase in the war”, Dan Sabbagh writes. This defeat does not stop Russia from bombarding the country with dozens of missiles, seemingly targeting Ukraine’s civilian infrastructure, including a maternity ward.\nDecember\nPjotr Sauer reports on Putin’s rare trip to Belarus to visit counterpart Alexander Lukashenko, where the pair discuss closer military cooperation. Zelenskiy takes a trip of his own, the first since the start of the war, to Washington to meet with Biden and deliver a speech to congress where he is met with a standing ovation.\nIn a bid to freeze the country into submission, Russia targets Ukraine’s civilian energy infrastructure.\nJanuary\nThe new year starts with an attack by Ukrainian forces, which kills 89 Russian troops in Makiivka, in what Pjotr Sauer reports as one of deadliest single strikes against Russia’s forces since the war began. The head of Russia’s Wagner mercenary group claims that his forces have taken control of Soledar – Ukraine denies that the town has fallen.\nLater in the month, Dan Sabbagh reflects on the US and Germany’s decision to give Zelenskiy the tanks that he has long been asking for, noting that tanks alone are not enough to win the war.\nFebruary\nWith the immense loss of life and destruction, it can be hard to determine who actually is winning the war – Peter Beaumont has helpfully laid out where both sides are at now.\nElsewhere, Martin Chulov, Dan Sabbagh and Nechirvan Mando reveal that Iran has secretly used boats and a state-owned airline to smuggle weapons into Russia, showing the increasing closeness of the two states. As the war reaches the one-year mark, fighting has only intensified in the eastern city of Bakhmut, with Ukrainian forces reportedly blowing up a bridge in a sign that they may be retreating. If they do, it would be a significant symbolic success for Russia.\nMilitary developments aside, the numbers are staggering. More than five million people are estimated to be internally displaced in Ukraine. A further eight million are refugees in neighbouring countries. The number of Russian troops killed and wounded in the war is approaching 200,000 and the UN has confirmed that there have been more than 7,000 civilian casualties in Ukraine. Towns and cities have been devastated – but the war shows no sign of ending any time soon.\nWhat else we’ve been reading\n-\nIn this striking piece, Poppy Noor lays out the diary of a doctor who is navigating Tennessee’s total abortion ban. Supplemented with interviews and illustrations (above), Noor and Dr Leilah Zahedi-Spung capture what life is like for healthcare workers who cannot give patients the care they need. Nimo\n-\nStuart Heritage pens a fond farewell to You’ve Been Framed, the ITV clip show that’s been canned after 33 years, after failing to keep apace with online “fail” content. Hannah J Davies, deputy editor, newsletters\n-\nYou might have noticed particularly empty shelves in supermarkets, and some shops rationing vegetables. Joanna Partridge and Sarah Butler explain this new wave of food shortages. Nimo\n-\nMaya Foa, director of human rights charity Reprieve, writes incisively on what the Shamima Begum verdict – and the “caricature” perception of the former Islamic State member – says about the UK government. Hannah\n-\nSchitt’s Creek screenwriter Monica Heisey spoke to Emine Saner about her debut novel, divorcing in her 20s and why failure is not the end of the world. Nimo\nSport\nFootball | Manchester City dominated the first half of their Champions League match against RB Leipzig, with Riyad Mahrez scoring the first goal. But as the game went on they lost steam and urgency, ending in a 1-1 draw.\nBoxing | The World Boxing Council has absolved British boxer Conor Benn of failed drug tests – because he ate too many eggs. Benn however is still subject to a British Boxing Board of Control probe.\nTennis | After a nailbiting three-hour contest, Andy Murray beat Alexander Zverev 7-6 (7-5) 2-6 7-5 , knocking the German out of the Qatar Open and pushing Murray into the quarter-finals in Doha.\nThe front pages\n“Alarm over rising tide of toxic ‘forever chemicals’” is our Guardian front-page lead this Thursday morning. David Bowie is there and he’s also on the Daily Telegraph’s front after the gifting of his archive to the V&A – the Telegraph’s lead story is “Warning to Hunt of ‘economic cliff-edge’”. There’s Bowie again in weird trousers on the cover of the Financial Times where the splash is “Philip Morris sees ‘no hope’ of deal to sell Russian assets”. The i has “Nursing union accused of ‘taking King’s farthing’ as strikers split” confirming it’s a day for putting quotes in headlines. “‘Amnesty’ row over fast-track for asylum seekers” says the Daily Mail while the Daily Express has “Rishi launches crackdown on asylum seeker backlog”. “NHS wants to double medical school places” – that’s the Times while the Mirror leads with “Facing Vlad’s killers … Exclusive: we meet brutal Russian mercenary fighters held in Ukraine”. “Seize her salad” – the top story in the Metro is about the “Great fruit and veg shortage” and how Lidl stopped a shopper leaving with 100 cucumbers.\nToday in Focus\nWhy did the search for Nicola Bulley turn so toxic?\nAfter the mortgage adviser disappeared TikTok detectives, grief tourists and the media descended. Now her family have hit out at the ‘appalling’ way they have been treated. What went wrong?\nCartoon of the day | Steve Bell\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nCalvin and his tiger Hobbes last appeared together on New Year’s Eve, 1995. Since then, Bill Watterson – the creator of the Calvin and Hobbes comics, which appeared in 2,400 newspapers during its run – has proven an elusive figure, rarely giving interviews or releasing public projects. But last week, Watterson announced his first major work for almost 30 years – The Mysteries, an illustrated “fable for grown-ups”.\nFor fans of the artist, it’s a cause to celebrate. This is someone who created “one of the greatest works of popular culture of the 20th century”, said Nevin Martell, author of a book about Watterson.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s crosswords are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 2143,
  "scraped_at": "2026-02-14T01:36:00.813312",
  "_text_extracted": true
}