{
  "article_id": "d23d8214775f",
  "url": "https://www.foxnews.com/category/person/cristiano-ronaldo",
  "title": "Cristiano Ronaldo | Fox News",
  "date": "20240830T171500Z",
  "domain": "foxnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo is a Portuguese professional football player who currently plays as a forward for Manchester United in the Premier League. He is widely considered one of the best soccer competitors in the world and of his generation. Ronaldo, 37, has multiple accolades and trophies that have broken many records in the soccer world. He has also been the captain of Portugal's national team for 14 years.\n.\nHis stardom and widespread success have earned him a salary estimated to be over $100 million and career earnings that exceed $1 billion. Ronaldo has six children and is currently dating Georgina Rodriguez. His brand and name have been marketed via video games, merchandise, hotels, and gyms. The footballer is the 3rd highest paid athlete in the world and has a large social media following of over 600 million followers.\nRonaldo, who is named after U.S. President Ronald Reagan, first joined Manchester United in 2003 when he was 18 years old and would go to earn multiple accolades, including a FIFA Club World Cup and three Premier Leagues titles. However, in 2009 United sold Ronaldo to Real Madrid in a transfer deal with over 80 million Euros. Over his professional career, Ronaldo has scored over 800 goals and has made more than a thousand appearances. During his time with Madrid, Ronaldo won 14 trophies until he transferred to Juventus in 2018. In the Champions League, he holds the record for most goals, assists, and appearances.\nIn 2008, Ronaldo became the captain of the Portuguese football team and led them to victory in the Euro 2016 tournament, where he received the Silver Boot for the second-most goals scored. He won the Golden Boot for top scorer four years later in the Euro 2020. Ronaldo is regarded as the most famous football star in the history of Portugal.",
  "word_count": 304,
  "scraped_at": "2026-02-14T01:57:35.654812",
  "_text_extracted": true
}