{
  "article_id": "d23d0ed62708",
  "url": "https://www.unitedinfocus.com/news/wayne-rooney-deeply-admires-premier-league-attackers-sublime-all-round-play-gary-neville-wants-man-utd-to-sign-him/",
  "title": "Wayne Rooney deeply admires Premier League attacker sublime  all - round play , Gary Neville wants Man Utd to sign him",
  "date": "20250422T183000Z",
  "domain": "unitedinfocus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United and England legend Wayne Rooney has dropped a major compliment on one Premier League player that Gary Neville wants at Old Trafford.\nRuben Amorim is tipped to begin the next major overhaul of the Manchester United first-team squad once the season is over and the summer transfer window opens.\nThe 40-year-old United manager inherited his current side last November after he left Sporting CP and replaced Erik ten Hag in the Old Trafford dugout.\nErik ten Hag’s reign as United manager came to an end last October after the former Ajax boss was axed by the Premier League club following a poor start to the season.\nRuben Amorim has overseen a tough start to life at Old Trafford and the former Sporting CP head coach has been navigating a turbulent campaign with United.\nUnited languish in 14th place in the Premier League table and the Red Devils are through to the semi-finals of the Europa League in the 2024-25 campaign.\nThe Red Devils suffered their 15th Premier League defeat of the season on Sunday afternoon after Amorim’s United side lost 1-0 to Wolves at Old Trafford.\nMan Utd and Premier League icon Wayne Rooney singles out Newcastle striker Alexander Isak with huge praise\nAlexander Isak has impressed with Newcastle in the current season and the 25-year-old Swedish striker has been in a sensational run of form in the final third.\nThe Newcastle star has netted 21 times in 30 Premier League matches and the Magpies are on the hunt for a Champions League spot for next season.\nAlexander Isak is under contract with Newcastle until 2028 and the Sweden international has been tipped with a move away from St James’ Park in the summer.\nSpeaking to Amazon Prime Video, Wayne Rooney admitted that he thinks the Newcastle striker is the second-best player in the Premier League this season.\n“In second place, I’d go with Isak from Newcastle,” he said.\n“I think his all-round play, his goals, obviously scoring the goal in the final as well. Isak would be my number two pick and my number one pick would be Mo Salah.”\nWhat did Man Utd legend Gary Neville say about Newcastle star Alexander Isak amid intense transfer speculation?\nAlexander Isak’s stunning impact at Newcastle in the 2024-25 season has led to the Sweden striker being linked with the likes of Arsenal and Chelsea.\nGary Neville insisted that Newcastle will struggle to keep hold of the former Borussia Dortmund player and even suggested that United could enter the race to sign Isak.\n“They are going to struggle to keep hold of Isak, he is going to want to play somewhere else, unfortunately, it’s the nature of the beast,” he told The Overlap US’ ‘It’s Called Soccer!’ podcast in March.\n“They will lose those players, unfortunately. The reality is Newcastle are a great football club and we didn’t see that any more as we did on Sunday [at the Carabao Cup final].\n“But they will want to play for the Real Madrids, Liverpools, Manchester Uniteds and Bayern Munichs of this world, it’s just natural that these players will want to play at those clubs at some point, if they can.”\nUnited will return to Premier League action on Sunday afternoon against Bournemouth at the Vitality Stadium, with kick-off slated for 2pm UK time.",
  "word_count": 553,
  "scraped_at": "2026-02-14T01:52:20.892912",
  "_text_extracted": true
}