{
  "article_id": "d24c774cd603",
  "url": "https://www.twtd.co.uk/ipswich-town-news/50044/town-confirm-akpom-loan-signing",
  "title": "Town Confirm Akpom Loan Signing - Ipswich Town News",
  "date": "20250810T221500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sunday, 10th Aug 2025 21:03\nTown have confirmed the signing of Ajax striker Chuba Akpom on a season-long loan.\nThe news ends a week-long saga after the Blues nipped in to gazump Birmingham City, who were close to taking the 29-year-old on loan last Monday with a medical having been set for that afternoon.\nOnce Town had agreed a deal with the Dutch giants - reportedly paying 60 per cent of his wages with Birmingham having offered to cover only half - Akpom preferred the move to Suffolk and travelled for a medical that evening.\nThe Midlanders subsequently made another bid to try to sign him permanently but with the player digging his heels on joining the Blues with the details on the switch having been tied up over the last few days.\nIn addition to the season-long loan, the deal is understood to include an obligation to sign on a permanent basis next summer if Town win promotion for £7 million.\n“I was really excited when I heard of the interest and I’m delighted to have joined a club with such big ambitions,” Akpom, who could make his Blues debut in the Carabao Cup at Bromley on Tuesday, told TownTV.\n“I watch a lot of football and have always thought Ipswich would suit my style, so this move makes perfect sense.\n“I have had lots of good experiences over the last few years, at Ajax and playing in the Champions League with Lille, and I feel like all of these have improved me as a player and helped me be the person I am now.\n“I’m here to do as much as I can do to help the team, in the changing room and on the pitch, and I’ll bring a winning mentality here.”\nAjax technical director Alex Kroes said: “Chuba is a top professional and a hard worker. The temporary move to Ipswich Town FC offers him a great opportunity to show his qualities weekly.\n“We hope that he can play an important role with his goals in their pursuit of promotion to the Premier League.\n“We wish Chuba every success and fun in England – we continue to follow him with interest.”\nAs well as the Blues and Birmingham, Akpom’s former club Middlesbrough and Greek side Olympiacos also showed interest.\nNewham-born Akpom came through the Gunners’ academy ranks and had spells on loan at Brentford, Coventry, Nottingham Forest, Hull City, Brighton and in Belgium with Sint-Truiden while a player at the Emirates.\nHaving made one senior start and 11 sub appearances, the 6ft tall frontman, who plays as a number 10 as well as an out-and-out striker, moved on to PAOK Salonika in Greece for £900,000 in August 2018.\nAfter two years, he joined Boro for £2.75 million, netting 28 goals as he top scored in the Championship in 2022/23, before returning to PAOK on loan for 2021/22, then joining Ajax for an initial €12.3 million (£10.7 million), rising to €14.3 million (£12.4 million) with add-ons.\nHe spent the second half of last season on loan in Ligue 1 in France with Lille, who chose not to take up an option to sign him permanently at the end of his spell.\nAn England cap at U16, U17, U19, U20 and U21 levels, Akpom has scored 21 goals in 39 starts and 40 sub appearances for Ajax in all competitions and bagged three in six starts and nine games from the bench during his short spell with Lille.\nFor the Teessiders, he netted 34 goals in 59 starts and 23 games from the bench.\nPhoto: ITFC\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nGreat player!\nMiles better than Ali & George Hirst\nBut happy days all 3 will help us win the league title we can do it up the town\nOver the line at last.\nWelcome Chuba.\nNow make the move permanent Chuba\nWE LOVE THE DUTCH AT IPSWICH\nLooks like a striker with a great first touch.\nI think he can play with Hurst - Akpom as a number 10 going to feet, Hirst over the top? I don't think Szomdics is a number 10- Chaplin, Broady and Hutchinson can be but 2 of them may not be here in September.\nMcKenna will work all that out anyway.\nI don't want to just assume GH will play second fiddle like last year. He battled his socks off the other night and I would love him to get 20 goals this season.\nJust need to sort the lightweight midfield out now!\nBroadhead, Hutchinson, Muric, and possibly Davis to leave would give town plenty of cash to spend in the transfer market to bring in some quality reinforcements!\nYou need to login in order to post your comments",
  "word_count": 795,
  "scraped_at": "2026-02-14T01:52:36.779905",
  "_text_extracted": true
}