{
  "article_id": "d26321b3a2f9",
  "url": "https://www.cherwell.org/2024/05/09/death-of-the-fa-cup/",
  "title": "The death of the FA Cup - Cherwell",
  "date": "20240509T231500Z",
  "domain": "cherwell.org",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For the majority of people, Joe Ironside could be a next-door neighbour, or an aptly named blacksmith. For myself and perhaps just ten thousand other people around the world, the name is synonymous with cult hero status. On a miserable afternoon in January 2022, he pivoted on his weaker foot, and calmly swept the ball past Martin Dúbravka to hand Newcastle one of just two losses at St. James’ Park for the calendar year. Myself, alongside the fellow Cambridge supporters were sent into raptures up in the famous away end. I’m hugging strangers and someone’s set off a yellow smoke grenade at my sixteen-year-old feet. The magic of the FA cup is a sentiment that all fans of teams below the Premier League hope to experience, and the financial magic provided by a big team are the dreams of every team owner.\nThe FA cup, which first took place in the 1871-72 season, and once won by Oxford University in 1874 after a victory over Royal Engineers, boasts some staggering prize money figures. This year (2023-24) will see just shy of £20 million issued (£19,829,800), as the final distributes £2 million to the victor, and £1 million to the loser. But for the lower league teams, these figures are dwarfed by the potential for TV revenue and gate receipts. The FA cup uniquely enforces evenly split gate receipts between the home and away sides, the only anomaly being an even more favourable 55/45 split in favour of non-league sides when they play away against teams in the Football League (clubs in the top four divisions). This year’s fairy-tale run by Maidstone United of the Vanarama South (England’s 6th tier) to the final sixteen, or fifth round proper, earned them around £350,000 in prize money, but owner Simon Ash expected a total revenue of nearly £800,000 after gate receipts from an away fixture at Championship side Coventry City (where I unfortunately watched a first half hat-trick from Ellis Simms put Elokobi’s side to the sword). This £800,000 does not even include the £125,000 offered for the rights to an ITV broadcast of the fixture.\nThe competition rules dictate that should a fixture end in a draw, the tie must be replayed at the other team’s stadium, however from the fifth round proper fixture to the final, fixtures will instead go to extra time and penalties, as fixture congestion has become an increasingly contentious issue in regard to player health. These replays offer teams like Maidstone the opportunity to earn these huge paydays, often reviving a club’s financial status. Maidstone operated at a £200,000 loss in the 2022-23 season, so this run will extend the club’s lifespan for the next four years, regardless of any future money earned, a guaranteed future that will even make professional sides jealous. However, on the 18th of April, the FA announced that all replays after the first round proper will be scrapped. Since Championship sides like Coventry City enter in the second round, and Premier League sides enter in the third, this makes it incredibly unlikely for a minnow like Maidstone to draw the lucrative away fixture away that could preserve them for years.\nThere has also been increasing controversy surrounding the selection of games for television broadcast, as lots of games are selected to cater towards pure viewing statistics, rather than offering smaller teams the opportunity to sustain themselves. Standard mid-table Premier League clashes like Crystal Palace vs. Everton, that are broadcasted twice a year, take place over games featuring teams from lower divisions such as Watford vs Chesterfield or Newport against Eastleigh. Larger games like Liverpool vs. Manchester United take place to cater to international viewership, despite the forty-six times they have played each other this century. These hegemonic clubs do not need the broadcasting fees, when they already generate £2.8 billion from national and international viewership in the Premier League alone. The playoff final for Championship clubs to enter the Premier League is already known as the ‘richest game in football’ due to the prospect of receiving these broadcasting fees, and clubs are issued parachute payments to keep them financially afloat after relegation.\nBeyond the financial side, the scrapping of replays denies fans and players a possible once in a lifetime opportunity to witness the atmosphere that most Premier League fans regularly take for granted, or even a Wembley visit. Many Cambridge United fans like myself will recount that day in Newcastle as one of the highlights of their years of support, and players share similar sentiments. Manager George Elokobi told Kent Online that: ‘The magic of the FA cup is still alive. It’s about showcasing our skills and coming up against a fantastic Championship side in a fantastic stadium.’ One of his star forwards and Grenadian international captain, Jacob Berkeley-Agyepong, shared a similar view, telling me via Instagram messages that ‘the run will live with [him] forever’, and that ‘[he] wants to go on another one’. The ‘special’ experience even led him to ‘tears of joy’ for the first time in his career after both the Ipswich and Coventry fixtures.\nThe main opposition to the FA Cup replay is fixture congestion, as competitions such as the UEFA Champions League are being expanded, meaning that players are being forced to play a dangerous number of games. When knockout competitions progress to their latter stages nearing the end of the season, players are at their most vulnerable, and any further playing time can be detrimental. Despite this, cup competitions offer teams the capability to rotate squads, and offer playing opportunities to younger players coming through the academy system. A fine example of this came from Liverpool’s Carabao Cup win over Chelsea this year (a competition played by teams in the top four divisions), as their final-winning team featured five academy graduates. Of these five, three were teenagers who had made a cumulative eleven appearances for a total of one hundred and forty-five minutes between them this season. Replays ultimately offer larger clubs the opportunity to nurture this talent through squad rotation, encouraging efficient player management and rotation.\nThe magic of the cup is a phenomenon referred to when the tale of David and Goliath is echoed. Scrappy teams with wage bills one hundredth of the size of their opponent’s shock thousands. The scrapping of FA cup replays may not totally eradicate the magic of the cup, but it marks another step away from beloved traditions, towards the rampant consumerism that has progressively taken over domestic and continental football.",
  "word_count": 1084,
  "scraped_at": "2026-02-14T02:17:35.177142",
  "_text_extracted": true
}