{
  "article_id": "d264aa6f7bcf",
  "url": "https://metro.co.uk/2025/10/17/liverpool-handed-huge-double-injury-boost-ahead-man-utd-showdown-24451645/",
  "title": "Ryan Gravenberch and Ibrahima Konate injury update ahead of Liverpool vs Man Utd | Football",
  "date": "20251017T090000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot has eased injury fears over Ryan Gravenberch and Ibrahima Konate ahead of Liverpool’s Premier League clash with Manchester United.\nHaving slipped off top spot following back-to-back defeats to Crystal Palace and Chelsea, Liverpool welcome their arch-rivals to Anfield on Sunday where United have not won since 2016.\nGoalkeeper Alisson Becker has already been ruled out, expected to be sidelined until mid-November as a result of the hamstring injury he suffered in the Champions League defeat to Galatasaray.\nKonate came off in the second-half of the defeat to Chelsea at Stamford Bridge leading into the international break, joining up with the France squad the following week.\nHe was not involved in the 3-0 win over Azerbaijan last Friday, sent back to Liverpool the following day with what the French Football Federation confirmed as a quadriceps injury.\nGravenberch meanwhile played 45 minutes in Netherlands last Sunday with Ronald Koeman later confirming he was replaced due to a hamstring injury.\nSpeaking at his pre-match press conference on Friday, Slot revealed Gravenberch is ‘completely fit’ with Konate set to resume training this afternoon.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Ryan is completely fit,’ Slot said. ‘We still have to train twice but if you ask me right now he is completely fit.\nMore Trending\n‘Ibou has come back to us, he has started his sessions again and he is expected to train with us today.’\nGravenberch’s availability will come as a huge boost for Slot with the midfielder one of his side’s stand-out performers this season.\nWith the exception of Alisson in goal and long-term absentee Giovanni Leoni, it leaves the Liverpool manager with a fully fit squad to choose from when United come to town.\nMORE: Cole Palmer and Enzo Fernandez injury update for Chelsea’s trip to Nottingham Forest\nMORE: Fulham vs Arsenal: Latest team news, predicted lineups and injuries\nMORE: Ruben Amorim to recall Man Utd star deemed ‘not good enough’ for Liverpool clash",
  "word_count": 372,
  "scraped_at": "2026-02-14T02:26:56.611650",
  "_text_extracted": true
}