{
  "article_id": "d27060986c25",
  "url": "https://www.namibian.com.na/liverpool-end-losing-streak-with-thumping-win-at-eintracht-frankfurt/",
  "title": "Liverpool end losing streak with thumping win at Eintracht Frankfurt",
  "date": "20251023T021500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool broke a four-game losing streak with a 5-1 win at Eintracht Frankfurt in the Champions League on Wednesday, with Hugo Ekitike scoring for the English champions against his former club.\nAfter Ekitike levelled for Liverpool, Virgil van Dijk, Ibrahima Konate, Cody Gakpo and Dominik Szoboszlai all grabbed goals, the latter two assisted by Florian Wirtz on his return to Germany.\nLiverpool came into Wednesday’s match staring down the barrel of their worst losing run in 73 years dating back to 1953-54, when they were relegated from the top flight.\n“We’re Liverpool and if we win a game of football it’s not that we’ll celebrate until tomorrow, but I’m pleased we were able to win,” Liverpool manager Arne Slot told DAZN.\nThe Dutchman benched the out-of-form Mohamed Salah and Liverpool conceded first for the fifth straight game when Rasmus Kristensen scored on the counter.\nThe Reds soon kicked into gear however, scoring three goals inside 10 minutes to take a 3-1 lead at half-time.\nWirtz, who had no goals or assists in the Premier League or Champions League since his big-money arrival at Anfield, laid on second-half goals for Gakpo and Szoboszlai to put the match to bed.\nWhile Wirtz broke his goal contribution duck, Alexander Isak again failed to fire and was subbed off at half-time for Federico Chiesa.\n“We know what quality we have in the team — all world-class players,” Wirtz told DAZN. “We didn’t start well but we came together and turned the match around.\n“I can do much, much more,” Wirtz said of his assists, adding: “I’m satisfied we won and that I finally laid on some goals.”\nThe win will do Liverpool’s confidence as a whole the world of good but Slot’s side will face bigger tests than Frankfurt, who have now conceded 23 goals in their past six games.\nLiverpool roar back\nWith 26 minutes gone, Nathaniel Brown picked Wirtz’s pocket before Frankfurt thundered up the field, Mario Goetze finding Kristensen who swapped to his preferred right foot and hammered home the opener.\nFrankfurt were pushing for a second on 35 minutes when Andy Robertson won possession and played a superb long-range pass from deep to the breaking Ekitike.\nThe former Frankfurt forward collected the pass, advanced goalwards and slid it under Michael Zetterer, before raising his palms to apologise to the home fans.\nThe goal came against the run of play but sent a jolt through Liverpool.\nThe Reds were two up just four minutes later when Van Dijk powered past his helpless marker, the slight winger Ansgar Knauff, to head in a Cody Gakpo corner.\nOne minute before the interval, Van Dijk’s centre-back partner Konate repeated the trick, again powering past Knauff to head in a corner.\nWirtz had a mixed opening half but looked more assured when Liverpool got on the front foot.\nThe Germany midfielder set up Gakpo for the fourth with a perfectly-weighted ball across the face of goal in the 66th minute.\nSzoboszlai then put the icing on the cake for Slot’s men when he received the ball from Wirtz and arrowed in a raking finish from distance with 20 minutes remaining.\n“We started well, took the lead but at this level you need to be there for 90 minutes. It hurts,” 2014 World Cup winner Goetze said.\nChelsea teenagers shine in rout of 10-man Ajax\nChelsea took full advantage of an early red card for Ajax captain Kenneth Taylor to thrash the Dutch giants 5-1 in the Champions League at Stamford Bridge on Wednesday.\nEnzo Maresca’s gamble in making 10 changes paid off as Marc Guiu and Moises Caicedo struck before Enzo Fernandez and Estevao converted from the penalty spot in the first half.\nTyrique George rounded off the scoring in the second half as for the first time in Champions League history three teenagers scored for the same team.\n“We trust a lot of young players,” said Maresca after the goals for Guiu, Estevao and George. “That is the strategy of the club, but not only the ones that we buy. Also the ones from the academy.”\nVictory made it back-to-back Champions League wins after an opening night defeat at Bayern Munich.\nThe Blues climb to 11th in the table, while Ajax remain rooted to the bottom of the Champions League standings.\nAjax arrived in London without a point or even a goal so far in this season’s Champions League.\nWith Chelsea bearing the brunt of an injury crisis on the back of winning the Club World Cup in July, Maresca clearly targeted the visit of the four-time European champions as one he could afford to rest a number of his key players for.\nOnly Romeo Lavia, who came off at half-time at the City Ground, was retained from the side that won 3-0 at Nottingham Forest at the weekend.\nHowever, that included the return of Fernandez from injury, the club’s record signing in Caicedo and Brazilian wonder kid Estevao.\n“It’s a very demanding season, so we need to rotate, otherwise it’s complicated for the ones that play all the games,” added Maresca.\nAjax were soundly beaten by Inter Milan and Marseille in their opening two games and saw any hope of an upturn in fortunes disappear once VAR intervened to see Taylor’s high challenge on Facundo Buonanotte upgraded from a yellow to a red card on 15 minutes.\nMaresca had to face questions on Chelsea’s discipline in the pre-match press conference after his side had a man sent off in four of their last six games.\nThis time, they made the numerical advantage count.\nFrom the resulting free-kick after Taylor’s dismissal, Guiu turned home Wesley Fofana’s header back across the box.\nCaicedo had just three Chelsea goals since his £115 million ($154 million) move from Brighton in 2023 prior to this season, but now has four already this campaign.\nThe Ecuadorian had some good fortune as his shot deflected in off Josip Sutalo.\nAjax were briefly offered a lifeline when Tosin Adarabioyo trod on the foot of Raul Moro and Wout Weghorst converted from the penalty spot.\nHowever, there were two more spot-kicks before the break to allow Chelsea to kill the game off.\nWeghorst was penalised for a trip on Fernandez, who dusted himself off to slot home.\nEstevao then fired in the first of what are likely to be many Champions League goals.\nThe 18-year-old won the penalty and confidently dispatched it high past Remko Pasveer.\nMaresca made four more changes to start the second half with Fernandez and Caicedo among those withdrawn.\nGeorge took just three minutes to make his mark off the bench with a precise low finish from Andrey Santos’s backheel.\nBellingham strike helps Real Madrid edge Juventus\nJude Bellingham’s goal helped record 15-time winners Real Madrid maintain their 100 percent start to the Champions League with a 1-0 victory over Juventus on Wednesday.\nXabi Alonso’s Spanish giants mostly outplayed their visitors but could not extend their lead after England international Bellingham netted from close range in the second half.\nItalian giants Juventus, now without a win in seven games across all competitions, fought hard but failed to find an equaliser at the Santiago Bernabeu.\nMadrid’s solid win was ideal preparation for Sunday’s Clasico against rivals Barcelona in La Liga and left them as one of five sides to win all three of their opening league phase matches, including holders Paris Saint-Germain.\n“I’m very happy with the win, it was a very tough game with chances at both ends and we had to sweat for it, but it was an important win against a big team,” Madrid goalkeeper Thibaut Courtois told Movistar, after making his 300th appearance for the club.\n“They are Juve, not a small side, and when they defend with 11 men and want to go on the counter, it’s not easy.”\nBoth teams tried to figure each other out in a tentative opening period, but slowly Alonso’s team began to take control.\nBrahim Diaz flicked the ball to in-form French superstar Kylian Mbappe, whose shot was tipped away by Michele Di Gregorio.\nThe striker produced a superb dribble from the right to break into the box and then cut the ball back to Eder Militao, who whistled a shot narrowly over.\nThat was as close as either side came in the first half but the game opened up after the interval.\nCourtois made an important save with his leg to deny Dusan Vlahovic at the end of a rapid break downfield.\nMadrid took the lead after some fine work by Vinicius Junior, yet to score in the Champions League this season.\nThe Brazilian was surrounded by defenders in the area but managed to work some space for a shot, which he curled against the post.\nAttacking midfielder Bellingham showed his poacher’s instinct to react quickest and turn home the rebound after 57 minutes.\nIt was the 22-year-old’s first goal of the season in his seventh match, after a slow start to the campaign following shoulder surgery in the summer to fix a long-term problem.\n“I’m very happy for Jude, after the injury he needed a good game,” Alonso told Movistar.\n“Aside from the goal he played very well, he won a lot of balls in midfield. I’m happy for everyone but above all Jude.”\n‘Best way possible’\nMbappe, who had scored in his previous 11 matches for club and country, slipped as he shot and Di Gregorio was able to save his low strike as Madrid sought a second.\nThe Italian stopper made a stunning double save from Mbappe and Diaz to give his team a chance of snatching a draw.\nJuventus forged one golden chance but Raul Asencio slid in to block Lois Openda’s shot as the clock ticked down.\nMbappe had one more effort from distance saved as he tried to preserve his goalscoring streak, but Di Gregorio was equal to it.\n“We’ve started this group phase in the best way possible,” said Madrid midfielder Aurelien Tchouameni.\n“We faced a good team that defend well and so for us it’s not so easy, but we were confident we would score.”\nIgor Tudor’s Juve are winless after their first three Champions League matches.\n“We have some strengths and weaknesses, but we have to put faith in this team, as we are on the right track,” said Tudor.\n“We had hunger, but when doing so much running, there was a lack of sharpness and many were not accustomed to playing at this level.”\nFootball: UEFA Champions League results – collated\nUEFA Champions League league phase, matchday three results on Wednesday:\nIn Istanbul, Turkey\nGalatasaray (TUR) 3 (Osimhen 3, 33, Akgun 60) Bodo/Glimt (NOR) 1 (Helmersen 76)\nIn Bilbao, Spain\nAthletic Bilbao (ESP) 3 (Guruzeta 40, 88, Navarro 70) Qarabag (AZE) 1 (Andrade 1)\nIn London\nChelsea (ENG) 5 (Guiu 18, Caicedo 27, Fernandez 45-pen, Estevao 45+6-pen, George 48) Ajax (NED) 1 (Weghorst 33-pen)\nIn Bergamo, Italy\nAtalanta (ITA) 0 Slavia Prague (CZE) 0\nIn Frankfurt, Germany\nEintracht Frankfurt (GER) 1 (Kristensen 26) Liverpool (ENG) 5 (Ekitike 35, Van Dijk 39, Konate 44, Gakpo 66, Szoboszlai 70)\nIn Lisbon\nSporting Lisbon (POR) 2 (Catamo 69, Santos 86) Marseille (FRA) 1 (Paixao 14)\nIn Monaco\nMonaco (FRA) 0 Tottenham (ENG) 0\nIn Madrid\nReal Madrid (ESP) 1 (Bellingham 57) Juventus (ITA) 0\nIn Munich, Germany\nBayern Munich (GER) 4 (Karl 5, Kane 14, Diaz 34, Jackson 79) Club Brugge (BEL) 0\nPlayed Tuesday\nIn Barcelona, Spain\nBarcelona (ESP) 6 (Lopez 7, 39, 76, Yamal 68-pen, Rashford 74, 79) Olympiacos (GRE) 1 (El Kaabi 54-pen)\nIn Almaty, Kazakhstan\nKairat Almaty (KZA) 0 Pafos (CYP) 0\nIn London\nArsenal (ENG) 4 (Gabriel 57, Martinelli 64, Gyokeres 67, 70) Atletico Madrid (ESP) 0\nIn Leverkusen, Germany\nBayer Leverkusen (GER) 2 (Garcia 38-pen, 54) Paris Saint-Germain (FRA) 7 (Pacho 7, Doue 41, 45+3, Kvaratskhelia 44, Nuno Mendes 50, Dembele 66, Vitinha 90)\nIn Villarreal, Spain\nVillarreal (ESP) 0 Manchester City (ENG) 2 (Haaland 17, Bernardo Silva 40)\nIn Eindhoven, Netherlands\nPSV Eindhoven (NED) 6 (Buongiorno 35-og, Saibari 39, Man 54, 80, Pepi 87, Driouech 89) Napoli (ITA) 2 (McTominay 31, 86)\nIn Copenhagen\nCopenhagen (DEN) 2 (Anton 33-og, Dadason 90) Borussia Dortmund (GER) 4 (Nmecha 20, 76, Bensebaini 61-pen, Fabio Silva 87)\nIn Brussels\nUnion Saint-Gilloise (BEL) 0 Inter Milan (ITA) 4 (Dumfries 41, Lautaro Martinez 45+1, Calhanoglu 53-pen, Esposito 76)\nIn Newcastle, England\nNewcastle (ENG) 3 (Gordon 32, Barnes 70, 83) Benfica (POR) 0\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 2177,
  "scraped_at": "2026-02-14T02:26:56.606728",
  "_text_extracted": true
}