{
  "article_id": "d2c81a2eb7ea",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-11811913/Peter-Crouch-brands-wife-Abbey-Clancy-psycho-behaviour-got-engaged.html",
  "title": "Peter Crouch brands wife Abbey Clancy a  psycho  ",
  "date": "20230302T121500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'You dropped a few hints!' Peter Crouch brands wife Abbey Clancy a 'psycho' over her behaviour before they got engaged\nPeter Crouch savagely branded his wife Abbey Clancy a 'psycho' over her antics before they got engaged during their latest podcast.\nThe former professional footballer, 42, revealed how the model, 37, hilariously drew her dream ring when they were dating and handed it to him.\nPeter joked that Abbey more than 'dropped a few hints' about the 'pear-shaped' diamond she would like to receive when they got engaged.\nAbbey denied that she was dropping hints and instead insisted she was simply 'doodling' when Pete came over to see what she was doing.\nRecalling the story to listeners on their podcast The Therapy Crouch, Pete said: 'I'd already bought the ring. And I remember sorting the ring, it took me ages but I remember you dropped a few hints over the court of our courting...\nHaha! Peter Crouch savagely branded his wife Abbey Clancy a 'psycho' over her antics before they got engaged during their latest podcast\nDazzling: Abbey pictured flashing her engagement ring (pictured 2016)\nHe continued: 'You wanted like a pear shaped diamond and I think you'd actually drawn it once., you psycho!'\nDefending herself, Abbey replied: 'I must have just been like doodling and you must have come over.'\nPete quipped back: 'What? You were just doodling randomly about looking at diamonds.'\nAbbey said: 'I'm not going to draw a ring.'\nPeter replied: 'You drew a ring and gave it to me and said that's the one I want.'\nWhile Abbey hit back: 'You obviously didn't do it to scale.'\nAbbey and Peter, who got married 12 years ago share four children together, released their first podcast together and so far it has proved to be a hit.\nThe couple have four kids together - Sophia, 11, Liberty, seven, Johnny, four, and Jack, three.\nLol: The former professional footballer, 42, revealed how the model, 37, hilariously drew her dream ring when they were dating and handed it to him\nPodcast: Peter joked that Abbey more than 'dropped a few hints' about the 'pear-shaped' diamond she would like to receive when they got engaged\nWhat a sparkler! Abbey asked her beau for a 'ear-shaped' diamond (pictured)\nDuring a recent episode, the couple joked about their sex life when a fan messaged that they only do the deed every couple of weeks.\nAbbey read the story out: 'My partner and I have been seeing each other for about five years now. Initially our sex life was amazing and we couldn't keep our hands off each other.\n'But naturally as the years have gone by things have started to slow down a bit. This has gotten worse over the past six months and we are lucky if we get it on once every couple of weeks.'\nAbbey added afterwards: 'That sounds bloody fine. I think he's lucky, him'.\nPodcast: Abbey and Peter, who got married 12 years ago share four children together, released their first podcast together and so far it has proved to be a hit\nWhereas the former striker joked that the anonymous listener was actually him, he said: 'Peter, 42, from Surrey is that'.\nAbbey continued: 'I think he should grow up, once every two weeks, what's he complaining about!'\nPeter added: 'Oh My God he's getting action all over the shop!'\nShe began by saying: 'Having children doesn't even come close to the feeling you get when you play football'.\nThen reaching for her mobile she added: 'I'm actually gonna try and find this on my phone now because it was actually disgusting.'\nAbbey said: 'I think he's lucky him. I think he should grow up, once every two weeks, what's he complaining about!'. Whereas the former striker, 42, added: 'Oh My God he's getting action all over the shop!'\nPeter tried to defend himself, saying: 'Well this is something you know that we come across, I think when you are potentially in the public eye, you know stories and words can be misconstrued hopefully'.\nIgnoring him, Abbey read out a headline off her phone that said: 'Peter Crouch says getting to the Champions League final was better than the birth of his kids.'\nShe addressed Peter: 'Three days ago you said this.'\nPeter replied: 'Yeah but I obviously said it a while ago, they just put it in 3 days ago.'\nAbbey cut in: 'So you did say it.'\nPeter admitted: 'Well loosely'.\nRaging: It comes after Abbey voiced her fury at her husband Peter after he claimed that getting to the Champions League final with Liverpool was better than the birth of his children\nReading another article, Abbey said: 'Peter Crouch has risked the fury of wife Abbey Clancy by saying that the Liverpool's path to the Champions League final was better than the birth of his four kids.\n'The striker only came on as a sub - you weren't even a real player, you weren't even involved. How can you even say that?'\nPeter responded: 'I was Liverpool top goal scorer on the run up to that final, level with Kaka.\n'If I'd have played the final we might have won it and I might have become top goal scorer. Kaka wouldn't have existed.'\nAbbey interrupted: 'But you didn't and you didn't play so there you go.'\nNot happy: The model confronted the former footballer on his comments on their podcast, The Therapy Crouch\nIn October, Peter explained: 'Look, I love my two girls and my two boys, but I have to be honest: getting to the Champions League final is better.\n'Let me explain. You know you’re going to have a baby for nine months.\n'Sure, it’s wonderful when they arrive, and they’re healthy and all is well with your partner. But there’s no sudden shock. There’s no explosion of noise all around you.\n'You don’t feel like taking your top off and running round the hospital, and if you did, and launched into a massive knee-slide, it wouldn’t be to a sea of limbs like when I scored for Spurs against Manchester City to get us into Europe.\n'It would just be a tired night porter and someone bringing in a Lucozade for their poorly nan.'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Toddler opens car door in traffic and sends biker flying\n- Food vlogger dies after 'eating toxic devil crab'\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl\n- Moment Swiss bar fire owners collapse after being confronted\n- New video shows man with backpack similar to Guthrie kidnapper\n- Chilling police interview of ISIS fanatic plotting UK attack",
  "word_count": 1172,
  "scraped_at": "2026-02-14T01:46:30.512194",
  "_text_extracted": true
}