{
  "article_id": "d2d4437b374d",
  "url": "https://www.thenationalnews.com/business/energy/2025/11/04/saudi-aramco-third-quarter-profit-slides-on-revenue-decline/",
  "title": "Saudi Aramco third - quarter profit slides on revenue decline",
  "date": "20251104T074500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saudi Aramco, the world's biggest oil-producing company, reported a 2.3 per cent drop in third-quarter net income, the 11th consecutive quarterly decline, as revenue slumped amid lower crude prices.\nNet profit in the three months to the end of September declined to 101.02 billion Saudi riyals ($26.94 billion), lower than the 103.4 billion riyals the company reported in the same period a year earlier, it said in a filing on Tuesday to the Tadawul stock exchange, where its shares trade.\nQuarterly revenue slumped 7.3 per cent on an annual basis to 378.8 billion riyals, mainly driven by “lower refined and chemical products prices, as well as lower crude oil prices and traded volumes”, the company said.\nDespite a drop in the third quarter income, Aramco president and chief executive Amin Nasser said the earnings reflect the company's ability to adapt to “new market realities”.\n“We increased production with minimal incremental cost, and reliably supplied the oil, gas and associated products our customers depend on, driving strong financial performance and quarterly earnings growth,” he said.\nFor the first nine months of the year, Aramco's net income dropped 9.9 per cent on an annual basis to 283.58 billion riyals. Revenue for the nine months declined 5.9 per cent year-on-year to 1.17 trillion riyals.\nSeparately, the Aramco board announced a base dividend of $21.1 billion for the third quarter and a performance-linked dividend of $200 billion, to be paid in the fourth quarter of this year.\nOil price volatility\nCrude prices have been on a rollercoaster ride this year. While the geopolitical volatility, including the 12-day Israel-Iran war and Israeli bombings of Syria, Lebanon and Qatar, pushed prices higher, fears of a glut in the global market amid Opec+ raising output caps triggered bearish sentiment.\nThe Opec+ group of crude producers, led by Saudi Arabia and Russia, agreed on Sunday to another output increase of 137,000 barrels per day for next month, citing the steady global economic outlook and healthy market fundamentals as the reason for the increase.\nIt was the ninth time that the supergroup of eight producers, which also includes the UAE, Iraq, Kuwait, Kazakhstan, Algeria and Oman, raised production this year as it continues to unwind production cuts introduced two years ago.\nThough the group on Sunday agreed to pause oil output increases for the first quarter of 2026 due to seasonality, it said the 1.65 million bpd of capacity \"may be returned in part or in full subject to evolving market conditions and in a gradual manner\".\nThe eight countries are set to meet on November 30 to access the oil market dynamics and chart the future course accordingly.\nBrent, the benchmark for two-thirds of the world's oil, was down 0.32 per cent at $64.71 a barrel at 9.57am UAE time. It posted a third monthly decline at the end of October, capping volatile trading the markets have endured this year.\nWest Texas Intermediate, the gauge that tracks US crude, was also down 0.28 per cent at $60.88 per barrel.\nUpstream boost\nHowever, despite the price volatility, Mr Nasser said the company will continue to “enhance our upstream capabilities, with major oil and gas projects either recently completed or due to come onstream soon”.\n“Today, we announce higher sales gas forecasts, and we now target sales gas production capacity growth of approximately 80 per cent between 2021 and 2030, capitalising on advanced capabilities,” he said.\nPart of the projected increase is from “our unconventional gas expansion at Jafurah, which attracted significant interest from global investors”, Mr Nasser said.\nIn August, Aramco announced an $11 billion lease and leaseback agreement for midstream gas-processing plants at its Jafurah field with a consortium led by BlackRock's Global Infrastructure Partners.\nUnder the transaction, a newly formed subsidiary called the Jafurah Midstream Gas Company will lease development and use rights for the Jafurah Field Gas Plant and the Riyas NGL Fractionation Facility, and then lease them back to Aramco for a 20-year period.\nAramco holds a 51 per cent stake in the newly formed JMGC subsidiary, with investors led by GIP holding the remaining 49 per cent.",
  "word_count": 683,
  "scraped_at": "2026-02-14T01:49:57.610221",
  "_text_extracted": true
}