{
  "article_id": "d323c62d8a6c",
  "url": "https://metro.co.uk/2025/05/11/lamine-yamal-takes-swipe-jude-bellingham-barcelona-beat-real-madrid-clasico-thriller-23066459/",
  "title": "Lamine Yamal takes swipe at Jude Bellingham after Barcelona beat Real Madrid",
  "date": "20250511T230000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lamine Yamal couldn’t resist taking a swipe at Jude Bellingham after Barcelona ran out 4-3 winners over Real Madrid in a pulsating Clasico.\nKylian Mbappe scored a 14-minute brace as Madrid stormed to an early 2-0 lead to silence the Catalan crowd.\nBut the La Liga leaders responded emphatically in a breathtaking end to the first half as Eric Garcia and Yamal both netted before Raphinha scored twice to the space of 11 minutes.\nMbappe completed his hat-trick to give the visitors and reigning champions a glimmer of hope with 20 minutes remaining of the clash, but Hansi Flick’s men held firm to move seven points clear of their bitter rivals at the top.\nThe victory came just days after Barca’s painful elimination from the Champions League at the hands of Inter Milan and Flick applauded his players on their spirit and fight they displayed after a difficult week.\n‘It’s fantastic for the fans and the players. Real Madrid has a great team, but we managed to come back from 2-0 down,’ the Barca head coach told the Spanish media at his post-match press conference.\n‘After the game in Milan, with 120 minutes, it wasn’t easy.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThough delighted with the result, Flick admitted there was plenty of room for improvement in Barca’s performance from a defensive perspective.\n‘It’s easy to say, “If you score four, fine, let them score three”, but we have to improve a lot in defence,’ the German added.\n‘When we press everything is fine, but if you make a mistake, especially on the first goal, it gets complicated.\n‘The team makes very good collective decisions. It’s not an excuse, but it’s not easy to correct these things in training when playing every three days. We’re already thinking about how to improve these things.’\nAfter Barcelona’s loss to Inter in the week, Madrid players past and present, including England midfielder Bellingham and club legend Sergio Ramos, were caught ‘liking’ Alessandro Bastoni’s celebratory post on social media.\nBut Yamal made sure he had the last laugh following Barca’s Clasico triumph, taking to Instagram to send a clear message to those who had reacted to Bastoni’s post, writing ‘like this one too’ along with a winking emoji.\nInside the space of its first two hours, Yamal’s post attracted more than 75,000 likes while racking up over four million ‘likes’.\nThe photograph Yamal used shows the teenager imitating a celebrating Cristiano Ronaldo famously performed for the first time during his Real Madrid days in 2012.\nRonaldo’s Madrid team were returning to Barcelona following a humbling 5-0 defeat earlier in that season – and the goal Ronaldo was celebrating proved the winner in a 2-1 victory for Los Blancos that day.\nFacing the media after Madrid’s latest setback, a dejected Carlo Ancelotti rued his side’s defensive errors which allowed Barca a route back into the contest.\n‘We made some glaring mistakes that cost us several goals,’ Ancelotti said.\nMore Trending\n‘In high-level matches against top opponents, you need to be on top of your game.\n‘We played well in attack but it’s clear we can improve a great deal on defence\nAsked about the prospect of Madrid finishing the season trophyless, the Italian replied: ‘Everyone can make whatever assessment they want.\n‘We have to finish the season well and try to win the three remaining games.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Espanyol turn on sprinklers to dampen Barcelona’s La Liga title celebrations\nMORE: Dozens of Espanyol fans hurt after car driven into crowd before Barcelona match\nMORE: Andoni Iraola makes shock admission over Dean Huijsen to Real Madrid transfer links",
  "word_count": 670,
  "scraped_at": "2026-02-14T02:26:38.640923",
  "_text_extracted": true
}