{
  "article_id": "d3414feeb9fa",
  "url": "https://metro.co.uk/2025/12/29/mikel-arteta-speaks-arsenals-january-transfer-window-plans-25903186/",
  "title": "Mikel Arteta speaks out on Arsenal January transfer window plans",
  "date": "20251229T150000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta says Arsenal will be ‘actively looking’ for new signings in the January transfer window, with injuries on the manager’s mind.\nThings are going very nicely for the Gunners so far this season, sitting top of both the Premier League and Champions League tables.\nArteta is far from comfortable, though, with Manchester City and Aston Villa chasing them impressively domestically and an awful long way to go in Europe.\nArsenal have also been suffering with a number of injuries to big players, which they have been coping with pretty admirably.\nThe current injured list features Jurrien Timber, Kai Havertz, Cristhian Mosquera, Ben White, Riccardo Calafiori and Max Dowman.\nOther than teenager Dowman, none of those injured players are expected to be out for very long, but Arteta is cautious on how his squad will handle the demands of competing in four competitions, which they still are.\nThe Spaniard says the club will be ‘actively looking’ for possible signings during January and will be ready to strike if they feel they need to.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We’re going to be really aware of the situation and the timescale of certain players,’ said the Arsenal manager.\n‘We have to be actively looking, and then can we do it or not? That’s a different story, but our job is to be always very prepared because something can happen.’\nOn the possibility of players departing next month, Arteta suggested that was more down to sporting director Andrea Berta to decide.\n‘Again, we assess every situation. I leave that much more to Andrea to understand what’s happening in the market and then, individual players,’ said Arteta.\n‘Obviously, we have to assess where we are with each of them and get the best situation.’\nArteta plotting Villa revenge\nThe Gunners are back in action on Tuesday night against Aston Villa at the Emirates in a crunch clash at the top of the table.\nUnai Emery’s side is on an 11-match winning run in all competitions and Villa are just three points behind Arsenal in the Premier League.\nMore Trending\nOne of those 11 wins was over Arsenal at Villa Park earlier this month, when the home team scored an injury time goal to secure a 2-1 victory.\n‘We’ll watch it back,’ said Arteta of their last meeting with the Villains. ‘I have a few ideas and things that we have to do better. And it was quite cruel, as well, the way we lost it. But yeah, we learned from it.’\nMORE: Gary Lineker tells misfiring Viktor Gyokeres to copy former Everton striker\nMORE: Chelsea ‘interested’ in re-signing Champions League winner on free transfer",
  "word_count": 490,
  "scraped_at": "2026-02-14T01:59:31.508334",
  "_text_extracted": true
}