{
  "article_id": "d391d65b861b",
  "url": "https://www.teamtalk.com/news/striker-concern-sees-shock-raid-premier-league-rivals-mooted-for-big-game-frontman",
  "title": "Liverpool transfers : Striker concern sees shock raid on Premier League rivals mooted for big - game frontman",
  "date": "20241207T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool striker concern sees shock raid on Premier League rivals mooted for big-game frontman\nLiverpool remain seven points clear at the Premier League summit after their thrilling 3-3 draw at Newcastle on Wednesday night but the knives were out again for Darwin Nunez after another poor showing from the striker, leading to yet more rumours of Arne Slot moving for a replacement.\nThe £85million signing has managed just two goals in 11 Premier League appearances so far this season, which makes Liverpool‘s success so far under Slot even more remarkable when you consider what they could have done with a more reliable No.9 to lead the line.\nIt’s well known that the Reds have already started looking at alternative options to Nunez in the market, with the likes of Inter Milan frontman Marcus Thuram and Eintracht Frankfurt’s Omar Marmoush heavily linked with a switch to Anfield.\nBut, according to journalist Francois Plateau, the Merseyside outfit are also exploring a January move for Brighton forward Joao Pedro.\nWhile Nunez remains a constant threat in the Liverpool attack and his effort cannot be questioned, his actual return in terms of goals and returns has been poor. The 25-year-old has notched three times, with two assists in 18 games in all competitions, with the incredible form of Mohamed Salah along with key contributions from Luis Diaz and Cody Gakpo covering up for Nunez’s struggles in front of goal.\nAnd it now appears that a move for big-game Pedro could happen in the new year, with the Seagulls frontman having scored in outings against Manchester United, Arsenal and Man City this season.\nThe Brazil international, who has had his injury issues this term, has scored four goals in eight appearances for the Seagulls after notching 20 times during the 2023/24 campaign following his switch from Watford.\nWhile Plateau fails to mention what sort of transfer fee Brighton could demand for the player, whose style of play has been likened to former Liverpool favourite Roberto Firmino, he is currently valued at €50million (£41m/$53m) on Transfermarkt.\nREAD MORE ➡️ Eight left-backs Liverpool could sign to usurp Andy Robertson in statement of intent for Arne Slot\nREAD MORE ➡️ Five clubs Liverpool goalkeeper Caoimhin Kelleher could join next year: Chelsea, Newcastle…\nSlot still backing Nunez to come good\nDespite his struggles this season, Reds boss Slot is still backing the Uruguay international to come good if he takes on his coaching methods and advice.\n“It’s always difficult because players, but also the media, only think you have confidence in a player if you play him,” Slot said of Nunez in September.\n“We have confidence in all of them, otherwise you don’t bring a player in if you’re 3-1 up half an hour before the end.\n“There’s a lot of confidence in him. But there are two players for that position and I could even come up with more who could play in that position – he is in competition with Diogo [Jota] who has done really well.\n“But many games have to be played and there will be enough time to judge Darwin: if he improves and how he improves and if he can do special things for the club.”\nNunez missed out on the change to make up for his poor display at Newcastle when Saturfay’s Merseyside derby trip to Goodison Park was called off due to Storm Darragh.\nLiverpool are back in action on Tuesday night when they host Spanish side Girona in the Champions League.\nLatest Liverpool news: Salah contract details revealed / Chiesa future doubt\nSky Sports pundit Paul Merson has revealed the exact length of contract Mo Salah will sign at Liverpool – but has warned owners Fenway Sports Group they could have riddled themselves with a declining star who will soon not be worth the big money they are paying him.\nThe Egyptian has bona fide claims of being one of the Reds best pound-for-pound signings over the last 25 years. However, his contract at Anfield is due to expire at the end of the current season, meaning he could open talks on a pre-contract agreement with an overseas club of his choosing from January 1.\nThankfully for Liverpool, though, those fears appear to have eased dramatically in recent days and Merson has now revealed what he knows about Salah’s future.\nMeanwhile, Inter Milan have spoken to Liverpool about a potential move for winger Federico Chiesa in January, sources have exclusively revealed to TEAMtalk.\nThe 27-year-old has played just 18 minutes of Premier League football so far this season due to an injury and finds himself behind Mo Salah in Arne Slot’s pecking order.\nAnd sources have revealed to TEAMtalk that the fact that Salah could sign a new two-year contract at Anfield has led to ‘uncertainty’ regarding Chiesa’s situation.",
  "word_count": 799,
  "scraped_at": "2026-02-14T01:52:10.165627",
  "_text_extracted": true
}