{
  "article_id": "d3a3978a6be2",
  "url": "https://www.myjoyonline.com/caf-inter-club-competitions-samartex-nsoatreman-get-50000-for-preliminary-round/",
  "title": "CAF inter - club competitions : Samartex , Nsoatreman get $50 , 000 for preliminary round",
  "date": "20240817T133000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nGhana's representatives in this year's CAF inter-club competitions, Samatex and Nsoatreman FC, will receive $50,000 each for participating in the preliminary rounds of the Champions League and Confederation Cup, respectively.\nSamatex, the Ghana Premier League champions, will face Cameroon's Victoria United over two legs, while Nsoatreman FC, winners of Ghana's FA Cup, will square off against Elect Sport FC of Chad.\nPreviously, there was no prize money for the preliminary rounds. However, on Friday, 16th August 2024, CAF announced that $50,000 has been made available for clubs in the first phase of the competitions.\n\"In line with the Confédération Africaine de Football (CAF) President, Dr Patrice Motsepe’s promise to improve club competitions and provide more financial assistance to clubs, those participating in the Preliminary Stages of the TotalEnergies CAF Champions League and TotalEnergies CAF Confederation Cup will receive USD 50,000 each,\" a statement on the CAF website said.\nThe statement added: \"This is the first time CAF has offered financial assistance to clubs at this stage of the competition. Previously, clubs needed to reach the group stages to be eligible to share the overall prize money.\"\nThere has also been an increase in prize money across the board, with the winner of the Champions League now receiving $4 million, up from the $2.5 million awarded in 2022.\n\"Winners of the TotalEnergies CAF Champions League will now take home USD 4,000,000 – compared to the USD 2,500,000 they received in 2022. Winners of the TotalEnergies CAF Confederation Cup will now take home USD 2,000,000 – compared to the USD 1,200,000 they received in 2022.\n\"Last year, clubs benefited from the financial injection provided by the African Football League, which offered a total prize money of USD 8,000,000.\nTOTALENERGIES CAF CHAMPIONS LEAGUE\nPosition | Prize Money\nWinner | USD 4,000,000\nRunner-up | USD 2,000,000\nSemi-Finalists | USD 1,200,000\nQuarter-finalists | USD 900,000\n3rd in Group | USD 700,000\n4th in Group | USD 700,000\nTOTALENERGIES CAF CONFEDERATION CUP\nPosition | Prize Money\nWinner | USD 2,000,000\nRunner-up | USD 1,000,000\nSemi-finalists | USD 750,000\nQuarter-finalists | USD 550,000\n3rd in Group | USD 400,000\n4th in Group | USD 400,000\n\"This significant step by CAF addresses the long-standing concerns from clubs regarding the escalating travelling and logistical costs associated with playing in continental club football.\n\"This financial boost for preliminary round participants complements the existing prize money structure for the later stages of both competitions.\n\"This move is expected to incentivise more clubs to participate in continental competitions and raise the overall standard of club football in Africa.\n\"Prize Money Structure: Preliminary Round (Both Competitions): USD 50,000 per club.\"\nThe return legs of the preliminary round will be played from 23-25 August 2024.\nLatest Stories\n-\nThis is not the time to settle political scores – Bawumia to government\n27 minutes -\n37% of SHS students exposed to drugs – Opare-Addo\n45 minutes -\nNLC secures court injunction against striking tertiary unions\n1 hour -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n2 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n2 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n2 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n3 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n3 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n3 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n4 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n5 hours -\nMasterMinds resources positions itself as key player in skills development and workforce training\n6 hours -\nINTERPOL has deleted Ofori-Atta’s Red Notice – Lawyers\n6 hours -\nSteven Spielberg donates $25,000 to James Van Der Beek’s $2m GoFundMe\n7 hours -\nSix possible effects of Trump’s climate policy change\n7 hours",
  "word_count": 665,
  "scraped_at": "2026-02-14T02:10:58.956641",
  "_text_extracted": true
}