{
  "article_id": "d3caf5bb9e3e",
  "url": "https://www.teamtalk.com/chelsea/boehly-left-embarrassed-chelsea-manager-shambles-rejects-big-name-coach-favour-lampard",
  "title": "Boehly left embarrassed by Chelsea manager shambles after rejecting big - name coach in favour of Lampard",
  "date": "20230419T193000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nBoehly left embarrassed by Chelsea manager shambles after rejecting big-name coach in favour of Lampard\nA report has revealed that Chelsea chairman Todd Boehly shockingly rejected the opportunity to bring in a Champions League-winning coach, instead deciding to appoint Frank Lampard as caretaker manager.\nChelsea announced the return of Lampard on April 6. He has been tasked with steadying the ship and boosting the mood around Stamford Bridge after the club’s disappointing spell under Graham Potter.\nHowever, things seem to have gotten worse under the interim boss. Chelsea have lost all four games he has been in charge of so far.\nThat includes Premier League defeats to Wolves and Brighton as well as two Champions League losses to Real Madrid in the last eight, which saw Carlo Ancelotti’s men advance with a 4-0 aggregate win.\nThings could get worse for Lampard and Chelsea, too. They face tough games against Brentford and Arsenal in the next few weeks.\nIt is unclear whether the club legend can be sacked in his role as interim manager. But Boehly will certainly be worried about how the team has performed under both Potter and Lampard, with Chelsea facing a season without any European football.\nREAD MORE: Chelsea legend Didier Drogba blames Todd Boehly for Blues demise: ‘It’s no longer the same club’\nIncredibly, Spanish outlet AS have revealed the top coach which Boehly rejected in order to land Lampard. It is claimed that Luis Enrique was ready to take over from Potter in the immediate aftermath of the Englishman’s sacking.\nEnrique would have been a great appointment for Chelsea. He won the Champions League and two La Liga titles during a three-year spell at Barcelona between 2014 and 2017. Enrique also has experience managing the Spain national team, though he could not help them add to their notable honours list.\nChelsea reject big managerial opportunity\nBut rather than capturing the Spaniard, Boehly and Chelsea’s other senior officials decided it would be best to appoint Lampard on a short-term basis and re-evaluate in the summer.\nIt is now very unlikely Enrique will end up taking charge of Chelsea. As per Matt Law of The Telegraph, Chelsea have decided not to press ahead with another round of talks with him.\nInstead, they are prioritising Julian Nagelsmann and Mauricio Pochettino. Enrique and Sporting Lisbon’s Ruben Amorim are described as being ‘outsiders’ for the job now.\nEnrique could instead end up coming to the Premier League by joining Chelsea’s London rivals Tottenham. Law writes that Chelsea pulling out of further discussions with the 52-year-old has left Spurs in a good position to appoint him.\nWhichever manager ends up arriving at Chelsea will have a big job on their hands. First of all, they will need to sit down with the Chelsea hierarchy and decide which players to keep and which ones to sell.\nAfter Boehly’s huge spending sprees in the last two transfer windows, Chelsea have a bloated squad full of players who feel they should be playing regularly but aren’t. Several big names need to be sold, such as Pierre-Emerick Aubameyang, Christian Pulisic and Conor Gallagher.\nThe new Chelsea boss will then have to decide on a style of play to use. This will be hard as Chelsea have been buying top young players without any consideration for the system they are used to.\nOne small positive is that having no European football to contend with should help Lampard’s successor to focus entirely on the Premier League. A top-four finish will be essential next term if Chelsea are to attract more elite players.\nMeanwhile, Michael Owen has detailed one factor which is ‘draining’ Lampard at Chelsea.",
  "word_count": 613,
  "scraped_at": "2026-02-14T01:55:54.946994",
  "_text_extracted": true
}