{
  "article_id": "d3e29443de83",
  "url": "https://www.caughtoffside.com/2024/12/23/leeds-united-dario-essugo/",
  "title": "Leeds hoping to beat Chelsea to sign Dario Essugo",
  "date": "20241223T203000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United are reportedly stepping up their pursuit of Dario Essugo, the highly-rated defensive midfielder on loan at La Liga side Las Palmas from Sporting CP.\nThe Whites are keen to secure the 19-year-old’s services as they look to strengthen their squad for a critical promotion push in the Championship.\nAccording to football journalist Alan Nixon, Leeds are preparing a loan-to-buy proposal for Essugo to fend off competition from Premier League giants Chelsea and other interested clubs.\nThis isn’t Leeds’ first attempt at signing the Portuguese sensation—they previously made a move for him in the summer, but Sporting opted to send him to Las Palmas for further development.\nDario Essug’s stellar rise\nEssugo has been a standout performer in La Liga this season, starting all 12 of his appearances and even scoring a goal. His consistent displays in Spain have only heightened his reputation as one of Portugal’s most exciting young talents.\nHaving joined Sporting’s academy at the age of nine, Essugo made history by becoming the club’s youngest-ever debutant at just 16 years old. He later broke Luís Figo’s record as Sporting’s youngest starter and holds the distinction of being Portugal’s youngest player to feature in the UEFA Champions League.\nUnder contract with Sporting until 2027, Essugo is highly valued by his parent club, making any potential deal a significant coup for Leeds.\nIf Leeds succeed in bringing Essugo to Elland Road, the youngster would add much-needed depth and quality to Daniel Farke’s midfield.\nKnown for his composure, ball-winning ability, and tactical intelligence, Essugo could provide a solid defensive presence while also supporting the team’s transition play.\nCurrently second in the Championship table, Leeds are well-positioned for automatic promotion but face fierce competition in the second half of the season. Reinforcing the squad with Essugo’s talent could be pivotal in maintaining their momentum and solidifying their bid to return to the Premier League.\nFarke has already admitted that he will have money to spend in the January transfer window, should he need it. They have been linked with several players, including Liverpool’s Caoimhin Kelleher.\nThe next few weeks will reveal whether Leeds can outmanoeuvre other bigger clubs and finalise a deal for the teenager.",
  "word_count": 365,
  "scraped_at": "2026-02-14T01:52:10.150204",
  "_text_extracted": true
}