{
  "article_id": "d3eb92180ea3",
  "url": "https://www.bbc.co.uk/sport/football/68428918",
  "title": "Chelsea 3 - 2 Leeds United : Conor Gallagher scores 90th - minute winner to take Blues into FA Cup quarter - finals",
  "date": "20240229T034500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea 3-2 Leeds United: Conor Gallagher scores 90th-minute winner to take Blues into FA Cup quarter-finals\n- Published\n- comments\nConor Gallagher scored a last-minute winner as Chelsea snatched a dramatic victory over Leeds United to move into the FA Cup quarter-finals.\nA thrilling fifth-round tie at Stamford Bridge looked to be heading towards extra time before the England international was free in the penalty area and lifted a finish past Illan Meslier.\nThe win keeps Chelsea's hopes of winning a trophy alive after they lost 1-0 to Liverpool in the Carabao Cup final on Sunday.\nMauricio Pochettino's side will return to Wembley for the FA Cup semi-finals if they win at home against Championship leaders Leicester City in the last eight in March.\nThe Argentine began his role as manager in July and felt the performances were improving, but the squad needed more time.\n\"The expectation is massive because we are Chelsea, but this team needs to build and build the confidence,\" said Pochettino. \"The unity is starting to grow, it's not magic, you can't just create it.\n\"It's difficult because of the expectations. You need to find the right balance and need time so they can perform.\n\"In the past four weeks we are doing fantastically, the team are fighting and starting to behave like a team.\"\nChelsea fell behind early on when a defensive error led to Mateo Joseph scoring his first senior goal as Leeds went ahead after only nine minutes.\nBut the visitors, second in the second tier, were only leaders for six minutes.\nNicolas Jackson made it 1-1 with a low strike from Moises Caicedo's pass before Mykhailo Mudryk gave Chelsea a 37th-minute lead, sweeping Raheem Sterling's pull-back into the bottom corner.\nYet Leeds were the better team at the start of the second half and got a deserved equaliser as Joseph grabbed his second goal with a header at the back post to connect with Jaidon Anthony's excellent cross.\nAnthony could not convert two chances to put the visitors ahead before substitute Gallagher proved to be the match winner.\nUnder-fire Chelsea battle for victory\nChelsea won the Champions League in 2021 and then followed that up by clinching both the Uefa Super Cup and the Fifa Club World Cup.\nBut they only finished 12th in the Premier League in 2022-23, failing to qualify for Europe, and are 11th this season and in danger of missing out on continental football again for 2024-25.\nChelsea have spent more than £1bn on transfer fees since a consortium led by American investor Todd Boehly and private equity firm Clearlake Capital bought the club in May 2022.\nHowever, their players were heavily criticised for the manner of their Carabao Cup final loss against a youthful Liverpool side, with ex-England and Manchester United defender Gary Neville calling Chelsea the 'blue billion-pound bottle jobs'.\nPochettino felt the comment was harsh and added: \"He [Neville] was frustrated because Liverpool won another title. It's not fair to accuse people in this way, with a team that's very young.\"\nHis side would have faced more criticism if they had gone out of the FA Cup but, despite being outplayed for large parts of the second half against a Leeds outfit that performed excellently, the hosts got the job done.\nGallagher admitted Chelsea had to respond in a positive way to the critics.\n\"It [the final loss] was a big disappointment and we wanted to bounce back and give the fans something to celebrate, and we managed to do that,\" said Gallagher.\n\"It has been a really tough few days and everyone has been down but we had to make sure we were right because it was such an important game and the boys dug deep to get the win.\"\nFor Daniel Farke's Leeds team they should be proud of their efforts and now focus on their main target of winning promotion back to the Premier League.\nSpeaking to BBC Radio 5 Live, Farke said he was \"very proud\" of his side's performance but felt Chelsea were \"clinical\".\n\"In the second half we had more possession, more shots at goal and more expected goals,\" he added.\n\"It was no coincidence we scored the second goal, we wanted to dominate possession in order to stick to our beliefs - many compliments to my young lads.\"",
  "word_count": 720,
  "scraped_at": "2026-02-14T01:51:19.047744",
  "_text_extracted": true
}