{
  "article_id": "d3f867366f9a",
  "url": "https://www.nytimes.com/athletic/6320439/2025/05/02/athletic-club-bilbao-europa-league-final/",
  "title": "Athletic Club Europa League dream was shredded in 15 mad minutes – so what now ? ",
  "date": "20250502T083000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It all seemed to be going to plan for Athletic Club.\nAll through the day around the city, then in the streets near the stadium, and finally inside the ground as the Europa League semi-final against Manchester United began, there was a real sense of opportunity. The competition’s final is taking place in Bilbao and Athletic looked ready to seize their moment.\nThe scenes in Bilbao are spectacular 😍 pic.twitter.com/2sOGZS1owM\n— Football on TNT Sports (@footballontnt) May 1, 2025\nThere were huge roars at a heaving San Mames when Ernesto Valverde’s side won a corner inside two minutes. The Basques were snapping into tackles all over the pitch, pressing United back and making chances.\nAdvertisement\nInside two minutes, Alex Berengeur hit a 20-yarder which was pushed around the post by Andre Onana. Nico Williams soon dispossessed a stumbling Harry Maguire in the United half, and almost put Maroan Sannadi clear. Berengeur had a shot blocked on the line by Victor Lindelof.\nAfter 20 minutes, Athletic were 5-0 up on shots taken, appeared faster to every 50-50, and belief was surging in the stands.\nThen that dream fell apart. Maguire’s run and cross from the right wing might have been unexpected, but it was poor marking which allowed Casemiro to head in.\nIt did not take long for home fans to start making noise again but then came the game’s crucial moment, with the video assistant referee spotting Dani Vivian’s pull on Rasmus Hojlund near the six-yard box. Penalty, and a red card for Vivian. It was a harsh call by Norwegian referee Espen Eskas, and Athletic’s fans never let him forget it, but Bruno Fernandes ignored a cacophony of noise and calmly rolled in the penalty. Then, just before half-time, more calamitous defending allowed Bruno a second, and United a third.\nThree goals in 15 minutes. In a week in which Spain had suffered a massive power cut which left the entire population without electricity or phone signal for most of Monday, Athletic had suffered their own systems failure at the most pressurised moment possible.\n“We didn’t manage well having (conceded) the first goal,” Valverde said at his post-match news conference. “The penalty and sending off did us a lot of damage. We did not manage all that tension. At 11-v-11, we were playing well and created two really clear chances. But the penalty affected what happened in the rest of the game. It’s always difficult to accept calls against you. But the referee makes the decisions.”\nAthletic’s 10 men continued to bravely, or recklessly, press up the pitch hoping to force a mistake and a way back into the game. But United were not really troubled and always looked the more likely team to score through a second half in which the pace had dropped considerably. Athletic’s shoulders began to slump, and passes started to be misplaced.\nAdvertisement\nTheir top scorer this season, Oihan Sancet, was missing through injury, and Valverde had stuck with his policy of starting back-up Julen Agirrezabala and leaving Spain’s Euro 2024 goalkeeper Unai Simon on the bench.\nBut the reality was that United were just the better team. Ruben Amorim could send on international quality substitutes like Matthijs de Ligt, Mason Mount and Kobbie Mainoo, while the limited Sannadi played the full 90 minutes, despite scoring only one goal in 18 games since he joined Athletic in January.\nAthletic did not once trouble Onana once they went behind. Their only shot on target after minute 20 came in second-half added-time, when Alvaro Djalo sent a free kick straight into Onana’s hands, but by then many fans had already started heading for the San Mames exits. Even with next week’s second leg at Old Trafford still to come, the reality of knowing they would not be coming back for the final which had seemed their destiny was starting to bite.\nThose that did stay raised their voices for one last torrent aimed at Eskas as he walked off, and to salute their players whose effort and application could not be questioned.\nAthletic didn’t get breaks from the officials, but their defeat was more about the gulf in quality and experience being exposed in that catastrophic 15-minute spell at the end of the first half. It was a stark reminder of the Premier League’s economic power — as a squad which has stumbled all year in the bottom half of England’s top tier was clearly superior to the team who have sat fourth for most of the La Liga campaign. United have had their own emotional rollercoaster of a season, but their players still dealt much better with a high-stakes occasion.\n“We wanted to reach this final but since the season started I’ve been saying that the final being in the stadium gives you motivation, but no advantage, and you have to play against very good teams,” Valverde said afterwards. “If you do not take your chances, and your opponent does, that is football. You have to accept it, improve and keep going.”\nThis will take time to get over. Valverde has less than three days to lift his team for Sunday’s La Liga trip to Basque neighbours Real Sociedad, who had their own complaints about referees after exiting the Europa League to United in the last 16. Athletic are still fourth in La Liga, and five Spanish teams qualify for next season’s Champions League, so they still have plenty to play for.\nAdvertisement\nThe longer-term consequences will remain to be seen. Nico Williams had spoken pre-game of how huge it would be to play a European final in Athletic’s home stadium, and the possibility of such shared experiences was a factor in his decision to turn down a move to Barcelona last summer. Other players could also receive offers — including Spain internationals Simon, Vivian and Sancet — and will have decisions to make.\nValverde denied afterwards this was the most disappointing night coaching the team, but admitted that view might change in the coming days. The hope for everyone in Bilbao is that this huge disappointment does not linger. A defiant performance at Old Trafford next Thursday, and then holding on to ensure Champions League football at San Mames next year, looks crucial now.\nThe dream of playing a European final at home died during the 15-minute power outage. But Athletic have a lot to be proud of and their future remains bright.\n(Top photo: Nico Williams; Guillermo Martinez/Anadolu via Getty Images)",
  "word_count": 1078,
  "scraped_at": "2026-02-14T02:02:35.571995",
  "_text_extracted": true
}