{
  "article_id": "d3fdcd01e5fa",
  "url": "https://www.empireofthekop.com/2024/05/16/klopp-wanted-new-matip-contract-liverpool/",
  "title": "Liverpool set to defy Klopp wish regarding  super  £100k - p / w colossus",
  "date": "20240516T113000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool are preparing to say goodbye not just to Jurgen Klopp but also some members of his squad at Anfield.\nAdrian, Thiago Alcantara and Joel Matip are all out of contract this summer and look certain to depart, although the latter might still have had a future at the club if the outgoing manager had his way.\nAs noted by Paul Joyce for The Times, the German’s response to the Cameroon centre-back suffering a season-ending ACL injury in December was to suggest to the Reds’ hierarchy that the 32-year-old be awarded a new deal, but none has been forthcoming.\nThere was a sense from some individuals within Liverpool that, for all his undoubted success, Klopp had begun to wield an excessive degree of power at the club when it came to transfer activity and player contracts.\nHis departure this year has been cited as one of the main reasons for Michael Edwards returning to Anfield as CEO of Football with FSG, with the Reds’ former sporting director having left in 2022 after apparent differences of opinion with the German.\nFOLLOW Empire of the Kop on Instagram (@empireofthekop) HERE\nMatip has been a tremendous servant for LFC throughout his eight years at the club, being hailed as a ‘super‘ defender by his manager earlier this season and excelling in the triumphant Champions League campaign in 2019.\nHowever, with the Cameroonian turning 33 in August and already on £100,000 per week despite having numerous injury troubles at Liverpool, it would’ve made little pragmatic sense to hand him a new contract at this stage of his career.\nAlthough the time feels right to say goodbye, the defender who turns mazy forward dribbles into an art form will depart Anfield as a genuine cult hero and can be assured a rousing reception on Sunday, and indeed for any subsequent returns to L4.\nREAD MORE: The evolution of Liverpool’s starting XI under Jurgen Klopp",
  "word_count": 319,
  "scraped_at": "2026-02-14T02:01:16.463304",
  "_text_extracted": true
}