{
  "article_id": "d405b830a0fd",
  "url": "https://www.90min.com/posts/you-can-ask-thomas-tuchel-frank-lampard-passionate-defence-mason-mount",
  "title": "  You can ask Thomas Tuchel  - Frank Lampard launches passionate defence of Mason Mount",
  "date": "20230415T121500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'You can ask Thomas Tuchel' - Frank Lampard launches passionate defence of Mason Mount\nBy Sean Walsh\nChelsea caretaker manager Frank Lampard has leapt to the defence of midfielder Mason Mount following criticism of his performances.\nThe 24-year-old, like many of his Blues teammates, has struggled to consistently find form this season, while he has also battled various injuries.\nMount, a product of the Chelsea academy, has been at the forefront of the club's most recent successes, including their 2021 UEFA Champions League triumph and subsequent FIFA Club World Cup victory.\nLampard signed Mount on loan during his first year in management at Derby County, before integrating him into the first-team setup at Chelsea when he took the Stamford Bridge job one season later.\nSpeaking at a press conference on Friday, Lampard hit back at critics of Mount and pointed to a long list of managers who too have put their faith in him.\n\"I'm not going to tell anyone what opinion they should have on football but if anyone thinks Mason Mount is not already a top-level player then I'm not sure what they're seeing, in my opinion,\" he said.\n\"Form is one thing that people can debate. There's players now that get debated about more than we were in my career. It's partly social media.\n\"But from working with Mason, you can ask myself, you can ask Thomas Tuchel, you can ask Gareth Southgate, you can ask Graham Potter, it's clear he's a top player. He's had his small injury problem. He felt okay in the game the other day. I think there's a little process over the next game or two of getting Mason to where we want him to be. Fingers crossed the injury's fine.\n\"But he's a top player and a top lad. And he does have a big affiliation with the club. One thing I know about Mason, the first thing a top player should have is a real hunger to succeed and play and do well for Chelsea, and he's had that since the first day I took him to Derby. That's simple for me. He's still a young player. He can go even further but he's already a top player.\"\nWill Mason Mount leave Chelsea?\nMount's contract at Chelsea runs until 2024, and he has been tipped to leave Chelsea amid their huge spending sprees under Todd Boehly's ownership.\nWhile Liverpool would be interested in signing Mount this summer, 90min understands there is renewed confidence in west London that he will sign a new deal following Graham Potter's departure.\nMount is understood to be more optimistic about Chelsea's future, though a full agreement over a new contract is some way off at the moment.\nLISTEN NOW\nOn this edition of Talking Transfers, part of the 90min podcast network, Scott Saunders, Graeme Bailey & Toby Cudworth discuss Liverpool missing out on Jude Bellingham this summer, Chelsea potentially hanging on to Mason Mount, Ryan Gravenberch interesting Man Utd & Arsenal & more!\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 511,
  "scraped_at": "2026-02-14T02:24:37.522364",
  "_text_extracted": true
}