{
  "article_id": "d40c80bd6344",
  "url": "https://www.teamtalk.com/news/jude-bellingham-real-madrid-osasuna-red-card-revelation",
  "title": "Real Madrid news : What Jude Bellingham said to the referee to get sent off v Osasuna and his explanation revealed",
  "date": "20250216T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Foul-mouthed Jude Bellingham comment that saw him red-carded for Real Madrid revealed\nReal Madrid midfielder Jude Bellingham is at the centre of an explosive controversy in Spain, as Carlo Ancelotti’s side dropped yet more points in LaLiga following a disappointing draw with Osasuna on Saturday, while Los Blancos great Ronaldo Nazario names his worst teammate at the Santiago Bernabeu.\nFollowing Madrid’s stunning late win against Manchester City at the Etihad Stadium in the Champions League, Los Blancos headed into their LaLiga game against Osasuna away from home at Estadio El Sadar high on confidence and amid expectations that they would win. However, Ancelotti’s side had to settle for a 1-1 draw, meaning that they have not won any of their last three league games.\nWhen Kylian Mbappe gave Madrid the lead in the 15th minute, it looked like it would be smooth sailing for the defending Spanish champions.\nHowever, Bellingham was controversially sent off in the 39th minute, and that eventually allowed Osasuna to stage a comeback in the second half when they scored the equaliser from the penalty spot in the 58th minute.\nThe England international was shown a straight red for foul and abusive language towards referee Jose Luis Munuera Montero.\nIt was Bellingham’s only second dismissal in his Madrid career following his move from Borussia Dortmund in the summer of 2023.\nThe manner in which the former Birmingham City star was dismissed was hugely controversial.\nBellingham approached Montero along with Madrid captain Luka Modric after he was penalised for a foul on Osasuna attacker Ruben Garcia.\nThe Madrid star gestured toward the referee and continued to speak to him about the foul on Garcia.\nAs reported in The Athletic, Bellingham said: “I’m trying to talk to you with respect. F*** off”.\nThe Madrid star has corroborated this version.\nThe referee’s report after the game, though, suggested that Bellingham had told Montero: “F**k you”.\nBellingham, though, has disputed that claim and said after the match: “It’s clear that it was a mistake and there is a miscommunication.\n“I remember the incident very well but I’ve also seen the video and the video doesn’t match the report.\n“I hope that the footage review can show that is not the same as the report and going forward that the federation can keep it under consideration because it’s huge evidence.\n“Obviously we can’t change the result but I think that going forward there will be a change.”\nBellingham continued: “There was no insult. You can see clearly in the video. I remember the incident very well. It was an expression to myself not directed towards the referee.\n“But obviously there was a misunderstanding of what he believes I said to him. It wasn’t an insult at all.”\nREAD MORE ➡️ Free agents: The three best unattached players available in each position\nRonaldo makes Thomas Gravesen, Real revelation\nMeanwhile, Ronaldo Luis Nazario de Lima has revealed the worst player he played with during his time at Madrid.\nThe Brazilian legend was on the books of Madrid from 2002 until 2007 and won LaLiga once with Los Blancos.\nWidely considered as one of the greatest footballers of all time, Ronaldo has revealed that Thomas Gravesen was his worst teammate.\nGravesen joined Madrid from Everton in January 2005 and left the Spanish giants for Celtic in the summer of 2006.\nRonaldo told Romario TV: “There was one at Real Madrid that was a joke. Gravesen was a really great guy, very good person.\n“He recently won a $50 million poker tournament. But in football he was very bad.”\nLatest Real Madrid news: Jorrel Hato bid, Koulierakis interest\nMadrid are reportedly interested in a summer deal for Ajax star Jorrel Hato.\nTEAMtalk understands that Liverpool are interested in signing Hato in the summer transfer window, with head coach Arne Slot personally keen on the youngster.\nA report in Spain has now claimed that Madrid are ready to make a bid of €40million (£33.3m / $42m) plus bonuses for Hato.\nLos Blancos are also willing to include a player to sweeten the deal and believe that he would form a strong partnership with Raul Asencio in central defence in the long run.\nHato is not the only Liverpool target that Madrid are looking to sign in the summer of 2025.\nKonstantinos Koulierakis is another defender that both Madrid and Liverpool have taken a shine to.\nWhile Madrid’s number one target for central defence is Arsenal ace William Saliba, they believe that VfL Wolfsburg star Koulierakis would be a more accessible player.\nMeanwhile, Manchester City are showing interest in Madrid forward Rodrygo.\nRodrygo is one of the best players for Madrid, and there are reports that Man City are eyeing a summer move for the Brazil international forward.",
  "word_count": 791,
  "scraped_at": "2026-02-14T01:49:18.060964",
  "_text_extracted": true
}