{
  "article_id": "d41812b604a4",
  "url": "https://www.nytimes.com/athletic/6458707/2025/07/02/womens-euro-2025-predictions/",
  "title": "Euro 2025 predictions : Will Spain win , which players to watch and could Iceland make the semis ? ",
  "date": "20250702T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Today is the day.\nThe Women’s European Championship gets underway in Switzerland, with England defending the title they won three years ago and Spain the favourites to win the tournament for the first time.\nOur writers are already in Switzerland to cover the event and we have asked some of them, along with members of our UK and U.S.-based teams, to tell us how they think things will pan out.\nLet us know whether you agree in the comments.\nAdvertisement\nFollow the Women’s Euros on The Athletic\n- The Radar: 25 players to watch for ’25\n- Team guides: All 16 competing nations profiled\n- Group guides: Key matches, dark horses, players to watch\nWhat are you most looking forward to about this tournament?\nCharlotte Harpur: Tournaments are all about people — you never know who you’re going to bump into. At the men’s Euros last year in Germany, I sat next to N’Golo Kante’s childhood friends on the train. Next thing you know, a legendary French fan is pulling out his cockerel Balthazar in the car park.\nMegan Feringa: This is actually the first time I’m covering a major tournament on the ground, so I’m excited to finally be experiencing the adrenaline and atmosphere first-hand, rather than via a surreal para-social existence. Also, Switzerland is gorgeous. Alps outside my window? 10/10.\nMichael Cox: In an era when almost all international tournaments feature an unreasonably large or mathematically problematic number of nations, a 16-team Euros is a dream. Two matches a day. A quarter-final four days in a row. You can watch everything, get into a nice routine, and base your whole month around the tournament without it becoming overwhelming.\nTamerra Griffin: I’ll be keeping a close eye on the mid-tier teams in this tournament, especially those who have been quietly building their squads either from the top down or bottom up (looking at you, Belgium, Italy and Iceland).\nCerys Jones: Seeing which teams have successfully moved on from their old guard and integrated their young talent. Since the last Euros, Germany’s Alexandra Popp, France’s Amandine Henry and England’s Ellen White have all retired, while there is no Wendie Renard or Eugenie Le Sommer in the France squad. How will they adapt?\nWhich player are you most excited about watching?\nHarpur: I’m intrigued to see what France striker Marie-Antoinette Katoto can do on the international stage. She was not selected for the 2019 World Cup and was injured for the 2022 Euros and 2023 World Cup.\nAdvertisement\nFeringa: Sorry for being basic but, health allowing, Aitana Bonmati. I love watching her play. The flair, the elegance, the rhythm — the fact all of those things occur simultaneously with seemingly no thought or sweat. She makes football look easy. And for someone who was asked politely not to return to their under-sevens team for being s***, I appreciate watching that.\nCox: I’m convinced Italy midfielder Manuela Giugliano has the potential to be the best midfielder in Europe, but at Euro 2022 and the 2023 World Cup, I’ve gone to matches hoping she would star, and Italy have lost 5-1 (to France in 2022 in Rotherham) and 5-0 (to Sweden in Wellington). Third time lucky for the 27-year-old?\nGriffin: Sandy Baltimore had arguably the season of her career with Chelsea, and frankly, should have made France’s 2023 World Cup roster. She is decisive, pacy and creative on the ball, and has become an elite defender. That versatility will come in handy for France and provide oodles of entertainment.\nJones: Claudia Pina. Within two minutes of coming on against England for Spain, the Barcelona attacking midfielder showed her ability to blow a game open. She’s fearless, fun to watch and I’d bet on her to score one of the goals of the tournament.\nGO DEEPER\nThe Radar - Women's Euro 2025: The Athletic picks 25 players to watch\nWho will be the player of the tournament?\nHarpur: Bonmati makes Spain tick. She sets the standards and the tempo, a creative outlet who can make something out of nothing and turns the heat up on the biggest stage. It will be such a shame if her case of viral meningitis limits her ability to make a huge impact.\nFeringa: Watching Mariona Caldentey is like watching someone who has been told they have only 90 minutes left to live, but that time limit might be forgotten if she plays well enough. Her voraciousness is enthralling, and for Spain, it is potentially tournament-deciding. The Arsenal midfielder was unlucky not to be named the Women’s Super League’s (WSL) Player of the Year following her move from Barcelona. Maybe that’s because the summer belongs to her instead?\nCox: More attack-minded Spanish midfielders have received the plaudits in recent years, so maybe it’s the turn of Patri Guijarro. On one hand, she’s a classic deep midfielder, on the other, she can suddenly push forward to influence the game in the final third. She’s basically the equivalent of Rodri, who won the men’s equivalent award at Euro 2024.\nAdvertisement\nGriffin: Pina is Spain’s ‘it’ player at the moment. She has consistently made the most of the minutes she’s been given (and is still most lethal coming off the bench), with an insatiable hunger for goals and victory unmatched by any other player.\nJones: I’m with Megan on this one. Caldentey blends consistency and flair perfectly. The Arsenal midfielder was the signing of the season in the WSL and will be the driving force behind Spain’s creativity. Expect her to chip in with goals too.\nWhich player could have a breakthrough tournament?\nHarpur: Without Mary Earps as England No 1, Hannah Hampton makes her major tournament debut. She is no stranger to high-pressure games at a domestic level with Chelsea but many will not have seen her quick reactions and pinpoint distribution.\nFeringa: This is a two-pronged prediction, as Iceland should have a breakthrough tournament and Sveindis Jane Jonsdottir will be a key player in that. Some might recall the 24-year-old forward scoring four goals in 25 minutes against Roma in last year’s Champions League, but she has more to show on the big stage, particularly after her move to Angel City.\nCox: With apologies for choosing a 27-year-old as my ‘breakthrough’ player, Germany No 10 Laura Freigang is yet to start a game at a major tournament and remains a relative unknown to many, but her Bundesliga performances for Eintracht Frankfurt in recent years have been exceptionally consistent. Her late runs into the box could bring some crucial goals.\nGriffin: Even though Sydney Schertenleib is still growing her way into Barcelona’s starting XI, she scored a stunner against Wolfsburg in the Champions League that makes you wonder what she’s capable of with ample time on the pitch.\nJones: Forward Michelle Agyemang, who has been on loan at Brighton & Hove Albion from Arsenal. Sarina Wiegman gambled on the 19-year-old instead of experienced Brighton & Hove Albion forward Nikita Parris — it could pay dividends. She will not be a starter for England but the stunning goal she scored seconds into her senior debut against Belgium shows super-sub potential.\nWho will win the Golden Boot?\nHarpur: We have seen glimpses of the vintage Alexia Putellas this season as she finished as Barcelona’s second-highest goalscorer and top assist provider. If Spain go far, Putellas could be at the centre.\nAdvertisement\nFeringa: Lea Schuller. The 27-year-old Germany forward was in hot form for Bayern Munich last season (11 goals in 22 league appearances), but in even hotter form this calendar year for Germany (five goals in six appearances). It brings her total goal tally since her international debut in 2017 to 52 goals in 75 appearances. Germany’s group (Poland, Sweden and Denmark) is not weak but not nasty. Schuller’s goalscoring form will play a big part in the team’s progression.\nCox: I feel inclined to choose someone from Group A, as it’s so much weaker than the others. So let’s overlook Norway’s pathetic recent tournament showings and go for Caroline Graham Hansen. After all, she is probably the best attacker in Europe and enjoys more freedom for her country than her club.\nGriffin: Pina. Even if she doesn’t start, she’s one of those blood-in-the-water strikers from whom goals can cascade once they’ve sniffed out a vulnerability.\nJones: Esther Gonzalez. The Spain and Gotham striker could feast on the supply line in group-stage games against Italy, Portugal and Belgium.\nHow do you rate England’s chances?\nHarpur: I really don’t know which England is going to turn up, given their patchy form. They cannot afford to get off to a slow start, as that could mean them failing to make the knockouts. Hit the ground running, though, and they have the quality and tournament experience to go deep.\nFeringa: England will go far. The noise is loud, but that means the players and coaching staff have had time to adjust to the volume. Despite the retirements and absences, Wiegman has plenty of strength in depth. There are still vulnerabilities in midfield but if England fail to go beyond the quarters, serious questions need asking.\nCox: As others suggest, it does feel difficult to work out. They may have got some lingering ‘squad harmony’ issues out of the way already. That said, they’re light in midfield, and the draw is tough. But they’ll get through, and continue up until they meet Spain, in either the semi-final or final. They might be better off coming runners-up in their group to avoid them until the final.\nAdvertisement\nGriffin: England under Wiegman at international competitions have been special. Even with the roster shake-ups and inconsistent play recently, I will never count them out. I expect them to grow into this tournament and produce those vital intangibles needed to edge out opponents. I expect them to reach the semi-finals.\nJones: There’s a real chance they don’t make it out of the ‘group of death’ with France and the Netherlands. But if they do go through, that confidence boost should take them to the final four.\nWhich team might surprise us?\nHarpur: Despite the tough draw, France will change the narrative of their sub-par major tournament performances and will go further than the quarter-finals.\nFeringa: Nailing colours to masts pre-tournament is always dangerous (please don’t keep this as a receipt), but if you’re still sleeping on Italy, I highly recommend you wake up. Italy topped their Nations League qualifying group to reach the Euros, defeating the Netherlands and Finland and drawing with Norway in the process. They’re fun, brave and — as Michael pointed out — have midfield quality in Giugliano. Watch this space.\nCox: It’s impossible to ignore the lopsided draw. There are six serious contenders — Spain, Germany, Sweden, England, France and the Netherlands. Spain are the only ones in the top half of the draw, which means an outsider is going to reach the semi-finals, possibly without being that good. Let’s go for Iceland, who have organisation, togetherness and some decent players too.\nGriffin: I’m going left-field and saying Portugal — in a bad way. I fear this tournament will expose them not as unworthy of a continental tournament, but for placing so much responsibility on their talismanic midfield maestro Kika Nazareth, who is in the squad but has had no preparation time because of injury. The last match Nazareth played with Portugal, they drew 1-1 with England. They’ve had one win since, and a slew of wide-margin losses. For a side that nearly beat the U.S. Women’s National Team at the World Cup, this Euros will hopefully be a wake-up call to the federation to continue investing in the team, not only its star player.\nJones: Norway are far better than their 8-0 defeat against England at Euro 2022 suggests. If they top Group A, as expected, they’re on the kinder side of the bracket and have stars, including Tuva Hansen, Ada Hegerberg and Guro Reiten.\nAdvertisement\nAnd finally… who will win it?\nHarpur: This tournament is so open, so it depends on who peaks at the right moment. Spain won the World Cup with a splintered squad and despite their federation and coach. The talent from one of the best generations of players remains, with a team seemingly more unified than before.\nFeringa: I’ve tried to convince myself not to write the word “Spain” for the past half hour. But the gut feeling is visceral. However wobbly some of the performances of the world champions have been leading to this tournament, when the players click, they’re unbeatable.\nCox: It’s really hard to look past world champions — and Nations League champions — Spain. They actually weren’t very convincing en route to World Cup glory two years ago, never truly finding the right balance. But they still won it. And they’ve got an incredibly easy route to the semi-finals this time.\nGriffin: France. It feels like now or never for a country that is yet to win a major international competition. Do I have questions about manager Laurent Bonadei’s ability to lead them through knockout-stage football? Yes. Am I concerned about the absence of veterans like Renard to hold the dressing room together when the stakes rise? Yep. But Katoto is back, Baltimore and Delphine Cascarino have been balling, and goalkeeper Pauline Peyraud-Magnin just had the game of her life in their comeback win over Brazil. It’s time.\nJones: Spain. They gave Belgium a 2-0 headstart in February and still won 3-2. In their past four games, they hammered Portugal and Belgium, then beat England and Japan. Their squad is packed with star players — as my answers above show — and they have a perfect blend of youth and experience.\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 2291,
  "scraped_at": "2026-02-14T01:52:26.328098",
  "_text_extracted": true
}