{
  "article_id": "d442e7394c60",
  "url": "https://www.empireofthekop.com/2024/08/28/bajcetic-barcelona-loan-offer-liverpool-news/",
  "title": "Liverpool midfielder immediate future could take late window twist",
  "date": "20240828T223000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The immediate future of one Liverpool player remains up in the air after news of a sudden twist emerged on Wednesday afternoon.\nFabrizio Romano had reported early this morning of Red Bull Salzburg being close to completing a loan move for Stefan Bajcetic, although the 19-year-old mightn’t be linking up with Pep Lijnders in Austria just yet.\nThe Italian transfer guru posted on X a few hours later that Barcelona have submitted an offer of a straight loan for the midfielder, with no purchase clause included, with the Catalan giants eager to bring in a defensive midfielder after the ACL injury blow to Marc Bernal.\n🚨🔵🔴 EXCLUSIVE: Barcelona submit straight loan proposal to Liverpool for talented midfielder Stefan Bajcetic!\nMore exclusive details: loan bid worth €4m fee, NO buy clause.\nAfter loan bid from RB Salzburg on Tuesday, now Barça try to make it happen after Bernal injury.\n— Fabrizio Romano (@FabrizioRomano) August 28, 2024\nREAD MORE: Liverpool have asked about 21y/o attacker who could be another bargain for the Reds\nJust when it seemed as if Bajcetic was on his way to Salzburg, the loan offer from Camp Nou could give him and Liverpool a decision to make.\nThe teenager could find it difficult to resist the lure of Barcelona, especially as a Spanish native himself, and the setback to Bernal could open the door for the 19-year-old to feature if he were to link up with Hansi Flick’s side.\nFollow Empire of the Kop on Instagram (@empireofthekop) HERE\nHowever, if he goes to Austria he’d have a familiar face to guide him in ex-LFC assistant manager Pep Lijnders, who’s now in charge at the Red Bull Arena, while he’d still experience Champions League football without the notorious scrutiny which comes with playing for the Blaugrana.\nFor Bajcetic and Liverpool, the most crucial factor is which of the two clubs who are in for him would be better placed to offer him regular game-time, as there’s no point in loaning him out if he’s merely going to be plonked on the bench elsewhere.\nNow that we’re at the stage of the transfer window where deals can develop or disintegrate at a rapid pace, it’s anyone’s guess as to where the teenage midfielder will find himself by the time the deadline strikes at 11pm on Friday night.\nEOTK Close-up with John Welsh: ‘a local lad who lived his dream’ and Slot’s LFC predictions",
  "word_count": 403,
  "scraped_at": "2026-02-14T01:57:35.662795",
  "_text_extracted": true
}