{
  "article_id": "d461c5fb14e1",
  "url": "https://www.uefa.com/womenschampionsleague/news/028b-1a824518ef53-5abeadec0c22-1000--meet-the-semi-finalists/",
  "title": "Meet the Women Champions League semi - finalists : Barcelona , Chelsea , Lyon , Paris Saint - Germain | UEFA Women Champions League",
  "date": "20240329T001500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Meet the Women's Champions League semi-finalists: Barcelona, Chelsea, Lyon, Paris Saint-Germain\nFriday, April 19, 2024\nArticle summary\nBarcelona play Chelsea and Lyon face Paris Saint-Germain in the semi-finals.\nArticle top media content\nArticle body\nBarcelona play Chelsea and Lyon face Paris Saint-Germain in the UEFA Women's Champions League semi-finals in the last two weekends of April. We introduce the four contenders aiming for the 25 May final in Bilbao.\nRoad to Bilbao: Semi-final ties\nFirst legs:\nSaturday 20 April\nBarcelona vs Chelsea (13:30 CET)\nLyon vs Paris Saint-Germain (19:00 CET)\nSecond legs:\nSaturday 27 April\nChelsea vs Barcelona (18:30 CET)\nSunday 28 April\nParis Saint-Germain vs Lyon (16:00 CET)\nFinal (25 May, San Mamés, Bilbao)\nBarcelona / Chelsea vs Lyon / Paris (18:00 CET)\nBarcelona vs Chelsea\nBarcelona vs Chelsea in Europe\n2022/23 semi-finals: Chelsea 0-1/1-1 Barcelona (agg: 1-2)\n2020/21 final: Chelsea 0-4 Barcelona (Gothenburg)\nFirst-named team at home in opening leg of two-legged ties\nOf the 19 different clubs Chelsea have faced in this competition (all under Emma Hayes), Barcelona are the only team they have never defeated.\nBarcelona (ESP, holders)\nUEFA coefficient ranking (end of 2022/23): 1\nHow they qualified: Holders, Spanish champions\nGroup stage: Group A winners (W5-0 h vs Benfica, W3-1 a vs Eintracht Frankfurt, W6-0 a vs Rosengård, W7-0 h vs Rosengård, W2-0 h vs Eintracht Frankfurt, D4-4 a vs Benfica)\nQuarter-finals: W5-2agg vs Brann (W2-1 a, W3-1h)\nTop scorer: Salma Paralluelo (6)\nLast season: Winners\nDomestic honours: 8 x League champions, 9 x Cup winners\nPrevious European best: Winners (2020/21, 2022/23)\nSemi-final record: W4 L2\nPrevious semi-finals\n2022/23: W2-1agg vs Chelsea (W1-0 a, D1-1 h)\n2021/22: W5-3agg vs Wolfsburg (W5-1 h, L0-2 a)\n2020/21: W3-2agg vs Paris Saint-Germain (D1-1 a, W2-1 h)\n2019/20: L0-1 vs Wolfsburg (n, San Sebastián)\n2018/19: W2-0agg vs Bayern (W1-0 a, W1-0 h)\n2016/17: L1-5agg vs Paris Saint-Germain (L1-3 h, L0-2 a)\nCampaign in a nutshell\nAiming for a second straight title, and a fourth final in a row, Barcelona cruised through their group in familiar style, top scorers once again and only dropping points on Matchday 6 at Benfica with first place already secured. Brann did give Barcelona a test on the Norwegian club's first quarter-final appearance, but Salma Paralluelo struck the winner in the first leg before Caroline Graham Hansen continued a stellar campaign with a supreme performance against her compatriots in the return.\nCoach: Jonatan Giráldez\nThe former assistant to Lluís Cortés replaced the Women's Champions League-winning coach in the summer of 2021 and has kept Barcelona's stellar run going almost without missing a step, losing the 2022 Champions League final against Lyon but defeating Wolfsburg 12 months later and continuing to dominate domestically. The 32-year-old is stepping down at the end of the season to take over Washington Spirit.\nDid you know?\nBarcelona have equalled Lyon's record of reaching six semi-finals in a row.\nChelsea (ENG)\nUEFA coefficient ranking (end of 2022/23): 6\nHow they qualified: English champions\nGroup stage: Group D winners (D2-2 a vs Real Madrid, W4-1 h vs Paris FC, D0-0 h vs Häcken, W3-1 a vs Häcken, W2-1 h vs Real Madrid, W4-0 a vs Paris FC)\nQuarter-finals: W4-1agg vs Ajax (W3-0 a, D1-1 h)\nTop scorer: Sam Kerr (5)\nLast season: Semi-finals\nDomestic honours: 6 x League champions, 5 x Cup winners\nPrevious European best: Runners-up (2020/21)\nSemi-final record: W1 L3\nPrevious semi-finals\n2022/23: L1-2agg vs Barcelona (L0-1 h, D1-1 a)\n2020/21: W5-3agg vs Bayern (L1-2 a, W4-1 h)\n2018/19: L2-3agg vs Lyon (L1-2 a, D1-1 h)\n2017/18: L1-5agg vs Wolfsburg (W1-3 h, L0-2 a)\nCampaign in a nutshell\nChelsea had a tough group but seldom looked in trouble, despite being denied on Matchday 1 in Madrid and held at home by Häcken. They had a long injury list that included Sam Kerr by the time they faced Ajax in the quarter-finals, but the Blues continued their excellent away European record in the last couple of seasons as they won 3-0 in front of more than 35,000 fans in Amsterdam, ensuring they could afford a 1-1 Stamford Bridge draw in which January signing Mayra Ramírez scored.\nCoach: Emma Hayes\nHer Arsenal playing career was cut short aged 17 due to injury, but, after learning the coaching ropes with the FA, Hayes joined the Gunners' set-up and was assistant to Vic Akers when they won the 2006/07 UEFA Women's Cup. In 2008, she took over at Chicago Red Stars and later worked for Western New York Flash as technical director prior to her 2012 appointment by Chelsea. Six league titles, numerous other trophies, a run to the 2021 Women's Champions League final and many personal honours have followed. Like Barcelona coach Giráldez, Hayes is leaving at the end of the season to become the United States national coach.\nDid you know?\nChelsea are one of only two English clubs to reach the final, along with Arsenal (in 2006/07 when Hayes was assisting Akers).\nLyon vs Paris Saint-Germain\nLyon vs Paris in Europe\n2021/22 semi-finals: Lyon 3-2/2-1 Paris (agg: 5-3)\n2020/21 quarter-finals: Paris 0-1/2-1 Lyon (agg: 2-2, Paris win on away goals)\n2019/20 semi-finals: Paris 0-1 Lyon (Bilbao)\n2016/17 final: Lyon 0-0aet, 7-6pens Paris (Cardiff)\n2015/16 semi-finals: Lyon 7-0/1-0 Paris (agg: 8-0)\n2014/15 round of 16: Paris 1-1/1-0 Lyon (agg: 2-1)\nFirst-named team at home in opening leg of two-legged ties\n- This now becomes the most played match in UEFA women's competition history (the current ten encounters equal with Chelsea vs Wolfsburg).\nLyon (FRA)\nUEFA coefficient ranking (end of 2022/23): 2\nHow they qualified: French champions\nGroup stage: Group B winners (W9-0 a vs Slavia Praha, W2-0 h vs St. Pölten, W3-1 h vs Brann, D2-2 a vs Brann, W7-0 a vs St. Pölten, D2-2 h vs Slavia Praha)\nQuarter-finals: W6-2agg vs Benfica (W2-1 a, W4-1 h)\nTop scorer: Kadidiatou Diani (7)\nLast season: Quarter-finals\nDomestic honours: 16 x League champions, 10 x Cup winners\nPrevious European best: Winners (2010/11, 2011/12, 2015/16, 2016/17, 2017/18, 2018/19, 2019/20, 2021/22)\nSemi-final record: W10 L2\nPrevious semi-finals\n2021/22: W5-3agg vs Paris Saint-Germain (W3-2 h, W2-1 a)\n2019/20: W1-0 vs Paris Saint-Germain (n, Bilbao)\n2018/19: W3-2agg vs Chelsea (W2-1 h, D1-1 a)\n2017/18: W1-0agg vs Manchester City (D0-0 a, W1-0 h)\n2016/17: W3-2agg vs Manchester City (W3-1 a, L0-1 h)\n2015/16: W8-0agg vs Paris Saint-Germain (W7-0 h, W1-0 a)\n2012/13: W9-1agg vs Juvisy* (W3-0 h, W6-1 a)\n2011/12: W5-1agg vs Turbine Potsdam (W5-1 h, D0-0 a)\n2010/11: W5-2agg vs Arsenal (W2-0 h, W3-2 a)\n2009/10: W3-2agg vs Umeå (W3-2 h, D0-0 a)\n2008/09: L2-4agg vs Duisburg (D1-1 h, L1-3 a)\n2007/08: L1-1agg, away goals vs Umeå (D1-1 h, D0-0 a)\n*now Paris FC\nCampaign in a nutshell\nLyon lost 5-1 at home to Arsenal on Matchday 1 last season but started with an even more emphatic away win this time around, defeating Slavia Praha 9-0. At Brann on Matchday 4, they failed to win after holding a two-goal lead for the first time since FC Lyon became Olympique Lyonnais, but their progress was still comfortable. After coming back to beat Benfica 2-1 in the first leg of their quarter-final, they were pushed hard in the return before two added-time goals by Kadidiatou Diani, prolific since her summer switch from Paris Saint-Germain, gave the scoreline a more comfortable look.\nCoach: Sonia Bompastor\nBompastor's stellar playing career included winning 11 major honours in her two spells with Lyon, lifting the Champions League trophy as captain in 2011 and 2012. A midfielder who could also play in defence, Bompastor represented La Roche-sur-Yon, Montpellier, Washington Freedom and Paris Saint-Germain. Capped 156 times by France, she retired in 2013 and worked her way up the coaching ranks at Lyon before taking over the first team in 2021, winning the Champions League (the first to do so as player and head coach) and French league the following season as well as the French double in 2022/23.\nDid you know?\nLyon hold most records in this competition. This season alone, they have equalled Arsenal's tally of 15 quarter-finals, extended their own best to 13 semi-finals and are now aiming for an 11th final and ninth title.\nParis Saint-Germain (FRA)\nUEFA coefficient ranking (end of 2022/23): 4\nHow they qualified: French runners-up; W4-2agg vs Manchester United (D1-1 a, W3-1 h)\nGroup stage: Group C winners (L0-2 a vs Ajax, L0-1 h vs Bayern, W2-1 h vs Roma, W3-1 a vs Roma, W3-1 h vs Ajax, D2-2 a vs Bayern)\nQuarter-finals: W5-1agg vs Häcken (W2-1 a, W3-0 h)\nTop scorer (group stage onward): Marie-Antoinette Katoto (5)\nLast season: Quarter-finals\nDomestic honours: 1 x League champions, 3 x Cup winners\nPrevious European best: Runners-up (2014/15, 2016/17)\nSemi-final record: W2 L4\nPrevious semi-finals\n2021/22: L3-5agg vs Lyon (L2-3 a, L1-2 h)\n2020/21: L2-3agg vs Barcelona (D1-1 h, L1-2 a)\n2019/20: L0-1 vs Lyon (n, Bilbao)\n2016/17: W5-1agg vs Barcelona (W3-1 a, W2-0 h)\n2015/16: L0-8agg vs Lyon (L0-7 a, L0-1 h)\n2014/15: W3-2 vs Wolfsburg (W2-0 a, L1-2 h)\nCampaign in a nutshell\nThe only one of the semi-finalists not to start directly in the group stage, Paris first had to overcome a tricky round 2 tie against debutants Manchester United. Things got no easier after they progressed as they lost their first two games to Ajax and Bayern respectively, but a late Georgia Stanway own goal secured top spot on Matchday 6. Häcken did not make life easy in the quarter-finals, but Paris, whose performances have improved steadily as the season has progressed, emerged triumphant.\nCoach: Jocelyn Prêcheur\nPrêcheur took over as head coach in September after his father Gerard (who Jocelyn was assisting) stepped down one game into the season. Before joining the Paris set-up in July 2022, Prêcheur had worked in China for five years as coach of Meizhou Hakka and Jiangsu Suning, having previously been a youth coach at Paris FC (helping set up the Juvisy academy in 1998) as well as an analyst at Lyon and Paris Saint-Germain (between 2010 and 2012). The mathematics and statistics graduate has also designed football analytics software.\nDid you know?\nParis are the only team to have denied Lyon a French title since 2005/06, topping the table by a point on the final day in 2020/21.\nCup winners refers only to main FA national cup in each country.",
  "word_count": 1711,
  "scraped_at": "2026-02-14T02:10:47.909635",
  "_text_extracted": true
}