{
  "article_id": "d4725344bcfc",
  "url": "https://www.smh.com.au/sport/soccer/after-20-years-the-glory-days-are-back-at-marconi-s-palace-are-they-here-to-stay-20251130-p5njk6.html",
  "title": "Australian Championship : After 20 years , the glory days are back at Marconi  Palace . Are they here to stay ? ",
  "date": "20251202T064500Z",
  "domain": "smh.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After 20 years, the glory days are back at Marconi’s ‘Palace’. Are they here to stay?\nBy Vince Rugari\nOne of the first things that catches the eye when you drive into Club Marconi in Bossley Park is a large metal soccer ball on stilts. Like the team that plays here, it has a storied history.\nConstructed for the 1993 FIFA World Youth Championship held in Australia, the ball was rolled onto the field at the old Sydney Football Stadium as part of the tournament’s opening ceremony, then placed on its stand and lit up by surrounding pyrotechnics.\nAfter the tournament, nobody knew what to do with it – except the then-Marconi president Tony Labbozzetta, who saw a historic ornament befitting his club, the champions of the National Soccer League that season. He organised for the giant ball to be erected over the turnstiles at Marconi Stadium, where all spectators pass through on the way to their seats.\nOver time, its lustre faded, its painted exterior giving way to rust and grime. In the opening scene of the book The Death and Life of Australian Soccer, author Joe Gorman sketches a picture of institutional decline on the day in 2015 that Marconi were relegated to the ignominy of NSW’s second division, a depth they hadn’t plumbed in almost half a century. Gorman describes the ball as a “relic of a bygone era, similar to one of those dusty old silos in a long-forgotten rural town.”\nIt’s looking much better these days.\n“It was due for a nice paint job,” admits Robert Carniato, Marconi’s football chairman.\nIn preparation for the new Australian Championship, and Marconi’s return to national competition for the first time in 21 years, it was given a much-needed facelift – and it is standing proudly again above the gates, symbolic now of possibility, not decay.\nEven the jersey Marconi wore for their semi-final against Brisbane side Moreton City Excelsior was a throwback: a modern adaptation of the club’s 1993 kit, the sort of garish design that is very much in vogue again.\nClub Marconi itself, a true Sydney sporting institution, has also been recently renovated; you can see why they call this place “the Palace”. But traces of the recent past remain, like a sign instructing patrons that the only national flag allowed to be flown in the venue is the Australian one. That rule is outdated. In 2019, Football Australia lifted the ban on national flags, and on Saturday afternoon, the Italian tricolour was everywhere.\nThe searing 35-degree heat and accompanying hairdryer-like wind would have kept some people away, but there were plenty streaming into the stadium, underneath the ball – at least four times the number they’d usually see for a regular NPL fixture, club officials say.\nCarniato’s late father and grandfather were founding members of the club, back in the days when pretty much everyone who came here was a newly arrived Italian migrant. As the diaspora assimilated into Australian society, that fan base dwindled.\n“Our supporters are basically elderly – or mums and dads because, obviously, we get a lot of our kids to come and watch the game,” he says. “But we’re starting to get a lot more young people interested.”\nFor example: Cameron Lowe, 20, who is part of The Stables, the self-appointed Marconi active supporter group. When this masthead met them pre-match, they consisted of precisely six blokes: five in Marconi jerseys and one in a Parramatta Eels top, most of whom were on the pre-midday beers. Only one of them has an Italian background, which is perhaps illustrative of the new Marconi. They are too young to have experienced the glory days themselves, but old enough to have heard stories about them, and keen to help bring them back.\nLowe is also a Western Sydney Wanderers fan, but wasn’t planning on going to the A-League’s Sydney derby at CommBank Stadium that night.\n“All I care about is this,” he says. “It’s a bit more raw, and I prefer it. It’s less media, it’s less all this … because it is a lot smaller in comparison, it’s a bit more compact, you can hear everything, you feel everything.\n“We’ve come to all the games here. It’s been generational. I’ve never felt better about football. I’ve never enjoyed Australian football as much as I have now, and I cannot wait for the NPL season to start next year – or whatever the next step is for the Australian Championship.”\nInside the VIP area, where pizza, pasta and Italian meats and cheeses are being served for lunch, Socceroos coach Tony Popovic is watching the game with John Tsatsimas, his former chief executive at Western Sydney Wanderers, and Mark Ivancic, the chairman of Sydney United 58, Popovic’s boyhood club. Anthony Caceres, a Marconi junior who now plays for Macarthur FC and the Socceroos, is sitting a few rows ahead. The room is a snapshot of Australian football’s past and present, converging at a place that helped shape both.\nFA chairman Anter Isaac is in the house, too, explaining how we got here. Isaac has played a key role in the development of the Australian Championship, a new national second-tier competition involving eight “foundation” clubs, such as Marconi, and eight other qualifiers from around the country, like Moreton City, the NPL Queensland champions.\nThe Championship is not so much a separate league, which is what the foundation clubs initially wanted, but an end-of-year Champions League-style tournament. The standard of play is somewhere between the NPL and the A-League, though crowds have varied wildly from a few hundred to a few thousand.\n“It matches our expectations,” Isaac says. “We thought early on people would be excited, enthusiastic, but also maybe hesitant, not quite sure of what this competition’s about.\n“One point that I keep trying to make internally is you can’t build a trend line off one data point. You can’t build a trend line off two data points. Three data points, you can start finding things out, whether it’s working or not.”\nThere will be at least five data points.\nDespite pre-launch rumours that it would be short-lived, Isaac says FA’s board has decided to support the Championship for five years. It is a loss-making exercise, but the federation sees it as more of an investment in the game, one that is intended to give further opportunities to players, coaches, referees and administrators, and aspirational NPL clubs a suitable environment to increase their operations.\nThose clubs, that have been calling for a second division almost since the A-League started two decades ago, are now coming to terms with what that requires, and the difficulties of reaching the benchmarks set by FA: not just better football, but better marketing, merchandising, membership, sponsorship and brand awareness.\nThere were some “nerves” among A-League clubs when it launched, Isaac says, but now they’ve seen it for themselves, they realise it is not so much a direct threat but an opportunity, and an incubator they could soon benefit from. By the time the A-League next expands, Isaac hopes clubs such as Marconi, courtesy of their experiences in the Championship, will be in a position to table a serious, legitimate bid to rejoin the full-time professional ranks.\n“That’s probably the more reasonable pathway for them in the medium to long term,” Isaac says.\nThe match itself is decent fare, though it suffered a little because of the conditions, forcing drinks breaks to be taken in each half – but it was a tense, hard-fought contest, won 1-0 by Marconi thanks to Matej Busek’s 80th-minute goal.\nThe crowd was lively, too, and gave it to Moreton City’s coach when he received a yellow card for dissent. “Go back to Queensland,” he was told by one punter.\nThe crowd was also, to be blunt, small.\nThe official attendance was just 1477, but in a close-knit venue like this, it felt like a lot more than that – and better than some A-League games feel in bigger, more cavernous stadiums. The Championship averaged attendances of about 1500 during the group stage, with Marconi’s crowds putting them in the upper half of the competition.\nStill, those aren’t the sort of numbers that will return Marconi to the promised land, and they know it. Growth will take time, effort and money.\nUntil then, for anyone who claims to enjoy football, there’s no reason why they wouldn’t enjoy the Championship for what it is today.\n“The first year is going to have teething problems,” Carniato says. “I think we can get better.”\nOnly a handful of their rivals are further along – one of them being South Melbourne, the main drivers of the Championship, who Marconi will meet in Saturday’s final at Olympic Village in Melbourne.\nSouth have led the way on and off the field, attracting a competition-high average crowd of 4056 and going undefeated in their eight games, bolstering their long-standing case for A-League inclusion.\nFor clubs such as Marconi, it is a long road back to the top. But at least there is a road. At long last, the ball is rolling again.",
  "word_count": 1519,
  "scraped_at": "2026-02-14T02:09:38.455730",
  "_text_extracted": true
}