{
  "article_id": "d4a4a719e45f",
  "url": "https://metro.co.uk/2025/12/20/chelsea-hero-slams-very-spoilt-blues-fans-defends-enzo-maresca-25647302/",
  "title": "Chelsea hero slams  very spoilt  Blues fans and defends Enzo Maresca",
  "date": "20251220T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea fans have become ‘very spoilt’ and should give manager Enzo Maresca a break, believes Blues hero Tore Andre Flo.\nIt has been an inconsistent time for the club of late, but not a disastrous one as they sit fourth in the Premier League table.\nIn the Champions League Chelsea have won three of their six outings and are 13th in the group stage table, but still have time to make the top eight.\nLast time out they beat Cardiff City in the Carabao Cup to reach the semi-finals of the event.\nThere has been disquiet at Stamford Bridge, though, with some fans not warming to Maresca and the manager himself voicing frustrations.\n‘The last 48 hours has been the worst since I joined the club because many people didn’t support me and the team,’ Maresca said after a Premier League win over Everton last weekend.\nWith fans still questioning whether Maresca is the right man for the job, former Chelsea striker Flo feels the Italian is doing well and supporters have just become spoilt by the success of recent years.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He’s done a really good job’\n‘I think Chelsea supporters are very spoilt,’ Flo told Stadium Astro.\n‘Over the last 20 years they have won a lot of trophies and they are not so keen on this “yes, we have a young team, let’s give them a few years.”\n‘I think the supporters want to win things straight away, every year and that’s why the pressure is so high at Chelsea.\n‘I agree with you, he’s done a really good job and I think a lot of Chelsea supporters also think that.\n‘But they are getting restless, they want to have trophies all the time.\nMore Trending\n‘That’s what comes with being a manager at Chelsea now, when they’ve been so good and they’re spending so much money. Yes it’s been on young players but still it’s a lot of money and they need results along the way.’\nMaresca made a point of sending his players to applaud the travelling fans after Chelsea drew 2-2 at Newcastle on Saturday afternoon.\nIt looked likely to be a nightmare trip for the Blues when they found themselves 2-0 down at half-time, thanks to a Nick Woltemade double.\nHowever, Chelsea looked an entirely different team in the second stanza, with goals from Reece James and Joao Pedro securing a point.\nMORE: Premier League release statement on controversial penalty decision in Newcastle vs Chelsea\nMORE: Arsenal star Bukayo Saka names the winger he idolised – ‘I shouldn’t say this’\nMORE: Newcastle 2-2 Chelsea: Joao Pedro secures point for Blues in comeback draw",
  "word_count": 493,
  "scraped_at": "2026-02-14T01:59:31.519488",
  "_text_extracted": true
}