{
  "article_id": "d4a9dfa6a51e",
  "url": "https://www.caughtoffside.com/2023/05/28/transfer-news-bellingham-boey-arsenal-and-more/",
  "title": "Transfer news : Bellingham , Boey Arsenal , and more",
  "date": "20230528T134500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to the latest edition of the Daily Briefing – click here to subscribe and get this plus more exclusive content ad-free and straight to your inbox!\nAjax\nBranco van der Boomen is set to join Ajax on free transfer – there’s an agreement in principle and he’s set to undergo medical tests with the Eredivisie giants.\nArsenal\nArsenal are one of the two English clubs being kept informed on the conditions of the potential Sacha Boey deal. The 22-year-old Frenchman has just changed agents, but there have been no concrete talks with Arsenal yet. Galatasaray recently made it clear during meetings in London that their asking price for Boey is €25m.\nMikel Arteta on Arsenal’s strategy in the transfer market: “We have to seek excellence in everything that we touch and participate in so that it’s going to have a big impact at the club. We have a really promising plan.”\nArsenal resisted requests to put a release clause in Bukayo Saka’s new contract, going for a shorter deal instead (Daily Mail)\nAthletic Bilbao\nAthletic Club are set to sign Liverpool’s 2006-born forward Elijah Gift on a permanent deal. He’s set to undergo a medical with the La Liga club. Athletic have agreed terms with Liverpool, and the 16-year-old is expected to sign a long term deal.\nBarcelona\nNegotiations are ongoing to extend Ousmane Dembele’s contract at Barcelona — crucial step as there’s a €50m clause in his current deal. There’ll be further discussions as Xavi considers Dembele a key player, while the Frenchman is also happy at the Nou Camp.\nXavi on the recent Jules Kounde speculation: “Once again, with Kounde there is not and there has not been any problem. He’s a fundamental piece of our team. Jules is a top professional, we’re very happy with him. I don’t understand why on the media people report that there are problems. No issues, at all.”\nXavi on his transfer priorities: “We won’t sign a new left back this summer to replace Alba; we have Balde and Marcos Alonso. We need Busquets replacement. It will depend on Financial Fair Play situation. I want smart, determined pivot who wins duels.”\nBayern Munich\nBayern Munich narrowly beat Borussia Dortmund to the Bundesliga title on a dramatic final day yesterday! Jamal Musiala scored a superb late goal against FC Koln while Dortmund dropped points, making it 11 Bundesliga title victories in a row.\nBayern responded by dismissing Oliver Kahn as CEO, with Jan-Christian Deesen replacing him. Hasan Salihamidzic was also sacked as director at the Allianz Arena.\nOliver Kahn after being dismissed: “My plan was to come to Köln and then of course celebrate title with the squad, but I was forbidden.”\nDaley Blind will also leave Bayern in the next weeks. He hasn’t seen much playing time since Thomas Tuchel took over as manager and he’s now going to look for new chapter. It’s over, he’ll be moving as a free agent.\nBayern had new contract proposal ready for Jamal Musiala, who was brought to the club by Salihamidzic; talks have to re-start with new director now.\nBorussia Dortmund\nBorussia Dortmund will schedule a new round of talks for Ajax midfielder Edson Alvarez to take place next week. There hasn’t been an official bid yet, but negotiations will take place with Ajax. Edson himself is keen on the move, and waiting for the proposal. Dortmund will also hold talks with Real Madrid over the final details of the Jude Bellingham deal.\nBrighton\nRoberto de Zerbi has been linked again with the Tottenham job. The Italian is one of the top names on Spurs’ list but he’s not planning to leave Brighton this summer; he’s 100% committed to the Brighton project, so it’s not a concrete option for Tottenham.\nChelsea\nSporting Lisbon star Manuel Ugarte has not made any final decision on his future just yet. A new round of talks is set to take place in the next few days. Both Chelsea and PSG have made it clear they’d be ready to match the player’s €60m clause, but with different payment terms. Players could also be included as part of the deal.\nInter Milan will discuss Romelu Lukaku’s future with Chelsea after the upcoming Champions League final clash with Manchester City.\nChristopher Nkunku marked his final game as an RB Leipzig player with a goal, taking his total to 15 goals and 5 assists in 25 Bundesliga games this season. The France international is joining Chelsea next season, with the deal expected to be announced soon after completing a medical back in September and signing documents in December.\nCrystal Palace\nCrystal Palace are making progress in their efforts to sign Jefferson Lerma on a free transfer from Bournemouth. Lerma has a number of proposals as he’ll leave as free agent but Palace are leading the race for his signature at the moment, with a contract offer made to the player.\nEverton\nYerry Mina will be leaving Everton at the end of the current season — he will be available on the market as free agent.\nLiverpool\nAthletic Club are set to sign Liverpool’s 2006-born forward Elijah Gift on a permanent deal. He’s set to undergo a medical with the La Liga club. Athletic have agreed terms with Liverpool, and the 16-year-old is expected to sign a long term deal.\nLiverpool have asked to be kept informed on Ruben Neves’ situation as Wolves make him available for £50m this summer (Football Insider)\nLuton Town\nWhat a story for Luton Town, who won yesterday’s playoff final to book their place in the Premier League for next season! Luton join Burnley and Sheffield United in going up from the Championship.\nManchester United\nErik ten Hag expects Marcus Rashford to sign a new contract with Manchester United (Manchester Evening News)\nNewcastle United\nEddie Howe drops an exciting hint about the calibre of Newcastle targets ahead of the summer: “We’ve got nothing ready to go this second…to sign off. But yes, there’ll be players we would love to bring in that would be classified as marquee signings.”\nPSG\nLionel Messi scored a record-breaking goal last night to help PSG win the title against Strasbourg. The Argentine now has 496 goals in the top five leagues, the highest ever, and he’s also gone level with Dani Alves as the most decorated player ever, with 43 trophies. Meanwhile, it’s now 11 Ligue 1 title in PSG’s history.\nA historic night for Messi, who is now set to leave PSG in the next few weeks.\nGianluigi Donnarumma on his future: “I feel good in Paris and I’m really proud to represent PSG and this city. I sincerely hope to stay for a long time and write a page in the club’s history.”\nRB Leipzig\nChristopher Nkunku marked his final game as an RB Leipzig player with a goal, taking his total to 15 goals and 5 assists in 25 Bundesliga games this season. The France international is joining Chelsea next season, with the deal expected to be announced soon after completing a medical back in September and signing documents in December.\nReal Madrid\nReal Madrid are prepared to take final steps towards the Jude Bellingham deal next week. Real will discuss the structure of the add-ons with Borussia Dortmund, with the fixed fee set to be around €100m. Bellingham is prepared to sign a contract until 2029.\nCarlo Ancelotti: “Asensio leaving? I don’t know anything… as I don’t know what will happen with Nacho On a personal level, it will be a bit sad to see them go. You will know everything before the last game next week.”\nEden Hazard was still only on the bench for Real Madrid despite injuries to Karim Benzema and Vinicius Junior. Carlo Ancelotti put five midfielders on instead of making room for the Belgian forward.\nWhen will Real Madrid finally make Toni Kroos’ new contract official? “I gotta ask them too, as I want to go on holiday soon!” he said. Kroos has already signed his new deal two months ago. Just waiting on club statement.\nTottenham\nRoberto de Zerbi has been linked again with the Tottenham job. The Italian is one of the top names on Spurs’ list but he’s not planning to leave Brighton this summer; he’s 100% committed to the Brighton project, so it’s not a concrete option for Tottenham, who are also considering Ange Postecoglou.\nAnge Postecoglou on Tottenham job: “Nothing cryptic in my messages, we’ve got one game to go. I’m not saying gonna talks about next year before that game. I’m not gonna pass up the opportunity to do something special, to do a treble.”\nVitoria Guimaraes\nIbrahima Bamba is thought to have played his final game with Vitoria Guimaraes yesterday against Porto. He’s expected to get a big move in the upcoming transfer window, with Premier League sides linked with an interest. Aston Villa have been tracking him for a while now, but don’t have an agreement. There have been no talks with Arsenal, despite rumours, but in general there is plenty of interest in this player.\nWolves\nVeteran Portuguese midfielder Joao Moutinho is expected to leave Wolves this summer, with manager Julen Lopetegui saying: “I think it’s better the club or Joao confirms his future, not me in press conference…”",
  "word_count": 1545,
  "scraped_at": "2026-02-14T01:48:17.244020",
  "_text_extracted": true
}