{
  "article_id": "d4b49c707185",
  "url": "https://metro.co.uk/2023/09/15/jurgen-klopp-responds-to-jordan-henderson-claiming-nobody-wanted-him-at-liverpool-19508562/",
  "title": "Jurgen Klopp responds to Jordan Henderson claiming nobody wanted him at Liverpool | Football",
  "date": "20230915T210000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jurgen Klopp insists there is ‘no bad blood’ between him and Jordan Henderson following the midfielder’s decision to leave Liverpool this summer.\nHenderson ended his 12-year stay on Merseyside to join Al-Ettifaq, becoming one of the high profile names of European football to join the Saudi Pro League.\nThe 33-year-old captained the club to Champions League and Premier League success under Klopp, starting 28 matches last season.\nBut a disappointing fifth place finish prompted a major shake-up in midfield with Dominik Szoboszlai, Alexis Mac Allister, Wataru Endo and Ryan Gravenerch during the summer window.\nIn a recent interview with The Athletic, the England international revealed he ‘did not feel wanted’ at Liverpool, commenting: ‘If one person at Liverpool asked me to stay, I would have’.\nHe added: ‘If I’m not playing, as anybody will know, especially the manager, that can be quite difficult for me and especially when I’ve been at a club for so long, I’ve captained the team for so long.’\nAddressing those comments, Klopp opened up on those talks with Henderson, suggesting he was unable makes guarantees over first-team football opportunities which left his captain frustrated.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Hendo said the truth in all departments,’ Klopp said at a press conference ahead of Saturday’s Premier League clash at Wolves.\n‘I told him I wanted him to stay, but we had to talk in these conversations about the possibility of him not playing regularly.\nMore Trending\n‘Hendo is a fantastic player. I love him and he’s a super guy. But he’s not great when he is not playing. Like Milly [James Milner] and Lucas Leiva when I first came – they are great guys until they see they are not playing and they turn into Jekyll and Hyde.\n‘We had to talk about that and I could not say he would play 50 games. That, in Hendo’s mind, was that we did not want him.\n‘’That was why it was better he moved on, but there is not a bit of bad blood or whatever.’\nMORE: Jurgen Klopp provides Trent Alexander-Arnoldinjury update\nMORE: Four Liverpool players miss training on Thursday in worry for Jurgen Klopp\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 430,
  "scraped_at": "2026-02-14T02:25:00.765182",
  "_text_extracted": true
}