{
  "article_id": "d4fd4e07231a",
  "url": "https://www.caughtoffside.com/2024/08/21/former-chelsea-manager-frank-lampard-lands-new-job/",
  "title": "Former Chelsea manager Frank Lampard lands new job",
  "date": "20240821T173000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frank Lampard, who has been out of management since leaving Chelsea last summer, has landed a new job in football—but not on the touchline.\nThe former England international has been appointed as a pundit for Amazon Prime’s new coverage of the UEFA Champions League, according to The Sun.\nAfter a challenging recent stint as Chelsea’s interim manager in 2023, where he managed only one win in 11 games, Lampard has transitioned into punditry.\nHe was previously part of BBC’s coverage of Euro 2024 and will now bring his insights to Amazon Prime’s Champions League panel.\nLampard will be joined by a star-studded line-up of former players, including Clarence Seedorf, Daniel Sturridge, and Gael Clichy, offering viewers expert analysis of Europe’s premier club competition.\nLampard is enjoying time away but eager for a return\nIn a recent interview with talkSPORT, Lampard reflected on his time away from the dugout, expressing his enjoyment of spending more time with his family.\nDespite this, he made it clear that he is eager to return to management when the right opportunity arises.\nHe said:\n“I’m enjoying being with the family and looking to get back at some point. Hopefully something comes up that feels right for me. I’m keen to get working again, but as I reiterate, I’m enjoying family life.”\n“It’s an intense job so when you’re out of it, it’s nice to appreciate being around all my children.\n“You love the job. you understand the rigours of it in the modern day. I’ve enjoyed all the clubs I’ve worked with.\n“They’ve all been big challenges for different reasons. I enjoy working with players, improve players and the team, so let’s see what comes.”\nFrank Lampard continues to wait for the right job\nWhile he continues to offer his expert insights as a pundit, Lampard remains open to returning to football management.\nThe former Chelsea and Derby County manager is awaiting the right opportunity to return to management, having indicated that he is not rushing back into the managerial spotlight.\nFor now, fans can look forward to hearing Lampard’s expert analysis and commentary during this season’s Champions League on Amazon.",
  "word_count": 356,
  "scraped_at": "2026-02-14T02:05:16.987683",
  "_text_extracted": true
}