{
  "article_id": "d50b90ed5c5e",
  "url": "https://www.economist.com/culture/2023/08/18/the-womens-world-cup-has-broken-new-ground",
  "title": "The women World Cup has broken new ground",
  "date": "20230818T124500Z",
  "domain": "economist.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The women’s World Cup has broken new ground\nBut data suggest the old guard, including America, hasn’t weakened\nON AUGUST 20TH England’s footballers face Spain’s in the women’s World Cup final. It is a fitting culmination to the biggest and best edition of the tournament yet. For the first time the event featured 32 teams, and fears of a diluted competition were quickly put to bed. Many matches were surprisingly tight during the group stages, and previously unheralded teams, such as Australia and Colombia, enjoyed runs deep into the knockout stage.\nEngland and Spain are first-time finalists, and they illustrate how far women’s football has risen in recent years. In both countries attendances at women’s games have rocketed. Last year a women’s Champions League game between Barcelona and Wolfsburg, a German side, attracted nearly 92,000 spectators—quite possibly the biggest crowd for any female sporting event ever. Both English and Spanish leagues, like their male equivalents, now attract star players from around the world.\nIt is not just the rise of new footballing powers that has made this World Cup so enthralling. Adding to the drama is the fact that none of the four previous champions—America, Germany, Japan and Norway—made it past the quarter-finals. It is tempting, therefore, to pronounce the demise of the old guard and herald a new era of women’s football. That would be a mistake. The game is getting bigger, but the likes of America and Germany aren’t getting weaker.\nFootball is one of the few sports in which a team can dominate their opponents on most metrics but still lose. More shots, more passes and more tackles do not always result in more goals. To account for that, football boffins have devised a measure called expected goals, or xG. Since its emergence around a decade ago, the statistic has become an essential data point for clubs, pundits and fans to understand the game.\nIn essence, xG captures the quality of chances teams create. Imagine a side putting together a quick and skilful passing move, which ends with the forward inexplicably skewing the ball wide in front of goal. Then the opposition striker takes a pot shot from 30 yards out and the ball flies into the top corner, just as Sam Kerr did for Australia against England in their semi-final. Which was the better chance? The end result suggests the latter. But rerun many times, the first chance would be much more likely to be converted than the second. Accordingly, the expected-goals model would assign a higher xG value to a tap-in than the hopeful long-range effort.\nAdd up the xG of various chances in a game and a better picture of the match emerges. Tot them up over a tournament and the result can be even more revealing. It turns out that America were a strong side at this World Cup, despite their early exit. Their downfall was their inability to put away their chances—admittedly a rather crucial deficiency. After their opening win, the team scored just once in three games. Yet their xG across those four matches was 7.8; comfortably higher than any of their opponents’. They did not become a bad team at this World Cup. Perhaps they were just unlucky. Maybe Germany were too. They failed to make it out of their group after conceding a 97th-minute winner to Colombia, but recorded the fifth-highest expected-goal difference per match (ie, their xG, minus their opponents’) in the tournament.\nIndeed looking at xG the surprise package is probably England. The Lionesses’ xG has on average been just 0.8 more than their opponents’ in each match, which is only the ninth-best among the 32 teams. Remarkably, xG favoured England’s opponents in both the round of 16 (when they beat Nigeria on penalties after a 0-0 draw) and the semi-final (when they beat Australia 3-1). They rode their luck against their African opponents, but were simply more clinical against the Matildas.\nFor England’s opponents in the final there is no such outperformance. xG just confirms what the eye can see. The Spanish women have dominated most of their opponents with some mesmerising passing and clinical finishing. That superiority is reflected in the chances they have created: an xG of 18.3 across their six matches, against their opponents’ 3.5. This suggests they have been, on average, around 2.5 goals per game better than their opponents. Not surprisingly, Spain are the favourites to win on Sunday.\nOf course, there is no prize for creating the most chances. The beauty of tournament football is that success can come down to a few key moments. Should England seize those, as they have throughout the tournament, they would be deserving winners. Being able to perform at the highest level under the greatest pressure is after all how champions are made. ■\nWhat to watch this week\nThree things we loved—and one we did not\nReal-life “Succession”: Media’s most dysfunctional family\nAn absorbing history of Rupert Murdoch, the last of his breed of media baron\nNeed a bit of dating help? The caveman’s guide to romance\nTwo new books offer insights on intimacy and relationships\nAfrica needs to follow Asia’s path to grow\nSo argues an important new book, “How Africa Works”\nSex, sex and more sex: Emerald Fennell’s “Wuthering Heights”\nAn outlandish take on Emily Brontë’s novel highlights the adaptation conundrum\nThe rise of the 9-to-5 influencer\nWho knew corporate offices could be so appealing?",
  "word_count": 904,
  "scraped_at": "2026-02-14T02:07:08.847171",
  "_text_extracted": true
}