{
  "article_id": "d5104c190f64",
  "url": "https://www.90min.com/posts/sir-jim-ratcliffe-targets-man-city-style-pay-structure-man-utd",
  "title": "Sir Jim Ratcliffe targets  Man City style pay structure  at Man Utd",
  "date": "20240225T130000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sir Jim Ratcliffe targets 'Man City style pay structure' at Man Utd\n- Sir Jim Ratcliffe aiming to end high basic pay at Man Utd\n- Man City have found success with bonus-led contracts\n- New CEO Omar Berrada was instrumental in City's dealings\nBy 90min Staff\nSir Jim Ratcliffe is believed to want Manchester United to implement a similar pay structure to that which has helped make local rivals Manchester City so successful.\nRatcliffe's impact is quickly being felt at Old Trafford, with the petrochemicals billionaire now properly in charge of football operations after his buy-in was made official last week.\nUnited have been heavily criticised for a bloated wage bill that hasn't delivered what it should. The Daily Mirror reports Ratcliffe is targeting a bonus-led pay structure, with players only earning the really big money if they are successful on the pitch.\nSuch a plan would promise to keep basic salary lower and allow players to top up their earnings for doing their job well, rather than rewarding mediocrity with enormous pay packets.\nIncoming chief executive Omar Berrada, whose appointment was influenced by Ratcliffe's INEOS contingent before ratification of the partial takeover was given, has been tasked with setting the bonuses plan in motion after being instrumental in its effectiveness at City.\nHaving joined City from Barcelona in 2011 and initially focusing on sponsorships, Berrada was later promoted to chief operating officer in 2016 and effectively ran the club's day-to-day business. He moved closer to football in 2020 as chief football operations officer, also filling that role for the wider City Football Group. Berrada has an inside track on how to build an elite football club and Ratcliffe wanted to bring that expertise across to the red half of Manchester instead.\nCity's 2022/23 accounts showed wages in excess of £400m, dwarfing United’s £330m. But it was a season that had followed consistent Premier League titles and then triggered even more bonuses by winning the Champions League as part of the treble. United, meanwhile, have won only four trophies in the last ten seasons – no Premier League titles, no Champions Leagues.\n90min Man Utd WhatsApp channel\nLooking to keep up to date with everything happening at Old Trafford? Click this link or scan the QR code below to follow 90min's Man Utd WhatsApp channel and turn on notifications to receive all the latest news!\nCity recorded revenue of £712m last season, an all-time English high, with United raking in £648m. Yet spending rules are also starting to hurt the latter and Ten Hag explained ahead of Saturday's defeat to Fulham he wanted to sign another striker in January, knowing the squad was light up front due to Anthony Martial's latest injury. But \"money, FFP\", as he put it, stopped them.\nUltimately, Ratcliffe wants to \"smash\" City on the pitch. But he's a more than savvy individual and can appreciate the models used to build their success are worth admiring and replicating.\n\"We have a lot to learn from our noisy neighbour and the other neighbour [Liverpool],\" he said in his round of headline interviews last week. \"They are the enemy at the end of the day. There is nothing I would like better than to knock both of them off their perch.\n\"Equally, we are the three great northern clubs who are very close to one another. They have been in a good place for a while and there are things we can learn from both of them. They have sensible organisations, great people within the organisations, and a good, driven and elite environment that they work in. I am very respectful of them but they are still the enemy.\"",
  "word_count": 612,
  "scraped_at": "2026-02-14T01:56:44.618894",
  "_text_extracted": true
}