{
  "article_id": "d520216e7c7b",
  "url": "https://www.the42.ie/man-city-chelsea-talking-point-6359688-Apr2024/",
  "title": "Will Man City rue letting go a strong contender for Player of the Season ? ",
  "date": "20240420T110000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "WHEN PEP Guardiola arrived in English football in 2016, the common refrain was that he would have to change or adapt his style to suit the Premier League.\nThis wasn’t La Liga or the Bundesliga — the sceptics argued — where one or two teams invariably dominate.\nThere were even some suggestions that possession football didn’t work in the Premier League.\nLouis van Gaal had recently been sacked by Man United — the Dutchman was regularly criticised for implementing such a “boring” style.\nBut if anything, English football has adapted for Guardiola rather than the other way around.\nOf course, in-vogue football tactics and great teams tend to be cyclical. There has been recent evidence to suggest we could be entering a new more defensive phase at the highest level of the game — last month’s dour 0-0 draw between City and Arsenal for instance, or the cagey-but-successful midweek European performances by both Real Madrid and Aston Villa.\nBut for now, Guardiola’s influence on the Premier League remains palpable.\nA decade ago, teams insisting on playing out from the back was a rarity.\nSince the success of Guardiola’s great Barcelona team, this stylistic choice has permeated every level of the game.\nEnglish football, in particular, has come a long way since the ‘shit-on-a-stick’ era, where defensive coaches like Jose Mourinho and Rafa Benitez were prominent.\nThe top flight is as attack-minded as it has been for a long time. Last season saw the most goals ever scored in a 38-match Premier League campaign: 1,084.\nThe previous record of 1,072 was set as recently as 2018/19, and the record will almost certainly be broken again this season. At the time of writing, 1,046 goals have been scored, with every team still having at least five games to play.\nOf course, the unprecedented levels of stoppage time introduced since the 2022 World Cup make this outcome more likely but it is not the only reason for this dramatic evolution in the philosophy of the English game.\nMany of the dominant midfielders of the Premier League in the 2000s were the likes of Frank Lampard and Steven Gerrard — incredible athletes with an eye for a goal.\nYet the emergence of footballers like Xavi and Andrés Iniesta — midfielders who were less physically imposing than Gerrard and Lampard but tactically and technically exceptional — had a huge impact on the sport.\nThe 3-1 Champions League final victory over Manchester United in 2011 was perhaps when Guardiola’s Barcelona peaked.\n13 years on, if you consider many of the top attacking midfielders in the Premier League, English football appears to have moved away from the Gerrard/Lampard template to an extent.\nThe likes of Phil Foden, James Maddison and of course, Cole Palmer, are very much in the Xavi/Iniesta mould, albeit usually less deep-lying.\nPerhaps the closest equivalent to a Gerrard/Lampard type, Jude Bellingham, is playing for Real Madrid in Spain.\nIn the Premier League, the more physical, elite midfielders like Rodri and Declan Rice tend to be used in defensive roles.\nAnd of all the great diminutive midfield talents, Palmer arguably has the highest ceiling.\nHe feels almost like a stereotype of a Guardiola footballer.\nAnd yet when Chelsea paid a reported initial fee of £40 million (€46 million) for Palmer’s services last September, there was some suggestion that City were the primary beneficiary from the deal, and it was another example of the big-spending London club having more money than sense.\nPalmer has made less than 20 Premier League appearances at the time. Moreover, he signed an excessive and highly lucrative seven-year contract on Deadline Day.\nSpurs paying the same fee for James Maddison — a proven Premier League player — was seen by some critics as much smarter business.\nYet seven months on, ‘Cold’ Palmer, as he is nicknamed, has silenced the critics.\nFrom 28 games, he has 20 goals — no Premier League player has more. And nine assists — only three Premier League players (Ollie Watkins, Kieran Trippier and Pascal Gross) have more.\nMaddison, the supposedly wiser and more experienced acquisition, has done okay, but his stats (seven assists and four goals) are paltry by comparison.\nOverall, in 14 full seasons as a manager, Guardiola has only failed to guide his team to the league title on three occasions, so the coach has made far more right decisions than wrong ones.\nHowever, the 21-year-old England international might be one of the Catalan manager’s rare regrets.\n“In pre-season, I said stay because Riyad [Mahrez] has gone and he said ‘no, I want to leave’,” Guardiola explained in the pre-match press conference for today’s FA Cup semi-final.\n“After two seasons, what could I say?”\nPalmer signed a five-year contract with City as recently as 2021 but had started just three Premier League games by the time he left.\n“I said many times, I didn’t give him the minutes that he maybe deserved and wanted, the minutes he now has at Chelsea,” the City boss added.\n“I understand that completely. I am happy for him because he is a lovely guy. He is playing good and is an incredible threat.”\nSo Guardiola’s success in 2011 helped pave the way for players of Palmer’s ilk.\nBut today, the one-time protege gets the chance to eclipse his former master.\nUpcoming FA Cup semi-final fixtures:\nMan City v Chelsea (17.15 – Saturday)\nCoventry City v Man United (15.30 – Sunday)\nUpcoming Premier League fixtures:\nSaturday\nLuton Town v Brentford (15.00)\nSheffield United v Burnley (15.00)\nWolves v Arsenal (19.30)\nSunday\nEverton v Nottingham Forest (13.30)\nAston Villa v Bournemouth (15.00)\nCrystal Palace v West Ham (15.00)\nFulham v Liverpool (16.30)",
  "word_count": 943,
  "scraped_at": "2026-02-14T01:51:24.795965",
  "_text_extracted": true
}