{
  "article_id": "d54f16de8b6f",
  "url": "https://www.dw.com/en/kompany-and-sahin-big-new-jobs-at-bayern-and-dortmund/a-69939797",
  "title": "Kompany and Sahin : Big new jobs at Bayern and Dortmund – DW – 08 / 22 / 2024",
  "date": "20240822T151500Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kompany and Sahin: Big new jobs at Bayern and Dortmund\nAugust 22, 2024Vincent Kompany and Nuri Sahin are both under 40 and have taken a big leap to two of German football's most high-pressure jobs. Their coaching styles seem different, but the newbie pair must learn to handle expectations.\nThe bar is always set high for the coaches of Bayern Munich and Borussia Dortmund. When the clubs only managed to come third and fifth respectively in a perceived two-horse race, change was inevitable.\nWith neither side having won a trophy last term, for the first time since 2008-09 season, both have new coaches for 2024-25. Though they won plenty as players, Vincent Kompany (Bayern) and Nuri Sahin (Dortmund) have just an English Championship (second tier) title between them from their short coaching careers so far. So what is it about these two men that has landed them two of German football's biggest jobs?\nKompany: Last man standing\nWith Kompany, it was a process of elimination. After Bayern announced Thomas Tuchel's departure long before the end of last season, they publicly blundered their way through a series of coaching approaches: An offer for Julian Nagelsmann to return, Roberto De Zerbi, Bundesliga title-winner Xabi Alonso , Ralf Rangnick, and even a brief flirtation with keeping Tuchel after all.\nOnce those options were exhausted, the dethroned champions turned to the Belgian, who had just been relegated from the Premier League with Burnley, whom he took over the season before.\n\"For me it is not so important that everyone is convinced of me beforehand — but afterwards by my work on the pitch,\" the former Manchester City defender said.\nIt was Burnley's swashbuckling promotion season that presumably won Kompany admirers in Munich. The 38-year-old had learned from the very best with City coach Pep Guardiola, a former title-winning Bayern boss.\n\"We think the same way about the style of play,\" said sporting director Max Eberl. \"We're ready for a new energy and new style ... we want to be dominant, we want to have the ball. He also stands for that.\"\nPlaying style the attraction\nKompany's adherence to an adventurous playing philosophy cost Burnley last term, according to many observers. But the English club's fans largely stuck with him despite just five league wins from 38 games. His intensity and desire to win, carried through from his playing days, were seen as significant virtues.\n\"Why should you change your mindset because you're working at a different club?,\" he told reporters at a recent press conference. \"You should always want to win every game. I've always been like that, as early as youth level. I was born with that mindset. The club can't have higher expectations than I have of myself. I think we fit together very well.\"\nA two-year spell in the Bundesliga with Hamburg as a player aside, Kompany's only previous connection with Bayern was having played against them for City. He went straight from ending his playing days with Anderlecht to being the Belgian side's coach before moving to Burnley. So this is a significant step up. For Bayern, second is nowhere. Another season without a trophy is unthinkable.\nYoung player turned young coach\nFor Dortmund, second place has been all too familiar of late. They were runners-up in last season's Champions League and four of the previous five Bundesliga seasons. The appointment of Sahin brings with it a reminder of more successful times. He made his debut for the club as a 16-year-old, becoming the youngest player and scorer in Bundesliga history. Both records have since been broken by current Dortmund youngster Youssoufa Moukoko.\nThe now 35-year-old Sahin was a key figure as Dortmund won the title in 2011 before leaving for Real Madrid as they retained it the following season. Both those titles were won under Jürgen Klopp, a key influence on Sahin and a figure who still looms large at the Westfalenstadion, and in Sahin's coaching style.\n\"Besides my family, he was one of the few guys I called to ask what he thought about the idea that I go from being a player to a head coach,\" Sahin told Coaches' Voice earlier this year.\n\"Jürgen had so much influence, because he always saw the human being first and then the football player. You felt it, from player No. 1 to squad player No. 25. Young player or old player, it didn't matter to him.\"\nDoes familiarity breed success?\nSahin joined Edin Terzic's coaching staff midway through last season, along with another former Dortmund player, Sven Bender. The pair were credited with tweaks to tactics and training that saw the team improve enough to reach the Champions League final and qualify for this season's competition. It wasn't enough to keep Terzic in the job, but Dortmund's top brass had clearly seen something in Sahin and identified him as a replacement.\n\"He has the experience here as a player and assistant coach to know how the club works — and above all he knows how to be successful,\" said another former Dortmund player Sebastian Kehl, now sporting director.\n\"With his natural authority and expertise, he has a good relationship with our team, and he knows what we need to work on collectively. Nuri has our full confidence and our full support.\"\nThat trust in a connection to the club hasn't always worked for Dortmund in recent years. Terzic was once a fan from the terraces who wasn't quite good enough while bringing back the likes of Mats Hummels and Jadon Sancho hasn't been an unqualified success either.\nSahin himself had two spells in Dortmund as a player. And while his character seems a good fit for the club, there's little doubt that Sahin the coach is a gamble. Aside from taking the reins of his boyhood club, RSV Meinerzhagen, while injured in that second spell, his only experience is with Turkish side Antalyspor, with whom he enjoyed moderate success.\nBut as with Kompany at Bayern, that won't be enough to keep him in the job for long without bigger results.\nEdited by Mark Meadows.",
  "word_count": 1014,
  "scraped_at": "2026-02-14T02:25:54.608921",
  "_text_extracted": true
}