{
  "article_id": "d5ad3a0211df",
  "url": "https://mwnation.com/7th-airtel-call/",
  "title": "7th airtel call - Nation Online",
  "date": "20240914T064500Z",
  "domain": "mwnation.com",
  "source_country": "Malawi",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "7th airtel call\nThe seventh edition of the Airtel Top 8 gets underway this afternoon when battered and bruised FCB Nyasa Bullets roll out their defence campaign against Civil Service (Civo) United at Kamuzu Stadium in Blantyre.\nFresh from their CAF Champions League first hurdle exit, FDH Bank Cup final penalty shootout defeat at the hands of second-tier league outfit Blue Eagles and with their TNM Super league title defence in a shambles, the People’s Team will be counting on the Airtel Top 8 to salvage something from their bouts of despair.\nIn recent times, encounters between the two teams have been neck-to-neck and when they met in the quarter-finals of the FDH Bank Cup last month, Bullets won 1-0 through Precious Phiri’s last-gasp winner.\nIn the TNM Super League, they played out a one-all draw in the first round in July this year at the same venue.\nIronically, the two teams met at the same stage of the competition last season and although Bullets sailed through 3-2 on aggregate, it was not a stroll in the park as they had to survive a scare in the second leg, which they lost 2-1 at their Kamuzu Stadium fortress after winning the first leg 2-0 at Civo Stadium in Lilongwe.\nBullets assistant coach Michael Ngore said in a pre-match interview that they have recovered from their FDH Bank Cup final setback.\nHe said: “Losing is part of the game, we accepted and moved on. We believe our preparations have gone on very well and we are ready.\n“They say a man is judged not by the way he stays down after falling, but how he picks himself up after falling down. So, we are ready to lift ourselves up and go again.”\nThe Zimbabwean tactician also said while Civo have been giving them tough times in the recent past, this will be a different game.\n“Every game is new. We may have struggled last time, but it is no guarantee that it will be the same this time around. The sun rises and we go again. We are concentrating on our game and working on the mistakes and errors we have been making,” he said.\nNgore also brushed off suggestions that they have an advantage playing the first leg at home.\nHe said: “In football, there is no such advantage as long as you are playing a second leg. There is nothing like an advantage where there are two legs, that’s football.\nBullets have received a major boost ahead of the match following the return of their midfield maestro Ernest Petro from injury.\nThey will also be welcoming back goalkeeper Innocent Nyasulu, defender Gomezgani Chirwa and midfielder Lloyd Aaron from national duty with the Flames as they were part of the squad that faced Burundi and Burkina Faso in 2025 Africa Cup of Nations’ qualifiers.\nOn his part, Civo head coach Abbas Makawa said playing away, they anticipate a tough match, but they will put up a gallant fight.\nHe also said preparations have gone on well.\n“Everything looks good for us. We will definitely carry the day if we transfer that to the game situation. We know Bullets are a hard nut to crack, especially at their backyard and that’s what we are preparing ourselves for,” he said.\nStriker Chikaiko Batson carries Civo’s hopes that have been thrust on his shoulders. Other potential match winners are Patrick Phiri, Muhammad Biason and Blessings Juma.\nTomorrow, Mighty Mukuru Wanderers, who won the cup in 2022, host Bangwe All Stars at the same venue while Chitipa United face Kamuzu Barracks at Karonga Stadium.",
  "word_count": 600,
  "scraped_at": "2026-02-14T02:01:51.737395",
  "_text_extracted": true
}