{
  "article_id": "d5ada424ff16",
  "url": "https://www.gdnonline.com:443/Details/1363401/Muharraq-cruise-past-Al-Wehdat-in-opener",
  "title": "Football : Muharraq cruise past Al Wehdat in opener",
  "date": "20250917T230000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – Muharraq kicked off their campaign in the 2025-26 AFC Champions League (ACL) Two last night with a resounding victory while fellow-Bahraini club Al Khaldiya were held to a goalless draw.\nTwo goals on either side of the break lifted Muharraq to a convincing 4-0 win against Al Wehdat of Jordan at the Late Shaikh Ali Bin Mohammed Bin Isa Al Khalifa Stadium in Arad.\nKhaldiya, on the other hand, came away with a share of the points against Al Ahli SC of Qatar at Al Thumama Stadium in Doha.\nBoth games were part of the first match week of the new ACL Two season.\nThe Asian Football Confederation (AFC) competition is the second-tier club championship in the continent – one level below the AFC Champions League Elite and one above the AFC Challenge League.\nMuharraq and Khaldiya are amongst a 32-strong cast representing 22 AFC member associations who are playing in a home-and-away round-robin format.\nMuharraq are participating in the ACL Two in its new form for the first time, although they have won the competition twice in the past in 2008 and 2021 when it was still known as the AFC Cup. Khaldiya are returning for a second straight season.\nIn Muharraq’s home victory last night, Portuguese professional Elliot Jorge Simoes Inacio put the Bahrainis ahead in the 18th minute with a right-footed shot from the centre of the box, off an assist by Soufiane Saeed Mahrouk, who did well to create the chance from the right.\nMuharraq added their second just seven minutes later, when Brazilian Arther Rodrigues Rezende scored with an effort from outside the area that beat Wehdat goalkeeper Abdallah Al Fakhouri.\nMohammed Al Hardan delivered the pass that led to Rezende’s impressive strike, which sent his team into the locker rooms with the half-time lead.\nBoth teams had chances to add to the score after the re-start, but Muharraq were only able to get their third with four minutes remaining in regulation.\nLucas Morelatto, also from Brazil, was this time on target, firing into the top-right corner with a shot from the centre of the area.\nHis attempt came off a corner kick that was followed by a short pass from Argentinian teammate Facundo Tobares.\nWehdat then added to their woes when Ahmad Tha’er sent in an own goal in the sixth minute of second-half injury time.\nThat sealed the full three points for Muharraq, who went to second place on the Group A table, behind only Al Wasl of the UAE, who routed Esteghlal FC of Iran 7-1 in yesterday’s other divisional clash played at Zabeel Stadium in Dubai.\nMeanwhile, Khaldiya and Ahli played to an entertaining stalemate in their Group B encounter at the Qatari capital.\nWhile neither side could break the deadlock, Khaldiya had their opportunities to score, and almost came away with a late triumph.\nBut the effort from Saudi Arabian import Badar Bashir was tipped away by Ahli goalkeeper Marwan Badreldin, ensuring the nil-nil result.\nElsewhere in their division, FC Arkadag of Turkmenistan and PFC Andijon of Uzbekistan were also goalless at Arkadag Stadium, leaving all four teams with a point apiece.\nBoth of Bahrain’s sides are scheduled to return to ACL Two action on October 1, when Muharraq take on Esteghlal at Shahr-e-Qods Stadium in Iran and Khaldiya host Arkadag at the National Stadium in Riffa.\nThe ACL Two group stage is scheduled to continue until December 24 before moving into the round of 16 between February 10 and 19 in 2026.\nThe quarter-finals and semis will then be held in March and April, respectively, with the final pencilled in for May 16.\npatrick@gdnmedia.bh",
  "word_count": 607,
  "scraped_at": "2026-02-14T02:12:04.365559",
  "_text_extracted": true
}