{
  "article_id": "d5d2753bed39",
  "url": "https://www.fourfourtwo.com/news/championship-player-of-the-year-available-on-loan-deal-with-buy-obligation-amid-leeds-united-and-psv-links",
  "title": "Championship Player of the Year available on loan deal with buy obligation amid Leeds United and PSV links",
  "date": "20250829T134500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Championship Player of the Year available on loan deal with buy obligation amid Leeds United and PSV links\nSheffield United attacking midfielder Gustavo Hamer could be available for £15-20 million before Monday's transfer deadline\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSheffield United's Gus Hamer could seal a loan move with an obligation to buy worth £15-20m before the end of the summer transfer window, FourFourTwo understands.\nThe reigning Championship Player of the Year has remained at Bramall Lane throughout the summer, despite prior interest from the likes of Leeds United and PSV Eindhoven.\nSheffield United missed out on promotion to the Premier League last season, defeated by Sunderland at Wembley Stadium in the Championship play-off final.\nGus Hamer could move on loan with obligation before transfer deadline\nThe 28-year-old has started each of the Blades' three league fixtures so far this term, however, has been unable to help the club put points on the board. Sheffield United sit bottom of the Championship table having lost to Bristol City, Millwall and Swansea City by an aggregate 6-1 scoreline.\nHamer made headlines a fortnight ago after scoring a sensational goal from the halfway line against Birmingham City in the Carabao Cup.\nIt is understood a number of Premier League clubs have turned down the opportunity to sign Hamer this summer, but a move is still possible.\nClubs in England, as well as those abroad, have been alerted to the prospect of a deal which could be structured in a way which sees the Blades talisman leave on loan with an obligation to buy at the end of the 2025-26 season.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nA return to the Netherlands remains on the table for the Brazil-born Dutchman with Eredivisie champions PSV known to hold an interest.\nPSV have secured Champions League qualification for the third season in-a-row and are expected to earn (€92.5m) £80m in guaranteed broadcast revenue from their participation in the League Phase.\nThe Blades' playmaker came through the Feyenoord youth setup in the Netherlands, going on loan to FC Dordrecht before joining PEC Zwolle permanently.\nHis performances for the Dutch club yielded a move to Championship side Coventry City, whom he represented for three seasons before signing with newly-promoted Sheffield United ahead of the 2023-24 Premier League campaign.\nHamer played 36 times in the top flight as Sheffield United were relegated that year, finishing the season with four goals and seven assists.\nThe player not agitating for a move but is open to a Premier League switch if one becomes available, although he is unlikely to be a target for any sides in the top half of the division.\nMeanwhile, the pull of Champions League football and challenging for domestic titles with PSV could influence any decision on his immediate future, if a suitable offer is put to the Bramall Lane hierarchy.\nThat said, PSV have signed Paul Wanner from Bayern Munich, which may conclude their search for a player in that area of the pitch.\nJoe joined FourFourTwo as senior digital writer in July 2025 after five years covering Leeds United in the Championship and Premier League. Joe's 'Mastermind' specialist subject is 2000s-era Newcastle United having had a season ticket at St. James' Park for 10 years before relocating to Leeds and later London. Joe takes a keen interest in youth football, covering PL2, U21 Euros, as well as U20 and U17 World Cups in the past, in addition to hosting the industry-leading football recruitment-focused SCOUTED podcast. He is also one of the lucky few to have 'hit top bins' as a contestant on Soccer AM. It wasn't a shin-roller.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 741,
  "scraped_at": "2026-02-14T01:52:36.766018",
  "_text_extracted": true
}