{
  "article_id": "d5f7b783fdb8",
  "url": "https://www.twtd.co.uk/ipswich-town-news/45434/sheehan-our-focus-is-just-trying-to-start-as-well-as-we-can/onthisday",
  "title": "Sheehan : Our Focus is Just Trying to Start as Well as We Can - Ipswich Town News",
  "date": "20240819T044500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 19th Aug 2023 13:26\nIpswich Town Women’s manager Joe Sheehan spoke to TWTD ahead of the start of his side’s FAWNL Southern Premier Division season against Cardiff City at Ocean Park Arena on Sunday afternoon.\nIt’s been a summer of upheaval for the Tractor Girls with a number of familiar names moving on.\nAnna Grey and Sarah Brasero-Carreira both joined Lewes, Maddie Biggs and Olivia Smith signed for Billericay, Abbie Lafayette for Watford and Sarah Quantrill opted to take some time out of football before recently joining hometown side Norwich City.\n“Lots of players were out of contract but we’re pleased that we managed to retain pretty much everyone we wanted to really, bar the odd one,” Sheehan said.\n“A big turnover, but we’re happy with the squad that we have managed to keep on and we’ve made some good additions as well.\n“I think we talk a lot to our young players about timing and there were some that we knew would want to move on and it was probably the right time for them off the back of playing lots of senior games over three or four seasons.\n“We knew that naturally they would want to make that step up but equally for others, it wasn’t quite the right timing.\n“I think Sophie Peskett’s a great example that probably could have moved on but has had a bit of an injury experience over the last year or so and the timing wasn’t right for her.\n“We knew that some were going to look to explore new avenues and we were never going to stand in their way if the right opportunity presented itself and some have taken that option to part ways.”\nTown made their fourth addition of the summer on Friday evening, keeper Laura Hartley having come in after leaving Lewes.\nEarlier, another keeper, Poppy Soper, who has come in on loan from Charlton, full-back Maisy Barker from West Ham and Ruby Doe, who has come in on a dual registration from Arsenal, joined the squad.\n“Poppy we’ve known about for a long while,” Sheehan said. “We’ve come across her a couple of times and we actually felt that we have Nina [Meollo] coming through who is going to have a really bright future with us, so we were quite looking forward to seeing Sarah [Quantrill] and Nina [who is now expected to go out on loan to gain first-team experience] competing for the number one top over the course of pre-season.\n“But when it became apparent that Sarah was going to look to take an initial break from the game, we knew we had to recruit, so that’s obviously when we worked with Charlton and we managed to bring in Poppy, who we think has also got a really bright future. She’s a really good size and she’ll be a really important player for us.\n“Maisy Barker from West Ham is someone who we’ve been aware of for quite some time, she came through Chelsea’s system.\n“She joined West Ham for two years in the Super League and only made a few appearances but I think she played against Man City twice and against Man United at Old Trafford, so her exposure in the top division was right at the deep end.\n“We felt she was someone that fits out bill and needed some support, needed some opportunity and this is the right move for her as well as us at this time.\n“And then Ruby Doe, a young player from Arsenal that we’re hoping can following in the footsteps of Freya [Godfrey] from last year.\n“We’ve had quite a good relationship with Arsenal over the past few years where we were right for some players to come in and we welcome Ruby, and we think she’s hopefully going to contribute to our season, just like Freya did.”\nSheehan says there will be further additions on loan but with the top clubs currently unwilling to allow players to move on with their senior players at the World Cup.\n“One thing we know is that the market at the moment is changing every year,” Sheehan continued.\n“And we’re always conscious that we want to bring in players that improve our squad and sometimes the players that we would like to bring in to improve our squad are players that can play in a division above and therefore can get paid a full-time salary that’s significantly more than we can budget for.\n“It means that the market we’re currently looking at are still young players, either on dual registrations or loans.\n“We’ve got a few irons in the fire for some loans but we can’t proceed with them at yet while the World Cup is still ongoing.”\nTown finished third in the FAWNL Southern Premier Division in their first season after promotion, 2021/22, then missed out on top spot to Watford on goal difference last term.\nThe Blues’ pathway into the Barclays Women’s Championship is more direct this season with the winners of the Southern Premier Division and the Northern Premier Division both promoted rather than going into a play-off for one place as in previous years.\nPromotion is presumably once again Town’s target? “We don’t really talk about it within our group too much because it’s just one of those obvious things that we’re all striving for having been a team that’s always in and around it,” insisted Sheehan, who took over as boss in February 2019.\n“I think all our focus is just trying to start as well as we can. We started really well a couple of years ago. We didn’t start overly great last year, so we know that you don’t have to start great and you can still have a chance and we know that you can start great and still fall short.\n“I think the experiences that we’ve had from the last couple of years should help us manage different scenarios that we might face but ultimately the short term is just trying to start the season as best we can and try and pick up some points early.\n“We know once we go on a run, we can put one helluva run together, so we’ll be hoping that we can find some form and be consistent and put a really strong run together.”\nTown go into the season without three further players due to injury, including captain Blue Wilson, who, having been out with an ACL for almost two years, requires minor surgery to repair an ongoing meniscus issue on her other knee.\n“Blue has carried over something from last year,” Sheehan said. “Eloise [King] and Lucy [O’Brien] haven’t been part of any of our pre-season, so they weren’t injuries that we picked up during our pre-season. They pretty much reported on day one with issues.\n“I think Eloise had carried over some sort of lower leg issues, predominantly hamstring tightness, for quite some time that she’s played through and we’re taking some time really just to get that addressed properly and the club has been really good with that, she’s some specialists and hopefully we can get to grips with what her situation is.\n“And Lucy had some hamstring issues over the close season as well, so she’s pretty close now but we’ve had quite a light squad to work with.\n“We’ve played quite a few games [in pre-season] and had some players in that we’ve looked at and had a good variety of games and everybody has got through really well, which is probably the main thing really, that you don’t pick up anything significant throughout pre-season, you’re training and playing all your fixtures and everybody’s well conditioned now and raring to go.”\nSheehan says Cardiff, newly-promoted having topped FAWNL Division One South West last season, come into the campaign with momentum.\n“They went down in our first year in tier three and have made an immediate return. They won 19 of their league games last season, so they’ve got back in the division at the first time of asking with really, really good form, so I think they will be better.\n“It’s really difficult to know exactly their level. They won’t be taken lightly. Their goalkeeper [Laura O’Sullivan] is the Wales number one, who has had some incredible experiences, I think she played against the USA in Los Angeles only a couple of months ago.\n“They’ve got a really good goalkeeper, who is an international at senior level and they carry forward a really good run of form over the last season, so I’m sure they’ll be raring to go and they’ll be looking forward to the opening game as much as us.”\nWith the Portman Road pitch having been given a £2.5 million upgrade this season, the Tractor Girls will play their first games at the stadium during the campaign ahead, while the AGL Arena in Felixstowe will continue to be their main home ground.\n“We know that there is going to be opportunity throughout the season but we’re yet to sit down and highlight which fixtures might be available for us to play,” Sheehan said.\n“We haven’t had those conversations yet but what we know is that the club are keen to explore it, it’s just picking the right time and the right fixtures.\n“I think that’s really important, we don’t want to put on just any game there for the sake of it. To play what I guess will be a showpiece game for us, the first one I think is going to be really, really important and you ideally want to play a team that are in good form so it’s going to be a really good competitive game and one that the fans will be really excited to watch.\n“Hopefully, when we have that game we can play really well and it can be a catalyst for growth in attendances moving forwards.”\nSunday’s kick-off has been put back to 3pm because of England Women’s World Cup final against Spain in Sydney, which starts at 11am.\nSheehan and his players will be watching the final and backing the Lionesses at their Cardiff hotel, but warns that the Spanish will be very tough opponents.\n“When I’ve seen Spain, I’ve been so impressed,” he reflected. “When we won the Euros, I actually thought we were quite fortunate to knock Spain out [2-1 after extra-time in the quarter-finals].\n“They’ve got [Aitana] Bonmatí in midfield, the six, who is such a good player, so it’s not going to be easy.\n“I’ve really enjoyed watching Spain. I remember watching Chelsea play Barcelona in a Champions League final and Barca blew them away in the first 20 minutes, I think they were 3-0 up, so I think Spain have got some terrific players. It won’t be easy and I’m looking forward to watching it.”\nTurning back to Town’s season getting under way, he added: “Really excited, we’re really excited to start the season, it’s a different feeling when you come back in during the week and you know there’s going to be three points up for grabs.\n“We’re all raring to go, we’ve got a lot to prove and fingers crossed we can start strong and look forward to what we hope will be a successful season.”\nPhoto: Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1907,
  "scraped_at": "2026-02-14T01:51:48.874313",
  "_text_extracted": true
}