{
  "article_id": "d60243b8ded5",
  "url": "http://www.china.org.cn/2026-01/30/content_118307742.shtml",
  "title": "International transfers reach historic high in 2025 - FIFA report",
  "date": "20260130T021500Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FIFA announced Wednesday that international transfers reached a historic high in 2025 as the world football governing body published the Global Transfer Report 2025 alongside the Global Transfer Report website.\nA record-breaking 86,158 international player transfers were completed in 2025 in both men's and women's professional, as well as amateur football, FIFA announced. Clubs' spending on transfer fees also broke the record with 13.11 billion U.S. dollars, over 50 percent above those of 2024.\nNathaniel Brown (R) of Eintracht Frankfurt vies with Florian Wirtz of Liverpool FC during the UEFA Champions League group stage 3rd round match between Eintracht Frankfurt and Liverpool FC in Frankfurt, Germany, Oct. 22, 2025. (Photo by Ulrich Hufnagel/Xinhua)\nIn men's professional football, clubs from England spent the most and also received the most on transfer fees, with 3.82 billion dollars spent on incoming transfers and 1.77 billion received for outgoing transfers.\nBrazil has the most number of transfers with 1,190 incoming and 1,005 outgoing transfers.\nTransfers in women's football reached a record level of 28.6 million dollars, over 80 percent higher than in the previous year.\nAll the statistics for each individual association can be found on the new Global Transfer Report website of inside.fifa.com.\n\"In addition to a global overview, the Global Transfer Report 2025 includes extensive analyses of transfer fees and types, player characteristics and contracts, as well as dedicated sections that review the differences at confederation, association and club levels. For the first time, the report also includes a dedicated section on trials - short training stints that allow clubs and players to mutually assess each other's fit and potential,\" FIFA announced.",
  "word_count": 270,
  "scraped_at": "2026-02-14T01:50:01.807634",
  "_text_extracted": true
}