{
  "article_id": "d6058053229d",
  "url": "http://thepeninsulaqatar.com/article/06/11/2023/al-duhail-expect-stern-al-nassr-challenge-despite-ronaldos-absence-in-must-win-clash",
  "title": "Al Duhail expect stern Al Nassr challenge despite Ronaldo absence in must - win clash",
  "date": "20231106T233000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nDoha: Al Duhail coach Christophe Galtier has said high-flying Al Nassr will be a force to be reckoned with despite the absence of superstar Cristiano Ronaldo in their crucial AFC Champions League (ACL) clash at the Khalifa International Stadium on Tuesday night.\nAl Nassr coach Luis Castro said Ronaldo will not play the match due to “fatigue” in what turned out to be a huge disappointment for fans of the five-time Ballon d’Or winner in Qatar.\nSince the tickets sales for the match started last month, fans continued to rush for tickets forming long queues at the outlets with many among them just wanted to see the Portugal talisman in action at Doha’s iconic venue.\nThe 38-year-old has been in sublime form and scored a brace in Al Nassr’s narrow 4-3 win over Al Duhail when the Red Knights visited Riyadh for the first leg two weeks ago.\nBut Galtier, whose team must win the match to avoid early exit from Asia’s premier club competition, Al Nassr sans Ronaldo would still pose a tough challenge to his side.\n“Cristiano Ronaldo is a match winner which he proved in our last match but we don’t think about individual players. We are aware of what Al Nassr is capable of as they are a strong team. I don’t know who will play for Al Nassr but they have many other good players including international stars,” the Al Duhail coach said at a pre-match press conference on Monday.\nAl Duhail, who reached the semi-final of the previous edition, have only one point following a dismal start to their Group E campaign that saw them playing a goalless draw with FC Istiklol before defeats to Persepolis (0-1) and Al Nassr.\n“It’s a crucial match for us and we want to win it to keep our chances alive for the knockout stage. We have prepared well for the match and we are ready,” said Galtier.\nThe Red Knights will heavily rely on Qatar’s Almoez Ali, Kenyan star Michael Olunga and Brazilian Philippe Coutinho as they desperately seek winning points.\n“I am looking forward to help my team. There is no pressure on the team and all of us are focusing on giving our best and return with a positive result,” said Coutinho.\nWith a perfect record from their first three matches, Al Nassr comfortably sit on top of the group with nine points, leading second-placed Persepolis by three points.\nAl Nassr coach Castro was keen to pick up more points, saying his team has many other good players apart from Ronaldo.\n“Cristiano Ronaldo will not participate in the Al Duhail match. Ronaldo’s absence is due to fatigue. A few days ago we played a Cup match that went into extra time, and 48 hours ago we played an important league match, so he cannot physically participate tomorrow. I was not the one who decided on Cristiano’s absence, and these things happen in football. He is 38 and he needs rest,” said Castro when asked about Ronaldo’s absence.\n“We are without some other players too but that will not affect us as we are focused on winning the difficult match against Al Duhail. We are looking to seal a place in Round of 16,” he added.\nMeanwhile, Al Nassr defender Abdulelah Al Amri was expecting a tough match against Al Duhail, who will play in front of home fans.\n“It is going to be a difficult game. But we want to maintain our winning run in the AFC Champions League and take home three points,” he said.\nAmong the players likely to miss the game is Spanish international Aymeric Laporte but Al Nassr also boast stars in Senegalese Sadio Mane, Brazilian Talisca, Portuguese Otavio and Abdulrahman Ghareeb.\nThe match will kick off at 9pm.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 696,
  "scraped_at": "2026-02-14T02:07:27.068650",
  "_text_extracted": true
}