{
  "article_id": "d61159d05b1e",
  "url": "https://www.naharnet.com:443/stories/en/305127-man-united-vs-arsenal-why-arteta-s-success-could-be-a-blueprint-for-united",
  "title": "Man United vs Arsenal : Why Arteta success could be a blueprint for United",
  "date": "20240510T131500Z",
  "domain": "naharnet.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United vs Arsenal: Why Arteta's success could be a blueprint for United\nTwo of England's most storied football teams go head to head on Sunday with their paths heading in wildly different directions.\nArsenal — top of the Premier League — is mounting a second consecutive title challenge and hoping to finally end a two-decades-long wait to be crowned champion.\nManchester United is desperately trying to avoid its lowest finish in the Premier League era.\nManager Erik ten Hag could yet salvage the campaign by winning the FA Cup this month. But even victory against Manchester City in the final would not disguise his team's woeful performance in the league, and at a time when new co-owner Jim Ratcliffe is overhauling the failing club.\nIt wasn't so long ago that Mikel Arteta's fate was similarly doomed at Arsenal.\nLured from City in 2019, when he was Pep Guardiola's trusted assistant, Arteta delivered a first trophy by winning the FA Cup after an eighth-place finish in the league.\nThree straight defeats at the start of the following season included a 5-0 rout at City and calls for Arteta to be fired. Arsenal blew the chance of Champions League qualification by losing seven of the last 12 games.\nThe jury was out on Arteta but Arsenal backed his methods and proved its faith in him by giving him the power to dispose of highly paid players like Pierre-Emerick Aubameyang and Mesut Ozil. Focus and money was spent on young players who would grow with Arteta and buy into his methods such as Martin Odegaard, Ben White and Declan Rice, who have been key figures in their rise over the past two seasons.\nThey led the league for 248 days last season but another collapse was a cause for criticism. However, the manner in which Arteta has transformed a club that hadn't qualified for the Champions League since 2016 until last year is a lesson in the benefits of patience and trust in a manager.\nHow Ten Hag will hope United follow Arsenal's lead.\nThe Dutchman has repeatedly called for trust in his process in the face of ever-worsening results.\nUnited's 13 league defeats are its most in the Premier League era. United has 18 losses overall.\nUnited has won only one of its last seven league games, against last-placed Sheffield United. At eighth in the standings, it is on course for its lowest finish of the era.\nSuch damning numbers are the reason there is so much uncertainty around Ten Hag's position, even with the chance of silverware.\nHe has pointed to a debilitating injury list all season, and if he can defy the odds in the FA Cup final, he can point to consecutive campaigns with a trophy which no United manager has achieved since Alex Ferguson.\nHaving also secured a top-four finish in his first season, Ten Hag could make the case that his second season is an outlier.\nFerguson, himself, believed he needed the FA Cup in 1990 to take the pressure off after a 13th-place finish in the division.\nBut Ten Hag's squad looks unbalanced. United appears tactically naive and has conceded 81 goals in all competitions so far, the most since 1976-77.\nUnited supporters are more hopeful than confident their team can spoil Arsenal's title chase this weekend.",
  "word_count": 552,
  "scraped_at": "2026-02-14T02:01:16.466999",
  "_text_extracted": true
}