{
  "article_id": "d64b69428464",
  "url": "https://www.fourfourtwo.com/news/every-premier-league-club-squads-value-heading-into-the-summer-transfer-window",
  "title": "Every Premier League Club squad value heading into the summer transfer window",
  "date": "20240502T210000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every Premier League Club squad's value heading into the summer transfer window\nHere's how much you could sell your team's players for this summer\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nEleven billion pounds. That’s roughly the combined valuation of the 20 Premier League clubs’ squads – though of course, it’s far from an even distribution, with the most valuable squad given a total price tag ten times that of the least valuable.\nThe numbers are taken from Transfermarkt, and so aren’t especially to be taken as gospel: as you’ll see as we go down, there are a few that will make you wrinkle your nose and go ‘really?’. But as a rough guide, it’s a handy starting point.\nWith those large bags of salt clutched firmly in hand, let’s dive in and see who ranks where and their most valuable players, starting with the least valuable club and working our way up. Why not try to make a game of it by guessing who’s next? (MVPs exclude any players at the club on loan, but the overall squad values do not.)\n20. Luton Town: €125.1m\nNo surprises in the bottom three, which is made up of…the bottom three. Yeah, sorry, we’ve ruined that game we suggested already. Last season’s play-off winners spent their money rather more advisedly in the summer transfer window but remain in with a shout of retaining their Premier League status going into the final few games. Quite a feat.\nMVPs\n1. Carlton Morris: £11.1m\n2=. Elijah Adebayo £10.3m\n2=. Teden Mengi: £10.3m\n19. Sheffield United: €144.2m\nA squad destined to fill out the upper reaches of future lists of the very worst Premier League sides of all time, having accumulated a measly 16 points from their 35 games at time of writing.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nUnsurprisingly, then, there’s little in the way of big assets in Chris Wilder’s squad, who will again be tasked with pushing from promotion back from the Championship next season.\nMVPs\n1. Anel Ahmedhovic: £15.4m\n2. Gustavo Hamer: £13.7m\n3. Cameron Archer: £12.8m\n18. Burnley: €256.1m\nWhat does it say that Burnley’s squad is valued at nearly double Sheffield United’s – and more than double Luton’s? Not a huge amount, according to the league table, but it is perhaps reflective of Burnley having the youngest average starting XI in the division this season.\nNo real surprises as to who the top-rated players are, either, with big-money summer signing Sander Berge topping the pile.\nMVPs\n1. Sander Berge: £17.1m\n2=. Josh Brownhill: £15.4m\n2=. James Trafford: £15.4m\n17. Fulham: €338m\nWhat’s worth more, the Fulham squad or the AEW roster?\nDespite their placement here, the Cottagers squad is rated considerably more valuable than 18th-ranked Burnley: they’re actually closer to 12th-placing Crystal Palace. But they also have the biggest relative drop-off from their most valuable player to the second-most valuable, with Alex Iwobi rated at nearly half the price of Joao Palhinha.\nVery much at the opposite end of the scale to Burnley, Fulham’s squad valuation suffers from their having the oldest average XI in the Premier League this year.\nMVPs\n1. Joao Palhinha: £47.0m\n2. Alex Iwobi: £23.9m\n3. Issa Diop: £18.8m\n16. Wolverhampton Wanderers: €339m\nIf we hadn’t done the ‘Scandinavian for value’ joke in reference to Pedro Neto several thousand times already throughout his various transfer links to higher up the Premier League food chain, we’d be trotting it out again now.\nShame we wasted it, because Neto’s valuation makes him the second-most valuable player in the league in terms of the percentage of overall squad he offers (16.2%), just marginally behind only Fulham’s Palhinha (16.3%).\nMax Kilman is an interesting one there, isn’t he? And just in time for those reports of Manchester United’s interest, too.\nMVPs\n1. Pedro Neto: £47.0m\n2. Matheus Cunha: £35.9m\n3. Max Kilman: £29.9m\n15. Everton: €345.4m\nThe only one of the Premier League clubs who might actually realistically have to try and pull in the full valuation of the entire squad? The horrible reality is: maybe, yeah.\nAmadou Onana and Jarrad Branthwaite have both been linked with Manchester United, among others.\nMVPs\n1. Amadou Onana: £42.7m\n2. Jarrad Branthwaite: £25.6m\n3. Vitaliy Mykolenko: £23.9m\n14. Bournemouth: €352.8m\nAnother relatively young squad with a lot of players just entering their prime years, Bournemouth have the cheapest-valued MVP outside the bottom three, but are fairly well-balanced in their valuations across the squad as a whole. As befits a team sitting tenth in the table, we suppose.\nMVPs\n1. Dominic Solanke: £29.9m\n2. Illya Zabarnyi: £23.9m\n3. Philip Billing: £18.8m\n13. Nottingham Forest: €369.9m\nWould be ranked first were it not for a dastardly conspiracy designed to hold them down.\nForest’s expensively assembled squad has underperformed relative to – or, dare we say, because of – their frankly astonishing number of new arrivals since promotion from the Championship: 47 of them, in total. They’re into eight figures just from players who haven’t touched grass for them this season.\nMVPs\n1. Morgan Gibbs-White: £34.2m\n2. Ibrahim Sangare: £27.4m\n3=. Taiwo Awoniyi: £23.9m\n3=. Danilo: £23.9m\n12. Crystal Palace: €404.7m\nAlmost entirely unexceptional, other than to say that Palace are behind only Chelsea and Liverpool in having such a close valuation between their top two stars. Try reeling that one out at the pub tonight and see how it goes.\nMVPs\n1. Michael Olise: £42.7m\n2. Eberechi Eze: £41.0m\n3. Marc Guehi: £32.5m\n11. Brentford: €426m\nSlightly surprising to see them this high up the list, until you remember they’ve been a Premier League club for three years and counting and were always built on their excellent buy-low-sell-high work in the transfer market.\nThey have the opportunity to continue to do that, with Ivan Toney the obvious next cab off the rank – though that £100m they were reportedly holding out for is way off, according to this.\nMVPs\n1. Ivan Toney: £42.7m\n2. Bryan Mbuemo: £32.5m\n3=. Mathias Jensen: £25.6m\n3=. Aaron Hickey: £25.6m\n10. West Ham United: €446.6m\nNudging into the top half despite having a relatively old squad, though they are another of those sides whose valuation is being pretty substantially boosted by a handful of players.\nWest Ham’s top three MVPs account for 37% of their overall valuation, putting them behind only Wolves (39%) on that score.\nMVPs\n1. Lucas Paqueta: £55.6m\n2=. Jarrod Bowen: £42.7m\n2=. Mohammed Kudus: £42.7m\n9. Brighton & Hove Albion: €505.1m\nThe Premier League’s great salesmen, the Southampton of the 2020s – it’s not really a surprise to see Brighton up here, just behind the top four and the real big-money boys.\n19-year-old Evan Ferguson is the youngest MVP at any Premier League club, already valued over halfway to nine figures.\nMVPs\n1. Evan Ferguson: £51.3m\n2=. Kaoru Mitoma: £38.5m\n2=. Joao Pedro: £38.5m\n8. Newcastle United: €637.7m\nA big jump up in overall valuations now, thanks in no small part to Newcastle having the highest-valued MVP outside the two sides clubs who top this list.\nMVPs\n1. Bruno Guimaraes: £72.6m\n2. Alexander Isak: £59.8m\n3. Anthony Gordon: £42.7m\n7. Aston Villa: €646.2m\nWe suspect a fair few of the Villa squad have significantly increased in value since the start of the season having enjoyed a magnificent campaign under a Unai Emery that looks almost certain to result in Champions League football next season – and the opportunity to add to their squad list with the extra millions that come with it.\nMVPs\n1. Douglas Luiz: £59.8m\n2. Ollie Watkins: £55.6m\n3. Moussa Diaby: £47.0m\n6. Manchester United: €734.25m\nCan we shock you? The big six occupy the top six places on the list. Who could have guessed?\nIt says a lot, doesn’t it, that Manchester United have the oldest MVP out of all 20 clubs in the shape of Bruno Fernandes. Either that or Rasmus Hojlund is grossly undervalued here. Take your pick. Either way: there’s a lot of expensive dead wood bloated up that squad and its valuation.\nMVPs\n1. Bruno Fernandes: £59.8m\n2. Rasmus Hojlund: £55.6m\n3. Marcus Rashford: £51.3m\n5. Tottenham Hotspur: €777.3m\nTottenham, of course, cashed in on their previous MVP last summer by selling Harry Kane to Bayern Munich, leaving new arrival James Maddison to top the pile, probably largely by virtue of Spurs having actually spent good money on him last year.\nThe number given here is some 50% higher than Tottenham reportedly paid for Maddison. Did they get him for a steal thanks to Leicester’s relegation or is that about right? His very differing form either side of his mid-season injury makes it hard to say.\nMVPs\n1. James Maddison: £59.8m\n2. Cristian Romero: £51.3m\n3. Dejan Kulusevski: £47.0m\n4. Liverpool: €921.4m\nAgain, a bit of a weird one at the top of the list, but one that’s rooted in reality with Liverpool having actually paid that kind of fee to bring Dominik Szoboszlai in from RB Leipzig last summer.\nThis list sort of spells out Liverpool’s issues to a greater or lesser extent, with age keeping Virgil van Dijk and Mo Salah away from the very top of the rankings while most of those who do occupy those places still having something to prove at Anfield.\nLiverpool are less reliant on one player for their overall valuation (8.1%) than any side except Burnley (7.8%), though. What does that mean? Dunno.\nMVPs\n1=. Luis Diaz: £64.1m\n1=. Dominik Szoboszlai: £64.1m\n3=. Trent Alexander-Arnold: £59.8m\n3=. Alexis Mac Allister: £59.8m\n3=. Darwin Nunez: £59.8m\n3. Chelsea: €928.3m\nRemember what we said about Manchester United and Nottingham Forest having astonishingly bloated squads full of expensive deadwood? Yeah, well, Chelsea put them both in the shade at the moment.\nIn fairness, it’s not just down to that: they also have the second-youngest squad in the top flight and a lot of players on long-term contracts, both of which add substantially to Transfermarkt’s calculations.\nMVPs\n1=. Enzo Fernandez: £68.4m\n1=. Moises Caicedo: £68.4m\n3. Christopher Nkunku: £59.8m\n2. Arsenal: €1.12bn\nThe proud owners of the joint-highest valued English player in the Premier League (Bukayo Saka alongside Phil Foden) and the next Englishman on the list (Declan Rice).\nAs with Chelsea, Arsenal’s overall youth does them a lot of favours here.\nMVPs\n1. Bukayo Saka: £111.1m\n2. Declan Rice: £94.0m\n3. Martin Odegaard: £81.2m\n1. Manchester City\nWoof. No surprises they’re top, but that number makes you pause nonetheless.\nPut it this way: Chelsea’s sixth-most valuable player, Ruben Dias, is valued higher than the MVP of every other team bar Arsenal and Newcastle.\nRemarkably, Haaland is still worth a hefty 14% of the Manchester City squad’s overall valuation.\nMVPs\n1. Erling Haaland: £153.8m\n2. Phil Foden: £111.1m\n3. Rodri: £94.0m\nSteven Chicken has been working as a football writer since 2009, taking in stints with Football365 and the Huddersfield Examiner. Steven still covers Huddersfield Town home and away for his own publication, WeAreTerriers.com. Steven is a two-time nominee for Regional Journalist of the Year at the prestigious British Sports Journalism Awards, making the shortlist in 2020 and 2023.",
  "word_count": 1956,
  "scraped_at": "2026-02-14T01:56:51.534494",
  "_text_extracted": true
}