{
  "article_id": "d66b0265be6c",
  "url": "https://www.lbc.co.uk/news/53-arrested-champions-league-final-wembley/",
  "title": "Champions League chaos sees 53 arrested outside Wembley as fans rush turnstiles and ... ",
  "date": "20240602T000000Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League chaos sees 53 arrested outside Wembley as fans rush turnstiles and invade pitch\nFans without tickets rushed turnstiles despite high-security before the Champions League final at Wembley - leading to 53 arrests at Europe's showpiece game.\nListen to this article\nIndividuals were seen rushing the plush Club Wembley entrances at the stadium in North London before Borussia Dortmund face off against Real Madrid in football's biggest club game.\nShocking footage from outside the ground showed mayhem as people jumped over security fences and pushed through ticket gates.\nMet Police confirmed their officers made 53 arrests around the Champions League final.\nAfter the ugly scenes outside the ground, the start of the game was also marred when three pitch invaders entered the playing field.\nThe three fans were hauled off by security and the game was restarted - with one stopping to take a selfie with Madrid star and goalscorer Vinicius Jr.\nA spokesperson for Met said: \"We are confident that the overwhelming majority of attempts to unlawfully gain access to Wembley this evening were unsuccessful thanks to the efforts of officers, stewards and other stadium staff.\n\"Officers have made 53 arrests at Wembley tonight - five for pitch invasion and the majority of others for attempts to breach security.\n\"Major sporting events often attract attempts by those without tickets to bypass perimeter fencing or otherwise gain entry. There is a robust policing operation in place to support the Wembley security plan and officers have worked closely with stewards and stadium staff to maintain security throughout.\n\"Videos shared online showing groups running into entrances do not necessarily represent successful attempts to enter the stadium. There are typically multiple further levels of security beyond an initial entrance.\n\"Officers remain in the area outside the stadium and will deal decisively with any criminality.\"\nThe security breaches came after the FA boasted of a £5million \"ring of steel\" which was supposed to prevent a repeat of the massive problems of England's EURO final defeat to Italy in July 2021.\nThe FA and UEFA were also seeking to stop a similar situation to the 2022 Champions League final at the Stade de France in Paris.\nAt the game between Liverpool and Real Madrid, thousands of Liverpool fans were stuck outside and congestion resulted in a non-fatal crush.\nCongestion had reached dangerous levels, and the police's response was to indiscriminately pepper spray and tear gas supporters.\nAmong them were children who were pressed up against the railings in an attempt to relieve pressure on the turnstiles.\nBoth UEFA and French authorities initially tried blaming the chaos on Liverpool fans, who will be all too aware of the false accusations thrown their way after the 1989 Hillsborough disaster.\nFrance’s interior minister, Gerald Darmanin, claimed \"30,000 to 40,000 Liverpool fans\" had forged or no tickets, alleging there had been an \"industrial scale\" ticket fraud.\nFrench ministers had talked of Liverpool supporters as having been a major hooligan threat, contrary to the Merseyside Police intelligence.\nIt later emerged police had acted on a misconceived view of the Hillsborough disaster and believed it meant they had to have riot police in force.\nHowever, an independent report into the potentially life-threatening incident, leaked on Monday, said there was “no evidence” to support the “reprehensible” claims.\nThe findings of the report, commissioned by UEFA after the final, concluded that as the “event owner”, the footballing body “bears primary responsibility for failures which almost led to disaster”.",
  "word_count": 576,
  "scraped_at": "2026-02-14T01:48:52.516831",
  "_text_extracted": true
}