{
  "article_id": "d676faf200fa",
  "url": "https://cartilagefreecaptain.sbnation.com/tottenham-hotspur-transfers-rumors/67831/tottenham-hotspur-fabio-paratici-johan-lange-gossip-matt-law-lol-lmao",
  "title": "Matt Law just gave us the most incredible Tottenham gossip ever",
  "date": "20251224T201500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We’re a day early to be opening what Santa placed under the tree, but English football journalist Matt Law just gave us an early Christmas present. Law has a new piece out in the Telegraph (£) about Tottenham’s troubles, a “five issues” piece that does the job of succinctly spelling out exactly what’s going wrong at Tottenham Hotspur and dishing on a lot of the behind-the-scenes drama. There’s stuff in there about Thomas Frank, about players’ opinions on the current season, the January transfer window, and the upcoming holiday fixture period.\nMatt Law just gave us the most incredible Tottenham gossip ever\nIs it journalism? Who cares! It’s great!\nThat’s all well and good — nobody loves a good Spurs In Crisis™ piece quite like Matt Law, and there’s plenty of stuff we could discuss in this piece — but there’s one paragraph that, despite being behind a paywall, I absolutely have to share with all of you on this Christmas Eve. Referencing the ongoing situation regarding co-Sporting Director Fabio Paratici’s public flirtation with the open Director of Football job at Fiorentina, Law dropped something of a rumor-mongering bombshell, suggesting, without evidence or substantiation, that Paratici’s interest in the Fiorentina job might be a backgrounded power play. Here’s the excerpt (emphasis mine).\nParatici was only formally reappointed by Spurs in October, having worked as a contracted consultant for the club during his ban from football. He was re-hired as a co-sporting director with Johan Lange and some sources believe the link to Fiorentina could essentially be an attempted Spurs power-grab by Paratici that would involve Lange being sidelined or even heading for the exit. That is unsubstantiated and it remains to be seen whether Paratici is on his way out, Lange is being frozen out or both men will stay in their co-sporting director roles. Whatever happens will have an impact on Frank and Tottenham’s transfer business.\nThis is SPECTACULAR gossip. The idea that Paratici’s flirtation with La Viola might be to stick a knife in Johan Lange’s back so that he can leverage himself into a position of greater power at Spurs is some Succession-level stuff. Like, honestly — no notes. It’s wonderful.\nNow, you might be asking yourself the question as to why Matt Law, an accredited sports journalist, is putting wholly unsubstantiated gossip in a major English newspaper, and that’s a great question which I will direct attention to and never talk about again, because look at that rumor! The idea that Paratici, two months after returning officially to football after a substantial ban for financial malfeasance at Juventus, would be willing to go behind Lange’s back for his own benefit is too good a rumor not to share with all of y’all.\nDoes it matter whether the info shared here was provided from a trusted source that asked to kept fully backgrounded, or whether it was shared through a game of Telephone such that it might have originated in the wilds of Bat Country or ITK? Reader, no it does not. I find the idea of Machiavellian-But-Stupider power plays at the Spurs executive level to be INCREDIBLE and I want more of it.\nSo let’s take this gossip at face value and assume this is Don Fabio getting the knives out for Lange. Would it be better to have Paratici in charge of the whole operation at Spurs? I don’t know! I certainly have significant doubts about Lange’s identification and squad building nous based on the past couple of transfer windows. It would certainly be funny, but funny ≠ good.\nIt goes without saying that this could also be wildly off-base. Now, say what you want about Matt Law, but we know he absolutely has sources within and around Tottenham, so I will leave it up to you, gentle reader, as to what you want to believe. I’m just sitting here munching popcorn and reveling in the drama.\nOn Christmas, it’s worth taking some time to think about and say what you’re thankful for over the past year. I have a lot to be thankful for — I’m still alive, for example, even if I’m back in cancer treatment — but what I’m most thankful for today is the Gift of Unsubstantiated Tottenham Gossip, thoughtfully wrapped and left under my tree by Matt Law. It is a gift that keeps on giving, though I’m not yet sure whether it’s something nice, or a giant lump of coal.",
  "word_count": 741,
  "scraped_at": "2026-02-14T01:59:31.515672",
  "_text_extracted": true
}