{
  "article_id": "d683d90cd59d",
  "url": "https://www.irishecho.com/2024/8/szmodics-on-target-in-full-pl-debut",
  "title": "Szmodics on target for Ipswich in full EPL debut",
  "date": "20240829T203000Z",
  "domain": "irishecho.com",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Irish international Sammie Szmodics won’t forget his first game at the Etihad Stadium, Manchester on Saturday. Making his full debut for his new club Ipswich Town, Sammie, who scored 33 goals in 79 league games for Blackburn Rovers, gave the Tractor Boys a dream start when he squeezed a shot through the legs of goalkeeper Ederson after only seven minutes.\nHowever, Ipswich’s joy was short-lived as City hit back with three goals in four minutes, two from Erling Haaland and one from Kevin De Bruyne. Haaland completed his tenth hat-trick for City in the 88th minute.\nFormer City captain Ilkay Gundogan was a second-half sub on Saturday, after rejoining the club from Barcelona. We were told that the German’s wife Sara missed Manchester, but then the player wasn’t a regular for Barca. The midfielder, who was Pep Guardiola’s first signing at the club in 2016, spent seven years at City before joining Barcelona on a free transfer in 2023. It looks like his departure from Barca was required to allow summer signing Dani Olmo to play, following his €55 million arrival from RB Leipzig earlier this month.\nFormer Irish under 21 international Jack Taylor was a second-half sub for Ipswich and Marcus Harness, who declared for the Republic in 2019 but has yet to get a call-up, replaced Szmodics.\nOn Sunday Irish international Dara O’Shea joined Ipswich from Burnley in a deal reported to be worth worth £12 million, plus £3 million in add-ons.\nSo, Arsenal, Brighton, Liverpool and Manchester City all have maximum points from the first two series of games, with City top on goal difference. Arsenal picked up all three points away to Aston Villa with two second half goals, but Villa’s Ollie Watkins missed two great chances before Arsenal scored. That game was watched by England caretaker manager Lee Carsley. On Sunday Liverpool’s new manager Arne Slot made a perfect Anfield start, winning his first home game thanks to goals from Diaz and Mo Salah, but Trent Alexander-Arnold didn’t look happy when he has substituted on 72 minutes. Slot becomes the first Liverpool manager since Graeme Souness in April 1991 to win his first two League games in charge. Irish Nathan Collins was excellent for Brentford with goal-line stops and he also almost scored at the other end. Meanwhile it looks like it going to be a long last season at Goodison Park for the blue side of Merseyside. Everton, who lost their opening game 3-0 at home to Brighton, were beaten 4-0 by Spurs at White Hart Lane on Saturday where England goalkeeper Jordan Pickford started well, but he was then caught in possession by Tottenham’s Son Heung-mine for the home side’s second goal.\nBrighton beat Manchester United 2-1 thanks to an injury time winner from Pedro, but Irish international Evan Ferguson, who is struggling to regain full fitness, was once again omitted from the Seagulls match-day squad. Seamus Coleman was not in the Everton match-day squad, but the Toffees new signing Jake O’Brien was an unused sub. For the second week in-a-row Matt Doherty played the full game for Wolves, who were beaten 6-2 at home by Chelsea.\nROONEY PLEASED\nWITH OBAFEMI MOVE\nFormer England star Wayne Rooney, who is now manager of Championship club Plymouth Argyle, says he is thrilled that Ireland striker Michael Obafemi has joined his Plymouth Argyle on a season-long loan. The 24-year-old frontman moves from fellow Championship club Burnley and he made his debut as a second half sub in Saturday’s 1-1 draw away to QPR. Elsewhere in the Championship Sunderland ended Burnley’s good start with a 1-0 win at the Stadium of Light and Watford are the only other club with a 100 per cent record after three series of games after a 2-1 home win over Derby County. Irish international Will Keane ensured Preston made a good start under new manager Paul Heckingbottom scoring the only goal of the game in a 1-0 home win over Luton Town.\nIt’s been reported, meanwhile, that Irish international former Sheffield United defender has been training with Burnley.\nEURO HOPES DIM\nShamrock Rovers hopes of progressing to the group stages of the Europa League are very slim after they were beaten 4-0 in Greece last week by PAOK in the first leg of their group play-off game. The second leg is in Tallaght tomorrow night and it look like The Hoops will now drop down to the Conference League group stages. They could be joined there by St Patrick’s Athletic, who drew 0-0 with Turkish club Basaksehir FK. It’s a big ask for the Saints to win in Turkey in the second leg tonight, but they are playing very confident football under Stephen Kenny.\nCARSLEY FIRES, HIRES\nEngland’s interim manager Lee Carsley seems to have been given a free hand by the English FA. Last week it was confirmed that Carsley was dropping Mick Baker and Stephen O’Brien, two of former manager Gareth Southgate’s backroom team, and promoting Ashley Cole and Joleon Lescott who were part his backroom team from the England under 21 team. Baker and O’Brien were full-time FA staff who worked with Southgate. Carsley is also being permitted to promote under-21 analyst James Ryder and goalkeeper coach Tim Dittmer to work with the senior team. Meanwhile freelance coaches Jimmy Floyd Hasselbaink and Paul Nevin are not expected to be retained.\nIRISH ‘TOO NICE,’\nSAYS NEW BOSS\nNew Irish manager Heimir Hallgrimsson says he’s looking for a ‘bastard’ in his team and admits some of his new players are possibly “a little bit too nice.” Ahead of his first squad announcement this week the Icelandic-born manager had a question and answer session with Irish season tickets holders in the Aviva last week Responding to questions from supporters Halgrimsson said: “I think in many ways, Ireland is similar to Iceland in the sense that we don’t have many players playing at the highest level in the Champions League. So there are no high-profile players. It’s going to be down to the group, to the squad to win the games, not the individuals. I think the first impression of the players is really good team players, really good characters, maybe a little bit too nice. Sometimes you need a ‘bastard’ in your team. I am looking for him. Maybe we can develop him.” Hallgrimsson will name his first Irish squad tomorrow.\nLENNON FIRED\nAFTER 6 LOSSES\nFormer Celtic manager Neil Lennon, who was interviewed for the Irish job earlier this year, has been sacked by Rapid Bucharest. The Lurgan native, who was appointed manager of the Romanian club last May, was under pressure after recording no wins in six matches. Rapid have drawn five and lost one game in the new Liga 1 season, a return that leaves the three-time champions 12th in the 16-team league. Romanian Marius Sumudica, who previously managed Rapid in 2005, has been confirmed as the club’s new coach.\nNEW POST FOR\nSOUTHGATE\nFormer England manager Gareth Southgate was last week appointed as a UEFA technical observer. Having started his managerial career at Boro, Southgate has been widely tipped to make a return to club management after leaving his England role, with strong links to Manchester United. Now Southgate and former West Ham manager David Moyes have joined UEFA as technical observers ahead for the 2024-25 Champions League. As part of the job the former managers will attend games throughout the season and file reports to UEFA, assessing games, tactics and individual performances. Their new role are is not expected to interfere with any possible punditry roles. The reformatted Champions League begins on Sept. 17.\nSPURS ARE BEST-RUN\nAn independent analysis of 34 EFL and non-league clubs has named Tottenham Hotspur as the best-run club in England by Fair Game, an organization that works with 34 English Football League and non-league clubs. Their report analyzed data from clubs across the top seven divisions in English football and gave them a score out of 100 based on four key indicators, financial sustainability, good governance, fan engagement and equality standards. Based on these measures Spurs were ranked first with a combined score of 68.2 out of 100. Spurs’ top ranking was especially driven by a high score in equality. United were rated second with a score of 65.4, a surprise rating considering the headlines the Red Devils have made over the years due to the Glazer ownership. United’s ranking was boosted by high scores in financial stability and good governance.\nDERRY CITY GO TOP\nWith long-time leaders Shelbourne being held to a 1-1 draw by Bohemians at Tolka Park on Friday, Derry City took full advantage moving to the top of the table on goal difference after a 1-0 win away win over Waterford. Derry had former Liverpool player Andre Wisdom in their team; he joined the Candystripes last week from non-League Warrington Town. On Sunday evening Shamrock Rovers could only draw 1-1 at home to Galway United and The Hoops’ five in-a-row dream is almost over as they are now 10 points behind Derry and Shels.",
  "word_count": 1508,
  "scraped_at": "2026-02-14T01:48:56.587011",
  "_text_extracted": true
}