{
  "article_id": "d6970e9fae97",
  "url": "https://thenationonlineng.net/edo-queens-seek-final-spot-against-tp-mazembe-in-womens-champions-league/",
  "title": "Edo Queens seek final spot against TP Mazembe in Women Champions League",
  "date": "20241119T064500Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nNovember 19, 2024 by Our Reporter\nEdo Queens seek final spot against TP Mazembe in Women’s Champions League\nNigeria’s flag bearers , Edo Queens , will today seek a final spot as the semi-finals of the CAF Women’s Champions League 2024 take centre stage in Casablanca and El Jadida.\nAfter challenging group stage matches, the final four teams that advanced to the semi-finals will battle it out as Edo Queens face off against TP Mazembe of the Democratic Republic of Congo at the Larbi Zaouli Stadium, Casablanca.\nIn the other semi-finals, home team ASFAR of Morocco will be up in arms against fellow North African side, FC Masar of Egypt at the M’Hamed El Abdi Stadium in El Jadida\nProfiling the four gladiators, CAF noted that Edo Queens has ‘displayed flair and determination’, adding :“ The Nigerian side emerged as a fan favourite with thrilling matches and key victory against reigning Champions Mamelodi Sundowns that earned them a semi-final spot.”\nRead Also: NFF urge Edo Queens to win CAF Women’s Champions League title\nFor TP Mazembe, it was stated: “The Congolese side made history by reaching the semifinals for the first time, showcasing resilience and tactical strength throughout the group stage.”\nOn the part of the Morocco’s representative, ASFAR, CAF noted their unbeaten run so far: “The 2022 champions remain unbeaten, topping their group with stellar defensive and attacking performances. They aim to retain their title on home soil.”\nAccording to CAF, FC Masar, remains the Cinderella team and could be hard to beat today: “A surprise package this year, the Egyptian side advanced with a solid team structure and standout individual performances, proving their mettle among Africa’s elite. “\nMeanwhile, the continental soccer ruling body noted that “ this year’s edition features a significant increase in prize money, reflecting CAF’s commitment to developing women’s football on the continent. Teams are not only competing for glory but also for a larger financial reward, which will further support the growth of women’s football programs across Africa.”\nThe overall winner of the tournament will be rewarded with a staggering USD 600,000 while the runners-up will get USD 400,000",
  "word_count": 357,
  "scraped_at": "2026-02-14T02:08:26.318827",
  "_text_extracted": true
}