{
  "article_id": "d69b5c4af1d0",
  "url": "http://thepeninsulaqatar.com/article/28/02/2023/alaba-abused-croatia-coach-critical-following-fifa-awards",
  "title": "Alaba abused , Croatia coach critical following FIFA awards",
  "date": "20230228T171500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nFrance and Paris Saint-Germain forward Kylian Mbappe and Argentina and Paris Saint-Germain forward Lionel Messi receive awards for the FIFA FIFPRO men's World11 during the Best FIFA Football Awards 2022 ceremony in Paris on February 27, 2023. (Photo by FRANCK FIFE / AFP)\nGeneva: Real Madrid defender David Alaba was racially abused on social media after voting for Lionel Messi, and Croatia coach Zlatko Dalić accused FIFA of disrespect on Tuesday in fallout from the soccer body’s annual awards ceremony.\nMessi was named the best men’s player on Monday after leading Argentina to last year's World Cup title in Qatar, with Real Madrid forward Karim Benzema in third place after a standout season helping Madrid to another Champions League title.\nThe awards were decided by a poll of national team captains and coaches, selected media and fans voting online from candidate lists decided by FIFA-appointed expert panels.\nAlaba’s vote as captain of Austria's national team - placing Messi first, Madrid teammate Benzema second and Kylian Mbappé, the eventual runner-up, in third - was among the results published by FIFA after the ceremony in Paris.\nThat choice provoked anger from Madrid fans and others because Alaba, who is Black, voted for Messi, who spent 17 seasons at Barcelona, Real Madrid's biggest rival.\n\"The Austrian national team vote for this award as a team, not me alone,” Alaba wrote on his social media accounts. \"Everyone in the team council is able to vote and that’s how it’s decided.\n\"Everyone knows, especially Karim, how much I admire him and his performances,” added Alaba, who joined Madrid last season after more than a decade at Bayern Munich. \"I have often said that for me he is the best striker in the world, and that is still the case. Without doubt.”\nDalić said on Tuesday he refused to vote in protest at a perceived lack of respect for himself and his team, which eliminated Brazil before losing to Argentina in the World Cup semifinals.\n\"I am disappointed with FIFA’s attitude towards the Croatian national team because I strongly maintain that, based on everything we’ve achieved as a national team, we deserve more respect from the head governing body of world football than we have received,” the coach said in a statement published by the Croatian soccer federation.\nCroatia captain Luka Modrić, another Real Madrid player, was fourth in the voting. Modrić won the FIFA award in 2018 when his team reached the World Cup final, losing to France.\nDalić, who placed third in 2018 in voting for the best coach award, pointed Tuesday to himself being left off the five-man shortlist this time, and for his players being overlooked for other awards, including a player-voted all-star team.\n\"Was there really no place for Mateo Kovačić on that list, even though he’s won the FIFA Club World Cup (with Chelsea) and played a brilliant World Cup in Qatar? Where is Joško Gvardiol’s name?” Dalić asked. \"And did Dominik Livaković not deserve to be one of the five finalists for the Best FIFA Men’s Goalkeeper after everything he did in Qatar?”\nDalić also noted that Morocco coach Walid Regragui was a candidate - finishing fourth for the coaching award won by Argentina's Lionel Scaloni - despite Croatia beating that team in the third-place game at the World Cup and drawing in their group match in Qatar.\n\"Having taken all of the above into consideration, I have decided not to partake in the voting process for this year’s awards,” Dalić said, aiming a further barb at FIFA. \"Both the time slots of our matches at the World Cup and the quality of refereeing - especially at the semifinal match - made me feel that there was a lack of respect towards the Croatian team.”\nFIFA did not immediately respond to a request for comment.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 704,
  "scraped_at": "2026-02-14T02:12:28.628000",
  "_text_extracted": true
}