{
  "article_id": "d6c05a0f8f6d",
  "url": "https://metro.co.uk/2025/04/23/pep-guardiola-claims-man-city-star-is-best-world-first-five-metres-22955102/",
  "title": "Pep Guardiola claims Man City star  is the best in the world in first five metre | Football",
  "date": "20250422T233000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola claims Jeremy Doku is the best player in the world ‘in the first five metres’ after Manchester City’s 2-1 win against Aston Villa on Tuesday night.\nCity have strengthened their grip on a Champions League spot as Matheus Nunes’ goal in injury time sealed a last-gasp victory for Guardiola’s side at the Etihad Stadium.\nCity had taken the lead through Bernardo Silva’s goal in the seven minute but Villa pulled level before the break with Marcus Rashford’s penalty.\nThe game appeared on course to finish as a draw but Doku, who was introduced as a second-half substitute, burst past Axel Disasi on City’s left flank before bending a cross with the outside of his foot across Villa’s box for Cunha to finish from a narrow angle at the back post.\nDoku has struggled for playing time in recent weeks, starting just one of City’s five Premier League games this month.\nBut Guardiola insists the Belgium international, who was signed from Rennes in a £55.5 million deal in August 2023, offers a ‘unique’ threat in City’s attack.\n‘Jeremy always gives you something, for the crowd, we changed the game,’ Guardiola said after City beat Villa.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘In the first three or four actions [against] Disasi and Malen, he could not do the action.\n‘But in the end… for me, Jeremy is the best player in the world in the first metres. In the first five metres he’s unstoppable.’\nGuardiola also explained that Doku has been benched for City’s last four matches because he has opted to play his full-backs in a wider position.\n‘No, he’s not played as a winger because now, lately, I’m open with the full-backs, that’s the reason why,’ Guardiola explained.\n‘In the moment he will learn to play inside because if I think he has qualities to do it, he will play inside.\nMore Trending\n‘For nine years, I’ve always played with wingers high and wide, one against one, but lately for the reasons, for stability, maybe we need more control or whatever, we play with the full-backs wide, that’s why he’s playing less, but not because he’s playing bad.\n‘He has to improve, he has improved a lot and he will improve.\n‘I’ve always said, in the moment he makes the action with one speed, when the moment you make the decision you have to reduce the speed. You cannot make one against one [at speed], in the moment in the pass you have to be relaxed, you have to see, otherwise the cross is not good and we’re not going to score a goal.\n‘He’s so young, he has something unique, unique in terms of speed.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ollie Watkins handed Arsenal transfer advice after being dropped for Aston Villa\nMORE: Marcus Rashford stance on Manchester United return revealed as Aston Villa consider £40m option\nMORE: Matheus Cunha responds as Manchester United prepare to activate £62.5m release clause",
  "word_count": 558,
  "scraped_at": "2026-02-14T01:52:20.892693",
  "_text_extracted": true
}