{
  "article_id": "d6d17076a142",
  "url": "https://dailypost.ng/2024/03/14/champions-league-quarter-final-no-surprises-as-real-madrid-city-arsenal-enter-draw/",
  "title": "Champions League quarter - final : No surprises as Real Madrid , City , Arsenal enter draw",
  "date": "20240314T104500Z",
  "domain": "dailypost.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sport\nChampions League quarter-final: No surprises as Real Madrid, City, Arsenal enter draw\nOn social media, there was an agenda that claimed that the UEFA Champions League had lost its buzz.\nAnd this is really from disgruntled fans, who have seen their teams fall off by the wayside.\nManchester United, for instance, finished bottom of a group that had FC Copenhagen and Galatasaray.\nAlthough Copenhagen made it into the Round of 16, they were easily swatted aside by current holders Manchester City.\nLazio was also in the first knockout round and Bayern Munich sent them packing.\nAt the end of the day, the quarter-finalists are City, Bayern, Real Madrid, PSG, Arsenal, Atletico Madrid, Borussia Dortmund and Barcelona.\nWhat a tasty line-up. There is a chance of blockbuster ties all around.\nAll the teams left are European powerhouses in their own right. There is none of them that has not played in the Champions League final.\nMadrid are European royalty, having won this particular trophy a record 13 times.\nPep Guardiola’s men, who won the Treble last season, are heavy favourites to sweep everyone aside.\nArsenal look like a team on a mission and Atletico Madrid will prove to be tricky customers for anyone.\nThe Champions League might have allowed smaller teams to shine in the early rounds, but the contenders are now left to fight for the holy grail of football.\nAnd Friday’s draw will surely deliver two or more memorable fixtures.",
  "word_count": 242,
  "scraped_at": "2026-02-14T02:17:27.957892",
  "_text_extracted": true
}