{
  "article_id": "d6dab8754e3f",
  "url": "https://www.caughtoffside.com/2023/06/26/stan-collymore-on-saudi-pro-league-transfers/",
  "title": "Stan Collymore blasts Saudi deals and says players moving there lack  sporting integrity  ",
  "date": "20230626T134500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saudi Arabia will fail in their attempts to build a top, competitive football league.\nThat is the view of former Aston Villa and Liverpool attacker Stan Collymore, who believes the Pro League will not take off the way the nation hopes.\nAfter hosting the 2022 Winter World Cup in Qatar, as well as delving into other sports, such as boxing, Formula One and mixed martial arts, Asia, specifically countries in the middle east, are now attempting to disrupt football.\nEntering the summer transfer window following a winter deal that saw Cristiano Ronaldo leave Manchester United in favour of a move to Al-Nassr, other Saudi PIF-owned teams, such as Al-Hilal and Al-Ittihad, have been making sporting headlines.\nSuccessfully pursuing some of the sports’ biggest names, including last year’s Ballon d’Or winner Karim Benzema, Saudi’s Pro League has welcomed multiple new additions.\nChelsea, who needed to trim their squad following two windows of massive spending, are in line to sell at least four players to Saudi-based clubs. Goalkeeper Edouard Mendy, defender Kalidou Koulibaly and midfielder N’Golo Kante have already made the switch with winger Hakim Ziyech set to be next.\nN’Golo Kanté to Al Ittihad ???????\n? Four year contract signed.\n? €100m total salary paid in four years.\n? Image rights/commercial deals extra;\n? Negotiations started on June 6 and deal now finally set to be announced.\nEnd of an era for Chelsea legend. ?? pic.twitter.com/kS8taYnuO1\n— Fabrizio Romano (@FabrizioRomano) June 18, 2023\nWhat has Stan Collymore said about the Saudi Pro League?\nHowever, regardless of the players making high-profile moves to the middle east, Collymore isn’t worried about the future of European football.\n“Going back many, many years, America wanted to build a competitive league and they attempted it by signing Franz Beckenbauer, Pele and… Wait for it… Dave from Halifax Town,” the ex-pro said in an exclusive interview.\n“They were unable to populate an entire league or even an entire team, so you’d have arguably the sport’s greatest-ever player playing alongside, and against, nobodies. Can Saudi afford to populate entire teams? – Yes, of course, but will they? – I’m not sure, and the reason I’m not sure is that ditching the Premier League, La Liga, Serie A and bidding farewell to the Champions League in favour of just money leaves player’s sporting integrity in tatters, so they’re unlikely to have a route back in the future.\n“There are, and will continue, to be players who opt to go there, but I am far from convinced that players who are in their absolute prime, and at the top of their game, will. If the Saudi Pro League had poached a 2013 Cristiano Ronaldo or a 2010 Lionel Messi, then we would have a problem, but a 32-year-old Kalidou Koulibaly and a 32-year-old N’Golo Kante? – Come on now.\n“Will you tune into the Saudi Pro League next season just because those two, as well as the great Ruben Neves, have gone there?- Maybe you will, but I seriously doubt it.”\nDo you agree with Collymore? – Will you start watching the Pro League next season? – Let us know in the comments below.",
  "word_count": 524,
  "scraped_at": "2026-02-14T01:56:02.419115",
  "_text_extracted": true
}