{
  "article_id": "d6e595cbae4b",
  "url": "https://www.newkerala.com/news/2024/5873.htm",
  "title": "It quite surprising : Carlo Ancelotti reacts to Jurgen Klopp Liverpool departure",
  "date": "20240127T180000Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "While speaking at the pre-match press conference, Ancelotti explained that the \"motivation drops\" once one coach starts to working with the same team for a long time.\nThe Italian coach showered praise on Klopp and added that he did a \"fantastic job\" at the English club.\n\"It's quite surprising but I understand it because sometimes it can happen because after a long time working with the same team and the same players, your motivation drops a little bit. I think that's what has happened to Klopp at Liverpool, where he's done a fantastic job. He deserves a lot of credit for being objective in this sense, self-critical, and leaving the club in other hands. Full respect to him because he's a great manager and he's going to continue to give a lot to football,\" Ancelotti said as quoted by Real Madrid's official website.\nOn Friday, Klopp decided to step down as the head coach of Liverpool after the end of the ongoing season.\nKlopp arrived at Anfield in 2015, changed the club's fortune and established one of the best sporting rivalries with Manchester City.\n\"I love absolutely everything about this club, I love everything about the city, I love everything about our supporters, I love the team, I love the staff. I love everything. But that I still take this decision shows you that I am convinced it is the one I have to take,\" Klopp said in a video posted by Liverpool on social media.\nKlopp's reign brought about a revolution for the Reds in the Premier League, as they lifted the UEFA Champions League, Premier League, FIFA Club World Cup, FA Cup, League Cup and UEFA Super Cup, as well as the FA Community Shield.",
  "word_count": 287,
  "scraped_at": "2026-02-14T02:25:18.574612",
  "_text_extracted": true
}