{
  "article_id": "d6e75e0ee822",
  "url": "https://www.90min.com/posts/rb-leipzig-1-1-man-city-player-ratings-champions-league-22-2-2023",
  "title": "RB Leipzig 1 - 1 Man City : Player ratings as Gvardiol cancels out Mahrez strike",
  "date": "20230223T023000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "RB Leipzig 1-1 Man City: Player ratings as Gvardiol cancels out Mahrez strike\nManchester City were pegged back by RB Leipzig in the first leg of their Champions League last 16 in what proved to be a cliched game of two halves in Germany.\nRiyad Mahrez’s 20th Champions League goal gave City a deserved lead midway through the first half, before Leipzig came storming back in the second and were well worth the 1-1 score-line after centre-back Josko Gvardiol scored with his head.\nCity utterly dominated possession from the start without really creating anything, largely due to Leipzig’s defensive discipline on the other side of the ball. A 17th minute free-kick in a good position provided their best chance in the opening quarter, but the effort from Mahrez was a poor one and didn’t even clear the home side’s wall.\nGiven how compact and well-drilled they had initially been, Leipzig will be sorely disappointed with how the City breakthrough came about. It wasn’t liquid football that made it, rather a sloppy turnover from Xaver Schlager deep inside his own half. Gvardiol also misjudged it as Mahrez ghosted through and fired in clinically with his left foot from the edge of the box.\nLeipzig struggled to do much of anything with the ball in the first half and didn’t muster an attempt on goal until Timo Werner tame shot easily saved by Ederson in stoppage time before the interval.\nBut whatever Marco Rose said to Leipzig during the break seemed to light a fire under them, coming out for the second half with the kind of intensity on the ball they hadn’t shown earlier.\nSoon, a looping header from half-time substitute Benjamin Henrichs had Ederson worried enough to dive for it. But if that was a relatively difficult chance, the full-back had a glorious opportunity almost immediately when Leipzig ended up with an overload on the right. But, in acres of space and only Ederson to beat, he failed to even hit the target, dragging the shot wide.\nThe Leipzig pressure continued when Andre Silva turned Manuel Akanji inside out, but Ederson smothered the shot before it became critical for City. There was then a further psychological boost when Christopher Nkunku appeared from the bench.\nFor all City’s early dominance, Erling Haaland had been surprisingly quiet for more than an hour. But a counter attack saw the Norwegian leave Gvardiol in his dust and then scuff a great chance wide.\nHe and his teammates were made to immediately regret it when Dominik Szoboszlai forced Ederson into a top save and then Gvardiol outjumped the static Ruben Dias for an easy close-range header at the resultant corner.\nBeyond an impressive save from Janis Blaswich to push Ilkay Gundogan’s low drive to safety, there were few opportunities in the closing stages as both sides continued to work hard to keep the other in line. However, City felt they should have had a last minute penalty when Henrichs appeared to handle the ball in the box – it wasn’t clear if there was even a VAR check.\nRB Leipzig player ratings (4-2-3-1)\nGK: Janis Blaswich - 7/10 - Stood little chance for Mahrez's opener but made a key save at 1-1.\nRB: Lukas Klostermann - 5/10 - Struggled in the first half and didn't return after the break.\nCB: Willi Orban (c) - 7/10 - Careful with the ball and solid defensively.\nCB: Josko Gvardiol - 6/10 - Poor defensively on more than one occasion, including when City took the lead, but scored a towering header of his own to equalise.\nLB: Marcel Halstenberg - 7/10 - Accurate with the ball and put in an outstanding cross for Gvardiol.\nCM: Konrad Laimer - 6/10 - Had to work extremely hard out of possession.\nCM: Xaver Schlager - 6/10 - Lost the ball so cheaply to undo all his team's early defensive work. Made up for that with a much better second half showing.\nRM: Dominik Szoboszlai - 7/10 - Grew into the game and was massively helped when Henrichs came on at half-time because of the space it created for him.\nAM: Emil Forsberg - 5/10 - Saw precious little of the ball and was quite ineffective as an attacker.\nLM: Timo Werner - 6/10 - Has a point to prove to English audiences after his time at Chelsea and didn't initially rise to that challenge. Made a better go of it in the second half.\nST: Andre Silva - 7/10 - Another who suddenly turned up after break following a quiet first half.\nSubstitutes\nSUB: Benjamin Henrichs (46' for Klostermann) - 8/10\nSUB: Christopher Nkunku (66' for Forsberg) - 7/10\nSUB: Amadou Haidara (82' for Schlager) - N/A\nSUB: Yussuf Poulsen (82' for Silva) - N/A\nSUB: David Raum (89' for Halstenberg) - N/A\nManager\nMarco Rose - 9/10 - Clearly fired his team up during the half-time interval because it was a different side that came out for the second half. Bringing on Henrichs in particular made a major impact.\nMan City player ratings (3-2-4-1)\nGK: Ederson - 7/10 - Had to make a few saves that proved to be important.\nCB: Manuel Akanji - 6/10 - Saw plenty of the ball at his feet with the game in front of him, but went on to struggle when Leipzig took the game to him.\nCB: Ruben Dias - 5/10 - Didn't even get off the ground to challenge Gvardiol fot the Leipzig equaliser. Tried to make the most of soft hands on his shoulders.\nCB: Nathan Ake - 6/10 - Had to deal with the double threat of Szoboszlai and Henrichs.\nDM: Bernardo Silva - 6/10 - Thrives in the deep-lying play-maker role when City have the ball but found himself chasing shadows a little out of possession.\nDM: Rodri - 5/10 - A lot of passes to minimal effect, with a bit of wayward shooting as well.\nRM: Kyle Walker - 6/10 - Occupied a very high position after recently being used as a centre-back.\nAM: Riyad Mahrez - 7/10 - Playing more centrally than he's used to but still continued his excellent goalscoring record in this competition.\nAM: Ilkay Gundogan (c) - 6/10 - Credited for a slightly fortuitous assist.\nLM: Jack Grealish - 6/10 - Looked bright on the left and was directly responsible for making the breakthrough goal when he capitalised on Leipzig's mistake. Had to do a lot more defensive work in the second half to account for the impressive Henrichs and it neutralised him.\nST: Erling Haaland - 4/10 - Didn't touch the ball in the Leipzig box until nearly 70 minutes in. Guilty of then missing a great chance to make it 2-0 just before the equaliser. Ended up getting frustrated with his teammates becaue of a surprising lack of service.\nSubstitutes\nManager\nPep Guardiola - 6/10 - Will have been pleased with the dominance of the first half, even if there weren't a lot of actual chances. Then seemed to lack a response when Leipzig finally arrived.",
  "word_count": 1173,
  "scraped_at": "2026-02-14T01:46:30.525265",
  "_text_extracted": true
}