{
  "article_id": "d71577afe71f",
  "url": "https://theathletic.com/5157588/2023/12/27/oscar-china-shanghai-chelsea/",
  "title": "Chelsea old boy Oscar seven years in the wilderness in China",
  "date": "20231227T063000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "December 2016. The Chinese Super League, after a few upstart years, is entering its golden age.\nA host of international players — Paulinho, Ramires, Ezequiel Lavezzi, Gervinho, Hulk, Burak Yilmaz, Jackson Martinez — are playing for Chinese clubs. They will soon be joined by Carlos Tevez, Axel Witsel, Javier Mascherano, Yannick Carrasco and Alexandre Pato.\nAdvertisement\nFabio Cannavaro, Luiz Felipe Scolari, Manuel Pellegrini and Andre Villas-Boas are among the league’s high-profile coaches.\nOscar is midway through his fifth season at Chelsea. He has played more than 200 games for the club, winning the Premier League and Europa League. He has 48 Brazil caps. He is 25 years old, just coming into his prime. An offer comes in from Shanghai SIPG and he heads east.\nDecember 2023. The Chinese Super League (CSL) is a hollowed-out husk of a competition.\nThat dizzying line-up of famous players? Nowhere to be seen. Now we’re talking Fran Merida, Jurgen Locadia, Joao Carlos Teixeira — and those are the league’s bigger names. You could have cited Marouane Fellaini a month ago, but he has just called time on his Chinese adventure. The talent drain over the past seven years has been nothing short of staggering.\nEveryone of note has jumped ship, in search of better football, better money or both. Everyone, that is, except for one man.\nOscar is now 32. He has just won the fourth league title of his career but to little fanfare. He has not added to those 48 Brazil caps. He is still playing in China.\nIt is one of modern football’s most confounding career paths.\nWhy would a footballer of Oscar’s talent swap the Champions League for relative obscurity? Why would he do it at such a young age rather than wait until he was in his thirties, like most elite players do? And why, even if he felt compelled to make that decision, would he not return to Europe after two or three years, cement his legacy in club football and try to play his way back into the Brazil frame? What is he still doing in the Chinese league?\nWe are not really in the realm of high mystery here. There is, it seems fair to say, a common theme to the answers to these riddles. But the catty digs about money can be a little reductive, obscuring the nuances of the story.\nAdvertisement\nIt is worth remembering at the outset just how good Oscar was in those early days.\nHe exploded onto the Brazilian scene with Internacional in 2011, scoring 10 league goals and earning rave reviews from the local press. Placar magazine put him on its cover shortly after his 20th birthday and dubbed him ‘the Xavi of the grasslands’.\nThat was probably a bit of a reach, but then Oscar was a player who defied easy comparisons.\nHe was not a deep-lying metronome in the Xavi mould and not a pure playmaker either, despite often wearing the No 10 jersey for club and country. He announced himself at Chelsea with a stunning strike against Juventus but was not an explosive goalscorer.\nNo, Oscar was a hybrid.\nHe was good on the ball and made smart late runs into the box, but he was also destructive and tactically diligent. He pressed like a demon. He did not specialise in grand gestures; he made everything flow around him. That was particularly true for Brazil — he was a guaranteed starter for his country between 2012 and 2014, and drew praise from predecessors Zico and Kaka — and during 2014-15, when Chelsea won the Premier League under Jose Mourinho.\nAdmittedly, there was a drop-off in Oscar’s form after that. He, like most Chelsea players, struggled the following season. And when Antonio Conte arrived at Stamford Bridge in summer 2016, Oscar was pushed towards the periphery and began to consider his options. Atletico Madrid, Juventus, Inter and neighbours AC Milan were among the suitors.\n“I was close to joining Atletico but Chelsea refused to sell me,” he told Brazilian website UOL in 2021. “They were asking for €50million or €60m, and nobody was paying that much at the time. Then came a proposal from China. (…) It wasn’t an easy decision, but I was on the bench, and I don’t like to be on the bench.”\nShanghai SIPG — who changed their name to Shanghai Port in 2021 — paid a reported €60million (then around £52m) for Oscar. His wages were said to be in the region of €24m a year after tax; reports at the time estimated that to be a 400 per cent pay rise. It made him one of the best-paid players in world football.\nAdvertisement\n“China has incredible financial power and sometimes makes offers that are hard to refuse,” Oscar conceded in an interview with football media outlet Copa90 in 2017.\n“The Chinese market is a danger for all teams in the world,” said Conte.\nIt is not difficult to understand why Joe Average would be swayed by that kind of money. Things become a bit more cloudy when we’re talking about someone already a millionaire many times over and whose earning power in European football was growing, not shrinking. There is an unavoidable question here: how rich do you really need to be?\nThere is a cultural context to consider. Like so many Brazilian footballers, Oscar grew up poor. His father died in a traffic accident when he was three. His mother, Sueli, raised Oscar and his two sisters alone, making ends meet by selling clothes from her home. Football was salvation — not just for him, but for those he loved.\nSport is, of course, brimming with bad-luck tales and stories of squandered riches. Money disappears quickly. Brazilian footballers often end up supporting huge networks of relatives and friends. How much is enough to guarantee their comfort for generations to come? In the absence of an exact dollar figure, “more” is perhaps the most logical answer. Or at least the most uncomplicated.\nIt is to Oscar’s credit that he was transparent about this.\n“All football players want to earn money to help their families,” he said in that 2017 interview. “When I made the decision to come here (China), I was thinking more of my family than of my career.”\nAt that stage, however, Oscar seemed pretty certain that this was only a temporary thing. “I hope that in two or three years’ time I can go back to a big team in Europe,” he said. “What I enjoy most is playing at a high level. I am still young. I can return.”\nBut he didn’t. Oscar renewed his contract in December 2019, signing on for five more years.\nFrom a timing point of view, this was a stroke of genius. A month later, the Chinese government imposed an individual salary cap of €3million a year for foreign players in the CSL. Hence the swift decimation of the league’s star pool. Oscar, though, was still on an annual salary of €24m.\nAdvertisement\nLook at it from a career perspective, though, and you do wonder about his commitment to “playing at a high level”. Oscar has won two CSL titles, but barely anyone outside Asia has seen him in action in seven years. A footballer who started every Brazil game at the 2014 World Cup has not had a sniff of a call-up since he left Chelsea.\nIndeed, that 2021 interview struck a slightly melancholic note on this very topic. “When I accepted the offer from China I knew that I would be out of the spotlight and out of the Brazil team,” Oscar said. “It took me a while to accept that. Whenever I failed to make the squad, I would look at the list of players called up. I knew I was better than some of them.”\nTite, who coached Brazil between 2016 and 2022, did select players from CSL clubs during that period. Paulinho and Renato Augusto were regulars. But they had both worked with Tite previously — unlike Oscar, who felt his move counted against him.\n“There’s a big prejudice against those who play in China,” he said “It shouldn’t be like that. People look down on players just because they’re here.”\nPortuguese manager Vitor Pereira was in charge at Shanghai SIPG between December 2017 and December 2020. He is well placed to explain the impact that Oscar had on the team — and on Chinese football as a whole. He has particularly fond memories of the 2018 season, when Oscar inspired the Red Eagles to their first national title, scoring 12 goals and setting up 19 more.\n“When he was in form, he could transform games,” Pereira tells The Athletic. “Sometimes in China, players try to counteract natural ability with aggression, so he often had to deal with that, but he had superlative quality.\n“You also need a strong personality to understand the limitations of your team-mates and help them to grow. If you go there with the right attitude, you will make friends and help others improve. That’s what Oscar did. He has done so much for the club over the years.”\nAdvertisement\nThat view is echoed by Edward Still, who served as assistant to Pereira’s successor, Ivan Leko. Oscar, he says, was not just there to relax and pick up a pay cheque.\n“His attitude was fantastic,” says Still. “There was definitely a massive responsibility on him, from a media and supporter perspective. We had some important Chinese players as well, but nothing on his level. All eyes were on him, all the time. Oscar took that responsibility seriously. He really did.\n“He was open-minded, pleasant to talk to and coachable, even there. There was always an open conversation with him about what was being done and his feeling about it. He wasn’t a machine, an absolute killer in training, but he was more than professional, which had a big impact on everybody else. When he was pushing, everybody else would push on.”\nIt is easy to imagine tensions brewing in a squad with such disparities in talent and pay. Still, though, dispels that notion.\n“He was very much a part of the dressing room, not aloof or cut off from the rest of the squad,” he says. “Of course, there was a difference in quality that would cause him frustration sometimes, but that’s what you’d expect. There were no tensions about his salary. None at all. Everyone knew he had played for Chelsea and was a f***ing unbelievable player.\n“It was quite simple: he was so good compared to everyone else that the Chinese players realised that it was good for them as well. He brought quality to the team and the added publicity gave them more visibility. It was a win-win situation for everyone. It wasn’t just him taking all the cash and all the attention; he was making them all better.”\nBoth Pereira and Still say Oscar’s family are settled and happy in Shanghai. “It’s an amazing place to live,” says Still. “His kids are in really good schools. It’s super-comfortable. You can understand the reasons why he would stay out there.”\nAdvertisement\nPereira, who had dinner with Oscar on a recent trip to China, describes the player’s legacy wages as “unreal” but says that the money he’s making is not the only factor. “He adapted very well to life in Shanghai,” says Pereira. “His wife and children like it and they have lots of friends.\n“If he didn’t like it, he wouldn’t be there.”\nOscar has said that numerous clubs outside China have made contact with him over the recent years.\nOne concrete example came at the start of 2023, when Brazilian giants Flamengo offered to take him on loan during the Chinese off-season. Pereira was their manager and fancied a reunion.\n“I tried to take him back to Brazil,” Pereira explains. “We had a sincere conversation and it nearly happened, but the Chinese said no. They were scared of losing him. They preferred to keep him, even with no football to play. They were afraid he would get a taste for football in Brazil, so that was it. He spent months doing nothing when he could have been training and playing.”\nThere was also interest from Barcelona a year earlier. Oscar made no secret of the fact that a move to the Camp Nou would appeal to him. “It’s cool when a big club seeks you out,” he told TNT Sports Brasil. “It would be an incredible opportunity and very good for my career.”\nHe qualified that statement later in the interview — “I still have a contract here and Shanghai do a lot for me; I don’t have anything to complain about” — but it was hard to avoid the feeling that the mask had slipped, particularly when he spoke about his willingness to play for a nominal wage in order to “help the club out”.\nThat came to nothing. Barring a surprise move in January, it now seems inevitable that Oscar will see out his contract at Shanghai Port, which runs until the end of the 2024 Chinese season next November.\nAdvertisement\nAt which point… well, what, exactly? Oscar will be 33 then. It is safe to say that his dreams of playing for Brazil again are doomed, but could there be one final hurrah, in South America or in Europe?\nStill, who worked with Oscar two years ago, believes that fitness would not be a problem. “He could still have played in Europe at that time,” he says. “I have no doubt about that. There is clearly a difference between China and Europe in terms of tempo, intensity and power, so it would have taken him a few weeks to get up to speed, but he was still playing at a good level.”\nOscar himself is of a similar view. “With my body and my style of play, I think I have a great chance of returning to play for a big club in Europe,” he told UOL.\nThe irony, of course, is that if Oscar does join a top Champions League team — and does well — it will damn him. It will only strengthen the nagging feeling that he has sacrificed too much of his talent at the altar of the bank balance.\n“He gave up a bit of his career,” says Pereira, but that is a generous reading. It will, come December 2024, be eight wilderness years.\nIt’s easy enough to tot up his total earnings over that time. Working out the extent to which that number justifies his abdication of elite competition — especially over such an extended period — is a much trickier task.\n(Top photo: Power Sport Images/Getty Images)",
  "word_count": 2456,
  "scraped_at": "2026-02-14T02:13:24.769724",
  "_text_extracted": true
}