{
  "article_id": "d719c4693640",
  "url": "https://www.prokerala.com/news/articles/a1407090.html",
  "title": "Jamshedpur FC take on Mumbai City for AFC Champions League Group Stage spot",
  "date": "20230403T200000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manjeri : , April 4 (IANS) Mumbai City FC, the winner of this season's ISL Winners' Shield, take on their predecessor Jamshedpur FC in the Club Playoffs here on Tuesday with a direct spot in the AFC Champions League Group Stake at stake.\nFootball fans can expect a feisty clash between two top sides as the winner of Tuesday's match at the Payyanad Stadium in Manjeri, gets a direct berth into the AFC Champions League 2023-24 group stage.\nThe two Indian Super League (ISL) sides head into the clash following their Hero ISL League Win'ers' Shield campaigns - Jamshedpur (2021-22) and Mumbai City FC (2022-23). The Men from the Steel City lifted the Shield in 2022, their first-ever silverware, under the tutelage of former head coach Owen Coyle, after registering 13 wins and 43 points in the league season.\nMeanwhile, the Islanders are coming on the back of a massive campaign where they grabbed 14 wins in 20 matches. In Des Buck'ngham's second season in charge, the team went on a record 18-match unbeaten streak.\nWith the lone AFC Champions League group stage spot at stake, both sides will be aiming to bring out their best.\nSpeaking ahead of the clash, Jamshedpur FC head coach Aidy Boothroyd'said, \"It's great to be back. The players have been training really hard on their f'tness. We've managed to get the players back to the physical condition they had .\" On the challenge of facing Mumbai City FC, Boothroyd stated, \"W' feel there's a bit of unfinished business wit' Mumbai. It'll be a tough game 'ecause they're a really good team, Shield Win'ers, but we're really looking forward to it.\" Returning to action after a memorable season, Mumbai head coach Buckingham spoke about the mood in the camp. \"The atmosphere in the dressing room is'very good. We've done extremely well during the season, broken many records and have played some wonderful football.\" In the recently concluded season, Jamshedpur and Mumbai City played out a 1-1 draw at the Mumbai Football Arena with Lallianzuala Chhangte and Daniel Chima Chukwu getting on the scoresheet. In the second leg, however, the Islanders got the better of Jamshedpur. The eventual \"Hero of the League\", Chhangte, once again found the back of the net, while Vikram Partap Singh scored the second goal to give his team a 2-1 victory.\nPraising the 25-year-old winger, Buckingham said: \"Chhangte will be very important for us tomorrow, whether he scores, provides an assist, or is involved in a combination play between 'he front five. He'd play a major part alongside many others in making sure we can be successful tomorrow.\" The Islanders, who participated in the previous edition of the AFC Champions League, will be looking to take a step forward. In 2022, the team defeated Al-Quwa Al-Jawiya, also known as Air Force Club, to become the first-ever Indian club to register a victory in the group stage of the competition. To make it sweeter, they recorded two wins against the Iraqi side and finished second in Group B.\nThe Englishman concluded his testimony by saying, \"It's an opportunity for an Indian club to go and represent not just the area they're from, but Indian football on that stage. If we're able to do that again and show what Indian football can do on that stage against Asia's best, we'll be doing everything we can to try and do that.\"",
  "word_count": 567,
  "scraped_at": "2026-02-14T02:09:52.184450",
  "_text_extracted": true
}