{
  "article_id": "d721d189dfd2",
  "url": "https://punchng.com/i-had-nightmares-playing-against-messi-at-2014-world-cup-onazi/",
  "title": "I had nightmares playing against Messi at 2014 World Cup – Onazi",
  "date": "20230226T044500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In this interview with JOHNNY EDWARD, Bahrain-based midfielder Ogenyi Onazi, a member of the 2013 Africa Cup Of Nations-winning Super Eagles squad, opens up on his move to the Middle East, his Coppa Italia triumph Messi, Eagles and more\nWhy did you opt to join Istrifa in Bahrain?\nComing to Istrifa is just about the coach needing me to get the team to where they are supposed to be because they are trying to build a team that will be able to compete in the Asian Champions League. So, when he spoke to me, I told him it’s not an option I wanted to consider but for the things he told me, and the responsibilities he handed to me. It was not about the money or about the moment, I just wanted to play for the remainder of the season before deciding where I really wanted to go. So, I came here to help them.\nVictor Osimhen is the hottest Nigerian footballer currently at the moment. What do you make of his form for Napoli?\nWhen he came into the Super Eagles, I told him that the responsibilities and the things that will keep him up in the game is to score goals. I was with him sometime ago and he said it in the presence of his brother and sister that I told him the truth back then. Osimhen will do even more than what he is doing at the moment because he is determined and with his level of concentration and hunger to excel, he will never get it wrong. In the world now, he is the most in-form man, and the world is yet to see what he has in him. I love his mentality; he is a professional and listens to things that will make him better. Although a lot of people say he is a cruise boy because of what he posts on social media, I think he is only doing those things for fun. He doesn’t joke with training, very serious, humble and ready to learn.\nNapoli are currently leading Serie A with 15 points and with 16 games left to play. Do you think the Partenopei can win their first league title in over 30 years?\nThere is no doubt about that, they are winning. I am already making preparation for the league celebration of Napoli. He (Osimhen) has even told me that I must be there when they win. I played for Lazio and support Lazio, but the league is Napoli’s this year.\nHow were your years at Lazio?\nLazio is a club I won’t forget in my entire life. I didn’t have issues with the fans even in the heat of racism. During my time there, I gave my all and they appreciated it. Lazio was the club that brought me out for the world to see me and they are one of the biggest in the world. If I had another opportunity, I would play for Lazio again.\nYou were a member of the Lazio squad that won the Coppa Italia in the 2012/13 season. What was it like back then winning that title?\nWinning that title was more because it was a derby (against AS Roma) and we won it. So it was a double dose. The Cup final was tense and we had a lot of fans at the training ground. In fact we had to leave the city of Rome to train so we could concentrate. I think was I was supposed to go the national team after the final, but the celebration was so much that we were locked up in a place at the airport. I had to be taken from the roof to the airport. For me, to win a title against your rivals was one of the best feelings I had as a player at club level, it’s so sweet. So, I can’t quantify how much that trophy means to me.\nHow do you rate the current Eagles squad with the array of talents at the disposal of coach Jose Peseiro?\nThey are all talented young players and they are all my boys and I encourage them in the best way I can. The Super Eagles attack now is on fire. The coach has a lot of choices at his disposal. At this point, when you have this crop of talented strikers, you just need to make the right choices and the right striker to use at a particular time. For sure, he has a lot of options and I wish all of them the best. If you are the Eagles’ coach at the moment, you will be confused. I really don’t know what to say because the national team football is different from club football. It takes someone who is smart to adapt immediately in a national team. I understand it’s quite a challenging situation to the young ones who are there but it all boils down to concentration. There is so much pressure in the national team than the clubs because you don’t have the opportunity of playing more games to be able to show what you can do. You only have one or two games in the window. It’s only tournaments that give more playing time. Once you adapt quickly, the better for you.\nWhat was the experience like playing against Argentine megastar Lionel Messi at the 2014 World Cup?\nI had nightmares playing against Messi at the 2014 World Cup. Three days before our final group game against Argentina, we (Eagles players) were thinking of how we could stop him. I remember I was analysing the Argentine attack in my room back then. They had Kun Aguero, (Angel) Di Maria, (Gonzalo) Higuain and of course Messi in attack. And we were confident in ourselves, but when the game started, he was just like a spirit, he didn’t even say anything, he walked onto the pitch waiting for the right moment and when that time came, he disappeared with lightning pace and we kept running to catch up with him. Sometime ago on my device, I reviewed the game to see how we managed to curtail him. About three of us would chase him down but he would still glide past us. In Nigeria, we will say ‘No be juju be that?’. At some point, we cut some passes, made good tackles to break their play, but despite that we conceded a goal through him. He also scored a wonderful free-kick in that game as well. Messi is just the best.\nHow pleased were you seeing him win the World Cup in Qatar?\nI was actually surprised that Argentina won the World Cup. I was tipping France to win the title, not really because of Kylian Mbappe. No doubt, he is a superb talent as well. He has all it takes to be the best but for me he has to pay attention to his attitude. I supported France because of their collective effort. Firstly, I tipped Brazil, but I switched after the first two games because of the abundant talents they had. It was just too much and they didn’t look and play like a team hungry for the World Cup title. They were not serious. Imagine the Manchester City goalkeeper, Ederson, was on the bench for them. From defence to attack, they had quality players all through.\nWhat do you make of the January transfers of Nigerian players?\nI am really pleased with the transfer of Paul Onuachu to the Premier League. It was long overdue. The last time we spoke, he told me he was waiting for the right time. He has been doing so well in Belgium and a move to Southampton is the next step in his career. It is a huge responsibility for him and he must be consistent in scoring goals. He joined a club under pressure because of their position on the table and in England, you go from 100 per cent work rate to 120 because of the pressure. There are a lot of talented players who didn’t survive the pressure of the Premier League because of the expectations, but I believe he can.\nWhat do you make of the Niheria Progessional Football League?\nIt’s quite frustrating to see the way our football is being managed. We say these things all over again but nothing happens. A lot still needs to be done for our football development. But I think right now, the country has to be fine before we start fixing our football again because I don’t think football can even work in the present situation. There are so many factors affecting it.",
  "word_count": 1443,
  "scraped_at": "2026-02-14T01:46:30.518906",
  "_text_extracted": true
}