{
  "article_id": "d72d7153d91a",
  "url": "https://www.nytimes.com/athletic/6613235/2025/09/30/turkey-seuper-lig-spending-2025/",
  "title": "Osimhen , Ederson , Asensio , and a total outlay of €348m . Why are Turkish clubs now spending so big ? ",
  "date": "20250930T050000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Turkish football transfers used to be more of a punchline than a big news story.\nPlayer X is having a shocker today, he’ll be off to Turkey soon, etc. From Darius Vassell to Jonjo Shelvey and Danny Drinkwater at one end of the market, to Roberto Carlos and Robin van Persie at the other, the Turkish league was a place where footballers were put out to pasture.\nAdvertisement\nAt the same time, their bank balances and/or retirement funds would usually have been generously bolstered. Competitive wages have generally not been a problem for Galatasaray, Fenerbahce and, to a lesser extent, Besiktas — Turkey’s big three, all based in Istanbul, the country’s biggest city.\nBut now something different is happening.\nIn the summer 2025 transfer window, the Turkish Super Lig registered the third-highest net transfer spend in world football, behind only the Premier League and Saudi Pro League.\nAccording to figures from Transfermarkt, Turkey’s big three spent €276million (£241m, $323m) between them, accounting for 80 per cent of a total league spend of €348m, the seventh highest in the world game.\nGalatasaray, who host Liverpool in the Champions League on Tuesday, spent more than Paris Saint-Germain, Bayern Munich and Inter. They also surpassed the previous record transfer for the Turkish league on three occasions, when buying defender Wilfried Singo from Monaco (€30.8m), Turkey’s first-choice goalkeeper Ugurcan Cakir from Trabzonspor (€27.5m) and Victor Osimhen from Napoli (€75m), while free agent Leroy Sane also joined on big wages after leaving Bayern.\nFenerbahce spent a decent amount too, including €22.5million to Benfica for Kerem Akturkoglu, plus the additions of Ederson, Marco Asensio and Jhon Duran (on loan).\nSo what is behind the spending increase? And does the Turkish league have the potential to challenge Europe’s established powerhouses?\nThe standard of the Super Lig overall is rated as being surprisingly low, considering the number of recognisable players in it.\nThose names include Ilkay Gundogan, Mauro Icardi, Andre Onana, Tammy Abraham, Edson Alvarez, Wilfred Ndidi, Lucas Torreira, Fred, Jota Silva, Rafa Silva, Nelson Semedo and Youssef En-Nesyri, while Jose Mourinho and Ole Gunnar Solskjaer were recently in charge of Fenerbahce and Besiktas respectively.\nAdvertisement\nOpta ranks the division as only the 20th best in the world, below the top divisions in Sweden, Poland and Japan, and the second tiers in England (the Championship) and Italy (Serie B).\nThat is more a reflection of your Kocaelispors and Kayserispors in what is a fairly closed shop in terms of the title winners. This summer’s splurge will only cement and widen that gap between the top few and the rest. What Galatasaray and Fenerbahce in particular want to do, though, is not just outdo each other domestically, but start to compete properly in Europe again. It’s been a while.\nBoth clubs hope that by taking advantage of Istanbul real-estate deals and an easing of their spiralling debt burdens, they can do just that.\nGalatasaray helped fund the remarkable Osimhen deal by selling their training ground to the Istanbul Metropolitan Municipality (IBB) — the governing body of the city.\nFigures vary, but estimates suggest that by selling the Florya site, in what is an upmarket, elegant, seaside area, Galatasaray generated €480million, with a €42.8m down payment, while at the same time moving further north to Kemerburgaz, which is much nearer to their stadium. Galatasaray also ended a credit restructuring process in July, settling long-standing debts and interest payments. The country’s top clubs have been saddled with sizeable debts for years and while the Florya sale offered a temporary boost, paying off Turkish bank loans which were due by 2030 should make a tangible, long-term impact on Galatasaray’s finances.\nThe Osimhen deal is a game-changer in terms of numbers, but Galatasaray will also see it as an investment in a player who, if he repeats his 2024-25 heroics for them, could be worth even more next year. While on loan from Napoli, the Nigerian scored 37 goals in 41 matches in all competitions and is in his prime, aged 26. Still, smashing the league record by more than €50million (the previous highest transfer was set by Fenerbahce when they signed En-Nesyri from Sevilla for €20m last summer) is a risk.\nAdvertisement\nOsimhen will have been persuaded his immediate future lay in Turkey and not, say, England, by Galatasaray paying him €15m a year, plus image rights of €5m. That is almost €400,000 per week. Add in Turkey’s more favourable tax rate, which undoubtedly helped lure Sane, who is thought to be on similar wages to Osimhen, and you can see why players of a good age (Sane is 29) and not just football-pensioner age are moving to Turkey.\nFenerbahce’s situation is similar; they too sold land, they too eased their debts.\nThe land was, reported Turkiye Today, a 61,000 square metre plot owned by the club in the Atasehir district, which was expected to generate €90million. At the same time, Fenerbahce exited a debt restructuring programme with the country’s Banks Association. The club hailed the move as a turning point which would allow them to shape their own future, proclaiming: “This decision is not merely a financial choice; it is Fenerbahce’s manifesto of independence.”\nAs former club president Ali Koc recently stated, before he was ousted in their latest round of elections, Fenerbahce also have 10-year sponsorship agreements worth €160million and increased their revenues from €175m to €350m. A summer of impressive signings has followed, including Sofyan Amrabat (€12m), English youngster Archie Brown (€8m), Milan Skriniar (€7m) and Mali forward Dorgeles Nene (€18m), as well as Ederson, Asensio and Akturkoglu for big fees, ex-Wolves captain Semedo on a free and Duran on loan.\nWith both clubs strengthening their squads so meatily, the pressure is on in not just the title race but also in Europe.\nDomestically, Galatasaray are not exactly starting from scratch, having won the past three league titles and earning 95 points last year and 102 the year before.\nThey have started this domestic season in similar fashion, winning seven games out of seven while scoring 21 goals. However, an abysmal 5-1 defeat at Eintracht Frankfurt in their opening league-phase match of the Champions League shows how far behind even Europe’s second-tier teams Galatasaray have fallen.\nThat reflects a trend across Turkish clubs. Since Galatasaray won the old UEFA Cup (today’s Europa League) in 2000, beating Arsenal on penalties in the final, only one team from Turkey has reached the semi-final of any European competition, namely Fenerbahce in the 2012-13 Europa League, the same season Galatasaray made it to the Champions League quarter-finals.\nAdvertisement\nFenerbahce have not played in the Champions League proper since 2008-09, and their failure to reach this season’s league phase was the final straw when it came to ditching Mourinho, albeit he was handed a very tough draw for the qualification play-offs against, ironically, his new employers Benfica, and they were beaten 1-0 on aggregate. Successor Domenico Tedesco, last seen managing the Belgian national team, lost his opening Europa League match 3-1 at Dinamo Zagreb last week.\nSolskjaer lost his job at Besiktas for the same reason as Mourinho after a Conference League qualifying play-off defeat by Swiss side Lausanne-Sport, despite the summer additions of Abraham, Ndidi and Portuguese midfielder Joao Maria.\nTurkish football, then, has plenty of ground to make up, but in the easing of their debt burdens, there is hope that Fenerbahce and Galatasaray can add substance to the style of their big summer spending.\nCan a country notorious for going through club presidents, managers and players like someone with a growling stomach going through a tray of delicious baklava make consistent, stable progress? It will require patience and long-term planning, qualities Turkey is not notorious for.\nThe Turkish league has always been worth keeping an eye on for its volatility and soap-opera storylines.\nWith some savvy recruitment and long-term planning to go with its improved finances, it might be worth watching for the football now, too.\n(Top photo of Victor Osimhen after his July move to Galatasaray: Arife Karakum/Anadolu via Getty Images)",
  "word_count": 1341,
  "scraped_at": "2026-02-14T02:09:24.916313",
  "_text_extracted": true
}