{
  "article_id": "d7344fe1fd1e",
  "url": "https://www.caughtoffside.com/2023/05/19/i-was-pushing-frank-lampard-wanted-erling-haaland-whilst-manager-of-chelsea/",
  "title": "  I was pushing  - Lampard wanted Haaland whilst manager of Chelsea",
  "date": "20230519T184500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea interim manager Frank Lampard has stated that he wanted to sign Erling Haaland during his first stint at the West London club but a move never happened.\nThe former midfielder was in charge of the Blues from 2019 to 2021 and it is likely the Red Bull Salzburg version of the Norway striker the Chelsea boss wanted – as the striker lit up the Champions League during the 2019/20 campaign.\nSpeaking during his press conference today, Lampard told the media that he wanted Haaland during his first stint as Chelsea manager.\n“I was pushing big to have Erling Haaland at Chelsea. I’m not sure what the appetite was at the club,” the former Everton boss said via Fabrizio Romano.\n“The competition was big because he was an outstanding player. The buyout clause was reasonable. I don’t know how close it was… but I wanted him”.\nLampard reveals: “I was pushing big to have Erling Haaland at Chelsea. I'm not sure what the appetite was at the club”. ? #CFC\n“The competition was big because he was an outstanding player. The buyout clause was reasonable. I don't know how close it was… but I wanted him”. pic.twitter.com/rww8pv0mNe\n— Fabrizio Romano (@FabrizioRomano) May 19, 2023\nLampard is now the second person to recently say this after Ole Gunnar Solskjaer admitted that he wanted to sign his fellow countrymen for just £4m when he was manager of Man United.\nHaaland has taken the Premier League by storm this season and has developed into one of the best players in world football and would make a difference to most teams. It is easy for both managers to say this now, but it is coming from two managers who have failed in their previous roles and are now trying to make it sound better by stating that their boards at the time did not sign the striker.",
  "word_count": 313,
  "scraped_at": "2026-02-14T02:24:42.735141",
  "_text_extracted": true
}