{
  "article_id": "d7413f3e90e8",
  "url": "https://www.uefa.com/uefaeuropaleague/news/0285-18e0746ef630-5128dfa91eb5-1000--group-stage-what-to-look-out-for/",
  "title": "What to look out for in the UEFA Europa League group stage | UEFA Europa League",
  "date": "20230901T203000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What to look out for in the UEFA Europa League group stage\nFriday, September 1, 2023\nArticle summary\nBrothers will be on opposing sides in Liverpool's latest European campaign, while 1981 winners Ajax have their work cut out in Group B.\nArticle top media content\nArticle body\nThe 2023/24 UEFA Europa League group stage draw produced numerous intriguing match-ups, including a battle between brothers in Group E and an intriguing Group B.\nIn this piece presented by Enterprise Rent-A-Car, we pick out some key talking points ahead of the campaign. Remember: Every mission matters.\nWhen are the Europa League group stage games?\nMatchday 1: 21 September 2023\nMatchday 2: 5 October 2023\nMatchday 3: 26 October 2023\nMatchday 4: 9 November 2023\nMatchday 5: 30 November 2023\nMatchday 6: 14 December 2023\nWhat to look out for\nSibling rivalry in Group E\nThree-time competition winners Liverpool will be confident of progressing to the knockout stages after being drawn against LASK, Toulouse and 2022/23 quarter-finalists Union Saint-Gilloise. The Reds have met the French club once before, winning 5-0 on aggregate in the UEFA Champions League third qualifying round in 2007/08, while there are likely to be mixed feelings in the Mac Allister household when Reds midfielder Alexis faces his brother, and Union SG defender, Kevin.\nJürgen Klopp guided Liverpool all the way to the Europa League final in his first season at Anfield, memorably beating Dortmund in the quarter-finals before losing to Sevilla in the Basel decider. Champions League finalists in three of the past six seasons, the Premier League side will be eager to add a fourth UEFA Cup/Europa League title having lifted the trophy in 1973, 1976 and 2001 crowns.\nSeagulls aiming to soar\nIn one of the most intriguing sections, 1992 winners Ajax take on three-time runners-up Marseille as well as AEK Athens and debutants Brighton in Group B. The former pair have locked horns in the knockout stages of several UEFA competitions down the years, Ajax triumphing in the second round of the 1971/72 European Cup on their way to taking the trophy and the quarter-finals of the 1987/88 European Cup Winners' Cup. Marseille gained a measure of revenge in the 2008/09 UEFA Cup last 16, winning an enthralling tie after extra time.\nNeither side will hold much fear for Greek champions AEK and a Brighton outfit who have blossomed into one of the continent's most exciting teams under Italian coach Roberto De Zerbi. Having given some of the Premier League's strongest sides a run for their money en route to a club record sixth-place finish last term, the Seagulls will be relishing the prospect of tackling some of the continent's biggest names.\nBeaten finalists go again\nHaving fallen victim to seven-time winners Sevilla in Budapest in June, inaugural Europa Conference League winners Roma's new bid for European glory begins with games against Slavia Praha, Sheriff and Servette. The Giallorossi and Slavia went shoulder to shoulder in a memorable quarter-final in 1996, former Manchester United winger Karel Poborský scoring in the Czech club's 2-0 first-leg triumph before Jiří Vávra's extra-time away goal in the return booked Slavia's place in the last four.\nSlavia's city rivals Sparta renew acquaintances with Rangers, having faced the beaten 2021/22 finalists in that season's group stage. Dávid Hancko's header earned Sparta a narrow 1-0 win in the Czech capital but an Alfredo Morelos double gave the Gers a 2-0 triumph in Glasgow which sent Giovanni van Bronckhorst's team into the knockout stages at their opponents' expense.\nWhere is the 2024 UEFA Europa League final being played?\nThe 2023/24 UEFA Europa League season will conclude at Dublin Arena in the Republic of Ireland on 22 May 2024.\nWith a capacity in excess of 50,000, Dublin Arena is the home of the Republic of Ireland's national football and Ireland's rugby union team. First opened in 2010, the stadium will be staging its second UEFA Europa League decider, having been the venue for the all-Portuguese final of 2011 between Porto and Braga, when Radamel Falcao scored the only goal as the Dragons took the trophy.",
  "word_count": 680,
  "scraped_at": "2026-02-14T02:10:09.466707",
  "_text_extracted": true
}