{
  "article_id": "d74ba486109e",
  "url": "https://thepeoplesperson.com/2024/03/29/erik-ten-hag-says-kobbie-mainoo-is-a-doubt-for-man-uniteds-trip-to-brentford-278196/",
  "title": "Erik ten Hag says Kobbie Mainoo is a doubt for Man United trip to Brentford - Man United News And Transfer News",
  "date": "20240329T233000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag says Kobbie Mainoo is a doubt for tomorrow’s Premier League tie with Brentford at the Gtech Community Stadium.\nSpeaking at the pre-match press conference ahead of the match, the manager confirmed that the 18 year old missed training yesterday due to illness. He said he did turn up for training today but that he has not “fully recovered yet” but there is hope he will be fit for Brentford tomorrow.\n“I don’t know, we hope. Today he is here, not fully recovered but we still have many hours before tomorrow with kick off at 8pm,” Ten Hag said.\nThe manager also said that there is better news for Casemiro, who is making “good progress”.\nAnswering further questions about Mainoo, Ten Hag disclosed that after last season’s Carabao Cup triumph he told the youngster “your day will come. We are going to win trophies together and your day is coming when you will be part of it on the pitch.\n“We are going there together and with this club. We are here to win titles. Take this moment, this experience and now you know what you are fighting for.”\nThe boss was also asked about Marcus Rashford and whether his place in the England team is under threat.\n“The final decision is up to the manager of England but of course he knows there is a lot of competition in his position and of course he will have a lot of credit because he contributed so many times fantastically for England and for us,” he said.\n“Of course, he wants to be there but also he wants to win with us, he wants to win trophies and he is in a position to win a trophy. He wants to be in the Champions League. Absolutely he wants to contribute and he wants to perform.\n“He is improving during the season. The last three games he scored three goals.”\nAnother reporter asked about the status of Anthony Martial, who has been absent for several weeks with a groin injury, and whether he would ever play for United again.\n“Martial is back on the pitch as well but not in the team yet,” Ten Hag replied. “It depends on him [if he plays again] – how quick is he back and what are the levels that he is showing?”\nThe boss was encouraged overall by the reduction in injuries, saying “the good news is that it looks like players are returning. So, by the end of the season, in the final 10 games to go in the league, hopefully two in the cup, we can have a squad covering all the positions. Then, it can be a very good end of the season.”\nHe was also asked about the speculation surrounding his own future as manager of United.\n“When you are working in top football, you get used to it,” he said. “So we don’t care. Players don’t care. I don’t care. We are together in the boat and we know we have to perform and get the right results.”\nTen Hag’s comments from the first part of the presser are available here.\nTomorrow’s match kicks off at 8pm.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 550,
  "scraped_at": "2026-02-14T02:25:26.774101",
  "_text_extracted": true
}