{
  "article_id": "d761e1c2ac2b",
  "url": "https://www.fourfourtwo.com/news/is-nottingham-forest-striker-chris-wood-injured-premier-league-injury-update-",
  "title": "Is Nottingham Forest striker Chris Wood injured ? Premier League injury update",
  "date": "20250410T163000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Is Nottingham Forest striker Chris Wood injured? Premier League injury update\nImpressive Nottingham Forest face Everton next but is Chris Wood fit?\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nChris Wood has been in magnificent form this season, but has missed the last two games.\nNottingham Forest are edging closer to what would be an unexpected – but throughly deserved – return to the Champions League. They are currently third, and four points clear of fourth-placed Chelsea, with just seven games left, and it looks like Nuno Espirito Santo will be bringing continental football back to the City ground for the first time since 1996.\nThey next come up against a resurgent Everton, who under David Moyes look to have secured their Premier League status for another year – just in time for their move to the brand new stadium at Bramley-Moore Dock. Forest will be aiming to pick up yet another three points, but will their main talisman be fit to face the Toffees?\nIs Chris Wood available this weekend?\nChris Wood is enjoying a personal best Premier League season, with the 18 goals he has scored four better than any campaign he has previously had. He has only ever scored more in a league campaign once in his career when he netted 27 times for Leeds in the 2016/17 Championship season.\nHe hasn't featured in either of Nottingham Forest's last two games after suffering a hip injury, and Nuno is hoping to have him back as soon as possible.\nSpeaking in his pre-match press conference, Nuno said: “We are still assessing all of them [Chris Wood, Anthony Elanga & Taiwo Awoniyi]. They are struggling with problems – some small, some not so small – but we have to assess them. We have one more day and then we’ll see if they can be available for the game.\n“On all of them [I am hopeful]. It can be all of them, it can be none. We don’t know. It depends on how they recover and how they feel. It’s about that.\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAfter facing Everton, Forest face two trips to north London, once to face Tottenham, and then to Wembley for their FA Cup semi-final against Manchester City. The fixture may therefore come too soon for Wood as Forest look to head to Wembley in the best shape possible.\nEwan is a freelance writer and social media manager who has worked for The Athletic, GOAL, 90min and OneFootball. From Gelsenkirchen to Riyadh, he has covered some of the biggest games in football in his three years in the industry.",
  "word_count": 546,
  "scraped_at": "2026-02-14T02:26:33.618980",
  "_text_extracted": true
}