{
  "article_id": "d763980e6f3b",
  "url": "https://tribune.com.pk/story/2401912/qatar-sheikh-bids-for-manchester-united",
  "title": "Qatar sheikh bids for Manchester United",
  "date": "20230218T170000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Qatar sheikh bids for Manchester United\nAl Thani confirms ‘submission of bid for 100 percent’ ownership, in a press release\nA consortium led by a Qatari banker announced Friday it had submitted an offer to take full control of Manchester United, with British billionaire Jim Ratcliffe also reported to have lodged a bid.\nSheikh Jassim Bin Hamad Al Thani \"today confirmed his submission of a bid for 100 percent of Manchester United Football Club\", his press release said ahead of Friday's \"soft\" deadline for bidders.\nRatcliffe's company Ineos is the only other bidder to have officially declared an interest, keen to expand a sporting portfolio that already includes French side Nice and Swiss team FC Lausanne-Sport, as well as the cycling team Ineos Grenadiers, formerly Team Sky.\nThe Daily Telegraph reported late Friday he had told Raine Group, the US merchant bank conducting the sale, that he could be the club's \"long-term custodian\".\nA BBC report said Ratcliffe had submitted a bid before the 2200 GMT deadline.\nA bid from Saudi Arabia had also been expected.\nThe statement from Sheikh Jassim, chairman of Qatar Islamic Bank (QIB), did not give any details on the amount proposed in the bid for United.\nHowever, the price could reach a record $6 billion, according to reports.\nThe bid announced Friday will be \"completely debt free\" via Sheikh Jassim's Nine Two Foundation, which will \"look to invest in the football teams, the training centre, the stadium and wider infrastructure, the fan experience and the communities the club supports\".\nThe club's current owners, the US-based Glazer family, announced in November they were open to a sale of or investment in the record 20-time English champions, prompting talk of a bidding war between Qatari and Saudi Arabian interests.\nBut with United's shares traded on the New York Stock Exchange (NYSE), brokers acting for the club will be obliged to consider offers even after Friday's \"soft\" deadline.\nUnited shares rose by close to two percent in after-hours trading following the Qatari bid announcement. They had closed down 1.9 percent on Friday.\nBoth Ratcliffe and 41-year-old Sheikh Jassim, educated at Britain's elite Royal Military Academy at Sandhurst, claim to be boyhood United fans.\nA takeover by either could raise questions of competition given the Brit's ownership of Nice and Qatar's control of French champions Paris Saint-Germain.\nUEFA competitions such as the Champions League and Europa League do not allow two clubs to enter if the owner of one also controls, or could have influence over, the other.\nBut a statement issued late Friday on behalf of Sheikh Jassim stressed he was a private individual with no links to the Qatar Sports Investment group that owns PSG.\nAny Saudi Arabian investment in United would prompt outrage from human rights groups, who have spoken out against the Gulf state following the 2018 murder of journalist Jamal Khashoggi.\nA Qatari takeover would be opposed on similar grounds, with Peter Frankental, Amnesty UK's economic affairs director, saying it would represent \"a continuation of this state-backed sportswashing project\".\nDeeply unpopular with supporters since they saddled the club with huge debts in the £790 million ($961 million) 2005 takeover, the Glazers further angered fans by backing the failed European Super League project in 2021.\nThe Telegraph reported that sources close to Saudi Arabia's Public Investment Fund (PIF) were playing down the likelihood of a state-backed bid given their existing involvement with rival Premier League club Newcastle United.\nA sale price of $6 billion for the three-time European champions would smash the record fee for a football club, set by Chelsea last year.\nA consortium led by LA Dodgers co-owner Todd Boehly and private equity firm Clearlake Capital paid £2.5 billion for the Blues, with a further £1.75 billion promised in further investment in infrastructure and players.\nUnited, one of the most successful clubs in English football history, have not won the Premier League since 2013 and have failed to win any silverware since 2017.\nThey sit third in the Premier League, after an improvement in form under manager Erik ten Hag, who took over before the start of the current campaign.\nUnited are set to face Newcastle in the League Cup final at Wembley on February 26.\nOn Thursday, United drew 2-2 at Barcelona in the first leg of a Europa League knockout round play-off tie, with Ten Hag insisting the speculation about the club's future would not prove a distraction to his side.\n\"We are following it,\" Ten Hag said. \"It's our club... But we are focusing on football, on training and our way of play, on games.\"\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 789,
  "scraped_at": "2026-02-14T02:16:35.952070",
  "_text_extracted": true
}