{
  "article_id": "d78061e51dbe",
  "url": "https://thechronicle.com.gh/new-format-uefa-europa-league-starts-today-2/",
  "title": "New Format UEFA Europa League Starts Today - The Ghanaian Chronicle",
  "date": "20240926T140000Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Roma face Athletic Bilbao in their Europa League opener\nSeeking a successful return to the continental stage, Roma meet Athletic Bilbao in their Europa League opener, as they get their campaign under way on Thursday evening.\nThe clash at Stadio Olimpico will be the teams’ first meeting in UEFA competition, coming as the hosts have switched managers and their Basque visitors have run into top form.\nRoma won the inaugural Conference League trophy under Mourinho just over two years ago, and they also have a strong recent record in Europe’s second-tier tournament.\nRoma have lost just three of their last 18 Europa League matches – winning half – and across seven home games in the competition last season they suffered only one setback.\nHowever, the capital club will head into Thursday’s game having won just one of their last eight against Spanish sides, of which Athletic Club will become the 10th they have faced.\nWhile Roma are regulars in UEFA competition, Athletic last featured on the European stage back in 2018, when they were knocked out in the Europa League’s last 16 by Marseille.\nThe Bilbao club lost their last three games of that campaign, and six years on they will be keen to avoid losing four consecutive European ties for the first time in their history.\nNow that Ivan Juric has taken the reins at Roma, the home side should be harder to beat, so Athletic Club’s wait for a win on the Italian peninsula may go on.\nBoth teams would probably settle for a point from one of their tougher league-phase contests, with much friendlier fixtures awaiting either side next month.\nCredit: sportsmole.co.uk\nTottenham return to Europea as they host Qarabag\nTottenham Hotspur make their return to European competition when they welcome Azeri champions Qarabag FK to North London in the Europa League on Thursday.\nTottenham coach Ange Postecoglou will have been delighted to see them drawn at home against their upcoming opponents, avoiding the long-haul trek across Europe and into the Asian border in Azerbaijan.\nIt has been something of an underwhelming start for Tottenham in both league and cup so far this season, as they sit in mid-table after five Premier League games. While the home faithful will be glad to have European football back at the Tottenham Hotspur Stadium, the Champions League is what they desired, so losing out to Aston Villa was a huge disappointment.\nSpurs have been woeful on the continent, failing to score in either leg of their last 16 defeat to AC Milan in the 2022-23 Champions League.\nThe season previous, Spurs were eliminated in the Conference League group stage, just months after being knocked out of the Europa League by Dinamo Zagreb.\nOn the other hand Qarabag had their best European campaign to date, and they were just minutes from a historic win to reach the quarter-finals of this competition. Qarabag have, however, lost all six of their previous meetings against English clubs, including two against Spurs back in 2015.\nQarabag rarely travel well, and their record against English clubs is damning, with six losses from six, and there is little to suggest they can arrest that run here.\nSpurs should still have more than enough firepower to record a routine matchday one victory here.\nCredit: sportsmole.co.uk\nAjax welcome Turkish giants Besiktas\nAiming to add a 2024-25 triumph to their illustrious European history, Ajax will start their Europa League campaign with the visit of Turkish giants Besiktas to Johan Cruijff Arena on Thursday night.\nDe Godenzonen are coming into this clash following a lacklustre draw in the Eredivisie on the weekend, whilst the Black Eagles enjoyed a dramatic victory in the Turkish Super Lig.\nDespite their lowest league finish since the turn of the century last campaign, a fifth-placed standing for Ajax in the Eredivisie was still good enough to earn a spot in the qualification rounds of the Europa League, with the Dutch powerhouses working overtime in the summer to book their place in the League Phase of the competition.\nSince returning to action following the September international break, Ajax have collected a respectable total of four points from a pair of Eredivisie contests.\nWith influential attacker Steven Bergwijn and Carlos Forbs leaving the club over the summer, Ajax needed to acquire reinforcements on the flanks during the transfer window, with former Aston Villa forward Bertrand Traore joining on a two-year deal.\nBesiktas head coach Giovanni van Bronckhorst is now looking to add continental silverware to his managerial CV, with the 49-year-old losing the Europa League final in 2022 as Rangers boss to Eintracht Frankfurt. Besiktas are also restricted at the back ahead of Thursday’s clash, with defender Necip Uysal sidelined until the middle of November because of a ligament injury.\nAjax have won back-to-back home matches by an aggregate scoreline of 8-0 recently, although the visit of Besiktas should pose a much sterner test for the Dutch giants on Thursday.\nCredit: sportsmole.co.uk\nRangers get campaign underway with a trip to face Malmo\nRangers get their Europa League campaign underway when they make the trip to Sweden to face Allsvenskan leaders Malmo on Thursday.\nPhilippe Clement‘s side have made an underwhelming start to the season, which they hope to rectify with a good showing on the continent.\nBoth clubs came up short in their attempts to reach the Champions League this season, losing in the qualifiers, but Malmo’s form since their playoff elimination has been excellent.\nHenrik Rydstrom‘s side are cruising to the title in Sweden, and they have not conceded a goal in four league games since losing to Sparta Prague at the end of August.\nAfter missing out on Europe entirely last season though, playing eight games throughout the autumn and the winter will be most welcome, but they will hope to improve on their group-stage exit in the 2022-23 Europa League.\nBeing drawn against Rangers and Slavia Prague, arguably the two weakest teams in pot one, will give them belief that they can at least finish in the top 24 to seal a knockout place, with it estimated that nine points from the eight games could be enough.\nRangers will have similar ambitions, especially having been seeded in pot one, but they must recover from a very disappointing start to the season.\nRangers have never beaten a Swedish side in Europe in six attempts, four of which came against Malmo, and with their woeful away form an issue, this could be a more difficult fixture than it initially appears.\nCredit: sportsmole.co.uk\nLeague Stage Fixtures\nFenerbahçe 17:45 Union Saint-Gilloise\nEintracht Frankfurt 20:00 Viktoria Plzeň\nOlympique Lyonnais 20:00 Olympiakos Piraeus",
  "word_count": 1102,
  "scraped_at": "2026-02-14T02:11:06.642079",
  "_text_extracted": true
}