{
  "article_id": "d784a5a803f2",
  "url": "https://www.the42.ie/man-city-copenhagen-analysis-6298960-Feb2024/",
  "title": "Is football broken ? ",
  "date": "20240214T011500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NOT SO LONG ago, the Champions League knockout stages were consistently one of the highlights of the season.\nIt was where you would routinely see the best players and the best level of football.\nHowever, Man City’s 3-1 win in Copenhagen tonight epitomises why these days, many neutrals’ enthusiasm for the competition is waning.\nThe result actually flattered the hosts.\nCity were not at their best. They played the entire match with the handbrake on and yet they still should have won by so much more.\nGuardiola’s men made one mistake at the back, with Ederson’s misplaced pass leading to Copenhagen’s goal.\nYet the overall stats give a better reflection of the game. The visitors had 79% possession. They had 27 shots with 13 on target. Copenhagen had four with one on target.\nThe second leg at the Etihad is a mere formality. This is supposed to be the absolute elite level of football. Instead, it felt like an FA Cup tie where a Premier League side is up against a non-league outfit.\nCity are now 20 games unbeaten in the Champions League. They have won all seven of their matches in the competition this season. They have scored 21 goals and conceded only eight.\nIt wasn’t always like this. It wasn’t always so predictable.\nRecall the very first incarnation of the Champions League in the 1992-93 season. An English team didn’t even qualify for the group stages.\nIn the early days, the reigning English champions, Blackburn, could finish bottom of a group that also included sides from Poland, Norway and Russia.\nThe season Man United triumphed in 1999, they only won two of their six group games and didn’t win any of their knockout fixtures by more than two goals.\nThe following season, none of the knockout matches were won by more than two goals aside from the final (which Real Madrid won 3-0).\nIn the 2002-03 campaign, every knockout game in the competition was either won by a single goal, away goals or penalties.\nOf course, there was the odd hammering or one-sided contest in this era but they were anomalies rather than the norm.\nThese were consistently tight, thrilling games featuring the best players in the world and involving relatively well-matched sides.\nNow compare it to last season in the Champions League. Here are some of the aggregate results of knockout matches: 6-2, 8-1, 5-0, 7-1, 4-1, 4-0, 5-1.\nIn three knockout games alone on the way to the final, City scored 17 goals and conceded just three.\nThe final was ostensibly much closer, with Guardiola’s men prevailing 1-0 against Inter, but the outcome of that contest seldom seemed in doubt, such was the Premier League side’s patent superiority.\nIs this season going to be any different?\nBarring a minor miracle, City will make the quarter-finals at least.\nAnd when you look at the list of remaining teams, how many can genuinely challenge them?\nYou could make a case for five or six sides at a generous estimate. Real Madrid and Arsenal certainly and at a stretch, Bayern Munich, PSG or Inter.\nDespite their historical strength in the competition, Barcelona are having such a poor season that it’s very difficult to see them going all the way. You could make a similar case, albeit to a lesser degree, with Bayern, particularly after their dreadful performance in the 3-0 loss to Werder Bremen at the weekend.\nBut the days when a team like Porto could triumph against the odds seem a distant memory.\nOf the last 10 Champions League, eight have been won either by Real Madrid or a Premier League team, with just three countries in total represented among the winners.\nBy contrast, the first 10 incarnations of the competition included winners from France, Italy, Netherlands, Germany, Spain and England, while Yugoslavia’s Red Star Belgrade secured the penultimate trophy in the European Cup format.\nIn recent years, football has been badly damaged by greed at the expense of most fans, with the world’s best players invariably congregating at a handful of clubs.\nBayern Munich have won the last 11 Bundesligas. PSG have won nine of the last 11 Ligue 1 titles. Even the Premier League, often praised for its relative unpredictability, has seen Man City win five of the last six titles. Increasingly, the Champions League too is moving in this direction.\nThe reason so many of the top teams, either publicly or privately, want a European Super League, is that it would level the playing field somewhat and lead to fewer non-contests like the latest of many, which was witnessed in Copenhagen tonight.\nFor years now, football has been broken, and there appears to be little appetite among the elite for a sensible solution.",
  "word_count": 788,
  "scraped_at": "2026-02-14T02:29:51.244499",
  "_text_extracted": true
}