{
  "article_id": "d79f65da4e41",
  "url": "https://www.bbc.com/mediacentre/mediapacks/bbc-world-service-match-of-the-day-africa-top-10",
  "title": "Match of the Day Africa : Top 10 - Yaya Touré , Efan Ekoku and Gabriel Zakuani get ready to kick off new BBC Sounds podcast",
  "date": "20230630T021500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Four-time African Footballer of the Year, Yaya Touré, Africa Cup of Nations winner, Efan Ekoku, and former D.R. Congo captain, Gabriel Zakuani, debate all things African football in a new podcast from the BBC World Service, Match of The Day Africa: Top 10.\nWho are the best goalscorers from Africa, or the best managers in the history of the Africa Cup of Nations? What’s the continent’s greatest moment at the World Cup?\nYaya, Efan and Gabriel will discuss and decide their top 10s from a list compiled by a panel of African football experts. When they disagree, Gabriel, who is in the presenter’s chair and posing the questions, has the casting vote. They will also share stories about their time in the game.\nThe first season of Match of the Day Africa: Top 10 will have 20 episodes and will be released weekly from Monday 3 July on BBC Sounds and most other major podcast platforms.\nYou can listen to the trailer here.\nES\nPresenter Biographies\nYaya Touré\nYaya Touré is the only player to win four consecutive African Footballer of the Year titles. The Ivorian’s talent on the pitch means he is considered by many as one of the best midfielders of all time.\nHe has won League titles in England and Spain with Manchester City and Barcelona. Yaya is also a Champions League winner and captained the Ivory Coast national side to a historic Africa Cup of Nations triumph in 2015.\nHe is a vocal campaigner on a wide range of important issues including racism and the environment.\nYaya is currently assistant coach at Standard Liege in the Belgian Pro League.\nEfan Ekoku\nEfan Ekoku is a former Nigeria striker who scored more than 50 Premier League goals. He started his career at Sutton before moving to Bournemouth and was signed by Norwich during the first season of the English Premier League, where he helped them to finish 3rd and qualify for the UEFA Cup.\nEkoku scored Norwich’s first goal in European football and became the first Premier League player to score four goals in a match, when Norwich beat Everton 5-1. He also played for Wimbledon in the Premier League before moving to Grasshoppers in Switzerland.\nEfan was a member of the Nigeria squad for the country’s World Cup debut at USA ’94 and part of their 1994 Africa Cup of Nations winning team. Since retiring, Efan has worked in the media, commentating on matches in the Premier League and Champions League, as well as the World Cup, European Championships and Africa Cup of Nations.\nGabriel Zakuani\nGabriel Zakuani is a former D.R. Congo captain. He made his professional debut at 16 for Leyton Orient before moving to English Premier League side, Fulham.\nWhile on loan at Stoke City for the 2007/08 season, he helped the club win promotion to the English top flight. In eight seasons with Peterborough United, Gabriel made more than 250 appearances and helped the club win two promotions from League One to the Championship. He also played for Northampton Town, Gillingham and Swindon Town.\nGabriel was part of the D.R. Congo side that finished third at the 2015 Africa Cup of Nations to equal their best finish since 1974. He made 29 appearances for the senior national side and played at three Africa Cup of Nations. He’s currently Assistant Manager to the country’s Under 20 side.\nQ&A with Yaya Touré\nWhat made you want to join MOTD Africa Top Ten?\nI think it’s about celebrating African football and trying to give audiences of African football a better understanding and knowledge of some of the best players, tournaments, and moments in the game, as well as being entertaining to listen to – so I’m pleased to be a part of that.”\nTell us a bit about the podcast – what can listeners expect? Will you always be right?!\nHaha no! The idea is to just try and understand sometimes people can have their personal opinion, their [viewpoint] on a situation but at the end of the day I think it’s all about fun, all about trying to interact with the fans, [and] to have fun with them.\nHow do you get on with your fellow hosts?\nWell I think really good experienced African footballers like Gabriel and Efan, they’ve been in African football for quite a long time and they also have this story in their backgrounds of Africa. To join them and to be part of the team is brilliant.\nYou and Efan go back and forth between you these past 20 episodes, is there a bit of rivalry there?\nYes to be honest it’s been tough, because Efan is a top, top challenger and his opinion is backed up really, really well. Sometimes I feel that I get on the spot… when he comes back with his opinion and he’s clear… it’s quite difficult, to be honest!\nWhat has been the highlight of your career?\nIn terms of personal achievement, in terms of the most emotional trophy I’ve got, I think it’s for AFCON 2015 with Ivory Coast because if you [look back], we’d been the top side in Africa for more than 10 years, with [Didier] Drogba, my brother [Kolo], all those players like that - Gervinho, Soloman Kalou - but we didn’t achieve it. And the last year, when I was thinking maybe it’s my time to step down [and] let the younger players come through, because with me close to them, it might be a bit difficult for them to express themselves… at the same time, I thought, ‘Why not?’. Because I think actually we had a top manager, Herve Renard, who gave me another energy, in terms of ‘do all you can’, and after that people were going to respect you because if you leave at that same time, it’s going to be a bit difficult’.\nWe’re probably going to hear it on the podcast, but who do you think is the greatest African footballer?\nWow, that’s a great question. I think we’ve been blessed to have a lot of good, good talent, you know what I mean - when you can name most of them. Because for me, my position is becoming difficult to judge or decide because… I really, really enjoy seeing them playing [and] have enjoyed playing with some of them. George Weah, I never played with him… a great, great player who’s the only African to win the Ballon d’Or, European… Didier Drogba, I played with him, Samuel Eto’o, I played with him.\nThere are so many great players. Okocha, Rigobert Song. But you could say it’s easy to say, because only one African won the Ballon d’Or in the world: George Weah. But in terms of achievement and collectively [Drogba and Samuel Eto’o], their names speak for themselves, they’ve been so good, they have been leaving a great legacy to those players like Salah and Sadio Mané, who carry on performing. But we can say, in my opinion, George Weah.\nThanks very much, Yaya.\nThank you.\nQ&A with Gabriel Zakuani\nWhat made you want to join MOTD Africa Top Ten?\nFirstly, I think there’s a lot to discuss about African football, and it’s good that the show gives us an opportunity to do that. I’m around people that also know about African football so we can have some good debates, share different opinions, and it just seemed something fun to get into.\nWho in your opinion is the best African player in the Premier League at the moment?\nOh, that’s such a tough one. But I would say Mohamed Salah, just because of the longevity of how well he’s performed at the top level. There’s also [Riyad] Mahrez as well, who I think is up there. But I think Salah for me stands out.\nHow do you get on with your fellow hosts?\nYeah we get on well! We have our ups and downs, and disagreements in terms of the actual show in itself, but I think off camera and in the studio there’s chemistry that’s been built there and we seem to be getting on pretty well.\nDo you argue about your top 10s?\nYes of course, always! We always argue, have different opinions, but I think in terms of… a lot of football fans see different things and what they like, and it comes out you know – we’ve all played professional football, we’ve all played at a very good level, so I think our opinions are valid, but we will see the game differently.\nWhat for you is the best moment of your career?\nBest moment of my career I think is captaining my country, the Democratic Republic of Congo, which is a big moment because it’s your country, and obviously being captain of your country is a big honour. I won the Playoff final as well, which is a big moment. But I think captaining my country always has to be the best moment.\nFinal question, what advice do you have for aspiring players in Africa?\nI think it’s really tough obviously, because the resources aren’t the same as if you were in Europe, but I think just keep going, and hopefully you do get noticed. I know it’s easy to say don’t give up, but that’s the best advice I can give: don’t give up. You just never know who’s watching and who can take you to a big club and have a career. There are a lot of examples now of big players who have come from Africa, so now you’ve got loads of people to look up to. So just keep doing what you’re doing.\nThanks very much, Gaby.\nThank you.\nQ&A with Efan Ekoku\nWhat made you want to join MOTD Africa Top Ten?\nOh, good question. I think it’s nice to raise the profile of African players, first of all. They’ve been at the sharp end of professional football for a long time – much longer than most listeners would believe really. The purpose of the show is to make sure the audiences of African football are aware of what’s going on with players, in the big tournaments, in the European leagues.\nWe want to raise the profile of African football and make sure that the young kids have people to look up to, to aspire to be, and the best way to do that is to make sure that these stories and their history and the facts are being told.\nIf you could tell us a bit about the programme – what are you most looking forward to about it, and presenting?\nI love the arguments with Yaya, in particular! You know, the disagreements about what we think: the best players, best goal-scorers, best midfielders, best goals, most famous moments at AFCON or World Cup moments, players we like and players we don’t think are as good as other people might think they are.\nHaving that discussion with Yaya and Gaby is great because it’s the kind of stuff we all talk about at home with our friends and family, and at work, in different environments. So for us to get together like this for the first time is great. And football is subjective [so] it’s nice to hear what other people think about the players. And whether they agree with you or not, that’s always fun.\nWho in your opinion is the best African player in the Premier League at the moment?\nIn the Premier League right now? I’m always a little bit… I like to separate players because I think it’s always easy to look at the goalscorers. It’s the hardest thing to do, to score goals. So those names always spring to mind. So you know, people will say Mo Salah, because he’s the most famous African player arguably in the world right now. And he’s been the best goal scorer for the last 5 to 6 years. So I suppose, without going into detail, he’s the one I think who is holding the beacon the highest, and shining it the brightest right now.\nWhat is the highlight of your career?\nHighlights? I’d say making my debut for Nigeria in AFCON 1994 was a highlight, but in a way it was more for my Dad, in that I think he felt it more than me. I think he really cherished that moment more; you know, the thought that his son played international football. So that was a very proud moment for him, and for me as well. It was nice to see that he was very happy. And he sort of basked in the glory to the end of his days!\nOn a personal level, I suppose being the first player to score 4 goals in a Premier League game, back in 93, when I was at Norwich. That was the first time that happened. It was at Goodison park, and I’m a Liverpool fan so that was great. And maybe scoring the first goal in European football for Norwich as well, which is a milestone that no-one else can ever achieve. If I had to choose one, probably the 4 goals. Yeah, that was very satisfying.\nAnd one last question, what advice do you have for aspiring players in Africa?\nFollow your dream. It’s much easier for them now to be able to follow it because the pathways are greater and there are many more than when I was growing up, although I was raised here [in the UK]. So don’t let anybody ever tell you that you can’t do something. Because as I said, there are many opportunities. Lots of African kids get pushed down the route of “education, education, education”, more so because that’s seen as the way out, to a better life. But sport now - lots of sports, but football in particular - there are so many ways that they can find a better life for themselves. So yes, always believe in yourself. And that goes a long way.\nThanks, Efan.\nThank you.",
  "word_count": 2339,
  "scraped_at": "2026-02-14T01:50:37.768256",
  "_text_extracted": true
}