{
  "article_id": "d7b750bf0b58",
  "url": "https://www.justarsenal.com/arsenal-legend-suggests-the-gunners-have-underachieved-under-mikel-arteta/393314",
  "title": "Arsenal legend suggests the Gunners have underachieved under Mikel Arteta",
  "date": "20250529T091500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal legend Thierry Henry has spoken out about the club’s recent shortcomings, insisting that supporters are right to question Mikel Arteta after yet another campaign without silverware.\nOn Sunday 25 May, Arsenal concluded their 2024–25 season with a 2–0 win over Southampton, securing second place in the Premier League for the third year in a row. But while consistent, the Gunners once again fell short in their pursuit of major honours, both domestically and in Europe.\nArteta’s side came agonisingly close to a first Champions League final since 2006, only to fall at the semi-final stage. Coupled with the league disappointment, Arsenal’s growing “nearlymen” reputation continues to raise eyebrows, especially as the Spaniard has not lifted a major trophy since the 2020 FA Cup, his only piece of silverware so far.\nHenry: “You should expect trophies by now”\nSpeaking to the BBC, Henry offered a measured but pointed reflection on Arsenal’s failure to get over the line.\n“I’m not saying that I’m disappointed with Arsenal, but it’s normal that people are raising questions now about what the team is doing,” said the Frenchman.\n“I understand that at the very beginning you arrive and it’s not your team. You need at the very least three or four transfer windows to change everything. It takes time, and you have to give a manager time to implement what he wants.\n“But for the last three years, Arsenal have been in a situation where they should have at least brought one cup or reached a final.”\nHenry then compared Arsenal’s record to Manchester United, who, despite their own issues, have reached five finals and won two trophies in the past five years.\n“That’s the United everyone laughs at,” Henry noted, “but Arsenal haven’t reached a single final in the last three years of building. So yes, people will rightly ask, ‘Shouldn’t you be competing for trophies?’”\nHas Arteta done enough?\nWhile Arteta has undoubtedly transformed the club, turning Arsenal from mid-table also-rans into genuine contenders, it’s clear that fans and former players alike now expect more than progress alone.\nWhen the Spaniard first arrived, the squad was unbalanced, ageing, and easy to beat. Arsenal missed out on European football altogether in his first two full seasons. But since then, they’ve become a formidable force in both the Premier League and Europe.\nEven so, football is ultimately about winning. And as Henry suggests, if Arsenal want to be seen as elite again, they must start turning progress into trophies.\nSo the question remains: If Arteta doesn’t deliver silverware next season, should the club consider moving on?\nBENJAMIN KENNETH\n_____________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 508,
  "scraped_at": "2026-02-14T02:09:11.442582",
  "_text_extracted": true
}