{
  "article_id": "d7ce0b2b3695",
  "url": "http://www.china.org.cn/2025-12/09/content_118217869.shtml",
  "title": "Barcelona , Atletico Madrid look to avoid UCL playoff round",
  "date": "20251209T021500Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FC Barcelona and Atletico Madrid face pivotal Champions League matches on Tuesday as both Spanish clubs look to secure direct qualification for the knockout stages.\nDro Fernandez (L) of Barcelona vies with Clement Lenglet of Atletico de Madrid during the La Liga football match between FC Barcelona and Atletico de Madrid in Barcelona, Spain, on Dec. 3, 2025. (Photo by Joan Gosa/Xinhua)\nBarcelona hosts Eintracht Frankfurt, with Camp Nou staging its first European match of the season after the club began the campaign playing at Montjuic. Losses to Paris Saint-Germain and Chelsea, along with a 3-3 draw away to Club Brugge, have left Hansi Flick's side with little margin for error in the expanded 36-team league phase.\nBarcelona sits 18th on seven points from five matches. A top-eight finish would secure automatic qualification, while anything less would force the team into a February playoff round. The Catalans are confident of collecting maximum points from their remaining fixtures against Frankfurt, Copenhagen and Slavia Prague, though dropped points could prove costly.\nThe team's form has improved at the right moment. Barcelona beat Atletico Madrid 3-1 at home last week before thumping Real Betis 5-3 away, conceding twice only after Flick rotated key players. Raphinha and Robert Lewandowski were rested at the weekend and are set to return, while Fermin Lopez is fit again to bolster midfield options. Frenkie de Jong could also start if Flick opts to move Eric Garcia into defense.\nAtletico Madrid travels to PSV Eindhoven knowing that away results remain their major concern. Diego Simeone's side has lost both of its away Champions League matches this season, at Liverpool and Arsenal, despite maintaining a perfect home record.\nAtletico is again without central defender Jose Gimenez, full-back Marcos Llorente and winger Alex Baena. Midfielder Johnny Cardoso is expected to be available after missing Saturday's 1-0 loss to Athletic Club.",
  "word_count": 309,
  "scraped_at": "2026-02-14T02:19:12.277405",
  "_text_extracted": true
}