{
  "article_id": "d7d251111e93",
  "url": "https://metro.co.uk/2026/01/07/pat-nevin-names-two-england-stars-chelsea-sign-january-transfer-window-26127859/",
  "title": "Pat Nevin names the two England stars Chelsea should sign in January",
  "date": "20260107T130000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pat Nevin insists Chelsea should be targeting the signings of two England international during what remains of the January transfer window.\nThe Blues confirmed the appointment of Liam Rosenior as their new head coach earlier this week following the shock departure of Enzo Maresca.\nRosenior will inherit a talented squad which, despite yet more upheaval, remains well placed to secure Champions League qualification and has a Carabao Cup semi-final against Arsenal on the horizon to look forward to.\nReinforcements would undoubtedly aid Rosenior’s chances of achieving the club’s goals which were outlined in the statement published on Tuesday once confirmation of his arrival from Stasbourg was announced.\n‘Liam has shown that he can build teams with a clear way of playing while setting the highest standards with players on and off the pitch, said Chelsea on the club’s official website.\n‘While there will continue to be a focus on player development, the Club’s expectations and ambitions remain high,’ the statement said.\n‘Liam has the ability to get the best out of this squad quickly and joins us with the responsibility and the backing to ensure Chelsea continues to compete at the top level in all competitions this season and in seasons to come.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIt remains unclear to what extent Chelsea will be able spend in the coming weeks but their former winger Nevin believes a new centre-half and striker are the positions in need of strengthening and has two ideal candidates in mind.\nAfter a slow start to the season, Ollie Watkins now looks guaranteed to be part of Thomas Tuchel’s England World Cup squad having hit a purple patch, while England’s lack of options in defence means Branthwaite, who won his first senior cap under Gareth Southgate, could still figure despite an injury ravaged campaign.\n‘Signing Ollie Watkins could be Chelsea’s top priority in this January transfer window,’ Nevin told ‘BetWright UK’.\n‘With seven goals in his last seven games for Aston Villa in the Premier League, he’s hitting the form we saw a couple seasons ago.\nMore Trending\n‘I admire Liam Delap and his work rate, but when it comes to pure quality, Watkins is the more favourable option.’\nOn a potential defensive additions, Nevin added: ‘Jarrad Branthwaite is another player Chelsea could be looking at.\n‘They desperately need a centre-back and while he’s been injured at Everton for most of the season, given Chelsea’s methodology and youthful transfer policy, I don’t know of any better young centre-backs than Branthwaite.\n‘When he’s fully fit, every big club will be chasing his signature again.’\nMORE: Ruben Amorim in ‘pole position’ for new job after Manchester United sacking\nMORE: John Terry makes Chelsea transfer demand after Liam Rosenior appointment\nMORE: Dominik Szoboszlai sends warning to Arsenal over Premier League title race",
  "word_count": 515,
  "scraped_at": "2026-02-14T02:09:43.017249",
  "_text_extracted": true
}