{
  "article_id": "d7d375a41324",
  "url": "https://www.fwweekly.com/2023/02/02/winter-transfer-roundup-2/",
  "title": "Winter Transfer Roundup",
  "date": "20230203T071500Z",
  "domain": "fwweekly.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hello again. While we’re taking a temporary breather from football, let’s take a look at what has happened during soccer’s first transfer window since the World Cup. My imaginary interlocutor is back with us to lead off our discussion with the chaos at U.S. Soccer.\nWhat the hell happened?\nYeah, remember two months ago, when I said that Gio Reyna should follow his dad’s example? Never mind. The young Reyna’s disciplining at the World Cup should have been the end of matters, but the player’s parents blew up Coach Gregg Berhalter’s spot by going public with a domestic violence case from the early 1990s. The resulting PR flap cost men’s team director Earnie Stewart his job, while Berhalter’s status is very much up in the air with his contract expired, so Claudio Reyna managed to shank two of his former teammates in the same blow.\nShould Berhalter have been fired?\nThe convenient timing of his contract running out meant that U.S. Soccer didn’t have to consider the question. Usually, when a man hits a woman, my reaction is “throw the bastard out.” In this case, though, Berhalter’s incident from 1991 appears to have been isolated, and the woman he kicked wound up marrying him and is still with him. The real pity is, his hiring and all the ugliness that we’re seeing now wouldn’t have happened in the first place if the U.S. Soccer Federation had been run like a professional organization instead of a social club where only a small circle of insiders is listened to or seriously considered for top jobs. Berhalter and Claudio Reyna both come from that old boys club, and now what might have been a petty squabble has instead damaged the reputations of everyone involved from the federation on down.\nWhat happens now?\nFortunately, there are three and a half years before USA co-hosts the next World Cup. If FIFA can figure out how to shoehorn 48 teams into the tourney in that time, surely we can find a new coach. The press swirled recently with rumors that U.S. Soccer had approached Zinédine Zidane with an offer. It would have been a shock if the French legend and World Cup winner had accepted, but that’s the sort of big swing that the federation needs to make for the team when they’re playing the World Cup in front of our fans. In the meantime, Gio Reyna has been playing fantastically for Borussia Dortmund, scoring game-winning goals in two consecutive matches. That’s probably a coincidence, but I’ll take anything good that comes out of this.\nWho made big moves as the club season resumed?\nChelsea made a huge splash, as American owner Todd Boehly sought to quash any speculation that the Blues might tighten their belts under his management. They brought in French defender Benoit Badiashile and newly minted World Cup winner Enzo Fernandez to stabilize their spine and made up for Christian Pulisic’s injury by loaning João Félix from Atlético Madrid and buying Ukrainian winger Mykhaylo Mudryk. They sold off Jorginho (whose contract was running out) to rivals Arsenal, but even with that, they still spent more than the Italian league put together in this window.\nSo things were quiet in Italy?\nNo! Juventus managed to get caught cheating again. Some 17 years after they were found to have bribed a dozen Italian referees to rig the league in their favor in what was called the calciopoli scandal, they now have been caught cooking the books by inflating transfer fees of incoming players and paying their players under the table during the pandemic. For this, Serie A announced Juve were being docked 15 points in the standings this season and possibly more for not reporting their players’ salaries to the tax authorities. I would expect that penalty to be lowered once the lawyers get involved, but any loss of points will likely end their slim hopes for winning the league title and might just doom their push to qualify for the Champions League. Failure to reach the big club tournament would then have a knock-on effect on their finances. Luckily for Juventus midfielder Weston McKennie, he found a lifeboat and joined the American contingent at Leeds.\nWho does this benefit?\nJosé Mourinho! The Portuguese coach is now in his fifth season in Italy, and he has spent the entire time acting like everyone in Italy is cheating except him. (No, really. The current manager of AS Roma said as much to Corriere della Sera. He speaks fluent Italian, so there was no mistake in translation. This was when he was winning championships there, by the way.) Anytime anyone mentions Juventus in any context, Mourinho is sure to say that the bianconeri only ever win when they’re bribing people. He’s evil, but his willingness to hold a grudge can be awesome sometimes, like when a team with a record of shenanigans and a fanbase with a victim complex tries to excuse their latest rule-breaking. I honestly cannot wait for the next Juventus vs. Roma match, which is next month. I wish somebody in baseball would do that to the Houston Astros.\nWhat else happened in world soccer?\nManchester United got their business done quietly and efficiently. It is so weird to write that sentence. They offloaded Cristiano Ronaldo to a team in Saudi Arabia (where CR7 has yet to score) and replaced him with Dutch plugger Wout Weghorst, while also cadging stabilizing midfielder Marcel Sabitzer from Bayern Munich. The Bavarians, for their part, received Daley Blind for free from United and took advantage of Manchester City’s puzzling decision to loan out Portuguese fullback João Cancelo. Liverpool failed to get badly needed help for their midfield and instead signed up World Cup sensation Cody Gakpo. They’ll see if you can actually have too many attacking options.\nWhat about locally?\nFC Dallas’ big acquisition of the window was defender and Arlington native Amet Korça from the Croatian league. Losing Matt Hedges is a blow, but mostly the Hoops are looking to run it back with the squad that finished third last year. Elsewhere in MLS, DC United received Polish attacker Mateusz Klich from Leeds, itinerant goalkeeper Sean Johnson moved from New York to Toronto, Gareth Bale retired from L.A., and Paxten Aaronson (the younger brother of Brenden Aaronson, who’s reputed to be even more talented) moved to Eintracht Frankfurt to go up against the German league’s defenses.\nWhere did the nickname Pelé come from?\nFascinatingly, the man himself did not know. When Edson Arantes do Nascimento was 12 or 13, it rose up organically among his friends, and the boy hated it. There has been some speculation that it derives from Saci-pererê, the mischievous one-legged trickster from Brazilian mythology who became a Black man in the telling of the country’s slave population, who could disappear and reappear at will. The World Cup was over when Pelé, who came to embrace his name, died this past December. His stardom came after Joe Louis became heavyweight boxing champion and after Jackie Robinson integrated baseball, but he was the first Black global superstar athlete, and his outrageous skills and the praise he heaped on his vanquished opponents made him worthy of it.\nWhat is Pelé’s film legacy?\nThe obvious movie to watch is the World War II sports drama called Victory on our shores and Escape to Victory abroad, in which he teams up with Sylvester Stallone and Michael Caine to beat a Nazi team in occupied Paris. Less obviously, the Will Ferrell soccer comedy Kicking & Screaming has him coaching against his dad for possession of a souvenir ball kicked by Pelé into the stands at a New York Cosmos game. In the later drama Everything Must Go, Ferrell hears a boy say that Black people don’t play soccer, points to Pelé, and says, “Whole continents of Black people play soccer.” If you can, track down Once in a Lifetime: The Extraordinary Story of the New York Cosmos, the documentary that chronicles the madness surrounding the soccer team in the 1970s, with interviews with Franz Beckenbauer and Johan Cruyff. It’s a fitting way to honor the most famous Brazilian who ever lived, who perhaps did more for his sport in America and the world than anyone.",
  "word_count": 1376,
  "scraped_at": "2026-02-14T01:59:41.724046",
  "_text_extracted": true
}