{
  "article_id": "d7d81a8f01e6",
  "url": "https://variety.com/2025/film/global/venice-one-woman-one-bra-african-narrative-1236493865/",
  "title": "  One Woman One Bra  Takes Aim at  Message - Based  Films About Africa",
  "date": "20250831T061500Z",
  "domain": "variety.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kenyan filmmaker Vincho Nchogu makes her feature directorial debut with the pastoral drama “One Woman One Bra,” a story of womanhood, community and the struggle to reshape African narratives that debuts in the Biennale College Cinema strand of the Venice Film Festival.\nWritten and directed by Nchogu, the film is produced by Josh Olaoluwa for his Lagos-based shingle Conceptified Media and lensed by Nigerian cinematographer Muhammad Atta, whose credits include Beyoncé’s “Black Is King.” A Kenya-Nigeria co-production, it’s the first Nigerian-produced film to premiere on the Lido.\n“One Woman One Bra” is set in the Kenyan village of Sayit, home to a pastoral community whose villagers are about to receive title deeds for their property, marking the first time in centuries that they’ll be able to claim legal ownership of their land. Those deeds, however, are based on kinship ties, posing a problem for 38-year-old Star (Sarah Karei), an unmarried woman whose parentage is unknown.\nPopular on Variety\nAt the risk of losing her home, Star must find a way to either prove her rights to the land or raise the money to buy it outright. Increasingly desperate, she decides to sign a morally questionable deal with an NGO to produce the awareness campaign of the film’s title — putting her at loggerheads with her community.\nThat video campaign, which stems from a misunderstanding between Star and a British aid worker, draws on Nchogu’s own experiences as an aspiring filmmaker in East Africa. The director got her start working for a nonprofit organization, making what she now regards as “propaganda films.”\nIn those “message-based” films, Nchogu tells Variety, her African subjects would often “suppress their personal narratives to conform to the organization’s salvation myth.”\n“There’s more money [in East Africa] if you make an issue-based film,” she says. “Then the question becomes: Are we telling the stories that we really want to tell, or is the funding dictating the stories we tell?”\nNchogu left Nairobi in 2010 to study film at Columbia University, a period that marked a turning point in her life. Not long after her arrival in New York came the release of the controversial documentary “Kony 2012,” produced by the U.S. non-profit Invisible Children, which purportedly set out to make the Ugandan cult leader and war criminal Joseph Kony globally known in the hopes of leading to his arrest. Spurred on by support from Oprah Winfrey and other celebrities, the documentary became a viral sensation, raising more than $30 million for Invisible Children. (More than a decade later, Kony remains at large.)\nWhile studying in New York, Nchogu found herself wondering where all that money went, if any of it benefitted the children whose images were used in the 30-minute video — and whether they were “owed something,” or if they were “just the sacrificial lamb for the cause.” She began assessing African images from the past, reflecting on the idea of “white saviorism” on the continent and “the power of owning your narrative and knowing yourself.”\n“The narrative of Kenya is told through [the perspective of] when the colonizers arrived and when they left. We inherited the story that the colonizers fed us,” she says. “How much of Africa’s history, Africa’s innovation, Africa’s creation was lost, because we picked up a narrative that wasn’t ours?”\nNchogu splits her time between New York and the African continent, which is where she met Nigerian producer Josh Olaoluwa — then working for Mo Abudu’s EbonyLife — in 2021. It was in Lagos that the duo collaborated on a self-funded documentary, later participating in the Red Sea Lodge in Saudi Arabia to begin developing the feature film “Fantastic Tale.”\nWhile that project, about a Nigerian child in search of a mystical pink fish, won the Red Sea Souk Production Award, Nchogu had already begun developing “One Woman One Bra.”\n“Vincho has lots of crazy ideas,” says Olaoluwa, laughing. “She called me one day and said, ‘Josh, wait a minute. I have this idea.’ There’s been no turning back in the four years since.”\n“One Woman One Bra” was shot in the village of Nkosesia, with Nchogu estimating that roughly 70% of its cast and crew was drawn from the local community. That includes the women of a traveling theater group who filled many of the movie’s key roles, workshopping the script with Nchogu and even taking over the casting duties to “cast themselves in the roles they saw fit.”\n“They were so invested in the story,” Nchogu says, crediting her local fixer Amos Leuka for connecting her to the community. “It felt like such a blessing to find that village.”",
  "word_count": 770,
  "scraped_at": "2026-02-14T02:15:40.831792",
  "_text_extracted": true
}