{
  "article_id": "d7f5f8fabc1b",
  "url": "https://theathletic.com/4621590/2023/06/20/u21-euros-player-analysis/",
  "title": "Brobbey , Nusa , Moukoko and more : Picking 21 rising stars for the U21 Euros",
  "date": "20230620T043000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "You know what they say: never buy a player after a successful tournament.\nBut go back through the list of previous Under-21 European Championship Golden Ball winners — the award for best player — and the talent reveals itself: Juan Mata; Petr Cech; Andrea Pirlo; Fabio Cannavaro; Thiago and Klaas Jan-Huntelaar, just to name a few.\nAdvertisement\nThis summer’s edition of the European Championship, the final age-group tournament before senior level, is just the second to feature 16 teams and four groups. That means hundreds of players featuring in tens of matches, all in an 18-day tournament with a group stage and knockout rounds.\nWith games kicking off consecutively, picking and choosing what players and teams you watch requires quite a bit of preparation. Fortunately for you, we have done that for you, assessing the squads and selecting 21 of the most interesting players to watch at the tournament. Some you will already be familiar with, many are primed for a move and there may be a few that you are yet to discover.\nLet’s dive in…\nPlayer: Giorgi MamardashviliNation: GeorgiaPosition: GoalkeeperClub: ValenciaAge: 22U21 caps: 4In the summer of 2021, Valencia struck a deal with Georgian side Dinamo Tbilisi for a 20-year-old goalkeeper. He joined their reserve team in the Spanish third division.Two years later, Giorgi Mamardashvili has a release clause of €100million, and has just played every minute of the 2022-23 La Liga season. It’s been quite the rise for the young shot-stopper, who only made his impressive league debut against Getafe in August 2021 after injuries to both Jasper Cillessen and Jaume Domenech. The Georgian came in, made five sensational stops, and has kept his starting berth ever since.Famed for his close-range reaction saves, Mamardashvili played a vital role in Valencia’s survival this season, notably denying Federico Valverde in the dying moments of their crucial 1-0 win over Real Madrid.\nAn unbelievable save! 🧤\nGiorgi Mamardashvili helps keep Valencia ahead with some of the best reflexes you are likely to see 😱 pic.twitter.com/kcgci67UmZ\n— Viaplay Sports UK (@ViaplaySportsUK) May 21, 2023\nWithout Serie A’s player of the season Khvicha Kvaratskhelia, Georgia will be up against it in a tough group containing Belgium, Netherlands and Wednesday’s opponents, Portugal.\nMamardashvili could be a busy man between the sticks.\nHe plays a bit like… Aaron Ramsdale.\nAdvertisement\nPlayer: Brian BrobbeyNation: NetherlandsPosition: StrikerClub: AjaxAge: 21U21 caps: 14 (8 goals)One of the strikers the Georgian shot-stopper will have to keep out is Brian Brobbey, a player who is quickly becoming a great goalscorer as well as a scorer of great goals. His 13 Eredivisie goals in 2022-23 — scored at a rate of one every 127 minutes and the most of any Ajax player — were split into seven right-footed finishes, four left-foot goals and two headers.The 21-year-old is particularly strong at running diagonally in behind the defence to finish off through balls, and will even do so from a standing start if the pass to feet is not on. Yet you can find numerous examples of him attacking the back-post for tap-ins when Ajax are faced with an organised low block.\nThere is room for his game to be refined between both boxes — his pressing and his link-up play in particular. Sebastien Haller, Ajax’s previous striker, was superior to Brobbey in both those parts of the game. However, considering his age, there are difficult-to-teach parts of the game that Brobbey has locked down. His physical profile is elite: former youth coach John Heitinga said Brobbey was the fastest in the Ajax academy aged 16 and jumped further than Cristiano Ronaldo.\nHe’s a striker who is bound to catch the eye, regardless of how his side performs.\nHe plays a bit like… the West Bromwich Albion or Everton version of Romelu Lukaku, but also Robin van Persie against a high line.\nPlayer: Lois OpendaNation: BelgiumPosition: StrikerClub: LensAge: 23U21 caps: 15 (13 goals)\nTalking of goalscorers, few players took off quite like Lois Openda during 2022-23.\nEarning a transfer to Ligue 1 following a stellar season with Vitesse Arnhem — scoring 42 per cent of their Eredivisie goals as they finished sixth — the speedy striker has developed into a lethal close-range finisher for Franck Haise’s all-action Lens side, netting 21 goals in his debut season for the club.\nA closer look at his shot map tells the story. He is one of just five Ligue 1 players to take more than 100 shots last season, 87.3 per cent of them came from inside the box, with seven goals from inside the six-yard box.\nStepping in to lead the Belgian line, Openda is one of the most well-established strikers at the entire competition, and could form a mouthwatering partnership with Charles De Ketelaere at the top of the team.\nOne golden generation has come to an end — Openda will be looking to quietly inspire another.\nHe plays a bit like… Michael Owen.\nAdvertisement\nPlayer: Rodrigo “Roro” RiquelmeNation: SpainPosition: Left wingerClub: Girona (on loan from Atletico Madrid)Age: 22U21 caps: 9 (5 goals)If it’s audacity and confidence you’re looking for, Roro Riquelme could be your man.The Atletico Madrid loanee has enjoyed another stellar loan spell away from the capital, this time at newly-promoted Girona, following seven goals and 12 assists for second-tier Mirandes last campaign.A tricky, excitable winger, he’s a diminutive dribbler who packs a real punch with a powerful right-footed strike. His 5.9 take-ons per game paint the picture of a fearless winger, and only Vinicius Junior and Samuel Lino carried the ball into the final third more often.He likes a shot on goal, too. Averaging 2.3 attempts per game — half of those coming from outside the box — Riquelme has a breathtaking goal catalogue, including a goal-of-the-season contender in a 5-3 thriller against Real Sociedad. Receiving the ball on the half turn, he flicks the ball between Martin Zubimendi’s legs…… before unleashing a ferocious effort into Alex Remiro’s top corner.With four goals in his last five under-21 appearances, Riquelme looks set to star at the top of a star-studded Spanish team, hoping to impress his parent club back home. A high-volume dribbler and shot-taker, with an eye for the spectacular — what’s not to like?He plays a bit like…\nAndrei Arshavin.\nPlayer: Levi ColwillNation: EnglandPosition: Centre-backClub: ChelseaAge: 20U21 caps: 6“It’s difficult to find another centre-back, left centre-back, with his quality,” said Brighton head coach Roberto De Zerbi on Levi Colwill in May. He spent the season on loan there in his debut Premier League campaign, and was a regular alongside Lewis Dunk at centre-back in the 4-2-3-1 that fired Brighton to European football.Colwill is a master of the basics, weighting passes perfectly and showcasing an excellent passing range. He can play round, he can play through, and he can play over. Per 90 minutes last season, he made the most progressive passes (4.8) of any Premier League central defender.His standout game of the season was Brighton’s 3-0 away win over Arsenal. Without possession, Colwill pushed high to man-mark Martin Odegaard. “This is courage,” said De Zerbi afterwards.At 6ft 2in, Colwill is tall enough to defend the box effectively but is dynamic and agile, a quick turner and smart with his defensive positioning. With the ball, Colwill repeatedly found Kaoru Mitoma in dangerous positions and enabled him to isolate Benjamin White.\nWith such remarkable composure at such a young age, Colwill has a huge role to play for Lee Carsley’s Young Lions.\nHe plays a bit like… Virgil van Dijk, just less aerially dominant.\nPlayer: Youssoufa MoukokoNation: Germany Position: StrikerClub: Borussia DortmundAge: 18U21 caps: 5 (6 goals)\nOne such responsibility will be to stop Youssoufa Moukoko, arguably the most talented forward in England’s group.\nAt the age of 13, Youssoufa Moukoko had already scored 83 goals in around 46 full games for Borussia Dortmund’s under-17s.\nAged 14, he made the step up to the under-19s and scored 44 in 23.\nAdvertisement\nEven for a club that has seen a fair few young talents pass through its ranks, this was an unprecedented return.\nSix years later, the prolific striker has broken records in the Bundesliga – becoming the league’s youngest-ever player and goalscorer, as well as the quickest to reach 10, 25 and 50 appearances in Germany’s top flight.\nHis dizzying ascent through the ranks has been halted somewhat by injury, having already missed 34 league games from various issues since his promotion to the first team. Nonetheless, his laser-like shooting ability, able to catch the ball with such power and accuracy on both feet, means that the 18-year-old has still managed to rack up 13 goals across his fledgling professional career.\nMoukoko managed to string together a run of second-half substitute appearances as the season came to an agonising end, so he should be fit and firing for Germany Under-21s this month.\nWith six strikes in four qualifying games, it wouldn’t be a surprise to see him amongst the goals again.\nHe plays a bit like… Lautaro Martinez.\nPlayer: Zeno DebastNation: BelgiumPosition: Centre-backClub: AnderlechtAge: 19U21 caps: 1\nBelgium have a reputation for developing outstanding, ball-playing centre-backs in recent decades — Jan Vertonghen, Toby Alderweireld, Vincent Kompany, Thomas Vermaelen — and Zeno Debast could be the next name on that list, playing just like those in that list: composed in possession, capable defending one-v-one and technically excellent with a wide passing range.\nThe 19-year-old has been capped three times by the senior team and was part of the squad that crashed out of the 2022 World Cup group stages — though he did not play any minutes in Qatar.\nHis rise to the senior side came following consistently good performances on the right side of a back three under Felice Mazzu, Kompany’s successor as head coach at Anderlecht. After Mazzu was sacked and replaced by Brian Riemer, Anderlecht played a back four with Debast the right-sided centre-back. In the club’s worst season since 1937, Debast was a shining light and played the most minutes.\nZeno Debast shining in defence ✨@rscanderlecht || #UECL pic.twitter.com/jR9D1gZLVC\n— UEFA Europa Conference League (@europacnfleague) March 22, 2023\n“This was one of the most impressive debuts in recent years for Belgium,” then-head coach Roberto Martinez said about Debast’s debut in the Nations League win over Wales in September. “I saw a young guy with a lot of self-confidence, but also a lot of desire to learn,” added Martinez.\nAdvertisement\nDebast completed 79 of 87 passes on his debut, including seven of 10 long passes, with his line-breaking ability standing out in the UEFA Conference League this season too — Debast (49) ranked second among team-mates for progressive passes.\nHe plays a bit like… every good Belgian centre-back of recent times.\nPlayer: Enzo Le FeeNation: FrancePosition: No 10Club: LorientAge: 23U21 caps: 11 (3 goals)A diminutive midfielder, at 5ft 7in, Enzo Le Fee plays much how his surname translates from French to English — Enzo the Fairy. He glides around the pitch producing magic. In a low-possession Lorient side (46 per cent average last season), Le Fee was the central creative hub, at times playing in a midfield double pivot, as a free eight in a 4-3-3 or a No 10 in a midfield box in a 3-4-3. Only five Ligue 1 players created more chances than Le Fee (67) last season.Regardless of his role, Le Fee roams, looks to get on the ball and be incisive, either with through balls for wingers or getting through opposition midfields with one-twos. He regularly turns with his first touch, too, even when pressed and facing his own goal. The 23-year-old is an excellent ball striker, though more in a creative sense, offering a dead-ball threat at corners as well as direct free kicks.\nBehind a French front line that boasts a combined 55 goals in Europe’s big five leagues last season, Le Fee and Michael Olise are more-than-capable providers.\nHe plays a bit like… Zinedine Zidane (6ft 1in) was much taller, but as style goes, Le Fee operates much like his famous compatriot.\nPlayer: Destiny UdogieNation: ItalyPosition: Wing-backClub: Udinese (on loan from Tottenham)Age: 20U21 caps: 7Described as “extraordinary” by Udinese head coach Andrea Sottil, full-back Destiny Udogie has certainly made an impression in Italy. Udogie is more of an attacking force than defensive, playing one-twos and providing cut-backs from out wide as a wing-back in Udinese’s 3-5-2.\nBetween January 2022 and January 2023, Jonathan Clauss (15) was the only defender in Europe’s top five leagues to record more direct goal involvements than Udogie (12 — seven goals, five assists).\nAdvertisement\nHe has a penchant for underlapping runs into the penalty area, where he can score/assist, as well as driving inside onto his non-dominant right foot and finishing into the far corner. Udogie is more ‘wing’ than ‘back’, but with the potential to be an all-rounder.\nCompared to his Udinese team-mates, Udogie ranked third for tackles plus interceptions (107) and shot-creating actions (88), but topped the charts for dribbles (122 — 51 successful) and progressive carries (109).\nAt 6ft 2in, he is tall and battles well in one-vs-one duels in wide areas, often looking to dribble after making regains and ignite counter-attacks.\nLikely lining up behind Leeds United’s Wilfried Gnonto, Italy’s left side could be fun to watch.\nHe plays a bit like… Atalanta and Denmark’s Joakim Maehle.\nPlayer: Ian MaatsenNation: Netherlands Position: Left-backClub: ChelseaAge: 21U21 caps: 10 (1 goal)Another player who has thrived out on loan this season, Ian Maatsen returns to Stamford Bridge brimming with confidence this summer, ready to compete for the left-back spot under new boss Mauricio Pochettino. Last season’s triumphant spell at Burnley was the third loan move of the 21-year-old’s career and he played a starring role under Kompany with his rampaging runs down the left flank. Only Connor Roberts – on the opposite side of Burnley’s back four – bettered Maatsen’s 49.3 carries per 90 in the Championship last season, while only Max Aarons progressed the ball further with his feet.The Dutchman has end product too, having taken the most shots of any Championship full-back in 2022-23, scoring four times, and also generating 5.7 expected assists. He doesn’t shy away from his defensive duties, either, picking up the most loose balls and completing the third-most tackles.Maatsen is an all-round full-back and was unsurprisingly named in the Championship team of the season.Having already racked up three goal contributions for the under-21s, this is a great opportunity for him to showcase his talents to his onlooking club manager Pochettino, who famously enjoys helping young, talented players to flourish.Another one who plays a bit like…\nJoakim Maehle.\nAdvertisement\nPlayer: Gabri VeigaNation: SpainPosition: MidfielderClub: Celta VigoAge: 21U21 caps: 1This time last season, Gabri Veiga had played just 226 minutes of professional football. Now, having saved his hometown club from relegation with a dramatic, final-day double, he’s one of the hottest prospects on the European scene.Over the course of an outstanding breakout season, Veiga has developed a reputation as a powerful No 8, incredibly effective at driving his team forward with bulldozing runs from deep inside his own half. Once in those dangerous attacking zones, the 21-year-old possesses a powerful strike, able to find the corners with both feet. No one in La Liga outperformed their expected goals (xG) more than Veiga last season, while his four goals from outside the box was also a league high. What’s instantly noticeable about him is his direct style of play, wasting no time when it comes to carving out shooting opportunities. He can be a little overambitious at times, dribbling into dead ends or trying to force that final pass through. His raw talent, however, means that the sacrifice of team tidiness is often worth the risk.\nIt will take a lot to top his final game of the season for Celta — when he scored twice against Barcelona to help keep them up — but more goals on the international stage could set Veiga on his way to a big move this summer.\nHe plays a bit like… Nabil Fekir.\nPlayer: Noni MaduekeNation: EnglandPosition: WingerClub: ChelseaAge: 21U21 caps: 7 (1 goal)“Exciting, he’s fast, he’s direct,” was head coach Carsley’s assessment of Noni Madueke after England’s 4-0 win over France in March. Madueke was introduced as a 66th-minute substitute and 20 minutes later was awarded player of the match, scoring once and assisting twice.Across the past year, Madueke ranks in the top one per cent among European wingers for progressive carries (6.6), successful take-ons (4.3) and touches in the opposition box (8.3) per 90. “Stats speak” is something he lives by.\nNoni Madueke. Made in Eindhoven.#LondonCalling 📞 pic.twitter.com/YyhDp0OvfU\n— PSV (@PSV) January 20, 2023\nMadueke is a versatile winger, capable of playing on either flank and attacking a defender both ways. As a left-footer typically operating on the right, the gold standard is naturally Arjen Robben, though Madueke’s career pattern has more resemblance to Robben than his style, having left PSV Eindhoven for Chelsea in January, initially departing England aged 16.\nThe 21-year-old scored the opening two goals in PSV’s 2021 Johan Cruyff Shield final win over Ajax (the Dutch equivalent of the Community Shield) at the Amsterdam Arena. They encapsulated his style, both scored after dribbles from a PSV regain, the first a left-footed finish after dribbling inside, the second a right-footed strike after going on the outside.\nWe’ve seen glimpses of Madueke’s potential in the Premier League, notably at the Emirates in early May, but the tricky winger will be front and centre of an exciting England squad.\nAdvertisement\nHe plays a bit like… a blend between Riyad Mahrez and Wilfried Zaha when the latter is in tight spaces.\nPlayer: Amine GouiriNation: FrancePosition: ForwardClub: RennesAge: 23U21 caps: 26 (11 goals)Along with Openda, 23-year-old Amine Gouiri is another proven striker in the France squad who scores goals. The 23-year-old Lyon academy graduate joined Rennes from Nice in the summer and has scored more than 10 goals in each of his first three Ligue 1 seasons (12, 10 and 15). Such is Rennes’ attacking style — filled with rotations and premised around wide triangles and diamonds — that Gouiri, one of a generation of forwards who like to play in pockets without a fixed position, roams frequently and drops deep.\nA smooth dribbler, he is often able to escape from tight situations and lay the ball off to his team-mates.\nWill there be a better assist this weekend than this from Nice's Amine Gouiri's vs Versailles? 👋👋pic.twitter.com/LgcTFGshXf\n— Get French Football News (@GFFN) March 4, 2022\nGouiri is capable of finishing crosses and cutbacks with one touch, and is often involved in the build-up of those moves. He can also score from dribbles and finish on the angle too.\nThe forward showed his variety with a hat-trick away to Ajaccio in May: his first was a header following smart near-post movement, followed by a late run to finish a cutback with one touch. He capped it off by receiving the ball deep, between the lines, escaping a defender with his first touch and shaping to find the far corner before rifling it to the other side.\nGouiri was part of the France Under-17 team that was knocked out in the quarter-finals of the 2017 European Championship, but he finished as top scorer (and made team of the tournament) with eight goals.\nThere are plenty to choose from in this French front line, but Gouiri could well be the best pick for goals.\nHe plays a bit like… Karim Benzema, and is also a dual French-Algerian citizen.\nAdvertisement\nPlayer: Andre AlmeidaNation: PortugalPosition: MidfielderClub: ValenciaAge: 23U21 caps: 12 (2 goals)Having lost their captain and creative inspiration Fabio Vieira to injury, Portugal will be looking to Andre Almeida for answers.The 23-year-old has had a good season for Valencia, his first away from his boyhood club Vitoria Guimaraes. A roaming midfielder who loves to dribble his way out of trouble, Almeida has made a name for himself in Spain as a set-piece specialist with a consistent ability to swing teasing crosses into the box. Against Almeria, for example, he drifts wide to receive the ball, before lifting his head up and spotting the run of Justin Kluivert at the back post. Able to generate plenty of curl on the pass, Almeida’s delivery is often floated in, taking his time to pick out the considered option. Almeida created 24 chances for team-mates from dead-ball deliveries as well as scoring one sensational free-kick against Real Betis in November. He also attempted 3.2 take-ons per game last season, highlighting his adventurous nature in the final third.\nPortugal were runners-up at the last Under-21 European Championship and Vieira was the tournament’s best player. Almeida has some big shoes to fill.\nHe plays a bit like… the Newcastle and Brazil midfielder Bruno Guimaraes.\nPlayer: Oscar GloukhNation: IsraelPosition: No 10Club: Red Bull SalzburgAge: 19U21 caps: 4Remember the teenager that scored against England Under-19s in last summer’s European Championship final? Well, if you didn’t, that was Oscar Gloukh.He has since made his senior Israel debut and joined Red Bull Salzburg in the winter from Maccabi Tel Aviv. He’s accumulated slightly fewer than 800 minutes from eight starts for Salzburg, but has adapted well and shown his promise, scoring twice and assisting twice in the Austrian Bundesliga. He scored four and assisted eight in 17 appearances for Maccabi Tel Aviv at the start of the season.\nOscar Gloukh's first goal for us was an absolute beauty 🤩 pic.twitter.com/5F4DhBWJSx\n— FC Red Bull Salzburg EN (@FCRBS_en) April 3, 2023\nA compact No 10 (5ft 7in) who excels when receiving the ball between the lines, turning and attacking the goal, Gloukh is quick and agile but also plays so close to the ground that he is hard to dispossess or knock over. Something of a hybrid in style between early-Barcelona Lionel Messi but also a dribbling technique similar to Alexis Sanchez, with plenty of cuts, jukes and chops. He is a menace on the counter-attack.\nHe will attack defenders one-v-one out wide but also pops up in the box frequently to attack crosses, regularly scoring one-touch poacher finishes from rebounds.\nAs he showed against England last summer, he is also capable of the outstanding.\nHe plays a bit like… an early-Barcelona Lionel Messi mixed with Alexis Sanchez.\nAdvertisement\nPlayer: Khephren ThuramNation: FrancePosition: MidfielderClub: NiceAge: 22U21 caps: 14 (2 goals)Khephren Thuram does not play like he is 6ft 4in. The central midfielder, the son of Lilian Thuram and younger brother of Marcus Thuram, was named after an Egyptian pharaoh. He often looks to slalom through set opposition defences with dribbles, aided by long legs and a tall frame which makes him hard to tackle. He is not the cleanest dribbler, but is certainly effective. He made the Ligue 1 team of the year, after all.The 22-year-old Nice midfielder has played alongside Aaron Ramsey and Ross Barkley this season, and could be seen as something of a hybrid of the two. It is not hard to see why many view him as an alternative to Jude Bellingham, particularly given the age and physical profile.\nFor his size, he wins few aerial duels, is a better interceptor than a tackler and a better dribbler than a passer. He attempted as many dribbles in Ligue 1 last season as he received progressive passes (77).\nThe French front line might well take the spotlight, but Thuram will be an essential cog in linking the superstars together.\nHe plays a bit like… Jude Bellingham and former Belgium midfielder Mousa Dembele.\nPlayer: Nicolo RovellaNation: ItalyPosition: MidfielderClub: Monza (on loan from Juventus)Age: 21U21 caps: 18 (3 goals)Italy have always developed technical, playmaking central midfielders and Nicolo Rovella could be the next name on that list.The Genoa academy graduate joined Juventus in January 2021 but spent last season on loan at Monza, playing at the base of a midfield box in a 3-4-3, as they finished 11th with 52 points, the second-best debut season by a team in Serie A history and the best of any newly promoted side in Europe’s top five leagues.Per 90 minutes, Rovella completed the most passes (62.5) of any Monza player last season, while only Stefano Sensi (7.1) completed more into the final third than Rovella’s 5.4. He is brave in tight spaces and will look to wriggle out of pressure, though taking his game to the next level requires Rovella to refine his touch.Andrea Pirlo is the gold standard for Italian midfielders, but Rovella is slightly more box-to-box and combative. His in-possession style is a mix of Jorginho, as a playmaker, but also Marco Verratti’s tenaciousness, off-ball running and liking for duels. His 4.4 tackles plus interceptions per 90 were the second-most of any Monza player last season.Rovella netted three goals in qualifying for this tournament, including two penalties, and was part of the under-17 side that were losing finalists in the 2018 Euros.He plays a bit like…\nJorginho/Verratti.\nPlayer: Ryan Gravenberch Nation: NetherlandsPosition: MidfielderClub: Bayern MunichAge: 21U21 caps: 8 (1 goal)Like all Ajax academy graduates, Ryan Gravenberch’s technical ability and footballing IQ are incredible. His large strides, wiry frame and close control allow him to drive past opponents. In his last season at Ajax, he 3.9 attempted take-ons per 90 minutes, which placed him in the top five per cent among all midfielders in the Dutch top flight.\nPlaying the pass before the assist has become a trademark for Gravenberch and he had 11 pre-assists in the Eredivisie in 2021-22, the most in the division. Often these were incisive passes from wide areas, in behind a defensive line to create cutback or crossing situations.Positionally, he can operate on the left side of a double pivot or in a more advanced left-sided midfield position as a No 8. “He’s one of Europe’s best young players, has excellent technique, always finds solutions in tight space, is very dynamic and a goal threat,” said Bayern sporting director Hasan Salihamidzic when Gravenberch was signed last summer.He has already appeared 11 times for the Netherlands senior side, more than he has featured for the under-21s. Even with limited minutes at Bayern this season, he could truly shine in this tournament at a level he is clearly above.He plays a bit like…\nPaul Pogba.\nAdvertisement\nPlayer: Antonio NusaNation: NorwayPosition: WingerClub: Club BruggeAge: 18U21 caps: 0\nEven with so little experience, Antonio Nusa oozes confidence with the ball at his feet.\nAlready with a Champions League goal to his name, the young winger has been in and out of the first-team set-up this term, though not without glimpses of his shining potential.\nAble to operate on both wings, Nusa is an elusive dribbler who is capable of cutting onto either foot. Back in March, for example, he scored this stunning solo goal to clinch a famous victory against France, showcasing not only his ability to shrug off defenders and cut inside with a quick drop of the shoulder, but also to finish when the opportunity arises.\nAntonio Nusa. 🤯🇳🇴 pic.twitter.com/OcvfF8on7T\n— Fotball Norge (@FotballNO) March 25, 2023\nHis goal catalogue already makes for some viewing, with unstoppable curling efforts, composed lobs and powerful left-footed drives showing encouraging variety.\nNusa is still young even for this level, and shouldn’t be expected to shoulder all of Norway’s attacking responsibility. There’s no doubt, however, that he can be a match-winner.\nHe plays a bit like… Neymar.\nPlayer: Bradley BarcolaNation: FrancePosition: WingerClub: LyonAge: 20U21 caps: 2We’re back to the France squad again.Particularly up front, manager Sylvain Ripoll is spoilt for choice, but Bradley Barcola’s close-season form will surely be enough to earn him a starting berth. The 20-year-old has been a prolific chance creator ever since his debut – registering his maiden assist only 10 minutes into his professional debut — having worked his way through the ranks at Lyon since he was eight years old. Combining devastating pace with an elusive, 6ft 2in frame, Barcola is a direct dribbler who is effective at driving into the penalty area and picking out a team-mate. Alexandre Lacazette has been a big beneficiary this season and is the recipient of Barcola’s last seven Ligue 1 assists.In the dramatic 5-4 win over Montpellier, Barcola’s incisiveness swung the contest, darting in from both flanks to find the veteran striker on three occasions. First, from the left, his searing pace left two defenders in his wake, and then from the right, he tore towards the byline before maintaining his balance and firing in a crisp pass.\nBradley Barcola picked up a hat-trick of assists to lead Lyon to a 5-4 win against Montpellier.\nAt 20 years old, he’s yet another Lyon academy product to make an impression at the first team level after Cherki, Lukeba, Gusto and many more. pic.twitter.com/RVzqkXQREO\n— Zach Lowy (@ZachLowy) May 10, 2023\nAmong other options of supreme technical quality and goalscoring know-how, Barcola is the genuine livewire down the flanks for the French.\nIt’s a team, and a tournament, brimming with top-level quality.\nHe plays a bit like… Wilfried Zaha.\n(Top image: Brobbey, Nusa and Moukoko. Photos: Getty Images/Design: Sam Richardson)",
  "word_count": 4840,
  "scraped_at": "2026-02-14T01:50:37.799115",
  "_text_extracted": true
}