{
  "article_id": "d8010ded27ef",
  "url": "https://www.fourfourtwo.com/person/if-liverpool-won-something-and-he-didnt-score-he-would-be-disappointed-lost-quotes-from-jamie-carragher-on-mohamed-salah",
  "title": "  If Liverpool won something and he didnt score , he would be disappointed ... and Im not saying that a good or bad thing  Lost quotes from Jamie Carragher on Mohamed Salah",
  "date": "20251212T121500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'If Liverpool won something and he didn't score, he would be disappointed...' Lost quotes from Jamie Carragher on Mohamed Salah\nThese exclusive quotes from Jamie Carragher on Mohamed Salah to FourFourTwo back in 2022 suggests there is more to his view of the Liverpool star than meets the eye\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nJamie Carragher did not mince his words when he spoke out on Mohamed Salah's explosive interview last weekend.\nSalah was left on the bench for Liverpool's 3-3 draw with Leeds United last Saturday - the third time in a row he has been named among the substitutes - and responded in explosive fashion, claiming the club have made him a scapegoat for their poor form and saying they have 'thrown him under the bus'.\nThe Egyptian forward also added that 'Tomorrow Carragher is going to go for me again and again and that’s fine', referencing the Sky Sports pundit's recent criticism of him, and Carragher did indeed have his say on Monday Night Football.\n'If Liverpool won something and he didn't score, he would be disappointed'\nThe former Liverpool and England defender did not hold back, calling Salah's interview 'a disgrace' and accusing him of trying to get under-pressure Reds boss Arne Slot sacked.\nBut Carragher then used his platform as a pundit on CBS Sports' Champions League coverage 24 hours later to apologise to Salah, saying: 'Mo, I apologise, I've upset you. I love you as the Liverpool player, but you just need to behave yourself off the pitch.'\nAnd in this exclusive interview with FourFourTwo in 2022, Carragher shed more light on his true feelings towards Salah, who has scored 250 goals in 420 appearances for Liverpool and won two Premier League titles at Anfield.\nCarragher said: 'He just wants to have the absolute best career he can possibly have and I don’t think there’s anything selfish about that.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n'But in terms of people saying he’s selfish? Look how many goals he creates. It’s not just the goals this season, there’s only one player in Trent Alexander-Arnold who’s seemed to create more than him this season, too.\n'That shows his role – and a lot of players, like Thierry Henry, will get goals and assists from their role. That what makes these players so special and I don’t categorise Salah as just a goalscorer because he helps his team so much.\n'It always feels to me that Salah is one those that even if Liverpool won something and he didn’t score, he would be disappointed: he wants to score every game. I don’t think (Sadio) Mane has that mentality – and I’m not saying that’s a good or a bad thing.\n'I only really notice Salah’s supposed selfishness late in games: it’s where Mo hasn’t scored and we’re on the 75-minute mark, he becomes desperate to score every time he plays.\n'I don’t think a goal is the be-all and end-all for (Sadio) Mane, he’s more bothered about his performance. But you know for Mo, it’s all about the goals and that’s what drives him on.\n'Would I have been able to keep him quiet as a defender? Well I couldn’t keep Thierry Henry quiet, so I don’t think I’d have been able to keep Mo Salah quiet!'\nIn FourFourTwo's view, these quotes suggest there is more nuance to Carragher's view of Salah than his outburst on Monday Night Football suggests, with the former defender not necessarily perceiving the Liverpool talisman's 'selfishness' as totally negative.\nJames Roberts is a freelance sports journalist working for FourFourTwo. He has spent the past three years as a sports sub-editor for various national newspapers and started his career at the Oxford Mail, where he covered Oxford United home and away.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 766,
  "scraped_at": "2026-02-14T01:52:59.298115",
  "_text_extracted": true
}