{
  "article_id": "d82ead433b8d",
  "url": "https://metro.co.uk/2025/11/13/man-utd-fall-behind-barcelona-transfer-race-57m-bundesliga-star-24701577/",
  "title": "Man Utd fall behind Barcelona in transfer race for £57m Bundesliga star",
  "date": "20251113T204500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona are the new ‘frontrunners’ to land Harry Kane with Manchester United the second favourites to sign him, according to bookmakers.\nKane, captain of England, has massively shined at German club Bayern Munich since he swapped the Premier League for the Bundesliga in 2023.\nThe 32-year-old striker has conjured up an incredible tally of 108 goals and 29 assists in just 113 games for Bayern after his arrival from Tottenham.\nBut there have been rumours that Kane could leave Bayern this summer with a £57m release clause understood to be in his current contract.\nWhile United are long-term admirers of Kane, it seems he could possibly be heading to the top-flight of Spanish football at the end of the season.\n‘With Harry Kane’s future in Germany potentially up in the air, Barcelona have emerged as the frontrunner to be the English striker’s next club,’ Darragh Harbinson, spokesperson for Esports Bets, said.\n‘Manchester United could well reignite their interest in Kane; they’re 6/1 second favourites to bring him to Old Trafford, with a potential MLS move next on the cards at 8/1.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWhich club will Harry Kane join next?\nAccording to Esports Bets…\nBarcelona – 2/1\nMan United – 6/1\nAny Major League Soccer Club – 8/1\nNewcastle United – 9/1\nTottenham – 10/1\nAny Saudi Pro League Club – 12/1\n‘It seemed destined that Kane would end up back at Tottenham towards the end of his career, however they are 10/1 to be his next move, with a move to Newcastle considered likelier at 9/1.’\nKane becomes Barcelona’s first-choice target\nBarcelona have made Kane their No.1 choice to replace current star Robert Lewandowski, The Guardian have reported.\nLewandowski is 37-years-old and his Barcelona contract is set to expire in June, with the Catalan club seeking a new striker to replace him.\nThe La Liga champions view Kane as the perfect younger replacement and could be set to trigger his release clause.\nWhat is Kane’s stance on joining Barcelona?\nKane’s stance on a move to Barcelona is currently unknown but speaking last month, he said he was open to extending his stay at Bayern Munich and revealed a return to the Premier League was no longer guaranteed.\nMore Trending\nKane, who is under contract at Bayern until 2027, said: ‘In terms of staying longer, I could definitely see that.\n‘I have not had those conversations with Bayern yet but if they were to arise I would be willing to talk and have an honest conversation.\n‘Obviously it depends on how the next year or so goes, what we achieve together. We are in a fantastic moment and I am not thinking about anything else.\n‘In terms of the Premier League, I don’t know. If you had asked me when I first left to go to Bayern, I would have said for sure I would come back. Now I have been there a couple of years I would probably say that has gone down a little bit.’\nMORE: Real Madrid told they must pay £200m to sign Chelsea’s ‘genius’ star\nMORE: Arsenal star told he’d start for Liverpool if sensational January transfer takes place\nMORE: Manchester United linked with pounce for unsettled Borussia Dortmund star",
  "word_count": 587,
  "scraped_at": "2026-02-14T02:06:26.680197",
  "_text_extracted": true
}