{
  "article_id": "d849329af121",
  "url": "https://www.caughtoffside.com/2023/06/28/fabrizio-romano-on-kylian-mbappe-liverpool-transfer-talk/",
  "title": "Fabrizio Romano on Kylian Mbappe Liverpool transfer talk",
  "date": "20230628T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have been linked once again with the ambitious potential transfer of Paris Saint-Germain superstar Kylian Mbappe.\nHowever, Fabrizio Romano has written in his exclusive CaughtOffside column to apologise to disappoint Reds fans about what he’s hearing about these particular transfer rumours.\nRomano insists he’s not hearing anything concrete on Mbappe and Liverpool, though he did suggest that PSG’s plan remains to sell the France international this summer if possible, as he’ll be out of contract and able to move on a free transfer next summer.\nDiscussing the recent Mbappe talk, Romano said: “Fifa agent Marco Kirdemir raised some eyebrows with his quotes to Marca, where he said: ‘Liverpool are competing with Real Madrid and want to pay a fortune for Mbappe.’\n“Sorry to disappoint you, Liverpool fans, but I’m not aware of anything concrete between Liverpool and Mbappe at this stage. Nothing has changed for Mbappe, PSG have been very clear: sign new deal or leave the club this summer, this is PSG’s position for the last two weeks.”\nWhile in most years this might represent a big opportunity for Liverpool, it’s surely impossible for them to consider an ambitious deal like this now when they don’t have Champions League football on offer at Anfield.\nMbappe would be a dream signing for LFC or any other top club for that matter, but the 24-year-old will surely be very picky about where he moves next, and an elite talent like him surely won’t settle for Europa League football.",
  "word_count": 248,
  "scraped_at": "2026-02-14T01:56:02.404612",
  "_text_extracted": true
}