{
  "article_id": "d8861d2b825a",
  "url": "https://metro.co.uk/2024/11/24/man-utd-confident-signing-in-form-star-ahead-arsenal-man-city-22052872/",
  "title": "Man Utd confident of signing in - form star ahead of Arsenal and Man City",
  "date": "20241124T143000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are confident of signing in-form goalscoring machine Viktor Gyokeres ahead of Premier League rivals Arsenal and Manchester City.\nGyokeres, 26, has scored an impressive 24 goals in 19 games this season and 67 in 69 since joining Sporting Lisbon in the summer of 2023.\nThe Sweden international had been plying his trade for Championship side Coventry City but has taken his game and reputation to another level since completing a €20 million move to the Portuguese capital.\nGyokeres’ incredible form – he has three hat-tricks this season, including one against Man City earlier this month – has caught the attention of a number of clubs.\nManchester United have been heavily linked with a move given their current shortcomings in front of goal and the fact their new manager, Ruben Amorim, left Sporting and Gyokeres to take over at Old Trafford.\nPremier League title rivals Arsenal and Manchester City are also believed to be interest in bringing Gyokeres to the Premier League, fully aware that he can be signed for a relatively small fee of £65m.\nThe heavy and wide interest in Gyokeres could lead to a huge transfer tussle ahead of the January transfer window but The Sun say Manchester United are confident of winning the race given the influence of Amorim.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nMan City have reason to be confident themselves, however, as their incoming sporting director Hugo Viana, due to arrive at the Etihad Stadium next summer, is coming from Sporting Lisbon.\nAmorim, who took charge of Manchester United on November 11, refused to fuel speculation he would look to sign Gyokeres at his first press conference as Old Trafford manager.\n‘Viktor Gyokeres is a Sporting player,’ said the 39-year-old who was appointed following Erik ten Hag’s sacking.\n‘He has a game tonight [Friday] and I hope he plays well, doesn’t get injured and continues to be successful at Sporting.’\nOne of Gyokeres’ mentors, ex-Sweden midfielder Anders Limpar, recently urged the prolific forward to complete a ‘crazy’ move to Arsenal.\n‘I know Gyokeres very well personally, I was a bit of a mentor for him when he played for Brommapojkarna, he and Ludwig Augustinsson,’ he told FotbollDirekt.\nSo, I’ve talked a lot about professional life with him. He’s a fantastically hardworking forward who scores a lot of goals.\n‘If we at Arsenal [were to] buy Gyokeres, then he will definitely call me. But then to see Gyokeres at Arsenal, that would be crazy.\n‘His work rate, he runs like a madman. When it doesn’t work out for Viktor, he works his way into the game with uncomfortable runs.\n‘When other top forwards aren’t doing well, they don’t work so hard for the team, they save their energy, Viktor never saves his energy.\n‘When things are a bit slow, he works his way into a game with runs, that’s why it has gone so well.’\nWhile Gyokeres has attracted attention from some of the biggest clubs in Europe, not everyone is convinced he would succeed in the Premier League.\nEx-Manchester United striker Louis Saha has urged his former club to steer clear of Gyokeres and says England captain Harry Kane would be a better signing for the Red Devils.\n‘It might be surprising, but I don’t think Man Utd should go after Viktor Gyokeres,’ Saha told BoyleSports, who offer Premier League odds.\n‘I think he is a good player in an incredible run of form, even in the Champions League, but he won’t get the same luxuries as he does at Sporting.\n‘Sporting are not under the same pressure as Manchester United, it’s a completely different animal.\nMore Trending\n‘Right now United have Rasmus Hojlund and Joshua Zirkzee and at times the pressure has looked to be a lot for them to handle too.\n‘It’s hard to find players who can do what Mohamed Salah and Erling Haaland can do, United need to find players that can really hurt the opposition and are proven in doing so and that’s a big task.\n‘Manchester United have spent a lot of money and I don’t think Gyokeres is the answer.\n‘If you can spend £120million on Harry Kane then they should do it tomorrow, there are very few guarantees in football but that’s what a club like United needs.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ashley Cole names former England and Chelsea team-mate who was ‘on another level’\nMORE: Ilkay Gundogan makes Premier League title prediction ahead of Liverpool vs Man City\nMORE: ‘He does not want to listen’ – Ruben Amorim urged to drop Man Utd star",
  "word_count": 827,
  "scraped_at": "2026-02-14T02:26:24.526207",
  "_text_extracted": true
}