{
  "article_id": "d895fde0a2c0",
  "url": "https://www.liverpoolfc.com/news/believers-brew-carlsberg-and-erdinger-celebrate-jurgen-klopp-limited-edition-beer",
  "title": "  Believers Brew : Carlsberg and Erdinger celebrate Jürgen Klopp with limited - edition beer",
  "date": "20240515T123000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "News'Believers Brew': Carlsberg and Erdinger celebrate Jürgen Klopp with limited-edition beer\nLiverpool FC’s official beer partner Carlsberg has collaborated with Erdinger Weissbräu to launch a special beer in celebration of Jürgen Klopp’s reign.\nThe ‘Believers Brew’, crafted in the departing manager’s honour, is a limited-edition 75cl beer (ABV eight per cent) that has been created using an even split of each beer brand’s signature ingredients.\nThis means the beer is 50 per cent Carlsberg signature pilsner malt and 50 per cent Erdinger signature wheat malt, and yeasts from both businesses in the two-stage brewing process. Plus, this special brew also uses a proportion of unique Red Barley.\nOnly 491 bottles of ‘Believers Brew’ will ever be made and sold, one for each competitive game Klopp oversaw as Reds boss.\nEach bottle will be sold by Carlsberg via an auction, with all proceeds donated to LFC Foundation, to be used to fund programmes for over-18s only. The auction will begin on May 16 through international online auction platform Graham Budd, with starting bids set at £5.\nYou have to accept cookies in order to view this content on our site.\nEach one will be numbered linking back to a specific fixture, including the notable:\n- Bottle 206: Liverpool 4-0 Barcelona (Champions League semi-final, May 2019)\n- Bottle 208: Liverpool 2-0 Tottenham Hotspur (Champions League final, June 2019)\n- Bottle 264: Liverpool 5-3 Chelsea (Premier League, July 2020)\nKlopp’s unforgettable tenure, which began in October 2015, has seen the club win eight trophies, including the Premier League, Champions League and FIFA Club World Cup.\nWith Carlsberg a proud partner of Liverpool FC for more than 30 years and Klopp an Erdinger Weissbräu ambassador since 2020, the collaboration between the brands is one rarely seen in the drinks industry. The ‘Believers Brew’ name draws inspiration from Klopp’s first press conference as Reds manager, during which he spoke of the need to turn ‘doubters to believers’.\nLouise Bach, global sponsorships director at Carlsberg, said: “At Carlsberg, we never stand alone. We stand with our partners, and we are incredibly proud of our over-30-year partnership with Liverpool FC.\n“Curiosity is a key value of ours and football is arguably one of the most curious sports out there, with progression and improvement a constant aim. It has been a pleasure to watch Jürgen’s journey over the last nine seasons.\n“What better way to celebrate such an icon than creating something truly unique, collaborating with Erdinger Weissbräu and raising money for a brilliant cause in the process.”\nThe auction will start on May 16 here and the starting bid for each beer has been set at £5. All auctions will end on May 30.",
  "word_count": 447,
  "scraped_at": "2026-02-14T02:25:33.990857",
  "_text_extracted": true
}