{
  "article_id": "d8b301e70a5f",
  "url": "https://www.bbc.co.uk/sport/football/65329536",
  "title": "Juventu 15 - point penalty for illicit transfer activity is reversed",
  "date": "20230420T221500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Juventus' 15-point penalty over transfer dealings has been reversed, with Italy's highest sporting court ordering the case to be re-examined.\nJuve were punished in January after being found guilty of false accounting.\nThe club have now moved from seventh to third in Serie A, but could still be punished at a later date when a new hearing is held.\nTottenham director of football Fabio Paratici lost his appeal against a 30-month ban as part of the same case.\nThe former Juve sporting director was one of 11 directors at the club, either former or still in place at the time of the ruling, who were sanctioned.\nHe stepped back from his role Spurs when his ban was increased to be worldwide, at the same time as the north London club began searching for a replacement for former manager Antonio Conte.\nLike Paratici, former president Andrea Agnelli, ex-chief executive Maurizio Arrivabene and sports director Federico Cherubini had their appeals rejected.\nFormer player and director Pavel Nedved, Paolo Garimberti and Enrico Vellano were successful with their appeals.\nRather than the club being cleared, Juve's case will now return to the Italian Football Federation appeals court, the body which gave the initial punishment.\nWith eight games to go in the season, AC Milan have been knocked out of the Champions League places by Juve while Roma drop to fourth.\nJuventus chief football officer Francesco Calvo welcomed the decision, saying it provided certainty to theTurin club and the other sides battling to finish in the top four.\n\"As of today, we finally have certainty and we expect that the points that have been given back to us will remain with us forever,\" he added.\nWhy were Juventus docked 15 points?\nThe Old Lady were handed a points deduction after an investigation into the club's past transfer dealings spanning two years from 2019 to 2021 by Italian football's governing body (FIGC).\nJuventus were accused of fixing their balance sheets by artificial gains of around 60m euros from club transfers, charges they were found guilty of by the FIGC's appeals court in January.\nThe club, however, denied any wrongdoing and took their case to a tribunal at the Olympic Committee, Italy's highest sporting court.\nThe tribunal did not rule on the merits of the case but instead examined the legal legitimacy of the punishments handed out by the FIGC to the club and directors.\nJuventus were among several Serie A clubs acquitted of suspect transfer activity by an FIGC appeals court trial last year but the investigation into the club was reopened due to new evidence from a separate criminal probe into their finances.\nThe 15-point sanction was tougher than the nine-point deduction prosecutors had requested.\nWho are the individuals involved?\nAgnelli and the rest of the club's board, including former midfielder Nedved, stepped down in November while the investigation was taking place.\nAt the time, a statement said the resignations were \"considered to be in the best social interest to recommend that Juventus equip itself with a new board of directors to address these issues\".\nThe chairman had presided over the club for 13 years, during which time Juventus won nine successive Serie A titles and reached two Champions League finals.\nBut last year they made a £220m loss - a record for an Italian club.\nAgnelli and Arrivabene were banned from Italian football for two years, with Nedved receiving an eight-month suspension.\nCherubini and Paratici were suspended domestically for 16 months and two and a half years respectively.\nParatici left the club to become managing director at Tottenham before January's ruling but his suspension was extended worldwide by Fifa in March - a decision the 50-year-old is also appealing against.\nJuventus are also facing an investigation from Uefa over potential breaches of its club licensing and financial fair play regulations, which was announced last month.\nBound by fate, a car accident and a dog! A warm-hearted Aussie rom-com about a flawed, funny couple getting it all utterly wrong\nExplore the other side of the games you love: A collection of documentaries about The Dark Side of Sport",
  "word_count": 683,
  "scraped_at": "2026-02-14T01:55:54.945036",
  "_text_extracted": true
}