{
  "article_id": "d8e0cfa5c951",
  "url": "https://www.masslive.com/tv/2025/03/how-to-watch-denmark-vs-portugal-uefa-nations-league-free-live-stream.html",
  "title": "How to watch Denmark vs . Portugal : UEFA Nations League free live stream",
  "date": "20250320T214500Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UEFA Nations League quarterfinals start up on Thursday, March 20 and include a first leg matchup between Portugal and Denmark at Parken in Copenhagen, Denmark.\nThe match is scheduled to start at 3:45 p.m. EDT and will be broadcast on Fubo Sports Overflow. Fans looking to watch can do so for free through FuboTV, which offers a free trial and up to $25 off your first month.\nWho: Denmark vs. Portugal\nWhen: Thursday, March 20 at 3:45 p.m. EDT\nWhere: Parken in Copenhagen, Denmark\nStream: FuboTV (free trial)\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $25 off the first month for new customers.\nMore College Football\n- 2026 CFP National Championship: Watch Miami vs. Indiana for free tonight\n- Where to watch Miami vs. Indiana National Championship free stream today\n- Ticket costs surge for Miami vs. Indiana college football championship game\n- Where to watch Oregon vs. Indiana Peach Bowl free stream today: College Football Playoff Semifinal\n- Where to watch Oregon vs. Indiana in Peach Bowl for free tonight\nRELATED CONTENT:\nFIFA report highlights the inequities in women’s soccer\nBy ANNE M. PETERSON AP Sports Writer\nDespite the growing attention on women’s soccer globally, the vast majority of players and teams still struggle for resources and investment.\nFIFA on Monday released its annual report on the women’s game, highlighting the inequities across the sport.\nSoccer’s world governing body expanded the fourth edition’s scope from 34 leagues to 86 leagues and some 669 teams, providing a more accurate picture of the state of the game. It analyzed data in six areas: sporting, governance, financial landscape, fan engagement, data and digital, and player-related matters.\nThe report separated the leagues into three tiers, based on various criteria including whether the leagues had senior level competitions, the number of players that were on a 2023 Women’s World Cup roster or a premier tournament like the Women’s Euros, and the member association’s budget for women’s soccer.\nThe report found that the average gross salary across all tiers was $10,900, but that number was skewed by 16 clubs in the top tier that paid players an average of more than $50,000. The average salary for top-tier teams was $24,030 globally — less than a living wage in many places.\nWomen’s soccer is not yet profitable, with top-tier leagues generating an average of $4.4 million in revenue but spending an average of $7.6 million. The lowest tier averaged $76,000 in revenue, with $182,000 in expenses. FIFA did not identify the individual clubs within each each tier.\nOnly 22% of the clubs surveyed had women’s coaches, the report said.\nThe majority of top-tier leagues had domestic broadcast deals (91%) compared to 32% in the bottom tier. Just 42% of the third-tier teams have a title sponsor, compared to 69% at the top.\nThe report comes as FIFA introduced two more international club tournaments, the 2026 Women’s Champions Cup and the 2028 Women’s Club World Cup.\nThe organization announced earlier this month that 19 teams will take part in the first-ever Women’s Club World Cup in January-February 2028.\nThe new Women’s Champions Cup will include the six continental club champions and will be played in January next year.\nIt is hoped that the competitions spur more investment by keeping attention on the players even when it’s not a Women’s World Cup year.\n“This month FIFA announced the timelines and formats for two new, landmark, global FIFA women’s club competitions,” FIFA President Gianni Infantino said in a statement Monday. “As we embark on the development of these tournaments, it is equally important that we offer insights and resources to women’s football stakeholders so that together we can build on the solid foundations already in place. FIFA will utilize the findings to build tailor-made programs that will support member associations to continue to professionalize women’s football — this is critical as we embark on a new era for women’s club football on the global stage.”\nThe Associated Press contributed to this article.",
  "word_count": 739,
  "scraped_at": "2026-02-14T01:49:31.514127",
  "_text_extracted": true
}