{
  "article_id": "d8e28129ab38",
  "url": "https://www.thenews.com.pk/print/1237224-imperfect-psg-fighting-on-all-fronts-luis-enrique",
  "title": "  Imperfect  PSG fighting on all fronts : Luis Enrique",
  "date": "20241005T223000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘Imperfect’ PSG fighting on all fronts: Luis Enrique\nPARIS: Paris Saint-Germain coach Luis Enrique insisted Saturday his \"imperfect\" side were still in the fight on all fronts this season despite a Champions League defeat to Arsenal.\nThe French champions travel to Nice on Sunday looking to bounce back in the comfort of Ligue 1 action after this week´s 2-0 defeat in London.\n\"We are imperfect, we will improve but I am sure that this team will battle in all competitions,\" Spaniard Luis Enrique told a pre-match press conference.\n\"If we replay this match against Arsenal, at home at the Parc des Princes, perhaps the result will not be the same.\"\nThe former Spain manager defended Italian goalkeeper Gianluigi Donnaruma after a disappointing performance against Arsenal.\n\"When there´s a defeat, it´s very sad to hit out at a player. We often pick on Donnarumma, please leave him alone and pick on me instead,\" he told journalists.\nLuis Enrique believes his PSG are \"not far\" off the Gunners of compatriot and former Barcelona teammate Mikel Arteta.\n\"Arteta has led his team for five years. For us, it´s been a year and three months,\" said the former Barcelona and Roma coach.\n\"It´s not an excuse, I get up every morning to go and win all the competitions.\n\"But the difference between a coach, a sports management who have worked together for five years exists,\" he continued, adding that sometimes his aim was to \"build a team\" and not to win a trophy.\nThe Spaniard was tight lipped when asked about Ousmane Dembele´s presence against Nice after being axed against Arsenal for disciplinary reasons.\n\"When a player doesn´t match the obligations, he is on the sidelines but when he meets them he is ready. I am tough when I have to be tough, and more tolerant when I can be. That´s my role,\" he said.\nPSG face Nice at the top of Ligue 1 on goal difference from Monaco who can take provisional command of the table depending on the outcome of their trip to Rennes later Saturday.\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters\n-\n'A Very Special Visitor' Meets Queen Camilla At Clarence House\n-\nJodie Turner Smith Shares One Strict Rule She Follows As A Mom\n-\nHailey Bieber Reveals KEY To Balancing Motherhood With Career\n-\nPhoto Of Jay-Z, Other Prominent Figures With Jeffrey Epstein Proven To Be Fake\n-\nHillary Clinton's Munich Train Video Sparks Conspiracy Theories\n-\nFans Slam Talk Show Host For 'cringe' Behavior In Chris Hemsworth Interview\n-\nWoman Jailed Over False 'crime In Space' Claim Against NASA Astronaut\n-\nJames Van Der Beek’s Close Pal Reveals Family's Dire Need Of Donations\n-\nPrince William And Harry's Cousins Attend 'Wuthering Heights' Event\n-\nHailey Bieber Turns Heads Just Hours After Major Business Win\n-\nKing Charles' Andrew Decision Labelled 'long Overdue'\n-\nTimothee Chalamet 'forever Indebted' To Fan Over Kind Gesture\n-\nColumbia University Sacks Staff Over Epstein Partner's ‘backdoor’ Admission\n-\nOzzy Osbourne's Family Struggles Behind Closed Doors",
  "word_count": 520,
  "scraped_at": "2026-02-14T02:25:58.971561",
  "_text_extracted": true
}