{
  "article_id": "d8eeeaf9ca50",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-10-man-shortlist-pedigree-signing-amorim-formation",
  "title": "Man Utd transfer news : 10 - man shortlist made for  pedigree  defensive signing to save Amorim formation",
  "date": "20251225T130000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd draw up 10-man shortlist for ‘pedigree’ signing that can save Amorim’s formation\nManchester United are considering accelerating their plans to strengthen in defence after shortlisting around 10 players with a view to making sure Ruben Amorim’s system is ready for European football, sources have revealed.\nWhile the main focus of Man Utd transfer news recently has been about midfielders they could sign in 2026, with plans to strengthen in each of the next two transfer windows where possible, their defence is also under consideration.\nAnd it’s not just the wing-back areas, which are fundamental to Amorim’s 3-4-2-1 formation, that are ripe for reinforcement, as we can confirm they have eyes on the centre-back department.\nTEAMtalk’s Dean Jones has revealed how United are looking for a ‘player of some pedigree’ to make sure a back-three formation remains ‘sustainable’ – especially if they have European football to add into the mix next season.\n“I am hearing that Man United have a shortlist being drawn up as they look at names to target for the defence in 2026,” Jones said. “I was told there are around ten names on the list – a couple from within the Premier League, but most from elsewhere in Europe.\n“It’s becoming an area of more concern recently, because suddenly without Mazraoui, De Ligt and Maguire available you start to wonder how a three-man defence is sustainable.\n“Lisandro is back in the frame, but obviously you have to have some caution about what can be expected of him as he returns and, from what I understand, United are just keen to get in another player of some pedigree to make sure they are continuing to evolve.”\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nMan Utd ‘making sure Amorim’s system works better next season’\n“You see what they were trying with Semenyo, it is about more than just the here and now,” Jones continued. “It is about making sure Amorim’s system works better next season and that it is built to work in Europe as well as in the Premier League.\n“The plan is to definitely do defensive business in the summer but, given the fact they are currently just three points off the top four, it would not surprise me if they were to look at accelerating that.\n“The Premier League is looking very open and even though United have not been totally convincing they are still in the mix to reach the Champions League – which is the objective set out for Amorim at the start of the season.\n“The midfield is obviously still a big problem and they are trying to find solutions in there, but United are looking to improve on all fronts when they can.”\nWant more Man Utd transfer news?\nIn other news, sources have confirmed there is little thought of Mason Mount leaving United in 2026, with the midfielder’s full focus on continuing his long-awaited return to form with the Red Devils.\nElsewhere in the United midfield, though, Casemiro’s future is far from certain, with MLS clubs viewing him as a target – in competition to United’s own plans to offer him a contract renewal on reduced wages.\nMeanwhile, Fabrizio Romano has revealed the promise United made to City-bound Antoine Semenyo if he’d agreed to join them instead.",
  "word_count": 572,
  "scraped_at": "2026-02-14T01:59:31.514755",
  "_text_extracted": true
}