{
  "article_id": "d8fcbd7e7f28",
  "url": "https://www.finanznachrichten.de/nachrichten-2026-01/67576212-redbird-capital-partners-completes-refinancing-of-ac-milan-004.htm",
  "title": "RedBird Capital Partners Completes Refinancing of AC Milan",
  "date": "20260130T171500Z",
  "domain": "finanznachrichten.de",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New Debt Facilities Create Long-Term Financial Flexibility and Eliminate Loans Related to the Acquisition of the Club in 2022\nRedBird Capital Partners today announced the successful completion of a refinancing that strengthens AC Milan's capital structure and long-term financial flexibility.\nThe transaction refinances the acquisition-related vendor financing originally provided by entities advised by Elliott Advisors UK Limited (\"Elliott\") in connection with RedBird's acquisition of AC Milan and replaces it with new institutional debt financing arranged by Comvest Credit Partners.\nThe refinancing aligns the Club's capital structure with RedBird's long-term strategic and operational objectives for AC Milan as the club's sole control owner. As part of the transaction, Elliott Managing Partner Gordon Singer and Associate Portfolio Manager Dominic Mitchell will step down from the AC Milan Board. No other changes have been made to the Board or Management team, preserving continuity in the Club's governance and operational oversight.\nGerry Cardinale, RedBird's Managing Partner and President of AC Milan, said, \"Over the past three years, we have worked to consistently strengthen AC Milan's financial and sporting performance, returning the Club to profitability and building a strong, more sustainable foundation for its future. Our ownership of AC Milan is driven by a long-term commitment to the Club, its leadership in the city of Milan and its heritage as one of the most successful European football clubs in the world. With the San Siro project now underway, we are even more confident in the Club's trajectory and our ability to support its continued growth and success. We will continue to identify opportunities to enhance value while elevating AC Milan and the city of Milan on the world stage.\"\nGordon Singer said, \"We are proud of what AC Milan has accomplished since Elliott acquired the club in 2018. Under Elliott's ownership and subsequently RedBird's, the club's financial and sporting performance have improved significantly and the team has won two major trophies, including the 2021/22 Scudetto. The stewardship of a historic institution like AC Milan is an important responsibility, and we wish RedBird continued success in the future.\"\nAbout RedBird Capital Partners\nRedBird Capital Partners is a private investment firm that builds high-growth companies and provides strategic capital solutions to founders and entrepreneurs. Founded in 2014 by Gerry Cardinale, RedBird integrates sophisticated private equity investing with a hands-on business building mandate, focusing on two core ecosystems Sports, Media Entertainment and Financial Services. The firm currently manages over $14 billion in assets on behalf of a global group of blue chip institutional and family office investors.For more information, please go to www.redbirdcap.com.\nAbout AC Milan\nFounded in 1899 in Milan, Italy, AC Milan is one of the most iconic and historic brands in global sports. In its 125-year history, AC Milan's on-the-pitch success has been marked by 7 Champions League titles (2nd most in European football), 19 Serie A titles, 5 UEFA Super Cup (record: tied) and a FIFA World Cup. The Club currently plays its home games at San Siro Stadium in Milan and is developing a new 70,000 seat stadium that will be one of the most advanced modern sports and entertainment complexes in the world. With its sporting accomplishments and iconic red and black striped jersey, AC Milan is among the most recognized sporting brands in the world, with over 550 million fans globally. In August 2022, RedBird Capital Partners, a New-York based private equity firm founded and led by Gerry Cardinale, became the controlling owner of the Club. As part of that acquisition, RedBird brought in its long-time partner the New York Yankees as a minority investor. AC Milan has offices in Milan and Dubai. For more information, please visit www.acmilan.com.\nView source version on businesswire.com: https://www.businesswire.com/news/home/20260130940582/en/\nContacts:\nDan Gagnier\nGagnier Communications\nRedBird@gagnierfc.com\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 713,
  "scraped_at": "2026-02-14T02:12:22.651242",
  "_text_extracted": true
}