{
  "article_id": "d906f25bd8d6",
  "url": "https://www.bbc.com/sport/football/articles/cg5m4g0veglo",
  "title": "Women Champions League : How have Man Utd , Chelsea and Arsenal done so far as knockout stage looms ? ",
  "date": "20251218T053000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Are English clubs ready for Champions League knockouts?\n- Published\nEnglish clubs are having another strong season so far in the Women's Champions League - so where do they stand going into the knockout stages?\nDefending champions Arsenal secured a seeded play-off spot, alongside debutants Manchester United, with a 3-0 victory over OH Leuven on Wednesday.\nUnited recorded a 1-0 win at Juventus, while Chelsea have gone one better than their domestic rivals. They are automatically through to the quarter-finals following a 2-1 win at Wolfsburg.\nThe draw for the play-offs takes place at 12:00 GMT on Thursday, 18 December, while the quarter-final ties will be played on 24-25 March and 1-2 April.\nChelsea impress on way to last eight\nChelsea's campaign got off to an underwhelming start when they drew 1-1 with FC Twente in October, but since then they have looked impressive, scored bucketloads of goals, and remained unbeaten.\nThey finished third in the table with four wins from six, scoring 20 goals and conceding just three - only Barcelona matched their goal difference.\nSonia Bompastor's side have had their fair share of European heartbreak, often at the hands of three-time champions Barcelona, who beat them 8-2 on aggregate in last season's semi-finals.\nYet the Blues were the only team to take points off Barcelona in this year's league phase, securing a 1-1 draw at Stamford Bridge in November.\nThat put them in a strong position to secure a top-four automatic qualification spot and they pounced on the opportunity, with a ruthless 6-0 win over St Polten followed by Wednesday's massive win at Wolfsburg.\nChelsea will face either Manchester United or Arsenal in the quarter-finals should their English rivals both win their two-legged play-offs.\nThey cannot meet Barcelona or eight-time winners Lyon until at least the semi-finals.\nAs well as their strong results, Chelsea have been boosted by the return of injured players, most notably forwards Sam Kerr and Lauren James.\nWith number one goalkeeper Hannah Hampton also set to return following the winter break, Bompastor's squad are well placed to chase an elusive European title.\nTitle defence rolls on as Arsenal search for form\nArsenal began the defence of their European title with defeat by giants Lyon in their opening match of the league phase.\nThey lost 3-2 at Bayern Munich in November and scraped through a tough evening at home to Real Madrid to pick up a 2-1 win, keeping their qualification hopes on track.\nA nervy 1-0 win over FC Twente ensured they would make at least the play-offs, and they eased to a 3-0 win over Leuven on Wednesday to claim fifth place.\nIt has not been a convincing season by any means and Arsenal would have been aiming for automatic qualification to the quarter-finals, but given the dip in form and where they found themselves in November, they have done well.\nThey await Thursday's draw (12:00 GMT) to find out if they will play Atletico Madrid or Leuven in the play-offs.\nShould they get through that, they have Chelsea or Bayern Munich waiting in the quarter-finals.\nRenee Slegers' Gunners side produced the unthinkable last season when they stunned Barcelona to win the title, after managerial upheaval earlier in the campaign, and they will be seeking fresh inspiration to continue their run this time.\nDebutants Man Utd exceed expectations\nGiven this is United's debut season in the main draw of the Women's Champions League, head coach Marc Skinner can be pleased with his side's progress.\nA 2-1 home win against Paris St-Germain and a 1-0 win at Juventus were the pick of the bunch as United grabbed four victories from their six matches.\nTheir aim was always to finish inside the top 12 and to cap it off with a seeded spot in the play-offs was a strong finish to the league phase.\nHowever, their 3-0 defeat by Lyon in December showed the gap between United and Europe's elite, so greater challenges lie ahead.\nSkinner has called for action in the January transfer window, saying he must add squad depth if United want to keep competing in Europe.\nThey avoided a potential meeting with Arsenal in the play-offs following Wednesday's victory in Turin and will face either Leuven or Atletico Madrid next.\nSkinner will hope key England internationals Jess Park and Ella Toone remain fit, while two-time champion Fridolina Rolfo - who has played in five finals with her former clubs Barcelona and Wolfsburg - can use her experience to guide them further.\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 794,
  "scraped_at": "2026-02-14T01:52:59.291314",
  "_text_extracted": true
}