{
  "article_id": "d91bcce6cb0a",
  "url": "https://punchng.com/npfl-2023-24-xi/",
  "title": "NPFL 2023 / 24 XI",
  "date": "20240625T033000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After an exhilarating 38 rounds of matches, which saw Enugu Rangers win their eighth Nigeria Premier Football League title, here is PUNCH Sports Extra’s Team of the Season as presented by ABIODUN ADEWALE\nGOALKEEPER\nAmas Obasogie (Bendel Insurance)\nIn his second consecutive season in the NPFL, Bendel Insurance keeper, Obasogie has continued to show why he is rated as one of the best shot-stoppers in the Nigerian elite division by keeping most clean sheets (18) in the campaign, three more than his closest rivals – Remo’s Kayode Bankole and Doma United’s Kingdom Osayi. Insurance also conceded the least goals (30) during the season.\nAfter finishing the abridged league with eight clean sheets in 18 games last term, he started the 2023/24 season with the motivation of being invited into the Super Eagles camp in November 2023 and performances like this are capable of earning him another call-up to the national team.\nDEFENDERS\nSodiq Ismail (Remo Stars)\nDubbed the ‘assist king’ of the NPFL, newly capped Super Eagles defender, Ismail proved himself as one of the best right-backs to have played in the league recently. Playing his first full season, the defender returned 13 assists and one goal in 34 matches to boost Remo Stars CAF Champions League ambitions. His impressive work rate and delivery also earned him a call-up to the Super Eagles, making his debut as a substitute in the 2-1 defeat to Benin Republic in Abidjan, Ivory Coast. He stands undisputedly in the right-back position.\nIfeanyi Onyebuchi (Enugu rangers)\nOnyebuchi moved with Coach Fidelis Ilechukwu from Plateau United to Enugu Rangers and ‘the scoring defender justified the confidence reposed in him by the gaffer, providing adequate cover for their goalkeeper as the Flying Antelopes bagged their eighth NPFL title. In 36 appearances, the 24-year-old scored two goals in consecutive games against Heartland and Sunshine Stars – during their 10-game unbeaten run, the longest streak in the season. The Flying Antelopes also conceded the joint-second least number of goals (33)..\nGbolagade Adelowo (3SC)\nOne of the few ever-present players in the 2023/24 NPFL, Adelowo played every game for Shooting Stars as the Oluyole Warriors achieved their best league finish in a decade. In his first season in the topflight, the 26-year-old scored two goals plus two assists in 38 games, which saw 3SC concede 34 goals. He was crowned the club’s Player of The Season, which came with a cash prize of N500,000 from the Governor of Oyo State, Seyi Makinde. Gbolagade and Onyebuchi of Rangers will make a good centre-back pair.\nKenneth Igboke (Enugu Rangers)\nCompleting the defence on the left side is another Super Eagles invitee, Igboke of Enugu Rangers. Despite being on rotation, the 18-year-old’s quality was continuously evident when paraded by champions Rangers. He also contributed two goals and one assist in 20 games to enhance their quest. When the Super Eagles were in need of a left-back from the league in the last 2026 World Cup qualifiers window, ex-coach Finidi George looked no further in picking the Rangers man to balance his team, a testament to his quality.\nMidfielders\nKenechukwu Agu (Enugu Rangers)\nDespite missing a number of games this season, Rangers midfielder, Agu, had the numbers to muscle out some other names like Jide Fatokun of Remo Stars, Enyimba’s Daniel Daga and Duke Osimaga of Sunshine Stars (who only failed to start one game) for a place in the best XI. He featured in lesser games and in just 19, the 24-year-old notched four goals and one assist to help the Flying Antelopes win the title with a game to spare.\nRabiu Ali (Kano Pillars)\nLike an old wine, Rabiu Ali keeps getting better with age. At 43, and on his return to the topflight after a year in the second division, Ali dropped a double digit of goals (10) plus nine assists for Kano Pillars. Although the former champions didn’t go close to the title or any of the continental spots, their captain continued to cheat nature, playing 35 games this term. One of the players who can rival Ali for a place in the midfield is Katsina United’s Michael Ibe, who scored nine goals and provided five assists for Pillars’ neighbours.\nKazeem Ogunleye (Enugu Rangers)\nFrom scoring long-range stunners to free kicks, Ogunleye dazzled throughout for winners Rangers. He also joined them last season from Plateau United, being his second season in the topflight. The former Ijebu United man delivered six goals and six assists in 33 games. The nimble-footed winger is a perfect slot on either the left or right side of the field, depending on how he is deplored by the coach.\nTaofeek Malomo (3SC)\nWhen Malomo was handed the 3SC captain band at the start of the season, the player knew he had some great responsibilities on his shoulders and he delivered with seven goals and two assists to ensure the Oluyole Warriors recorded their best NPFL finish in 10 years. Even as a midfielder, Malomo covers the blades on the flanks and with a player like Ogunleye on the flanks as well, his inclusion brings flexibility in switching between a 4-42 and 4-3-3 formation. In the former, he mans the right-hand side of the middle, while in the latter, he drops deep to join a three-man midfield while Ogunleye teams up with the other two attackers for a three-man frontline.\nFORWARDS\nChijioke Mbaoma (Enyimba)\nNPFL Golden Boot winner, Mbaoma undisputedly takes one of the spots upfront. With 17 goals in the kitty, he stands as the most prolific man in the NPFL with his powerful finishes. Mbaoma has been on the horizon for the past two seasons, playing second fiddle to the previous winner of the top scorer award, Emeka Obioma, and he took his chance to lead the line for Enyimba when he had it.\nSikiru Alimi (Remo Stars)\nRunners-up in the Golden Boot race, Alimi completes the Team of the . He scored 15 goals to end up in second place behind Mbaoma. After contributing nine goals in the second half of the 2021/22 season, Alimi returned to Ikenne last season and attention was on him to pick up his scoring job where he left off. He didn’t disappoint though as his contribution propelled them to the CAF Champions League spot for the second successive season.\nCOACH\nFidelis Ilechukwu (Enugu Rangers)\nThe handler of the team will be no other than Fidelis Ilechukwu, who guided Rangers to the title in his first season with the Flying Antelopes. He recorded 21 wins, seven draws, and 10 defeats in 38 games, being the highest and lowest respectively. . Under him, the Flying Antelopes also recorded the longest unbeaten run of the season (10).",
  "word_count": 1116,
  "scraped_at": "2026-02-14T01:51:32.422844",
  "_text_extracted": true
}