{
  "article_id": "d91b0546ca3b",
  "url": "https://www.themag.co.uk/2024/04/crystal-palace-2-newcastle-0-instant-newcastle-united-fan-writer-reaction/",
  "title": "Crystal Palace 2 Newcastle 0 - Instant Newcastle United fan / writer reaction",
  "date": "20240424T234500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace 2 Newcastle 0 – Instant Newcastle United fan / writer reaction\nCrystal Palace 2 Newcastle 0 – Wednesday 24 April 8pm\nInstant fan / writer reaction from some of our regular contributors on The Mag.\nNat Seaton:\n‘It took until the 86th minute to have an attempt on target and that was a tame header from Anderson, this just sums up our night.\nA below par performance from just about all the outfield players and Dubravka didn’t have much to do, but what he did was not Premier League level.\nThere has to be a big improvement for Saturday, thankfully no 11 day break before that one!’\nJamie Smith:\n‘Really poor stuff this.\nWe had 11 days to prep for this while Palace had three.\nThe way some of our lot played you’d think it was the height of December when we were trying to navigate a nightmare Champions League group and constant nightmare cup draws.\nThe formation jiggers that undid Spurs just seemed to cause confusion and I think Howe made an error in not wanting to change a winning team, instead of picking a team and formation to beat Palace.\nNo mistake, they are a team in form, but we helped them with the return of ponderous possession, slow, wasteful deliveries and absolutely no sign of a killer ball. Not having a shot on target until the 95th minute is utterly miserable.\nEurope still very much on but the remaining five games will be tentatively approached in the knowledge that this sort of rotten performance can crop up at any given time, as it has done so often to disrupt this season.’\nBilly Miller:\n‘Not good enough tonight.\n‘With every result, in the hunt for Europe, going our way recently, it felt like we could really kick on at Selhurst Park.\nTwice Man United were behind whilst our score was level but that lot turned it around and we were deservedly beaten by Palace.\nOnly 5 games left but I expect twists and turns aplenty.’\nDavid Punton:\n‘A bad night for us.\nNothing has come off, we were disjointed, shot shy, and we’ve deservedly lost the game.\nMind you, United should have had a penalty at 1-0 though, that was definitely a case of the VAR getting it wrong.\nMidweek games in London never seem to suit us.\nEddie Howe must be scratching his head after that showing.\nWe are way better than this and we can definitely play better. It’s frustrating.\nSome major ground has been lost in the race for European football as the season nears its end.\nThe weekend off didn’t do us any good!’\nGToon:\n‘Quite a few people comment about this season being pretty decent with the injuries etc but how do we explain this result?\nNo shots in the first half!\nThe worst teams in the league will have had more shots than us.\nWe might have been denied a blatant penalty but there’s something lacking either tactically or fitness wise when we follow up 4-0 wins with rubbish like that.\nLike I’ve said many a time, I can’t wait for this season to end.’\nBazoox:\n‘Disappointed with the result but it was’nt totally unexpected. Palace have some canny players and can give anybody a game on their day.\nFar, far from great and so roll on Sheff Utd at the weekend to hopefully get this performance well out of our system.\nSafe journey home too for all the lads and lasses, and even Tony might crack a smile with Luckypool seemingly blowing their title chances against the scouse mackems.’\nTony Mallabar:\n‘Disappointing but Palace were the better team.\nWell done to the Palace manager after his spell in Starsky and Hutch.\nBig up to the Palace midfielder Eze who looked a class act.\nAlso thought the Palace ultras brought a great atmosphere to the game with their empoli ultras tribute act.\nAnd a big up to Anthony Gordon.\nI was 8 rows from the front and boy that lad covered every blade of grass tonight.’\nMatt Busby said to Joe Harvey…:\n‘That was a very poor performance.\nNot enough desire.\nToo many wayward passes.\nSecond best all over the park, as evidenced by only two shots on target.\nMaybe we should have had a penalty when Hughes pulled Longstaff back but the referee and VAR saw it differently.\nLet’s face it though, if you’re relying on something like that to get you out of gaol, it just about sums up how bad it was.’\nStats via BBC Sport:\nCrystal Palace 2 Newcastle 0 – Wdnesday 24 April 8pm\nGoals:\nNewcastle United:\nPalace:\nMateta 55, 88\n(Half-time stats in brackets)\nPossession was Palace 47% (51%) Newcastle 53% (49%)\nTotal shots were Palace 20 (9) Newcastle 6 (1)\nShots on target were Palace 7 (5) Newcastle 2 (0)\nCorners were Palace 7 (4) Newcastle 2 (0)\nReferee: Thomas Bramall\nNewcastle team v Crystal Palace:\nDubravka, J Murphy (Wilson 65), Krafth, Schar, Burn, Longstaff (White 90), Bruno, Anderson (Ritchie 90), Gordon, Barnes (Hall 65), Isak\nUnused subs:\nKarius, Dummett, Livramento, A Murphy, Parkinson\n(Match Report – Crystal Palace 2 Newcastle 0 – United get what they deserved – Read HERE)\nNewcastle United matches now confirmed for rest of the season:\nSaturday 27 April 2024 – Newcastle v Sheff Utd (3pm)\nSaturday 4 May 2024 – Burnley v Newcastle (3pm)\nSaturday 11 May 2024 – Newcastle v Brighton (3pm)\nWednesday 15 May 2024 – Man U v Newcastle (8pm) Sky Sports\nSunday 19 May 2024 – Brentford v Newcastle (4pm)\n(The final day of the season live TV matches will be selected closer to the day but all 10 PL games will be same time same day)\nWednesday 22 May 2024 – Tottenham v Newcastle (at MCG – Melbourne Cricket Ground)\nFriday 24 May 2024 – A-League All Stars team v Newcastle (at Marvel Stadium, Melbourne)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 997,
  "scraped_at": "2026-02-14T01:48:46.194449",
  "_text_extracted": true
}