{
  "article_id": "d9257542d28e",
  "url": "https://www.empireofthekop.com/2025/05/01/szoboszlai-gerrard-liverpool-champions-league-mission/",
  "title": "Szoboszlai striving to emulate Gerrard by winning UCL with Liverpool",
  "date": "20250501T160000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dominik Szoboszlai has now won trophies in both of his seasons so far at Liverpool, following up last year’s Carabao Cup success with Premier League glory this term.\nHowever, the 24-year-old has one omission from his CV that he’s desperate to accomplish at Anfield – becoming a European champion and emulating one of his most famous predecessors in the Reds’ number 8 shirt.\nIt was 20 years ago this month that Steven Gerrard captained LFC to Champions League immortality in Istanbul, and the Hungarian – who’s been challenged by Jamie Carragher to improve his goalscoring output – is fully aware of the legacy of the club legend from Huyton, who Rafael Benitez hailed as the best player he’s ever coached.\nSzoboszlai targeting Champions League glory with Liverpool\nSzoboszlai was speaking to Spíler TV after Liverpool’s 5-1 romp over Tottenham Hotspur which secured the Premier League title, and he made a thinly-veiled reference to his desire to succeed the former Reds captain by lifting the biggest prize in European club football.\nThe 24-year-old said of Gerrard (via Hungary Today): “He is a club legend. I think he did so much for the club that he should be remembered as a legend, even if he did not win the Premier League, but he has won something I have not won. Now that is the next goal.”\nSzoboszlai has a huge personal incentive to win next season’s Champions League\nHaving won the English top-flight title so emphatically this season, the natural goal for Liverpool in 2025/26 is to retain the crown and also try to win the Champions League alongside it, having not claimed both prizes in the same year since 1983/84 (when, of course, the latter was still the European Cup).\nIt felt for a decent chunk of this campaign that the Reds could do the double in Arne Slot’s first attempt, particularly after finishing top in the expanded league phase which was introduced for 2024/25, only for Paris Saint-Germain to shatter that ambition in the round of 16.\nSzoboszlai has an added personal incentive to help his side become champions of Europe next year, as the final is on his native Hungary, with Budapest’s Puskas Arena hosting the showpiece in May 2026.\nThe 24-year-old has already outdone Gerrard in one sense by winning the Premier League, but he’s naturally eager to join the former Liverpool captain as a Champions League winner with the club. Oh how we’d love to see him achieving that personal ambition in just over 12 months’ time!",
  "word_count": 420,
  "scraped_at": "2026-02-14T01:52:20.882076",
  "_text_extracted": true
}