{
  "article_id": "d926918918bb",
  "url": "https://news.yahoo.com/tottenham-vs-chelsea-live-premier-144917363.html",
  "title": "Tottenham vs Chelsea LIVE : Premier League latest updates as Oliver Skipp scores first Spurs goal",
  "date": "20230226T153000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham vs Chelsea LIVE: Premier League result and final score after Harry Kane and Oliver Skipp goals\nFollow live updates as Tottenham host Chelsea in the Premier League, with Graham Potter’s side desperate for a win in today’s London derby.\nChelsea have won just twice in their last 14 Premier League matches, a woeful run of form that dipped even further following last weekend’s 1-0 home defeat to Southampton, and face a Spurs side who were lifted by their victory over West Ham last time out.\nThe result moved Tottenham into the top four and Antonio Conte’s side can tighten their grip on fourth spot with another three points this afternoon, although the Italian will be missing from the sideline once again.\nChelsea’s top-four hopes are slim and defeat would surely close the door for good. It would also increase the pressure on Potter’s position. The Chelsea manager revealed on Friday that he and his family have been subjected to death threats amid his side’s poor run but defeat at the Tottenham Hotspur Stadium would be a further test of the club’s patience.\nFollow live updates from Tottenham vs Chelsea in the Premier League, below\nTottenham vs Chelsea LIVE: Latest Premier League updates\nTottenham host Chelsea in Premier League\nChelsea are without a win in five in all competitions, Tottenham can go four points clear of Newcastle\n46’ GOAL! - Skipp rockets Spurs into the lead (TOT 1-0 CHE)\n45+5’ RED CARD OVERTURNED - Ziyech is sent off, then recalled after VAR check (TOT 0-0 CHE)\n43’ SHOT! - Sterling darts in and unleashes a right-footed effort that Forster keeps out (TOT 0-0 CHE)\n27’ POST - Hojbjerg’s deflected effort strikes the post (TOT 0-0 CHE)\n19’ INJURY - Thiago Silva forced off early after challenge on Harry Kane (TOT 0-0 CHE)\nTottenham Hotspur FC 2 - 0 Chelsea FC\nFT Tottenham 2-0 Chelsea\n15:37 , Michael Jones\nOliver Skipp’s goal was scored 19 seconds into the second half, the earliest such goal in a Premier League game since Gerard Deulofeu for Watford vs West Ham in May 2019 (45:11).\nFull-time: Tottenham 2-0 Chelsea\n15:30 , Michael Jones\n90+6 mins: It’s another defeat for Chelsea! Goals from Oliver Skipp and Harry Kane are enough to earn Spurs the win and moves them four points clear of Newcastle in fourth place.\nChelsea have now gone six games without a win. Graham Potter’s tenure continues to grow ever worse.\nTottenham 2-0 Chelsea\n15:26 , Michael Jones\n90+3 mins: Corner to Chelsea! Mudryk takes the corner and whips the ball onto the head of the first defender. Ben Chilwell then gives the ball away and Pedro Porro curls a long crossfield pass over to the left wing by Son Heung-min gives up on his run.\nChelsea recover possession.\nTottenham 2-0 Chelsea\n15:24 , Michael Jones\n90 mins: There’s still a bit of hope for Chelsea as six minutes of stoppage are shown on the board. The Blues need to score soon though.\nThey are knocking on the door and have plenty of men up the pitch to pressure the Spurs defence.\nTottenham 2-0 Chelsea\n15:22 , Michael Jones\n88 mins: Spurs are sitting back now, allowing Chelsea to control possession. Wesley Fofana gets forward on the right wing before flicking a cross into the middle of the six-yard box.\nAubmeyang is hovering but can’t get his head to it and Spurs work it away.\nPedro Porro comes on to replace Richarlison.\nTottenham 2-0 Chelsea\n15:18 , Michael Jones\n85 mins: Mykhailo Mudryk and Pierre-Emerick Auabmeyang come on for Chelsea to replace Raheem Sterling and Joao Felix. Graham Potter’s men are staring down the barrel of another defeat here.\nA goal for the visitors could spark a late revival though.\nGOAL! Tottenham 2-0 Chelsea (Kane, 82’)⚽️\n15:16 , Michael Jones\n82 mins: Spurs have their second! Son whips the corner kick into the middle of the box and picks out the head of Eric Dier. He nods the ball over to the back post where Harry Kane is wide open and pokes home a simple tap in.\nThat should be enough for Tottenham to win this one.\nTottenham 1-0 Chelsea\n15:14 , Michael Jones\n81 mins: Inside the last 10 minutes at the Tottenham Hotspur Stadium. Son Heung-min has come on to replace Dejan Kulusevski for Spurs as Richarlison wins a corner.\nTottenham 1-0 Chelsea\n15:11 , Michael Jones\n78 mins: Chelsea are showing a bit of fight. Sterling slips the ball into the box as Havertz sneaks in behind. He then threads the ball into the six-yard area and wins a corner.\nThe set piece comes to nothing though.\nTottenham 1-0 Chelsea\n15:08 , Michael Jones\n75 mins: Cristian Romero dallies with the ball and is charged down by Kai Havertz. Romero has to lunge at the ball to poke it away from Havertz and in the process takes down the Chelsea forward.\nMason Mount is fuming over the challenge and has words with the referee who, equipment now restored, books him for dissent.\nTottenham 1-0 Chelsea\n15:05 , Michael Jones\n72 mins: There’s a break in play as the referee jogs off the pitch to replace some of his equipment which must be faulty.\nOliver Skipp’s driving effort is the only difference between the teams as the match enters the final 20 minutes or so.\nTottenham 1-0 Chelsea\n15:01 , Michael Jones\n69 mins: Lovely play from Chelsea! They work the ball down the left side with Zakaria and Felix linking-up nicely in a string of one-touch passes.\nFelix sends it inside to Mount who flicks the ball into the penalty area for Havertz. The forward keeps himself onside and sprints after the ball but is beaten to it but a sprawling Fraser Forster who smothers the danger.\nTottenham 1-0 Chelsea\n14:59 , Michael Jones\n66 mins: If Tottenham go on to win this game then they’ll move four points clear of Newcastle in fourth place. Chelsea are languishing in 10th and have no momentum at all.\nHarry Kane receives the ball on the right side of the pitch and lifts a cross into the box. Ben Davies is free on the opposite side but the pass is just too far away from him.\nTottenham 1-0 Chelsea\n14:56 , Michael Jones\n63 mins: Yep. Denis Zakaria and Mason Mount are introduced to replace Ruben Loftus-Cheek and Hakim Ziyech. Will they have enough influence on this game to swing it Chelsea’s way?\nTottenham 1-0 Chelsea\n14:53 , Michael Jones\n60 mins: Chelsea have only scored 23 goals in the Premier League this season and they’re in desperate need of one now.\nKai Havertz nods a long ball down to Joao Felix who drills a shot towards goal from the edge of the box but his effort is blocked by Eric Dier.\nIt looks as though Potter is going to make a double change.\nTottenham 1-0 Chelsea\n14:51 , Michael Jones\n56 mins: There’s a lot of deliberating in between Graham Potter and his coaching staff in the Chelsea dugouts. Denis Zakaria is getting prepped and ready to come on.\nChelsea haven’t responded to going behind yet at all.\nTottenham 1-0 Chelsea\n14:47 , Michael Jones\n53 mins: Penalty shout! Emerson Royal has been impressive today for Spurs. He carries the ball into the box from the right and lays it off to Skipp.\nSkipp looks to lift it into a more central position and his kick strikes Koulibaly on the arm. Spurs appeal for a handball but the referee waves them away.\nTottenham 1-0 Chelsea\n14:46 , Michael Jones\n50 mins: Oliver Skipp’s goal came 20 seconds into the second half. It’s put Tottenham firmly in control of the game and they’re making use of the lead.\nThe home side have come out with an attacking mindset and are pushing for a second.\nGOAL! Tottenham 1-0 Chelsea (Skipp, 46’)⚽️\n14:41 , Michael Jones\n46 mins: Yes we will! Tottenham get Emerson Royal free on the right side of the box and he forces Kepa Arrizabalaga into a low save.\nChelsea then fail to properly clear their lines and chip the ball out to Oliver Skipp who wins it ahead of Joao Felix.\nSkipp guides the ball back into the box before unleashing a rocket at the goalkeeper. His effort hits the underside of the crossbar and bounces over the line! Kepa had no chance.\nTottenham take the lead.\nSecond half: Tottenham 0-0 Chelsea\n14:39 , Michael Jones\nTottenham get the ball rolling for the second half. Will we see some goals in this next 45 minutes?\nHT Tottenham 0-0 Chelsea\n14:28 , Michael Jones\nHalf-time: Tottenham 0-0 Chelsea\n14:24 , Michael Jones\n45+6 mins: Nothing to separate the teams at half-time. Chelsea will feel relieved that Hakim Ziyech is still on the pitch. He earned himself a red card for a shove on Emerson Royal but VAR came to the right decision to overturn it.\nAll to play for in the second half.\nTottenham 0-0 Chelsea\n14:22 , Michael Jones\n45+5 mins: Hang on a minute! Hakim Ziyech is told not to leave the pitch as the VAR check is still ongoing. A couple more minutes pass before the referee is then told to rescind the red card and give Ziyech a yellow instead.\nChelsea have a reprieve. It’s the correct decision as Ziyech only pushed Royal and didn’t mean to catch him on the chin.\nRed card! Ziyech is sent off!\n14:21 , Michael Jones\nTottenham 0-0 Chelsea\n45+3 mins: It’s all kicking off after Hakim Ziyech fouls Richarlison. The Brazilian reacts and squares up with Ziyech before Clement Lenglet and Emerson Royal get involved.\nRoyal shoulders into Ziyech who responds with a forceful shove. He hits Royal in the shoulder before following through and striking him on the face\nVAR takes a look at the incident and the referee pulls out a red card!\nTottenham 0-0 Chelsea\n14:15 , Michael Jones\n45 mins: Three minutes of added time to play at the end of the first half. Will there be an opening goal before the break?\nTottenham 0-0 Chelsea\n14:14 , Michael Jones\n43 mins: Save! Wesley Fofana drives in between Harry Kane and Dejan Kulusevski with the ball before fizzing a cross field pass over to Raheem Sterling.\nSterling cuts inside from the left and smokes a right-footed shot towards goal forcing Fraser Forster into a sharp save to his left.\nTottenham 0-0 Chelsea\n14:11 , Michael Jones\n39 mins: Chance! Ben Davies brings the ball into the final third and links up with Harry Kane. Hakim Ziyech pounces on a loose ball but Richarlison nicks it back off him.\nThe Brazilian weaves into the box from the left and tries to curl a shot towards the far corner only to mishit the effort and belt it wide.\nTottenham 0-0 Chelsea\n14:08 , Michael Jones\n36 mins: After his antics with Kepa Arrizabalaga, Harry Kane is on the receiving end of some similar treatment. The ball is played into his feet with his back to goal.\nKane thinks about turning but Wesley Fofana is on top of his in a flash. He clatters into the Spurs captain and puts him to the floor when clearing his lines.\nNo complaints and a rye smile from Harry Kane after that one.\nTottenham 0-0 Chelsea\n14:05 , Michael Jones\n33 mins: The Tottenham fans are annoyed as Kepa Arrizabalaga takes his time getting the ball moving. He received it in open play so there is no time-wasting going on as Spurs don’t bother to close him down.\nHe eventually rolls the ball over to Ben Chilwell who returns the pass. Kepa switches the play to the opposite wing and is shouldered to the floor by a late Harry Kane challenge.\nTottenham 0-0 Chelsea\n14:01 , Michael Jones\n30 mins: Tottenham have grown into the game as expected. They were wary and watchful in the first 20 minutes or so but have started to open up having defended against Chelsea’s early attacks.\nThe home side win another corner that Dejan Kulusevski takes short. Chelsea have numbers back though and head the ball away when the cross eventually comes in.\nTottenham 0-0 Chelsea\n13:59 , Michael Jones\n27 mins: Off the post! Richarlison brings the ball inside from the left side and links-up with Harry Kane for a one-two. The Brazilian is brought down just outside the ball but the referee plays advantage as the ball comes loose to Pierre-Emile Hojbjerg.\nHe blazes a shot at goal and hits Weslel Fofana who attempts to get in the block. The ball deflects to the left of Kepa Arrizabalaga and spins onto the right-hand post before bouncing clear!\nBest chance of the half goes to Spurs.\nTottenham 0-0 Chelsea\n13:54 , Michael Jones\n24 mins: Every now and again Tottenham press high to put Chelsea under pressure at the back. Reece James drifts inside and receives the ball just as Richarlison bombs forward.\nThe defender is always in control and blocks Richarlison with his body before releasing a pass. The Brazilian runs into James and sends him to the deck earning Chelsea a free kick.\nTottenham 0-0 Chelsea\n13:51 , Michael Jones\n21 mins: Thiago Silva isn’t able to continue. It seems as though he tweaked something when defending against Kane’s dribble into the Chelsea box.\nWesley Fofana is introduced to replace him.\nTottenham 0-0 Chelsea\n13:49 , Michael Jones\n18 mins: Shot! Chelsea flick the ball over to Hakim Ziyech on the right side of the pitch and he heads it on to Kai Havertz. Havertz brings the ball under control, shifts it away from the nearest defender then slides a pass over to Joao Felix.\nHe lets fly from range and leaves Fraser Forster with an easy save.\nTottenham 0-0 Chelsea\n13:46 , Michael Jones\n15 mins: This could be a blow foe Chelsea. Thiago Silva has gone down after turning the ball out of play. The corner is yet to be taken as the Blues’ centre-back receives some treatment.\nKulusevski whips the set piece into the box but it flies through to Oliver Skipp. He floats the ball back into the middle and Kepa Arrizabalaga is fouled trying to pluck it out of the air.\nTottenham 0-0 Chelsea\n13:44 , Michael Jones\n12 mins: It’s been a bright start from Chelsea. They’ve had 67% possession over these opening stages. Raheem Sterling bombs down the left flank and lifts a cross into the box.\nHakim Ziyech nods it over towards Kai Havertz but Cristian Romero completes the clearance and Spurs break forward on the counter-attack.\nKane, Richarlison and Dejen Kulusevski all combine to get the ball into the penalty area before Kane wins a corner.\nTottenham 0-0 Chelsea\n13:41 , Michael Jones\n9 mins: Joao Felix loses the ball in midfield and goes to ground claiming that he was hit in the face. The referee doesn’t buy the acting and lets play go on.\nHarry Kane floats a pass over to the left side of the box where it get nodded down to Richarlison. He looks the control the ball and shoot but Thiago Silva blocks his way and clears the danger.\nTottenham 0-0 Chelsea\n13:38 , Michael Jones\n6 mins: Nearly! Chelsea are getting stuck into the game early on here. Ruben Loftus-Cheek carries the ball into the final third before sliding it across to Enzo Fernandez as Spurs drop off and sit in.\nFernandez flicks the ball into the box as Joao Felix storms in behind from the right. He lunges towards the dropping ball but it just evades his volley effort and bounces through for a goal kick.\nTottenham 0-0 Chelsea\n13:35 , Michael Jones\n3 mins: Penalty shout! Raheem Sterling dances his way into the left side of the Tottenham penalty area. He runs into trouble but Oliver Skipp is clumsy with his attempted clearance.\nHe kicks out and catches Sterling’s leg allowing the Chelsea man to go down. The referee says no penalty but VAR takes a look at the incident before coming to the same conclusion.\nKick off: Tottenham 0-0 Chelsea\n13:31 , Michael Jones\nChelsea kick off the match at the Tottenham Hotspur stadium. They send the ball towards the back line where it gets shifted over to Ben Chilwell.\nHe feeds a nice pass into midfield for Joao Felix who dinks one over the top but sends the ball bobbling through to Fraser Forster.\nPre-match thoughts from Cristian Stellini\n13:26 , Michael Jones\nTottenham assistant head coach Cristian Stellini, spoke to Sky Sports ahead of kick off and explained why Son Heung-min starts on the bench today:\n“We have to keep the momentum. It is a good moment for us. We have worked well in the week, we hope we will play a good game and the energy we need to do that is important.\n“It was a difficult decision [to keep Son on the bench] but it was not the only decision we had to take - we had many. We are lucky we had Antonio [Conte] to help us make the decision and we are happy with the team.”\nWill Kane find the target again?\n13:23 , Michael Jones\nHarry Kane’s last 11 goals for Spurs in all competitions were scored in London.\nKane and Pierre-Emile Hojbjerg could become the first Spurs players to score home and away league goals against Chelsea in the same season since Gary Lineker in 1990/91.\nBlues struggling away from home\n13:19 , Michael Jones\nChelsea’s nine away games without a victory in all competitions is their longest such run since a 17-match streak from April 2000 to January 2001.\nThe Blues are winless in all 10 league fixtures this season against the teams that began this round of fixtures above them in the table - they are currently 10th and Spurs 4th.\nChelsea giving full backing to Graham Potter after poor run of results\n13:15 , Michael Jones\nChelsea boss Graham Potter has the full support of the club’s hierarchy despite his side’s poor run of results.\nThe Blues have won just twice in 14 games in all competitions and were beaten by the Premier League’s bottom side Southampton at Stamford Bridge on Saturday.\nPotter’s expensively-assembled side left the pitch amidst anger and a chorus of boos at full-time, with some voices near the dugout calling for the former Brighton manager to leave.\nHowever, it is understood that Potter maintains the backing of co-controlling owners Todd Boehly and Behdad Eghbali ahead of Sunday’s London derby at Tottenham.\nChelsea giving full backing to Graham Potter after poor run of results\nSon the super-sub\n13:11 , Michael Jones\nSon Heung-min has scored four goals in two substitute appearances in the Premier League this season, compared to just one goal in his 20 starts.\nNo Spurs player has ever scored five from the bench in a Premier League campaign.\nTottenham vs Chelsea\n13:07 , Michael Jones\nOnly Manchester City’s league matches have produced more goals this season than the 79 scored in Tottenham’s fixtures.\nSpurs have conceded multiple goals in 13 Premier League matches this season, a joint top-flight high with Leicester City.\nIn contrast, the 46 goals that have been scored in Chelsea’s 23 league games is the fewest involving any top-flight side this season.\nChelsea’s shocking form\n13:03 , Michael Jones\nChelsea have only won one of their 10 matches in all competitions in 2023, and just two of their last 14 league games. They have scored eight goals in those 14 matches, the fewest of any side during that run.\nThey are aiming to avoid a run of six games without a win in all competitions for the first time since November to December 2012.\nPotter on mental health issues and threat to his family\n12:59 , Michael Jones\nThis is Graham Potter’s 18th Premier League match in charge of Chelsea since he was appointed five months ago.\nHe has won just five of those game resulting in the worst parts of the Chelsea fanbase to hurl anonymous abuse at him and his family online.\n“I’ve had some not particularly nice emails come through, that want me to die,” he said. “That’s obviously not pleasant to receive.\n“You could ask my family how life has been for me and for them. It’s been not pleasant at all. If you go to work and somebody’s swearing abuse at you, it’s not going to be pleasant.\n“With the results as they are, you accept criticism. That’s not to say it’s easy at all. Your family life suffers, your mental health suffers, your personality - it is hard.”\nThree in a row?\n12:55 , Michael Jones\nSpurs are aiming for three consecutive Premier League home wins without conceding for the first time since their opening three matches at the Tottenham Hotspur Stadium back in April 2019.\nThey could also set a club record of 23 consecutive home league games without a draw.\nTottenham vs Chelsea\n12:51 , Michael Jones\nSpurs could claim four points in a season from Chelsea for only the second time in the Premier League, having done so in 2008/09.\nThis is also the 150th league meeting between the sides. Tottenham have won 47, Chelsea 64, and there has been 38 draws.\nEnzo Fernandez interview: ‘My message to the Chelsea fans? Trust us’\n12:47 , Michael Jones\nEnzo Fernandez still remembers the times. “Four hours difference in winter, three hours in summer - we knew exactly,” he says, going back to the Sunday mornings where he would get up early and crawl into bed with his dad to watch the Premier League.\nIt was there, drinking Mate – a South American herbal drink –, where he would tune in to see his Argentinian heroes – “Kun Aguero, Carlos Tevez, Higuain…” – but in San Martin, Buenos Aires, those stadiums of Stamford Bridge and Old Trafford seemed a world away. Now, though, it is Enzo Fernandez, a World Cup winner at 22, who stands above them as the most expensive Premier League player of all time.\nAll journeys to the Premier League are remarkable – but Fernandez’s has been defined by an astonishing and dizzying assent. “It’s all gone very, very quickly,” he admits, speaking through a translator – although he has now started English lessons.\nHe is happy to be here at Chelsea although the move to London – a “beautiful city,” he says – with his young family has not been easy. Fernandez is staying in a hotel as he has yet to find a house, but he is settling into his new surroundings following his third move in less than a year.\nThe rise of Enzo Fernandez and World Cup winner’s message to Chelsea fans\nTottenham vs Chelsea\n12:43 , Michael Jones\nTottenham have won just seven of their 61 Premier League games against Chelsea and are winless in the last eight top-flight meetings.\nChelsea are looking to become just the third team to win four consecutive away league games against Tottenham, emulating Arsenal (1952/55) and Manchester United (six between 2001/07).\nTottenham vs Chelsea\n12:39 , Michael Jones\nIt’s a contrasting point of view looking at these two teams. Tottenham are looking to win consecutive games and move four points clear of Newcastle to keep a grip on fourth spot - and a Champions League place - while Chelsea are just searching for a win.\nGraham Potter’s men have not won in five matches across all competitions and lost 1-0 to the bottom placed side in the Premier League, Southampton, last time out.\nA victory over Tottenham will go some way to easing the pressure on the manager but the Blues need to string together a run of wins to move up the table.\nTottenham vs Chelsea team news\n12:35 , Michael Jones\nTottenham Hotspur are unchanged from the team that started their 2-0 victory over West Ham last time out. Harry Kane leads the line once more with Richarlison out on the left in place of Son Heung-min.\nGraham Potter meanwhile makes six changes to the Chelsea side that lost to Southampton in their last outing. Reece James and Thiago Silva return to the defence.\nRuben Loftus-Cheek slots in alongside Enzo Fernandez in midfield with starts for Raheem Sterling, Hakim Ziyech and Kai Havertz.\nTottenham vs Chelsea line-ups\n12:31 , Michael Jones\nTottenham XI: Forster, Romero, Dier, Lenglet, Emerson, Skipp, Hojbjerg, Davies, Kulusevski, Richarlison, Kane\nUnchanged for #TOTCHE 👊 pic.twitter.com/Qx0SwK7lBL\n— Tottenham Hotspur (@SpursOfficial) February 26, 2023\nChelsea XI: Arrizabalaga, James, Thiago Silva, Koulibaly, Chilwell, Loftus-Cheek, Fernandez, Sterling, Felix, Ziyech, Havertz\nYour Chelsea side today! 💪@ParimatchGlobal | #TotChe pic.twitter.com/0bVOrTm4Ff\n— Chelsea FC (@ChelseaFC) February 26, 2023\nChelsea manager Graham Potter says he and children subjected to death threats\n12:25 , Michael Jones\nChelsea promised to offer Graham Potter whatever support he needs after the manager was sent emails threatening him and his family.\nPotter said he had been targeted by an anonymous account in the wake of the team’s recent poor form, which continued with a 1-0 home defeat by Southampton last Saturday.\nAfterwards some supporters behind the dugout at Stamford Bridge called for the manager to leave, with the atmosphere turning increasingly hostile as the game wore on. Personal attacks on social media have also increased following the loss to Saints, but those have now escalated to threats being sent to him directly.\nPotter, who has said previously that he believes he has the hardest job in football, was nevertheless visibly upbeat ahead of his team’s trip to Tottenham on Sunday, joking that he was late as he had been at a “crisis meeting” with the club’s owners.\nChelsea manager Graham Potter says he and children subjected to death threats\nTottenham vs Chelsea prediction\n12:20 , Michael Jones\nThese are two unpredictable teams at present but Tottenham seem in slightly less disarray so could well edge this contest.\nTottenham 2-1 Chelsea.\nTottenham vs Chelsea predicted line-ups\n12:15 , Michael Jones\nTottenham XI: Forster; Romero, Dier, Lenglet; Emerson, Skipp, Hojbjerg, Davies; Kulusevski, Kane, Son\nChelsea XI: Kepa; James, Silva, Badiashile, Chilwell; Kovacic, Fernandez; Mudryk, Felix, Sterling; Havertz\nWhat is the team news?\n12:10 , Michael Jones\nThe likes of Rodrigo Bentancur, Yves Bissouma, Hugo Lloris and Ryan Sessegnon are all out injured for Spurs, while Oliver Skipp is likely to partner Pierre-Emile Hojbjerg in midfield.\nBen Davies could continue at left-wing back and Son Heung-min is likely to replace Richarlison.\nCesar Azpilicueta‘s serious head injury suffered against Southampton will keep him out, while Armando Broja, Christian Pulisic and Edouard Mendy are also absent. N’Golo Kante is now back in team training although is likely not yet fit enough to feature.\nMykhaylo Mudryk, Raheem Sterling and Kai Havertz will all be pushing for a start in attack, while Thiago Silva and Reece James shoudl start in defence.\nHow to watch Tottenham vs Chelsea\n12:05 , Michael Jones\nThe match will kick off at 1.30pm GMT on Sunday 26 February. It will be shown live on Sky Sports Main Event and Sky Sports Premier League.\nIf you’re not a Sky customer you can grab a NOWTV Day Pass here to watch without a subscription.\nWe may earn commission from some of the links in this article, but we never allow this to influence our content. This revenue helps to fund journalism across The Independent.\nGood afternoon\n11:59 , Michael Jones\nGood afternoon and welcome to live coverage of Tottenham vs Chelsea in the Premier League, with Graham Potter’s side desperate for a win in today’s London derby.\nChelsea have won just twice in their last 14 Premier League matches, a woeful run of form that dipped even further following last weekend’s 1-0 home defeat to Southampton, and face a Spurs side who were lifted by their victory over West Ham last time out. The result moved Tottenham into the top four and Antonio Conte’s side can tighten their grip on fourth spot with another three points this afternoon, although the Italian will be missing from the sideline once again.\nChelsea’s top-four hopes are slim and defeat would surely close the door for good. It would also increase the pressure on Potter’s position. The Chelsea manager revealed on Friday that he and his family have been subjected to death threats amid his side’s poor run but defeat at the Tottenham Hotspur Stadium would be a further test of the club’s patience.\nFollow live updates from Tottenham vs Chelsea in the Premier League in today’s live blog",
  "word_count": 4757,
  "scraped_at": "2026-02-14T01:46:30.517218",
  "_text_extracted": true
}