{
  "article_id": "d92ce912371f",
  "url": "https://www.bbc.co.uk/news/uk-england-manchester-66188078",
  "title": "Manchester City : Disabled fan who broke leg in fall slams UEFA",
  "date": "20230713T144500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A disabled fan has criticised European football's ruling body after she broke her leg and was left lying in her own urine in hospital in the chaos surrounding the Champions League Final.\nUefa accepted \"not everything was perfect\" after fans had faced issues getting to the game at Istanbul's Atatürk Olympic Stadium on 10 June.\nManchester City fan Clare Watson said she fell after being forced to get out of a taxi and walk by police.\nShe said her ordeal was \"atrocious\".\nUefa has been approached for comment.\nMs Watson, who has mobility issues due to three collapsed vertebrae, had been travelling with her grandchildren in a taxi to watch her team take on Inter Milan at the stadium.\nShe said the family was forced to get out and had to walk over \"building site rubble\" before she tripped while trying to avoid an oncoming vehicle.\n'Lack of respect'\n\"It was then clear from the pain that I needed an ambulance, but they would not allow my grandchildren to come with me,\" she told disability access charity Level Playing Field (LPF).\n\"Once at the hospital, I was told the severity of my injury and that I would need surgery.\n\"I was moved to another hospital for the operation the following afternoon, but was ignored and received no attention for hours on end.\n\"Lying there in my own urine, soaking wet, was the most upsetting part of the experience.\"\nLPF said it had demanded answers from Uefa over how disabled supporters were accommodated at the stadium in the week following the match, but had received no response.\nMs Watson said when she attended hospital in Manchester on her return, \"they could not believe I had been advised to fly home\".\n\"I was cared for there for another week, still in pain, but with the necessary equipment,\" she said.\n\"I am now at home and unable to work, having missed the game and brought back a metal rod, instead of a souvenir flag.\"\nLPF fan liaison officer Liam Bird said Ms Watson's experience demonstrated Uefa's \"clear lack of respect for fans\".\nHe said lessons had not been learned from the chaotic scenes at the 2022 final in Paris when Liverpool faced Real Madrid.\n\"Uefa need to engage with organisations with expertise in disability access and inclusion, as well as disabled supporters themselves, when planning all showpiece events,\" he said.\nFootball Supporters Europe is compiling a report into fans' experiences at the recent final, which will be presented to Uefa.\nWhy not follow BBC North West on Facebook, external, Twitter, external and Instagram, external? You can also send story ideas to northwest.newsonline@bbc.co.uk\nRelated topics\n- Published22 June 2023\n- Published15 June 2023\n- Published14 February 2023",
  "word_count": 453,
  "scraped_at": "2026-02-14T01:48:22.652765",
  "_text_extracted": true
}