{
  "article_id": "d942d044b1e4",
  "url": "https://metro.co.uk/2025/01/01/two-premier-league-clubs-consider-signing-england-star-jack-grealish-22278096/",
  "title": "Two Premier League clubs consider signing England star Jack Grealish | Football",
  "date": "20250101T160000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Two Premier League clubs are ‘monitoring’ Jack Grealish ahead of possible moves for the Manchester City star, according to reports.\nGrealish has lifted three Premier League trophies and the Champions League since leaving his boyhood club Aston Villa in 2021.\nMan City made Grealish the most expensive British player in history when they brought him to the Etihad in a deal worth £100m.\nWhile Grealish has lifted much silverware at City, he has underwhelmed individually, scoring just 14 goals in 143 appearances for the best team in Europe in recent years.\nGrealish has in fact not scored for Manchester City in over a year, his last goal for the club coming in a 2-2 draw with Crystal Palace in December 2023.\nThe drop-off in form led Grealish to be omitted from England’s squad for last summer’s Euros and the 29-year-old continued to be overlooked for the Nations League games during the last international break.\nPep Guardiola is on record saying he does not expect any departures during the January transfer window, with Man City enduring a difficult time with injuries this season.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut the Daily Mail say both Tottenham and Newcastle United are ‘monitoring’ the England star and could launch moves this month.\nNewcastle are one of the most in-form teams in the Premier League, four straight wins sending Eddie Howe’s team up to fifth at the halfway point of the campaign.\nTottenham, though, are just 11th under struggling boss Ange Postecoglou, closer to the relegation zone than the Champions League places.\nGrealish was recently urged to leave Manchester City and ‘find his love of football again’ by former Aston Villa star Lee Hendrie.\n‘It’s at the stage now where Jack should probably be thinking about leaving the football club,’ Hendrie told 10bet.\n‘Nobody could deny that the move hasn’t been successful, he’s won everything there is to win during his time there, but I think for himself, he needs to find his enjoyment in playing again.\n‘He’d be an asset for any top football club. I would love him at Villa, but would they have the finances to bring him back? It would probably be a complicated deal to complete.\n‘I know the Villa fans have given him some stick, but I think they would love to see him back at Villa Park. He wouldn’t be coming for a pay day; he’d be coming to win something with Villa and help take the club up a level.\n‘It would be brilliant if he came back. I do feel he has to go and leave Man City at the moment to find some enjoyment in his game.’\nEx-Premier League goalkeeper Shay Given has also suggested Grealish should be considering a move as he is being ‘wasted’ at the Etihad.\n‘I know I’m slightly biased because I played with Jack at Aston Villa, so I know Jack’s won all these trophies and Champions League and Premier Leagues and stuff, but I think he’s playing out of position,’ he told BBC’s Football Daily.\nMore Trending\n‘He has done so since the day he joined Man City. I think he’s a waste on the left wing, I think he’s like a mannequin at times and I feel sorry for him out there.\n‘I think he’s a generational talent going to waste at Man City. That sounds a bit harsh perhaps on Pep but I think he’s such a talented player playing out of position.’\nGrealish is certainly not the only Manchester City star struggling in a team that has slipped to sixth in the Premier League, 14 points behind runaway leaders Liverpool.\nGuardiola’s side ended a run of four games without a win by beating Leicester City last time out and return to action on Saturday against struggling West Ham.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: William Saliba’s camp respond to Real Madrid transfer approach\nMORE: Returning Chelsea prospect Aaron Anselmino tipped for greatness by Argentina icon\nMORE: Troy Deeney doubts £32m Mikel Arteta signing is ‘up to the level of Arsenal’",
  "word_count": 739,
  "scraped_at": "2026-02-14T01:52:10.145427",
  "_text_extracted": true
}