{
  "article_id": "d96dbf802299",
  "url": "https://theathletic.com/5272062/2024/02/15/valentin-barco-brighton-argentina/",
  "title": "Brighton Valentin Barco : Brilliant and box - office",
  "date": "20240215T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Valentin Barco pulls on a Brighton & Hove Albion shirt for the first time, be prepared for a blend of high quality and s**thousery.\nThe versatile Argentine teenager’s cocktail of top-standard ability and gamesmanship was highlighted by his contribution to his country’s under-23s team qualifying for the football tournament at the Olympic Games in France this summer.\nAdvertisement\nBarco’s introduction to Brighton following a $10million move (£7.86m at the current exchange rate) from leading Argentine club Boca Juniors in the winter transfer window has been delayed by his involvement for Javier Mascherano’s side in the South American qualifying competition for those Olympics, held in Venezuela in recent weeks.\nThree assists, two bookings and a separate red card in the 19-year-old left-back’s five appearances, culminating with a key role in the only goal in Sunday’s qualification showdown against arch-rivals Brazil, showcased the good and bad of Barco.\nLet’s start with the good.\nArgentina had to beat Brazil in their last match of the competition’s second group phase to claim one of the two Olympics qualifying places, a result which would also knock out their opponents, men’s football gold medallists at the past two Games.\nA high-stakes game — albeit at junior level — between the powerhouses of South American football was delicately balanced at 0-0 with 12 minutes of the 90 remaining when Barco received the ball on the left wing, midway inside the Brazil half. Spotting Luciano Gondou making a run inside the penalty area between Brazil’s two central defenders, Barco whipped a cross around the man in front of him with precision for the Argentinos Juniors forward to head in the only goal of the game.\nBrighton strikers Evan Ferguson, Danny Welbeck and Joao Pedro will surely have been watching that goal on repeat.\nAs he headed for England, Barco told ESPN he has been in touch with some of Brighton’s established South American contingent. “Boca has been my life since I was nine, but I’m happy to be making this move,” he said. “I’ve been talking to him (countryman Facundo Buonanotte) and with all the South Americans who are there, with (Paraguay’s Julio) Enciso, (Ecuador’s Pervis) Estupinan, (Brazilian) Joao Pedro. We’re going to be well accompanied there.”\nThat goal was not an isolated example of the skill in Barco’s boots.\nIn the fifth minute of stoppage time in the same game, he showed the ingenuity and naivety of youth (bearing in mind the circumstances if Brazil had equalised at that point) when collecting the ball from a short corner routine (10:16 in the above video). Instead of just running down the clock by retaining possession, Barco almost doubled Argentina’s lead with an audacious left-foot shot from an acute angle which the goalkeeper parried away.\nGO DEEPER\nIs the Premier League still on track for five Champions League spots?\nSo much for the dazzling stuff, what about the dark arts?\nA minute earlier in added time, as a Brazil player shaped to pump a free kick upfield from just inside his own half as they chased that leveller, Barco ran across and booted the ball away. He was shoved to the ground as furious Brazilian players surrounded him and was shown a yellow card.\nBilardo está llorando de la emoción!!! pic.twitter.com/Z1NHfDShAC\n— Habemus Fútbol (@Habemusfutbol10) February 12, 2024\nBarco will have to be cuter in the Premier League to escape punishment for the flashes of ill-discipline that were on display in Venezuela. He was only able to play against Brazil because a two-match suspension was reduced to one game for a silly red card in a 2-2 draw against the host nation in Argentina’s first game of that second group stage.\nAdvertisement\nA foul by Barco towards the end of the first half annoyed the Venezuela players, especially midfielder Bryant Ortega, who was sent off for throwing the ball at the back of Barco’s head.\nBarco, at that stage, was walking away from the incident, hands raised at shoulder height in the universal ‘What did I do?’ pose. In a childish act of retaliation, he then threw the ball at the head of one of Ortega’s team-mates. Barco swigged nonchalantly from a water bottle after he too was then shown a straight red card.\nGO DEEPER\nWho are the worst offenders for dissent in the Premier League?\nHis tournament of fluctuating fortunes began with a late booking for dissent in Argentina’s first game of the competition on January 21, a 1-1 draw against Paraguay, who went on to claim the other South American qualifying spot for the Olympics.\nThat was followed by an example of tenacity combined with talent against Peru three days later. Early in the second half, he won the ball with a sliding tackle in wet conditions midway inside opposition territory, then went on a run into the penalty area, where he was fouled while chopping inside a challenge, earning a penalty that was converted for the opening goal in a 2-0 win.\nMascherano is a fan of Barco. The former West Ham, Liverpool, Barcelona and Argentina midfielder said after the tournament: “I have a great relationship with him, we have long talks. He is a different player from everyone, unique in his position.”\nBarco’s performances for his country in Venezuela continued the narrative of his club-level rise with Boca.\nHaving made his first-team debut at age 16 in July 2021, he scored one goal, provided four assists and received nine yellow cards across 32 appearances in four competitions in the Buenos Aires side’s January-to-November 2023 season. That included starting the final of the Copa Libertadores, South America’s equivalent of the Champions League, in November as Boca lost 2-1 after extra time against Fluminense of Brazil.\nAdvertisement\nInternally at Brighton, the feeling is that Barco has the personality to adapt quickly to the Premier League. His arrival coincides with regular left-back Estupinan not yet returning to peak form following two lengthy injury lay-offs that saw him miss a combined 15 games in the first half of this season.\nHead coach Roberto De Zerbi has only seen clips of Barco and is reserving judgment until he can work with him.\nDe Zerbi said: “We have to watch on the pitch before we can say anything more. You can know the players on video, but sometimes you can find different characteristics and details in person. The real potential you can see on the pitch.”\nOne thing seems certain, with Barco added to the Brighton mix: do not expect it to be dull.\nGO DEEPER\nHow Simon Adingra became Ivory Coast's new 'jewel'\n(Top photo: Federico Parra/AFP via Getty Images)",
  "word_count": 1102,
  "scraped_at": "2026-02-14T01:51:19.061118",
  "_text_extracted": true
}