{
  "article_id": "d9998bb2d602",
  "url": "https://punchng.com/devils-still-keen-on-osimhen/",
  "title": "Devils still keen on Osimhen",
  "date": "20240216T030000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "English Premier League giants Manchester United are still in the race to sign Nigerian forward, Victor Osimhen, and are expected to make a bid in the upcoming summer transfer window, PUNCH Sports Extra reports.\nThe Red Devils are in line to get a cash influx in the summer window, with Sir Jim Ratcliffe on the verge of officially acquiring a 25 per cent minority stake in Man United.\nOn Tuesday, the Premier League gave the green light for the transaction to go through and the deal is expected to be under wraps by next week at the latest.\nRatcliffe’s INEOS money will alleviate Man Utd’s Financial Fair Play concerns for the summer window, allowing Erik ten Hag to reinforce his side in a major way. Ratcliffe has already approved the Red Devils’ pursuit of Michael Olise, whose release clause is in the region of €70m.\nTen Hag also wants to add a new centre-back and an experienced striker to take the pressure off Rasmus Hojlund, despite the youngster recently becoming quite prolific and their number one priority to fill that role according to 90min is Osimhen.\nAccording to the London-based sports platform, United are not out of the race to sign the Nigerian sharpshooter as Ratcliffe’s funds plus Champions League qualification would put Ten Hag’s side in pole position to sign the 25-year-old.\nOsimhen is expected to leave Napoli in the summer, recently penning a one-year extension with a new release clause believed to be around €120m-€130m. Chelsea have long been considered the favourite among Premier League clubs to land him, but United would become a more attractive destination if they were to be playing at the highest level of European football next\nseason.",
  "word_count": 284,
  "scraped_at": "2026-02-14T01:56:44.629913",
  "_text_extracted": true
}