{
  "article_id": "d9ab2371c71a",
  "url": "https://www.tnp.sg/news/scalpers-take-online-platforms-resell-acl-two-final-tickets",
  "title": "Scalpers take to online platforms to ..., Latest News",
  "date": "20250507T040000Z",
  "domain": "tnp.sg",
  "source_country": "Singapore",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Scalpers take to online platforms to resell ACL Two final tickets\nDavid Lee for The Straits Times\nQuick-fingered scalpers have taken to e-commerce platforms to sell tickets to the May 18 AFC Champions League Two final between the Sailors and Sharjah FC at inflated prices, mere hours after the official sales began on May 6.\nTickets went on sale via Sistic at noon, with prices ranging from $26 (students and seniors) for all stands to $50 for a main-stand seat, for the match at the 10,000-seater Bishan Stadium. Sailors members could also enjoy a 50 per cent discount, applicable for up to six tickets per member.\nAround 5 per cent of the total seats were allocated for away fans.\nAt various times, there was suspicion that the tickets were sold out, as the website would indicate \"Seat Unavailable\" intermittently.\nHowever, subsequent attempts would show that single seats were still available in Section Q in the North Stand and Section Y in the South Stand behind each goal.\nThough tickets could still be bought at 9pm, listings appeared on online platforms such as Carousell since early afternoon, with more than 10 such posts as at 10pm.\nWhile there were some who were selling the tickets at their original price, others were trying to offload theirs for up to $100 each for South Stand tickets that were originally priced at $30. One listing was taking bids starting from $40.\nSince 10pm, attempts to purchase tickets from the Sistic website have been unsuccessful.\nSailors fan Azmil Azman managed to snag four tickets for his family after camping at the Sistic website from 11.45am.\nHe said: \"I'm happy I will be able to witness this historic match with my family. It's understandable if people have to sell their tickets to others who want them, if they are unable to make it for the match.\n\"But it's not nice if they are buying the tickets only to sell them for a profit and depriving other true fans of the experience or making others pay over the top for it.\"\nAnother Sailors fan, who wanted to be known only as Mark, got two tickets each in two different sections for his family.\nHe added: \"Maybe for future big occasions like these, perhaps the club can consider setting aside a number of tickets and pre-sale sessions for members to reward them for their loyalty.\"\nThe Straits Times has reached out to the Sailors for comment.\nWhile Sailors skipper Hariss Harun did not speak about the scalping, he was heartened by the enthusiastic response to ticket sales.\nHe told ST: \"It's a great feeling to know that the tickets were selling fast and there's such interest to watch us play.\n\"We look forward to playing the final amid a wonderful atmosphere and hope the fans can push and inspire us to victory.\"\nAfter topping Group F, the Sailors made a surprise run to the final of the second-tier Asian club tournament.\nIn the two-legged knockout rounds, they overcame Thailand's Muangthong United 7-2, Sanfrecce Hiroshima 4-1 - the Japanese side conceded the first leg 3-0 after fielding an ineligible player - and Australia's Sydney FC 2-1 to set up the decider against Emirati side Sharjah.\nThe final is held in Singapore in line with the Asian Football Confederation decision to alternate the showpiece venue between the East and West Asia finalists annually, with East Asia hosting the 2025 final.\nThe Sailors had hosted their six ACL Two home games at the Jalan Besar Stadium this season, winning four, drawing once and losing once.\nHowever, Sharjah requested via an open letter on social media that the final not be played at Jalan Besar, citing its artificial pitch and 6,000 capacity.\nWith the National Stadium unavailable, as the first of Lady Gaga's four concerts will take place at the 55,000-seater venue on May 18, Bishan Stadium was the only realistic option remaining.\nOn April 23, the venue - home ground of the Sailors and Balestier Khalsa in the Singapore Premier League - was given provisional approval to stage the final, following inspections by AFC officials.\nThere will need to be improvements, and there are ongoing works to erect stands on the north, east and south ends of the stadium to add on to the main stand's capacity of 2,800 to take the total seating to 10,000.\nBesides increasing the capacity, other preparations include improvements to the natural grass pitch and enhancements to the floodlights to meet TV broadcast requirements.\nThe AFC is expected to conduct a final inspection this week.\nSee something interesting? Contribute your story to us.\nExplore more on these topics",
  "word_count": 772,
  "scraped_at": "2026-02-14T02:11:36.686679",
  "_text_extracted": true
}