{
  "article_id": "d9c267ead91f",
  "url": "https://metro.co.uk/2024/06/15/man-utd-arsenal-chelsea-given-bargain-price-sign-serhou-guirassy-21040575/",
  "title": "Man Utd , Arsenal and Chelsea given  bargain price  to sign Serhou Guirassy | Football",
  "date": "20240615T114500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United, Arsenal and Chelsea are involved in a fierce battle to sign Serhou Guirassy this summer and the striker is available for a ‘bargain price’, it has emerged.\nGuirassy enjoyed a prolific season in front of goal after joining Stuttgart on a permanent basis 12 months ago, netting 30 times in 30 appearances to help the club finish second in the Bundesliga table behind Xabi Alonso’s undefeated Bayer Leverkusen.\nOnly England captain Harry Kane bettered Guirassy’s tally in Europe’s top five leagues last season and the 28-year-old’s goalscoring exploits have put him firmly on the radar of the Premier League’s elite clubs.\nAccording to German outlet Bild, Arsenal and Chelsea are in the the race for Guirassy’s signature – as they search for attacking reinforcements – along with AC Milan and Borussia Dortmund, with the publication branding the forward a player ‘in demand’.\nUnited have also been credited with a strong interest in Guirassy, as well as Bayern Munich, though the latter have abandoned their pursuit due to Kane’s magnificent debut season in German football.\nThe report claims that Guirassy is likely to move on from Stuttgart ahead of the 2024/25 campaign and the Guinea international is available for a ‘bargain price’ of just €18-20million (£15-17m) this summer.\nGuirassy knows a a high-profile move would see him improve on his current €3m per year (£2.5 per year) wages at MHPArena.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHowever, Guirassy has two years remaining on his current contract and Stuttgart chairman Alexander Wehrle, speaking last month, played down speculation that the club’s star man could be on the move.\n‘It was already clear last summer that he was leaving and I already heard in the winter where he is said to have already signed,’ Wehrle told Sky Germany.\nMore Trending\n‘The fact is: He feels really comfortable, he is an undisputed leader for the first time in his career, he knows what he has in Sebastian Hoeness and the coaching team.\n‘He can now also play the Champions League. That’s another argument.\n‘For many it is clear that he is leaving, for me it is not at all clear.\n‘But we will sit down after the season.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Rodrigo Bentancur apologises for racist joke aimed at Spurs captain Son Heung-min\nMORE: Manchester United given asking price by Bayern Munich to sign Matthijs de Ligt",
  "word_count": 462,
  "scraped_at": "2026-02-14T01:51:32.432031",
  "_text_extracted": true
}