{
  "article_id": "d9c547199112",
  "url": "https://www.nytimes.com/athletic/6531791/2025/08/03/liverpool-newcastle-alexander-isak-benjamin-sesko-transfer-latest/",
  "title": "Liverpool and Newcastle have made bids for Isak and Sesko . Will either club get their striker ? ",
  "date": "20250803T050000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On Friday and Saturday, there were developments in Liverpool’s pursuit of Alexander Isak and Newcastle United’s push for Benjamin Sesko.\nBids were made for both strikers. One was rejected, the other has fallen short of RB Leipzig’s valuation for the striker. Isak has been training alone at his previous club, Spain’s Real Sociedad, but returned to Tyneside on Saturday. And amid all of the above, the spectre of Manchester United’s rival interest in Sesko — and the fact they have decided the Leipzig man is their primary striker target for the summer — hangs over proceedings.\nAdvertisement\nSo what’s the state of play with these two? Will new bids go in? Is there confidence about keeping these players or securing new faces? And what about Leipzig and their perspective on Sesko?\nTo find out, The Athletic’s Gregg Evans, George Caulkin, Laurie Whitwell and Sebastian Stafford-Bloor have answered a series of questions…\nWhat has happened with Isak?\nOn Friday, The Athletic’s David Ornstein reported that Newcastle had rejected a formal £110million ($146m) offer from Liverpool for the 25-year-old Sweden international. Liverpool had previously made an informal club-to-club approach and expressed an interest in doing a deal for Isak in the region of £120m.\nIsak wants to leave Newcastle this summer and has been training back at Real Sociedad, the club in La Liga he left to move to St James’ Park three years ago, while head coach Eddie Howe and his squad are in South Korea as part of a pre-season tour of Asia.\nHowe admitted on Saturday: “The situation is far from ideal. It is quite complex.” But he also said: “From our perspective, we still support Alex in every way.”\nThe Athletic reported on Saturday that Isak was returning to the UK and was set to resume training with Newcastle following a spell working individually at San Sebastian-based Real Sociedad.\nAnd what about Sesko?\nOn Saturday, The Athletic’s David Ornstein reported Newcastle had offered €80million for Sesko. Their bid comprised of €75m (£65.5m; $87m) up front with a further €5m in potential add-ons, and was made in the 24 hours before Saturday morning.\nLater on Saturday, The Athletic’s Sebastian Stafford-Bloor and David Ornstein reported that bid fell short of Leipzig’s valuation.\nThe 22-year-old is also of interest to Manchester United, and is yet to make a firm decision on his preferred destination.\nWill Liverpool make another bid for Isak?\nLiverpool’s interest is ongoing but whether they increase their offer remains to be seen. By formalising the process with a bid, though, it’s expected that this will not be the end of the saga.\nAdvertisement\nThe Premier League champions know that initial valuation of Isak does not come close to Newcastle’s, which is somewhere close to £150million. Newcastle insist he will not be sold until a striker of similar quality is sourced.\nPerhaps if Newcastle make a breakthrough in their own pursuit of Sesko, Liverpool will reconsider that opening offer and go higher. For now, it appears they are holding firm.\nGregg Evans\nAnd are Newcastle confident about getting Sesko done?\nThere is no fertile ground on Tyneside for confidence to grow. Not this summer. It has been a chastening close-season for Newcastle, who are operating without a sporting director or chief executive. Their approach to the market in these recent weeks has been to try to sign established, ‘oven-ready’ players for the Premier League, but, for the most part, this approach has failed.\nThey have repeatedly been knocked back or gazumped by rivals. Hugo Ekitike, Bryan Mbeumo, James Trafford, Joao Pedro and Liam Delap, among others, have joined traditional ‘Big Six’ clubs. Newcastle won the Carabao Cup last season and are back in the Champions League for the second time in three years, but for wages and prestige, they are not yet among the elite.\nThis is a roundabout way of answering the question, but it is also important context.\nNewcastle are competing for Sesko with Manchester United, who do not have European football to look forward to this season, but they do have bags of cachet. Brentford forward Mbeumo was a longstanding target of Howe’s, but he chose to go to Old Trafford.\nAs a leading figure at Newcastle put it on Saturday, there are no guarantees with Sesko. All they can do is make their case.\nIn the circumstances, confidence would be entirely misplaced.\nGeorge Caulkin\nDo Newcastle think they can keep Isak?\nLiverpool’s perspective emerged on Friday — that they would not be returning with a higher second bid. As things stand, he’s going nowhere. Whether that remains the case — and whether Isak now attempts to take things into his own hands — is unknown.\nNewcastle have always believed there is a pathway to hanging onto him.\nAdvertisement\nWhat was the logic behind Liverpool’s bid, having previously intimated they would pay more than that amount for Isak? It is a peculiar negotiating tactic, and sources (kept anonymous so they could speak freely) at Newcastle have suggested it was an attempt by Liverpool to save face with their fans.\nNewcastle’s valuation of the player is around £150million. Get closer to that, and they would at least talk.\nWhat is very deliberate is Newcastle keeping escape routes open for Isak. There has been no public criticism of him for not accompanying the team on their tour to Asia, with the club sticking to the line that he is suffering from a “minor thigh injury”. He has not been censured for training alone at Real Sociedad.\nNot for the first time, Howe said on Saturday: “My wish is still that we see him in a Newcastle shirt again.”\nThat message has been reiterated at the very top of the club.\n“He can 100 per cent be reintegrated,” a leading source told The Athletic. “We’re rivals to Liverpool. He can have a great season for us.”\nOn Saturday, Isak returned to training with Newcastle.\nGeorge Caulkin\nIs Newcastle’s aim to bring in two strikers this summer?\nThis, naturally, is dependent on what happens with Isak.\nHaving allowed Callum Wilson to leave St James’ Park when his contract expired at the end of last month, securing reinforcements — and backup for Isak — has been one of their priorities. This was why they made (fruitless) moves for Delap and Joao Pedro. This is why they have moved for Brentford’s Yoane Wissa.\nEkitike felt like a slightly different case, and so does Sesko. Both are high-profile and with a high-profile fee to match. In an “ideal world”, the same leading source at Newcastle said, Sesko would play alongside Isak for Newcastle this season — perhaps with the latter agreeing a new contract containing a release clause. In a less-than-ideal world, Sesko is theoretically good enough to be a replacement.\nWhatever happens with Isak, Newcastle need to do something.\nAdvertisement\nWilliam Osula, the Denmark Under-21 international, has started three successive pre-season matches and is their only available ‘senior’ forward, at least in relative terms. Osula, 22 next week, has not started a Premier League match for Newcastle since being signed a year ago.\nGeorge Caulkin\nAre Leipzig willing to sell Sesko?\nYes, as long as their valuation is met. When Sesko signed a contract extension at the German Bundesliga side in June last year, it was with the understanding that if a “special” club made a bid in the €80million-to-€90m range for him this summer, they would not stand in his way.\nBut Leipzig are willing sellers rather than eager ones: they would be happy to keep Sesko for a further year, and have reported no issues with his attitude or application during their pre-season training camp.\nSebastian Stafford-Bloor\nIs Sesko happy to join Newcastle, given Manchester United’s interest?\nThat’s not clear. Sesko and his camp have always thought carefully about their next steps — going back to his time in Slovenian youth football — and this will be no exception.\nHe chose to stay at Leipzig and extend his contract last year, despite Manchester United’s interest in him then, so there should be no assumptions.\nSebastian Stafford-Bloor\nIs Sesko ready for the Premier League?\nIs he ready to perform at a decent level in England? Yes. But can he immediately match the expectation that comes with a transfer of the values being mentioned here? No, possibly not. Sesko has had very good spells at Leipzig, but is yet to become a dominant Bundesliga forward, and there’s no suggestion yet that he has outgrown the German top flight.\nWhoever signs him this summer (if anyone does) is going to need to employ some patience. He’s a fabulously talented player and has fascinating physical dimensions (he stands 6ft 5in/195cm), but he is yet to harness all of his abilities and therefore remains a work in progress.\nAdvertisement\nAt his best, Sesko can look exceptional. At his worst, he can be anonymous in games and become disconnected from the rest of his team.\nHe can become a terrific player in time, there is no question, but the higher standard of the Premier League might accentuate some of his flaws initially.\nSebastian Stafford-Bloor\nWhat’s the latest on Manchester United in all this?\nThey are continuing talks over Sesko, who is yet to make a decision on his future. That call could come in the next few days, however, with Newcastle forcing the issue by making a bid.\nAt Old Trafford, discussions with Sesko’s agent are taking place on wages and fees, which indicates head coach Ruben Amorim adding the striker to his squad is still plausible, despite reports in Slovenia stating he had chosen to join Newcastle.\nFinances are tight, but Manchester United can contemplate another signing this summer because of a few factors. They have shifted Marcus Rashford’s salary off the wage bill with his season-long loan to Barcelona, saving around £14million annually, and have earned £20.7m this window from sell-on clauses in moves for former players Alvaro Carreras, Anthony Elanga and Maxi Oyedele, plus £5m from Chelsea sending Jadon Sancho back after his loan there last season.\nPaying for Mathues Cunha and Mbeumo in instalments — three and four chunks respectively — also aids cash flow. United’s margins for the Premier League’s profit and sustainability rules (PSR) have been improved by the 2022-23 season coming off the three-year cycle calculations — the summer they bought Antony and Casemiro for a combined £156million.\nThe club would still expect to make sales this summer, with Alejandro Garnacho and Antony anticipated to raise significant fees. There are also several clubs interested in Rasmus Hojlund, and United accept they will likely need to accept an offer lower than his book value, which stands at a little under £45m. He could cost around £30m. Hojlund has said he wants to stay.\nAdvertisement\nThese departures can happen after an incoming transfer and still help the balance sheet on PSR, so long as they are completed before next year’s June 30 deadline.\nManchester United had been considering Aston Villa striker Ollie Watkins but are progressing talks on Sesko. Isak was considered but then discounted due to the huge cost involved and the player’s intentions on a move to Liverpool.\nLaurie Whitwell\nIf Newcastle won’t sell Isak, would Liverpool go for someone else?\nThat appears unlikely.\nLiverpool are keen to shift striker Darwin Nunez, regardless, and will listen to suitable offers for the Uruguay international. Should he go, it means the Premier League champions no longer have three of their attacking players from last season, following Luis Diaz’s transfer to Bayern Munich this week and the tragic death last month of Diogo Jota.\nFederico Chiesa, who only made one Premier League start in his 2024-25 debut year at Anfield, is also expected to move, but that doesn’t leave Liverpool light on numbers.\nWith Ekitike and fellow newcomer Florian Wirtz boosting a forward line that already includes Mohamed Salah and Cody Gakpo, there are four strong senior options to consider. Jeremie Frimpong, another signing this summer, can also operate as an attacking right-sided player as well as at full-back, and Liverpool are keen to provide a pathway for Rio Ngumoha, the 16-year-old who has been sensational in pre-season.\nHead coach Arne Slot has also spoken repeatedly about only bringing in players who can improve his squad, so if they are not able to get Isak, or are able to move Nunez on, they will likely stick with what they already have.\nGregg Evans\n(Top photos: Getty Images)",
  "word_count": 2075,
  "scraped_at": "2026-02-14T02:02:51.940674",
  "_text_extracted": true
}