{
  "article_id": "d9c6a8a6bd28",
  "url": "https://thechronicle.com.gh/real-madrid-hope-to-extend-lead-at-the-top-as-they-visit-real-sociedad/",
  "title": "Real Madrid hope to extend lead at the top as they visit Real Sociedad",
  "date": "20240426T063000Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid will be aiming to move 14 points clear at the top of the La Liga table when they continue their domestic campaign away to Real Sociedad on Friday night.\nCarlo Ancelotti‘s side are currently in a commanding position at the summit, sitting 11 points clear of second-placed Barcelona with six games left, while Real Sociedad are sixth, three points ahead of seventh-placed Real Betis in the battle to secure Europa League football for the 2024-25 campaign.\nReal Sociedad finished fourth in La Liga last season, but they are highly unlikely to play in the Champions League again next term, as they are currently sixth in the table, 10 points behind fourth-placed Atletico Madrid.\nThe Basque outfit are instead locked in a battle for a Europa League spot, sitting sixth, three points clear of seventh-placed Real Betis. As it stands, Imanol Alguacil‘s side will qualify for the group stage of the 2024-25 Europa League, but there are still 18 points to play for this term.\nReal Sociedad will bring a five-game unbeaten run into this match, including three wins in La Liga, but they have been held to draws by Almeria and Getafe in their last two games.\nAlguacil’s side have actually only won six of their 15 home league matches this term, dropping points in the other nine, including three defeats, and they will be welcoming a Real Madrid side with the best away record in Spain’s top flight during the 2023-24 campaign.\nReal Sociedad suffered a 2-1 defeat to Real Madrid in the reverse match at Bernabeu this season, but they recorded a 2-0 victory over the capital side when the two teams locked horns in the corresponding fixture last term, which should hand them confidence ahead of this contest.\nCredit: sportsmole.co.uk",
  "word_count": 295,
  "scraped_at": "2026-02-14T02:10:47.901220",
  "_text_extracted": true
}