{
  "article_id": "d9f73184c1a5",
  "url": "http://usa.chinadaily.com.cn/a/202308/14/WS64d9b990a31035260b81bffe.html",
  "title": "Bayern arrival Kane dreaming of Champions League victory at Wembley",
  "date": "20230814T113000Z",
  "domain": "usa.chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern arrival Kane dreaming of Champions League victory at Wembley\nBERLIN - Big dreams seem synonymous with big clubs for England's captain, Harry Kane.\nJoining German record champion and 2020 treble winner Bayern Munich, the 30-year-old former Tottenham star discussed his desire at a press conference. Kane has his sights set on the 2023-2024 UEFA Champions League with his new team.\nHaving committed to a four-year contract until 2027, Kane expressed excitement about the Champions League final's location. \"The prospect to win at Wembley is overwhelmingly exciting,\" he said. \"It's a way to go but the goals of the club and me match perfectly as we want to win all possible titles.\"\nFor Kane, the Champions League title isn't just a dream -- it's a genuine target. He believes it's within Bayern's grasp.\nThe Three Lions top scorer conveyed his intent to infuse additional leadership into Bayern's lineup. He stated, \"it is part of my personality to push other players to another level.\"\nKane is keen on collaborating with Bayern icon Thomas Muller. \"He already asked for a game of golf, and I guess we get that done over the upcoming weeks,\" he mentioned.\nThe transition to the Bundesliga presents Kane with a new set of challenges. \"I spend all my life in England and have to get used to many new things, not only the language,\" Kane said.\nAlthough deeply connected to his English roots, Kane felt the moment was ripe for a fresh start. Bayern offers the platform to perform at the pinnacle, and Kane is well aware of the expectations, especially in scoring. \"Goalscoring is my job and I have proven I can address expectations,\" the England captain stated.\nHe acknowledges the significant investment Bayern made. \"I feel the responsibility to repay the over 100 million euros paid by Bayern to Tottenham,\" he conveyed.\nKane had in-depth conversations with Bayern manager Thomas Tuchel. \"I enjoyed his energy,\" he shared, while Tuchel signified Bayern's intent to tailor their game to Kane's strengths.\nReflecting on his transfer, Kane shared his feelings about the recent transition. \"The past days have delivered many up-and-down experiences as it was the first transfer I was involved in, but I am finally happy to be here and was amazed by the warm welcome I received from the fans,\" he recounted.\nIn the coming weeks, Kane's focus will be on acclimating to his new environment, learning German, and bonding with his teammates.\nBayern, led by Kane, is set to face Werder Bremen in their 2023-2024 Bundesliga opener. This follows their 3-0 defeat in the German Supercup final against RB Leipzig.\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 504,
  "scraped_at": "2026-02-14T02:24:50.278102",
  "_text_extracted": true
}