{
  "article_id": "da1a68838e69",
  "url": "https://www.mirror.co.uk/news/uk-news/man-accused-shooting-glasgow-gangsters-36328251",
  "title": "Man accused of shooting Glasgow gangsters dead at Spanish bar pictured",
  "date": "20251129T234500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man accused of shooting Glasgow gangsters dead at Spanish bar pictured\nMichael Terrence Riley, 45, who is accused of shooting two Scottish gangsters, Ross Monaghan and Eddie Lyons Jr dead in Fuengirola Spain, has been pictured as he awaits trial\nA man accused of shooting two Scottish crime bosses dead in a bar in Spain as they watched the football has been pictured.\nMichael Terrence Riley, 45, allegedly killed Ross Monaghan and Eddie Lyons Jnr at a bar in Fuengirola in May. Riley, who awaits trial in Spain in connection with the killings, has now been pictured for the first time. He is accused of entering Monaghan's bar in Fuengirola on May 31, where Monaghan, 43, and Lyons Jnr, 46, were watching the Champions League final.\nBoth victims were linked to the Lyons crime group, based in the west of Scotland, which has been locked in a deadly feud with the rival Daniel clan for almost two decades. Riley then fled Spain and was arrested in Liverpool two weeks later, on June 13.\nREAD MORE: Mum and dad screamed 'help us' as son 'beat them, set fire to home then escaped'READ MORE: 'I saw Jill Dando murder suspect run off - police should have reviewed CCTV years ago'Chief Superintendent Pedro Agudo Novo, the Spanish police chief investigating the crime, said Riley, of Huyton, and previously of Bootle, was planning to flee his Liverpool hideout for a \"paradise island tax haven\" with no extradition treaty on the day he was arrested, Liverpool Echo reports. Following his arrest, Riley initially fought extradition to Spain.\nHis representative, Renata Pinter, told Westminster Magistrates' Court in September that he \"suffers from depression and anxiety\" and would be in \"fear of his life from other gang members\" if held in a Spanish prison. She added that she would advance submissions under Article 3 of the Human Rights Act, which \"prohibits everyone from being subjected to torture, or to inhuman or degrading treatment or punishment\". Riley ultimately consented to his extradition on October 7.\nThe killings of Monaghan and Lyons Jnr came amid a gangland feud across central Scotland, with home and businesses targeted by shootings and firebombing in both Glasgow and Edinburgh since March. Police Scotland have made 62 arrests in connection with Operation Portaledge since November.\nIn 2006, Michael Lyons, 21, was shot dead in an attack at a garage in north Glasgow owned by the Lyons family. The attack is believed to have been ordered by Kevin \"Gerbil\" Carroll, a major figure in the Daniel clan. Gerbil was shot dead outside an Asda supermarket in Robroyston, Glasgow, in 2010. Monaghan was acquitted of the murder. In 2017, Monaghan was shot in the shoulder outside a Glasgow primary school, prompting him to flee to Spain.\nChief Superintendent Agudo Novo, head of the provincial Judicial Police unit in Malaga, said after Riley’s arrest in June: \"I want to highlight the high level of professionalism of [the killer]. Not only did he walk up to the table where the victims were sitting and kill the first man before continuing with his mission when his gun jammed.\n\"It’s not normal for a criminal to react the way he did in the face of this unexpected problem and resolve the situation to continue and pursue his second victim inside the bar and kill him. His escape was also a very professional one. It was clear he had previously studied all the cameras in the area and undertaken some other investigative procedures I can’t go into at this stage.\"",
  "word_count": 589,
  "scraped_at": "2026-02-14T02:12:17.570055",
  "_text_extracted": true
}