{
  "article_id": "da1a5ddd8bd5",
  "url": "https://www.france24.com/en/live-news/20240110-it-is-going-to-be-tough-for-champions-senegal-warns-mane",
  "title": "It is going to be tough for champions Senegal , warns Mane",
  "date": "20240110T063000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is going to be tough for champions Senegal, warns Mane\nAbidjan (AFP) – Senegal captain Sadio Mane predicts that \"a really difficult group\" lies ahead for the Africa Cup of Nations holders when they face Gambia, Cameroon and Guinea.\nIssued on:\n\"The match against Cameroon is going to be very tough and we dare not underestimate our other opponents,\" the two-time African Player of the Year told reporters.\n\"While accepting that none of these matches will be easy, we have the ability and determination to reach the knockout stage,\" he said ahead of the tournament kick-off on Saturday.\nSenegal defeated Cameroon 34 years ago in a group match in Algeria when they first met in the African football showpiece.\nBut Cameroon have had the upper hand since, winning a quarter-final, then the 2002 final and another quarter-final after penalty shootouts.\nSenegal have beaten Guinea twice, but only drew 0-0 against them in the group stage two years ago en route to winning the Cup of Nations for the first time.\nThe Group C clash between the title-holders and surprise 2022 quarter-finalists Gambia will be the first in the tournament.\nMane, one of several Senegalese stars who joined the lucrative Saudi Pro League this year, admits that while winning two years ago was difficult, retaining the title will be even harder.\n\"I believe the 2024 Cup of Nations will be the toughest to win because the line-up is the strongest.\"\nThe 31-year-old, who reportedly wed his long-time sweetheart Aicha Tamba at a private ceremony this month, was referring to the fact that the top 15 ranked teams have qualified.\n'Plotting to dethrone us'\nAmong the top 20, only Gabon, Uganda and Benin failed to make it to a tournament that will feature 12 former champions, including record seven-time winners Egypt.\n\"I cannot recall a stronger field. All the giants are going to be in the Ivory Coast and all of them will be plotting to dethrone us,\" added Mane.\nHe has won the Club World Cup, Champions League and Premier League with Liverpool, but says none of those triumphs compare with lifting the Cup of Nations trophy in Yaounde two years ago.\n\"Winning the last AFCON was the greatest moment of my career. No other success compares with it,\" said Mane, who converted the winning penalty in the final shootout against Egypt.\n\"It was a special achievement and one I dreamt of since childhood. Our victory had a massive impact on all Senegalese.\"\nSince the Cup of Nations success, Senegal have also won the African Nations Championship for home-based players and the African under-17 and under-20 titles.\nCameroon, whose five titles makes them the second most successful country in the Cup of Nations, are among the most unpredictable qualifiers.\nAfter a draw and loss to minnows Namibia in qualifying, they defeated modest Burundi to scrape through after being lucky not to trail by several goals at half-time.\nManchester United goalkeeper Andre Onana is expected to play at Tottenham Hotspur on Sunday -- one day before Cameroon face Guinea in their opening match in Yamoussoukro.\nCameroon coach Rigobert Song will rely on 2022 Cup of Nations leading scorer Vincent Aboubakar and Karl Toko Ekambi for goals after leaving out Bayern Munich forward Eric Maxim Choupo-Moting.\nGuinea hope star forward Serhou Guirassy, scorer of 17 Bundesliga goals for Stuttgart this season, recovers from a thigh injury sustained in a warm-up win over Nigeria.\n© 2024 AFP",
  "word_count": 574,
  "scraped_at": "2026-02-14T02:10:42.044616",
  "_text_extracted": true
}