{
  "article_id": "da1ce19c73ad",
  "url": "https://www.liverpoolfc.com/news/trent-alexander-arnold-fitness-update-1",
  "title": "Trent Alexander - Arnold fitness update",
  "date": "20250418T121500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NewsTrent Alexander-Arnold fitness update\nTrent Alexander-Arnold is nearing a return to full fitness and could be part of the Liverpool squad at Leicester City this weekend.\nThe Reds No.66 has been sidelined since sustaining an injury during the Champions League tie with Paris Saint-Germain at Anfield on March 11.\nBut Alexander-Arnold is due to rejoin team training on Friday and may be ready to take a spot on the bench at King Power Stadium on Sunday.\nAsked about the right-back and how close he is to featuring again, head coach Arne Slot told his pre-match press conference: “Trent is coming back from an injury, he trained with us yesterday and every time he plays with us and trains with us he shows his commitment.\n“He has worked so hard to be back already now, and the moment he is on the pitch he shows me what a great football player he is and how much he is involved in us trying to achieve our goals this season.\n“He has worked so hard during the whole season and now during his rehab to be back with the team again. The fans of Liverpool, everyone who watches football for the last five, six or seven years, knows he is an incredible full-back, has been an incredible full-back for this football club and let’s see what the future brings.\n“[He is] not [ready] to start but if things go well today and tomorrow, he might – might – be on the bench. But definitely not to start because he is out for five-and-a-half weeks and this is today probably his first session with the team.\n“It was Wednesday I think he did parts of the team session. So he’s not able to start but hopefully he can be able to join us because for Conor [Bradley], he has been out for a long time so for him to play 90 isn’t easy as well.\n“So it would be nice if Trent is with us during the weekend, yes.”\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTube",
  "word_count": 352,
  "scraped_at": "2026-02-14T02:26:33.609893",
  "_text_extracted": true
}