{
  "article_id": "da3ac375f81e",
  "url": "https://toffeeweb.com/season/22-23/comment/fanscomment/43031.html",
  "title": "How we got here and where we go next",
  "date": "20230111T004500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Greetings all, after having read the brilliant piece 'All Together Now' by Ell Bretland, I was prompted to reply and post the following, which in reality was too long to include as a separate post in that thread and was urged to re-post this as a separate article. So, here we are.\nHaving read all the comments in All Together Now. Here are my thoughts on our current situation.\nLampard and coaches\nI agree that the players and the team have to be supported. However, as a caveat to that I cannot, and will not support a manager, that has the 3rd worst win % of all post war managers; and next to worst points won % (only above Mike Walker)\nThe club really do need to appoint a manager who can extract enough extra quality out of the players, to accrue another 21 points (or more), which will take us to 36 points for the season, and hopefully keep us up!\nCan anyone realistically see Tinkerman Lampard doing that? Not I, not even if we recruit three (quality, needed positionally) players, which looks increasingly unlikely as the window slowly creeps by.\nHow the club, or rather a combination of Thelwell and Lampard between them, had not drawn up a list of players, however short due to financial constraints, and present them to the board during the WC break is beyond me?\nIf they did, and the board said \"No can do.\" They then should have gone away and looked in every nook and cranny they could for personnel to improve the squad at affordable prices; or even failing that, worked out a sell to buy/loan transfer strategy for the club.\nMaybe, don't laugh now, they could have used the tour 'down under' to play mostly U23's and see if they could cut the mustard; and do warm weather fitness training with the first team squad.? How remiss of me, that would take forethought and planning I guess, which thusly rules any of that out.\nI still believe fully, that the actual team performances are down to the manager and his coaches being unable to get the best out of the squad.\nFrank was a very good midfielder, who was never quite world class, because he couldn't quite adapt his game to the English only talent around him when playing internationals. Which to a simple lad like me, seems to translate into his coaching issues, in that he doesn't know why the players can't perform to the level he asks of them.\nPaul Clement shows that during his coaching career, unless he has strong direction, a'la Ancelotti, then he struggles to get his ideas across to the players. (Without being cruel, if he has any; QED see a failed managerial career after going solo) Which maybe why he is just the set-piece coach now?\nIf Ashley Cole was as good as people say he is, and have reported him as being a top defensive coach, and a potential manager/head coach; then why do the full backs still struggle, why isn't Mykolenko rested, and try Ruben Vinagre? The defence, though improved is probably down to Tarkowski, and the use of Mina (when available), Coady and Godfrey (when available) rather than having to play Michael Keane, Holgate and/or a youngster i.e. Welch or Branthwaite.\nAs for Joe Edwards, I've absolutely no idea what he does, other than appear as a 'Lampard whisperer', speaking into Frank's shell-like from time to time during a match? Anyway moving on.\nDirectors of Football\nWith regards the lambasting of DoF's at the club since Moshiri implemented the role, that he envisioned Monchi (of Sevilla) to run, which was never going to fly. Therefore, in Mr. Moshiri's haste to get success he raided the then Head Scout of Leicester, to act as DoF, yet EFC did not, and do not, have the same calibre of scouting system that LCFC had, and additionally had Koeman, Kenwright and Moshiri (AKA Kia Joorabchian) interfering in his work.\nNB. Kia Joorabchian is NOT a licensed Football agent, he also claims not to be so. The reason being, he bypasses this, by being the owner of Sports Invest UK Ltd. where he acts as an advisor to registered FIFA agent(s) Nojan Bedroud initially, and now Gian Maria Montesano; his own employee. All of this is not illegal, unfortunately. Easy to circumvent rules when you want to isn't it.\nJust to highlight some of Kia's earlier mistakes (in getting noticed) here is an article from his early career; though it may appear especially pertinent to the connection to Moshiri, Russia, and players bought over the odds at too low resale values. Does a Leopard ever change it's spots?\nKia starting up (No, not the car!)\nThen onto Marcel Brands, and I have already stated last year, from an insiders insights, that Brands was only responsible for less than 20% of all transfer dealings during his tenure here, and the influence/interference from Benitez, along with Moshiri, Ancelotti and Kenwright led him to finally resign, after trying to get more 'internal (soft) power' by a board promotion.\nNow, we have Kevin Thelwell, and I have no idea what influence or power he has at the club? Though the signing off on a 120 point strategic review, which does nothing to rebuke executive management for their wilful interference with professional footballing management, means that I personally think it was written for him as part of his signing on bonus/fee or what not, to which he had to put his name to? Will he be successful, well thus far he hasn't seemed to inspire much confidence, but again, how influential is he in the signings since he arrived?\nManager Appointments (in brief)\nOn to the managers since Mr. Moshiri arrived;\nMartinez was never backed financially, though he did spot a young Van Dijk at Soton, but was told EFC couldn't afford him. Yet, in the very next window (after Roberto's exit) they could, but didn't buy.\nKoeman, the 'Hollywood' name, had one good season, then the money was splashed willy-nilly; plus, he wanted to improve his golf handicap for the Spanish courses in the Catalan region, and Walsh was played (as was Koeman) by those above and around him. Though most of the blame could be levelled at Moshiri and the board for not communicating with Walsh, and/or Koeman.\n***As a personal opinion, to me, this was definitely the clubs start of the slow degradation to where we are now***\nAllardyce, had one job did it, wasted more money on Walcott, (not much really in the greater scheme of things), whilst he also had to take Tosun due to Kia's best interests (sic!), sorry because Moshiri (after Kia spoke with him) realised that Tosun single-handedly stuffed Monaco in the ECL. A must buy striker to keep EFC up!? (Sound familiar to where we are now, in the fact we need one, probably two now?)\nSilva, Moshiri's Golden Child, caused a huge financial loss for EFC due to WFC complaining about tapping up. Marco showed much potential in his first season, but as per EFC's 'modus operandi', he was totally screwed over in the transfer market and was sacked, because the players bought didn't suit his system..? see above\nAncelotti, showed you could get a tune out of these players, but just make sure they don't have to play with the ball. Defend, defend, defend and break. A promising 12th in his first half-season.\nThe next season, after personal issues regards his family and home, and being hamstrung by a lack of funds, he had us 2nd on 1st Jan 2021, before losing 0-1 to WHFC, and the downward spiral continued till we finished a disgusting (sic!) 10th. What would we give for that now? At that point he activated his release clause, and traipsed of to Real Madrid, where he has become the first manager to win four ECL's.\nThen we had the most bizarre appointment of a manager that EFC could ever make in Rafa Benitez?! After a decent start, and the first signs of a 'slow down' in protests about his appointment, Benitez got us to 4th for the start of October '21, only to go on an horrendous run. Whether it was injuries? Tactics? Players downing tools? Lost focus of the footballing side? Too much internal politicking with Brands and the board? Or a combination of any or all of the above? Regardless, a league run of 2-2-9 got him sacked.\nWhich brings us to the latest incumbent, Mr. F. Lampard Jnr.\nSomehow, in his first half season, despite Frank's record of chopping and changing tactics, unimaginative use of subs (if at all?), and some remaining injuries from the Benitez regime, the EFC fans managed to help him amass a home league record of 5-1-3 (16 from 27 points).\nWhile he did his damnedest to get us down with his 1-1-7 (4 from 27 points) away record. Not to mention being mullered by Palace 0-4 in the Cup, with an abject performance, and completely the wrong setup.\nSo far this season, we have never been higher than 11th (let that sink in?) we have been knocked out of the League Cup by Bournemouth 1-4, and in the 3rd Round of the FA Cup at Old Trafford in yet another 'fighting/spirited/game' non-attacking display, against a United side that rarely hit 3rd gear? Oh, and with a league record of 3-6-9 (15 points from 54!) and only 14 goals scored in 18 games?\nAs mentioned earlier he is statistically the 3rd or 2nd worst performing Everton manager, depending on which measure is used, and despite all the blaming of the Chairman and CEO, and DoFs etc, he is not improving the players and nor is he getting the results needed often enough.\nPlus, he appears to be still unsure of his best system? Though most on here seem to know the best system is 5-3-2 or 3-5-2 against the better teams, or 4-5-1 against teams in the bottom 8 (surely?) Why-oh-why does he persist in his 4-3-3 fetish, and why-oh-why does he not get the ball upfield to a couple of target men when a goal behind? Or at least try and change the style of play at least?\nTime's up, Frank. You perfectly demonstrated last season, without the home fans, you are completely unsuited to fighting a relegation battle with your ingrained instincts to try and 'play' football, rather than trying to win ugly!\nFortunately, we only have 9 away games left, 2-4 look like we can get a proper result. Whilst we have 11 homers left, with 4-6 looking like games with a result for us. Hopefully we can pick up some surprises and scraps along the way too.\nNSNOW\nNow, moving onto the NSNOW project, as some have mentioned above, personally, I think that all protests should be post-match, and the players and whoever is manager, should be backed 100% during all the remaining games. Shouldn't that be a given after last season?\nThe messages shouldn't be broad I don't think, e.g. sack the board (What all 4? what about the executive body that reports to the board, shouldn't they be included too?), as it dilutes the message, and doesn't say why?\nRemember the 3Cs (OK, four in reality)\nCommunication (requires connection and clarity)\nCapability (requires clarity and culture)\nConnection (requires communication and culture)\n*Culture (requires all the above)\nUnfortunately, there is no, or little meaningful communication from the club. The club's capabilities are limited due to an inept, and amateurish executive team, that has reduced the club's capabilities further, by pushing the club up to, and probably beyond in reality, the limits of the EPL's P&S rule, thereby handicapping the playing side of the club.. There appears to be no, or little connection between fans and the club, and fans and the owner.\nFinally, the culture is amateurish (sorry to repeat myself), self-serving from the chairman down, mired in past, and to totally irrelevant previous glories and 'good times', incapable of honest self-awareness and self-development, and a financial model that appears to be stuck in the mid-80's.\nAs a protest we need to communicate our concerns. E.g. Not sack the board or Kenwright out; but The Chair/CEO/Board is/are taking us to the brink! The Board are negligent! The CEO is out of her depth!\nPoint out the perceived failings, hopefully a lot better than I have and give reasons why? Where has the investment gone Bill? Why sack managers when it is the incompetent board who appointed them should go! Denise stick to what you know...charity work! Graeme give us your footballing wisdom! Grant can we please see the proper accounts? Bill stick to the West End, the only theatre you have given us, is the Theatre of Nightmares! Who's to blame..? Follow the money! Etc, etc, etc.\nStrategy\nNow I'm sure I'll get called out, but I am in agreement, that a strategy, a plan and a great connection between executive and management level are required to succeed.\nLook at Man. Utd. whilst Ferguson was there, he had David Gill as an excellent no nonsense, footballing CEO, who gave Ferguson what he wanted as soon as he could. Between them they created, arguably, the best club in the country, during that time. However, once Gill retired, and Ferguson struggled to a lucky Championship win in 2012/13, he realised the game was up while having to work with Ed Woodward.\nIt was no coincidence that whilst Woodward was CEO that apart from a token 2nd place Utd did nothing, and appointed manager after manager! For clarity, an FA and League cup too.\nYet since Woodward has left, and the new CEO, Richard Arnold took over, United selected a coach they wanted whose strengths suit those of the club.\nIn addition Woodward bought very expensive players as each manager wanted, but again they were for each manager's style of play, or a marquee signing, and not what the squad that had been assembled previously needed. Again, does that sound familiar?\nOne thing Arnold, and Ten Haag have done is get rid United of the 'problem personalities' in the team, e.g. Pogba and CR7, with public backing from the club, and they are starting to look at what the team needs and how they are going to play going forward.\nEven in Ten Haag's short tenure, you can see the previously under-performing players at Utd are now playing much better, and as a unit too. This is why we need to remove Bilharzia Bill, and just as importantly, his side-kick, Dipylidium (tape worm) Denise.\nAs other posters have said, we need to pressure Moshiri, in a polite, open fashion, to try and take the scales off his eyes regarding how the fans feel about the state of affairs at the club. The problem being, we don't know factually why Moshiri bought the club? Was it for self-aggrandisement? Was it for investment? Or was it a financial vehicle for his other business interests?\nIn truth, if it because of any of the above, I don't think he'll be interested in doing anything at all, other than tell Bilharzia, that relegation is unthinkable.\nSack the Board\nNow, for those asking if the 'board' can be sacked, the short answer is, yes it/they can.\nAll Moshiri needs to do, is call an EGM (Extraordinary General Meeting), present a vote of no-confidence in the members of the board, and put it to a shareholder vote. As Moshiri is the Majority Shareholder (Owner, in all but name) he can vote them all out. The key-point here is that Moshiri is not a board member, he is a shareholder.\nHowever, as I just mentioned, unless the club get relegated, or look like they are going down, I don't see Moshiri being bothered about a major executive upheaval, when he can just replace the latest scapegoat. Unfortunately.\nThe Future (sorry, no crystal ball)\nWell, Moshiri seems to have made his intentions clear; open BMD, redevelop Goodison, and sell the club to cover his operational costs at the date of sale.\nI think initially Moshiri did want us to get into Europe and join the EPL top table again, but not for the benefit of the club per se; but to benefit himself, and the resale value of EFC. A sad perspective, but that is what I think has been the plan all along... The problem now is, if Moshiri does sell, or finds additional investment; what is the plan for the club then? How does it move forward?\nA possible scenario is that Qatar Airlines pay for the naming rights of BMD; and the Qatar group who own PSG, buy say 10-15% of investment with EFC. In the short term, that would seem the best for all parties, though I think the investment would go to finishing the stadium, rather than to improve the playing squad dramatically.\nAnother scenario, is that Moshiri manages to persuade the potential American investors to come on-board in a similar fashion to how he started at EFC. That is, with a limited but controlling concern being bought by them, whilst Moshiri stays on-board to ensure the funding for the completion of BMD, whilst the Americans attempt to modernise the club, and improve the footballing aspect.\nThe reason I present the second scenario like that, is that I don't think Moshiri will sell at such a low return on his investment, as once BMD is built, he will develop the Goodison site, and as likely, more land on the Royal Blue Mersey. Maybe with Usmanov in the background, and using their intricate backing systems, to circumvent the ban on Russian-associated investors somehow; pretty much like the Joorabchian and Berezovsky situation in Brazil.\nAnother scenario, is that Moshiri is made an offer he can't refuse (financially I mean) and sells up lock, stock, and barrel; but to who, and when? Highly unlikely in my opinion, especially in our current situation. Also, maybe that would be a case of 'out of the frying pan, into the fire'; or \"Be careful what you wish for!\"\nI certainly cannot pretend to know what is going to happen, however, in my 'happy place'; I'd prefer Qatar Airlines to come on board, with some investment from the Qatari Investment Group. Then, once BMD is finished, the Qatari's buy out Moshiri, send Bilharzia packing, and perform a complete overhaul of the club from top to bottom. I wouldn't even mind if Dipylidium Denise stayed as CEO or Chair of EITC.\nRelegation\nWhy 'Sliding Doors', why 'Now or Never'?Well, this is, in my personal opinion, Everton Football club's 'Sliding Door' moment.\nEither the door we go thru leads us to EPL survival, and positive change at the club; or, nothing happens, and we get relegated, which will lead to a huge fall-off in revenue, and the clubs financial operations will implode.\nThere would be an exodus of first-team players because of contracts with relegation release clauses, the back room staff would have to be trimmed due to operating costs, maybe the Academy would have to be mothballed, again because of the costs involved in running it; lastly the club itself and the 591 employees of the club (rocketreach.com), would of course all be vulnerable to redundancy. Though I'm sure all the executive level team would have either 'job security', or 'golden handshakes'.\nI don't wish to scare anyone, but if Everton get relegated in our current financial position, we could be in the wilderness of lower league football for quite a few years; and at worst, depending on the largess of Mr. Moshiri, we could go into administration almost immediately.\nDon't forget, Moshiri, could still complete the stadium at BMD, and sell it as an investment opportunity, and then level, and redevelop Goodison. He doesn't need Everton to be in existence to do that.\nFundamentally, relegation at a minimum means Everton would be wholly dependent on investment to survive, as financially, they fall foul of the EFL P&S rules, and the club itself in all areas would be subject to severe 'shrinkage', with no financial means to support the club itself.\nTo get more detail, there are a couple of posts on 'Paul the Esk's' twitter, and on his website, there is plenty of information about the situation we would find ourselves in, if indeed Everton are relegated.\nI would say that this is season is Now or Never to try and oust Bilharzia and his parasitical cronies, realign the club to a modern forward thinking club, and gradually build success on the pitch.\nIf you have made it this far, thank you for reading.\nGood wishes to one and all,\nNSNOW\nReader Comments (25)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 10/01/2023 at 17:54:47\nI was initially daunted by the length of your piece but, once I started into it, I found myself nodding in agreement through each of your well-elucidated points.\nI think that you have really got to grips with the inept almost indifferent series of managerial bungles and retreats by Moshiri and Kenwright that have brought us to this lamentable state. The waste of money, and consequent missed opportunity to propel us to a new level, sickens me to the stomach.\nI also agree with your summation of the disastrous manager appointments, sadly including Frank, who should never have got the job. One thing you are too kind to mention is that his appointment was to a large extent driven by pressure from fans, often the same ones who continue to support him despite the evidence that he was not and is not up to the job. Hope over experience, I guess.\nWhere I differ slightly is that, whilst I agree Moshiri is very obviously seeking to sell the club when the new stadium is completed, I can only see this as light at the end of the tunnel.\nYes, I have no doubt he will ensure that he is the main beneficiary of the sale, but I must believe that whatever comes next must be better than the demeaning madhouse that he and Bill Kewright have foisted on us. Can't it?????\n2 Posted 10/01/2023 at 23:48:09\n(Hail to selling Broadhead for a nominal ٟ.5M, where he would've been released for free under previous regimes. More of these, Sir!). Marcel Brands did some of the heavy lifting (e.g. fast-tracking players via the Reserves) beforehand but was heavily compromised by Rhino & other Kenwright entourage. Fortunately, with more Evertonians waking up from Kenwright's BS and the Board's incompetence, Thelwell has been afforded more breathing space to do his job more properly.\nTime is not on his side, however. We need to stay in the league after Game 38 to buy extra transfer windows for him to continue rebuilding our club. Thus, I would be happy if my pre-season expectation of a 17th-place finish materialises.\nAnything on top of that would be icing on the cake; #Kenwright Out would be one heck of an icing!\n3 Posted 11/01/2023 at 04:19:53\nI think Moshiri is leaving it more and more to Bill, as he has enough on his plate because his day job as Usmanov's money man has got a lot more complicated in the last 18 months or so.\nHe (and Usmanov probably as well) fell for Bill's alledged line of... \"I'm so close, all I need is more money, I can do the footy stuff (see all the 5th and 6th finishes)'.\nYou've outlined the way to remove the Un-fab 4(?)\nGetting decent replacements is the hard part...\nOur (ie, Moshiri's and Lampard's) immediate problem is beating Southampton... which, depending on the result, will, for better or worse, change the game again.\n4 Posted 11/01/2023 at 08:04:54\nA thoughtful and thought-provoking piece that, Simon. Some comments.\nOn the appointment, not for the first time, I was nervous and unconvinced about Lampard. I remain so. But I am equally sick of blaming and changing managers.\nI agree with your point about the manager and coaches ultimately being responsible for matchday performances. But in the case for the defence, they deal with the resources they are afforded. We have underinvested for too long.\nInteresting point with regards to Lampard the player. There are quite a few players who were amongst the best of their generation that struggle to step into management or coaching. It doesn't always translate.\nGreat players turned managers can't always understand why their players can't do things because to them, it came natural and they didn't have to think about it, so they can't always explain or coach it.\nFor every Pep, Cruyff or Kendall, there is a Gerrard, Lampard or a Gullit. Then you have Ferguson and Mouhrino. Not particularly great or successful players, but successful managers.\nEverton has messed up the DoF model through interference and not letting them do their jobs. If you implement that structure, then let it work; otherwise, don't have it. It feels to me like it was a high level concept that had little substance underneath in terms of delivery, empowerment and execution.\nI'm not sure about the comment on Martinez not being backed financially. Wasn't Lukaku our record signing at the point of him signing a 5-year contract? I know we had the song about loans, but I think he was backed in the second season and with not many significant outgoings the other way to balance the books. That came later.\nI won't bore everyone. I've mentioned it many times. The degradation of the club has been over decades; about 40 years or more. Our success has always been in short-lived spikes.\nI have to challenge you with reference to the Man Utd match. We may have had a wide open midfield, but we did attack and were a split-hair decision away from an equaliser before a soft penalty in the final throes, but were in it until the end. I think it's harsh and the supporters saw something.\nI was as disappointed as anyone with the result leaving the ground, but I couldn't knock the effort and performance. Tactics maybe at fault, but the players left it all on the pitch. Rashford, who bagged a brace last night, had a great night. That was the difference as much as the decisions.\nTo the main theme of your very well written and articulated article. The focus for change has to be on the board and how this club is fundamentally run.\nWill sacking the board provide a quick fix? No, I am not naive enough to believe that. However long-term it has to be the solution.\nWithin reason, manager after manager can't be the reason that the club is failing.\nGauging how the fans feel? Unless they only focus on the passionate matchday support and our PR/Marketing department is as bad as I suspect, they are blinkered. ToffeeWeb and other sites may only represent a proportion of the Everton fanbase. But if I were in their shoes, and in this age of internet and data based decisions, I'd be all over it.\nGood read that Simon. Thank you.\n5 Posted 11/01/2023 at 08:33:39\n6 Posted 11/01/2023 at 08:33:53\nI could do it myself, start writing about Everton and forget to stop, such is the calamitous way we have been run for years and years, and which is only going to end in one places if we are not careful.\nIf I was in charge at Everton (the person who made key decisions), I would have spoken to Lampard right after the Brighton game and asked him the question that was on thousands of Evertonians lips.\nDo you not know your players, Frank? Do you realize that you can only make your ideology work when you have got enough of the pieces in place? Are you going to change to a system that the players seem to understand? One which makes us harder to beat? Or are you going to persist with something that is not only not working â€“ it is going to send us down?\nI'm not sure these questions got asked and he's going to change but I think we all know what needs to be done very quickly if he doesn't change.\n7 Posted 11/01/2023 at 09:30:31\nYou are particularly critical of Lampard and I agree. He constantly changes players' positions and team formations and even when he hits upon a system that seems to be working, changes it for the next game. The clichÃ©d terrace chant “You don't know what you're doingâ€ springs to mind.\nI'm not in favour of constantly changing managers, and as Danny says, he can only work with the resources he has, but his record in the last 12 months does not convince me that he has the skills to keep us up.\nHe should be gone and gone now! I think the only reason he is still here is that this useless Board hasn't a clue who to replace him with.\nI don't agree with Danny that we have under-invested, on the contrary we have badly invested millions, and are now reaping the consequences, ie, older players on inflated long-term contracts and little or no sell-on value and leaving us no wiggle room within P&S rules.\nAll Evertonians know we needed at the very least 2 strikers and a creative midfield player with pace last summer. Wouldn't you expect therefore that our recruitment team would have already drawn up a short list of potential candidates with the right skills profile and be at the right age and cost?\nAlso they should be actively researching the availability of these players before the transfer window opens?\nYet here we are again, scratching around for loan deals or showing interest in wingers with little goal contributions in their record as the transfer window grinds on when we need an up-the-middle striker who's first instinct is to get in the box and score.\nI know all clubs are looking for such players, but I can't help thinking that, for all his history, age and injury problems, maybe Danny Ings could do a job for us for a couple of years? Controversial, I know, but I bet he would get us goals and, let's be realistic, are we in a position to get anyone any better?\n8 Posted 11/01/2023 at 09:42:38\nWe haven't under-invested. We badly invested. From the top down.\n9 Posted 11/01/2023 at 10:19:37\nA good read and thanks for taking the time to put it together. And a very interesting insert re the influx of money from very Iffy characters. One of whom it looks like Moshiri is friends with!\nAbout the Manager and DoF? I think it's a very dodgy situation... for us. If we show a vocal dissent of the manager and players, what will that do to their morale? Even as professionals, playing in a poisonous atmosphere will affect them and the manager.\nIf the intention is to force the Board to get a change, what if they can't or won't sack the manager? Would we be able to bring in a manager of such quality who can lead this team and this club out of the mire? Is there any money for a new manager to buy or loan players of good enough quality to make a difference, would they want to come?\nI think it is a potential situation that Army planners at Sandhurst would call being \"Up Shit Creek without a paddle!\"\nIt is a situation that Kenwright is getting paid millions of £££s a year to resolve? And he has managed to do with resounding failure for decades.\nI'd never boo an Everton team. To me, as much as I think the manager isn't up to the quality we need, not supporting them through this next 5 months will hasten the slide into relegation. What effect then, on the future of the club?\n10 Posted 11/01/2023 at 10:37:42\nThere's no shortage of football experience and knowledge in the first team management, I've no real worries there. So I'm on the fence with regard to Frank's ability as a manager; I find it hard to come to a firm conclusion.\nHe has been hampered so far by injuries to key players and by a limited amount of money to buy players. I fail to see how he could have done things a lot different.\nThe defence is okay, but we have a team full of players who can't put the ball in the net, that's what is killing us.\n11 Posted 11/01/2023 at 11:31:45\nFrank's fate is now 100% tied into this Saturday's match against the bottom club. Anything less than a win and I cannot see him surviving beyond Saturday evening.\nA really important point I think you make is about the protests against the totally incompetent board and even worse Chairman. It has to be post-match as the manager (whoever it may be) and players need all the support they can get before and during games.\nThelwell is not blameless. I honestly think we'd be much closer to mid-table if we had bought a more direct replacement striker for Calvert-Lewin. Even now Calvert-Lewin is still off the pace.\nEven a journeyman striker like Ings or Weghorst signed instead of the unnecessary (for what we needed) signings of Maupay and McNeil would have seen us quite a few points better off.\n12 Posted 11/01/2023 at 11:45:05\nFair points. I too think that playing in a poisonous atmosphere is not going to help the team and I would never boo an Everton team.\nThe points you make about the difficulty of bringing in a capable manager and suitable players are also valid, but I still think that persevering with a manager who to me has demonstrated that he is not up to the job, is a recipe for disaster.\nRaymond @10,\nYou're right â€“ there's no shortage of football experience and knowledge in the management team, but unfortunately that does not necessarily translate into a good football manager.\nThey knew in the summer we were short of players who could put the ball in the net and what have they done about it? Good management that!\n13 Posted 11/01/2023 at 11:45:15\nIf we win, then applaud the team, but still sing the anti-Kenwright songs; if we lose, full-on boos against everything.\nKENWRIGHT OUT\n14 Posted 11/01/2023 at 12:04:21\nI've said it before... the only way Kenwright and his cronies will go is if the club is sold.\nHow many times have we heard that Barrett-Baxendale is taking a new job and Kenwright is not well... etc?\nKenwright will continue from a distance and remain in control of the club. I honestly think he doesn't give a shit about protests or opinions â€“ he cares for himself, not the fans or the club.\nHe will have banners removed and his media luvvies will defend him to the hilt.\n15 Posted 11/01/2023 at 13:16:02\nWe have reached a point in time where just about all the supporters posting, media in general, ex-players in particular, pundits, Uncle Tom Cobley and all, have looked at the players we have, the situation we are in and the prospects for a relegation fight would not appear good.\nKenwright will be wondering what to doâ€¦ sack the manager and try to redirect blame? Back the manager and buy 3 or more players?\nA rock and a hard place because getting rid of Lampard and his backroom staff is likely to be very expensive, impacting on time for any new manager in this transfer window and money of bringing someone new in. There is no doubt we need better quality than what we have to get out of this mess.\nIf another manager comes in and it still goes pear-shaped and we get relegated, Kenwright and Co are finished and the club's ongoing prospects are stuffed.\nOne assumes, Simon, that another manager will get a tune out of what he inherits â€“ good luck with that. Barring our keeper, who may yet be sold, we have sold or got rid of all the top-quality players we had, which wasn't much but Richarlison, Sigurdsson, James, Digne and replaced them with Gordon, Gana, Patterson (injured), Maupay, McNeil.\nPut simply the aquarium we had prior to Benetiz was struggling, but after he was shown the door, we are left with wannabes and, in the words of Roy Keane, some really bad, bad players.\nThat's the task Lampard has and he is struggling to get anything resembling a tune from what's left. We have fallen that far.\nIf the board were sacked tomorrow, it would be a massive psychological step for the club, for fans and the manager. It's unlikely to make everyone happy, I would say a 20% chance?\nTo sack Lampard would be seen as incompetence of the board â€“ yet another manager... a laughing stock of a club â€“ it would leave the team in a bad place, never mind who you would think would or could get a tune playing long enough for survival.\nNo, Lampard isn't the best, but neither are the players; nearly half-way through the transfer window and nothing from our chief negotiator. That's not the manager's fault.\nNormally, Lampard would not have expected to survive this run, but things aren't normal. It's the board's fault that the resources aren't there; it's both the board's and Lampard's fault that we cannot get the players we have performing.\nThe board caused the mess Lampard is trying unsuccessfully to put right; we can't lose a board and a manager, I doubt we would win again all season. Lose a board and keep the manager? The best of bad options but he has the fans' support â€“ that is vital in the scheme of things.\nMost likely scenario? Nothing will happen. Neither will go. 3 players brought in and we struggle to stay up... only then would Lampard go.\nRemember though that Moshiri needs survival to guarantee investment or a sale price. When it got scary, big Sam was called in. That's the big unknown, Moshiri has all the cards...\n16 Posted 11/01/2023 at 13:43:24\nOur so-called DoFs have been a dead loss, I don't think we know exactly what the hell they do.\nWho actually is involved with the buying of players? Who has the final say? It's another black hole.\nWhat I will say in defence is that it's easier said than done to find good enough players for where we want to be in the Premier League, that are also willing to sign for us.\nWe have managed to find a few over recent times but not nearly enough.\n17 Posted 11/01/2023 at 14:10:13\nThe Board is certainly responsible for what I can only describe as a managed decline of the club, selling our better quality players and replacing them with mediocrity at best.\nLampard himself was only appointed at the end of the January window in what some describe as a panic reaction with nothing on his CV to suggest he could solve the club's problem which were already obvious then. So we find ourselves in a stick or twist situation with either outcome being something of a lottery.\nI think your conclusion as to the most likely scenario is spot on. Moshiri is a money man, not a football fan. That will determine which way he jumps, if at all. Sliding into the Championship is going to massively affect the value of the club and therefore his investment so I would expect him to take some action, but what that will be or if it will be enough is the big question.\nLet's hope it will be for the club's and supporters' sakes.\n18 Posted 11/01/2023 at 14:40:02\nIt's like Christine has said, we're in a terrible dilemma and it is a terrible time to be in such a dilemma; and the club is in such a dire situation.\nIt seems to me that the club is in the grip of a set of circumstances that could lead to relegation, and even worse, Kenwright staying as chairman and even worse again, a group of sharks picking off the club through Moshiri just wanting to be rid of the burden.\nAll the scenarios that Christine has pointed out can become a perfect storm for EFC.\nI think Christine has it right. If the club listen to us and sack Frank, then who do we get and, if we go down, the board would say they did what we asked.\nAnother factor is Moshiri and what is his favoured solution. A load of if's there! Whatever happens in the next few months, will likely decide the outcome for him.\nMy thought is that we'd be best doing a re-run of the last season. Whether enough of us have the heart to do that is debatable, maybe very debatable! But is the least worst option.\nShowing our anger at Kenwright's self-seeking stewardship is, I think the other valid way of pointing the spotlight on this devious man and the main cause of Everton's demise.\nMaybe, we'll get in a couple of players who know where the goal is and will help us out of the Bottom 3. At the beginning of this season, I had a desire to see us get out of the Bottom 3 and stay away from it; and look where we are!\nI'll be going to this meeting tonight, and I'm only expecting a \"There there\" and pat on the head, sort of meeting; we'll see.\nI don't see any other way but support this time while showering Kenwright with the disdain and anger at his selfish, greedy antics for near 30 years.\n19 Posted 11/01/2023 at 15:09:20\nThe club is nothing without the fantastic support; those who buy tickets and all the merchandise would have nothing to cheer on without the money men.\nThe relationship between the two is obviously fractured to the point that an unravelling might be imperative.\n20 Posted 11/01/2023 at 15:26:28\nLampard needs to be replaced. He will get us relegated if he continues with the expansive 2 wingers and not packing the midfield or defence.\nI do think Cole has improved Mykolenko. Patterson is still finding his feet at this level.\nWith the record of Moshiri and Kenwright, I have no confidence in them bringing in a successful manager.\nEven when they did bring in Silva, Brands and Ancelotti they hung them all out to dry after getting their fingers burned by Koeman.\nSilva was let down with not replacing Zouma and Gana. He was unlucky with the purchase of Gbamin.\nIf Brands was only involved with 20% of transfer dealings, that in itself defies logic.\nAncelotti needed backing in January and ended up with an overweight Josh King. The man is the best in the business but not a miracle worker. No wonder he walked.\nAll easy to point out in hindsight but the facts are Kenwright and Moshiri, even if they did 100% want the best for the club, have proven their incompetence time after time. We won't win anything with those two in charge.\nWhen (and not if) Frank gets the sack, don't expect Kenwright or Moshiri to have a moment of inspiration and bring in the next Wenger or Ferguson. More likely we will be calling for the next manager's head in a little over 12 months time.\n21 Posted 11/01/2023 at 17:02:43\nFair enough Jim,your solution is as good as any other on the table.\nMy only fear is that unless Lampard comes up with a massive re-think on how to get the best out of this squad every game we will not get enough points to survive.\n22 Posted 11/01/2023 at 19:03:28\n23 Posted 11/01/2023 at 22:36:00\nHow then does he set us up? Does he eventually see sense, play 442 and win ugly or carry on with his ridiculous tinkering? Maybe he's already wealthy enough to not give a shit. Now there's a scary thought.\n25 Posted 12/01/2023 at 15:42:06\nNow, whether he or Thelwell have the go-ahead to buy at least a goalscorer, he'll have to re-jig the team as best he can to a) make it hard to beat, and b) be of sufficient threat going forward to put the fear into the opposition.\nIt's certainly not going to help him if we set up like we did against Brighton. Certainly I'd like to see two banks of four for them to stay united and close the gaps and ensure they stay closed. Let Southampton come on to us, then release the two forwards. Use Gray and Gordon as fast breakaway attackers, supporting each other as each attacks.\nPersonally, I'd forget about crosses unless it's free kicks or corners. Just use the speed of these two with the support of a midfielder or two as the game unfolds. But midfield's primary duty is to defend our defence.\nIf that doesn't sound too Irish!\n26 Posted 13/01/2023 at 16:44:12\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 7597,
  "scraped_at": "2026-02-14T01:53:21.843839",
  "_text_extracted": true
}