{
  "article_id": "da62e9bab8fb",
  "url": "https://toffeeweb.com/season/24-25/comment/editorial/45243.html",
  "title": "More Mirage than Goodison Maestro , James Lives on in Our Everton Imagination",
  "date": "20240907T204500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When you’ve been as starved of success, of heroes and, frankly, of any consistent joy watching your team as Evertonians have in recent years, it’s understandable when we latch onto a genuinely exciting player and hold him up as the next Blue Talisman, sometimes before the printed letters have properly set on the back of his shirt.\nIliman Ndiaye has only made four appearances and started just one match but he already feels like the answer to our collective prayers for a genuinely exciting talent to grace Everton colours. We can only hope he fulfils that promise.\nThe Club’s history is adorned with a galaxy of genuine stars and there have been plenty of fan favourites despite what is approaching four barren decades since our last league title, but as the Toffees have struggled through three relegation battles and a period of austerity that has them standing alone as the only top-flight club with a positive net-spend over the last five seasons, our best players have been sold on. Richarlison was the last of them; Amadou Onana had the potential to be one but Goodison Park was always going to be a stepping stone for him in our current situation.\nJames Rodriguez never got the chance to become a modern-day Everton great — a combination of the arrival of Rafael Benitez, someone with whom he did not see eye-to-eye at Real Madrid, and his eye-watering salary saw to that — but despite only making 26 appearances for the Toffees over a single, injury-ravaged season, he is simultaneously a treasured memory from an all-too brief moment when Spirit of the Blues was re-born as a Blues anthem and another emblem of the frustration of the past few years. Because almost no one got to see him play for the Club in the flesh.\nThanks to the Covid-19 pandemic and the subsequent lockdown, James played all of his Premier League games for Everton inside empty stadiums, with only those Evertonians who had media accreditation lucky enough to see him play “live”. On those rare occasions when fans were allowed back into Goodison — 2,000 at a time against Chelsea, Arsenal and Manchester United in December 2020 and then 6,000-plus against Wolves in the final home fixture — the Colombian magician was absent through injury.\nAnd when supporters in the USA got to see him play a combined 90 minutes in Florida during pre-season the following summer, it was fairly pedestrian “exhibition” fare played against the backdrop of reports that Rafa Benitez wanted him out. That was indeed the case and within weeks he was sold to Al Rayyan, his all-too-brief association with Everton over before we had truly been able to enjoy him.\nDespite the fact that Evertonians only got to watch him kick a ball in anger on television, that his season with the Blues was disrupted by injuries and the fact that Carlo Ancelotti allowed him to go home to Colombia before the 2020-21 season was even over, James’s time with the Club is remembered fondly. The feeling was mutual, it appears, based on an interview he gave with evertontv this week.\n“I’ve always thought I have only very good memories of that season I played at Everton,” he said. “I would have absolutely loved to have played in front of the fans, but from what I've seen on social media, I can tell that they have a lot of affection for me which means that I must have performed pretty well there.\n“I wasn't able to play in front of those fans because of the pandemic and that's one of the things that I always think about and reflect on. Then, in the end – and football can be like that – I had to leave and that's what happened\n“I was always happy because in spite of not having them close by, I could always feel the love and affection from all those fans it was a short spell. But the time I was there made a great impression on both me and my family too.”\nIn terms of global profile, he arguably stands alongside Samuel Eto’o and Wayne Rooney as the most famous player to have ever turned out for Everton. There was genuine excitement when he was signed from Madrid, particularly when it emerged that the Club had either paid considerably less than the initially-reported £22m and might have actually acquired him for nothing.\nHis early appearances were glittering, with three goals and three assists as he helped the Toffees to four straight wins to start their Premier League campaign and into the quarter-finals of the League Cup with a 4-1 win over West Ham. Everton were top of the table heading into the Goodison derby but, having been targeted by Virgil van Dijk and clattered early on by the Liverpool defender, Rodriguez struggled to have what had become his customary impact on the game and, truth be told, he wasn’t the same player for the remainder of the campaign.\nI would have absolutely loved to have played in front of the fans. From what I've seen on social media, I can tell that they have a lot of affection for me. —\nJames Rodriguez\nHe played and was fairly anonymous at Southampton the following week in an ugly defeat, underwent treatment for a groin injury, and missed another abysmal loss in Newcastle, returned with little impact for four more winless games before his troublesome calf sidelined him for most of December.\nBy the time he came back in the New Year for his last consistent spell in the side before the calf issue flared up again in March and again in May, Everton were second in the League and on course to qualify for Europe, until an inexplicable collapse in form, especially at home, saw them sink like a stone to 10th.\n“I believe that, if we had a slightly bigger squad, we would have been able to get into the Champions League, for sure, because throughout that entire season, we had suffered from a few injuries.\n“And so I think that if we've had a few more bodies to come in and play a bit more when required, I think we could have progressed that little bit further. It was a good side that always set out to win, and that was plain to see.”\nDespite his frustrating absences, there were nevertheless nuggets of gold from James — a memorable goal at Old Trafford in a 3-3 draw against Manchester United, a fine strike against Leicester City at Goodison, and a delicious assist for Richarlison as the Blues ended a 21-year wait for victory at Anfield but, by the end, it simply felt as though his body wasn’t up to the rigours of English football and that, when it came to the crunch, he wouldn’t be up for the fight.\nJetting off on a private plane to his homeland after complaining of “fatigue” and not taking the chance to show appreciation to a few thousand fans in that final home match at Goodison in May 2021 certainly didn’t scream commitment to the cause.\nUltimately, though, Evertonians would have preferred to have him in the squad than not, particularly as a bulwark of optimism and affection against the unwanted Benitez who ensured that James would depart the Club before the transfer deadline in the Middle East in September 2021.\nIn retrospect, in view of the Club’s financial struggles, the heavy treatment at the hands of the Premier League and its lawyers in the form of points deductions, and Kevin Thelwell’s campaign to gradually pare back the wage bill, it seems inconceivable that we could have kept Rodriguez even if Benitez had wanted him. (Reports have pegged his salary at around £200,000 a week, a mind-blowing number even if we did acquire him on the cheap, and unsustainable when it comes to contract negotiations with our other biggest players.)\n“I’ve spoken about this in interviews before and I didn't want to leave the club either, but the new manager had arrived — and we all know who that is — and he said that I wasn't going to feature in his plans,” James explains.\n“I never wanted to leave, that much is obvious. I felt that I could have gone on to play two or three seasons more at the Club. But it's plain to see that the manager said that he wouldn't be wanting me to be involved at all.\n“The supporters wanted me to stay and so did I. But in the end, that's just football for you. What happened then is now all in the past, but it was a real shame because I believe that I could've gone onto achieve more in my time at Everton Football Club. I feel like I could have brought more happiness to all of the fans.”\nHis time at Goodison may have been ephemeral and tantalising in so many ways but for the fact that we had a truly world-class talent, a Galactico, a World Cup Golden Boot winner in our team makes it hard not to look back on James’s association with Everton with nostalgia and a sense of longing.\nThe fans and the Club do seem to have left a mark on James, though, even if we hardly knew him.\n“I keep watching Everton's games. As I told you before, I was here for just a short period but that time here meant an awful lot to me.\n“Without a doubt, my favourite moment would be the first goal that I scored against West Bromwich. That first goal will always be here inside me and it's a lovely memory of mine … and also that great win we had at Anfield, that's also something that sticks with us all.\n“More than anything else, it was a difficult time for everyone, what with Covid and everything, and so I think [that win in the derby] was a moment of happiness for the fans.”\nFor that alone, quite apart from the other moments of magic, signing him was well worth it.\nReader Comments (55)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n3 Posted 07/09/2024 at 21:31:03\nI never really get why people like James but not Sigurdsson, who offered so much more on a consistent basis (even though regularly played out of position in an absolute mess of a line-up that still haunts us to this day).\n4 Posted 07/09/2024 at 22:24:27\nI wish he, and Carlo, had stayed longer.\n5 Posted 07/09/2024 at 22:36:30\n6 Posted 07/09/2024 at 23:09:13\nI haven't enjoyed watching a player in blue as much as him since and I think he was the best since Kanchelskis. We never got to see Rooney at that level.\nI'm just happy we got to see him, even if it was in front of empty stands. And as for the money, he doesn't go close to the waste on others. For example, Holgate's continued salary.\n7 Posted 08/09/2024 at 06:09:39\nIt was beautiful while it lasted.\n8 Posted 08/09/2024 at 06:30:52\nI wish we'd have got to witness him in the flesh.\nI know it is gone, but give us him for half of the fixtures a season.\nAnd I agree on the comment about Sigurdsson. We lost one of our most creative players.\n9 Posted 08/09/2024 at 07:01:58\nThe gold nuggets were worth every penny, for a short time we were spoken of world wide, promoted and admired with Ancelotti. South America knew of Everton and our club was blazoned from skyscrapers.\nJames skill lit up an empty stadium and the hearts of many. Why? Because his likes had not been seen in our team for over 30 years. He may be a waning talent but, even at half pace, he was still so far ahead of what we have got or had.\n10 Posted 08/09/2024 at 07:35:23\nI've forgotten what it was like when a midfield player could shoot from 25 yards with power instead of just passing sideways and breaking the play up.\nAs for James Rodriguez, a throwback to when you were used to just seeing sublimely talented players in Everton shirts.\nWe are unlikely to see that ever again unless a massive shift occurs.\n11 Posted 08/09/2024 at 08:29:57\nAs others have said, James playing for Everton was a bit of a dream; sadly, he joined us at the wrong time when few of us were able to see him play, and appreciate what a very fine player he was. He also seems to be well disposed towards the club and the fan base which is a classy touch.\nI am not sure if anyone remembers the Simpsons episode at the time James signed, where there is a scene in Mo's Tavern where Homer holds up an Everton shirt with “James” on the back amidst a throng of celebrating Colombians in their national team shirts?\nIt popped up on my Facebook feed at the time, but it did strike me that the signing made big news in the US and parts of South America, so much so that people signed up to an Everton fan club in Bogotà!\nSorry I can't find the link to The Simpsons scene, but I do recall it was very funny.\n12 Posted 08/09/2024 at 09:34:05\nThere's a song about Everton playing \"beautiful football\"… Makes me cringe to hear those words now while watching the present-day garbage but, for many precious moments in that fleeting season when Everton sat proudly at times atop the Premier League, James Rodriguez made it oh so real.\n13 Posted 08/09/2024 at 09:56:59\nThe lad had more skill in his little finger than the rest of the squad put together. One of my biggest regrets of being an Evertonian was never getting to see this mercurial talent in the flesh.\nAnother who has said nothing but great things about his time here. I'd have him back tomorrow, imagine him and Ndiaye in tandem.\n14 Posted 08/09/2024 at 10:03:41\nThe goal against Leicester with the so-called weaker foot, genuine top class.\n15 Posted 08/09/2024 at 10:16:13\nHe opened up defences with passes other players could not see or complete. The Anfield pass comes to mind but early in his Everton career in London he played in Seamus with the most exquisite one touch pass. Seamus crossed to Calvert-Lewin (I think) to score an absolute beaut of a team goal.\nSuddenly, I knew what the hype was about.\nProblem was he had the same problem at every club he played for — he just didn't play enough.\n16 Posted 08/09/2024 at 10:18:04\nWhile Sigurdsson was a decent player, even if he had spent 6 months in Specsavers, he still wouldn't have the vision of James. There is no comparison between the two.\nAlso, didn't James win the Ballon d'Or a few years back now? Even Sigurdsson at his very best was never near that level.\nJames knew because of his past run-in with Benitez that he would be first out the door. Yes, he had fitness issues but, when he played, he was influential — not something you can say about nearly all who have followed him.\n17 Posted 08/09/2024 at 10:27:37\nI see Gylfi Sigurdsson mentioned. Another great player. As he seemingly was never charged by the law, what happened to him?\n18 Posted 08/09/2024 at 11:12:24\nHe certainly was influential when he played, because he completely undermined the side from a defensive point of view and we were targeted relentlessly in the space he vacated. Once he was rumbled, he was just a visually appealing weakness rather than a strength.\nIt's a shame. He allowed us to briefly feel like we were on the brink of something special when this was never actually the case. We were miles off.\nAnd no, Rodriguez never won a Ballon d'Or.\n19 Posted 08/09/2024 at 11:24:38\nCouldn't agree more mate.\n20 Posted 08/09/2024 at 11:33:23\nYou don't sign James to be defensive, and that's the problem, I for one am fed up of Jacks of all trades and masters of none.\nJames was class, I am glad he came, sorry he went, because he reminded me of the joy of football so long lost watching Everton.\n21 Posted 08/09/2024 at 11:35:46\nApart from freekicks and corners, Sigurdsson also offered nothing defensively — later in his career with Everton he was even taken off them.\nHe became almost as proficient as Schneiderlin at manouevering into positions where no team-mate could pass to him. When the pressure was on, Sigurdsson would go missing but I never saw James shirk the ball once.\nI think the only people who regard Sigurdsson as a better option than James are those who are too young to see us win league titles. They have been brainwashed by the pragmatism and perspiration years of Moyes…. and of course by Sorcerer Bill making us all think being average was success. It certainly was with Bill and Moysie at the helm.\n22 Posted 08/09/2024 at 11:37:08\nCalvert-Lewin enjoyed his best ever season, when supplied by the magical Colombian. DCL proved to me then, that in a quality team, he had the ability to be a top-class striker. Had he moved on from Everton at that point in his career, perhaps to a top Spanish club, DCL would be a recognised world class centre-forward by now. Injuries and running himself into the ground playing alongside journeymen players at best, has totally stunted his development.\nI've watched Everton since the early '60s and would say without hesitation, that James Rodriguez was the epitome of the star quality player that our once great club would routinely sign. He was a throwback to an era when glorious football was on display at Goodison Park every other week.\nPut simply, he was a joy to watch.\n23 Posted 08/09/2024 at 11:45:52\nThey would then truly realise, what a true footballer is and why so many of us. older grumpy so and so's are so grumpy at the lowering of standards under Kenwright and Moshiri.\n24 Posted 08/09/2024 at 11:51:54\nHe won the 2014 Fifa World Cup Golden Boot and was selected for the All-Star Team, La Liga Best Midfielder 2015, Uefa Champions League Squad of the Season, and Bundesliga Team of the Season 2018, Copa America Team of the Tournament 2019 and 2024.\nPlus of course 3 x Portuguese Primera League titles, 2 x Spanish La Liga titles, 2 x Bundesliga titles, 2 x Champions Leagues titles.\nGlyfi Sigurdsson's main highlight at Everton was avoiding a custodial sentence.\n25 Posted 08/09/2024 at 11:59:26\nThe fact he was only here 1 season and still speaks affectionally about his time here is nice to hear.\n26 Posted 08/09/2024 at 12:11:30\nAnd neither were in any danger of adding to their trophy haul while at Everton.\nHopefully we can hunt out and develop players of this standard as teenagers who will stay long enough to deliver the goods.\n27 Posted 08/09/2024 at 12:29:19\nWouldn't we love to watch a front three of Richardson, Calvert-Lewin and Rodriguez now, instead of looking at Dom totally isolated under Dyche?\nI also thought Sigurdsson's best days were behind him before his ban, he was only a passenger.\n28 Posted 08/09/2024 at 12:56:26\nYes, fantastic moments get the heart racing and dreaming but the absence with reversion to the James-less mode was more than some fans could digest. Having a singular incredible talent without a balanced squad, and perhaps veteran leadership, simply exposed us as a club. We were not structured to field James without risks and Carlo masterfully minimized those.\nThe problem of replacing a player like that is the reason you don't go in for them without the structure and resources to build from there. Saint Siggy was a more practical and durable piece of the puzzle. James was a very expensive and needy, shiny, somewhat distracted display piece.\n29 Posted 08/09/2024 at 13:36:41\nJames, on the other hand, was pure class, even in his decline period when we signed him. But we could never afford him and the reason why is exactly because we overpaid mediocre players like Sigurdsson, Schneiderlin, Walcott, Tosun, Bolasie, Klaassen, Gbamin...\nSo many of them... a bad habit we now pay for.\n30 Posted 08/09/2024 at 13:53:42\n£45 million spent on Sigurdsson was the start of our financial issues.\n31 Posted 08/09/2024 at 14:07:21\nWhat happened to him seemed grossly unfair: 637 days to investigate what exactly? Before it was dropped by CPS.\nGylfi Sigurdsson (now 35) decided not to sue for damages and returned to playing football after a break of 2 years, firstly with Lyngby in Denmark, then this year moving back to Iceland with Valur.\n32 Posted 08/09/2024 at 14:15:53\nYou have to go back nearly 40 years to find a better left-footed player in a blue shirt... or anywhere else really.\n33 Posted 08/09/2024 at 15:07:18\nKoeman signing 3 Number 10s and selling Lukaku, the money he wasted and Moshiri bringing him in to replace Martinez — that's why we're where we are now.\n34 Posted 08/09/2024 at 16:00:55\nWe call Sigurdsson one of the worst signings we ever made yet he hit 13 goals from midfield in his second season and in his final season he contributed to 7.\nYet we champion players like Garner, McNeil who still cost a wedge and don't offer anything that say Scott Gemmil back in the day couldn't do.\nI've never understoof a section of our fans, it's like it's all about stopping the opponent scoring instead of actually going for goals or entertainment.\nI fully expect Ndiaye will have any positivity that his play brings trained out of him by the teachers at Everton.\nIt's okay though, let's just have midfield players that have defensive awareness, it doesn't matter if they don't score all season or create very little.\n35 Posted 08/09/2024 at 16:18:20\nSigurdsson cost us £45M in transfer fees and £22.9M in salary. Therefore, his 25 premier league goals came at a cost of £2.7N per goal.\nHis signing typifies the Moshiri era at it's very worst.\n36 Posted 08/09/2024 at 16:19:45\nOne of our latest recruits, Jake O'Brien, is already being written off by some, as an Everton player, due to his short appearance for the Republic of Ireland against England yesterday.\nNo wonder the media think we are such an easy target, we, the owner, the manager, the team and the supporters give them so much that is negative to write about, that even the dreamed of new ground is having about as much positive impact as a needle to the eye.\nIf we carry on with this seemingly unending negative vibe, we will — as somebody said on another thread — become very much another Leeds United.\nLeeds have never been as big or as good as Everton for most of their history, so it's an almighty fall from grace for anyone connected to what I might call traditional Everton rather than the pale imitation we've had to endure for such a long time.\n37 Posted 08/09/2024 at 16:19:52\nAll miles worse signings than Gylfi Sigurdsson.\n38 Posted 08/09/2024 at 18:19:03\nBenitez should be erased from the history of Everton FC.\nJames was a joy to watch.\n39 Posted 08/09/2024 at 18:21:16\nJames is without doubt the most world class player we've had in decades. That switch pass he could play with accuracy and precision without thinking about it. Instinctive. I wish I'd got to see him live.\nJames, Kanchelskis, and I could put my idol up there, maybe the big goalkeeper. I'm sure others from different generations will cite others.\n40 Posted 08/09/2024 at 18:46:39\n41 Posted 08/09/2024 at 18:46:51\nVan Dijk committed three yellow card offences in the first ten minutes, don't think he received one yellow.\nIn the eleventh minute he got injured in an unfortunate collision with Pickford… Karma!!\n42 Posted 08/09/2024 at 18:57:16\nI started watching Everton in 1968 (first game 7-1 v Leicester), a period when many older Evertonians say we played our best ever football. The whole point of watching football is to dream of seeing a player of the quality of Rodriguez.\nThe argument about his alleged wages is a total red herring, as mentioned by Christy, he helped make Richarlison and Calvert-Lewin better, more valuable players.\nAnd in any case, it still would have been less than the combined wages of Tosun, Klaassen, and Schneiderlin, players who contributed next to nothing during their time at Goodison.\n43 Posted 08/09/2024 at 19:07:31\nRob, I'd love someone to put a tackle in on him, similar to what Peter Reid did to Marwood after he clattered Adrian Heath and took him out of the game for almost a year.\n44 Posted 08/09/2024 at 19:13:08\nYou know nothing of football then to say he was our worst ever footballer.\n45 Posted 08/09/2024 at 19:22:27\nConsidering he's still our most expensive signing and the sad way his career here ended, he may have a point. And judging by the abuse he took both at Goodison and on here, Lakavos would have plenty of support if he had said he was the worst footballer we've had!\nLike numerous players, Sigurdsson was frequently whipping boy of the week.\n46 Posted 08/09/2024 at 19:28:45\n\"Be careful what you wish for\" used to be a common phrase and this has lead Everton to end up sleeping with the fishes almost as long as Luca Brasi.\n47 Posted 08/09/2024 at 22:56:23\nHe was not our worst-ever signing.\n48 Posted 08/09/2024 at 23:40:28\n49 Posted 09/09/2024 at 05:55:42\nI watched the interview with James last night on the club website. I would recommend it. He speaks in Spanish, but there are subtitles and some footage of his goals.\nOh to have had him for another couple of seasons, which he said he wanted. I guess finances dictated otherwise.\n50 Posted 09/09/2024 at 06:32:28\nHe was a decent player, had the odd blinding game once in a while, but overall he made our entire team incredibly slow.\nWhatever it was, Koeman's 'producktivity' mantra or just the simple fact every other player was incapable, but everything it seemed had to come through this guy, at a snails pace.\nIt set the rot for everything we currently suffer under Dyche.\n51 Posted 09/09/2024 at 09:28:43\nRarely (in fact virtually never) did we buy a half-decent player in their prime. However, after four decades of sheer bilge served up as Windsor soup, we finally looked to have a manager who could take us places in Ancelotti. Of course it was prewritten in the stars that he would move as soon as we looked remotely successful.\nJames was a great player, pulling us up to levels many supporters had never seen. Sadly due to injury it was only in glimpses. That dream died, as did I, the day the dreadful fat waiter waddled in. Physically and emotionally sick, I can not and will not ever forgive Moshiri nor the dead one for that abomination.\nDisgusted further at the way the smug twat discarded James from \"his plans\" from the off, underlined my fear that we were about to go fully backwards and totally inferior, akin to the bulbous balloons carer.\nWhat could have been, never was and we have never looked likely since. Clueless attrition is our only way forward at the moment and will be for some years to come.\nOh those heady days of James. Yes, I remember them well.\n52 Posted 09/09/2024 at 10:39:32\nBut it doesn't matter, Benitez disposed of him. Since then, he has been spiraling downwards, until he decided he still wanted to play and the Copa America came along. Watching this, it was farcical to think of him as finished, he controlled games.\nJames was and still is someone who needs a desire to bring out the best of him… get him motivated and you still have a class, if not world class player.\nFor too brief a moment, we rode his and Ancelotti's coat tails. Remembering what football was about, laughing, crying, joy at watching Everton. Remember that?\nYes people point to his failings, multiple, people condemn him for his lack of effort (I assume this means not running constantly between boxes and tackling everything in between) without realizing that wasn't why he came.\nIt wasn't and still remains, not good enough for some, but for me it was a joy to watch, to see Everton on top of the pile where we belong… Then along came Benitez, along came Ukraine, and finally, along came Dyche.\nHow this club fucked up will be told for generations and students will analyze the two protagonists in debating the mismanagement of our club.\nBut right now, there is work to be done in rebuilding the dream. Finding James was a painful reminder of who we once were and why so many are angry.\n53 Posted 09/09/2024 at 16:30:12\nRay Roche 45 seems to understand. I won't try to persuade you that Sigurdsson was bad business. For the money we paid and what we got Lukaku, Richarlison, Barry, for example were good business and Baines, Lescott, Jagielka, Coleman, Distin and many others were brilliant business.\nI don't say Sigurdsson was bad footballer, he was at the time a £20-25M player, we paid more than double for him and he offered what a £10-15M player would offer...\nIf he cost us £15M, I would say he was fine business but, for £55M, he was one of the worst signings we ever made. Anyway, I may know nothing of football but I know how to count...\n54 Posted 09/09/2024 at 23:38:56\n55 Posted 12/09/2024 at 03:42:01\nHave a look at this analysis and perhaps more of us will understand that, to get the best out of James, you have to allow him to do what he does best and set up accordingly.\n56 Posted 14/09/2024 at 13:14:35\nLegs had gone and a total liability for 88 minutes of a game. He would never have got near a Top 6 club at that stage of his career and was not what we needed at the time.\nIf you took snippets on YouTube, he would look great but, in reality, we were playing with 10 men. A fit James would have been amazing.\n57 Posted 19/09/2024 at 04:19:33\nYou are correct in your summation that James has seen his better days. No one, including me, argues that. That he would not make a Top 6 team in the Premier League is probably correct too… but we are nowhere near a Top 6 side and haven't been for a long, long while.\nTotal liability? Did you watch Columbia in the Copa America or beating Argentina? Did you see what James was capable of – even now? The difference of course is that Columbia use its team to cover for his deficiencies and play to his strengths.\nAlas with Everton (not just Everton), we are not in the business of covering individual talent, everyone has to be at peak fitness to run for 100 minutes up and down the pitch, no carrying or allowing for talent. Not what we needed (or need?) honestly you could not be more wrong.\nQuality to open defences, create chances, score goals.. are you really saying he cannot do that at Premier League level? He does have a problem I would say with motivation or with coaches who just want workrate. It's like asking Picasso to paint your fence. What? He's a painter isn't he?\nWe deperately need quality in all departments, probably why the club are still hoping Dele can make it back. Anything resembling class has been sold. Workrate and hit and hope the mantra…\nSo, god forbid having 10 men who don't know what they are doing… I cry out for one man that does.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 5407,
  "scraped_at": "2026-02-14T02:01:51.739396",
  "_text_extracted": true
}