{
  "article_id": "da66b0567183",
  "url": "https://www.egyptindependent.com/al-ahly-coach-hails-teams-performance-after-defeating-zamalek-4-1/",
  "title": "Al - Ahly coach hails team performance after defeating Zamalek 4 - 1",
  "date": "20230714T104500Z",
  "domain": "egyptindependent.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Al-Ahly football team Swiss coach Marcel Koller praised his team’s performance following its victory over its rival Zamalek, 4-1, on Thursday evening, in a postponed match from the 31st week of the Egyptian Football League.\n“We made a great run, and scored three goals. But I knew that the second half would not be easy because it was difficult to maintain focus after advancing the result. I asked the players between the two halves not to slacken, and I tried to renew their motivation,” Koller said during a press conference that followed the match.\n“I expected Zamalek to feel insulted, as it is a great team. It entered the second half with the aim of compensation and had two chances besides a ball on the crossbar. We had a miraculous save from al-Shennawi (Al-Ahly goalkeeper), and we scored the fourth goal and achieved a well-deserved result,” he added.\n“Renewing motivation is difficult after winning the CAF Champions League title and then competing in the league…Victory (against Zamalek) 4-1 is a great result and will be recorded in history,” Koller continued.\nAl-Ahly’s victory over Zamalek was only a moral victory, given that Al-Ahly had already secured the Egyptian League title in the last round.\nAl-Ahly tops the Egyptian Premier League 2023 ranking table, with 75 points and without any defeats.\nIt also won the last two editions of the Egyptian Premier League, while Zamalek won the previous two editions.\nZamalek is currently in third place with 59 points, as it will not participate in the CAF Champions League’s upcoming season for the first time since 2017/2018 season, in which Zamalek came in fourth place.",
  "word_count": 273,
  "scraped_at": "2026-02-14T02:24:50.288429",
  "_text_extracted": true
}