{
  "article_id": "da83af6a6484",
  "url": "https://metro.co.uk/2024/12/14/one-club-backed-dominate-premier-league-for-next-10-years-22188168/",
  "title": "One club backed to  dominate  the Premier League  for the next 10 years  ",
  "date": "20241214T114500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "One club has been backed to ‘dominate’ the Premier League ‘for the next 10 years’.\nManchester City have been the dominant force in English football in recent years, lifting four successive league titles under legendary manager Pep Guardiola.\nBut City’s stranglehold over the Premier League appears to be coming to an end with the Etihad club currently only fourth in the table, eight points behind leaders Liverpool.\nManchester City’s struggles have also strayed into their Champions League campaign, Guardiola’s side picking up just one point from their last three games to slip to 22nd in the table.\nCity’s shocking form has opened the door to the likes of Liverpool, Arsenal and Chelsea as they look to dethrone the champions, both this season and going forwards.\nLiverpool look well-placed to challenge not only this term but over the next few seasons under Arne Slot, who has enjoyed a sensational start to his reign at Anfield since replacing Jurgen Klopp.\nArsenal have consistently challenged Manchester City recently and show no real signs of falling away with a young and dynamic squad.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nChelsea have been the surprise package this season, emerging as genuine title challengers under new boss Enzo Maresca despite being tipped to struggle before the campaign began.\nThe Blues have hoovered up talent from across the world under owner Todd Boehly, allowing them to have effectively two different squads for their domestic and European commitments.\nChelsea’s transfer strategy has been widely criticised but is beginning to bear fruit and could turn the west London club into the ‘dominant’ team in the Premier League over the next decade, according to Gael Clichy.\nAsked what could prevent Chelsea from maintaining their surprise title push, former Premier League winner Clichy said on BBC Radio 5 Live: ‘I think the lack of experience because they have so many young players.\n‘But are they title contenders? I think with the money they’ve spent, the squad and the manager they have, people start to realise that if the manager of today is the right one, they could go on and be really dominant for the next 10 years, with the players they have.\n‘I really feel that. But what can stop them is also the fact they are really young. There is a new coach and attitude there and they are excited.\nMore Trending\n‘Everything is easy because no one expected them to be there, that makes it easier. Now the questions will come and it becomes a bit harder.\n‘Looking at the money they’ve spent, they have to win the Premier League [at some stage], anything other would be a failure. It’s only the lack of experience that can stop them from having an amazing season.’\nPremier League leaders Liverpool face Fulham at Anfield on Saturday while second-placed Chelsea take on west London rivals Brentford and third-placed Arsenal play host to Everton.\nDefending champions Manchester City will be desperate to produce a better performance and result on Sunday when they face local rivals Manchester United.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: ‘I’m now a Chelsea star – but I wanted to join another Premier League club’\nMORE: Emmanuel Petit names three players who could stop Cole Palmer winning Ballon d’Or\nMORE: ‘I’m a former Man Utd coach – some players didn’t want to change their playing style’",
  "word_count": 621,
  "scraped_at": "2026-02-14T01:58:00.749740",
  "_text_extracted": true
}