{
  "article_id": "da87d8e13c28",
  "url": "https://www.myjoyonline.com/world-cup-2026-can-kwasi-sibo-step-up-for-the-black-stars-tonight/",
  "title": "World Cup 2026 : Can Kwasi Sibo step up for the Black Stars tonight ? ",
  "date": "20250908T170000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nIbrahim Sulemana - unavailable due to injury.\nElisha Owusu - unavailable due to suspension.\nThomas Partey - Doubt.\nIn comes Kwasi Sibo.\nWhen a team loses a player the size of Thomas Partey; not only for his tackles but for the temperate authority he brings to a midfield, the search for a replacement isn’t merely about numbers on a sheet.\nIt gets worse when his replacements cannot be counted to step up in his absence. One thing that makes players of his ilk special is their about temperament, timing, and the courage to do the unglamorous work that wins big matches. Kwasi Sibo’s arrival on the Black Stars radar comes at such a juncture: a man forged in the churning leagues of Spain’s lower tiers, now asked to answer a call that was never guaranteed.\nThis young man's path is the textbook of the modern African migrant midfielder: early years at Cheetah FC, a move to Armenia (Banants/Urartu), a Watford contract that led to loans across Albania and Spain, then seasons with Ibiza, Betis B and SD Amorebieta before Real Oviedo made him part of a promotion push.\nOviedo’s official note when signing him emphasised continuity: Sibo played 41 matches and more than 3,000 minutes in the campaign that preceded his arrival, the sign of a player coaches trust to carry a team through a season.\nStatistically and stylistically, Sibo is built for the role Otto Addo might ask him to perform: Data aggregators show Sibo ranks high in aerial duels and defensive contributions for his peer group -- traits that allow a midfield pivot to win second balls and dominate the middle third. That physicality matters against Mali, a side that likes to contest midfield battles.\nAcross his promotion campaign with Oviedo he logged heavy minutes, including extra-time exertions in playoff ties — an indicator of fitness and game-management that national teams prize.\nThose who are familiar with his game say his composure in possession and tactical reading are rare. Spanish media coverage of Sibo’s season notes how he has become comfortable as a pivot, shielding defenders and recycling possession under pressure — the very functions Partey often performs for Ghana. Sibo himself described the season as “the most important of my career,” underlining his readiness to be trusted in a central role.\nPut simply: he tackles, times interceptions, wins headers and can make the simple pass that restarts the next phase. Those baseline skills are exactly what a manager asks of a stopgap defensive midfielder.\nYet the answer cannot be sentimental. Partey’s elite résumé — Champions League experience, Arsenal years and national-team leadership — is more than a list of honours. It is the composite of elite passing range, the ability to burst into box-to-box moments, and a psychological presence that bends opponents’ approaches. Sulemana has stepped up a couple of times, Elisha has been here since March 2022.\nSibo does not (yet) have that top-tier pedigree: his minutes in top-flight football are limited; much of his seasoning was earned in Segunda and the Primera Federación. The jump to a dominant international pivot role against a well-drilled Mali unit would be steep.\nWhile tidy and effective, Sibo’s long-range progressive passing is not yet demonstrably at the level of a Partey — a factor if Ghana need direct vertical switches or sudden transitions. Statistical profiles place him as more of a recuperator and short-range recycler than an incisive long-ball initiator.\nThis is an international seasoning: a late call-up rather than a settled national-team role. Experience in the Black Stars’ tactical system, and trust with teammates, are intangible assets that can only be earned by minutes — something Sibo will have to accumulate quickly.\nIf Sibo is to cover Partey’s absence, coaching and context will matter as much as individual quality: Ask Sibo to protect the backline first; let other midfielders (or wingbacks) carry progressive passes.\nSalis is not a passer, hence a midfield partner who can step into the line and make longer passes will offset Sibo’s relative conservatism. Well, often times, Otto has played two players who are not passers and may not need to ask for too much from this newbie.\nIf he does that, it means a compact defensive shape, shorten distances between lines so Sibo can intercept and recycle without needing to cover excessive ground alone.\nThese tactical adjustments turn a stopgap into a stabiliser — not by pretending he is Partey, but by using Sibo’s best characteristics to steady the ship.\nKwasi Sibo brings many of the ingredients required: stamina, physicality, a proven record of heavy minutes in promotion-winning football, and a growing reputation as a disciplined pivot at Real Oviedo.\nThose elements mean he can cover Partey’s basic defensive duties, help Ghana regain order in midfield and give the team a platform to build from.\nHowever, he cannot instantly replicate Partey’s leadership, elite passing range or the match-shaping moments that come from years at the very top. To succeed, Sibo must be asked to do what he does best — win the ball, protect the back four, and keep Ghana compact — while teammates and tactics make up for the lost elite distribution.\nIf he is given that role, and if he answers the call with the same relentless industry that delivered Oviedo its promotion, he can be more than a stopgap: he can be the quiet, necessary anchor in a moment that demands rise-and-deliver leadership.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n13 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n38 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n40 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 1130,
  "scraped_at": "2026-02-14T01:55:21.393056",
  "_text_extracted": true
}