{
  "article_id": "daa3d3c4f90d",
  "url": "https://www.stratford-herald.com/news/match-of-the-day-9413987/",
  "title": "INTERVIEW : Nick Blood and Freema Agyeman on putting the fizz into Benedick and Beatrice in the RSC brilliant footie - themed Much Ado About Nothing",
  "date": "20250423T013000Z",
  "domain": "stratford-herald.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "INTERVIEW: Nick Blood and Freema Agyeman on putting the fizz into Benedick and Beatrice in the RSC’s brilliant footie-themed Much Ado About Nothing\nAs Nick Blood and Freema Agyeman prepare to put one in the back of the net as Benedick and Beatrice in Much Ado About Nothing at the RST, they take a half-time break to tell Gill Sutherland about themselves and the football-themed production.\nWas there a moment when acting dawned on you – was it a childhood dream?\nFreema: I think I was probably about 17. I picked drama as one of my GCSEs.\nThe drama teacher Mrs Booker asked me to be in Antigone – it felt like a lot of commitment, but I enjoyed drama so I said, all right, let me do it. I played that lead role and after I got off stage I changed all my A-level options from sciences to arts.If Mrs Booker hadn’t encouraged me, I think I’d probably be a marine biologist.\nNick: When I was seven, I went to a local drama club. Me and my mate wanted to go, because my older brother went and you got to stay up late. We eventually persuaded our mums to let us go.\nWe had this brilliant drama teacher who gave us a script. I remember that there was like five different characters in it set on a spaceship. And me and my mate, in our little seven-year-old brains, went, ‘oh, each character needs to be distinctive’ as there’s only two of us.So, one was a tennis player, one was a doctor... It just made no sense. And immediately when we got on stage, people were laughing, but at us, not with us. But even that, I was like, ‘oh, this attention feels amazing’. But I just immediately went, ‘this is what I want to do for the rest of my life’.\nWhat were your big acting breaks – and how did you feel?\nFreema: My big break was probably getting my first telly. I feel like that kind of changed the trajectory. I wasn’t able to live off of my craft until a few jobs in, but that was what set me on a way to being able to call myself a full-time actor.I did performing arts at uni. I didn’t know anything about the industry. I felt like I was a hundred paces behind. So, I just spent a lot of time watching and listening and, and then, when I finished, I went and worked in blockbuster video and a gym and was just like, ‘I need to think about it’, I was uncertain.One day I was in the video shop and one of the guys from the course came in and invited me to join a co-op [where actors act as agents for their own group]. It was brilliant just to be in the office one or two days a week learning about casting. You have to cold call casting agents. This one from Carlton TV was so kind – and said, ‘who have you got for us?’ I went in for Crossroads and I booked that.When that finished, I was able to get my commercial agent from that. And then from that Doctor Who was obviously the game changer [playing Martha Jones 2007-10 alongside David Tennant’s Doctor].It transformed my life overnight, but I think if I hadn’t done Crossroads, The Bill, Casualty and all the rest of it, I wouldn’t have got there perhaps.\nAnd Nick, can you pinpoint a moment that was a turning point?\nNick: No, I don’t think I’ve had a job that’s all-of-a-sudden changed everything. It’s been a sort of progression, sometimes it’s regression. It’s funny how it can sometimes seem from the outside that there’s a big break when all-of-a-sudden a different group of people have noticed you. But really it’s kind of been stepping stones. I don’t feel there’s been that moment of, ‘oh, I’ve arrived’ or, ‘that has changed everything’.\nWhat about ‘pinch me’ moments where you’ve found yourself with amazing people or in mad situations?\nFreema: For me it was getting the call for Doctor Who because I didn’t know what I was auditioning for, it was all under code names. I thought I was auditioning for the spin-off for Torchwood.\nThen they said, ‘oh, we don’t have any script for Torchwood, so will you read from this Doctor Who episode?’ I remember the audition went well, then there was another one. Then I had to do a ‘chemistry test’ with David [Tennant] in a hotel room in Cardiff. He was so kind and I thought it went well.Anyway, I was working as an usher in the theatre at the time, and I was driving to work when I got a call from my agent. She said, ‘it’s not gone your way this time’. I was convinced that it had gone well so I was nearly crying saying can you call them… But she was like, ‘that won’t be necessary, you got it!’ It was mad.\nNick: That’s so cruel!\nFreema: The first day on set was a game changer.How was it being suddenly recognised everywhere?\nFreema: We got invited to party after party. and I was going to David, ‘oh my god, I can’t believe I’m getting all these gowns and frocks’,. I was 26, the drink would be flowing and you don’t know who you’re talking to, tabloid journalists… David gave me some good advice – he said, ‘remember these things are work’. I had the support of the BBC and my family, and the media training was incredible.\nPeople do want to come up, and they want to talk to you; you are suddenly more public-facing, and it’s not about changing who you are, it’s just about also knowing your audience. If someone says, ‘can I have a picture’ or whatever it is, it’s about, ‘well, can I do an autograph instead?’ Or, ‘sorry I’m just rushing off somewhere’. It’s about being true to yourself, and not feeling like you have to completely turn your whole self inside-out to fit into this new life you have. But it’s also just having an understanding of what the expectations might be, and I just felt like I had help at every step of the way to do that, and I feel very grateful.\nNick, can you follow that with your pinch-me moment?\nGoing to see Liverpool win the Champions League final in Madrid, and being at the players’ party, and dancing with the Liverpool players at 6am in the morning - but that was nothing to do with acting! Getting a hug off Jürgen Klopp the moment he walked in the room at 2am. But beside that, I’d shot a show called Babylon, with Danny Boyle, who’s incredible, and Jesse Armstrong, who wrote Succession along with Sam Bain – both brilliant writers. Then I wrapped on that and immediately got a job in the US. I went to bed after the wrap, got up at 5am for an 11-hour flight to LA – went from the airport straight to the set to shoot Agents Of S.H.I.E.L.D., this new show that I’d been cast in. I remember saying to the costume person, ‘is there somewhere I can get a shower to get ready?’ And they were like, ‘no, we kind of need you on set’. So suddenly I’m in costume in the blazing hot LA sun, upside down in an SUV with Xena the warrior princess, going, ‘where am I? What has happened here?’ That was definitely a moment where your everything flips and you go, ‘this life is mental!’\nAnd of course now you’re both pinching yourself coming to the RSC!\nNick: We were talking earlier about our journeys into acting, and our families, and where we’ve come from, and the expectation.\nI remember when I wanted to go to drama school, my parents went, ‘right, we’re going to take you to see a play’, and we came up to the RSC. So, for my mum and my late father being on stage at the RSC, as my mum said to me the other day, it’s unbelievable - a pinch-me moment. It’s a very special thing. My uncle’s coming over from Australia to see it!\nWhat show did you see here back then?\nI remember the absurd bow that the lead actor did. I’m not saying who.\nFreema: We need to know how absurd!\n[Nick mimes big-headed actor running on stage, towel around neck, overly pleased with himself and elaborately bowing, to much hilarity from Freema.]\nAnd Freema, you of course were here as a brilliant Olivia in Twelfth Night and have just won a What’s On Stage Award for playing the Nurse in Romeo And Juliet - and you’re back for a third helping of Shakespeare - tell us about that.\nI’d worked with Jamie Lloyd seven or so years ago, I wasn’t into Shakespeare but when I heard he was doing Romeo And Juliet, I was like, ‘I’d love to have a crack at the Nurse’.\nI knew he would be collaborative and open to bringing so much more of the performer into the part so I had a brilliant time exploring that. And then I came up here to see David Tennant and his missus, Georgia. And I stayed in Stratford to go and see them. I came back here for a night by myself, went to Shakespeare’s birthplace and wandered about. And I ended up outside the RST, and Pericles was on. I was looking at the poster with Alfred Enoch and I was like, ‘I want to have a go’.I just thought, ‘maybe one day’. And then I called my agent and said, ‘is there a world where we could have a conversation with them?’ I felt like I’d started scratching the itch and I hadn’t satisfied it enough yet, and I was like, ‘I want to do more’. And then the same with Twelfth Night. I got such an education in that.And I could feel the muscle growing. And then it was over, and I was like, ‘I just need a bit more’. I feel so fortunate that I’ve been able to do three back-to-back, because I’m developing and amassing new tools.\nI’m grateful to Tamara and Daniel and Mike, our director as well, and Anna, the casting director, for having that faith and imagination..\nHow familiar were you with Much Ado, with the characters? Was it something you thought, ‘oh, yeah, that’s for me’?\nNick: I saw Joe Milson – who’s a mutual friend of Freema’s and mine – play Benedick here and in the West End. He’s brilliant, it’s like it was written for him.\nFreema: I’m not always sure that’s a good thing, though, is it, with Benedick? Nick: My wife did say this is made for you, and I was like, what are you trying to say? But no, I just had loads and loads of fun with it. This role is a gift for an actor, including his and Beatrice’s relationship. It’s got so much depth to it.\nIt really stands out, I think, in Shakespeare’s work as a relationship that hits on something really truthful that isn’t about poetry or that Romeo And Juliet kind of naive love that I think Claudio and Hero have in the play.It feels like something deeper - ‘Thou and I are too wise to woo peaceably’ [says Benedick] - they challenge each other and they hold each other to account. Beatrice gives him the opportunity to grow and to change and to mature.\nIt’s a thrill to do it. The other thing I love about it is that the most important people are the audience - they kind of have their own role in it.\nFreema, you brought a freshness and feisty-ness to Olivia at the RST last Christmas - Beatrice must be a delicious prospect too?\nI feel very lucky, she’s just incredible. She just challenges all of those traditional gender norms: she’s opinionated, witty, and she asserts herself as an intellectual equal to men. She’s dynamite! There are also timeless qualities, but for the time she was defying the idea that women should be seen and not heard, and she’s unwilling to compromise her position, her freedoms, her independence and all of that.\nIt’s relevant for today, and I’m excited about all the young girls and women that will come and see it. Beatrice spoke to me for being, like, so timeless and so relevant.I also feel so lucky to be working with Nick because the relationship they have is so vulnerable that I think it helps if you have trust with the person that you’re doing it with, because there’s just so much to explore.\nThe whole cuckold theme is really interesting, isn’t it? This kind of idea that women are sluts, and liable to sleep with anyone, yet it is a rom-com.\nFreema: It throws up massive discussions on such universal themes that are timeless and relatable around the globe. Like Nick said, their relationship is in contrast to Hero and Claudio.\nNick: I think the richness of it means that different people take different things away from it. From my character perspective, there’s something about maturing and being vulnerable and choosing the right thing over social expectation.\nFreema: Some people will look at Beatrice and go, ‘you don’t compromise yourself for love, you stay true to yourself’. There are just so many different things to be taken away from it. There is a wealth to mine.\nDirector Michael Longhurst has given it a football theme, tell us about that and how it informs the play.\nNick: It’s such a brilliant concept because so often we kind of go, ‘oh, it’s all so relevant today’. And so Shakespeare’s plays will be given a gangster theme or set in a boardroom, but sometimes it feels like the concept is crowbarred in. Whereas with this, you just go, ‘oh my god, this is perfect’. You’ve got this ultra-male world that women are generally excluded from, which warps those men’s perspective. Sports hero worship results in quite a lot of bad behaviour and they get away with the way that they treat women, for example. Then you’ve got other people within it that are trying to fight against that. There’s countless stories you can find in the sports world of what people have been up to and then what happens. Look at the Wagatha Christie stuff.\nYou even the language of it: ‘we’re going to war’ - it’s a battle with soldiers, like how football is taught, and so it just fits really well. Soldiers coming back from war become footballers having won the European Cup. It contextualizes it, particularly for young people, which I’m really excited about.\nFreema: Whether people are football fans or not, they’re going to understand the world because it’s such a part of popular culture. You can’t not understand what that whole world and the relationship with the media is all about. And the manipulation of media, and what social media does - with gossip and misinformation.And then you’re going down the social media routes as well in line with all of that and going,’ nobody can escape that media mycelium that’s going on now through these devices’. It’s like so part of the infrastructure. Reputation being a massive thing in both worlds.\nSo Benedick is a star footballer?\nNick: Central midfielder – captain of the team. Kind of coming towards the end of his career. You know, legs are gone a bit.\nAnd Beatrice, she’s not just a WAG?\nShe’s a professional - working for a big media empire. She’s a reporter and doesn’t have a specific loyalty to Benedick’s team, Messina FC, which is why she can be so objective about their performances. Just taking the piss out of the footballers, bringing them down.Is there some fun being had with the WAG aesthetic? Freema: It’s quite Love Island-y. Nick: Definitely a bit of Love Island fun in there. And music’s quite a big part of it. I spent most of the first two weeks making up football chants. Literally not being able to sleep, going to bed and just doing chants on our group chat thread.\nOK, Beatrice and Benedick time - what do you like best about each other?\nFreema: Where do I start? He’s really funny. And I like to laugh, so immediately I was like, we’re going to work great. We’ve got the same birthday! 20th March.\nNick is incredibly intelligent and insightful and has a lot of common sense as well. And the way you see life, see the room, see the work on the page is just so impressive.I’m often inspired watching him work. You’ve got such a freedom with how you are as a person, with other people, with the rest of the company, but also in your work. The way you are is just so open and so warm, and I feel like I’ve found, I hope, a friend for life.\nNick: Aww. Me too, that’s lovely. We’ve got lots of mutual friends, and they were telling me how amazing she was, and I was going, ‘all right, yeah, she can’t be that great’. But we just clicked straight away.\nShe’s smart and utterly captivating. So, for me, she just makes my job so easy. If you have to be scared in something, chances are that the person you’re working with is probably not going to make you scared because you know them and you’re maybe on stage. But if they do, oh my god, it’s so much easier because you’re just responding to what they’re doing. And I just look at Freema and just go, ‘I don’t have to act this, I just have to receive what she’s putting my way’.\nI just love what – I cannot imagine doing it with anyone else. I think we collaborate brilliantly, we think along the same lines often, she makes me laugh a hell of a lot. Creatively, I think we’re really aligned.\nAnd just as a person, she’s got such a good sense of who she is, and her worth, and she’s got this strength to her, which is perfect for Beatrice, and is just a lovely, decent, good person who’s true to herself. And I know what I’m getting with her, and there’s no BS. And I feel like I’ve been encouraged, educated and inspired by her in many ways.\nFreema: I feel like I have to trump that now. I’ll go again! He did more than me!",
  "word_count": 3105,
  "scraped_at": "2026-02-14T02:11:32.303244",
  "_text_extracted": true
}