{
  "article_id": "dab3430f1068",
  "url": "https://punchng.com/reds-make-lookman-contact-as-salah-replacement/",
  "title": "Reds make Lookman contact as Salah replacement",
  "date": "20250227T043000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have made contact over the possibility of signing Super Eagles forward Ademola Lookman this summer as a potential replacement for Mohamed Salah, PUNCH Sports Extra reports.\nAccording to Sky Sports Switzerland, the Reds have made concrete steps towards signing the 27-year-old Atalanta star, who has been in sensational form this season with 17 goals and seven assists in 29 appearances across all competitions.\nArsenal are also said to have made inquiries about the reigning CAF Player of The Year, though they haven’t progressed their interest as far as Liverpool, who view Lookman as an ideal candidate to fill the void should Salah depart Anfield at the end of the season.\nLookman’s future at Atalanta has come under increased speculation in recent weeks following a public disagreement with manager Gian Piero Gasperini, who criticised the Nigerian after he missed a penalty in their Champions League defeat to Club Brugge.\nThe Italian club are reportedly open to selling their star player if they receive offers in the region of €65m (£53.8m), with several top European clubs monitoring the situation closely.\nLiverpool aren’t the only Premier League side interested in Lookman, with Newcastle United and Manchester United also in the race for his signature. According to TEAMtalk, the Magpies have already dispatched scouts to watch the forward in action, with his versatility to play both as a winger and central striker appealing to the St. James’ Park outfit.\nSince joining Atalanta from RB Leipzig in 2022, the former Everton player has established himself as one of Serie A’s most dangerous attackers, amassing an impressive 49 goals and 23 assists in 107 competitive matches for La Dea.\nLookman’s stock rose dramatically last season when he scored a historic hat-trick in Atalanta’s Europa League final victory over Bayer Leverkusen, before going on to lead Nigeria to the Africa Cup of Nations final and subsequently being crowned Africa’s best player in 2024.\nThe London-born forward began his Premier League career with Everton in 2017 before spells at RB Leipzig and Fulham. His familiarity with English football could make him an attractive option for Liverpool as they prepare for life potentially without their Egyptian talisman.\nSalah’s future remains uncertain with his contract set to expire in 2025, and reports suggest the 32-year-old has yet to agree to new terms with the Anfield club. Saudi Arabian clubs continue to show interest in the prolific forward, who came close to a move to Al-Ittihad last summer.\nLiverpool’s new sporting director Richard Hughes and head coach Arne Slot are reportedly working on contingency plans, with Lookman emerging as a prime candidate due to his proven goal-scoring ability, versatility across the forward line, and experience in high-pressure situations.\nParis Saint-Germain, Juventus and Inter Milan are also said to be monitoring Lookman’s situation, with the French giants having previously shown interest in the Nigerian international last summer.",
  "word_count": 476,
  "scraped_at": "2026-02-14T01:52:15.326839",
  "_text_extracted": true
}