{
  "article_id": "dabadefffc54",
  "url": "https://www.arsenal.com/news/arteta-dinamo-zagreb-and-fabio-cannavaro",
  "title": "Arteta on Dinamo Zagreb and Fabio Cannavaro",
  "date": "20250121T194500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It will be exactly a month between competitive fixtures for Dinamo Zagreb when they visit Arsenal Stadium for Wednesday night’s Champions League clash.\nSince their last match in the Croatian Football League - a 3-2 win at home to NK Varazdin - Zagreb have won 3-1 away to Lech Poznan and drawn 1-1 at Jagiellonia Bialystok in friendlies, in what was the first opportunity for Fabio Cannavaro to run the rule over his squad after the Italian legend was appointed as their manager at the end of last year.\n“That’s the context of the game a little bit, obviously with a new coach and the fact that they haven’t played a competitive match for a month,” Mikel Arteta noted in his pre-match press conference at Sobha Realty Training Centre on Tuesday.\n“Obviously we know the friendly games that they’ve played and we watched them just to try to gather ideas, more principles and systems than formations because Fabio’s played different formations when he was in China to Italy and now as well. To actually understand what they’re going to do and know the idea behind it, we’ll adapt to that tomorrow.”\nOur manager was also asked about Dinamo Zagreb’s promotion of academy talents, with their production line continuing to develop stars, with midfielder Martin Baturina highly rated in the country having been the youngest member of Croatia's Euro 2024 squad and winning the nation's Young Player of the Year award last term.\n“Yes, incredible talents,” he said. “What they’ve done for many, many years, very consistently as well, the type of football that they always play in a very particular country with a very clear philosophy of how they want to play the game, it’s going to be a very difficult match.\n“I don’t like to talk about individuals but they do have a lot of talent. They have some individuals that catch your eye because you have in your head all of the players that play in that club and what they’ve done in the past, so it’s always a good league and a great club to follow.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 376,
  "scraped_at": "2026-02-14T02:26:28.929658",
  "_text_extracted": true
}