{
  "article_id": "dac0a0e208cf",
  "url": "https://www.bbc.co.uk/sport/football/68721502",
  "title": "Tottenham Hotspur chairman Daniel Levy says club in talks with  prospective investors  ",
  "date": "20240403T140000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur chairman Daniel Levy says club in talks with 'prospective investors'\n- Published\nTottenham are in talks with \"prospective investors\" after reporting losses of £86.8m in their 2022-23 accounts, says chairman Daniel Levy.\nTotal revenue increased by 24% from 2022 to a record-high £549.6m, with matchday income reaching a record £117.6m.\nBut they reported a loss for the fourth successive year following the 2022 deficit of £50.1m.\nLevy stressed the need to \"capitalise on our long-term potential\".\n\"To continue to invest in the teams and undertake future capital projects, the club requires a significant increase in its equity base,\" he said.\n\"The board and its advisors, Rothschild & Co, are in discussions with prospective investors. Any recommended investment proposal would require the support of the club's shareholders.\"\nUnder Premier League profit and sustainability (PSR) regulations, clubs can lose a maximum of £105m over a three-season period, or £35m per campaign, before facing sanctions.\nTottenham's losses over the last three years are beyond that threshold at £220.7m, but the annual depreciation charge of £72m, which refers to their stadium and other facilities, means they are not at risk of breaching PSR regulations.\nEverton and Nottingham Forest have already been punished with points deductions this campaign for breaking PSR rules, while Championship side Leicester were charged last month by the Premier League for allegedly breaking spending rules during their last three seasons in the top flight.\n\"The club remains fully compliant with the rules and is supportive of the enhancement of PSR to ensure the Premier League remains competitive and sustainable,\" Levy said.\n\"We have operated on a financially sustainable basis and can now optimise the true value of key assets, the unrivalled facilities at our multi-use stadium and our training campus.\n\"We expect commercial revenues to rise from third-party events, although this will not compensate for the lack of European football this season.\"\nAfter finishing fourth in 2021-22, Tottenham returned to the Champions League last season - reaching the last 16 - bringing in £56.2m in Uefa prize money, compared to £10.2m in the previous year's accounts when they suffered a group-stage exit from the Europa Conference League.\nThey finished eighth in the Premier League in 2022-23 and are not involved in European football this term.\nTottenham's accounts for 2022-23 showed operating expenses had risen by 21% from £403.4m to £487.9m, due to increased first-team costs and the hosting of multiple non-football events, such as NFL fixtures, boxing and music concerts.\nA \"significant and continued investment in the playing squad\" saw the wage bill rise by 20% to £251m. Levy also had a pay increase from £3.2m to £3.5m, while taking home a £3m bonus.\nIn March, Tottenham announced season ticket prices would increase by 6% for the 2024-25 season, with the most affordable adult season ticket costing £856, up from £807 this season. They are also removing the concession for new senior season ticket holders - those aged 65 and above - from 2025-26.\nThe Tottenham Hotspur Supporters' Trust said the decision was \"unacceptable\" and \"cannot be justified\".\nTottenham said the increase in season ticket prices is because they have only raised prices once in the past five years - by 1.5% - and there had been a \"significant increase in matchday costs\".\nThe accounts do not mention how much it cost to dismiss manager Antonio Conte, who was relieved of his duties at the club in March 2023, with Ange Postecoglou appointed his permanent successor on 6 June after interim spells from Cristian Stellini and Ryan Mason.\nSpurs also saw talisman Harry Kane sold to Bayern Munich for 100m euros (£86.4m) in August, but that deal fell outside of the financial window and will be included in the 2023-24 accounts.\nLikewise, the outlay for new additions Micky van de Ven and Brennan Johnson will feature in next year's accounts.\nOur coverage of Tottenham Hotspur is bigger and better than ever before - here's everything you need to know to make sure you never miss a moment",
  "word_count": 668,
  "scraped_at": "2026-02-14T02:10:47.908671",
  "_text_extracted": true
}