{
  "article_id": "dac990cf1b61",
  "url": "https://www.arsenal.com/news/odegaard-big-chance-progress-europe",
  "title": "Odegaard on big chance to progress in Europe",
  "date": "20250122T144500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Before every game at Emirates Stadium, Martin Odegaard lifts the lid on the mood in the camp via his captain’s notes published in the matchday programme.\nAhead of this evening's game against Dinamo Zagreb, the skipper discusses how the new format of the competition has affected things, why preparation is even more important because of it, and what it's like to play every three days:\nWe’ve had a lot of games lately, and it’s nice to mix it up and get back to European football tonight. We don’t need any reminding that the Champions League is the competition we all grew up dreaming about playing in. It’s the biggest stage, playing against the top teams, and especially at home it’s always special to line up for the anthem before the game.\nWe really want to go far in this competition, and after last year we are determined to go further. Tonight is a big chance to get closer to that next round. It’s difficult to know how many points you will need in this new league format, but what we can say is that if we can get three points tonight, that would be a really big step for us with just one game left before the knockouts.\nWe have worked hard in the league so far, so let’s make sure we finish it off well so we can get to the next round. The main goal is to go and win the tournament, and finishing as high as possible in the group could be crucial for that.\nAnother difference this season is we play eight different teams, rather than three teams twice as happened in the old group stage, so we might not know some of the teams as well. That’s why our preparation is so important. As a group we haven’t played Dinamo before, so our coaches and analysts have been working with us over the past couple of days to make sure we are completely ready, and how we can best hurt the opposition. They do a great job on that, so we know what we can expect tonight.\nWe have played a lot of football this month, but for me personally I love to be in that routine and rhythm of playing every three days. I feel better when I play a lot of games. It’s something I’m used to and I prefer it that way. Also looking round the team I see that everyone is ready to go. We have had a lot of injuries lately, but people are starting to come back now so we feel in great shape going into tonight’s game.\nBeing back here in front of our supporters also gives us a lift. We’ve got a great record at Emirates Stadium in the Champions League, especially this season, so let’s continue that tonight. Make it as loud as possible, it makes such a difference.\nRead the rest of Martin's notes, as well as a host of other fantastic content, by buying the Arsenal v Aston Villa programme either around the stadium or online.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 539,
  "scraped_at": "2026-02-14T02:11:27.601900",
  "_text_extracted": true
}