{
  "article_id": "dad24e141e02",
  "url": "https://www.caughtoffside.com/2025/04/27/report-tottenham-man-city-price-defender/",
  "title": "Man City told how much they need to pay to sign Pedro Porro",
  "date": "20250427T133000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur have set a £50 million price tag on right-back Pedro Porro amid growing interest from Manchester City, according to Football Insider.\nMan City are looking for a long term replacement of Kyle Walker and they are interested in a move for their former player Porro who is shining for Ange Postecoglou’s side this season.\nPorro, who previously signed with City in 2019 but never featured for their first team, has since developed into a key player at Tottenham.\nTottenham chairman Daniel Levy is open to selling Porro if the £50 million valuation is met, potentially paving the way for Djed Spence to assume the right-back position.\nTottenham’s valuation of Porro has fluctuated, with reports indicating a previous asking price of £80 million.\nHowever, the current £50 million price tag reflects a more affordable figure for interested clubs.\nNegotiations between the clubs are expected to be challenging, as per the report.\nDespite Man City’s need of a new right-back at the club, they could find it difficult to complete a move for Tottenham’s Spanish defender.\nMan City want to invest more money in the squad\nAfter failing to win the league and the Champions League this season, Pep Guardiola is determined to spend heavily in the summer transfer window to solve the issues facing his squad.\nReplacement will not only be needed for Walker but also for Kevin De Bruyne who has announced he is leaving the club at the end of the season.\nWhile Porro could arrive at Man City this summer if Guardiola’s side step up their interest, midfielder Jack Grealish could leave for a new adventure this summer with surprise Premier League club interested in signing him.\nThe future of James McAtee is also uncertain at the Etihad Stadium with the youngster looking for more playing time and that could trigger a move away from the Manchester club.\nMan City could launch a big-money move to sign Newcastle star",
  "word_count": 323,
  "scraped_at": "2026-02-14T01:58:31.698228",
  "_text_extracted": true
}