{
  "article_id": "dad9ac3ae189",
  "url": "https://www.smh.com.au/sport/soccer/swiss-system-madness-proves-uefa-s-champions-league-revamp-is-a-winner-20250130-p5l89u.html",
  "title": "  Swiss system  madness proves UEFA Champions League revamp is a winner",
  "date": "20250130T033000Z",
  "domain": "smh.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Analysis\n- Sport\n- Soccer\n- UEFA Champions League\nThis was published 1 year ago\n‘Swiss system’ madness proves UEFA’s Champions League revamp is a winner\nBy Vince Rugari\nWhen UEFA announced that the Champions League was expanding from 32 to 36 teams, and that the classic four-team group structure would be dismantled and replaced by something called a ‘Swiss system’ – a format first used at a chess tournament in 1895, completely untested in football – eyebrows were cynically cocked around Europe and across the world.\nBy killing off the group stage and replacing it with a “league stage”, was UEFA also killing their golden goose? Would these changes actually improve the Champions League, or was it just a way of getting more teams involved to generate more revenue and stave off the perennial threat of a breakaway Super League?\nDid anyone at UEFA realise how silly it is to say the words “Champions League league stage” out loud?\nAnd how on earth were fans supposed to track how their team was faring through a single 36-team ladder, when each side is only playing eight games?\nWhatever you thought then, only now can a full and proper judgement be delivered with the conclusion of the Champions League league stage (still very silly) on Thursday morning (AEDT).\nThere were 18 games across Europe, all played simultaneously, to decide who finished where – something UEFA hopes will become a new tradition in football, and an idea Waleed Aly reckons the AFL and NRL should steal immediately.\nSky Sports Italia called it ‘Una Champions Mai Vista’, which roughly translates as the Champions League like you’ve never seen it before – and that was about right. Nobody quite knew where they stood until it was over.\nIt was madness in the best possible way, and probably vindication for UEFA’s decision to pivot to the new format – although there was one thing that would have left a nasty taste in their mouths.\nThe top eight\nLiverpool, Barcelona, Arsenal, Inter Milan, Atlético Madrid, Bayer Leverkusen, Lille, Aston Villa\nThis is where you want to be. These eight teams will progress directly to the round of 16 as seeded teams – and, just as importantly, won’t have to play any other European fixtures until then, giving their overworked players an opportunity to rest, which is a huge boost given just how crammed the football calendar is these days.\nNo surprises that Premier League leaders Liverpool finished clear on top, which meant that their 3-2 defeat to PSV Eindhoven on Thursday was effectively a dead rubber for them; they and Barcelona were the only teams who could afford to lose their final fixtures, a luxury they’d earned through previous results.\nMaybe the biggest surprise of the top eight was Lille, who surged from 12th to seventh with a 6-1 thumping of Feyenoord to round off an excellent league stage, having previously beaten Real Madrid and Atlético Madrid while holding Juventus to a draw.\nAston Villa also just made the cut after a 4-2 win at home against Celtic, having let a two-goal lead slip in the first half against the Scottish champions – although the match was somewhat sullied by the behaviour of Celtic’s travelling fans, whose anti-British leanings are well known.\nPrince William, a huge Villa fan (and chairman of the Football Assocation) was at Villa Park, and was subjected to chants of “Lizzie’s in a box” and “If you hate the Royal family, clap your hands” from the away section. They also held a banner glorifying Michael Fagan, an intruder who found his way into Queen Elizabeth II’s Buckingham Palace bedroom days after Prince William was born.\nA green flare was let off after a Celtic goal, too, which guarantees the club will be punished by UEFA.\nThe middle 16\nAtalanta, Borussia Dortmund, Real Madrid, Bayern Munich, Milan, PSV Eindhoven, Paris Saint-Germain, Benfica, Monaco, Brest, Feyenoord, Juventus, Celtic, Manchester City, Sporting Lisbon, Club Brugge\nThese teams are still alive, but will have to enter a two-legged play-off to guarantee their spot in the round of 16, with a draw to be conducted on Friday to determine who each team will face. That’s something they’d rather not have to do, but such is the ‘punishment’ this format now delivers to the sides who are good but not quite good enough.\nAs such, not even wins for Bayern Munich (3-1 against Slovan Bratislava), Real Madrid (3-0 against Brest), or Manchester City (3-1 against Club Brugge) were enough for them to reach the top eight because of slip-ups earlier in the league phase.\nMilan could have made the leap into that top bracket, but they were upset 2-1 away to Dinamo Zagreb after being reduced to 10 men for the majority of the match – but while the Italians live to fight another day, the Croatians missed out on progression by goal difference, finishing -3 behind Club Brugge, who came 24th. Brutal.\nThe bottom 12\nDinamo Zagreb, VfB Stuttgart, Shakhtar Donetsk, Bologna, Red Star Belgrade, Sturm Graz, Sparta Prague, RB Leipzig, Girona, Red Bull Salzburg, Slovan Bratislava, Young Boys\nUnfortunately, it’s over for this lot. Unlike in the past, when teams who placed third in Champions League groups would ‘drop down’ into the second-tier Europa League’s knockout stage, the continental journey now ends for those teams who finish 25th or lower – which is good news, say, if you’re a Tottenham Hotspur fan, and you don’t want any dangerous ‘floaters’ to suddenly come between Ange Postecoglou and silverware. (By the way, the Europa League and third-tier Conference League both now operate under the ‘Swiss system’, too.)\nThere are no great shocks amongst the casualties here, or any fallen giants who totally screwed up their campaigns. Five of them already knew their cards were marked before the final day.\nSpanish outfit Girona were one of them. Part-owned by the City Football Group, they finished third in La Liga last season to qualify for the Champions League for the first time; they’re probably the biggest disappointment, having suffered six of their seven defeats by one-goal margins, including their 2-1 loss to Arsenal.\nWatch every game of the UEFA Champions League exclusive and ad-free, live and on demand on Stan Sport.",
  "word_count": 1042,
  "scraped_at": "2026-02-14T02:11:27.596239",
  "_text_extracted": true
}