{
  "article_id": "db2483f24d4e",
  "url": "https://theathletic.com/5424367/2024/04/18/manchester-city-real-madrid-champions-league-2/",
  "title": "Real Madrid remind the world that not even Manchester City are perfect",
  "date": "20240418T074500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After the local journalists had finished asking their questions to Manchester City’s Bernardo Silva on Tuesday, the day before their Champions League clash with Real Madrid, it was the turn of those who had flown in from Spain.\n“The English guys here are asking about the treble, but how does it feel to play against Real Madrid?” the first question in Spanish enquired.\nAdvertisement\nIt was a good point because everybody on these shores had forgotten what it is like for City to lose, so much so that the ‘double treble’ was already making headlines.\nGiven it has been nearly two years since City last had any real heartache to deal with, that is somewhat understandable. Ever since Madrid struck back with quickfire goals after City had dominated home and away for 180 minutes in May 2022, a result that stunned world football, Pep Guardiola’s side have barely had a meaningful setback.\nThe players will have felt the losses and the draws, but to the rest of us, the odd Carabao Cup elimination or Community Shield defeat only seemed to serve as minor setbacks in the Hollywood story, the kind that are necessary to set up the dramatic finale. They dusted themselves down from that huge shock in Madrid to win the Premier League title on the final day. Last year, they won the title again, the Champions League for the first time — having got revenge on Madrid by schooling them 4-0 in Manchester — and beat Manchester United in the FA Cup final. A treble fit for a Netflix documentary.\nAnd after Arsenal and Liverpool lost track in the Premier League title race on Sunday, the collective footballing mind clicked forward a few steps too far, declaring the double-treble not just likely, but perhaps even inevitable.\nAttention had turned not to beating Madrid on Wednesday, but beating whoever it may be — it didn’t matter who — in the final at Wembley in six weeks. And everybody else in between, of course.\nIt is a sign of City’s sheer awesomeness under Guardiola over the years that they are simply expected to win not just every game now, but every trophy. They are one of the best club sides of all time, after all, but whether the motivation is awe at their brilliance or suspicion of their revenues, it is too often forgotten that, you know, a football team can exit the Champions League. Especially against Real Madrid.\nAdvertisement\nThose in Spain have the perspective of knowing exactly what Real Madrid are all about, or at least are removed enough from the Premier League discourse to know that teams might lose.\nAnd so what to read into this rare City heartache? Last time they were numb like this, after those Rodrygo goals at the Santiago Bernabeu, it was said that City lacked character. In fact, it was said that Guardiola’s teams have always lacked character. It was a massive shock and the reactions had to be equally sized, no matter how well City had actually played.\nThis time, City again reminded us that they are fallible only after showing us how good they are: they had 88 touches in the Madrid box – the most in a Champions League match since records began 15 years ago. They racked up 104 against Luton Town on Saturday – the most in Premier League history. They are firing exactly when they need to.\nCity’s 33 shots were also the most in a knockout stage game since 2020. We can pick over Erling Haaland’s contributions over the two legs, Kevin De Bruyne’s off-key performance in Manchester (despite his goal), and the poor penalty from Bernardo in particular, but the reality is that, like two years ago, City came up short when they did not deserve to.\nAs the Madrid players celebrated Antonio Rudiger’s winning penalty, the feeling for the majority inside the Etihad Stadium seemed to be one of pained acceptance. There was no anger at poor performances, none of the horror that came with dramatic elimination against Spurs in 2019, just the confusing blend of emotions you get when you don’t get what you deserve.\nThe City fans applauded their team off the pitch.\n“To win against Real Madrid, you have to perform at your best and we were at our best,” Guardiola reflected afterwards. “But it was not enough.”\nHe answered several questions in English and then in Spanish and yet the answers were all the same.\nAdvertisement\n“We did everything,” he said. “I don’t have absolutely any regrets about what we have done, we always try as managers to create more and concede less because we believe that helps to win, and we did everything.\n“We created the chances to do it, but football is about scoring goals and Madrid did it better from the penalty spot. But I have the opportunity to say thank you from the bottom of my heart to these players. The performance, the commitment was exceptional.”\n- Champions League fixtures and results\n- After three winless matches in a week, Arsenal’s season is at risk of fizzling out\n- Real Madrid’s win — a study of survival and celebration\nWhen you are expected to win every game, anything short will no doubt be seen, at least by some, as a failure, but the upside is that this time, there is no reason for huge statements about their bottle or their quality because they showed, yet again, that they are at the very top level.\nIt was not enough on the night, but maybe it will be for the rest of their matches this season.\nThe big question, then, is how this affects their push for ‘just’ a double.\nRunning their legs off for an extra 30 minutes is probably not ideal preparation for an FA Cup semi-final against Chelsea, a team who have shown their best against City this season.\nSome extra breathing space after that, though, will allow them to focus on trips to Brighton & Hove Albion and Nottingham Forest that could edge them closer to a fourth Premier League title in a row. Facing those games, and Wolverhampton Wanderers and Fulham after, without having to worry about Bayern Munich in the Champions League semi-final will be, in some ways, welcome.\nBernardo did have a word of warning on Tuesday amid the treble talk. “In one week, our season could be over,” he cautioned. Not that anybody believed him.\n(Top photo: Paul Ellis/AFP via Getty Images)",
  "word_count": 1083,
  "scraped_at": "2026-02-14T02:07:51.327928",
  "_text_extracted": true
}