{
  "article_id": "db9b4cee54c0",
  "url": "https://metro.co.uk/2026/02/12/martin-keown-blown-away-magnificent-arsenal-star-draw-brentford-26863912/",
  "title": "Martin Keown blown away by  magnificent  Arsenal star after Brentford draw | Football",
  "date": "20260213T003000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Martin Keown praised two Arsenal players after the Brentford draw and insisted the point could end up being significant in the Premier League title race.\nLeaders and title favourites Arsenal could only draw 1-1 with Brentford on Thursday and were perhaps fortunate to return to north London with even a point.\nBrentford were marginally on top in the first half but Arsenal began to take control after half-time and broke the deadlock through Noni Madueke’s header.\nKeith Andrews’ side always looked threatening from set-pieces and equalised through that avenue when Keane Lewis-Potter headed in from Michael Kayode’s long throw-in.\nBrentford wasted a number of chances to take the lead late on, while Arsenal could have won it at the death only for Caoimhin Kelleher to deny Gabriel Martinelli.\nThe derby stalemate leaves Arsenal four points clear of second-placed Manchester City, who followed up Sunday’s incredible comeback win at Liverpool with a comfortable victory over Fulham in midweek.\n‘If you can’t win it, then you can’t lose it, it is one of those,’ Keown said on TNT Sports after a pulsating derby. ‘In the past, we have seen Arsenal teams not get what they needed.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘When they reflect on this, obviously they weren’t at their best, but they have come away a point and at the end of the day they are now four points clear.\n‘Arsenal scraped through here tonight. They could have put down a big marker if they won the match, but it never looked like that was going to be the case.\n‘Arsenal will see that as a good pint well-earned, in the end I think. Nothing has really gone wrong here for Arsenal – big drama, let’s move on.\n‘See, you get knocked down, you get up again. Let’s see who the fighters are and let’s see who is going to win this.’\nKeown described Declan Rice’s performance at Brentford as ‘quite magnificent’ and also praised Arsenal captain Martin Odegaard, who came on at half-time for Eberechi Eze.\n‘Arsenal were much better in the second half, without a doubt,’ the Gunners legend added.\n‘What Odegaard does well is often missed, the way he presses high up the pitch meant Brentford couldn’t play through the midfield in the way they wanted.\n‘It was a good moment for Arsenal when they scored but Brentford were making it so difficult for them.\n‘I thought the standout player for Arsenal was Declan Rice, it was immense the ground he was covering. He was the standout player, he was quite magnificent.\n‘You take the point because it’s a local derby and it was intense. Credit to Brentford and Keith Andrews because they’ve really developed and added even more to what Thomas Frank did here.\n‘I couldn’t see Arsenal surviving without conceding a set-piece in that final half an hour and the pressure told in the end.’\nArsenal are bidding to win their first Premier League title in 22 years but face fierce competition from prolific winners Manchester City.\nMore Trending\nDiscussing the title race with just 12 games remaining, ex-England striker Peter Crouch said: ‘What Man City have got is the know-how and the recent history behind them.\n‘That can lead to nervous tensions around the stadium, certainly around the back end of the season.\n‘Having someone like Man City and Pep behind you – you are always going to be looking over your shoulder. But you would much rather be in Arsenal’s position.’\nWhile Arsenal are sitting top of the Premier League, Brentford stay seventh but are now just five points outside the Champions League places.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Keith Andrews complains about Arsenal star after Brentford draw\nMORE: Why William Saliba missed Arsenal’s draw with Brentford\nMORE: Darwin Nunez and former Arsenal player axed from Al Hilal squad by Simone Inzaghi",
  "word_count": 705,
  "scraped_at": "2026-02-14T01:53:15.561630",
  "_text_extracted": true
}