{
  "article_id": "dba50aedee0c",
  "url": "https://www.mirror.co.uk/partner-stories/250000-up-grabs-week-bet365s-34692777",
  "title": "£250 , 000 up for grabs this week with bet365 6 Scores Challenge ! ",
  "date": "20250217T154500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A thrilling week of Champions League football sees a blockbuster play-off clash between Real Madrid and Manchester City on Wednesday evening.\nThe sides are competing for a place in this season’s round of 16, with City looking to overturn a 3-2 first-leg loss to the Spanish giants.\nIt’s one of half a dozen European fixtures to feature in bet365’s 6 Scores Challenge, with a share of £250,000 on offer to those who correctly predict the score of all six selected games.\nThe competition is free to enter, and cash prizes are also available for those who get four and five correct scorelines.\nThere are even prizes for players who guess one, two and three correct outcomes, in the form of free spins on a selection of bet365’s online slot games, including the Book of Horus, Sizzling 7s Fortune and Spin O’Reely.\nThe full 6 Scores Challenge prize list:\n- Six correct scores – a share of up to £250,000\n- Five correct scores – a share of £20,000\n- Four correct scores – a share of £10,000\n- Three correct scores – 25 Free Spins\n- Two correct scores – 10 Free Spins\nOne correct score – 5 Free Spins\nThree players have already won big this season, each scooping a share of £250,000. Will you join them? To help make your predictions, here’s a handy guide to this week’s selected European fixtures.\nAnd to celebrate bet365 becoming the first official sports betting partner of the UEFA Champions League, there’s also an exciting offer for fans.\nBet £10 on this week’s UEFA Champions League action and Get £50 in Free Bets – Ts&Cs Apply\nBenfica v Monaco\nBenfica head into the tie against Monaco with a slender 1-0 lead, courtesy of Vangelis Pavlidis’ first-leg strike.\nThe in-form forward now has six goals and one assist across his past nine UEFA Champions League games and his side have beaten their opponents twice already in this season’s competition.\nMonaco, meanwhile, have only scored once in their previous four European matches, and they’ll also be without defensive midfielder Al-Musrati following his red card in last week’s first leg.\nThe reward for the winner of this tie is a last-16 meeting with either Liverpool or Barcelona.\nBenfica 4/5, Draw 3/1, Monaco 29/10\nBayern Munich v Celtic\nCeltic lost 2-1 to German giants Bayern Munich in the first leg of their Champions League play-off, with Daizen Maeda's late goal at Celtic Park giving the Scottish side a lifeline heading into Tuesday night’s clash.\nThe Hoops will need to deliver one of their best performances to progress though – they’ve never beaten Bayern in a competitive game. The Scottish champions have also not won an away game in Europe since 2017.\nOn the other hand, Vincent Kompany’s side are unbeaten in five games across all competitions, with 12 goals scored over that period.\nBayern Munich 1/7, Draw 7/1, Celtic 14/1\nAtalanta v Club Brugge\nThe Belgian champions netted a controversial stoppage-time penalty in their first-leg fixture against Atalanta and take a narrow 1-2 lead into this finely poised tie.\nBeating the Italian high-flyers to a place in the last 16 would be a real achievement after scraping through to the playoffs in 24th place.\nAtalanta, on the other hand, might feel hard done by as they narrowly missed out on a direct ticket to the knockout stage by one point in the league stage.\nThey lost just one of their eight league phase matches – a 3-2 defeat to Real Madrid. They also recorded draws with Arsenal and Barcelona, scoring 20 goals in the process. Only Barca and Borussia Dortmund netted more.\nThe winners of the tie will play either Lille or Aston Villa in the last 16 of the competition.\nAtalanta 1/2, Draw 10/3, Club Brugge 5/1\nDortmund v Sporting CP\nBorussia Dortmund took a huge step towards the last 16 last week with a resounding 3-0 first-leg away win against Sporting Lisbon.\nDortmund striker Serhou Guirassy now goes into Wednesday’s clash with 10 goals in nine Champions League appearances so far this season, making him the competition’s current top scorer.\nNiko Kovac’s side have won four of their five meetings with Sporting in the UEFA Champions League, with Dortmund’s only loss coming in 2021/22.\nDespite sitting 11th in the Bundesliga, Dortmund have reached at least the round of 16 in eight of their previous 10 seasons in the Champions League.\nDortmund 9/10, Draw 14/5, Sporting CP 14/5\nPSV v Juventus\nAnother second-leg match that hangs in the balance. Juventus head to PSV on Wednesday evening with a slight advantage following their 2-1 home win last week.\nThe Italian side are struggling domestically this season, sitting fifth in Serie A following 13 draws and a loss.\nMeanwhile, PSV sit top of the Eredivisie, having scored an impressive 71 goals in 23 games in the league this season. They are also unbeaten in their past eight home Champions League games, and registered four wins in the last five group-stage games.\nThiago Motta’s side will point to their 3-1 win against the Dutch champions in Turin in the opening fixture of this season’s competition.\nPSV 5/4, Draw 27/10, Juventus 19/10\nReal Madrid v Man City\nIt was a heartbreaking late loss for Manchester City in last week’s first leg, with Pep Guardiola’s team conceding an injury-time winner to go down 2-3 against Los Blancos.\nA high-scoring affair at the Bernabeu in last season’s quarter-final ended in a 3-3 draw, while the two sides played out a 1-1 draw in Madrid during the 2022/23 semi-final.\nCity have only beaten Real Madrid in Spain once in their previous six visits – a 2-1 victory in 2020.\nHowever, they go into Wednesday’s heavyweight encounter on the back of an impressive 4-0 win against Newcastle United in the Premier League, with Omar Marmoush netting a hat trick. Carlo Ancelotti’s side played out a 1-1 draw against Osasuna in La Liga – a match that saw Jude Bellingham sent off for dissent.\nReal Madrid 4/5, Draw 16/5, Man City 11/4\nBet £10 on this week’s UEFA Champions League action and get £50 in Free Bets – Ts&Cs Apply\nSignificant Open Account Offer Ts&Cs\n- Available to new customers only. Make a qualifying deposit of £5* or more and claim the offer within 30 days of registering your account to qualify for 500% of that amount in Bet Credits, up to a maximum of £50* in Bet Credits. Once released, your Bet Credits will be held in your account balance and are non-withdrawable.\n- To release your Bet Credits for use, you must place qualifying bets to the value of your qualifying deposit (capped at £10*) and they must settle within 30 days of claiming the offer. Only qualifying bets placed and settled after claiming the offer will count towards this requirement.\n- PayPal, paysafecard and all other prepaid credit and debit cards, where available, cannot be used for either your qualifying deposit or any subsequent withdrawal of returns from Bet Credits stakes unless we have successfully verified an accepted form of your Identity Documents and you have entered a Postal Verification Code (PVC), or we have successfully verified two accepted forms of your Identity Documents. See condition 2 of full Terms and Conditions for details.\n- Bets placed must meet certain conditions to count towards the release of your Bet Credits:\n- Must contain at least one selection at odds of 1/5 (1.20) or greater.\n- Only the largest cumulative stake on an individual selection within a market/fixture combination (either pre-match or In-Play) will count towards the settled bets requirement.\n- Where a stake has been partially Cashed Out, only the remaining active stake will count.\n- Where a bet has been edited using our Edit Bet feature, only the new stake on the new bet will count.\n- Fully Cashed Out, Instant Games, Gaming, Free Bets, void bets, bets placed using Bet Credits, In-Play bets which are settled as a push or Fantasy Sports entries will not count.\n- Your Bet Credits are non-withdrawable, and Bet Credits stakes are not included in any returns. Any returns from Bet Credits placed will be added to your Withdrawable Balance. Bet Credits cannot be used on certain products, offers/promotions and bet types. See full Terms and Conditions for details.\nYour Bet Credits will expire 7 days after they are added to your Bet Credits balance.\nOpen Account Offer Full Terms and Conditions\nbet365 is committed to safer gambling. It promotes gambling as an enjoyable leisure activity and believes that gambling can only remain this way if you stay in control and gamble responsibly.\nHowever, it knows that for some people gambling can stop being a harmless leisure activity and become a problem.\nHelp is close at hand. Visit gamcare.org.uk or contact the National Gambling Helpline on 0808 8020 133.\nRegistration Required. Ts&Cs Apply, 18+. Begambleaware.org",
  "word_count": 1481,
  "scraped_at": "2026-02-14T02:08:52.952397",
  "_text_extracted": true
}