{
  "article_id": "dbb0123d4ea6",
  "url": "https://www.justarsenal.com/opinion-this-arsenal-squad-is-ready-to-win-big-things/402593",
  "title": "Opinion : This Arsenal Squad is Ready to Win Big Things",
  "date": "20251024T121500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Well lovely Arsenal people, life is an absolute dream football-wise these days. Liverpool’s luck finally ran out, while we just dismantled Simeone’s Atletico Madrid 4-0. It might not be one of Atleti’s best teams, but we still matched their worst European defeat. We have an incredible side right now. I’ve followed this club for 20 years and seen squads close to winning a major trophy, but this is the first time I have no doubt the team is more than good enough to lift one.\nIf you think about it, apart from the left wing, and we’ll talk about Martinelli who was actually good, everything is set. The bench, if you add Havertz, Jesus, Odegaard and Madueke, becomes an absolute joke. We made Atletico look bang average apart from Alvarez, who would look so good in an Arsenal shirt.\nI don’t know what more there is to say about our back line. Raya, Timber, Saliba and Gabriel are such a fine unit, except when Raya decides to do a madness. The left-back situation is interesting as I thought Lewis-Skelly was struggling a little, but that run for the second goal, my goodness! Then the finish from Martinelli was Henry-like. That said, in the first half he was alone in the box and didn’t look to stay onside, which is what really annoys me about him. Some better decision-making could make Martinelli a much better player.\nArsenal’s Set-Piece Superpower\nThe goals from set pieces have become an art form right now. I dedicate our corner goals, plus Harry Maguire’s Anfield winner, solely to Arne Slot. You deserve it mate, please cry more about Arsenal scoring set pieces and we’ll treat you to some more humble pie! That said, when we signed Rice, I was baffled as to why we didn’t put a 6ft2 physical player in the box, but those deliveries are the best and most consistent I’ve seen since Juninho Pernambucano for those of you who remember the Lyon midfielder. Then there’s big Gabi again. Our backline has become so solid that we barely mention it these days. Just three goals conceded all season, and the improvement Gabriel has made from his early Arsenal days, when he was prone to mistakes, is just incredible.\nEven Gyokeres added two goals to end his suffering. I expect more from him though. We signed him to be an outlet of goals up front, to add the missing piece that would finish off the chances, and it hasn’t really happened yet. What I really want from him is to just be in the box. The two goals he scored won’t light up a highlights reel, but being in the right place when the ball comes makes things happen, and he was. Hopefully he goes on a run. Palace, Burnley and Sunderland next, I want to see him on a 3-4 game goalscoring streak.\nOld Guard, New Heights\nWhat I find interesting is that we spent all that money on new additions, but I’m actually more impressed with the players who were already here. Rice was unbelievable again, Saka dangerous, taking men on one-versus-one. After the injury, Saka has gone back to his best. Gabriel is maintaining a monster level, and so is Timber. Calafiori has elevated his game. Odegaard showed glimpses of his best football before being hit with another injury. Martinelli has benefited from some time on the bench; he already has three goals in three Champions League games and that equaliser against City.\nWhy is this so good? People say Liverpool haven’t “clicked” yet, but I see a lot of issues there. Meanwhile Arsenal are top, three from three in the Champions League, and here’s the thing – we’re yet to see from Eze what we’ve seen from him in a Palace shirt. Gyokeres is under the microscope despite five goals in 12 games. Zubimendi has probably integrated the best, but I still think he can show more ambition going forward, like he did yesterday with some defence-splitting passes which we know he has in his locker. Madueke showed a lot of promise before his injury, and Mosquera has probably been the best of the new signings, while we’re yet to see Hincapie.\nThe squad is now ready. We’ve won around seven consecutive games against Spanish teams, including a 5-1 win over Madrid and now 4-0 against Atleti. The bench will need extra seats to fit the talent coming back from injury soon. Everything is in place – we just need the trophies now. Of course, the Champions League and Premier League are the big ones, but I want us to take the Carabao Cup seriously too. We’ve only won it twice, and that needs to change. We’re genuinely the best squad in England right now.\nLiverpool are in transition despite spending 450 million pounds. Isak and Ekitike have to battle for one place, Salah’s misfiring, the absence of Trent is obvious, and the defence looks shaky. City have the best forward in the world in Haaland, but one injury to a player who’s already scored 18 goals this season and the problems are obvious.\nCome on Arsenal, we can’t be the nearly men anymore. It’s time to win the big stuff!\nLet us know your thoughts in the comments.\nDan Smith\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 955,
  "scraped_at": "2026-02-14T01:52:49.016100",
  "_text_extracted": true
}