{
  "article_id": "dbcd79132a08",
  "url": "https://www.90min.com/tottenham-make-son-heung-min-contract-decision",
  "title": "Tottenham make Son Heung - min contract decision ahead of deal final year",
  "date": "20240531T053000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham make Son Heung-min contract decision ahead of deal's final year\n- Son Heung-min's current Tottenham contract will run until 2025\n- Club holds an option to extend deal by another 12 months\n- Captain scored 17 Premier League goals in 2023/24 but is nearly 32\nTottenham Hotspur are set to tie down Son Heung-min for an extra year, virtually erasing the possibility that the club captain could head for the exit door this summer.\nSon took on a new level of responsibility in 2023/24 following Harry Kane's departure and scored 17 Premier League goals to match his second best single season tally in the competition.\nBut the South Korean icon will turn 32 before next season begins, with his age enough to keep the speculation over a potential move to the Saudi Pro League burning.\nSon has will soon enter the last 12 months of the long-term deal he signed back in 2021, but The Athletic writes that a one-year option to extend it until 2026 will be triggered. It means the new expiration date of his contract will be pushed to a week before his 34th birthday.\nLast summer, Son emphatically revealed he had little interest in moving to Saudi Arabia.\n\"If I wanted to go there, I would not be here!\" the player said at a press conference during Tottenham's pre-season tour of Australia. \"I love playing football. Obviously money is also important but I dream [of] playing [in the] Premier League.\"\nThis season was the first of Son's time at Spurs that the club did not play European football. An improved fifth place finish, up from a disastrous eighth 12 months ago, translates into qualification for the newly reformatted Europa League.\nSon previously played a significant part in Tottenham's great European adventure of modern times when team, then under Mauricio Pochettino, reached the Champions League final in 2019 with a dramatic semi-final comeback against Erik ten Hag's Ajax.\n\"I think I'm the type of guy who never wants to give up and tries to work as hard as possible until the last result of the game. I think when you don't believe, these things don't happen,” he told 90min for a special recent oral history of the crunch second leg.",
  "word_count": 374,
  "scraped_at": "2026-02-14T02:25:33.968203",
  "_text_extracted": true
}