{
  "article_id": "dc391bf6e745",
  "url": "https://www.bbc.co.uk/sport/football/65734681",
  "title": "Women Champions League : Barcelona come back from 2 - 0 down to beat Wolfsburg 3 - 2 to win second title",
  "date": "20230603T204500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Women's Champions League: Barcelona come back from 2-0 down to beat Wolfsburg 3-2 to win second title\n- Published\nBarcelona won a second Women's Champions League title after coming from behind in stunning fashion to beat German giants Wolfsburg.\nThe Spanish champions trailed 2-0 at half-time before Patri Guijarro's two-minute brace pulled them level.\nSpurred on by their instant response in the second half, Barcelona piled on the pressure and were eventually rewarded.\nFridolina Rolfo got the winner, thumping it into the roof of the net from close range with 20 minutes left.\nAfter losing their crown to Lyon in last year's final, Barcelona travelled to Eindhoven as favourites against a very strong Wolfsburg side, who were seeking a third European trophy in 10 years.\nWolfsburg got off to the perfect start when competition top scorer Ewa Pajor robbed the ball off England defender Lucy Bronze, returning after knee surgery in April, to drive in the opener.\nGermany international Alexandra Popp was then set-up by Pajor with a teasing cross - the striker making no mistake as she headed in Wolfsburg's second.\nBarcelona had lacked fluency and patience in the first half but it was no surprise they bounced back, displaying the quality of football that helped them reach a fourth final in five seasons.\nAmong Barcelona's winners was England midfielder Keira Walsh, who picked up her first European title, while Bronze became the first English woman to win the trophy with two different clubs after winning it on three consecutive occasions with former club Lyon between 2018 and 2020.\nBronze creates history as Walsh tastes success\nBronze became a serial winner of this competition while at Lyon, picking up the last of her titles going into this final when they beat Wolfsburg in 2020.\nShe knew she could create history by winning a fourth crown with a second club but it was a disastrous start when she lost possession to Pajor and was punished by her ruthlessness.\nIt continued to be a tough first half for Bronze. She had her hands full with Pajor and was not able to get forward as much as she liked.\n\"We made it hard for ourselves in the first half even though we created so many chances,\" Bronze told Dazn.\n\"We knew we had enough quality to come back into any game. I don't think we were ever worried about scoring three goals, which is a crazy feat to do, but that's the talent within this team.\n\"It was definitely difficult at the end having not played for five weeks, but I'm so happy to have played my part for the team.\"\nAs the game wore on, Barcelona's quality pulled through with superstars Caroline Graham Hansen and Aitana Bonmati showing individual skill on the right to set-up Guijarro twice in as many minutes.\nWalsh was marked out for most of the game and had little impact before she was substituted late on after Maria Caldentey poked it into Rolfo's path for Barcelona's third.\nBut it was an unforgettable evening for the former Manchester City player, winning her first European title in her debut season for Barcelona after leaving childhood club last summer for a world-record transfer fee.\nIt caps off a stunning year for English duo Bronze and Walsh, who played a key role in the Lionesses' success at Euro 2022 and add this trophy to the Spanish league title they secured a few weeks ago.\n\"It's been a pretty good year with the Euros and the Champions League,\" added Walsh.\n\"To play for Barcelona in front of these fans is a special, special feeling. This club gives you that.\"\nPopp equals record but can't secure win\nIt was a pitch packed full of world-class talent, one of those being Germany striker Popp. She did not fail to deliver.\nThe 32-year-old was chasing a fourth title to add the trophy she won with Duisburg in 2009 and the two she had already won with Wolfsburg.\nShe scored the opening goal the last time Wolfsburg won the Champions League in 2014 and she was deadly in the box this time around when she headed in Pajor's teasing cross to make it 2-0.\nThat goal meant she equalled former Ballon d'Or winner Ada Hegerberg's competition record of scoring in four separate finals.\nAgainst different opposition, that goal may have given Wolfsburg a comfortable cushion at half-time, but Wolfsburg were blown away by Barcelona's quality after the break.\nSuch was the strength of their opponent's depth, they were able to bring on exciting Brazilian forward Geyse and Ballon d'Or winner Alexia Putellas, still returning to full fitness following recovery from an anterior cruciate ligament injury.\nBut despite ending up on the losing side, Popp's form in her 11th season with Wolfsburg has been excellent and she will hope that continues at the World Cup which kicks off in Australia and New Zealand on 20 July.\nNo small talk, no messages, just one kiss: Dannii Minogue plays Cupid in I Kissed A Boy\n'The shorter your sleep, the shorter your life': Joe Wicks learns why sleep is fundamental to our health",
  "word_count": 854,
  "scraped_at": "2026-02-14T02:00:19.985230",
  "_text_extracted": true
}