{
  "article_id": "dc3a00036476",
  "url": "https://www.caughtoffside.com/2025/03/02/ornstein-drops-massive-liverpool-update/",
  "title": "David Ornstein provides crucial Liverpool transfer update",
  "date": "20250302T161500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool are dealing with the contract situation of three of their most important players.\nMohamed Salah, Virgil Van Dijk and Trent Alexander-Arnold have all entered the final few months of their contract at the club.\nWith nothing agreed regarding a new deal, they are all set to become free agents and could leave the club for free.\nArne Slot’s Liverpool side, who are favourites to win the Premier League this season and also challenging for the Champions League title, know that they cannot afford to lose all these players.\nAll of them have been instrumental in Liverpool’s success this season and their future is key to their success and the project of the Dutch manager.\nFootball journalist David Ornstein has now provided the latest update about the contract issues of these players, claiming that out of the three, two could stay at the club while the other could leave.\nIn his weekly Q&A for The Athletic, Ornstein said:\n“Talks continue and there has long been optimism around Anfield regarding Salah and Van Dijk. I’m not aware of agreements being reached, but both players seem keen to stay and are playing out of their skin – plus as far as we know Liverpool absolutely want to keep both.\nAs they do Alexander-Arnold, but we all know his situation is different; he is younger and has Real Madrid knocking at his door. The consensus around the industry is that maybe Salah and Van Dijk will renew, while perhaps Alexander-Arnold will go. But nothing appears to be set in stone yet.”\nLiverpool may struggle to keep Trent Alexander-Arnold\nInterest is high in all the Liverpool players since clubs are waiting for the chance to sign them for free.\nWhile Salah has been linked with a move to the Saudi Pro League, Alexander-Arnold has serious interest from La Liga giants Real Madrid.\nThe opportunity to play alongside world class players and his best friend Jude Bellingham could be too good an opportunity to reject for the England international defender.\nSlot would want to keep all the players at the club but the situation is now not in the hands of the club and the players have more power now.\nLiverpool consider surprise move for attacker Man United sold in the summer of 2024",
  "word_count": 379,
  "scraped_at": "2026-02-14T02:14:59.443375",
  "_text_extracted": true
}