{
  "article_id": "dc4534a70a48",
  "url": "https://www.themag.co.uk/2023/04/newcastle-united-and-tottenham-appear-to-have-swapped-their-situations/",
  "title": "Newcastle United and Tottenham appear to have swapped their situations",
  "date": "20230422T083000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United and Tottenham appear to have swapped their situations\nHere we go then, another weekend of football with Newcastle United back on home soil.\nAs frustrating as the 3-0 defeat against Aston Villa last weekend was, the sting was taken out of it by seeing our next opponents (and rivals for top four) Tottenham Hotspur lose in stoppage time at home to Bournemouth.\nAs I believe Manchester United are now likely to finish third (despite our excellent recent win over them at St James’ Park), we now have to simply focus on the next game, a common Eddie Howe attitude.\nIt all comes down to this Sunday’s game against Spurs.\nRegular visitors to The Mag will probably be sick of me saying it, but I have been saying it for long enough, so I might as well repeat it again.\nTottenham are the team to best if Newcastle United are going to make top four and the promised land of the Champions League.\nYou can talk about your Aston Villas and your Brightons, who like ourselves have had great seasons, but it is Spurs we need to beat in this sprint finish to the end of the season.\nA draw wouldn’t be the end of the world against Tottenham this Sunday and in doing so we would be “holding them off” or “keeping them at bay”. A wasted game for them if it ends a draw.\nIF we win though, it would certainly give us a huge leg up in ousting them from Champions League contention, IF we win.\nOn the playing side of it, they are a much of a muchness without their prized pair of Harry Kane and Son Heung-min. Lose one of them and they’re bang average, lose both and dare I say it, they’re mid-table fare.\nThat’s not to say we can’t / won’t beat them if both are playing, I’m backing us for three points this weekend regardless.\nWhen the game is finished on Sunday, Newcastle United will have seven games left, Tottenham just six. Games are running out, which obviously favours whoever is currently in the driving seat – Us. That’s why a draw wouldn’t be the end of the world.\nWe played brilliantly down at Spurs, deservedly coming away with a 2-1 win. If we were to draw this weekend and you reversed the results (draw away and win at home), you’d take that every season against Tottenham.\nNewcastle United and Tottenham seem to have swapped places in recent times. Where we were once the basket case of a club in relative disarray, Tottenham seem to have adopted that attitude.\nBack to that downer of the Villa defeat, full-time in our game and I was worried. I never saw Tottenham getting beat off Bournemouth, so when I heard it I was ecstatic, despite our score earlier in the day.\nTheir defeat has bought us some time, eaten away at their remaining games and looking at the teams they have to yet face, the positivity keeps on coming. Manchester United, Crystal Palace and Brentford at home, whilst Liverpool, Villa and Leeds away are not easy fixtures. Oh and there’s the big one, Tottenham still have to play Newcastle United, up here, at St James’ Park.\nAlright, I’ve highlighted this game for long enough over the weeks and months so forget the draw, let’s put last weekend firmly behind us and smash ’em.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 583,
  "scraped_at": "2026-02-14T02:19:40.785618",
  "_text_extracted": true
}