{
  "article_id": "dc610d7fb2ec",
  "url": "https://www.caughtoffside.com/2025/05/03/marcus-rashford-move-premier-league-side/",
  "title": "Marcus Rashford could be priced out of a move to Aston Villa",
  "date": "20250503T151500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marcus Rashford is widely expected to leave Manchester United in a permanent move in the summer transfer window.\nThe English attacker left the club in a loan move earlier this year to join Unai Emery’s Aston Villa side.\nRashford has impressed on his loan spell at Villa Park after impressive performances in the Premier League and the Champions League.\nWith the player having a fall-out with manager Ruben Amorim, his exit from he club seems inevitable.\nHowever, Aston Villa may not be his next permanent club after a latest development dealt a major blow to Emery’s side to sign the Man United star.\nAccording to Football Insider, Villa would be unable to complete a move for Rashford if they do not qualify for the Champions League.\nMarcus Rashford is keen on playing Champions League football\nVilla have an option to sign the player in a permanent move for £40million at the end of the season which is seen as a good price for a player like Rashford but his high wages, which are around £350,000-a-week, would be too expensive for the Premier League club.\nThat would mean that the player would have to take a wage cut in order to join Emery’s side.\nIt is highly unlikely that Rashford would want to join Aston Villa if they fail to qualify for the Champions League since the 27-year-old wants to play in Europe’s elite competition.\nThe Man United outcast is dreaming of a move to Barcelona but even if he wants to join the Spanish side, taking a wage cut would be necessary due to Barcelona’s poor financial condition.\nIn order to replace Rashford, United are considering a move for Crystal Palace’s Eberechi Eze.\nMan United set new price tag for Marcus Rashford after successful spell at Aston Villa",
  "word_count": 298,
  "scraped_at": "2026-02-14T01:58:31.680410",
  "_text_extracted": true
}