{
  "article_id": "dc923e9c562e",
  "url": "https://www.bbc.com/sport/football/articles/cpqdj7pelwqo",
  "title": "Arsenal vs Liverpool : Premier League title rivals meet on Sunday in crucial match",
  "date": "20241027T121500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal v Liverpool: Gunners underdogs? Salah to shine?\n- Published\nIt is early into the 2024-25 Premier League season, but Arsenal against Liverpool on Sunday has the feeling of a huge fixture in the title race.\nThe Reds are second in the table with 21 points, four ahead of the Gunners. If Liverpool win they will go top and leave Mikel Arteta's side seven points behind them.\nWhat are the key statistics, and where might the match at Emirates Stadium be won? BBC Sport takes a look.\nShould 'underdogs' Arsenal be worried about Liverpool?\nWith injuries to key players and Liverpool in strong form, former Manchester City defender Nedum Onuoha believes Arsenal go into this game as underdogs, but believes it is a position that could suit them.\n\"Should Mikel Arteta be worried? I do not think so,\" he said on the Planet Premier League podcast.\n\"I think he understands the importance of the start of the season, but understands the importance more so of how they finish it.\n\"The disappointment after losing to Bournemouth will be big, but the really good sides, players and managers - I always fancy them after a defeat.\n\"The fact they will face a test against Liverpool, and weirdly at home they will feel possibly a bit like an underdog - I think that suits who they want to be at this moment.\n\"The crowd will be up for it, the players will as well and if they do manage to win it will be the boost they perhaps didn't think they'd need at this time, but the boost that will come and the belief would be there 100%.\"\nLiverpool have lost just once this season - the 1-0 home defeat by Nottingham Forest - winning every other game.\nFormer Chelsea and Brighton manager Graham Potter believes the stability Arne Slot has provided is key to their excellent run of form.\n\"What he has done is make it very stable at Liverpool,\" Potter said.\n\"The playing style has changed bit by bit - they build up and press a bit more patiently now. It will be interesting to see how they maintain that.\"\nAs for Sunday's game, Potter added: \"I think it will be a draw.\"\nWill Arsenal start fast again?\nThis may be a tough game for Arsenal but they have a habit of getting off to a strong start against the Reds - in their past four league meetings the Gunners have opened the scoring in the first 15 minutes.\nIn half those fast starts Arsenal have taken all three points, and they won the most recent fixture between the two in February, beating Liverpool 3-1 after Bukayo Saka opened the scoring in the 14th minute.\nBut while they have managed to get an early goal against Liverpool in recent games, they have not quite been as quick out the blocks this season.\nThey have scored 15 goals in their eight Premier League games, but none of those have come inside 15 minutes.\nWhy Slot's Liverpool still have a lot to learn - Benitez\n- Published26 October 2024\nLiverpool defence a tough nut to crack\nA fast start against this Liverpool team might be easier said than done, with Arne Slot having made a noticeable difference to the Reds' defence.\nWhile Jurgen Klopp's teams played riskier football in the pursuit of scoring more goals, Slot is more cautious and the result is they have conceded just three goals and kept five clean sheets in eight games - half as many already as they managed in the entirety of last season.\nOn average Liverpool are conceding 0.38 goals per game this campaign, compared with 1.08 goals last term.\nIt could be argued Liverpool's impressive start is partially down to a kind fixture list, having mostly faced teams in the bottom half of the table.\nBut last weekend they faced an in-form Chelsea and came through that test with a 2-1 victory, suggesting they are well-prepared for the tougher games too.\nDefensive headache for Gunners\nThere is, of course, a long way to go before the Premier League title is decided, but the Gunners find themselves in what could prove one of their most testing periods of the season.\nArteta has been unfortunate with injuries - captain Martin Odegaard has not featured since the 1-1 draw with Brighton at the end of August after suffering an ankle injury playing for Norway.\nBukayo Saka has missed their past two fixtures with a hamstring injury picked up on international duty with England, and defender Riccardo Calafiori twisted his knee in Tuesday's Champions League win against Shakhtar Donetsk.\nTo compound matters, Arsenal are without defender William Saliba after he was sent off against Bournemouth, and statistics suggest he will be a significant loss. The Gunners have a 74% win-rate with him in the side, compared with 45.5% without.\nArsenal record since start of 2022-23 in Premier League\nThe defensive issues mean Jakub Kiwior will likely start at centre-back alongside Gabriel, while 18-year-old Myles Lewis-Skelly, who replaced Calafiori midweek, might be an option.\n\"The interesting thing with Arsenal is probably the first time in a long time there’s a little instability with the players who are out,\" Potter said on the Planet Premier League podcast.\n\"It will be interesting to see how they navigate that.\"\nThe Gunners will be pleased, at least, that Gabriel Martinelli should be fit.\nHe has more goal contributions against Liverpool (seven - five goals, two assists) than against any other team since arriving at Arsenal in 2019.\nSalah shining again\nMohamed Salah may be 32 years old but is proving as crucial to Liverpool's attack as ever.\nHe scored in last weekend's win against Chelsea, and provided the assist for Curtis Jones' winner.\nThat means he has contributed to 10 goals this season in the Premier League - five goals and five assists.\nOnly Erling Haaland, Bryan Mbeumo and Cole Palmer have scored more, while only Saka has provided more assists.\nAnd against the traditional 'big six' clubs, Salah more often than not delivers.\nThe Egypt striker has 61 combined goals and assists in 72 appearances against Arsenal, Chelsea, Manchester City, Manchester United and Tottenham. Only Alan Shearer has a higher total in Premier League matches against these teams - and Liverpool - with 75 in 129.\nRelated topics\n- Published16 August 2025",
  "word_count": 1060,
  "scraped_at": "2026-02-14T02:20:44.345385",
  "_text_extracted": true
}