{
  "article_id": "dca11074abec",
  "url": "https://www.themag.co.uk/2024/04/manchester-united-launch-everything-must-go-newcastle-united-very-different/",
  "title": "Manchester United launch everything (***) must go - Newcastle United very different",
  "date": "20240430T103000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United launch everything(***) must go – Newcastle United very different\nIt was an interesting update on Manchester United.\nWith BBC Sport reporting (see below) that their information was that the Old Trafford club have basically made pretty all of their squad available to buy this summer.\nThe everything(***) must/can go, claimed to only exclude three young players – Mainoo, Garnacho, Hojlund – with all of the rest available to buy (or be given away?).\nObviously, this situation hasn’t come about overnight, it has been getting progressively worse over many year and Erik ten Hag has simply made things so much worse.\nManchester United ending up with a squad full of players who have cost a fortune, far more than they were worth in reality, now worth far less collectively than even that. Then to compound that, so many of their squad on massive wages, so who would possibly be even interested in most of them?\nLook what has happened just in these last three years…\nManchester United major signings last three signings (2021/22 onwards)\n£72m Hojlund\n£60m Mount\n£50m Onana\n£85m Antony\n£70m Casemiro\n£55m Martinez\n£80m Sancho\n£35m Varane\nI make that over half a billion spent on just these eight players.\nIf sold, would any of these even see Manchester United get their money back, never mind see a profit?\nMy guesstimate is that this lot above, you would be lucky to get back more than £200m of the £500m+ that was spent on them.\nSome of the amounts spent are staggering, £85m and £80m on Antony and Sancho respectively! So many of the squad on wages of £200,000 or more, with indeed the likes of Casemiro, Sancho and Varane said to be on well over £300,000 a week. Whilst Manchester United were also forced to agree £375,000 wages per week to stop Marcus Rashford potentially walking away on a free. No wonder BBC Sport are reporting that Manchester United would ‘reluctantly’ sell Rashford!\nWith a new manager at a football club, you look for them to make inspired signings who will grow in performance and therefore value, whilst also bettering the performance (and value) of inherited players.\nDifficult to see how Erik ten Hag has done that with any players. Mainoo and Garnacho were already in the younger age groups when ten Hag arrived and were surely always going to get their chance in the first team. So I don’t see how the Manchester United manager can take any great credit for them being the exceptions to pretty much all the rest of the squad.\nInteresting then to compare and contrast what has happened at Manchester United these last three years, with goings on at Newcastle United…\nNewcastle United major signings last three signings (2021/22 onwards)\n£38m Barnes\n£32m Livramento\n£53m Tonali\n£7m Minteh\n£63m Isak\n£45m Gordon\n£35m Botman\n£10m Pope\n£13m Targett\n£41m Bruno\n£13m Burn\n£12m Trippier\n£25m Willock\nAs well as Willock, there are countless other Newcastle players that he inherited, that Eddie Howe has improved out of all recognition. Their performances and therefore their transfer value as well, massively improving.\nThose 13 players listed above, may have had some £380m+ spent on them these past three seasons, BUT I would argue that just Isak, Bruno and Gordon could recoup pretty much all of that, certainly £300m+ for the trio. If for any mad reason Newcastle United chose to sell them (also taking into account Bruno’s transfer release clause that ends on 30 June 2024…).\nThe bottom line though is, that the £150m paid out on Bruno, Gordon and Isak, would see Newcastle United easily more than double their money, if they chose to.\nThis is yet another illustration of why Newcastle United and their fans should be grateful to have Eddie Howe. Erik ten Hag and the rest of the Manchester United set-up going for name players, almost all of them older, some even in their 30s such as Casemiro and Eriksen on massive wages in a short-term gamble. The likes of Varane cost £35m only three years ago and now set to leave for nothing.\nEddie Howe was faced with what looked a near impossible relegation fight when taking over mid-season, yet even despite that made inspired signings in Trippier, Bruno and Burn. Even Chris Wood at £25m was a massive bargain when you take into account Forest gave £15m for him AND most importantly, in the 15 PL games he started in that relegation fight, Newcastle picked up a massive 29 points playing a very unselfish role that was key to that survival and bounce back, seeing NUFC with the third best form in the second half of that 2021/22 season.\nOlder experienced players such as Burn were needed in that relegation fight, as they could hit the ground running. Beyond that though, the £13m for Burn has proved a massive bargain, part of the best defence in the Premier League last season and even now holding things together with so many defenders missing.\nTrippier another of last season’s stellar back four, even at the age of 33 Newcastle could have still banked a profit on him, if selling to Bayern in January.\nEven Targett you would get your money back on this summer if deciding to trade him, so unlucky with injuries this season.\nAs for £10m on Nick Pope, how did Eddie Howe pull that one off??? Compare that to Manchester United paying out £50m for Onana!!!\nAll of the players that the really big money has been spent on these past three years, has been invested so well. Fact is as well, it has been spent on young players who have their best years ahead of them AND have increased in value. The fact you look at players increasing in value as part of your spending strategy does NOT mean you necessarily intend to sell them. It just means that as time goes on and each year you invest in better and better players, then when you do end up selling squad players who are no longer first team regulars, you get serious money to then invest in the squad.\nTo sum up.\nComparing Eddie Howe and Erik ten Hag. When it comes to the value now of the players they inherited compared to now, plus then how much their signings cost and how much they are worth now.\nAdding all of that together, I would argue that Eddie Howe has been responsible for a positive £300m to £400m increase in the value of all the inherited Newcastle United players and his signings, whilst at Manchester United the exact opposite these past three years, with Erik ten Hag helping to oversee a £300m to £400m decrease in value of players he has signed and those he inherited.\nBBC Sport report – 29 April 2024:\n‘Manchester United are willing to listen to offers for virtually all their first-team squad this summer as Sir Jim Ratcliffe looks to turn the club back into challengers for major honours.\nIt is understood Marcus Rashford is on the list, although club sources are adamant their preference is to keep the England striker and work with him to restore the form that brought him 30 goals for the first time last season.\nOf manager Erik ten Hag’s regular starters, youngsters Rasmus Hojlund, Kobbie Mainoo and Alejandro Garnacho are thought to be exempt.\nIt would take a major offer before United would even consider selling skipper Bruno Fernandes, goalkeeper Andre Onana and full-back Diogo Dalot, who signed a new five-year deal less than 12 months ago.’\n‘With current Profit and Sustainability Rules (PSR) in place for next season, the club are having to be careful about what they spend, especially as they are now virtually certain to miss out on a place in the Champions League.\nIt is likely they will have to either finish sixth in the Premier League or beat Manchester City in the FA Cup final to qualify for the Europa League. They are currently sixth, one point ahead of Newcastle, who they play at Old Trafford on 15 May.’\n‘It means they will also look to maximise the fees they generate in the transfer market. Some experienced players will leave as their contracts have expired. This includes striker Anthony Martial. Defender Raphael Varane is also likely to figure in that list as his contract expires in the summer. Sofyan Amrabat is expected to return to Fiorentina after the Morocco midfielder endured a difficult season on loan.\nMidfield pair Christian Eriksen and Casemiro have one and two years left on their contracts respectively, but both have had disappointing campaigns. United were willing to sell Harry Maguire and Scott McTominay last summer, and though both have made significant contributions this season, the club are unlikely to stand in their way if the right deal could be done.’\n‘Sources at [Man] United have suggested it could be the 2025-26 season before the club are really able to flex their muscles again.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1513,
  "scraped_at": "2026-02-14T01:56:51.538650",
  "_text_extracted": true
}