{
  "article_id": "dccc5d54e443",
  "url": "https://metro.co.uk/2025/11/22/burnley-vs-chelsea-predicted-lineup-today-confirmed-team-news-24770496/",
  "title": "Burnley vs Chelsea : Predicted lineup today and confirmed team news",
  "date": "20251122T073000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea moved up to second in the Premier League table after a well-earned 2-0 win over Burnley at Turf Moor on Saturday.\nPedro Neto and Enzo Fernandez found the back of the net with the Blues now within three points of leaders Arsenal ahead of the big clash between the London rivals next week.\nEnzo Maresca opted to rest star player Moises Caicedo after a gruelling international break but it was a risk that paid off as replacement Andrey Santos shone as the defensive midfielder.\nIt was Burnley who started the better side however, with Jaidon Anthony not once but twice breaking into the box, only to see his efforts well-blocked by Santos and Tosin Adarabioyo.\nChelsea were ponderous and uninspired for much of the first-half, in need of a magic spark. Up stepped Jamie Gittens in the 37th minute, whose sublime cross found Neto at the far post, with Martin Dubravka unable to stop his diving header.\nFrom there, the Blues were in complete control, even after captain Reece James was subbed off at half-time, though their decision making in the final third was somewhat lacking.\nNeto came close to a second as his powerful, low shot beat Dubravka but not the post, before substitute Malo Gusto forced a decent save from the Clarets keeper.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe home side’s confidence collapsed after conceding, but after Zian Flemming squandered a great opportunity to equalise from a free-kick, Scott Parker’s team did find their rhythm again to set up a tense finale.\nMore Trending\nBut ultimately, Chelsea’s quality was too much, as Marc Guiu did brilliantly to set-up Enzo Fernandez to fire in the second goal in the 88th minute and seal the three points for the west Londoners.\nBurnley may feel hard done by some refereeing decisions, most notably when Trevoh Chalobah handled the ball after Robert Sanchez had appeared to take his goal-kick and when Benoit Badiashile fought with Maxime Esteve in the box, but Peter Bankes so no penalty on each occasion.\nBut the visitors were the better side overall, overtaking Manchester City in the table ahead of their match at Newcastle in the evening.\nRelive all the action with Metro’s matchday blog\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nGoodbye!\nThat concludes are LIVE coverage of Burnley vs Chelsea.\nThank you for joining us and be sure to keep tuned in to the Metro for all the latest reaction to the match.\nFull-time! Burnley 0-2 Chelsea\nThe three points are Chelsea’s as Enzo Maresca’s side move up to second in the table – and within three points of Arsenal ahead of their clash next week.\n90 mins: Burnley 0-2 Chelsea\nSix minutes added on.\nGOAL! Burnley 0-2 Chelsea (Fernandez)\nGame over!\nJust as Burnley were getting back into the game, Chelsea surge up the pitch and score! Neto who finds Guiu who has holds off his defender and closes in on Dubravka.\nHe doesn’t shoot and the chance looks to have gone but instead he cuts back to an enrushing Fernandez who fires the ball into the back of the net\n83 mins: Burnley 0-1 Chelsea\nAh now this is silly. Burnley win their first corner but tensions are bubbling up as Badiashile tries to shove Esteve into the goalpost.\nHe’s booked, as is Hannibal for dissent.\n80 mins: Burnley 0-1 Chelsea\nDiscipline has been a problem for Chelsea this season, so it’s good to see Maresca setting an example and staying calm on the touchline… oh no he’s just been booked for dissent.\n77 mins: Burnley 0-1 Chelsea\nMore changes. Pedro’s day is done. Guiu is on.\nMeanwhile, Tchaouna is off for Bruun Larsen.\n75 mins: Burnley 0-1 Chelsea\nThat chance has woken Burnley up and Scott Parker makes his first changes: Ugochukwu, Anthony and Flemming off. Foster, Hannibal and Broja on.\nRemember, ex-Chelsea striker Broja hasn’t scored since January 2024…\n71 mins: Burnley 0-1 Chelsea\nOh what a chance for Burnley.\nPedro is the latest to end up in the book for bringing down Ugochukwu and the home side have a free-kick on the half way line.\nIt’s eventually pumped long into the box for Flemming whose unmarked. He chests it down and takes a shot… which ends up in row Z!\n68 mins: Burnley 0-1 Chelsea\nA second change for Chelsea and it’s a strange one. Striker Delap is replaced by full-back Gusto\n64 mins: Burnley 0-1 Chelsea\nOff the post!\nSantos has played brilliantly today and wins the ball in the attacking half. He finds Fernandez who finds Neto who smashes an effort at the near post.\nHe beats Dubravka but not the post and the ball rebounds back into the centre of the box but Burnley clear the danger away.\n58 mins: Burnley 0-1 Chelsea\nChelsea have begun the second-half as they ended the first, in control and inspired after Neto’s goal.\nThey have no issue getting the ball into the box. It’s when they get there that their decision making falls apart.\nFor instance, Pedro just weaved his way past Burnley’s defence but can’t decide whether to pass or shoot. He does neither as the ball is lost and cleared away.\n53 mins: Burnley 0-1 Chelsea\nOuch. Cullen lunges in on Santos and the Chelsea midfielder is in a bit of pain. He’s seen by the medical team but looks good to continue.\nThe referee gives a free-kick but nothing more much to the anger of the away team.\n51 mins: Burnley 0-1 Chelsea\nFirst chance of the second-half goes to Chelsea but after a nice move, Pedro blazes his effort over the bar.\nWalker has now gone into the book for a foul on Gittens.\n48 mins: Burnley 0-1 Chelsea\nThat James substitution may be a concern for Chelsea (and England potentially).\nThankfully, the Blues captain has just reemerged from the tunnel and looks… fine. He’s smiling and walking okay.\nFor clarity, Chalobah has moved out to right-back with Badiashile slotting in at centre-back.\n46 mins: Burnley 0-1 Chelsea\nThe restart was delayed thanks to a technical issue with the officials. The linesman’s battery pack is flat I presume.\nNow that that is sorted we can play some football.\nReece James subbed off at half-time\nWe’re about to get back underway at Turf Moor and Chelsea have made one rather big change.\nCaptain Reece James has come off and Benoit Badiashile is on.\nIs the England right-back injured again?\nHalf-time! Burnley 0-1 Chelsea\nDelap sees a shot deflected for a corner which comes to nothing and Peter Bankes blows for half-time.\nWhat started as a very slow and dull game has heated up nicely fans to a lovely goal from Neto.\nCan Burnley, who have played well so far, respond after the break?\n45 mins: Burnley 0-1 Chelsea\nCould be 2-0! A nice break from Chelsea as Pedro finds Delap on the left flank, he can cross the ball across the box for an easy Neto tap in.\nThe Englishman can’t wrap his foot around the ball however and he ends up tamely passing to Dubravka.\nThe fourth official says there will two minutes of added time.\n42 mins: Burnley 0-1 Chelsea\nFrom the sublime to the ridiculous as Neto picks up the first yellow card of the game for delaying a Burnley free-kick.\nWas there any need for that?\nMORE: Birmingham City ‘want second team’ to play at new £1.2bn ‘Powerhouse’ stadium\nMORE: Viktor Gyokeres ‘will be fit’ but Tottenham star will ‘control’ Arsenal striker in derby\nMORE: Mikel Arteta speaks out on Arsenal defensive plan after Gabriel injury",
  "word_count": 1327,
  "scraped_at": "2026-02-14T02:03:26.526447",
  "_text_extracted": true
}