{
  "article_id": "dcd1499f23be",
  "url": "https://www.joe.co.uk/news/why-both-euro-2024-matches-will-be-on-at-the-same-time-tonight-443692",
  "title": "Why both Euro 2024 matches will be on at the same time tonight",
  "date": "20240623T164500Z",
  "domain": "joe.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "News\nShare\n23rd June 2024\n03:51pm BST\nBoth Euro 2024 matches tonight will be kicking-off tonight at the same time and it's all because of a controversy that stretches back over 40-years.\nThe hosts Germany will be taking on Switzerland in a tussle for top spot in group A in Frankfurt.\nMeanwhile Scotland look to secure qualification to the knockout rounds for the first time in their history as they line-up against Hungary in Stuttgart.\nBoth matches will kick-off at 8pm and for good reason too as it involves an unwanted repeat of an event known at the 'Disgrace of Gijón'.\nDuring the 1982 World Cup in Spain, West Germany were playing Austria in the final round of group games, sharing a group with Algeria and Chile.\nThe day before, Algeria had beaten Chile to go second in the group while Austria sat at the top with both teams having two wins.\nWest Germany only had the one and needed to beat Austria to go through.\nSince Algeria had played Chile the day before West Germany kicked-off with Austria, both teams knew that a West Germany win by less than three goals would see the two Europeans teams progress into the knockouts.\nWith this outcome guaranteeing both teams advancement, the two sides played until West Germany scored in the 10th minute, from which point a game of unintentful sideways passing and aimless long balls and shots ensued and ensured knockout football for both nations.\nThis came at the expense of Algeria who were furious and lodged a complaint to FIFA who, despite the obvious foul play, did not deem the match as breaking any rules.\nThe match would go on to become notorious in Germany, Austria and Algeria, being dubbed the 'Disgrace of Gijón' as even Austrian player Reinhold Hintermaier would later admit that the match was fixed.\nThanks largely to this game, starting from the 1986 World Cup, all final group stage matches have been played at the same time to prevent this sort of match-fixing ever happening again.\nUEFA soon followed suit for the Euros and the Champions League. It is now the standard practise for all tournament football around the world.",
  "word_count": 364,
  "scraped_at": "2026-02-14T02:10:54.418487",
  "_text_extracted": true
}