{
  "article_id": "dcd22e2bdbd4",
  "url": "https://www.justarsenal.com/gareth-southgate-explains-why-he-called-up-saka-despite-his-injury/350468",
  "title": "Gareth Southgate explains why he called up Saka despite his injury",
  "date": "20231006T113000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England manager Gareth Southgate has included Bukayo Saka in his squad for the upcoming national team games, even though the forward is currently nursing an injury that could potentially cause him to miss several matches for both club and country.\nSaka has been a standout performer for England since making his debut for the national team, and he has become a regular inclusion in the squad.\nThe extent of the injury Saka sustained in the Champions League match against Lens will be assessed to determine its severity and the expected duration of his absence.\nAfter releasing the squad list, Gareth Southgate faced questions regarding his decision to include Saka despite the injury concern and provided an explanation for his choice.\nHe explained, as quoted by Mirror Football:\n“He’s still being assessed as they’ve obviously got a big game this weekend and then there’s another seven days before we play Australia and 10 days before we play Italy, so everybody will monitor everything as we go forward.”\nJust Arsenal Opinion\nSaka is one of the finest players in the Premier League and delivers when he plays for England as well, so it will always be a blow for him to miss a game for them.\nBut if he has suffered an injury that would sideline him for a long time, we expect him not to travel for the next international break.\n——————————-\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 255,
  "scraped_at": "2026-02-14T02:00:57.112266",
  "_text_extracted": true
}