{
  "article_id": "dd0d679d14eb",
  "url": "https://www.thecable.ng/caf-wcl-edo-queens-suffer-extra-time-loss-to-tp-mazembe-in-semi-final/",
  "title": "CAF WCL : Edo Queens suffer extra time loss to TP Mazembe in semi - final",
  "date": "20241119T193000Z",
  "domain": "thecable.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Edo Queens were defeated 3-1 by TP Mazembe of the Democratic Republic of Congo in the semi-final of the 2024 CAF Women’s Champions League.\nThe Nigeria Women Football League (NWFL) champions surrendered a goal lead late in the game and were blown apart in extra time by the Congolese at the Stade Larbi Zaouli in Casablanca, Morocco, on Tuesday.\nEdo Queens qualified for the semi-final after a dramatic stoppage-time victory over Mamelodi Sundown. The team’s loss to Mazembe was just as climatic.\nA goalless first half in which the NWFL champions were the more enterprising side shifted into a dull performance in the early minutes of the second period. Edo Queens struggled to make a significant impact with their control of the game.\nAdvertisement\nThe Congolese wrestled the game and had a goal in the net before long, but the strike was chopped off after a video assistant referee (VAR) review.\nShortly after, Emem Peace put Edo Queens ahead with an inventive lob over the goalkeeper from a freekick that the Mazembe defenders poorly judged.\nThe strike was Emem’s third of the competition, and the Queens looked set to play in the final on Friday. But the Congolese struck back in the 90th minute.\nAdvertisement\nA corner kick floated into the NWFL champions’ goal area, and Marveille Nanguiji rose highest and guided her header into the net.\nThe Nigerian club capitulated after conceding the late equaliser. The Queens let in two more during the extra time, and their continental came to a painful end.\nEdo Queens will play the third-place match against the loser in their other semi-final match between AS FAR of Morocco and Egypt’s Masser.\nAdvertisement",
  "word_count": 278,
  "scraped_at": "2026-02-14T02:08:26.318611",
  "_text_extracted": true
}