{
  "article_id": "dd5316af104f",
  "url": "https://www.prokerala.com/news/articles/a1670324.html",
  "title": "Ederson leaves Man City after 8 years to join Fenerbahce",
  "date": "20250902T094500Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Istanbul, Sep 2 : Brazil goalkeeper Ederson has left Manchester City after eight trophy-laden years at the Etihad Stadium to join Turkish side Fenerbahce.\n\"The club has reached an agreement with Manchester City for the transfer of Brazilian goalkeeper Ederson. The player has been brought to Istanbul for the completion of official signatures,\" Fenerbahce said in a social media post.\nEderson is one of the most successful players in Manchester City's history, winning 18 major honours under Pep Guardiola. That haul comprises six Premier Leagues, two FA Cups, four League Cups, three Community Shields and our first-ever Champions League, UEFA Super Cup and FIFA Club World Cup successes.\nAfter arriving in Manchester ahead of the 2017/18 season, he went on to play 372 times across all competitions as Guardiola's first choice between the sticks in Premier League and Champions League football. No goalkeeper has ever kept more Premier League clean sheets for City than the Brazilian, with his 122 coming in 276 league appearances.\nReflecting on his City career, Ederson said, \"I leave Manchester City incredibly proud of what we have achieved together, and I am honoured to have worn the shirt so many times. Under Pep, we have dominated the Premier League and conquered Europe. It has been amazing.\n\"I would first of all like to thank him and Head of Goalkeeping Xabier Mancisidor for making me the best goalkeeper I could be and teaching so much about the game. I must also thank my teammates. Our desire to win every game we play has been a joy to be a part of and that has made me relish every day on the training field or in the dressing room with every one of you.\n\"I arrived in Manchester eight years ago full of hope, but I could not have predicted such a beautiful time together. Playing for City has been the most special time of my life and I will always be a fan of this special club. I'm going with my wife and children, but I'm leaving a big family here, Cityzens. Once a Blue, always a Blue.\"\nEderson was also the recipient of three Golden Glove awards, the prestigious prize awarded to the goalkeeper with the most Premier League clean sheets. He won the award outright in both 2019-20 and 2020-21, and shared the 2021-22 award with Alisson Becker after both goalkeepers registered 20 clean sheets.",
  "word_count": 400,
  "scraped_at": "2026-02-14T01:58:57.497460",
  "_text_extracted": true
}