{
  "article_id": "dd63671ea7fe",
  "url": "https://dailyexpress.com.my/news/249202/making-impact-on-local-world-stage/",
  "title": "Making impact on local , world stage",
  "date": "20241231T063000Z",
  "domain": "dailyexpress.com.my",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Bernard created history by winning the State’s first-ever medal (bronze) at the Paris Games.\nMuaythai exponents (From left) Myra, Jezzevelle, Angie and Asyraf.\nAngie Yan Jia Chi proved her success last year at the same meet in Bangkok, Thailand was no fluke as she successfully defended the female Under-23 wai kru title.\n11-year-old Eldaniella Mayriebel Eldainka was also awarded the Ifma rising star award (Muaythai).\n11-year-old Eldaniella Mayriebel Eldainka was another up and coming muaythai exponent that put Sabah on the world map at the Muaythai Youth World Championship held in Bangkok. She won the female combat 10-11 years’ title in the 40kg category and she was also awarded the Ifma rising star award. In addition, two more golds were also won by fellow Sabahans Sheryca Dyna Aby Jasli in the female wai kru 14-15 category and Katiana Funda Kara in the female wai kru 10-11 category at the same championship.Swimmer Ethan Khoo made the State and country proud with his third place finish.\nSwimmer Ethan Khoo was another para athlete who made the state and country proud with his third place finish in the S14 category’s 400m freestyle at the Citi Para Swimming World Series held in Singapore. On the local front, Sabah para athletes were crowned overall champions in the National Para Athletics Championship held at the Bukit Jalil Mini Stadium in June by winning a total of 43 golds, 14 silvers and six bronzes to top the medal standing.\nShahafiq Abdullah was named best male athlete after the 20-year-old swimmer won four gold medals as well as setting four national records.\nAt the Sarawak Para Sukma Games, Shahafiq Abdullah was named best male athlete after the 20-year-old swimmer won four gold medals as well as setting four national records in the men’s 50m freestyle S6, 100m backstrokes S5/S6, 50m butterfly S6/S7 and 100m freestyle S6 events. However, the state contingent failed to defend their overall title despite surpassing their early target with their total haul of 62 gold, 42 silver and 32 bronze medals to finish second behind host Sarawak. State deaf athletes also shine on the world stage with Danial Allex Bobax Alex taking home two bronze medals in the men’s 4 x 100m and 4 x 400m relay events at the World Deaf Youth Athletics Championship in Chinese Taipei, while at the Asia Pacific Deaf Games held in Kuala Lumpur, Sabah athletes contributed one gold, one silver and four bronze medals to the National contingent. The gold medal was won by Ainnur Asyikin Jupineh @ Juppe in the women’s chess event and the silver came from Aidil A. Affifal Juakim and Aidil A. Asyraff Juakim in the men’s men’s 4x400m relay , while the bronze medallists were Huwainaa Danduan Abdullah ((women’s team tenpin bowling), Ho Choon Seong (men’s team tenpin bowling), Azlan Kuste (men’s 10,000m), Hairul Hakimi Jaeri and Trisya Rafael (badminton team event). The state contingent also captured the overall title for the first time in the National Deaf Athletics Championship with eight gold, seven silver and five bronze medals. Despite the early optimism of obtaining 40 gold medals at the XXI Sarawak Sukma Games , the state contingent fell well short of the target as they only managed 29 gold, 36 silver and 55 bronze medals and had to settle in eighth position. However, squash player Yee Xin Ying created history by winning Sabah’s first ever Sukma gold medal in squash by beating Sehveetrraa Kumar from Kedah in five sets in the final to take the women’s singles title. She had earlier also upset national champion AIra Azman in the semi-final with another five sets victory. Sabah Karate Association (SKA) maintained their status as one of the powerhouses in the country by successfully defended their overall title at the 32nd Makaf National Cadet, Junior and Under-21 Karate Championship with eight gold, 12 silver and 12 bronze medals as well as winning the teams’ event in the 23rd Milo Open Karate Championship 2024 after taking home 17 gold, nine silver and 27 bronze medals. In football, Sabah Football Association Women team became the first team from Malaysia to make it to the AFC Women’s Champions League’s group stage held in Wuhan, China. They defied the odds with an upset 2-1 win over hot favourite AFC Nasaf 2-1 in the final group C tie of the preliminary rounds following earlier goalless draw with APF FC. In the group stage in Wuhan, the team started poorly with an opening 0-3 loss to Hyundai Steel Red Angels Women FC from Korea followed by a 0-7 thrashing by Wuhan Jangda before ending their campaign with an impressive 2-2 draw against Abu Dhabi Country Club of UAE. However, the team failed to defend their FAM Women’s League title with second place finish to Kelana United. The year also saw the departure of Datuk Ong Kim Swee as Sabah FC’s head coach in November after he declined to sign the short term contract extension offered by the management. Fitness coach Martin Stano took his place and all the backroom staff was also retained. Meanwhile, the Mount Kinabalu International Climbathon also made a return after a seven-year hiatus with 206 athletes taking part. Local runner Walter Herman and Sandi Menchi Abahan of the Philippines were crowned champions in the men’s and women’s elite categories respectively.",
  "word_count": 885,
  "scraped_at": "2026-02-14T02:08:26.307398",
  "_text_extracted": true
}