{
  "article_id": "dd78fb678a41",
  "url": "https://www.90min.com/posts/longest-unbeaten-runs-europe-english-teams",
  "title": "The longest unbeaten runs in Europe by English teams",
  "date": "20231007T203000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The longest unbeaten runs in Europe by English teams\n- Man City set a European record for 18 games unbeaten when they defeated Young Boys\n- Three other English clubs have gone 16 games unbeaten in Europe\n- West Ham had held the record after excelling in Europa Conference League\nOnly Spanish and Italian teams can point to more continental trophy triumphs in European football than English clubs.\nThe likes of Liverpool, Manchester United, Chelsea and Nottingham Forest have enjoyed success on the grandest stages of them all, but not all have put together unbeaten streaks on their way to glory.\nManchester City stormed to Champions League success in 2022/23 while West Ham put together a historic run to win the Europa Conference League.\nHere are the longest unbeaten runs from English sides in Europe.\nTottenham Hotspur - 16 games\n13 December 1967- 8 November 1972\nTottenham Hotspur's 16-game unbeaten European run spanned five years and two competitions.\nBill Nicholson's side began their impressive streak against Lyon by beating the French side 4-3 in 1967. Yet, the ultimate exponents of 'pass and run' football still exited the European Cup Winners' Cup on away goals after defeat in the first leg.\nThe run eventually came to an end when Olympiacos beat Spurs 1-0 in the UEFA Cup during the 1972/73 season. However, Tottenham had won the trophy the year before.\nThe Lilywhites had beaten AC Milan in the semi-final before conquering Wolverhampton Wanderers in the showpiece to lift only their second-ever European trophy in 1971/72, having spent several seasons outside of Europe previously.\nLeeds United - 16 games\n6 September 1967 - 27 November 1968\nDon Revie's Leeds were the first team to reach 16 games unbeaten in Europe, doing so during two seasons in the Inter-Cities Fairs Cup from 1967 to 1968. The streak began in the final of the competition in the 1966/67 season, a game they drew 0-0 with Dinamo Zagreb. However, the Croatian side had won the first leg 2-0 and claimed the cup.\nThe run eventually ended at the hands of Italian side Napoli in the second round of the competition two seasons later. Leeds won the Elland Road encounter 2-0, but lost by the same scoreline in Naples. In the end, the Whites qualified for the third round after a coin toss. Yes, really.\nWithin that run, Leeds did win the Fairs Cup in 1967/68, beating Hungarian side Ferencvaros 1-0 on aggregate across two legs - their only European trophy to this day.\nWest Ham - 17 games\n18 August 2022 - 5 October 2023\nWest Ham won their first European silverware since 1965 last season when they beat Fiorentina in the Europa Conference League final, with their joy on the continent not letting up this campaign either.\nTheir unexpected unbeaten run began with a victory over Viborg in the Conference League play-off round in August of last year and reached 17 matches with victory against Freiburg. The good times eventually came to an end in Greece as Olympiacos downed David Moyes' side.\nManchester City - 18 games (6 September 2022 - 7 November 2023)\nManchester City took the unbeaten record for themselves with a victory over Young Boys in November, reaching 18 games without a loss in Europe.\nPep Guardiola's side last lost in Europe against Real Madrid in the Champions League semi-final in May 2022, going unbeaten on their way to the trophy last season.\nThe stretch began with a convincing 4-0 victory over Sevilla in the opening group stage match of last season's Champions League. Despite playing the likes of Inter, Bayern Munich, Real Madrid, RB Leipzig and Borussia Dortmund, Pep Guardiola's men couldn't be stopped.\nIn 2023/24 City won their first four group stage games, with RB Leipzig, Red Star Belgrade and Young Boys all unable to down the treble winners as of yet.",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:07:14.743999",
  "_text_extracted": true
}