{
  "article_id": "dd7e9da88c0d",
  "url": "https://www.latinpost.com/articles/161231/20231017/lionel-messi-leak-reveals-8th-ballon-dor-argentina-superstar-details.htm",
  "title": "Lionel Messi Leak Reveals 8th Ballon dOr for Argentina Superstar : Details",
  "date": "20231018T060000Z",
  "domain": "latinpost.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionel Messi Leak Reveals 8th Ballon d'Or for Argentina Superstar: Details\nLionel Messi is set to clinch his eighth Ballon d'Or later this month, with the winners for the 2023 awards inadvertently revealed ahead of the official announcement, according to Mirror.\nMessi, aged 36, reached a pinnacle in his extraordinary career by leading Argentina to a World Cup victory in Qatar last year.\nFollowing his tenure with Barcelona and Paris Saint-Germain, the football megastar made a splash by joining Inter Miami in July, captivating Major League Soccer fans with his remarkable performances.\nAfter missing out on the 2022 Ballon d'Or, which was claimed by Karim Benzema, reports suggest that Messi has received confirmation of his triumph in the upcoming awards ceremony scheduled for Monday, October 30, in Paris.\nLionel Messi's anticipated victory will mark a historic moment, as it is the first time in the award's history that it will be presented to a player who primarily competes outside of Europe.\nAdditionally, it will place him three trophies ahead of his eternal rival, Cristiano Ronaldo.\nREAD NEXT : Is Lionel Messi Injured?\nLionel Messi's Eighth Ballon d'Or: A Near Certainty\nLionel Messi is the clear frontrunner to secure his eighth Ballon d'Or when the prestigious accolade for the world's finest footballer is bestowed for 2023, per Eurosport.\nIn December, the 36-year-old led Argentina to World Cup glory, marking their first triumph since 1986. While thirty players are included on the shortlist, Messi's victory appears almost certain, leaving little room for doubt.\nTop 3 Contenders to Watch\nErling Haaland: Undoubtedly Messi's closest rival for the trophy, Erling Haaland is the second-favorite according to bookmakers.\nThe Manchester City striker enjoyed a prolific 2022/23 season, netting 52 goals in 53 matches across all competitions, contributing to his team's triumph in the Premier League, Champions League, and FA Cup.\nKevin De Bruyne: Among Manchester City's Treble-winning squad, Belgian midfielder Kevin De Bruyne stands out as a strong contender to challenge Messi and Haaland.\nIn 2022, De Bruyne secured the third spot in the Ballon d'Or rankings with an impressive 41 goal involvements in 49 appearances across all competitions, including leading the Premier League in assists.\nKarim Benzema: The reigning Ballon d'Or winner from the previous year, Karim Benzema, deserves mention as one of the two players other than Lionel Messi and Cristiano Ronaldo to win the trophy since 2007.\nDespite his departure from Real Madrid to Al-Ittihad, Benzema remains a contender, having scored 31 goals in all competitions in his final season with the Spanish club.\nThe Intriguing Lionel Messi Saga with Manchester City\nLionel Messi's brief flirtation with a potential move to Manchester City, reuniting with Pep Guardiola, could have dramatically altered the course of his career and impacted David Beckham's pursuit of signing the superstar for Inter Miami, the Mirror noted.\nWhile Beckham eventually secured Messi's transfer to Inter Miami in a sensational summer deal, the football world was captivated by Messi's contemplation of joining Guardiola at Manchester City in 2020.\nThis possibility arose as Messi expressed his desire to leave Barcelona as a free agent, sparking a protracted transfer saga. Ultimately, Messi remained with Barcelona for one more season.\nHowever, had Messi chosen to make the move to the Premier League giants, it would have likely scuttled Beckham's aspirations of bringing him to Miami.\nIn that alternate scenario, Messi might have been enticed to join New York City FC after spending three years in Manchester.\nREAD MORE : Lionel Messi Net Worth 2023\nThis article is owned by Latin Post.\nWritten by: Bert Hoover\nWATCH: Messi WINS 8th Ballon d'Or 2023 - From WeTalkFootball\nSubscribe to Latin Post!\nSign up for our free newsletter for the Latest coverage!\n© 2026 Latin Post. All rights reserved. Do not reproduce without permission.",
  "word_count": 629,
  "scraped_at": "2026-02-14T01:51:09.235778",
  "_text_extracted": true
}