{
  "article_id": "ddb929163b16",
  "url": "https://metro.co.uk/2025/10/23/paul-merson-urges-enzo-maresca-drop-52m-chelsea-summer-signing-24510460/",
  "title": "Paul Merson urges Enzo Maresca to drop £52m Chelsea summer signing",
  "date": "20251024T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Merson has revealed his prediction for Chelsea’s Premier League clash with Sunderland and urged Enzo Maresca to drop Jamie Gittens.\nGittens had ‘his best game in a Chelsea shirt’ in the 5-1 Champions League victory over Ajax on Wednesday night, according to Merson.\nBut the former Arsenal and England winger still believes Gittens should come out of the side for Saturday’s clash against Sunderland as he views Pedro Neto as ‘first-choice’ down that flank.\nChelsea will look to win their fifth game in a row when Regis Le Bris’ impressive Black Cats visit Stamford Bridge.\nMaresca’s side suffered three defeats in the space of ten days last month but responded with wins over Benfica, Liverpool, Nottingham Forest and Ajax.\nDespite Chelsea’s red-hot form, Merson says he is not looking forward to the visit of Sunderland as the newly-promoted Premier League side are a ‘tough nut to crack’.\nHe does, though, expect Chelsea to clinch their fifth league win of the season and inflict just the third defeat for Sunderland in nine games since their return to the top-flight.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I was at Stamford Bridge for the game against Ajax in the Champions League,’ Merson told Sportskeeda. ‘It was a really young Chelsea team and I thought they did great in that 5-1 win.\n‘But when I look back at Chelsea’s 3-0 win over Nottingham Forest last Saturday, I think they were really fortunate. Forest had a lot of chances in that game.\n‘Sunderland basically have a free swing at Chelsea this weekend and that makes it a dangerous game for the hosts.\n‘Everyone will be expecting Chelsea to win at Stamford Bridge and that could work in favour of Sunderland, if they can punch above their weight like they’ve done all season.\n‘Sunderland are just six wins away from staying up in the Premier League and I think they will do it quite comfortably.\n‘What I noticed about Chelsea in their win over Ajax is that when Moises Caicedo came off, they were cut open through the middle like knife through butter.\n‘It just shows how good he is and no matter what happens, Caicedo has to play every week for Chelsea. I don’t put Declan Rice in that holding midfielder role because Martin Zubimendi plays there for Arsenal.\n‘So I can confidently say that Caicedo is the best in the world in that position at the moment. I can’t remember the last time he had a bad game.\n‘The biggest compliment I can give him is that no one even mentions his price-tag anymore!\n‘Chelsea should start Estevao, Joao Pedro and Pedro Neto as their front-three against Sunderland.\nMore Trending\n‘Jamie Gittens had his best game in a Chelsea shirt against Ajax but I just think Neto should be first-choice down that flank.\n‘As a Chelsea fan, the sooner we put this game behind us, the better because Sunderland are a tough nut to crack. I’m hoping for a hard-fought Chelsea win.’\nEngland U21 winger Gittens is yet to score for Chelsea since his £52m move from Borussia Dortmund in the summer.\nChelsea saw off competition from several clubs to sign the 21-year-old but he is yet to justify his hefty price-tag at Stamford Bridge.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Michael Owen’s Premier League title and top-four prediction: ‘They look strong!’\nMORE: Ruben Amorim agrees to sell Erik ten Hag’s £36.5m Man Utd signing\nMORE: Thiago Silva’s son defends Chelsea star who was ‘mocked’ on social media",
  "word_count": 649,
  "scraped_at": "2026-02-14T01:59:14.385342",
  "_text_extracted": true
}