{
  "article_id": "de012b59cb88",
  "url": "https://www.arsenal.com/news/preview-manchester-city-v-arsenal-1",
  "title": "Preview : Manchester City v Arsenal",
  "date": "20240330T141500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With international football parked until the summer, the Premier League season officially enters its final stretch which begins with us heading to Manchester to take on one of our title rivals.\nWe go into this encounter seeking a ninth consecutive league victory for the first time since March 2004, and with two wins under our belts against the reigning champions already this term, completing the hat-trick would be a huge boost for our title ambitions.\nTo do that though would require us to not only achieve our first win at the Etihad Stadium since 2015, but also end City’s 38-game unbeaten run on their own patch in all competitions.\nPre-match motivation\nAhead of the big game, we’re paying tribute to Arsenal supporters new and old who will be cheering us on, whether in the away end or tuning in from further afield.\nA new film starring musician and massive Gooner Hak Baker captures the magic of what makes following The Arsenal so special. In the piece, which was filmed in and around north London, the 33-year-old singer muses on the stories, songs and memories that go hand in hand with supporting the club.\nBaker will play his biggest London show yet at Somerset House on July 20, 2024 - buy your ticket now.\nCity eyeing more history\nWhile we may have leapfrogged Pep Guardiola’s team before the international break, City still head into this meeting in imperious form. They have lost just one of their last 20 Premier League games, and are unbeaten in 13 since a 1-0 loss at Aston Villa in December.\nSix-straight wins to start the campaign saw them top the fledgling table, but having initially recovered from back-to-back losses to Wolves and ourselves in the autumn, another run of one win in six saw them slip to fourth as they headed to Saudi Arabia to successfully claim the World Club Cup.\nSince their return, they have been virtually imperious, recording 15 wins in 17 matches in all competitions to sit a point behind us in third position, as well as reach the FA Cup semi-finals and the last eight of the Champions League. Guardiola will believe his team are perfectly poised to record an incredible double-Treble.\nWhat the managers say\nArteta: \"It’s a massive game for both teams, that’s for sure, because it will give us a huge push again if we go there and win it, but I still feel there is a long, long way after to make all the ground to win it.\n\"We have to embrace the moment, we need to go day-by-day, train really well and prepare for every match and see where this can take us. We’ve done a lot already to be in the position that we are in and now we have to embrace and enjoy the moment and go for it.\" - read every word from Mikel's pre-match press conference\nGuardiola: \"It's good to be here. The season has been really good with two trophies and, after what happened last season, being in contention for the three important titles of the season.\n\"It is the last 10 games of the Premier League so now we start the important time. We play the leaders at home with our people and I'm pretty sure they will give us what we need to perform our best.\n\"[Arsenal have] the same manager, new players. They control many aspects of the game. When you have consistency in terms of ideas and managers and the same patterns, at the end you always improve. When you change a lot of players and managers, it's very difficult.\"\nTeam news\nIt remains to be seen if Bukayo Saka and Gabriel are fit after they were forced to withdraw from the England and Brazil squads respectively through injury, with Arteta revealing he'll see if they can join in with training on Saturday before making a call on either.\nThe same goes for Gabriel Martinelli who also wasn’t available for his country due to the foot injury that caused him to sit out our most recent wins against Brentford and Porto, while Jurrien Timber continues to recover from his ACL injury picked up in August.\nCity suffered too during the international break as Kyle Walker was forced off with a tight hamstring during England’s loss to Brazil last week, and John Stones lasted just nine minutes against Belgium on Tuesday with a groin problem, with Guardiola revealing both will be out of Sunday's game.\nManuel Akanji also withdrew from the Switzerland squad but is expected to be OK, while Matheus Nunes missed Portugal’s clash with Sweden with an ankle complaint. The thigh problem Ederson picked up against Liverpool three weeks ago is improving but he is likely to be missing, while Kevin De Bruyne and Jack Grealish are back in training after remaining in Manchester rather than linking up with their nations.\nTalking tactics\nAdrian Clarke: Guardiola has turned to a 3-2-4-1 in key games so far in 2024, but he prefers a back four in games against us meaning he will likely set up in a 4-3-3 or 4-2-3-1.\nOn home turf and knowing how strong our spine is, I expect City to stretch play by targeting our full-back areas. Tricky winger Jeremy Doku will be stationed wide on the left, with Phil Foden sliding inside from the right to wreak havoc. How we handle those two slippery dangermen will have a huge impact on the outcome.\nRodri versus Declan Rice is another fascinating battleground. While they may not directly contest too many duels against one another, the midfield titan that shines brightest is unlikely to end up on the losing side.\nHowever, if our shape remains robust, we have the strength, pace and quality to hurt Guardiola’s side from turnover situations. In big games this term, City have been susceptible to direct attacks. Tottenham, Aston Villa and Liverpool all scored from quick counters against them, and our winner at Emirates Stadium stemmed from one long pass.\nStaying in the contest will be of critical importance. In games against the top five this season City have had a habit of fading from half-time onwards, conceding six goals and scoring just once. Like our two previous meetings this season, our substitutes could have a big say late on.\nFacts and stats\nWe have won our last eight Premier League games, scoring 33 goals and conceding just four. We have had three runs of 9+ consecutive victories within a single season in the competition, all coming during title-winning campaigns – 10 in 1997/98, 13 in 2001/02 and nine in 2003/04.\nManchester City have scored in each of their last 57 home games in all competitions, their longest such scoring streak in club history. Their 38-game unbeaten home run is the second-longest in their history, after a run of 42 between December 1919 and November 1921.\nWe have the most points (24), wins (8) and goals scored (33), the fewest goals conceded (4), the best goal difference (+29), the joint most clean sheets (4), and the lowest xG against figure (3.1) in the Premier League since the turn of the year.\nCity have won 12 of their last 13 Premier League games against us, though the exception was a 1-0 loss at Emirates Stadium in October. That means we can complete a first league double over City since 2007/08. We last did the league double over the reigning champions in 2001/02 against Manchester United.\nMan City have won each of their last five Premier League games against sides starting the day top of the table, with two of those wins coming against us last season. However, we have lost just one of our last six games against sides starting the day in the top three, with that sole defeat coming at Aston Villa in December.\nDe Bruyne has scored more goals against us than he has against any other opponent. He also has five assists against us.\nPhil Foden has had a hand in 11 goals across his last 12 Premier League appearances (7 goals, 4 assists).\nOnly Saka (16) has scored more goals for us in all competitions than Leandro Trossard (11). The Belgian has scored three goals against Man City, including the equaliser in the Community Shield back in August.\nMatch officials\nAnthony Taylor is the man in the middle for this clash, and this season we have registered crucial victories in his presence, beating Liverpool and Manchester United by 3-1 scorelines at Emirates Stadium. We have won 10 of the last 12 games Taylor has refereed, but that run does include the 3-1 home loss to City last year.\nSince that game, Guardiola’s team have won five of the six subsequent matches Taylor has been appointed to, the other being their 4-4 draw at Chelsea in November. No referee comes close to the 103 yellow cards and 11 penalties he has issued in his 20 Premier League appointments this season.\nReferee: Anthony Taylor\nAssistants: Gary Beswick, Adam Nunn\nFourth official: Tom Bramall\nVAR: Jarred Gillett\nAssistant VAR: Darren Cann\nRecent trips to the Etihad\nWe have lost each of our last seven league away games at Man City, and the last time we endured a longer losing run on the road in the league was against Leeds, recording eight in a row between 1958 and 1968.\nLast season saw us defeated at the venue twice - in April a De Bruyne brace plus strikes from Stones and Erling Haaland condemned us to a 4-1 defeat, which followed a narrow 1-0 reverse in the FA Cup fourth round in January when Nathan Ake grabbed the only goal.\nYou have to go back to May 2016 for the last time we got a result, when a late Alexis Sanchez equaliser earned us a point in a 2-2 draw, while the previous year was the occasion of our last win on City’s patch, which came when a Santi Cazorla penalty and an Olivier Giroud header took all three points.\nLook back on that game as well as other memorable wins against City with these five classic encounters\nLive coverage\nFor all the best Arsenal-related build-up to the big match, tune into Breakdown Live from an hour before kick-off as Nick Bright and Adrian Clarke perfectly prepare you for what is to come!\nThe duo will assess how we can find a way to end our long wait for a win in the blue half of Manchester by working out City’s strengths and weaknesses, while also staying across the Conti Cup final as our women’s team hope to claim silverware.\nThen from 4.30pm, they’ll hand over to Dan Roebuck and Josh James who will be inside the Etihad Stadium to provide live commentary of all the action.\nYou can also find out what broadcasters are showing the action live wherever you are in the world\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1841,
  "scraped_at": "2026-02-14T01:54:34.173237",
  "_text_extracted": true
}