{
  "article_id": "de09fb644c69",
  "url": "https://www.myjoyonline.com/slot-having-same-conversations-at-club-despite-form/",
  "title": "Slot having  same conversation at club despite form",
  "date": "20251128T010000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nUnder-pressure Liverpool manager Arne Slot says talks with the club's owners after the defeat by PSV Eindhoven were the \"same conversations\" he has had with them since arriving at Anfield, and they will \"fight on\".\nThe Dutch manager is under increasing pressure at Anfield after the Reds suffered a 4-1 defeat to PSV in the Champions League, their ninth loss in 12 games this season, making it their worst run in 71 years.\nAsked whether he had spoken to sporting director Richard Hughes or the ownership group after the game, Slot said: \"We've had the same conversations that we've had since I got here.\n\"We fight on. We try to improve, but the conversations have been the same as they have been for the last one and a half years.\"\nSlot helped Liverpool secure their 20th league title in May and spent almost £450m on new signings in the summer, including a British record £125m for Alexander Isak.\nHowever, the reigning champions are 12th in the Premier League with six wins and six defeats after 12 matches while they sit 13th in the 36-team league phase of the Champions League.\nAfter their latest defeat, former Reds defender Jamie Carragher said on CBS Sports that Liverpool are \"not a sacking club\" but \"it does get to a stage for any manager at a club where it's untenable\".\n\"There is a lot of pressure if you work or play at a top club,\" Slot said, speaking before the visit to West Ham on Sunday, 30 November (14:05 GMT).\n\"And then there is even more when you start losing more games than this club, players or the manager are used to. But there was pressure last season as well for us to win the league.\n\"But now it's a different kind of pressure because we have lost so many games.\n\"In the end, it's about doing what this club is about. Keep fighting no matter how difficult it is. It would also be nice if we reward ourselves in the moments we play well.\"\nSlot said he expects to welcome back goalkeeper Alisson from injury while also adding that the issue sustained by forward Hugo Ekitike against PSV \"shouldn't be a big issue.\"\n\"Alisson trained again [on Thursday] with the team, we hope and expect he is available at the weekend,\" the Dutchman said.\n\"[Florian] Wirtz will have his final day of rehab [on Friday] and if all goes well he can train with he team on Saturday.\"\nSlot's position not under threat - but concern about Salah\nSami Mokbel, Senior football correspondent\nDespite Liverpool's poor run of form, sources have told BBC Sport that Slot's position is not under imminent threat.\nHe has credit in the bank following his Premier League title-winning debut season, while there has been reflection at Anfield that it was a difficult summer of the club with Diogo Jota's death and the £400m investment attempting to regenerate the squad.\nSporting director Hughes and chief executive Michael Edwards were key in Slot's appointment, and the Dutchman retains their backing.\nLiverpool do not make snap decisions and afforded Brendan Rodgers more than three seasons as manager despite finishing outside the top four twice.\nThere is, however, internal concern about Mohamed Salah's performances, with a noticeable drop off in his form.\nHe is their key forward player but Liverpool's best attacking performance in the past 12 games came in a 5-1 win against Eintracht Frankfurt - a game Salah did not start.\nThe Egyptian has scored seven goals in 25 games since his new contract was announced in April, which would be viewed as a good return for some, but the 33-yar-old is judged by standards he has set during his eight years at the club.\nLooking ahead to January, Liverpool are interested in reviving their move for Crystal Palace defender Marc Guehi after missing out on the final day of the summer transfer window.\nGuehi, who is available for a free transfer in July but has multiple options in England and across Europe, is able to discuss the terms of his next contract with clubs from outside of England in just four weeks' time.\nWe'll fight back - Konate\nCentre-back Ibrahima Konate has been part of a Liverpool defence that has let in 20 goals in 12 league games this season and said: \"We know we need to improve\".\nThe 26-year-old France international, who will be out of contract in the summer, has been criticised for his lack of form during the present campaign.\nKonate missed the ball against PSV in an error which led to the Dutch side's third goal.\n\"We have to take this moment on the chest,\" he wrote on a social media.\n\"Criticism is part of football, and we'll fight back every time and come through this storm.\"\nLatest Stories\n-\nThis is not the time to settle political scores – Bawumia to government\n50 minutes -\n37% of SHS students exposed to drugs – Opare-Addo\n1 hour -\nNLC secures court injunction against striking tertiary unions\n2 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n2 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n2 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n3 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n3 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n4 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n4 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n5 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n5 hours -\nMasterMinds resources positions itself as key player in skills development and workforce training\n6 hours -\nINTERPOL has deleted Ofori-Atta’s Red Notice – Lawyers\n7 hours -\nSteven Spielberg donates $25,000 to James Van Der Beek’s $2m GoFundMe\n7 hours -\nSix possible effects of Trump’s climate policy change\n8 hours",
  "word_count": 1016,
  "scraped_at": "2026-02-14T02:03:26.521418",
  "_text_extracted": true
}