{
  "article_id": "de15f595ad02",
  "url": "https://www.prokerala.com/news/articles/a1395095.html",
  "title": "La Liga : Ancelotti shows faith in referees despite Barcelona scandal",
  "date": "20230225T070000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Madrid : , Feb 25 (IANS) Real Madrid coach Carlo Ancelotti has said he has faith in the honesty of referees in both Spain and Europe, despite recent revelations of a scandal involving FC Barcelona.\nSpeaking on the eve of the Madrid derby against local rivals Atletico Madrid, Ancelotti was asked about revelations that Barcelona had paid seven million euros over a period of 15 years to Jose Maria Enriquez Negreira, who was a referee between 1977 and 1992 and vice president of Spanish referees' committee between 1994 and 2018.\nAlthough Barca explained the payments were for technical reports and information about young players at other clubs, the revelations raise fears that the payments also helped the club receive favourable treatment from some referees over the period, reports Xinhua.\nWhen asked about the affair in his pre-game press conference on Friday, Ancelotti said he had faith in referees.\n\"There is no corruption here or in Europe. Referees make mistakes everywhere and if they make a mistake, you just have to accept it,\" he said.\n\"I get angry sometimes, but I am super convinced that at this moment there is no corruption in the world of football,\" he insisted.\nAncelotti also looked ahead of Saturday's game, which comes five days after his side beat Liverpool 5-2 in the first leg of their Champions League last-16 clash.\n\"The team is looking good. We left the Champions League match with good feelings and a good dynamic. It will be a special game (against Atletico), against a team that is in good form. It will be a beautiful game,\" he said.",
  "word_count": 267,
  "scraped_at": "2026-02-14T02:24:32.664509",
  "_text_extracted": true
}