{
  "article_id": "de22c5250e30",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/uefa-given-one-week-pay-26283079",
  "title": "UEFA given one - week to pay compensation to Liverpool FC fans after final chaos",
  "date": "20230220T183000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA given one-week to pay compensation to Liverpool FC fans after final chaos\nBinghams Solicitors and Pogust Goodhead sent a letter last Friday calling on UEFA to compensate fans caught in the chaotic scenes at last year's Champions League final\nLaw firms representing more than 1,000 Liverpool fans who suffered traumatic injuries during last year's Champions League final have given UEFA a week to pay compensation or face legal proceedings.\nAn independent report commissioned by UEFA following the final at Paris' Stade de France said the governing body was held \"primary responsibility\" for the chaotic scenes. The match between Liverpool and Real Madrid will be remembered for the scenes before and after - where fans were crushed at the entry, tear gassed by police, and robbed by local gangs.\nThe report - prepared following a six-month investigation and chaired by Portuguese politician Tiago Brandão Rodrigues - contains a large section criticising how UEFA attempted to shift blame in the days and weeks after the final, in public statements, press releases and during hearings at the French senate. The report stated UEFA sought to \"avoid accountability for the failures which almost led to catastrophe.\"\nREAD MORE: Woman funded life of Louis Vuitton handbags and foreign holidays by selling drugs\nUEFA apologised to both sets of fans but has not accepted the responsibility. UEFA's president Aleksander Ceferin has not made any comment on the report.\nThousands of Liverpool fans intend to sue UEFA for compensation, the ECHO understands. Last Friday, Binghams Solicitors, Liverpool-based personal injury experts, and group litigation experts Pogust Goodhead notified UEFA that legal claims would be escalated unless it takes responsibility. The letter was addressed directly to Mr Ceferin and UEFA's general counsel Simon Drake.\nGerard Long, managing director at Binghams Solicitors, called on UEFA to \"do the right thing\" and communicate with the lawyers. Mr Long said: \"We are hearing, daily, how much upset and frustration delays and lack of transparency causes. Missed deadlines and silence only adds further distress and harm to people that have already suffered a great deal.\n\"Engaging in positive conversations and committing to a timeline of next steps will demonstrate to our clients that their voices are being heard with compassion and that UEFA possess the desire to do the right thing.\"\nThe letter, seen by the ECHO, explained the law firms were writing on behalf of over 1,000 Liverpool fans - and a further 1,000 had registered expressions of interest. The firms told UEFA a letter before action, setting out the extent of the harm suffered by fans, would be served if the governing body did not give at least an initial response by Friday, February 24.\nThe letter said: \"We felt that it was prudent to wait for the release of the UCLF22 Independent Review (the UCLF22 Report) before formally notifying you of our clients’ claims against UEFA. The UCLF22 Report, which was released on 13 February 2023, after being leaked to the media, only confirms the advice we have received to date, which was that UEFA was primarily responsible for the events that took place at the 2022 Champions League Final (and is liable to pay damages to those who suffered) and that the Liverpool fans were blameless. On that basis it is our intention to proceed with our clients’ action against UEFA.\"\nThe letter continued: \"We invite you to confirm that UEFA will accept full responsibility for the events that occurred at the 2022 Champions League Final including, as a matter of principle, liability to pay compensation for the loss and harm suffered by our clients (and all Liverpool fans affected).\"\nBinghams and Pogust Goodhead said UEFA's confirmation would \"avoid protracted and costly litigation\", as well as the \"inevitable further bad publicity\" that would be caused.\nTony Winterburn, partner at Pogust Goodhead, said: \"If UEFA are sincere in their apologies to Liverpool fans and their commitment to making football a safe place for all to attend, we believe they will respond positively to our letter today (Friday 17 February) and begin talks with no further delays. Redress must go further than simply compensating fans for the cost of a football ticket. The extent and widespread suffering must be recognised by UEFA and President Aleksander Ceferin, before our clients will attain any level of satisfaction.\"\nReceive newsletters with the latest news, sport and what's on updates from the Liverpool ECHO by signing up here.\nREAD NEXT:\nWoman 'humiliated' when station staff approached her\nNicola Bulley's partner shares 'agony' after body found in river\nEerie glimpse inside 'creepy' abandoned school left to rot\n'Scarface', paedophile and injured burglar among 11 criminals jailed this week",
  "word_count": 773,
  "scraped_at": "2026-02-14T01:36:52.737920",
  "_text_extracted": true
}