{
  "article_id": "de28d6405046",
  "url": "https://www.broadcastnow.co.uk/broadcasting/bbc-secures-fa-cup-rights/5193412.article",
  "title": "BBC secures FA Cup rights",
  "date": "20240514T151500Z",
  "domain": "broadcastnow.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "BBC will continue as free-to-air broadcaster alongside TNT’s pay-TV deal\nBBC Sport has secured the free-to-air rights to the men’s FA Cup for four years from the 2025-26 season.\nThe BBC will show 14 games through the season, comprising of two live matches from each round through to the quarter-finals, one semi-final and then the final. It will also have highlights and digital clips across its platforms.\nTNT Sports will air live matches from the First Round, and then every game from the Third Round onwards outside of 3pm kick offs - after agreeing a deal earlier this year. It had previously announced its intention to sell on free-to-air rights for selected matches.\nThe BBC and ITV currently show the competition, which had previously been shared between TNT’s predecessor BT Sport and the BBC before this.\nInterim director of BBC Sport Philip Bernie said: “The BBC has a proud history of bringing fans across the nation together for all the magic and drama of the FA Cup. This partnership for the next four years is brilliant news and, alongside our recent Premier League extension and UEFA Champions League highlights coming this year, means that BBC Sport will deliver fans top class analysis, commentary and coverage of the biggest football competitions free to air and accessible for all.”\nTrojan Paillot, SVP sports rights acquisitions and syndication at WBD Sports Europe, said: “TNT Sports will broadcast every single game outside of 3pm kick-offs, starting from the first round, ensuring fans can watch more of the Emirates FA Cup than ever before all in one place.”\n“Our ambition is to make more of the live Emirates FA Cup action available to fans than ever before, so the BBC are an outstanding partner to ensure that alongside more games we also make the competition as widely available as possible.”\nMark Bullingham, FA chief executive, said: “We are delighted that the BBC will continue as one of our Emirates FA Cup broadcast partners, under this new deal with TNT Sports. It was always our intention to ensure that this very special competition would be accessible for everyone, and this new broadcast partnership will enable fans to see more of its matches live than ever before from the start of the 2025-26 season, across both TNT Sports and free-to-air on the BBC. The BBC has told many of the magical and memorable stories that only the Emirates FA Cup can create, and we look forward to making even more history together in the years ahead.”",
  "word_count": 419,
  "scraped_at": "2026-02-14T02:05:12.745037",
  "_text_extracted": true
}