{
  "article_id": "de4d72c419fa",
  "url": "https://metro.co.uk/2025/12/16/ruben-amorims-18m-signing-will-help-man-utd-win-premier-league-25524749/",
  "title": "Ruben Amorim £18m signing will  help Man Utd win the Premier League  ",
  "date": "20251216T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mark Bosnich believes a bargain Ruben Amorim signing can help Manchester United return to their former glories and win the Premier League for the first time in the post-Sir Alex Ferguson era.\nThe Red Devils spent almost £200m on three attacking players last summer, bringing Bryan Mbeumo, Matheus Cunha and Benjamin Sesko to Old Trafford.\nBut Bosnich reckons Amorim’s last signing of the summer – Senne Lammens – has ‘solved a big piece of the puzzle’ for United and can be the ‘foundation’ of a ‘title-winning side’.\nManchester United spent an initial £18.2m to sign Belgium goalkeeper Lammens from Royal Antwerp on transfer deadline day.\nLammens was expected to challenge for a place in the team over the course of this season but quickly established himself as Amorim’s No. 1 ahead of Altay Bayindir and Andre Onana, who was sent out on loan.\nUnited have been far from tight at the back this season – conceding 26 goals in 16 league games, including four in Monday’s 4-4 draw with Bournemouth – but Bosnich has nevertheless been impressed by Lammens.\nBosnich expects Lammens to be his former club’s ‘long-term keeper’ and says the 23-year-old ‘reminds him’ of superstar shot-stopper Thibault Courtois.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Playing in the Premier League catches a lot of foreign keepers out when they first arrive,’ Bosnich told the Daily Mail. ‘It’s completely different.\n‘It’s the fastest, it’s the most intense, it’s the most difficult in terms of the aerial challenge. And you don’t get the protection from referees that you do on the continent.\n‘But Lammens has been outstanding since he arrived. Look, Peter [Schmeichel] and Edwin [van der Saw], they had their tough moments, as you do over a period of time.\n‘But they backed up their talent with a series of outstanding performances and I believe Lammens is already showing that he has that kind of talent, too.\n‘Onana was excellent at Inter. They had just got to the Champions League final with Inter. But he also had brilliant defenders in front of him there. He was very, very well protected.\n‘And then he came to United and he didn’t have that situation in front of him and he wasn’t as well protected and you have the combative style of the Premier League and Onana struggled to assert himself.\n‘I don’t see Lammens having those problems. He’s only 23 but he’s already proved he can deal with whatever’s thrown at him.\n‘He’s very, very good with his feet. He reminds me a bit of Thibault Courtois, who’s Belgian as well, of course. He has settled in very quickly.\n‘He’s young but I think United have got their long-term keeper now. He’s already adjusted to the pace and dynamic nature of the English game.\n‘The fact that there’s a precedent for him, that Courtois succeeded at Chelsea, is going to be important, too.’\nBosnich, who played for Aston Villa and Chelsea as well as Manchester United, added: ‘His shot-stopping is good and he is good on the ball.\n‘But I think this is the key: there is a lot of talk now about how important set-plays have become in the Premier League and that means it is equally important that you have a goalkeeper who is not intimidated by set-plays.\n‘The thing I really like about Lammens is that he dominates his box. Going way back, Bruce Grobbelaar was exceptional at doing that in those great Liverpool sides of the 1980s and Schmeichel was, too.\n‘It’s so important for a keeper to have that quality because it inspires confidence in the entire defence. If you know he is going to come, that creates certainty in a defence.\n‘It lifts the performance of the entire back four. It even spreads confidence in the crowd and that can transmit itself to the players.\n‘These days, defenders don’t mind anything on the ground. That’s what they’re built for. That’s what they’re equipped for.\n‘Defenders are skilful and they are quick. But it’s when teams start playing high balls in that it gets difficult. And that’s why Lammens can be so important.\n‘It’s a big piece of the puzzle that they have solved with his signing. The uncertainty around the goalkeeping position was an obstacle to the progress United need to make.\nMore Trending\n‘Now that they’ve found a solution in Lammens, I think it can help to be the foundation for them finally to have another title-winning side.’\nManchester United have not won the Premier League since Ferguson’s retirement in 2013, finishing as low as 15th last season.\nUnited have twice finished as runners-up in this fallow period, doing so under Jose Mourinho in 2017-18 and Ole Gunnar Solskjaer in 2020-21.\nAn entertaining but ultimately frustrating 4-4 draw with Bournemouth last time out leaves the Red Devils sixth in the Premier League, two points outside the Champions League places.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Mikel Arteta urged to start £52m star to fix worrying Arsenal problem\nMORE: John Terry tells Enzo Maresca to sign Chelsea legend on free transfer in January window\nMORE: How Ruben Amorim made the biggest mistake of Man Utd career before Bournemouth thriller",
  "word_count": 927,
  "scraped_at": "2026-02-14T01:59:31.523427",
  "_text_extracted": true
}