{
  "article_id": "de56a5f5491d",
  "url": "https://www.espn.com/soccer/english-fa-cup/story/4848665/english-fa-cup-shocks-overshadow-premier-league-sides-phoning-it-in",
  "title": "English FA Cup shocks overshadow Premier League sides phoning it in",
  "date": "20230110T004500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Long ago, deep in the mists of time, England would come to a standstill on a May afternoon for the FA Cup final. It was by far the biggest game of the season, and TV offered devoted, dawn-to-dusk coverage.\nHelicopters would follow the teams to Wembley almost like a state occasion, a day on which the glamour trophy every club craved was won and lost. A crowd of exactly 100,000 wearing rosettes -- this was so long ago that replica shirts had not yet been invented -- would gather at the iconic national stadium, where the lush, manicured green surface contrasted starkly with the mud heaps on which most league matches were played up until the year 2000.\nThose old finals entered football folklore, and by the time the TV, radio and newspapers had finished, the nation knew the life story of every player and what they had eaten for breakfast that morning. So how has the oldest and most famous domestic cup competition in the world been allowed to fall into such a sad state, with many Premier League managers treating it as a sideshow played out in half-full stadiums?\nIn the 1970-71 season, crowds to watch the FA Cup went over 3 million in total for the competition, with packed houses up and down the country. Those attendances have dropped by nearly 50% over the past half-century; it's hard to escape the conclusion that fans, seeing the kind of depleted lineups that many top-flight clubs put on the pitch, are saying \"well, if you don't care too much about this competition, why should we?\"\nIt feels as though the \"magic\" of the cup has become a myth. It is still there for teams from the lower divisions, for whom the prize money and potential fees for live TV coverage can by a lifesaver, but for Premier League teams, such money pales by comparison to the vast riches that can be earned just by staying in the Premier League.\nFor public consumption, managers pay lip service to the competition at their news conferences, but their team selections tell a different story.\nYou would think that Newcastle United, a club without a domestic trophy since 1955, would be aching to see their vastly improved team win the FA Cup and with the money and players now at their disposal, it would have been a realistic ambition this season. But Eddie Howe made eight changes against the in-form League One team Sheffield Wednesday and saw his team lose 2-1 at Hillsborough. It was a miscalculation as Josh Windass grabbed the headlines with two goals.\nHowe tried to rescue the game by introducing first-team stars Bruno Guimaraes, Joe Willock and Miguel Almiron from the bench. They made a difference, but it was too late.\nA sheepish Howe -- and perhaps his first false step as Newcastle boss -- admitted afterwards that \"obviously with the result and the benefit of hindsight, we could have done things differently. But we have a small squad and we have to protect that squad for the games ahead. We felt we were strong enough to win the game.\"\nThey were not.\nAston Villa were another team to find out their squad players are not really good enough. Also making eight changes, they conceded two dramatically late goals to give their fourth-tier opponents, League Two side Stevenage FC, a memorable win at Villa Park. You have to ask yourself why midtable Villa would not go all out for cup glory and a much-needed piece of silverware. Instead, they go out in Round 3 for the seventh successive year and only have themselves to blame. A day to forget for manager Unai Emery.\n- English FA Cup: Watch live games, highlights, replays on ESPN+\nPerhaps you can excuse Nottingham Forest for feeling like they needed to keep their best players fresh for a relegation fight. They changed all 11 players and lost 4-1 at struggling Championship team Blackpool.\nLeeds, another team worrying about their top-flight status, rotated the team heavily, played without their usual intensity and found themselves 2-0 down at Cardiff City, who can hardly buy a goal in the Championship. Credit to Jesse Marsch's team for fighting back to get a replay, but had they played their normal team and won, they would have saved themselves from adding another game to a punishing schedule.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nChelsea's best player in Thursday's league defeat to Manchester City was midfielder Denis Zakaria, but Graham Potter strangely decided to rest him from the return match in the FA Cup in Manchester on Sunday. There was a debut for youngster Bashir Humphreys in defence and a place for promising Lewis Hall at left-back, but you looked at the Chelsea XI before the game and could not like their chances. So it proved, as City hammered them 4-0.\nIn fairness, Chelsea were badly hit by injuries, but was this really the best team they could field against such strong opposition, especially as Potter needed a result to steady the ship?\nTottenham, who last won the FA Cup in 1991 when Gary Lineker was still playing, took the bold choice to start Harry Kane against third-tier Portsmouth. Just as well, too, as he produced a superb winner to foil a gutsy effort by Pompey, who took nearly 9,000 fans to North London even with a rail strike impacting travel.\nOne manager who was paying due homage and respect to the history and tradition of the FA Cup was Erik ten Hag, and in his first season in English football, no less. He wants to deliver a trophy for Manchester United and fielded a very strong team against Everton, winning 3-1. With that committed approach, United could have a big run.\nOverall, there is an undeniable feeling that most top-flight managers have developed a \"take it or leave it\" approach to a competition that, even now, always captures the imagination at this time every year. You only had to witness what it meant for Sheffield Wednesday, Stevenage and non-league Wrexham -- 4-3 winners away to second-tier Coventry City -- and Chesterfield, who came within seconds of beating West Bromwich Albion in their thrilling 3-3 draw. Those fantastic stories underlined why the Cup, which goes back more than 150 years, still retains a modern relevance and resonance. It just needs to be given a little more love and attention.\nFor too many clubs though, the cynical priority is getting to the safety figure of 40 points in the English top flight or chasing a place in the top four. It's hard to argue against it from a purely financial standpoint, but where is the romance in that? Imagine a day 40 years from now as an ex-player sits his grandson on his knee. What is the lad going to be most excited by: a story of how his grandad made the top four, or a romantic tale about day he won the FA Cup and kissed it at Wembley?\nWe need to debate how this cherished Cup can be restored to its rightful place in the nation's hearts. It's worth debating whether to hand the Wembley winners a place in the Champions League, rather than to the team that finishes fourth in the Premier League? Imagine what a massive match the FA Cup Final would become all over again if the stakes were that high.\nSadly for sentimental dreamers like me, it is never going to happen as the big clubs at the top of the English game will see to that. But is their collective self-interest in the best interest of the game?",
  "word_count": 1275,
  "scraped_at": "2026-02-14T02:29:04.532032",
  "_text_extracted": true
}