{
  "article_id": "de6485bb2c7e",
  "url": "https://www.jamaicaobserver.com/2024/04/21/bailey-hits-10th-goal-epl-season-aston-villa-tighten-grip-top-four/",
  "title": "Bailey hits 10th goal of EPL season as Aston Villa tighten grip on top four",
  "date": "20240421T194500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bailey hits 10th goal of EPL season as Aston Villa tighten grip on top four\nUNITED KINGDOM (AFP) — Jamaican winger Leon Bailey scored one and assisted another as Aston Villa tightened their grip on Champions League football next season with a 3-1 win over Bournemouth on Sunday.\nVilla shrugged off the exertions of having to go to extra-time and penalties in midweek to book their place in the Europa Conference League semi-finals against Lille.\nUnai Emery’s men even had to come from behind after Dominic Solanke opened the scoring from the penalty spot.\nMorgan Rogers’ fine finish after an excellent pass from Bailey just before half-time proved to be the turning point.\nMoussa Diaby slotted in from Ollie Watkins’ pass to put Villa in front.\nWatkins was the provider once more for Bailey to tap in to seal the points 12 minutes from time. It was Bailey’s 10th goal of the English Premier League campaign and 14th in all competitions this season.\nVictory takes Villa six points clear of fifth-placed Tottenham.\nSpurs have two games in hand but still have to play all of title challengers Manchester City, Arsenal and Liverpool in their final six matches.\n– Forest enraged –\nMeanwhile, Nottingham Forest launched an astonishing rant at the officiating in their 2-0 defeat to Everton.\nEverton took a giant stride towards extending their 70-year stay in the English top-flight in a highly controversial victory.\nIdrissa Gueye and Dwight McNeil scored the goals that took the Toffees five points clear of the relegation zone.\nForest remain just one point above the bottom three and were left dismayed at being denied three strong penalty appeals.\nThe club’s official account on social media platform X called into question the Premier League’s integrity by claiming the VAR official is a fan of relegation rivals Luton.\n“We warned the PGMOL (referees’ governing body) that the VAR is a Luton fan before the game but they didn’t change him,” Forest said in a statement said.\n“Our patience has been tested multiple times. NFFC will now consider its options.”\nDavid Moyes’ future as West Ham manager looks more uncertain after they were thrashed 5-2 at Crystal Palace.\nFresh from their shock 1-0 win at Liverpool last weekend, the Eagles scored four times inside the first 31 minutes.\nMichael Olise headed in the opener before Eberechi Eze’s spectacular acrobatic effort found the roof of the net.\nEmerson Palmieri’s own goal made it 3-0 before Jean-Philippe Mateta struck twice for Palace either side of half-time.\nMichail Antonio’s strike and a Tyrick Mitchell own goal was scant consolation for West Ham as a miserable day rounded off a poor week after they were dumped out of the Europa League by Bayer Leverkusen.\nThe Hammers could have gone sixth with victory but now need a reaction to finish even in the top 10 having played more games than the sides around them.\nLiverpool are aiming to get their title challenge back on track later when Jurgen Klopp’s men visit Fulham.\nVictory will take the Reds level on points with leaders Arsenal.\nKlopp has responded to signs of fatigue from his side in recent weeks by dropping Mohamed Salah to the bench among five changes.",
  "word_count": 535,
  "scraped_at": "2026-02-14T02:07:51.322276",
  "_text_extracted": true
}