{
  "article_id": "de689b95b6de",
  "url": "https://metro.co.uk/2024/10/01/man-utds-40m-flop-admits-almost-gave-up-nightmare-move-21716295/",
  "title": "Man Utd £40m flop admits he  almost gave up  after nightmare move | Football",
  "date": "20241001T193000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United midfielder Donny van de Beek revealed he considered quitting football entirely during his torrid time at Old Trafford.\nThe Red Devils splashed out a huge fee to sign the Dutch midfielder from Ajax in 2020 but he never managed to pin down a regular starting berth at the club in a spell marred by injury and bad form.\nVan de Beek made a total of 62 appearances for United but notched up just two goals and two assists in his entire time at Old Trafford.\nAfter unsuccessful loans at Everton and Eintracht Frankfurt, Van de Beek was afforded a fresh start at Spanish side Girona in July but said, at times, he considered stepping away from the professional ranks altogether.\n‘I don’t like to talk about the past. I’ve been getting fit and feeling good for a few weeks now,’ he reflected ahead of his side’s Champions League clash with Feyenoord on Wednesday. ‘Now I feel in a good moment.\n‘I have had many hard knocks in my career. Now I feel like I’m starting a new stage at a fantastic club. We play very well and it’s a big challenge for me. I want to keep improving.\n‘There have been moments when I was about to give up everything, but the family helped me to continue believing in myself.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘They have convinced me that I have to do what I like and that fills me up, which is to play football.’\nSince the move to Spain, however, Van de Beek has struggled for regular minutes and made his first league start just last weekend in a 1-1 draw with Celta Viga.\nMore Trending\nAnd according to reports in Spain, the 27-year-old arrived ‘blighted by physical problems’ due to his lack of game time at Old Trafford.\nVan de Beek’s issues are not just physical, though, with the player also ‘having problems adapting’ to the tactics of his new manager Michel.\nGirona are gearing up for their first-ever home match in the Champions League having earned their place in the competition with an unlikely third-place finish in La Liga last season.\nThe Spanish side lost their opening game of the competition 1-0 against Paris Saint-Germain.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Premier League make final decision on Bruno Fernandes’ controversial red card\nMORE: Kobbie Mainoo and Alejandro Garnacho have ‘Manchester United DNA’, says Patrice Evra",
  "word_count": 468,
  "scraped_at": "2026-02-14T01:54:48.967526",
  "_text_extracted": true
}