{
  "article_id": "de68c659c2d0",
  "url": "https://www.the42.ie/manchester-city-goalkeeper-6805218-Sep2025/",
  "title": "Gianluigi Donnarumma completes Manchester City move as Ederson leaves for Turkey",
  "date": "20250902T104500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MANCHESTER CITY HAVE confirmed the signing of Italy goalkeeper Gianluigi Donnarumma from Paris St Germain, with Ederson ending his eight-year stint at the club with a move to Fenerbahce.\nThe 26-year-old has been on the lookout for the right move after his omission from PSG’s Super Cup squad made it clear to him he was no longer their first-choice goalkeeper.\nDonnarumma has signed for an undisclosed fee, understood to be in the region of 35 million euro (£30.4m), and City confirmed he had signed a five-year contract.\nDonnarumma, who will wear the number 99 shirt at City, was part of the PSG team which won the Champions League last season, and was in goal for Italy when they won Euro 2020.\n“To have signed for Manchester City is such a special and proud moment for me.\n“I am joining a squad packed with world-class talent and a team led by the one of the greatest managers in the history of football in Pep Guardiola. This is a club every player in world football would love to join.\n“I have admired watching Manchester City for many years – so to now be able to play for the club is a huge honour and a privilege. I cannot wait to meet my new team-mates, the staff and the fans.\n“Playing at the Etihad Stadium will be very, very special for me. I am very excited for what lies ahead and can promise that I will give absolutely everything to try and help the club achieve even more success.”\nMeanwhile, Ederson has completed a move to Turkish side Fenerbahce following eight “amazing” years at City.\nThank you, Ederson pic.twitter.com/r40KhhUn7r\n— Manchester City (@ManCity) September 2, 2025\nThe 31-year-old goalkeeper leaves the Etihad Stadium having helped the club to 18 major honours during his time at the club, including six Premier League titles, two FA Cups, four League Cups and a Champions League.\nThe Brazilian also won the Golden Glove award three times.\nEderson told the club’s website: “I leave incredibly proud of what we have achieved together, and I am honoured to have worn the shirt so many times.\n“Under (head coach) Pep (Guardiola), we have dominated the Premier League and conquered Europe. It has been amazing.\n“I arrived in Manchester eight years ago full of hope, but I could not have predicted such a beautiful time together.\n“Playing for City has been the most special time of my life and I will always be a fan of this special club.”\nCity have also confirmed the exit of Swiss defender Manuel Akanji to Inter Milan on a season-long loan.\nCrystal Palace had earlier expressed an interest in Akanji, who joined City in September 2022 and was a key component of the side which won the Champions League, Premier League and FA Cup treble in 2023, and the team which won the domestic title again in 2024.",
  "word_count": 483,
  "scraped_at": "2026-02-14T01:52:36.763152",
  "_text_extracted": true
}