{
  "article_id": "de8149837971",
  "url": "https://metro.co.uk/2026/01/28/manchester-united-linked-shock-move-unwanted-22m-chelsea-player-26570008/",
  "title": "Man Utd linked with shock move for unwanted £22m Chelsea player | Football",
  "date": "20260128T134500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United reverting to a back-four system on a long-term basis could lead to a surprise move for Chelsea winger Tyrique George, according to reports.\nCaretaker boss Michael Carrick has gone back to the more traditional system in his two games in charge since Ruben Amorim’s sacking earlier in the month.\nAmorim stuck with his favoured 3-4-3 system despite overseeing largely poor performances and results during his disappointing 14-month tenure.\nThe system did not suit a number of United players but Amorim persisted almost right up until the moment he was sacked by Old Trafford bosses.\nDirector of football Jason Wilcox and co-owner Sir Jim Ratcliffe are believed to have put pressure on Amorim to change his formation but the ex-Sporting manager was reluctant to adapt.\nManchester United are now expected to stick to a back-four system going forward regardless of whether Carrick is given the permanent job or not.\nThe Daily Mail say this move could raise the possibility of United pursuing wingers this summer and have suggested Chelsea academy graduate George could ‘come into consideration’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nGeorge, 19, is believed to have been one of a number of Chelsea players offered to United during their negotiations for Alejandro Garnacho.\nManchester United initially slapped a huge asking price on the Argentine and Chelsea hoped they could send an unwanted player to Old Trafford to bring the transfer fee down.\nUnited rejected the chance to sign multiple Chelsea stars in the deal, however, and finally dropped their demands and agreed to sell Garnacho for £40m.\nGeorge was also discussed as part of a potential swap deal for Xavi Simons but Chelsea lost interest in the midfielder, who later joined their London rivals Tottenham.\nEngland U21 star George was subsequently close to joining Fulham on transfer deadline day before the £22m deal collapsed.\nFulham boss Marco Silva identified George as an ideal replacement for Harry Wilson, who was in talks with Leeds United, but the Welshman stayed put meaning the deal with Chelsea broke down.\nGeorge played relatively regularly under Enzo Maresca last season, making 26 appearances in all competitions, but his minutes have dried up this term.\nThe 19-year-old is yet to start a Premier League game and Chelsea have made it clear they would be open to cashing in either before the January transfer window closes or more likely this summer.\nGeorge has been effectively frozen out of the first-team at Stamford Bridge and did not even make the matchday squad for Chelsea’s FA Cup win over Championship side Charlton earlier in the month.\nAsked about the player’s future in west London recently, new Chelsea boss Liam Rosenior said: ‘The honest answer is I don’t know. Tyrique is a player of immense potential who I’ve been aware of for a long time.’\nGeorge looks set to become the latest Chelsea academy product to be sold following the likes of Mason Mount, Conor Gallagher, Tino Livramento, Lewis Hall, Tammy Abraham, Marc Guehi and Fikayo Tomori.\nMore Trending\nWith United possibly looking to bolster their options on the wings, AC Milan’s Rafael Leao and Everton’s Iliman Ndiaye could also emerge as targets, according to the Mail.\nManchester United’s main focus, however, remains signing a central midfielder, with Elliot Anderson, Carlos Baleba and Adam Wharton three top targets.\nUnited have improved dramatically since Carrick took over from Amorim and are back in the Champions League places ahead of this weekend’s clash against Fulham.\nChelsea are just one point behind in fifth and will hope to leapfrog the Red Devils when they face London rivals West Ham on Saturday.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: When is the Champions League play-off draw? Date, start time and how to watch on TV\nMORE: Free agent Jesse Lingard in advanced talks as he closes in on new club",
  "word_count": 702,
  "scraped_at": "2026-02-14T01:53:15.578361",
  "_text_extracted": true
}