{
  "article_id": "de8c20b989e2",
  "url": "https://www.dailymail.co.uk/sport/football/article-12560779/Xabi-Alonso-Real-Madrid-replace-Carlo-Ancelotti-manager.html",
  "title": "Xabi Alonso  will replace Brazil - bound Carlo Ancelotti as Real Madrid boss next season  after impressing in his first year as Bayer Leverkusen coach",
  "date": "20230926T090000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Xabi Alonso 'will replace Brazil-bound Carlo Ancelotti as Real Madrid boss next season' after impressing in his first year as Bayer Leverkusen coach\n- Xabi Alonso is the favourite to replace Carlo Ancelotti at the Bernabeu\n- The Brazilian FA have said the Italian will lead them at the 2024 Copa America\n- Mail Sport's new WhatsApp Channel: Get the breaking news and exclusives here\nXabi Alonso has been tipped to replace Carlo Ancelotti as Real Madrid coach from next season, according to reports in Spain.\nThe Liverpool legend has been a first-team manager for less than a year after taking over Bayer Leverkusen last October, after managing Real Sociedad's B team for three years before.\nAccording to Radio MARCA, Real's hierarchy aren't concerned by Alonso's lack of managerial experience and have made the 41-year-old their preferred choice to become Ancelotti's successor.\nA two-time European champion with Spain, Alonso spent six seasons at the Santiago Bernabeu as a player, winning LaLiga in 2012 and then the Champions League two years later during Ancelotti's first spell at the club.\nThe 2010 World Cup winner retired after three seasons at Bayern Munich and managed Real's youth team, before taking over Real Sociedad's B side.\nXabi Alonso has been tipped to replace Carlo Ancelotti in charge of Real Madrid next season\nThe Italian's contract at the Santiago Bernabeu runs out at the end of the current campaign\nIn October last year, Alonso replaced Gerardo Seoane at Leverkusen with the team second from bottom after eight Bundesliga games.\nThe Spaniard, who spent five seasons at Anfield, made an immediate impact, guiding Leverkusen to sixth in the Bundesliga and to the semi-finals of the Europa League.\nLeverkusen have made a superb start to the season and trail champions Bayern Munich only on goal difference with 13 points from their opening five games.\nAlonso attracted interest from Tottenham before they appointed Ange Postecoglou, but he committed to Leverkusen and in August signed a three-year extension running to the end of the 2025-26 season.\nAncelotti, meanwhile, is expected to step down when his contract runs out at the end of the season.\nIn July, Brazil Football Confederation (CBF) president Ednaldo Rodrigues said Ancelotti would lead the national team at next year's Copa America.\nFernando Diniz signed a one-year deal as interim manager while he simultaneously coaches Fluminense.\n'Philosophy, not constantly changing it,' Rodrigues said in July. 'He [Diniz] always had the same method ... It's a coach whose ideas are similar to the coach who'll take charge in the Copa America, Ancelotti.\n'I think they have almost the same tactics and philosophy.'\nThe former Chelsea boss won LaLiga in 2022 and lifted his second Champions League trophy with the club in the same season along with the UEFA Super Cup and FIFA Club World Cup.\nLast season Real won the Spanish Cup, but finished 10 points behind champions Barcelona in LaLiga and were trounced 5-1 on aggregate by Manchester City in the Champions League semi-final.\nWith 15 points in six games, Real trail top-of-the-table Barcelona and Girona by a point after their perfect record in the league came to an end with a 3-1 loss to city rivals Atletico Madrid on Sunday night.\nMost watched Sport videos\n- Disgusting drink act caught on camera at ICC T20 World Cup\n- Tiffany Salmond dazzles in red bikini at Bondi Icebergs\n- IOC President in tears after Ukrainian athlete is kicked out\n- Viral Man United fan reacts to draw extending 493-day streak\n- NBA player makes long-awaited debut after battle with cancer\n- Team USA skier Breezy Johnson gets engaged after crash\n- Aussie snowboarder Scotty James shows off his dance moves\n- Super Bowl Champ wears Sam Darnold t-shirt with middle finger up\n- Has VAR broken football? Arsenal fan grills Mark Clattenburg\n- Alisa Camplin provides an update on Cam Bolton\n- How Deontay Wilder CAN recover from Tyson Fury losses\n- Stephen A. Smith calls Trump's criticisms of Bad Bunny valid",
  "word_count": 666,
  "scraped_at": "2026-02-14T01:54:03.038448",
  "_text_extracted": true
}