{
  "article_id": "de8c73d27276",
  "url": "https://www.dailyrecord.co.uk/news/uk-world-news/twisted-fraudster-lied-girlfriend-mums-35346417",
  "title": "Twisted fraudster faked mum death to scam girlfriend out £15 , 000",
  "date": "20250606T073000Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Romance fraudster faked mum's death to scam girlfriend out of £15,000\nThe 'born again Christian' scammed a woman who met online before swindling another short-term partner out of the shocking amount of cash.\nA romance fraudster swindled £15,000 from his girlfriend after claiming his mum had died.\nAndrew New, 36, told his partner of two months he needed cash to pay for his mother's funeral despite his mum being alive and well at the time.\nHe also asked his victim to make bank account transfers for a number of fabricated reasons including forgetting his credit card and wanting to buy Champions League final tickets in 2022.\nNew, from Wirral in Merseyside, later fled to Scotland to start a new life as a \"born again Christian\" and now resides at a rehab facility in Motherwell, North Lanarkshire.\nHe was spared an immediate prison sentence due to his case taking three years to come to court.\nLiverpool Crown Court heard that New had been in a relationship with Sarah Haslam between April and June 2022. During these 10 weeks, he repeatedly begged her to transfer money into his bank account, as well as those of a friend and his \"Uncle Joe\", for a \"variety of fabricated reasons\".\nProsecutor Henry Riding described how these reasons including having forgotten his credit card at petrol stations and wishing to purchase football tickets. She also gave him thousands of pounds under the impression that he needed to \"make funeral arrangements\" for his own mum in spite of her being \"alive and well\".\nNew \"promised to pay her back in due course, but never did\". This led to him pocketing a total of £15,734.65 of Ms Haslam's money during a period of only two-and-a-half months, reports Liverpool Echo.\nHis ex-partner tearfully told the court: \"As a result of what happened to me, I'm exhausted both mentally and emotionally.\n\"This was a person I believed cared deeply for me. I now know I was manipulated by them. I gave this person everything I had. In return, I was controlled and coerced until they broke me. I've lost part of myself.\n\"I considered myself a good judge of character. I now realise I was a pawn in their game, played by a first class method actor. I still struggle to understand how I let them do this to me. This person's narcissism led me to believe I could never do better.\n\"Three years on, I still live with the trauma. I felt like I had ruined my life. A day doesn't go by when I don't feel the hurt, pain and shame for not recognising what was happening to me.\"\nHe was first arrested in June 2022, but it took more than a year before he even stepped foot in court. In August last year, New pled guilty during his first appearance before the crown court, but his case did not proceed to sentence until now due to ongoing proceedings against the two other men whose bank accounts were used as part of the scam.\nHowever, charges were dropped against them by the Crown Prosecution Service. New has four previous convictions for four offences, including being handed a two-year community order for fraud by magistrates in 2019.\nThe case came after new previously found himself in the dock after scamming a woman who he met on dating website Plenty Of Fish. He befriended the woman before stealing £200 in relation to \"non-existent football tickets\". He also attempted to procure further funds from this victim, who he never met in person, in order to \"visit an aunt, who he described as ill\".\nPaul Becker, defending, told the court: \"The defendant is sorry for what he has done. He did not know, first thing today, that the victim was going to be present. Having heard her victim personal statement, he is utterly ashamed of himself.\n\"This is an unusual case. The delay, in some respects, helps the defendant, because he has been able to rebuild his life. He has moved to Scotland. He has been at a rehab centre for the last year.\n\"He works six days a week helping people.\"\nNew admitted one count of fraud by false representation. He was spared jail after the court heard the case had gone on for three years, giving him the time to \"turn his life around\" in Scotland.\nSentencing, Judge Gary Woodhall said: \"What you did has caused her very significant financial difficulties. She is still now, three years on, repaying monies which you took from her. That has delayed her ability to buy her own home.\n\"You are now residing in a Christian rehabilitation facility. You now identify as a born again Christian.\n\"As Mr Becker puts it, you have rebuilt your life. That is the delay in bringing this case to resolution, a delay of around three years.\n\"That delay means that you can show that you have committed no further offences and allows Mr Becker to identify that you have turned your life around in that three-year period. That is very significant.\n\"Had you been sentenced closer in time to the commission of this offence, I have no doubt that an immediate custodial sentence would have been the only correct disposal.\"\nNew was handed a 21-month imprisonment suspended for 20 months with 180 hours of unpaid work, a rehabilitation activity requirement of up to 20 days and a 12-month condition of residence.",
  "word_count": 903,
  "scraped_at": "2026-02-14T01:58:41.959038",
  "_text_extracted": true
}