{
  "article_id": "de911f89d709",
  "url": "https://quicknews-africa.net/messi-returns-to-barcelona-training-ground/",
  "title": "Messi Returns To Barcelona Training Ground - QUICK NEWS AFRICA",
  "date": "20250714T094500Z",
  "domain": "quicknews-africa.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionel Messi arrived at Barcelona’s training ground on Monday as he begins to reintegrate with the team following his failed attempt to leave the club this summer.\nMessi was seen driving into the Ciutat Esportiva in Sant Joan Despi at just after 4:00 pm (1400 GMT) on Monday, where he is expected to take part in training for the first time under new coach Ronald Koeman.\nThe Argentinian superstar said on Friday in his explosive interview with Goal that he would continue to give his best for Barca, despite admitting defeat in his bid to depart for free.\nThe 33-year-old maintained he tried to go because he “wanted to live his last years of football happily” while also blaming the club’s president Josep Maria Bartomeu for “breaking his word” and forcing him to stay.\nThe return of Barcelona’s embitterred captain and greatest ever player may not be an easy one, particularly given some of his closest team-mates are likely to be absent.\nLuis Suarez, Messi’s best friend and neighbour, as well as Arturo Vidal are expected to join Juventus and Inter Milan respectively.\nIt will also be the first time Messi has trained under Koeman, who was appointed Barca’s new coach last month.\nMessi’s decision to notify the club via burofax that he intended to leave came the day after he had met with Koeman, talks that reportedly involved Dutchman taking a hard line with his top striker.\nKoeman also said in his first press conference that he “only wanted players who want to be here and to give everything”.\nIf Messi passes his coronavirus test and rejoins training without problems, he could feature in Barcelona’s friendly against Gimnastic Tarragona on Saturday.\nIt would be the first time Messi has played for the team since their historic 8-2 defeat by Bayern Munich in last month’s Champions League quarter-finals.",
  "word_count": 308,
  "scraped_at": "2026-02-14T02:26:46.359999",
  "_text_extracted": true
}