{
  "article_id": "decf0f555f01",
  "url": "https://www.arsenal.com/news/every-word-artetas-pre-dinamo-zagreb-presser",
  "title": "Every word from Arteta pre - Dinamo Zagreb presser",
  "date": "20250121T194500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ahed of our penultimate Champions League league phase game against Dinamo Zagreb, Mikel Arteta held his usual pre-match press conference at the Sobha Realty Training Centre.\nHe was asked about the fitness of our squad, the possibility of booking a spot in the last eight, what he's made of Fabio Cannavaro's appointment and much more.\nHere is what he had to say:\non Calafiori and Nwaneri being back in training:\nIt’s very positive news, we’ve missed them for a few weeks and they returned today for training so they will be available for the game.\non William Saliba’s condition:\nHe is evolving well, the last few days he was feeling much better already but this game comes a little bit too early for him.\non the players training to music:\nThat is something that we’ve done for many years now and it is part of training. We use music as another element of our training sessions to build the energy and change certain purposes that we want in the training session, and I think the players enjoy it.\non how important it’ll be to miss the play-off round:\nSo far we’ve done really well, we’re in a really strong position and now it’s time to capitalise at home on the work we’ve done for many months. We need a strong performance against a really strong side and we will try to do that.\non whether we’ll head for warm weather training if we skip the play-off round:\nMy thinking is let’s do what we have to do first which is always difficult because we are talking about the Champions League. If we manage to do that, we will have the best ideas on the table to make the right decision.\non our break making a difference last season:\nIt was very helpful and with the schedule that we’ve had for the last three months, you can have a break, reset a little bit and work on things and rest some people, while some people are back, that would be great.\non whether he is enjoying the transfer window:\nI love it!\non whether he laughs when he sees us linked with many strikers:\nNo, I understand it happens. In the summer I had a lot of people texting me saying: ‘you’re after him?’ and sometimes I don't even know what they’re talking about. I don’t follow that too much, I have enough work to do and we’ve got a lot of things on so I don’t get too distracted by it.\non whether Saliba will be back for our Manchester City game:\nYes, I hope so yes.\non if the music in training changes depending on how to inspire our players:\nYes, depending on the day sometimes certain players pick certain songs - the first song, the first two songs, the last song - it’s the same as in the dressing room really.\non if Fabio Vieira and Reiss Nelson could be recalled:\nThere were certain possibilities with the Fabio situation. We’re exploring all of the things that we can do, just in case we cannot do them as well, how the injuries are progressing and when we’re going to have them available.\non how impressive it is to see Max Dowman training with the senior team:\nVery impressive. At his age as well, some of the things he does in training are unbelievable. He’s a player with huge talent and we have a lot of belief that we can develop him to become one of our own. He’s doing very well so far.\non the possible pathway for him to get minutes at a senior level:\nAt the moment with all the legislation there are a lot of restrictions for your age, something that in other countries you don’t even mention. We’ll have to wait and see. He’s taking very fast steps because every time you put him in a different challenge, a different level, he overcomes that hurdle really quickly which is great.\non Dinamo Zagreb’s promotion of academy products:\nYes, incredible talents. What they’ve done for many, many years, very consistently as well, the type of football that they always play in a country with a very clear philosophy of how they want to play the game, it’s going to be a very difficult match.\non young prospect Martin Baturina:\nI don’t like to talk about individuals but they do have a lot of talent. They have some individuals that catch your eye because you have in your head all of the players that play in that club and what they’ve done in the past. It’s always a good league and a great club to follow.\non Fabio Cannavaro’s appointment:\nThat’s the context of the game a little bit, a new coach and the fact that they haven’t played a competitive match for a month. We know the friendly games that they’ve played and we watched them just to try to gather ideas, more principles and systems than formations because Fabio’s played different formations when he was in China to Italy and now as well. To actually understand what they’re going to do and know the idea behind it, we’ll adapt to that tomorrow.\non whether he knows Eduardo da Silva from his playing days:\nNot really, we didn’t play together. Obviously he is a very familiar face with a specific history in certain moments as well, and he became very important and very loved here, then as you say, the career he had [at Zagreb]. So it’s very good to see people coming back here with big smiles on their faces.\non if Saka will be back in March or before then:\nNo, that’s not going to change. It’s within the process and the time that we had, that phase has gone now. He’s doing really well, he’s feeling better day by day, but we have to respect the healing process and then he has a lot of stages to go through in his rehab.\non having Ethan Nwaneri back:\nYes it was a big setback because he was getting some consistency and more minutes. We made him play in a different position and he was doing really well, then suddenly this happens. It’s understandable with the load as well, it goes through the roof immediately and this is what we have to manage.\non how many times he’s been able to rotate the team this season:\nWhatever I say will probably not be the right thing, but I think if there was one or two I would be surprised.\non the knock-on effects of moving players from midfield like Partey to right-back:\nI had no choice, I didn’t have another right full-back, just Jurrien, nobody else. Who plays when Jurrien isn’t available for his load is too high? The other day was the first time [he moved Jurrien to centre-back] but in relation to the way we have to play, we cannot have a right-footed player defending a right winger. I didn’t have another right-sided centre-back.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1198,
  "scraped_at": "2026-02-14T02:26:28.929886",
  "_text_extracted": true
}