{
  "article_id": "dee41f5dbde3",
  "url": "https://theathletic.com/4240601/2023/02/23/europa-league-draw-date-time-rules/",
  "title": "Europa League last - 16 draw : The rules explained plus date , time and how to follow",
  "date": "20230223T113000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United ensured they would be joining Arsenal in the Europa League last 16 draw with a victory against Barcelona in a pulsating tie.\nErik ten Hag’s side had to come from behind in both legs to secure passage to the next round.\nMarcus Rashford was the star at Camp Nou while a sublime team performance in the second half at Old Trafford saw them into the next round.\nAdvertisement\nThey, along with seven other teams, joined the other eight sides already in the hat for the last 16.\nBut, hen do they find out their last 16 opponents? And what are the rules of the draw?\nGO DEEPER\nThis week was a glimpse of what a Super League world might look like\nWhen is the draw?\nThe draw takes place on Friday, February 24 at 11am GMT (12pm CET, 6am EST, 3am PT).\nIt will be held at the House of European Football in Nyon, Switzerland.\nThe draw for the Europa Conference League last 16 will be held on Friday as well — that one is taking place an hour later at 12pm GMT (1pm CET, 7am EST, 4am PT).\nHow to follow the draw\nUEFA will be live streaming the last 16 draw on their website (this link will become live closer to the event).\nIn the UK, BT Sport will be showing the draws for both competitions live.\nIf you are unable to watch the last 16 draw, we would love you to follow the updates as they happen from Nyon in our live blog, which will include snap analysis from our team of award-winning writers.\nWhich clubs are in the last 16 draw?\nThe Europa League can be a little bit confusing, especially compared to the Champions League.\nThe eight group winners progressed directly into the last 16 before the World Cup while all the runners up had to go into the knockout stage play-off round.\nIn that round, they were each drawn against one of the teams that finished third in their Champions League groups and dropped into the Europa League.\nThe eight Europa League group winners that will be in Friday’s draw are:\n- Arsenal (England)\n- Fenerbahce (Turkey)\n- Real Betis (Spain)\n- Union Saint-Gilloise (Belgium)\n- Real Sociedad (Spain)\n- Feyenoord (Netherlands)\n- Freiburg (Germany)\n- Ferencvaros (Hungary)\nMeanwhile, the eight teams that prevailed in the play-off round are as follows.\n- Juventus (Italy)\n- Sevilla (Spain)\n- Bayer Leverkusen (Germany)\n- Sporting Lisbon (Portugal)\n- Manchester United (England)\n- Roma (Italy)\n- Shakhtar Donetsk (Ukraine)\n- Union Berlin (Germany)\nHow does the draw work?\nThe eight seeded teams will be the teams that won their Europa League groups, meaning the teams progressing from the play-off ties are unseeded.\nThe seeded teams will have the slight advantage of playing the second leg at home.\nThis is the final stage of the Europa League where teams from the same association cannot be pitted against each other.\nAdvertisement\nSo, Manchester United cannot face Arsenal in the last 16. Similarly, Real Betis and Real Sociedad will not be able to draw Sevilla while Freiburg will avoid Union Berlin.\nFrom the quarter-final onwards, any of the teams can be drawn against each other.\nThe Europa League last 16 first legs will be played on March 9 — with the second legs being played a week later on March 16.\nSo, who can Arsenal and Manchester draw in the last 16?\nArsenal\n- Bayer Leverkusen\n- Juventus\n- Roma\n- Sevilla\n- Shakhtar Donetsk\n- Sporting Lisbon\n- Union Berlin\nManchester United\n- Fenerbahce\n- Ferencvaros\n- Feyenoord\n- Freiburg\n- Real Betis\n- Real Sociedad\n- Union Saint-Gilloise\n(Top photo: Martin Rickett/PA Images via Getty Images)",
  "word_count": 620,
  "scraped_at": "2026-02-14T02:16:35.940914",
  "_text_extracted": true
}