{
  "article_id": "dee91250b844",
  "url": "https://mufclatest.com/predicted-xi-4-2-3-1-hojlund-garnacho-mainoo-to-start-williams-on-the-bench-awaiting-his-big-break-maguire-varane-in-defence/",
  "title": "Predicted XI : [ 4 - 2 - 3 - 1 ] Hojlund , Garnacho & Mainoo to start ? Williams on the bench awaiting his big break ? Maguire & Varane in defence ? ",
  "date": "20240217T014500Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United travel to Kenilworth Lane to face Luton Town in the Premier League on Sunday afternoon. It will be the first time United have visited the stadium in the league since 1992 – drawing 1-1. They did win there in 2020 though – 3-0 in the Carabao Cup.\nAt the time of writing, Luton sit 17th in the Premier League, just a point above the relegation zone. United sit sixth in the league, just five points behind fifth-placed Aston Villa – who United beat 2-1 in the Premier League last Sunday. Erik ten Hag needs another win this weekend.\nUnited have started 2024 in good form – winning five and drawing once in the opening matches of the year. Ten Hag will be seeking United to continue that run of form for the foreseeable future – if not until the end of the season. United will need to get the results on the pitch now.\nPredicted Manchester United Starting XI – 4-2-3-1\nOnana;\nDalot, Varane, Maguire, Shaw;\nCasemiro, Mainoo;\nGarnacho, Fernandes, Rashford;\nHojlund\nGoalkeeper: Onana\nAndre Onana has had a turbulent time as United’s goalkeeper this season – he has conceded 51 goals in the matches he has played – 33 in the Premier League, 15 in the UEFA Champions League and three in the Carabao Cup. It has not been a great debit season for him or United.\nThe negatives aside, in the Premier League, Onana is right up there with the clean sheets on the leaderboard with him keeping seven this season and only Jordan Pickford of Everton ahead of him – which suggests he is actually doing well in goal for the club – but he could be better.\nAt some point, Ten Hag will give Altay Bayindir more opportunities in goal for the club as he looks to see if both goalkeepers can better themselves and impress for United as the race for the real number one goalkeeper of the club starts to hot up next season.\nDefenders: Dalot, Varane, Maguire, Shaw\nUnited’s defence has endured many problems this season with injuries the major factor. There has never been a constant run of matches where the same players have played and that looks set to be the case until the end of the season, which is very unfortunate for all concerned.\nAgainst Luton, Diogo Dalot and Luke Shaw should play in the fullback roles for the club, unless Shaw is not fit for the match, which could be a very high possibility. In which case, a youth player could be drafted in or Ten Hag will make do with player out of their favoured positions.\nIn the centre of the defence, Raphael Varane and Harry Maguire will continue to strike up a positive partnership – which is likely for much of the remainder of the season with Lisandro Martinez out of action for the next six weeks or more. Ten Hag will be looking at what could have been.\nMidfield: Casemiro, Mainoo\nUnited’s midfield has been a kind of revelation this season with injury keeping the likes of Casemiro and Christian Eriksen out for large spells, meaning that Kobbie Mainoo and Scott McTominay have been afforded more time on the pitch, which seems to have worked well for the duo.\nCasemiro is now back in action and looks to continue a strong finish for the season with midfield partner Mainoo, who really has taken to the stride of the club coming from the youth team. Ten Hag really has done well guiding the youngster through into the first team where he looks good.\nMcTominay has scored eight goals so far this season, which really has been unlikey for the players a large proportion of the clubs supporters had written off in the summer and wanted the club to get rid of him. It seems fitting that he’s shown this ability banging the goals in this season.\nAttacking Midfield: Garnacho, Fernandes, Rashford\nUnited’s attacking line is positive this season and looks set to continue that for the remainder of the season. Against Luton, it seems likely that the same players who started at Villa will be playing, which is a good thing as confidence seems to be high and things are starting to work for United.\nAlejandro Garnacho has been largely positive this season. The 19-year-old has seven goals and two assists to his name this season and he seems like he wants to keep going and reach double figures for goals. Marcus Rashford has started to look positive, despite five goals and six assists.\nBruno Fernandes is the mainstay in the attacking midfield for United with the captain really getting involved this season. He is one of the best performers for the club since he arrived four years ago. So far this season he has scored seven goals and seven assists – a lot of room for more.\nForward: Hojlund\nRasmus Hojlund has been a player that suffered lots of criticism during the early stages of the season and then silenced some critics after scoring some great goals in the UEFA Champions League, scoring five in six group stage matches which was great for him.\nSince then, Hojlund has opened his account in the Premier League, scoring five goals and two assists, getting a further goal in the Emirates FA Cup, which has brought his total to 11 goals and two assists so far this season with the player hungry to achieve so much more.\nTen Hag does not have any strikers to fall back on at this stage of the season. Rashford is better on the left-wing and Anthony Martial is unlikely to play any more football this season. Joe Hugill has been loaned out of the club which could see Ethan Williams come through and shine.\nSubstitutes: Bayindir; Lindelof, Evans; Amrabat, Eriksen, McTominay; Amad, Antony, Williams\nUnited will have nine players on the bench against Luton with the option to utilise five of them throughout the match. Ten Hag will be seeking another win for United as they need to start to turn around their season as we are vastly reaching the business end of the season.\nAltay Bayindir will be the only goalkeeper on the bench, seeing his second start for the Old Trafford club since he signed in the summer. In defence, Victor Lindelof and Jonny Evans could be the only defenders on the bench, which is not ideal at this stage of the season.\nIn the midfield, Sofyan Amrabat, Christian Eriksen and Scott McTominay could be available with the latter scoring his eighth goal of the season in the last match. In attack, an area where United lack numbers, Amad Diallo, Antony and youth star Ethan Williams could be available.\nWritten by Paul\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 1140,
  "scraped_at": "2026-02-14T01:51:19.060352",
  "_text_extracted": true
}