{
  "article_id": "df140f76bfdb",
  "url": "https://www.bbc.com/sport/football/articles/cjr5qv12rqno",
  "title": "Rangers fans still angry with Russell Martin but is tanker turning ? ",
  "date": "20250929T013000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rangers fans still angry but is tanker turning?\n- Published\nBlue shoots of recovery but not for the fans.\nWithin seconds of celebrating a dramatic last-minute winner, which caused some supporters to pour onto the pitch, the rest of the Ibrox travelling support suddenly remembered what script they'd rather be singing from.\nFrom cheers to jeers in moments. Three quarters of Almondvale reverberating to the sound of \"Martin, Martin, get tae...\".\nIt's become personal for many among the Rangers support. Rather than give under-pressure manager Russell Martin a chance to enjoy the final few moments before finally securing his first Scottish Premiership win, they turned on him once again.\n\"You could hear clearly what the fans felt towards the manager, even after the goal went in,\" former Scotland forward James McFadden said on Sky Sports.\n\"It's big for the players, but I'm not too sure what it does for Russell Martin.\"\nNot very much, according to his fellow pundit, former Rangers striker Kris Boyd.\n\"Martin keeps speaking about anxiety, but you're away from home against a team that's just been promoted,\" he said. \"Rangers have better players than Livingston.\n\"It's a relief, but it's papering over the cracks. It's still not good enough for Rangers.\"\nFirst-half display shows blueprint for Martin\nIn one sense, both are correct - one win does not change what has been an appalling start to his tenure. And three points against a team that was in the division below last season won't change too many minds.\nMartin had to win this game, though, and he ultimately delivered. So is that tanker that he spoke about a few weeks ago slowly beginning to turn?\nThe case for the defence would be the first 45 minutes at Almondvale.\nDuring the opening half, this was a different-looking Rangers. Faster, more aggressive, more direct. They asked plenty of questions of a side that can be notoriously difficult to break down.\nJames Tavernier scored a good goal, then watched Livingston goalkeeper Jerome Prior deny him from the penalty spot. Prior was a busy boy in that first half, further evidence of Rangers' domination.\nThere was also a disallowed goal by Derek Cornelius and a sitter missed by striker Bojan Miovski. This didn't look, or feel, like a team in crisis.\nAnother building block for Martin will be the way Rangers kept going beyond 90 minutes to secure the win.\nPlayers who don't have the manager's back might not strain every last sinew when they know his job is hanging by a thread.\nRangers forced late free-kicks and corners until Max Aarons was able to sweep in a winner in the game's dying embers. A touch of redemption for him after his red card in Bruges left his team-mates exposed to an almighty Champions League humbling.\n\"Rangers were disjointed, nobody knew the shape or the tactics, but somehow they found a way to win the game,\" said former Northern Ireland international Stephen Craigan on Sportsound.\n\"The big positive is they won out of nowhere, but there's so many learnings in that second half of how you should manage the game. The manger has to question his subs and his tactical changes.\"\n'Take three points and get off the pitch'\nWhat Martin can't question is the desire of those he turned to. A weaker-willed squad could have folded under the pressure of Livingston's comeback.\nWhen the result is far more important than the performance, it would be churlish to nit-pick too much. That Rangers have four draws and a defeat to show for their other Premiership outings this term is what still rankles with the rank and file.\nTheir abusive chants towards their own manager will only fade if a significant run of victories ensues both at home and abroad.\nTwo tough-looking assignments in Graz and Falkirk in the next few days will have to be negotiated before there's even the beginning of a buy-in from some fans.\nSome time has been bought by this win, though. Ask Neil McCann, who occupied the Ibrox dugout last season as Barry Ferguson's assistant.\n\"It's so important for Russell Martin,\" he said on Sky Sports. \"You could see the relief on his face. Today was just about winning. Take three points and get off the pitch.\"\nThe head coach did both of those, telling BBC Scotland he ducked quickly down the tunnel at full-time to allow his team to celebrate with the fans without the mood being soured by further chanting towards him.\n\"I'm so happy for the players - they really stuck at it,\" he added. \"The fans saw a team that's really fighting for each other and for the coaching staff.\n\"I've nothing to say about [the fans chanting at him] because I can't control any of it. It's why I walked down the tunnel so quickly. It's aimed it me but it's not about me today, it's about the players.\"\nSo this late win against Livingston follows a good performance against Hibernian the week before to claim a League Cup semi-final spot. In between, there was a narrow defeat by Genk in which Rangers played 50 minutes with 10 men.\nWhisper it but there are some blue shoots of recovery. They may be killed off by the icy blast of further mediocrity should Rangers be undone again at home or abroad.\nGranted, the bar is set nowhere near high enough for fans but, for now, it seems there are signs of improvement for Martin. Whether the supporters like it or not.\nWhat are the fans saying?\nStevie: I saw two different sides of Rangers today. First half was amazing - edge of your seat. Second half was what we have been seeing for weeks now. Dodgy and unpredictable. Thought we were lucky to walk away with three points.\nScott: Get out of my club now, Martin.\nPeter: Can Rangers please employ someone to edit the post-match interview drivel that spouts from the head coach? It's embarrassing.\nSteve: I still think Martin still needs to go. Second half proved that's he's still not good enough to lead this team.\nSteven: Papering over the cracks. So bad, no rhythm, no formation and got lucky at the end.\nBrian: It gives me no pleasure to say but that win is the wrong result for Rangers as it eases the pressure on Martin and means he will stay for the time being.\nGeorge: Far too much negative passing at the back. Martin's system does not work and he is not clever enough to change it. Surely his tea's oot?\nCallum: I hope Martin doesn't think he's off the hook because of one scrappy result. He's still the worst manager the club have ever had and the sooner he goes the sooner we get back to some form of normality.\nSally: When is Martin going to learn this team do not have the skill in defence to play possession football? The ball is not being played quickly enough which allowed Livingston's midfield and defence to re-group. Livingston deserved a point.\nGet in touch\nSend us your views on Rangers",
  "word_count": 1182,
  "scraped_at": "2026-02-14T01:55:21.386780",
  "_text_extracted": true
}