{
  "article_id": "df1cb3d3d6a1",
  "url": "https://www.fourfourtwo.com/news/jules-breach-the-new-look-champions-league-offers-blockbuster-ties-and-unpredictability-yet-maintains-the-quality-and-drama",
  "title": "JULES BREACH : The new - look Champions League offers blockbuster ties and unpredictability yet maintains the quality and drama",
  "date": "20251017T131500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JULES BREACH: The new-look Champions League offers blockbuster ties and unpredictability yet maintains the quality and drama\nThe TNT Sports presenter gives her view on the new-look Champions League’s second season\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThere’s always a buzz when European football returns and this season marks the second year of the revamped format, where clubs compete in a league phase rather than a group stage.\nIn the Champions League, the 36 clubs will each play eight different teams – four at home and four away. The top eight qualify for the round of 16, while the teams finishing in 9th to 24th face a play-off round to join them.\nLike anything that’s changed in football, there’s been debate whether the competition is better in this new structure or not and if teams might approach the competition differently.\nWhat we have learned is that it creates more elite matches early on, meaning mouth-watering viewing for fans. This season, the draw gave us Bayern Munich vs Chelsea in the opening week, Barcelona hosting PSG in the second round of games, Liverpool welcoming Real Madrid to Anfield and Manchester City making a trip to the Bernabeu in December. Top clubs and their superstars are everywhere you look.\nWith more opponents and more games, there’s also a touch of randomness and unpredictability. Last year’s champions PSG started their run with three defeats in their opening five games and finished outside the top eight, while Manchester City were 22nd. The final round of matches in the league phase are played simultaneously, making for utter chaos on the last day with 18 games all underway at once. Going into that matchday last season, only two teams had sealed a place in the top eight, with nine more fighting for the play-off round, so almost all of the ties had some uncertainty going into them.\nBut does that jeopardy matter if we ultimately end up with all the teams we expect in the last 16 anyway? And does it even make a difference if you finish in the top eight or not? On the latter, the jury is still out according to Arne Slot.\nBefore Liverpool’s opening match of this campaign against Atletico Madrid, we sat down with the manager on TNT Sports. He was honest and eloquent as always.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nLast year, Liverpool topped the league phase, winning seven of their eight matches. Slot told us he had a long think about the strategy for this year, and second-guessed whether fielding his strongest team in the early games in order to secure top spot was really worth it. You’d expect that finishing first would have given them an easier draw, but instead they ended up facing PSG in the round of 16, losing on penalties.\nSlot admitted that one of his takeaways from experiencing the competition’s new format last season was that it probably doesn’t matter where you finish in the top eight, and that rotating his squad to keep them fresh for the round of 16 may be a more effective approach.\nHowever, he also said that one benefit of consistently playing stronger teams was that it helped his team on their way to winning the Premier League title. Of course, the most obvious benefit of finishing in the top eight is that you face two fewer games by skipping the play-off round.\nWith the physical toll the calendar already places on players, those blank midweeks make a massive difference. So as this campaign gathers pace with six English teams competing, the Premier League sides will be fancied to dominate. Arsenal were the best-performing British team last season and look even stronger this time around, adding Alexander Isak has raised expectations for Liverpool and Manchester City won’t repeat their form of last season again. Meanwhile, Chelsea, Newcastle and Spurs are all back among Europe’s elite clubs and will want to make their places count.\nBarça look determined to go one better than last season – if they keep Lamine Yamal fit, you wouldn’t bet against it. As holders, PSG will be fancied again, though the super computer hasn’t been kind with a tough fixture list that may see them outside the top eight again – not that it made a difference last year. It feels like sporting organisers are making competitions bigger and longer, and the new European format has followed that trend. But if it continues to give us blockbuster ties, allowing for unpredictability while retaining the quality and drama we all want to see in the knockout phase, I can’t see many football fans not approving.\nJules Breach is a broadcast journalist who has lead presenting roles for TNT Sport, Channel 4, ITV, and Premier League Productions. Jules hosted BT Sport’s live flagship football show Score and also presents live Premier League, Europa League and Champions League matches. Jules is the lead presenter for Channel 4’s coverage of the England games and also hosts ITV’s EFL Highlights show. Jules presents worldwide coverage for Premier League Productions and away from work is a passionate Brighton fan.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 987,
  "scraped_at": "2026-02-14T02:12:04.352419",
  "_text_extracted": true
}