{
  "article_id": "df2f29fdd231",
  "url": "https://www.themag.co.uk/2025/07/newcastle-united-official-announcement-sudarshan-gopaladesikan-appointed/",
  "title": "Newcastle United official announcement - Sudarshan Gopaladesikan appointed",
  "date": "20250721T191500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United official announcement – Sudarshan Gopaladesikan appointed\nNewcastle United have appointed Sudarshan Gopaladesikan.\nAn official club announcement on Monday revealing the news.\nSudarshan Gopaladesikan takes on the role of Technical Director at Newcastle United.\nThe new appointment arrives from Serie A.\nSudarshan Gopaladesikan having moved to Tyneside from his role of Director of Football Intelligence at Atalanta BC.\nNewcastle United official announcement – 21 July 2025:\n‘Newcastle United have appointed Sudarshan Gopaladesikan as the club’s Technical Director.\nReporting into a new Sporting Director, Sudarshan – known as Suds – will lead the club’s football data operations, working closely with Eddie Howe and his coaching staff and the club’s performance, medical, analysis, methodology and recruitment teams.\nHis role will be dedicated to implementing data-informed practices across all sporting departments throughout men’s, women’s and Academy teams.\nSuds joins the Magpies after leaving Italian side Atalanta BC, where he was Director of Football Intelligence. During his time in Bergamo, Atalanta secured three consecutive top five finishes in Serie A, won the UEFA Europa League and reached a Coppa Italia final.\nPrior to his move to Italy, he was Head of Sports Data Science at Portuguese side SL Benfica. In his five seasons in Lisbon, Benfica’s men’s team won the Primeira Liga title and reached the quarter-finals of both the UEFA Champions League and Europa League, while Benfica’s women’s team won two national titles. Meanwhile, Benfica’s academy reached the UEFA Youth League final twice and won the 2021/22 edition of the tournament.\nOutside of his club experience, Suds lectures for FIFA’s Executive Education programmes and the PFA Business School on data-driven decision making.\nSuds said: “I’m delighted and honoured to be joining Newcastle United as Technical Director. Throughout my career, I’ve had the privilege of working with clubs that have deeply passionate fanbases, and Newcastle stands out for its unique connection between the team, the city and its supporters.\n“I’m excited to work alongside the club’s talented staff to identify what helps give us a competitive edge. Most of all, I’m looking forward to experiencing the incredible matchday atmosphere at St. James’ Park and being part of this proud football family and community.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 374,
  "scraped_at": "2026-02-14T02:06:08.191198",
  "_text_extracted": true
}