{
  "article_id": "df3f179a9e6b",
  "url": "https://mufclatest.com/manchester-united-need-three-big-signings-this-summer-in-order-to-compete/",
  "title": "Manchester United need three big signings this summer in order to compete",
  "date": "20250810T121500Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United legend Ryan Giggs thinks that United manager Ole Gunnar Solskjaer will need three big transfers this summer in order compete for the Premier League title and beyond with the likes of champions Liverpool and rivals Manchester City. It is clear to see, despite City’s demise this season, they are much better than United, or at least have been on a more consistent level, like Liverpool.\nMore recently, United have progressed considerably and are currently on a 19-match unbeaten run which stretches back to before the coronavirus pandemic lockdown with United unbeaten since Bruno Fernandes signed for the club and after Project Restart, United have played some brilliant football, ground out some great results and some not so great, despite being undefeated, in search of UEFA Champions League football.\nFernandes, 25, has given United a new dimension which has got Paul Pogba hungry again after a season to forget with injury but United seem to lack top class players and if one or more are rested, instead of going forward, the club slightly regresses as the ability to carry the team through matches is not quite there with players falling short of what is needed. It is clear that reinforcement this summer is important.\nGiggs won 34 trophies during his career with United, playing for only one club during his entire career. He also became the interim manager after David Moyes was sacked, then becoming an assistant to Louis van Gaal and is currently the Wales manager. The Welsh winger has knowledge of what it takes to achieve things at United, so in opinion on the matter is something I respect. Speaking to Premier League Productions as reported by The Sun, Giggs said:\n“I still think we’re off City and Liverpool by two or three players. Good characters are coming in. You see [Bruno] Fernandes, he looks like a leader, he looks like a character. [Harry] Maguire, he’s their captain.\n“It’s not just about having the players, it’s about having that culture, that character that can improve not only the starting eleven but the squad and the overall feeling around the club.\n“They’re certainly moving in the right direction. But, I still believe we need three new players.”\nUnited have been heavily linked with Borussia Dortmund winger Jadon Sancho this summer but a €120 million asking price might be the main things that kills a deal this summer, despite optimism from some journalists in the United Kingdom and around Europe. With the coronavirus pandemic and the fact supporters are not present at matches, it might create a shortfall of money which will affect transfers. At least that is what has come out of the club recenty.\nOver the years at United, whilst Giggs was a player, there were many big name players who arrived at the club from Andy Cole to Ruud van Nistelrooy, and Cristiano Ronaldo to Wayne Rooney – all of whom endured a lot of success at the Old Trafford club, raising the bar and keeping Sir Alex Ferguson’s dominance of domestic and European football going. If Solskjaer is going to implement something like this at United, he will need reinforcement at the club, continuing this summer.\nLast summer, Solskjaer made three signings; Daniel James, Aaron Wan-Bissaka and Harry Maguire – all of whom have done well, with a few struggles here and there. In January, Fernandes arrived at the club and his eight goals and eight assists in 17 appearances kind of speak for themselves. Odion Ighalo was also signed for the remainder of the season on loan, which was extended (because of the coronavirus pandemic) meaning the player will remain at United until the end of January 2021.\nIn order to head in the right direction though, United will need to get rid of the players who are not achieving at the club. Chris Smalling, Marcos Rojo and Alexis Sanchez are currently away from the club on loan and the likes of Phil Jones, Jesse Lingard, Andreas Pereira, and Diogo Dalot seem to be out of sorts in the respect that they rarely play. In Lingard’s case, he does not seem to offer much, hence why he rarely plays. United need to bring in quality players, three for a start, who will greatly change the overall quality of the squad, helping United make the grade and bring to challenge to both Liverpool and City.\nWritten by John Walker\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 751,
  "scraped_at": "2026-02-14T02:02:51.936737",
  "_text_extracted": true
}