{
  "article_id": "df611b3bcfa6",
  "url": "https://english.aawsat.com/sports/5111348-bellingham-strikes-late-real-madrid-3-2-win-man-city-champions-league-1st-leg",
  "title": "Bellingham Strikes Late for Real Madrid in 3 - 2 Win at Man City in Champions League 1st Leg Playoff",
  "date": "20250212T113000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid’s Galacticos just don’t know when they are beaten. Manchester City just keep on making the same mistakes.\nJude Bellingham’s stoppage-time goal sealed a stunning comeback for Madrid and a 3-2 lead in its Champions League playoff against City.\nIn six frantic minutes at the end of a breathless first leg Tuesday, the Spanish giant scored twice to take a precious advantage into next week’s match at the Bernabeu.\nCity led 2-1 after 80 minutes at the Etihad Stadium through goals in each half from Erling Haaland. But Brahim Diaz and then Bellingham silenced the home crowd and extended a sorry record for City that has seen it concede seven goals in the last 15 minutes of Champions League games this season.\n\"We need to see games out better, that's for sure,\" City defender John Stones said. \"We have to stay positive, which is difficult right now.\"\nBellingham slid in to convert Vinicius Junior’s lobbed pass in the second minute of added time to bring back memories of Madrid’s dramatic comeback against City in the semifinal in 2022. Then it was Rodrygo who scored twice from the 90th and Madrid eventually sent Pep Guardiola's team crashing out in extra time.\nAt least City has a chance to salvage the tie in the second leg, but the sense of deflation was clear after such a late collapse.\n\"It’s not the first time, unfortunately, it happened many times and that's why it's difficult,\" Guardiola said. \"I’ve been here for many years and we have been an extraordinary team.\n\"But in the moment I’m not able... I’m not good enough, you know, to give something to (give) composure to the team, to (know) how to manage the situations.\"\nIt was another thrilling, white knuckle-ride of a game between these two giants of European football and a one-goal advantage for Madrid means there is still all to play for.\nDefeat ended City’s 35-game unbeaten run at home in the Champions League, dating back to 2018.\nCity led through Haaland’s goal in the 19th.\nBy that stage, Madrid had seen a penalty overturned for offside and a Ferland Mendy goal-bound effort blocked by Manuel Akanji.\nVinicius Junior then hit the bar with a curling shot and Akanji also clipped the frame of the goal with a header.\nHaaland hit the bar again less than a minute into the second half.\nMadrid’s equalized on the hour through a freakish goal from Mbappe when his miskicked volley wrongfooted Ederson and looped softly over the line.\nMbappe hit the post with another chance before Ceballos brought Phil Foden down just inside the box and Haaland’s penalty restored City’s lead.\nOn came former City academy player Diaz, who left City for Madrid in 2019 and he leveled the game again before Bellingham's winner.\n\"I don’t care what form City are in they are still an unbelievable team and so difficult to play against, the way they move you and manipulate your position,\" Bellingham said. \"It’s always really tricky to play against them and in the end we took one of the many chances finally and made it count.\"\nParis Saint-Germain took a big step toward the round of 16 by beating Brest 3-0 and Juventus won 2-1 against PSV Eindhoven. Borussia Dortmund also looks on course for the next round after a 3-0 win at Sporting Lisbon.\nPerfect 10\nOusmane Dembélé struck twice for PSG to extend his scoring streak to 10 games in a row.\nHis outstanding form has seen him score 18 goals during that run.\nIt was his shot that led to PSG taking the lead through a 21st-minute penalty after Pierre Lees-Melou handled in the area. Vitinha converted the spot kick.\nDembélé scored his first in the 45th when he broke free down the right and curled a shot inside the post. His second came in the 66th when he pounced on a loose ball and burst into the penalty area to score his 23rd goal of the season.\nHaving made hard work of the new-look league phase of the tournament, it would take a major upset in the second leg in Paris to deny PSG a place in the next round.\nJuventus leads\nSubstitute Samuel Mbangula grabbed a late winner for Juventus and in doing so claimed his first Champions League goal.\nThe 21-year-old Belgian forward reacted quickly when goalkeeper Walter Benitez spilled a low cross from the right by Francisco Conceição in the 82nd.\nJuventus took the lead late in the first half from Weston McKennie’s powerful strike into the top corner from just inside the penalty area.\nVeteran midfielder Ivan Perisic calmed the home fans with a fine finish in the 56th.\nDortmund wins\nSerhou Guirassy scored his 10th Champions League goal of the season as last year’s runner-up Borussia Dortmund beat Sporting Lisbon 3-0.\nGuirassy scored one goal and set up another for Pascal Gross as Dortmund scored twice in the space of eight minutes, both goals coming from crosses.\nKarim Adeyemi finished off a rapid counterattack to score Dortmund’s third in the 82nd as Sporting tried to get back into the game and left space at the back.\nSporting hasn’t won in five Champions League games since coach Ruben Amorim left for Manchester United in November. It was the first Champions League game for new Dortmund coach Niko Kovac.",
  "word_count": 890,
  "scraped_at": "2026-02-14T01:52:15.341014",
  "_text_extracted": true
}