{
  "article_id": "df81eda4c734",
  "url": "https://www.90min.com/posts/champions-league-team-of-the-round-of-16-2022-23",
  "title": "Champions League : Team of the round of 16",
  "date": "20230316T163000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League: Team of the round of 16\nThe 2022/23 Champions League round of 16 was full of goals, incidents, and Italian teams winning games of football.\nThe aforementioned goals were largely scored by Erling Haaland, the incidents largely involved Frankfurt fans running amok in Naples, and the Italian teams winning means that, for the first time since 2006, three Serie A teams are in the quarter-finals.\nSo, after all that fun, here's 90min's team of the round of 16.\nGK: Andre Onana - Two man of the match outings against Porto in the round of 16, his clean sheets were the reason Inter made it through to their first quarter-final in over a decade.\nRB: Giovanni Di Lorenzo - One goal and one assist for a player who is having the best season of his career.\nCB: Dayot Upamecano - Matthijs de Ligt stole the headlines with his brilliant goal line block in the second leg against PSG, but Upamecano was the standout defender across the two legs. The French defender kept Lionel Messi and Kylian Mbappe pretty quiet, which is basically a minor miracle.\nCB: Malick Thiaw - AC Milan are seemingly unearthing a new gem of a defender every season under Stefano Pioli, and this season's gem is Malick Thiaw. The 21-year-old was outstanding in both legs against Tottenham Hotspur.\nLB: Alphonso Davies - The Canadian's two stunning performances against Paris Saint-Germain were key in seeing Bayern through to the quarter-finals.\nREAD NEXT\nCM: Kevin De Bruyne - His form's been up and down of late in the Premier League, but in Europe De Bruyne shone against RB Leipzig earning a 10/10 from 90min for his second leg showing.\nCM: Jamal Musiala - The Bundesliga's breakout star of 2022/23 was fantastic in the games against PSG, causing havoc with his clever movement in and around the penalty area.\nRAM: Karim Benzema - Another three Champions League goals against Liverpool, the Ballon d'Or winner is seemingly unstoppable in knockout round games.\nLAM: Vinicius Junior - The Brazilian earned himself two 9/10s from 90min for his four goal contributions over two legs against Liverpool.\nST: Erling Haaland - Fives goals in one game. Haaland became one of only three players to achieve that goalscoring feat on Tuesday. The others on that list? Lionel Messi and Luiz Adriano (of all people).\nST: Victor Osimhen - The best goal scored in any of the games in the round of 16 was Osmihen's header against Frankfurt on Wednesday evening. That was one of three the 24-year-old scored in the last 16.\nLISTEN NOW\nOn this edition of Talking Transfers, part of the 90min podcast network, Scott Saunders, Graeme Bailey & Toby Cudworth discuss Harry Kane's future at Tottenham Hotspur, Joao Felix potentially joining Chelsea on a permanent basis, David Raya, Marco Asensio, Alexis Mac Allister & more!\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 488,
  "scraped_at": "2026-02-14T02:16:40.070231",
  "_text_extracted": true
}