{
  "article_id": "dff9a8d5c96c",
  "url": "https://www.bbc.com/sport/64353402",
  "title": "Morocco shock World Cup run - and the Englishman who helped plot it",
  "date": "20230124T081500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "\"This is the question that everyone always asks!\"\nBut before Harrison Kingston answers it, he has a caveat.\nThere is no 'cheat' code. However much data and brainpower Morocco's director of performance analysis pours into his laptop, it never spits out an infallible playbook.\nHe couldn't unlock a ready-made route to goal and success when he worked at Liverpool, Tottenham Hotspur or Burnley.\nHe didn't on Morocco's journey to the World Cup semi-finals last month.\n\"If reality worked like that, you would see a lot more things happening every weekend on a pitch that looked a lot more prescribed,\" Kingston tells BBC Sport.\n\"That I say or show something and then it would happen? That is not really the logic of football.\n\"Football, generally, is quite chaotic. You are trying to make sense of that chaos, trying to pick up some detail that you can take advantage of.\"\nBut, just sometimes, the 36-year-old can glimpse one of his details among the many moving parts.\nThere is an example Kingston cites from his eight years at Liverpool. It was something one of the players did. Not Mohamed Salah, Sadio Mane or Roberto Firmino.\nBut, instead, the lesser-known Oakley Cannonier.\nCannonier is now part of Liverpool's Under-21 side but, back on 7 May 2019, having just turned 15, he was working as a ball boy.\n\"We had just lost 3-0 to Barcelona in the Nou Camp in the Champions League semi-final first leg after outplaying them for the most part,\" remembers Kingston.\n\"We came away scratching our heads about how we had ended up with that scoreline, but watching it back stirred a memory of our last-16 match against Bayern Munich two months before.\n\"The ball boys in Munich were like trained machines, getting the ball back in play so quickly. Talking to their staff after, we found out that it was a deliberate tactic; they wanted a fast rhythm to stop us having the chance to press them.\n\"At Barcelona it was the opposite, the ball boys were super slow. A goal-kick would take a minute, a free-kick would take 30 to 45 seconds.\n\"Looking back, we could see it was deliberate. Barcelona were a team who suited a slower pace to the game, rather than something that fed into Jurgen's [Klopp] intensity.\n\"So the coaches and analysts took it on ourselves, with the kit manager who looked after them on Anfield match days, to show our ball boys a video about how they could help the team.\n\"We told them they were the 12th man, that they were not watching the game, they were in the game.\"\nIn the 79th minute, with Liverpool leading 3-0 and the tie level, Cannonier took his chance to play a part.\nTrent Alexander-Arnold played the ball off the shins of Sergi Roberto to win a corner. The ball skittled past Cannonier, just a few yards from where has was stationed in front of the advertising hoardings. But he ignored it. Instead he immediately bowled a spare ball, already in his hands, to Alexander-Arnold for the set-piece. Barcelona's defenders, used to a slower rhythm, lapsed in concentration. Divock Origi looked up and made fateful eye contact with his team-mate.\nA quick cross, a deft finish, bedlam. And, perhaps, a theory vindicated.\n\"Ultimately it is the players who take all the credit. They make the decision on the pitch and seize that moment,\" says Kingston.\n\"Whether it [the goal] would have happened without our intervention, you never know, but you like to think that maybe you planted that seed and played a small part in a historic moment.\"\nIn November last year, as he studied upcoming opponents Belgium in his current role, Kingston thought he could see another detail that may sprout into something significant.\nKingston's fellow analysts Mousa El Habchi and Nabil Haiz joined him round the screen, along with Morocco's goalkeeping coach Omar Harrack.\nThe four men watched, pointing and discussing what they saw in a combination of French, Spanish, Darija [a Moroccan Arabic dialect] and English.\nAnd, finally, they plotted what they could do in response.\nThere have been two constants in Kingston's life: football and change.\nBorn in a British military hospital in Berlin, he has been moving ever since. His father switched stations to Northern Ireland before moving to the north east of England and a base outside Newcastle.\nHis family eventually settled in Somerset, before Kingston headed west to study sports coaching and development at university in Cardiff.\nHis student life was supplemented with a semi-professional football career playing for Bridgend, but he was realistic.\nHis chances of making it as a player were minimal. Without that background, a top job as a coach was also unlikely. As he wondered which direction to take, by luck, another route into the elite opened up.\nCardiff City, in the Championship and led by Dave Jones, were building their video analysis department. They asked if any of the local students would take on some of the work. Kingston, in the final year of his studies, volunteered.\nHis reading of Cardiff's patterns, strengths and vulnerabilities was sharp enough to break into a growing industry.\nHe got an internship with the Bluebirds, but he also kept moving. Kingston went to Tottenham to work with the age-grade sides. He went to Burnley, working under Eddie Howe as the head of analysis,. It was only belatedly he realised he was the only member of the department he was leading.\nAfter a little over a year, he was hired by new Liverpool manager Brendan Rodgers and remained in place when Rodgers was replaced by Klopp in 2015.\n\"Both Brendan and Jurgen really embraced analysis,\" Kingston says of his time at Liverpool.\n\"For Brendan it was about getting his philosophy across and my role was measuring how the team is performing against his clear ideas.\n\"And it was similar with Jurgen at the start. We had a really busy calendar when he arrived in the October. He is famous for his intensity in training, but there was little time to train.\n\"We were in the Europa League, playing that Thursday and Sunday cycle, travelling and recovering for the first seven months or so.\n\"That meant there was a huge, huge amount of video work done, because there wasn't the time to do things on the pitch.\"\nFar from being a stop-gap, video analysis is now a permanent fixture at Liverpool, throughout the Premier League and around the footballing world.\n\"Both Brendan and Jurgen have an assistant coach in their staff with a background in analysis,\" Kingston says. \"Brendan has Chris Davies and Jurgen has Peter Krawietz.\n\"Those connections with the manager show the growth in the field. It is the same at other clubs, like Newcastle, Burnley and Nottingham Forest to name just a few.\n\"You see the analysts more now. They are just more visible, either as assistant managers or down in the dug out next to the manager impacting on decisions.\"\nThen came Kingston's own big decision - to leave Liverpool for Morocco.\nAlexander-Arnold's quick corner against Barcelona had been followed by a Champions League final win, success in the European Super Cup and the Club World Cup, as well as a long sought-after Premier League title for the club.\nIt was a streak of success to match the glory days of decades past.\nBut, after eight successful years at Anfield, Kingston did not want to stall.\n\"Once we had achieved what we had achieved, it kind of felt like the right moment to leave,\" he says.\n\"What more can we do? You can go again and try to win it again and again, but it had always been in me to experience working abroad, to work internationally, to challenge myself in a different way.\n\"Family is also very important to me. Our daughter Poppy-Rose was two at the time and it was the best time to go for it, while she is young and adaptable. It meant she could have that experience and, together with my wife Leah's great support, we could create some fantastic memories as a family.\"\nBy Kingston's admission, Morocco \"was not necessarily the first place on the map I thought of\". Then he visited.\nHe was given a tour of the Mohammed VI Football Complex - and was immediately blown away.\nOpened in 2019, it is a flagship project of Morocco's king Mohammed VI.\n\"It is like nothing I have ever seen,\" says Kingston.\n\"It is like a football village, there are eight pitches, an indoor arena, futsal arena, hotels, medical centres, gyms - everything is on site.\"\nThe transfer from the airport to the Rabat complex, which serves as a headquarters for all Morocco's national teams, also left a lasting impression.\n\"It is is only a few minutes drive, but we must have seen 10 football pitches and they were all full,\" recalls Kingston.\n\"The climate helps, you can play football all year round, but everyone is football crazy. The games were cage football, street football, five, six, seven-a-side games, and everyone from age eight to 80.\n\"This is a country that is serious about football. Thanks to the work of president of the Moroccan Football Federation and all those who had come before me, everything was there to make me realise the scale of the opportunity.\"\nHowever, three months before last year's World Cup in Qatar, that potential was in danger of being wasted once more.\nMorocco were without a manager.\nVahid Halilhodzic, who had overseen qualification, had been sacked, with the Moroccan Football Federation citing their \"differences and divergent visions\" on preparation for Qatar 2022.\nResults from warm-up friendlies had been patchy, including a 3-0 loss to the United States.\nA World Cup group featuring Croatia, 2018's runners-up, and Belgium, the second-ranked side in the world, awaited and hardly raised hopes while, behind the scenes, Osian Roberts, the Welsh technical director who had brought Kingston to Morocco, had stepped down and returned to the UK.\n\"That change of manager could have gone one way or another,\" admits Kingston.\nThe appointment of Walid Regragui, who represented Morocco in his playing days and who had guided Wydad Casablanca to the African Champions League, emphatically broke in the right direction.\nRegragui wasted no time. Tactically, Kingston was brought into Zoom calls on which the new manager's vision was explained to different, individual parts of the team, long before they arrived at his first training camp.\nCollectively, Regragui worked on creating a team that was highly organised and compact without the ball, but had the freedom to show individual quality in possession.\nBut Kingston also saw how Regragui worked on something less tangible and, perhaps, more important.\nFourteen of Morocco's 26-strong squad were born overseas. For Achraf Hakimi, the star wing-back, it was Spain. For Hakim Ziyech, the playmaker, it was the Netherlands. For Romain Saiss, the team's captain, France.\nA squad representing an already cosmopolitan African nation, had to also combine influences and culture from across Europe.\nRegragui, who was born in France, played in Spain and coached in the Middle East, was the perfect man to turn a potential problem into a potent weapon.\n\"Individually the talent was there and the players are playing at the highest level, but the challenge was bringing it together collectively,\" explains Kingston.\n\"The biggest thing the manager did was tap into the spirit of the Moroccan footballer.\n\"He is uniquely placed for that. He understands both sides of the coin - the European lifestyle and Moroccan cultural values. He was really smart in the psychological side of the players.\n\"Before the game against Belgium he put up a world map in a team meeting, showing where everyone - players and coaching staff alike - was from, with arrows coming back to Morocco. Walid emphasised we were coming together in a Moroccan style and identity.\n\"It was something unique, something we had that other teams didn't - being able to tap into those different football educations and bring them under one philosophy.\"\nMorocco also put an emphasis on set-pieces. Data showed they could be decisive in the cagey early games of tournaments. Morocco didn't need the numbers to convince them. Recent history was painful enough.\nIran scored the only goal of Morocco's opening match at the 2018 World Cup via a 95th-minute free-kick.\nCristiano Ronaldo's header from a fourth-minute corner decided their next game of that campaign against Portugal. Two games, two set-piece goals, two defeats and Morocco were the first team eliminated from the competition.\nAs Kingston and his team of analysts concentrated on set-pieces for Qatar, they saw something. Something that could help them in attack though, rather than defence.\n\"Thibaut Courtois is a world-class goalkeeper,\" says Kingston quickly. \"I am not saying there are 100 weaknesses in his game.\n\"But we looked at his positioning. He stands a little further back towards his second post, which he does because he is good at doing it. He's a big guy, he wants to come and claim things and be active.\n\"As a staff we collectively spoke and decided there was definitely an opportunity to exploit something.\"\nThe coach agreed. After a general team meeting, Kingston and his team took Morocco's set-piece specialists aside, unlocked an iPad and showed what they saw.\nA couple of days later, the world saw it too.\nTwice in the game against Belgium, Courtois was caught out by in-swinging free-kicks aimed at his near post.\nOn the first occasion, Ziyech's shot from out wide found the net, but the goal was ruled out for a marginal offside.\nOn the second, there was no reprieve. Courtois scrambled across and got a glove to Abdelhamid Sabiri's whipped effort, but couldn't keep it out.\nIt was the first goal in a 2-0 win for the Atlas Lions, setting them on course for the knockout stages.\n\"It felt like a bit of a turning point for us in the tournament,\" says Kingston.\nMorocco celebrated that first goal with a show of their Muslim faith, bowing prostrate (sujud) before their jubilant fans.\nAs the team's run gathered more momentum, via wins over Canada, Spain and Portugal, their values - not only as the first African nation to make the semi-finals, but also the first Arab one - came into focus.\nPassages of the Quran were recited in pre-shootout huddles, proud mothers danced with sons, Palestine flags were draped over shoulders after games.\n\"That opportunity was something we used to motivate the players,\" adds Kingston.\n\"Sometimes you can be so focused, you don't see the big picture outside.\n\"Faith, religion and culture are hugely influential throughout the squad, in terms of the belief and togetherness that it brings.\"\nKingston saw it close up, away from the cameras.\nThe squad would arrive at stadiums two hours before kick-off - well before their opponents - to allow time for prayers in the dressing room. On days off, staff and players would bond over trips to the mosque.\nHe felt the difference in the moments of contemplation, but also in the moments of celebration.\n\"The difference to a Premier League dressing room - where you might have 20 different nationalities - is most of those songs and cultural values are all the same,\" adds Kingston.\n\"They have all grown up with them and the Moroccans know how to celebrate, dancing and singing in the dressing room and continuing on the bus.\n\"It is a really nice thing to see and be part of.\n\"There is that photo with Jose Mourinho, when he is at Tottenham, and all the players are all staring down at their phones after a win., external\n\"They had just had an amazing result and all they wanted to do is tell people on Instagram, text and WhatsApp.\n\"Morocco was different, everyone really wanted to celebrate and enjoy it in the moment.\"\nThere was plenty more than a moment to celebrate as well.\nAfter the tournament, Kingston returned to Rabat, where the magnitude of what the team had achieved was reflected back to him on a bus parade through the capital.\n\"You see the emotion in people's face, they are 10 feet away and they are shouting and screaming, throwing things, flares are going off,\" remembers Kingston.\n\"It was fantastic to get that perspective because my overriding feeling after the semi-final defeat by France was disappointment. I felt there was at least one more step we could take.\"\nMorocco lost 2-0 to France and were then beaten 2-1 by Croatia in the third/fourth play-off match.\n\"Maybe I was being a bit greedy, but I really felt there was a moment that we could have gone past France,\" admits Kingston.\n\"Ultimately, though, we are more than happy in how we ended a fantastic tournament and to see the Moroccan public come out in huge numbers in Rabat will never leave me.\"\nThe King, who had taken to the streets to celebrate his country's quarter-final win over Spain,, external awarded medals to Morocco's players and staff when the bus finally reached the Royal Palace.\nThrough Kingston, England can claim some small part in the run, but Morocco will forever be a part of him too.\n\"Next for us is the Africa Cup of Nations in January 2024, and the Women's World Cup in the summer,\" he says, looking forward once again.\n\"We will have some different pressure now in the Africa Cup of Nations. Coming fourth at the World Cup, there will be a different expectation in terms of how we do and also how we perform because we won't necessarily be underdogs.\n\"Inshallah [if Allah wills it] we qualify and then we go to the tournament to try and achieve more history.\"\nWhy did Gabby Logan get into sport?: The broadcaster looks back at her career and shares her favourite music\nIt's demolition mixed with la dolce vita...: Amanda Holden and Alan Carr set out to renovate two crumbling properties in sun-drenched Sicily",
  "word_count": 2996,
  "scraped_at": "2026-02-14T01:53:21.838245",
  "_text_extracted": true
}