{
  "article_id": "e00188392db7",
  "url": "https://www.mirror.co.uk/sport/football/transfer-news/man-utd-osimhen-maguire-elanga-28999319",
  "title": "Man Utd transfer round - up : Victor Osimhen price quoted as Harry Maguire decision made",
  "date": "20230120T071500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd transfer round-up: Victor Osimhen price quoted as Harry Maguire decision made\nManchester United have already made two signings in the January transfer window and Erik ten Hag hasn't ruled out more additions before deadline day, although outgoings from Old Trafford could be more frequent\nManchester United certainly aren't finished in the January transfer window.\nThe Red Devils have already sealed two signings in loan moves for Wout Weghorst and Jack Butland, but Erik ten Hag has hinted that the club could strike again in the market should the \"right\" opportunity present itself. United are attractive suitors right now, with the side's nine-game winning run coming to an end on Wednesday.\nA frustrating 1-1 draw away to Crystal Palace denied boss Ten Hag his 10th successive victory, as fixtures come thick and fast for the Red Devils. But there's also business to be done off the pitch, with club chiefs set to sanction a series outgoings before deadline day on January 31 and planning ahead to the summer transfer window.\nHere's a round-up of the latest transfer news from Old Trafford.\nOsimhen price named\nNapoli will reportedly demand a whopping £130million to allow striker Victor Osimhen to leave the club in the summer. The 24-year-old Nigerian is understood to be on the Red Devils' shortlist as they look to find a permanent solution to their striking problem.\nAccording to Il Mattino, Osimhen, scorer of 12 league goals in 14 games this term, will only leave Naples at the end of the season and a decision on his future won't be made until after the campaign comes to an end. Napoli are currently top of Serie A, boasting a nine-point lead over champions and second-placed side AC Milan, with Luciano Spalletti's men searching for their first Italian title win since 1990.\nHave your say! Should Man Utd sign anyone else in January? Join the debate in the comments section.\nDortmund make contact over Elanga\nBorussia Dortmund have made an enquiry with United regarding loan deal for Anthony Elanga, German outlet Sport1 report. No offer was put forward but the Bundesliga giants are keen to sign the 20-year-old Sweden international on a temporary basis, hoping that he can bolster their bid to qualify for the Champions League.\nElanga is struggling for game-time under Ten Hag and has only made one start since the Red Devils returned to action after the World Cup. The winger is also believed to be wanted by Everton and Bournemouth, who're battling relegation from the Premier League.\nMaguire to stay\nHarry Maguire won't be allowed to leave Old Trafford this month, according to BBC Sport. As revealed by Mirror Football, the 29-year-old centre-back's lack of minutes prompted West Ham to consider a bid, as they're at risk of losing Craig Dawson to Wolves before the window closes.\nBut the Red Devils weren't interested in letting Maguire go, as Ten Hag firmly believes that his club captain still has an important role to play between now and May. Since playing the full game against West Ham on October, Maguire has made more starts for England (five) than United (three).",
  "word_count": 521,
  "scraped_at": "2026-02-14T02:19:30.184394",
  "_text_extracted": true
}