{
  "article_id": "e00a92c7aea8",
  "url": "https://www.teamtalk.com/manchester-city/citizens-choose-56-goal-superstar-priority-transfer-real-madrid-plotting-125m-raid",
  "title": "Man City choose 56 - goal superstar as  priority  transfer , with Real Madrid plotting £125m raid",
  "date": "20241025T123000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City choose 56-goal superstar as ‘priority’ transfer, with Real Madrid plotting £125m raid\nManchester City have reportedly already been in touch with Viktor Gyokeres regarding joining the club, amid interest in a £125million Erling Haaland snare by Real Madrid.\nGyokeres is currently one of the hottest commodities in Europe. With 56 goals in two seasons, plus the 13 games he has played this term, he’s one of the best goalscorers in the world currently.\nLinks to some of the biggest sides in the world have stemmed as a result of his performances.\nHowever, it is Premier League champions City who seem to have the best chance of getting him right now. Indeed, they have one of the best strikers in the world of their own, in Haaland, but it’s not certain he’ll remain for much longer.\nAccording to Sky Sport Switzerland, Real Madrid want him for the 2025/26 season, and the striker himself has ‘expressed clear desire’ to head there soon.\nWith a €150million (£125m/$162m) release clause, it’s believed life has been made ‘easier’ for Real in pursuit of Haaland.\nTo replace him, Gyokeres is viewed, with City said to be ‘already in contact’ with his entourage.\nDirector of football Hugo Viana is said to have made his signing a ‘priority’ and that he will be available for €100m (£83m/$108m), he is a cheaper option than the potentially departing Haaland.\nDON’T MISS: The 10 Man City players sold for the biggest transfer profits in the Pep Guardiola era\nGyokeres could join Amorim at City\nIf Gyokeres is to join the Citizens, he could link up with his current Sporting boss, Ruben Amorim.\nReports of late have suggested he is viewed as the ‘leading contender’ to replace Pep Guardiola, who is out of contract in Manchester at the end of the current campaign.\nThat move is one being viewed by Viana, who has joined City from Sporting.\nHe is also the man prioritising the snare of Gyokeres, and if he brings Amorim through the door, given how spectacular the striker has been under him, the boss could push for him, too.\nMan City round-up: Big La Liga names on radar\nWhile Haaland could head to La Liga at some point, City could take some stars from the league.\nFirstly, they are considering the signing of Arda Guler from Real themselves, with Kevin De Bruyne’s future up in the air.\nThey are also courting Raphinha after a phenomenal Champions League performances for Barcelona of late, with an £83m transfer in the offing.\nBut they could be beaten to the signing of promising youngster Andrija Maksimovic, who’s currently plying his trade with Red Star Belgrade, as Brighton is seemingly viewed as a better destination for him at the moment.",
  "word_count": 463,
  "scraped_at": "2026-02-14T01:57:46.241200",
  "_text_extracted": true
}