{
  "article_id": "e01b033b17c8",
  "url": "https://metro.co.uk/2025/04/01/arsenal-fulham-live-score-premier-league-lineups-updates-team-news-22825680/",
  "title": "Is Arsenal vs Fulham on TV ? Confirmed team news and predicted lineups",
  "date": "20250401T063000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bukayo Saka came off the bench to score on his Arsenal return as the Gunners sealed victory over Fulham on Tuesday night.\nThe Gunners have been without the England international since December after he suffered a hamstring tear at Crystal Palace at the end of 2024.\n101 days on from his last appearance for the club, Saka came off the bench midway through the second-half to score the goal that sealed all three points for his side.\nMikel Arteta resisted the urge to name Saka in his starting XI with the Arsenal boss also forced into an early change with Gabriel Magalhaes forced off after 15 minutes.\nThe Brazil international appeared to suffer a hamstring injury – a major concern with the first leg of Arsenal’s Champions League quarter-final just a week ago.\nMore Trending\nThe hosts led before the break however with stand-in striker Mikel Merino on target again to give his side the lead.\n10 minutes on from his introduction off the bench, Saka was teed up by the excellent Gabriel Martinelli to mark his return with a bang.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRodrigo Muniz’s consolation goal deep in injury time came too late to spark any Fulham comeback.\nRelive all the action with Metro’s LIVE blog.\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nFULL-TIME!\nArsenal get the win!\nArsenal 2-1 Fulham\n94 mins | Muniz’s effort takes a big deflection and Raya can’t react quick enough to keep it out.\nTwo minutes of injury time left…\nGOAL! Arsenal 2-1 Fulham | Rodrigo Muniz, 94 mins\nToo little too late for Fulham?\nArsenal 2-0 Fulham\n88 mins | Martinelli makes it three! But it’s ruled out for offside. It’s a wonderful pass from Odegaard to feed him through, cutting a cluster of Fulham players out of the game but the Brazilian is just off.\nArsenal 2-0 Fulham\n79 mins | Timber has another knock and this time, he can’t continue. Leandro Trossard is onto replace him with Partey dropping into right-back.\nArsenal 2-0 Fulham\n75 mins | Written in the stars, wasn’t it? Martinelli does all the grunt work on the left, teeing up Saka to score the most popular goal of the week.\nGOAL! Arsenal 2-0 Fulham (Bukayo Saka, 73)\nOn the pitch less than 10 minutes and Saka has his goal!\nArsenal 1-0 Fulham\n70 mins | As you might expect, every touch from Saka is being roared on by the Emirates crowd. The England international gets a dangerous cross into the box that Partey knocks back to Rice but his effort is blocked.\nArsenal 1-0 Fulham\n66 mins | And here he is. 101 days on from his last appearance for Arsenal, Bukayo Saka enters the fray, replacing Nwaneri.\nArsenal 1-0 Fulham\n64 mins | A huge let off for Arsenal! Kiwior lets a bouncing ball evade him and Traore races onto it.\nJimenez is waiting for the square pass but Traore decides to go his own way and scuffs a wild effort wide.\nArsenal 1-0 Fulham\n58 mins | Arsenal close again! Saliba meets Odegaard’s cross but he hammers his header over the bar.\nArsenal 1-0 Fulham\n56 mins | A few nervy moments for Arsenal prior to that Timber chance. Jimenez was able to hustle his way past Timber with his shot on goal parried away with Lewis-Skelly sparing his blushes, just about getting to the rebound ahead of Smith Rowe.\nArsenal 1-0 Fulham\n54 mins | A fine save from Leno denies Arsenal a second!\nTimber plays a lovely one-two with Odegaard, fed through on goal but the former Arsenal goalkeeper makes a fine save.\nArsenal 1-0 Fulham\n50 mins | More tidy work from Martinelli down the left who again cuts an inviting ball back for Odegaard. The Norwegian’s hit is a fairly wretched one, lifting it well over the bar.\nSECOND-HALF UNDERWAY\nAnd we are back underway in north London.\nMerino’s goal the difference but concern for Gabriel\nAnother goal for Mikel Merino has the Gunners in charge at the break. Not the most convincing performance – perhaps the introduction of Bukayo Saka can change that?\nThere will real concern for Gabriel Magalhaes meanwhile with the Brazil international forced off after 15 minutes with what appeared to be a hamstring injury just a week away from the Real Madrid game.\nMerino’s goal the difference but concern for Gabriel\nAnother goal for Mikel Merino has the Gunners in charge at the break. Not the most convincing performance – perhaps the introduction of Bukayo Saka can change that?\nThere will real concern for Gabriel Magalhaes meanwhile with the Brazil international forced off after 15 minutes with what appeared to be a hamstring injury just a week away from the Real Madrid game.\nHALF-TIME! Arsenal 1-0 Fulham\nThe Gunners lead at the break.\nArsenal 1-0 Fulham\n41 mins | That goal has given Arsenal the lift they really needed. Martinelli looks to cause some havoc down the left, this time picking out Odegaard whose shot on goal is blocked.\nArsenal 1-0 Fulham\nAnother very tidy finish from the stand-in centre forward! Nwaneri finds his teammate who’s effort on goal appears to take a big deflection as it finds its way into the bottom corner.\nMORE: Ian Wright raises Gabriel ‘season-ending injury’ fear as Arsenal suffer new setback\nMORE: Paul Parker names uncapped English star ‘one of the best Premier League midfielders’\nMORE: England captain Harry Kane speaks out over Liverpool transfer links",
  "word_count": 973,
  "scraped_at": "2026-02-14T02:26:33.625826",
  "_text_extracted": true
}