{
  "article_id": "e05f53d7033f",
  "url": "https://www.orissapost.com/guardiola-uses-nicklaus-jordan-to-defend-cl-failure/",
  "title": "Guardiola uses Nicklaus , Jordan to defend CL failure",
  "date": "20230412T040000Z",
  "domain": "orissapost.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Youth sentenced to life imprisonment for sexual assault, mu*der of 4-year-old boy\nBerhampur: A special POCSO court in Bhubaneswar on Friday sentenced a 26-year-old man to life in jail after convicting him in the sexual assault and mu*der of a four-year-old boy three years ago. Additional District Judge (ADJ)-cum-judge of the special...\nOdisha: Man gets death for killing wife in acid attack\nBhubaneswar: A court in Odisha’s Balasore district Friday sentenced a man to death for killing his second wife in an acid attack. The convict, Chandan Kumar Rana of Santaragadia village under Nilgiri police limits in Balasore district, had allegedly concealed...\nTwo drug traffickers get 10 years’ RI in Bhubaneswar NDPS court\nBhubaneswar: A Special NDPS Court here sentenced two drug traffickers to 10 years of rigorous imprisonment along with a fine of Rs 1 lakh each, an official said Friday. Mangal Ram Mahato and Kumar Dili, both residents of Dhanbad, were...\nToddler dies after falling into open borewell in Puri\nPuri: A one-and-a-half-year-old girl reportedly died after falling into an uncovered borewell at the District Headquarters Hospital in Puri Friday. The child, Samayira Nayak, daughter of Ajay Nayak of Mangala Sahi in the Narendra Kona area, had gone to visit...\nTwo held for ‘exploiting’ migrant workers from Odisha\nBerhampur: Odisha Police has arrested two persons, including a man from Tamil Nadu, for allegedly exploiting three migrant workers from Ganjam district after trafficking them, police said Friday. The accused were identified as Khirod Tandi (28) of Palnagar in Bolangir...\nAfter victory, BNP pushes for Sheikh Hasina’s extradition from India\nDhaka: The Bangladesh Nationalist Party (BNP), which secured a landslide victory in the general elections, Friday reiterated its firm stance on seeking the extradition of ousted former Prime Minister Sheikh Hasina from India to face trial. \"The foreign minister has already persuaded the case for her extradition, and we also...\nRead moreDetailsSeva Teerth, Kartavya Bhawan are important milestone in India’s journey towards Viksit Bharat: PM\nNew Delhi: Prime Minister Narendra Modi Friday said the new buildings housing the Prime Minister's Office (PMO) and the central secretariat mark are an important milestone in India's journey towards 'Viksit Bharat' (developed India) and they reflect the government's commitment to citizen-centric governance and national progress. Inaugurating the new PMO, named Seva Teerth, and two buildings of the central secretariat, called Kartavya Bhawan 1 and 2, Modi also said that the...\nRead moreDetailsRahul meets farm union leaders, launching movement against India-US trade deal discussed\nNew Delhi: Leader of Opposition in the Lok Sabha Rahul Gandhi met farm union leaders from across the country in the Parliament House complex on Friday and discussed with them the need for a countrywide movement to oppose the India-US interim trade deal as well as safeguarding the livelihoods of farmers and farm labourers. Posting a video of the meeting on X and taking a dig at Prime Minister Narendra Modi,...\nRead moreDetailsTarique Rahman emerges as new face of Bangladesh; know everything about him\nDhaka: Tarique Rahman, who lived in London in self-exile for 17 years, has emerged as the new face of Bangladesh, with the party founded by his father set to return to power after a 20-year gap. The 60-year-old leader's Bangladesh Nationalist Party (BNP) has bagged 209 out of 297 seats, while right-wing Jamaat-e-Islami, known to be close to Pakistan, secured 68 seats. The Awami League party of Hasina was barred from...\nRead moreDetailsSC seeks CBI’s status report on Manipur violence; asks Centre, state to implement panel’s report\nNew Delhi: Supreme Court Friday asked the CBI, which is probing 11 FIRs related to the 2023 Manipur ethnic violence cases, to submit a status report within two weeks. A bench comprising Chief Justice Surya Kant and Justice Joymalya Bagchi also mooted the idea that instead of the apex court, the jurisdictional Manipur High Court, which has a new chief justice, or the Gauhati High Court or both monitor the trials...\nRead moreDetailsFeatured\nTrending\nMore Top Stories\nHoroscope February 14: Valentine’s Day surprise awaits Aquarius and Pisces, with unexpected twist\nDiscover your horoscope today with the help of the astrology predictions for all zodiac signs. Get daily horoscope updates and accurate astrology readings for your star sign, daily updates on love, career, and life. Find out what the stars have in store for you. Aries: Career decisions and money matters will keep you busy today. And after...\nT20 World Cup: Mukkamalla, Harmeet fashion big win for United States\nChennai: Saiteja Mukkamalla's attractive 79 and a four-wicket haul by former India U-19 star Harmeet Singh powered United States to a comfortable 93-run victory over the Netherlands in a group league fixture of the T20 World Cup in Chennai Friday. This is USA's first-ever T20I victory over the Netherlands. Mukkamalla's 51-ball knock formed the cornerstone of USA's...\nYouth sentenced to life imprisonment for sexual assault, mu*der of 4-year-old boy\nBerhampur: A special POCSO court in Bhubaneswar on Friday sentenced a 26-year-old man to life in jail after convicting him in the sexual assault and mu*der of a four-year-old boy three years ago. Additional District Judge (ADJ)-cum-judge of the special court under the POCSO Act, Pranati Pattnaik, sentenced Sukant Sethi to life imprisonment and also imposed a...\nOdisha: Man gets death for killing wife in acid attack\nBhubaneswar: A court in Odisha’s Balasore district Friday sentenced a man to death for killing his second wife in an acid attack. The convict, Chandan Kumar Rana of Santaragadia village under Nilgiri police limits in Balasore district, had allegedly concealed his first marriage before marrying the victim, Banita Singh of Bhimpura village under Sahadevkhunta police station. Special...\nTwo drug traffickers get 10 years’ RI in Bhubaneswar NDPS court\nBhubaneswar: A Special NDPS Court here sentenced two drug traffickers to 10 years of rigorous imprisonment along with a fine of Rs 1 lakh each, an official said Friday. Mangal Ram Mahato and Kumar Dili, both residents of Dhanbad, were convicted by the court of the 3rd Additional District and Sessions Judge, Bhubaneswar, according to an official...\nSeva Teerth, Kartavya Bhawan are important milestone in India’s journey towards Viksit Bharat: PM\nNew Delhi: Prime Minister Narendra Modi Friday said the new buildings housing the Prime Minister's Office (PMO) and the central secretariat mark are an important milestone in India's journey towards 'Viksit Bharat' (developed India) and they reflect the government's commitment to citizen-centric governance and national progress. Inaugurating the new PMO, named Seva Teerth, and two buildings of...\nRahul meets farm union leaders, launching movement against India-US trade deal discussed\nNew Delhi: Leader of Opposition in the Lok Sabha Rahul Gandhi met farm union leaders from across the country in the Parliament House complex on Friday and discussed with them the need for a countrywide movement to oppose the India-US interim trade deal as well as safeguarding the livelihoods of farmers and farm labourers. Posting a video...\nToddler dies after falling into open borewell in Puri\nPuri: A one-and-a-half-year-old girl reportedly died after falling into an uncovered borewell at the District Headquarters Hospital in Puri Friday. The child, Samayira Nayak, daughter of Ajay Nayak of Mangala Sahi in the Narendra Kona area, had gone to visit her uncle near the hospital. According to a source, the borewell drilled for construction of a new...\nTwo held for ‘exploiting’ migrant workers from Odisha\nBerhampur: Odisha Police has arrested two persons, including a man from Tamil Nadu, for allegedly exploiting three migrant workers from Ganjam district after trafficking them, police said Friday. The accused were identified as Khirod Tandi (28) of Palnagar in Bolangir district, currently residing at Mangalam in Tamil Nadu's Tiruppur district, and Karthi (24) of Nagaratham in Tamil...\nTarique Rahman emerges as new face of Bangladesh; know everything about him\nDhaka: Tarique Rahman, who lived in London in self-exile for 17 years, has emerged as the new face of Bangladesh, with the party founded by his father set to return to power after a 20-year gap. The 60-year-old leader's Bangladesh Nationalist Party (BNP) has bagged 209 out of 297 seats, while right-wing Jamaat-e-Islami, known to be close...",
  "word_count": 1339,
  "scraped_at": "2026-02-14T01:53:35.627588",
  "_text_extracted": true
}