{
  "article_id": "e0815724364d",
  "url": "https://eng.obozrevatel.com/section-news/news-ukrainians-refused-to-shake-hands-with-russian-national-team-player-at-the-cup-match-russian-media-demanded-expelling-our-club-from-the-tournament-01-11-2023.html",
  "title": "Hit - Sporting - Ukrainians refused to shake hands with Russian national team player at the Champions League mini - football match",
  "date": "20231101T104500Z",
  "domain": "eng.obozrevatel.com",
  "source_country": "Ukraine",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "News\nUkrainians refused to shake hands with Russian national team player at the Cup match: Russian media demanded expelling our club from the tournament\nPlayers of the mini-football club Hit (Kyiv) refused to shake hands with Russian Anton Sokolov before the Champions League match against Sporting. Our compatriots defiantly ignored the representative of the national team of the aggressor country.\nThe meeting took place on October 25 and ended in a 2-2 draw. During the traditional pre-match greeting, Kyiv residents did not shake hands with the Russian, reminding him of his country's crimes against Ukraine. In response, Sporting's players refused to shake hands after the match, and the team's coach took his teammates to the locker room immediately after the final siren.\nPropagandistic Russian journalists immediately demanded sanctions against Ukrainian athletes. According to Russian media outlets, the European Football Union (UEFA) has opened a disciplinary case over the scandal.\n\"In an ideal world, the Ukrainian club should be disqualified and kicked out of the tournament. At the very least, it could be a point deduction. Will UEFA have the courage to follow the rules and punish the Kyiv club?\" one of the largest websites of the terrorist state writes.\nAs of the morning of November 1, there is no information on the UEFA website about the opening of proceedings regarding this case.\nAs OBOZ.UA previously reported, former players of Dynamo Kyiv and Shakhtar Donetsk Ramiz Mamedov and Oleksandr Babych entertained the occupiers during an exhibition match in Luhansk.\nOnly verified information on our Telegram OBOZ.UA and Viber. Do not fall for fakes!",
  "word_count": 262,
  "scraped_at": "2026-02-14T02:13:18.782583",
  "_text_extracted": true
}