{
  "article_id": "e083e98d8e32",
  "url": "https://metro.co.uk/2026/01/28/wrong-decision-manchester-united-accused-making-74m-transfer-mistake-26567857/",
  "title": "  Wrong decision  - Man Utd accused of making £74m transfer mistake | Football",
  "date": "20260129T001500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Louis Saha has accused his former club Manchester United of making a costly mistake in the transfer market.\nUnited backed former manager Ruben Amorim with almost £200m of signings last summer, with Matheus Cunha, Bryan Mbeumo, Benjamin Sesko and Senne Lammens all arriving at Old Trafford.\nCunha and Mbeumo, who both scored in Sunday’s impressive win over title favourites Arsenal, already look to be shrewd acquisitions and have attracted praise from several United legends.\nLammens has also impressed since joining United, displacing Andre Onana as the No. 1 at Old Trafford and showing signs he can keep that status for years to come.\nSesko has fared less well since completing a £74m move from RB Leipzig, however, scoring just five goals in all competitions.\nSaha believes Sesko is a ‘good player’ and a ‘terrific lad’ but has questioned how he was ever going to succeed as a relatively unproven 22-year-old expected to be the club’s first-choice striker.\nSigning Sesko was ultimately a ‘wrong decision’, according to Saha, and an ‘even worse’ blunder than the appointment of Amorim, who was sacked after just 14 months in charge earlier in the month.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I think he’s a terrific lad and a good player,’ Saha told Gambling.com. ‘He maybe has a confidence issue, and I totally understand why.\n‘I think we said it way before. I think what they have done wrong is bringing in a young player, like 21 or 22, and expecting them to score 20 goals a season without an experienced player ahead of them.\n‘We’ve had Ibrahimovic, Rooney, Ronaldo and Van Nistelrooy before. You know, all those players are so important for young players.\n‘Until they understand that, it’s totally normal that he’s like learning in a process of performing. It’s extremely hard. It’s extremely hard and demanding.\n‘I have never been in that position. I had Solskjaer, Tevez and Alan Smith. I had Van Nistelrooy and even Henrik Larsson. He came for six months, and I learned.\n‘I was able to learn because I was less under pressure because of those players; they don’t perform well sometimes. OK, I don’t perform as well.\n‘But those are, let’s say, better players or more expensive players. People expect more from them.\n‘Sesko is a terrific lad. You can see that he wants to work hard. He wants to improve. His training sessions are apparently top top top every day.\n‘He will improve, but under pressure, trying to perform and score every week, it’s almost impossible.\n‘Who has decided this for the last three years? Oh my god, it’s a wrong, wrong decision, and it’s even worse than picking the wrong manager.’\nSesko scored 39 goals in 87 appearances in his two seasons at RB Leipzigand attracted interest from Arsenal and Newcastle United as well as the Red Devils.\nMore Trending\nArsenal decided to sign Viktor Gyokeres instead of Sesko but the Sweden international has also endured a slow start to his Premier League career.\nSesko was an unused substitute in United’s derby win over Manchester City and came on for the final ten minutes of Sunday’s win at Arsenal.\nThe Slovenia international will hope to get more game-time under caretaker boss Michael Carrick but Tim Sherwood has told Metro that is unlikely.\nManchester United, back in the Champions League places after beating Man City and Arsenal, face Fulham this weekend.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: ‘I’m devastated’ – Steven Gerrard sends warning to Arsenal after failed Liverpool transfer\nMORE: Joe Cole singles out Chelsea star for praise after Champions League win over Napoli\nMORE: Chelsea hero Joe Cole ‘gutted’ Blues let Arsenal sign ‘outstanding player’",
  "word_count": 675,
  "scraped_at": "2026-02-14T01:53:15.577295",
  "_text_extracted": true
}