{
  "article_id": "e0b976ae385d",
  "url": "https://fansided.com/posts/nwsl-news-royals-add-zornoza-lyon-s-cascarino-linked-to-sd",
  "title": "NWSL news : Royals add Zornoza , Lyon Cascarino linked to SD , and more",
  "date": "20240712T220000Z",
  "domain": "fansided.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NWSL news: 2023 World Cup winner Claudia Zornoza pens deal with Utah Royals FC after three seasons in Liga F at Real Madrid\nFrom the Spanish capital to the mountains of Utah. The ex-Real Madrid midfielder Claudia Zornoza has found a new home. Zornoza, who joins the last-place Utah Royals FC a week after Japanese international Mina Tanaka hopped on board through 2025, inked a contract through 2025 with an option for 2026. Per the club, she'll join the club pending receipt of her ITC (International Transfer Certificate).\n“Her ability on the ball will help us with our build out of the back, and her veteran presence will be important for our locker room as we enter the second half of the season,\" said Utah Sporting Director Kelly Cousins.\nZornoza began playing professional first division football in 2008, competing for Atlético de Madrid, Valencia, Levante, and most recently Real Madrid. The Madrid native, who was announced to be leaving Las Blancas on June 18, was widely considered one of the club's most consistent players in the midfield.\nLast season, the club's No. 21 played in 28 league contests, the second most by a Madrid player behind only forward Athenea del Castillo. She was one of five players from Alberto Toril's crew to play in all six of the side's UEFA Women's Champions League fixtures in 2023-2024.\nShe has been seen playing in multiple areas in the midfield - in a double pivot alongside Teresa Abelleira, or in a more attacking role on the wing among other spots. Her creativity and willingness to make things happen is clear as day in her play. She sits in the 96th percentile in progressive passes and the 91st percentile in shot-creating action among midfielders.\nIt doesn't look like the Royals are enjoying the basement of the table. Kelly Cousins is without question doing her best to supply the next sideline leader with an adequate amount of talent to reach the expected success. We've seen far too much youth and not enough investment in surrounding those youngsters with experienced proven professionals. Adding Amandine Henry was the first step. Now, with Zornoza and Tanaka on board, you can begin to see the desire to find a club identity prior to the end of the campaign.\nNWSL news: Per Le Parisien, San Diego Wave FC is \"in pole position\" to sign long time Lyon attacker Delphine Cascarino\n10th place San Diego Wave FC looks like it is on the verge of adding even more attacking talent to its roster. According to a report by Le Parisien, a French newspaper, contract talks between Lyon and Delphine Cascarino \"have not been successful\", and San Diego Wave is \"in pole position\" to add the 27-year-old French international. Per the report on the morning of July 12, \"small details remain to be settled to complete the operation\" between the two parties.\nCascarino has been with Lyon since 2009, making her senior debut for the French powerhouse during the 2014–15 Division 1 Féminine season. She scored her first UEFA Women's Champions League goal less than 10 days after signing her first professional contract with the club in 2017. The 27-year-old versatile attacking threat, who missed the 2023 World Cup and a substantial portion of last season due to an ACL injury, scored 17 goals and assisted on 24 in 114 league outings for Lyon per FBref.\nSan Diego is on a nine-match winless streak, firing Shield-winning head coach Casey Stoney two days after a scoreless draw against the Houston Dash. The six-time Champions League winner and nine-time French league champion winger would be joining an underachieving attacking unit that includes Jaedyn Shaw, Mexican international Maria Sanchez, and Alex Morgan.\nSan Diego has not found success in its transition to a more possession-based side of play, scoring 12 goals in 16 games, the third-fewest in the entire NWSL.\nNWSL news: The NWSL June Best XI, presented by Amazon Prime, was released with four KC Current players in the lineup\nKansas City Current was the most well-represented team in the NWSL's June Best XI, presented by Amazon Prime. The league announced the lineup of 11 players voted on by the NWSL Media Association and the NWSL’s on-air broadcast talent at noon. Here is how is what the XI looks like:\nGoalkeeper: Anna Moorhouse (Orlando Pride)\nDefenders: Elizabeth Ball (KC Current), Jenna Nighswonger (Gotham FC), Casey Krueger (Washington Spirit), Izzy Rodriguez (KC Current)\nMidfielders: Croix Bethune (Washington Spirit), Rose Lavelle (Gotham FC), Lo’eau LaBonta (KC Current)\nForwards: Barbra Banda (Orlando Pride), Temwa Chawinga (KC Current), Mallory Swanson (Chicago Red Stars)\nKrueger, Nighswonger, Banda, and Chawinga all made their second appearance on the NWSL’s Best XI of the Month this season while Bethune was featured for the third straight time. It was Krueger's 14th time being named to an NWSL Best XI of the Month, extending her NWSL record. Anna Moorhouse, who just earned her first England national team call-up, and Izzy Rodriguez are making their debuts on the NWSL's Best XI of the Month.",
  "word_count": 839,
  "scraped_at": "2026-02-14T01:48:56.595661",
  "_text_extracted": true
}