{
  "article_id": "e0d4120d8215",
  "url": "https://metro.co.uk/2025/04/29/djurgardens-make-complaint-ahead-chelsea-clash-uefa-conference-league-22995593/",
  "title": "Djurgardens IF make complaint ahead of Chelsea clash in UEFA Conference League",
  "date": "20250429T180000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Swedish club Djurgardens IF have made a complaint ahead of Thursday’s UEFA Conference League semi-final first leg clash against Chelsea.\nDjurgarden host Chelsea at the 3Arena in Stockholm and head into the European showdown as huge underdogs against Enzo Maresca’s side.\nChelsea are significant favourites to clinch the Conference League trophy this season having dominated the league phase earlier this season.\nThe Premier League side finished top – winning all six of their games – scoring 26 goals and conceding just five times across the league phase.\nChelsea then eliminated Danish team FC Copenhagen and Polish club Legia Warsaw in the Conference League last 16 and quarter-finals.\nIf the Blues come out on top against Djurgarden in the last four, Chelsea will face either Spanish side Real Betis or Fiorentina of Italy in the final.\nBefore the Conference League semi-finals, Djurgarden have complained about their stadium’s pitch, which is an artificial surface rather than grass.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘The ball just slides away from your foot all the time,’ Djurgarden winger Tokmak Nguen said.\n‘In deciding situations when you have decided what to do suddenly the ball has moved for no reason. We have told the club that something has to be done.’\nSpeaking about Djurgarden’s quarter-final first leg defeat to Rapid Vienna – before they turned things around in the second leg away from home to reach the last four – striker August Priske also voiced his frustration.\n‘I don’t want to blame the pitch of course, but it’s a s****y pitch,’ the 21-year-old said.\nDjurgarden manager Jani Honkavaara, meanwhile, added: ‘The stadium pitch feels different from day to day.\n‘It’s really tough for both us and our opponents. We get nothing extra from it.\n‘The pitch is horrible. I have thought of letting us train more on the stadium pitch to get used to it.’\nMore Trending\nDespite complaints from several players and the club’s head coach, Djurgarden’s hierarchy are currently refusing to change the playing surface.\nThe board insists ‘the issue has already been investigated and pursued by those responsible at Djurgarden Football and that the conclusion is that there are not sufficiently good conditions to change the basis’.\nThey argue that the ground is not designed for any surface other than artificial grass and added that it would cost too much money to replace.\nChelsea will hope the issue doesn’t impact their own chances of progressing as they look to become the first club to win all three European club competitions – Champions League, Europa League and Conference League – with the latter having been only introduced in the 2021-22 season.\nMORE: Chelsea star submits transfer request after Arsenal approach in January\nMORE: Theo Walcott wishes Arsenal signed £100m star ahead of Chelsea\nMORE: Alan Shearer backs five teams to challenge Liverpool for the title next season",
  "word_count": 522,
  "scraped_at": "2026-02-14T02:09:01.851807",
  "_text_extracted": true
}