{
  "article_id": "e10ce557dcab",
  "url": "https://www.teamtalk.com/aston-villa/submit-offer-learning-high-pedigree-defender-meunier-emery-trusts-can-join-astonishingly-low-fee",
  "title": "Aston Villa submit offer after learning high - pedigree defender Emery trusts can join for astonishingly low fee",
  "date": "20230624T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa\nPremier League • England\nAston Villa submit offer after learning high-pedigree defender Emery trusts can join for astonishingly low fee\nAston Villa are in the hunt for Borussia Dortmund right-back Thomas Meunier after learning the tempting price tag his employers have set, according to a report.\nMeunier is a famous name in European football after earning more than 60 caps for the Belgium national team. At club level, he has been with Borussia Dortmund since 2020, when they signed him on a free transfer after his departure from Paris Saint-Germain.\nIn the season just gone, though, Meunier only made 10 appearances in the Bundesliga, just seven of which were starts. Now, he is considered expendable by Edin Terzic’s team.\nIndeed, a report from Bild has revealed that Aston Villa are interested in bringing Meunier to the Premier League for the first time in his career.\nIn fact, they are said to have submitted an offer to the defender. His wages have become a burden for Dortmund, but he could retain a decent salary at an English club.\nAnd to get their man, Villa would only have to pay a transfer fee in the region of €3m (£2.6m).\nREAD MORE – Aston Villa transfers: Emery lines up next signing as double Leeds raid expected despite big-name rivals\nIt would be a bargain fee for a player who previously commanded a much higher asking price. In fairness, though, he is now the wrong side of 30 and is entering the final year of his contract with Dortmund.\nEager to get him off the books, Dortmund would be willing to greenlight a sale at such a low price, then.\nAston Villa face triple Italian competition for Meunier\nVilla are not the only club who might be considering an offer for Meunier. According to the report, the 31-year-old is also attracting Juventus, Inter and AC Milan. Any of them could take him to Serie A for the first time.\nHowever, what might work in Villa’s favour is Meunier’s existing connection with Unai Emery, who previously gave him 70 appearances during their time together at PSG.\nOnly former Club Brugge boss Michel Preud’homme has given Meunier more appearances anywhere in his career.\nBack in 2019, there were reports that Emery was still in contact with Meunier, who he could have taken to Arsenal at the time.\nWherever he goes now, Meunier is said to be eager to leave Dortmund ‘as soon as possible’. His destination could be Villa if they can usurp any offers on the table from the Italian trio tracking him.\nEmery is building an exciting project at Villa, who he has led into next season’s Europa Conference League.\nThat, coupled with the ‘lucrative’ finances they might be able to offer, may yet give them the edge in their pursuit of Meunier. But he could continue at Champions League level with either Inter or Milan, so the race for his signature should remain open for the time being.\nVilla’s current starter at right-back is usually Matty Cash. The club are releasing his main deputy, Ashley Young, though.\nHence, they could do with some more experience in the full-back positions. Meunier could be their answer in what would be a high-profile addition for Villa, despite his decline in fortunes over recent months.",
  "word_count": 550,
  "scraped_at": "2026-02-14T01:56:02.423476",
  "_text_extracted": true
}