{
  "article_id": "e1342ad3e2f0",
  "url": "https://www.teamtalk.com/manchester-city/thunder-into-contention-for-shock-signing-of-former-norwich-star-sources",
  "title": "Man City transfers : Cityzens thunder into contention for shock signing of former Norwich star",
  "date": "20250501T151500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City thunder into contention for shock signing of former Norwich star – sources\nManchester City are considering a surprise move for former Norwich City star Gabriel Sara this summer, but face competition from TWO Premier League rivals for the 25-year-old, TEAMtalk understands.\nThe Cityzens are gearing up for a big window in which we could see many players come and go, as Pep Guardiola looks to build a squad capable of dominating European football again.\nSources have confirmed that ex-Norwich midfielder Sara, who signed for Turkish giants Galatasaray last summer, is being tracked by Man City.\nThe talented midfielder has notched two goals and seven assists this season, and his performances are generating interest from the Premier League.\nWe understand that three English sides have made enquiries about his situation: Man City, Wolves, and Nottingham Forest.\nNothing is advanced yet, but Wolves view Sara as a potential replacement for Matheus Cunha, who Manchester United are very confident of signing this summer, as reported. Sara can play in a No. 10, eight or six role in midfield, and his versatility is appealing to his suitors.\nSara is under contract until 2029, so Galatasaray are in a position to demand a sizeable fee for his signature, but he would be interested in an exit if the right opportunity presents itself.\nREAD MORE: Man City explode into race for TOP Liverpool target with dramatic hijack ON – sources\nSara generating concrete Premier League interest\nSources have made clear that Galatasaray do not want to lose Sara but they are aware of the interest in him, and there is a belief that he would be keen to play for a side competing for trophies in one of Europe’s biggest leagues.\nThat is good news for Man City and but could spell trouble for Wolves, who won’t be able to offer the midfielder European football.\nNottingham Forest, meanwhile, still stand a good chance of sealing Champions League qualification and look set to be playing in the Europa League or Europa Conference League at least next term.\nNorwich received a guaranteed £20m for Sara when they sold him last summer, with a potential extra £2.5m based on bonuses, and they also have a sell-on clause.\nThere is no mention of a specific release clause for Sara but there have been some murmurs that there may be a one for English sides playing in the Champions League. If that is the case, it would make Sara a very attractive option and he a player to watch out for in the coming weeks.\nLatest Man City news\n👉 Man City shut down one Jack Grealish exit route as major U-turn discussed\n👉 Liverpool learn fee for spectacular midfield signing as Man Utd, Man City threaten – sources\n👉 Man City to sign free-scoring PSG forward after agreement CONFIRMED – report\nWho is Gabriel Sara?\nGabriel Sara started out at Sao Paulo in his native Brazil, making 120 appearances. He won their state league in 2021.\nIn the summer of 2022, he caught the attention of Championship side Norwich City, who brought him to English football for £6m.\nSara enjoyed two positive seasons in the second tier of English football, scoring seven in his first and 13 in his second (plus one in the FA Cup).\nTop-flight football beckoned for Sara in 2024, when Galatasaray won the race to sign him. His impact in the Turkish Super Lig was swift.\nSara had seven goal contributions to his name by the end of October in the league, highlighting his ability to get involved in the final third.\nA midfielder who excels with his passing and dribbling ability, Sara is also strong, which makes him a valuable asset in the middle of the park.\nAction is the word when it comes to Sara; that’s what he’s all about. While he was originally an attacking midfielder, he can now play anywhere centrally.\nHis technique is impressive, enhanced even more by his vision. He can spot the key passes to make and then execute them.\nSara is now coming towards the prime of his career, so it will be interesting to see where he spends it.\nDON’T MISS: The SEVEN Manchester City players out of contract in 2026: Keep or sell?",
  "word_count": 715,
  "scraped_at": "2026-02-14T01:52:20.882275",
  "_text_extracted": true
}