{
  "article_id": "e13d60e6a4ad",
  "url": "https://cartilagefreecaptain.sbnation.com/2023/7/8/23787330/tottenham-hotspur-women-transfer-news-rumors-luana-buhler-hoffenheim-switzerland-done-deal",
  "title": "DONE DEAL : Spurs Women sign Swiss international defender Luana Bühler",
  "date": "20230708T191500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur Women broke a long quiet period of transfer news and rumors late yesterday with the appointment of their new manager, Robert Vilahamn, formerly of Swedish side BK Hacken. Today, the club made their first summer signing.\nDONE DEAL: Spurs Women sign Swiss international defender Luana Bühler\nSpurs announced that they have acquired Swiss international defender Luana Bühler from Hoffenheim on a two year contract.\n27-year old Bühler is a central defender for both Hoffenheim and Switzerland, though she has also on occasion moved wide to play as a right back as needed and required. Internationally, Bühler is part of Switzerland’s preferred CB partnership in a back four, featured prominently in qualifying and friendlies, and Spurs fans will be able to watch her play for the Swiss in this month’s World Cup in Australia/New Zealand.\nI don’t watch the Women’s Bundesliga, but she was a regular in defense for a Hoffenheim team that finished fourth this past season, and Hoffenheim has played Champions League group stage football in past seasons. From the videos I’ve watched, I can tell Bühler’s a solid positional defender, good with the ball at her feet, and very experienced. Bühler will strengthen a Tottenham defensive core that was at times pulled every which way by a combination of tactics and injuries.\nIt does, however, make me wonder about the future of Tottenham’s current starting CBs — Shelina Zadorsky and Molly Bartrip. I don’t know if signing Bühler means Vilahamn wants another solid starting-caliber defender to play with, or if one of Zadorsky or Bartrip will be moving on this summer. We’ll probably find out soon. The WSL schedule hasn’t been released yet, and there’s always a ton of roster churn in the offseason, though I suspect we probably won’t see a ton of movement in or out until after the World Cup ends.\nBühler is a solid defender and this looks like a good signing. Welcome to Tottenham, Luana!",
  "word_count": 324,
  "scraped_at": "2026-02-14T01:53:51.862539",
  "_text_extracted": true
}