{
  "article_id": "e142ccfc74c1",
  "url": "https://www.barcablaugranes.com/2024/11/26/24305611/brest-boss-wary-of-facing-wounded-animal-barcelona",
  "title": "Brest boss wary of facing  wounded animal  Barcelona",
  "date": "20241126T010000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brest boss Eric Roy has previewed his team’s Champions League clash against Barcelona and says his team have nothing to lose.\nBrest boss wary of facing ‘wounded animal’ Barcelona\nThe French side are up next\nThe French side are unbeaten in the Champions League so far which Roy says has taken all the pressure off his players ahead of their trip to Montjuic.\nYet Roy is way of facing a “wounded animal” after Barca have stumbled in recent weeks against Real Sociedad and Celta.\n“We are the surprise of the Champions League. We are now on the map. That is something to be proud of. In France, nobody was betting on us. We have silenced the critics. We have ten points. That takes a lot of pressure off us,” he told a press conference.\n“We are facing a great challenge. It is something to pinch ourselves. I have told the players that we have to keep believing in ourselves. We hope to continue showing what we can do against Barcelona. We are going to face the European ogre and now they are a wounded animal.”\nRoy also took time out to praise Raphinha and said he was well aware Barcelona hadn’t won without Lamine Yamal this season.\n“Well, Raphinha will be there. I love his football. He is the captain of Barça. One of their most dangerous players. And there are also Olmo, Lewandowski, Pedri,” he added.\n“We hope that our defence plays a great game. It is true that since this little genius [Yamal] was injured, Barcelona has not won, but I wish he would play. We want to play against the best.”\nBarcelona are big favourites to win on Tuesday night but will know they can’t afford to underestimate Brest if they are to take all three points.",
  "word_count": 300,
  "scraped_at": "2026-02-14T02:26:24.524682",
  "_text_extracted": true
}