{
  "article_id": "e1b0484d9e8a",
  "url": "https://www.thenationalnews.com/news/uae/2025/06/01/abu-dhabi-health-drive-raises-dh509-million-in-two-weeks-to-support-patients-with-chronic-diseases/",
  "title": "Abu Dhabi health drive raises Dh509 million in two weeks to support patients with chronic diseases",
  "date": "20250601T161500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "An Abu Dhabi humanitarian drive aiming to provide critical support to patients with chronic diseases and people with various disabilities has raised more than half of its Dh1 billion fund-raising target in only two weeks.\nThe Life Endowment campaign, established by the Endowments and Minors Funds Authority (Awqaf Abu Dhabi), has collected Dh509 million from 93,000 contributors, it was announced on Sunday.\nThe vital initiative, being held under the slogan With you for Life, was announced by President Sheikh Mohamed under the UAE's Year of Community.\nThe impressive running total is thanks to contributions from both individuals and businesses alike, including a Dh172 million donation from Sheikha Fatima bint Mubarak, Mother of the Nation.\nThe drive will help to cover treatment costs for people while supporting the research and development of pharmaceutical drugs.\nFahad Al Qassim, director general of the Abu Dhabi Endowments and Minors Funds Authority, said the scheme represented a major milestone in the UAE's philanthropic vision.\n“The significant contributions received since the campaign's launch demonstrate the UAE community's unwavering commitment to supporting humanitarian initiatives,\" Mr Al Qassim said.\n\"The enthusiastic response to the Life Endowment campaign exemplifies deep compassion for those suffering from chronic diseases and for people of determination.\n\"The continued flow of generous contributions through various channels underscores the widespread culture of endowment in our society as a key catalyst of sustainability.”\nWho will benefit from fund?\nThe fund will be continuous and have no end date, Mr Al Qassim previously told The National. Its finances will be invested and then spent to help patients.\n“Assets will be invested and the returns will be spent on treatment, which means that we have a sustainable financial instrument and product that gives returns every single year,” he said in an interview following the campaign's launch.\n“This endowment caters for the weakest point in the community and a lot of those people are actually non-UAE nationals. Emiratis today, at the end of the day, they do get the treatment from the government by the leadership. Expats today are more vulnerable in terms of the weaker point of the community.\n“Endowments are here to stay for generations. It’s not for the next two years, and then it will be mothballed or to a different initiative. No, it will continue to be there, hopefully for generations to come.”\nAbu Dhabi's Department of Health is overseeing the health-related aspects of the endowment, ensuring contributions are directed effectively to support specialised care and reach those who need the funds most.\nThe campaign has two fund-raising arms – the Emirates Red Crescent Authority, which has been a leading humanitarian entity since 1983, and the Authority of Social Contribution – Ma’an, Abu Dhabi’s official channel to receive social contributions.\nHow to contribute\nIndividuals and institutions can make donations using various platforms:\nAwqaf Abu Dhabi's digital donation platform\nSend the word \"Life\" in a text message using the e& Emirates network to the following numbers: 3557 to donate Dh10, 3556 to donate Dh50, 3225 to donate Dh100 and 3223 to donate Dh500\nSend the word \"Life\" in a text message using the du network to the following numbers: 3583 to donate Dh10, 3585 to donate Dh50, 3586 to donate Dh100 and 3587 to donate Dh500\nSend a bank transfer to the campaign account at First Abu Dhabi Bank (IBAN: AE930353417000004600004)\nThe Authority of Social Contribution – Ma'an platform\nYou can also donate at Ma’an and Emirates Red Crescent booths in hospitals and public places across the country",
  "word_count": 582,
  "scraped_at": "2026-02-14T01:49:39.544553",
  "_text_extracted": true
}