{
  "article_id": "e1cd0da1398e",
  "url": "http://thepeninsulaqatar.com/article/09/04/2025/villas-emiliano-martinez-winds-up-psg-supporters-with-cap",
  "title": "Villa Emiliano Martinez winds up PSG supporters with cap",
  "date": "20250409T114500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nPicture: Facebook / Aston Villa\nParis: Aston Villa goalkeeper Emiliano Martinez has attempted to provoke Paris Saint-Germain supporters with a baseball cap poking fun at French defeats as he arrived for Wednesday's Champions League quarter-final.\nThe Argentine was pictured on the English club's social media account wearing a cap showing a French cockerel alongside the Argentina badge and the four trophies he has won with the national team.\nMartinez frustrated France supporters with his provocative behaviour during the penalty shootout victory in the 2002 World Cup final in Qatar. His save from Kingsley Coman after arguing with the referee helped Lionel Messi's Argentina to victory.\nHe then sparked anger in France by brandishing a doll of Kylian Mbappe during Argentina's victory celebrations in Buenos Aires.\nAston Villa manager Unai Emery said though 32-year-old Martinez had matured compared in recent seasons.\n\"He is mature. He is responsible. He is getting better at controlling his emotions. I was working with him in Arsenal as well, before I arrived here in Aston Villa,\" Emery said in his pre-match press conference on Tuesday.\n\"I think compared with when he arrived at Aston Villa five years ago and now, he is a different Emiliano.\n\"I think he is more mature. He is a better player, a better goalkeeper and now my conversation with him is always the same. He is one of the best goalkeepers in the world -- he got the award for it here in Paris.\"\nEmery added: \"Now focus on football, focus on individual challenges you have and try to manage as well everything you are achieving and the levels you are breaking. Try to control the emotions it brings you.\"\nAston Villa are seeking to reach the Champions League semi-finals in their first participation in the competition since 1983 but they face a PSG side who impressed in knocking out Liverpool in the last round and who secured the Ligue 1 crown at the weekend.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 392,
  "scraped_at": "2026-02-14T02:26:33.620901",
  "_text_extracted": true
}