{
  "article_id": "e1e1e142c0bb",
  "url": "https://www.teamtalk.com/news/eight-england-players-firmly-shop-window-euro-2024",
  "title": "England news : Eight Three Lions stars firmly in the shop window at Euro 2024",
  "date": "20240617T204500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EIGHT top England players firmly in the shop window at Euro 2024\nTEAMtalk takes an in-depth look at eight England players currently at Euro 2024 who could be on the move when the showpiece tournament comes to an end.\nWhile much of the football-watching world will be rooted to their TV screens for Euro 2024, the summer transfer window quietly opened late last week.\nAlthough the biggest transfer has, arguably, already been finalised, with Kylian Mbappe’s move from Paris Saint-Germain to Real Madrid – there are plenty of other tantalising deals that could happen.\nAnd many of those may take place in the Premier League, which, these days, is a veritable spring of exciting and sought-after English talent.\nA handful of these may get the chance to strut their stuff in Germany for the Euros in the coming weeks, potentially adding some extra £££ to their price tag.\nSo, here are eight England players, who are in Gareth Southgate’s 26-man squad, who could be on the move this summer…\nTop summer targets\nEberechi Eze\nCrystal Palace star Eze more than justified his selection in the Three Lions squad after a stellar season, which was somewhat injury-hit, at Selhurst Park.\nThe 25-year-old scored 11 goals and bagged six assists in 31 matches, with the attacking midfielder getting on the scoresheet five times in his last six games.\nAccording to statistics website FBRef, the former Queens Park Rangers ace was in the top 15 per cent amongst Premier League wingers and attacking midfielders for successful take-ons, total shots, shots on target, key passes, fouls drawn, shot-creating actions, and ball recoveries this term.\nEXCLUSIVE: Chelsea push to finalise blockbuster signing of Man Utd target ‘this week’\nThat form has led to interest from Tottenham and Manchester United. Eze’s contract with Palace runs until 2027 but it is understood he has a £60m release clause, which potential suitors may not baulk at.\nAlthough he was an unused substitute in England’s nervy 1-0 win against Serbia in their Euro 2024 opener, the gliding Eze – who Palace fear could leave along with fellow prized asset Michael Olise – is likely to be unleashed at some point this tournament.\nIvan Toney\nAt one stage this season, the striker was, perhaps, the most coveted player in the Premier League – and he hadn’t even kicked a ball in anger.\nThe Brentford forward, who registered 21 goals and five assists in 35 appearances in 2022/23, was banned for eight months in May 2023 after admitting 232 breaches of FA betting rules.\nFollowing the resumption of his suspension in January, the former Peterborough United star – who was given a reduced ban because of a diagnosed gambling addiction – was linked with Chelsea, Manchester United, Arsenal, and more.\nDEEP DIVE: FIVE Man Utd signings to help Ten Hag turn Red Devils into major force again\nThe world was his oyster, especially after picking up where he left off by scoring four goals in five games for the Bees on his return to action.\nHowever, from late February onwards, the 28-year-old failed to score in any of his last 12 appearances. With his contract expiring in 2025, the fee Thomas Frank’s men could command may have dropped… significantly.\nRegardless, Toney is in the England squad and it seems United, and now Tottenham, are keeping tabs on the ex-Newcastle United man. Whether he gets the big-money move he craves remains to be seen.\nConor Gallagher\nAnother player out of contract in 12 months’ time is Chelsea star Gallagher. In what has been a tumultuous season for the Blues, Gallagher was one of the main positives as they finished sixth in the Premier League.\nHis boundless energy, seven goals and eight assists in 50 appearances was enough to get called up to the England squad for the Euros, with the midfielder coming off the bench in the win over Serbia.\nDespite fans urging him to stay and former manager Mauricio Pochettino hoping the 24-year-old would remain at Stamford Bridge, it appears Gallagher is no closer to extending his stay at his boyhood club.\nDON’T MISS: Chelsea near signing of Aston Villa star as Fabrizio Romano reveals all on possible swap\nThe Blues have made a habit of selling academy players, in recent times, as they go down as ‘pure profit’ on the balance sheet and helps teams stay in line with profit and sustainability rules.\nGallagher has, therefore, had a £50m price tag slapped on his head, with Aston Villa and Tottenham subsequently registering interest in acquiring his services.\nMoreover, Chelsea have been linked with a move for Villa striker Jhon Duran, with Gallagher potentially facilitating a swap deal. The Blues will not want to risk losing their academy product for free in 2025 so he could be on the move in the coming weeks and months.\nAaron Ramsdale\nFrom £30m well spent to Arsenal’s highest-profile benchwarmer; Ramsdale’s fortunes at the Emirates have changed rather quickly.\nThe August arrival of David Raya on loan from Brentford quickly relegated the former Sheffield United goalkeeper to the bench, with the 26-year-old making just 11 appearances this season – and the vast majority of them came right at the start of the campaign.\nHis lack of game time led to him saying last week: “No footballer wants to not play. I’ve had a tough year personally not playing and I never want to do that again. It was tough, it was tough.”\nGO FURTHER: Arsenal initiate surprise signing of LaLiga top scorer, with bargain release clause to seal deal\nWhile manager Mikel Arteta wants to keep the ex-Bournemouth man at the Gunners, Ramsdale – whose contract runs until 2026 and there is an option to extend a further year – appears to have different ideas.\nThe England keeper, who is back-up to Jordan Pickford at the Euros, was linked with Newcastle United and more recently Chelsea and Wolves but Arsenal’s £30m price tag may put them off.\nMarc Guehi\nThe defender has been catapulted into England’s starting XI off the back of Harry Maguire’s injury, one that ruled him out of the Euros, but the Crystal Palace man took his chance well against Serbia.\nGuehi has proven to be an £18m recruit from Chelsea over the past three years and that has earned him 12 England caps and links to some top teams.\nThe 23-year-old will reportedly be allowed to leave for £50m this summer but if he has a strong Euros, the centre-back’s asking price may rise further still.\nEXCLUSIVE: Man Utd line up swap deal for England defender as Ratcliffe eyes Jarrad Branthwaite alternative\nTEAMtalk just reported Manchester United are ready to offer former Palace player Aaron Wan-Bissaka to the Eagles in a swap deal for Guehi – who has two years left on his current deal.\nThe Red Devils are looking at an alternative for Everton’s Jarrad Branthwaite and Guehi, who has also been linked with Chelsea and Arsenal, could fit the bill.\nWatching brief\nAdam Wharton\nNow, it is, arguably, unlikely the midfielder will be on the move less than six months on from signing for Crystal Palace for £18m from Blackburn Rovers.\nThe 20-year-old has enjoyed a remarkable rise over the past season, from playing in the Championship, to the Premier League; earning his first England cap and then heading to the Euros with the Three Lions.\nAnd he did it after just 16 appearances for Palace. Remarkably, that led to links with Bayern Munich but it is likely to take a huge fee to lure him away from Selhurst Park, with his contract running until 2029.\nREAD MORE: Every Premier League player who is out of contract at the end of the month\nAccording to FBRef, Wharton is in the top 15% for Premier League midfielders for tackles won, dribblers tackled and interceptions.\nThe England youngster is likely to stay put with Oliver Glasner’s team but if he keeps on shining on the pitch, he could be the subject big transfer bids in months or years to come.\nJarrod Bowen\nWest Ham star Bowen was one of the few players to come out of England’s win over Serbia with any credit on Sunday night at Arena AufSchalke.\nThe winger hassled and harried the opposition and reinforced the Three Lions’ attacking threat down the right after replacing Bukayo Saka.\nAgain, this is a player who is likely to stay at the Hammers – with the 27-year-old contracted to the London Stadium until 2030.\nDON’T MISS: West Ham star to make key decision on future amid Leeds United links\nHowever, Liverpool have repeatedly been linked with a move for the former Hull City ace, especially with the uncertainty over Mo Salah’s Anfield future.\nAnd after scoring a remarkable 20 goals and 10 assists this season, and 99 goal contributions in total since signing for West Ham in 2020 for £22m, it is easy to see why the Reds are keen on him.\nOllie Watkins\nOf all the players, the Aston Villa man, arguably, seems the most likely to stay put this summer. After all, he signed a new deal last October to keep him at Villa Park until 2028.\nFurthermore, the 28-year-old scored 27 goals and bagged 13 assists as he fired Unai Emery’s men to the Champions League for the first time since 1983.\nWith the prospect of playing against some of the best club teams in the world, let alone Europe, the England forward is unlikely to move to pastures new in the coming months.\nBut, that has not stopped him being linked with Manchester United, Arsenal, and more. It will be interesting to see if Southgate chooses to use the in-form attacker much at the Euros.",
  "word_count": 1618,
  "scraped_at": "2026-02-14T01:51:32.428851",
  "_text_extracted": true
}