{
  "article_id": "e1e563a51ee2",
  "url": "https://www.prokerala.com/news/articles/a1629697.html",
  "title": "Patience , coach trust , and mental strength the mantra for Jamshedpur FC custodian Albino Gomes",
  "date": "20250428T140000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bhubaneswar, April 28 : Two matches, two clean sheets, and a quarter-final victory in a penalty shootout. That is what Jamshedpur FC goalkeeper Albino Gomes has to show for in the Kalinga Super Sup 2025, so far.\nThe 31-year-old has had a stellar season under the bar for the Men of Steel, notching up a whopping 102 saves from his 27 appearances in the Indian Super League this season, as he played a pivotal role in his side's run to the semi-finals. While his supreme form has helped Gomes maintain a tight back-line for his team, the 1.87 metres-tall goalkeeper admittedly conceded he was somewhat fortunate in the penalty shootout.\n\"I was confident before the shootout, but I think my team helped me more. They missed quite a few of their penalties, so I did not have to save much, but I'm very happy that we were able to win the quarter-final, and are now just two matches away from winning the trophy,\" Gomes said to the AIFF.com.\nThe lure of Asia is a tempting one for Gomes and his teammates, and the Red Miners are looking forward to digging their way to an AFC Champions League Two spot next season.\n\"We are taking it one match at a time right now. The semi-final is the most important thing for us at this moment,\" said Gomes. \"But our ultimate goal is, of course, to win the Kalinga Super Cup and qualify for the AFC Champions League Two next season.\nWhile the Goa-born custodian covers his goal with precision, Gomes has had his fair share of setbacks in a career where he won one of the most the unlikeliest of titles seven years ago, helping Aizawl FC win the I-League in 2016-17, only their second season in what was then the top flight of Indian football.\nThe only link between his I-League-winning season and now – his head coach, Khalid Jamil.\n\"He's shown a lot of trust in me. Even in my early days, when it was frustrating for me to just warm the bench and not get playing time, he was the one who believed in me, told me that I had the potential to become a number one goalkeeper,\" said Gomes.\nGomes has, however, suffered three major injuries, the first two with Delhi Dynamos FC, and the third during his time at Kerala Blasters FC. His last injury layoff, which kept him out of action for almost a year, was only three years back. However, the goalkeeper kept coming back and is now having one of the best seasons of his career at Jamshedpur.\n\"It's difficult for any footballer. When you get injured time and again, self-doubt creeps in,\" he said. \"One needs to be mentally strong, that's how I recover from it. Of course, there's the physical aspect where physios and doctors play a huge role.\n\"All you can do in that period is try to remain strong, work on your rehabilitation, and think positively. That's life for all footballers. That's life for all athletes,\" he sighed.\nAs a goalkeeper, Gomes feels that coming back from an injury is similar to not being the primary custodian of a football team.\n\"It's similar. You need to be patient and keep working on the things you can. I was the fourth-choice goalkeeper when I had just made it through the Salgaocar youth setup to the senior team. But I had to remain patient and bide my time. By the grace of God, that time did come,\" said the goalkeeper, who admittedly had started out as a striker back in his school days.\nHowever, Albino Gomes has no regrets about what could have been – \"I love this position. It's a different kind of pressure, and it feels good to play with it.\"\n--IANS",
  "word_count": 633,
  "scraped_at": "2026-02-14T02:09:01.854128",
  "_text_extracted": true
}