{
  "article_id": "e1f89a9b72b6",
  "url": "https://punchng.com/ibrahimovic-returns-to-ac-milan-as-advisor/",
  "title": "Ibrahimovic returns to AC Milan as advisor",
  "date": "20231211T143000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Zlatan Ibrahimovic has returned to AC Milan as an advisor to the Serie A club’s management, owners RedBird Capital Partners confirmed on Monday.\nIn a statement, American investment firm RedBird said that the former Sweden striker, who won a host of trophies as a player in Italy, will “serve as a senior advisor to AC Milan ownership and senior management”.\nThe 42-year-old has also been hired as an “Operating Partner” for RedBird’s “sports and media and entertainment investment portfolio”.\nRedBird said that Ibrahimovic’s mandate at Milan “will include player development and high-performance training, advancing AC Milan’s global brand and commercial interests, and supporting special projects of strategic importance, including the club’s new stadium.”\nWithin RedBird, Ibrahimovic “will help source and evaluate new investment opportunities for the firm, and will advise RedBird portfolio companies on commercial projects, digital content strategies and strategic brand building initiatives”.\nIbrahimovic brought the curtain down on his eventful playing career at the end of last season, in which he was dogged by injury and netted just once for Milan.\nThat goal came in a 3-1 win at Udinese in March and made him the oldest goal scorer in Serie A history.\nIbrahimovic was a key figure in Milan’s resurgence to the top of Italian football after his return as a veteran forward in 2019, helping to bring them back from the doldrums and eventually win the Serie A title in 2022.\nHe was also key to the club’s previous Scudetto 11 years before, which was followed by a long period of stagnation and financial problems before revitalisation under current coach Stefano Pioli.\nOver the course of his career, Ibrahimovic won league titles in the Netherlands, Italy, Spain and France, although his only major European trophy was the 2017 Europa League with Manchester United.\nHe rejoins Milan with the team nine points behind Serie A leaders Inter Milan and facing a group-stage exit from the Champions League.\nAFP",
  "word_count": 321,
  "scraped_at": "2026-02-14T01:51:13.787300",
  "_text_extracted": true
}