{
  "article_id": "e22f002998f5",
  "url": "https://punchng.com/like-father-like-son-the-aiyenugba-goalkeeping-dynasty/",
  "title": "Like father , like son : The Aiyenugba goalkeeping dynasty",
  "date": "20230619T034500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After leading a successful goalkeeping career in Nigeria and Israel, former Super Eagles goalie, Dele Aiyenugba is not retired yet, and he already has the task of helping his up-and-coming son, Daniel, become better than him, writes ABIODUN ADEWALE\nWhen former Super Eagles goalkeeper and Kwara United man, Dele Aiyenugba, shared the phone number of his son with our correspondent, the name on it was ‘Dan Goalie’.\nThe expectation was that Aiyenugba would either type out the number by heart or perhaps the name on the contact would be ‘Daniel Aiyenugba’, ‘Daniel’ or even more expectedly, ‘My Son.’\n“Aside from being my son, that’s the way I see him,” Aiyenugba explained why he tagged him ‘Dan Goalie.’\n“I see him as a mentee or a junior colleague who is in the same profession as me. It doesn’t take away the fact that he is my son, it makes the bond even stronger.”\nIn a career that has spanned 25 years, Aiyenugba needs no introduction in Nigerian football.\nAfter spending six years with Enyimba in the Nigerian league, where he won two CAF Champions League titles in 2003 and 2004, two CAF Super Cups in 2004 and 2005, one FA Cup title in 2005, as well as four NPFL titles in 2002, 2003, 2005 and 2007, Aiyenugba moved to Israel in 2007.\nThere, he made a combined 402 appearances for Bnei Yehuda (294), Hapoel Ashkelon (62), Hapoel Iksal (34), Hapoel Afula (13), before returning to Nigeria in 2020 to join local league side Kwara United, where he currently plays.\nHis contributions to Enyimba was recently appreciated by the club, who honoured him with a jersey plaque, before an NPFL game between Enyimba and Kwara United in Aba in January.\nAfter over two decades as a goalkeeper, it’s about time the 39-year-old either left the stage or shared the spotlight with his 14-year-old son, Daniel, who has been making waves recently, after helping Remo Stars’ youth side, Beyond Limits FC, gain promotion from the Nationwide League One — Nigeria’s third-tier — to the Nigeria National League, the second division.\nThe proud father was among the spectators in Osogbo, Osun State as Daniel was in goal in Beyond Limit’s 4-1 win over First Bank FC to secure their promotion to the NNL.\n“Daniel was superb with some impressive saves for his team. I’m a proud father because he is boldly taking over the big gloves from me. With his display, I’m very confident he has a bright future ahead of him,” Aiyenugba said after watching the crucial playoffs game in Osogbo.\nAiyenugba is not the first footballer to have his son toe the same path. Worldwide, there are numerous names of football stars whose sons are now playing the game. However, the goalkeeping department has few names and Aiyenugba could well be reckoned in no distant time.\nA perfect example is former Denmark international and Manchester United goalkeeper, Peter Schmeichel, who won five Premier League titles, three FA Cups and the UEFA Champions League with the Red Devils in eight years. Schmeichel was also part of the legendary Denmark side that won the European Championships in 1992.\nHis son Kasper Schmeichel also had a brilliant run in the Premier League and was part of the Leicester side that shocked the world by winning the EPL in 2016. He also won the FA Cup with the Foxes in 2021 and led Denmark to the European Championship semi-finals, where they were narrowly beaten by England in extra-time.\nExperienced and European Cup winning Spanish goalie, Pepe Reina, is the son of former Barcelona and Atletico Madrid shotstopper, Miguel Reina.\nIn The Netherlands, Joe Van Der Sar is the son of former Dutch international and Manchester United legend Edwin van Der Sar.\nJoe is aged 25 and and is also waiting for his big break to reach and surpass the heights and achievements of his father as a keeper.\nIn Nigeria, the Dosus are also exemples, although theirs is a brotherhood line of goalkeepers. Aside from Atlanta 1996 Olympic gold medallist, Joseph Dosu, his elder brother David and younger ones, Abbas and John were also goalkeepers. Before them, there were the famed Okala brothers, Patrick and Emmanuel, who both represented Nigeria at international level.\nBack to Aiyenugba, one of the similarities between father and son is how young both of them were when they ventured into football. While his father’s record shows that he began amateur goalkeeping with Kwara Stars in 1998 – at the age of 15 — Daniel started making the news in 2021, when he was 12.\nThis was after winning the goalkeeper of the tournament award at the Ramat Cup in Kano.\nInterestingly, the lad started football as an outfield player.\n“I started with a football club called Future Stars in Ilorin. That was when I started thinking of becoming a goalkeeper because I was formerly a striker. I played for Future Stars before I joined Kwara Football Academy, where I met my trainer, coach Oluyori,” the young Aiyenugba told The PUNCH.\nTransitioning from an outfield player to a goalkeeper, especially among young players, could mean a smart way of finding space for oneself in a star-studded team.\nBut Daniel insists he was a very good striker who was inspired to try goalkeeping after watching video clips of his father and watching him train while he was in Nigeria.\n“I watch a lot of video clips of my dad, even up till now. After watching him too, anytime he comes home during their off season, he does his goalkeeping training on the same pitch with me and my brother.\n“So, I had to stop playing sometimes so I could pay attention to his techniques. That was how I took interest and decided to become a goalkeeper too,” he said.\nHis father wasn’t blind to Daniel’s curiosity.\n“I believe my career was part of what influenced Daniel because I could remember anytime I came home for break, he also had his mind on my routine, despite playing as a striker. Thankfully, he had a coach, Oluyori, who put him through the basics and is still teaching him till now,” the father stated.\nAs a footballer himself, Aiyenugba never opposed his children pursuing a career in the game, but he had to think twice about the choice of Daniel becoming a goalkeeper.\nHe said, “I asked his coach to keep sending me his clips while I was in Israel because I wanted to be sure he was ready. A goalkeeper’s job isn’t as easy as he might think.\n“When I started, my father was there for me too. He took me to the stadium to train and watched my game, but he was not a goalkeeper. So, it was easy for me to guide him as much as I wanted him to have fun as well,” the former Super Eagles goalkeeper said.\nBeing the son of a two-time CAF Champions League winner and 17-cap Super Eagles goalkeeper comes with huge expectations.\nBut the young lad is not one to be buoyed or pressured by his last name. He told our correspondent he wants to do things at his pace.\nHe’s already a specialist in stopping penalties, just like his father.\nDuring the older Aiyenugba’s time with Enyimba, he was usually brought on for rival keeperVincent Enyeama in the 118th and 119th minute, when it was imminent the game would go into penalty kicks.\nAnd he wouldn’t disappoint! North African sides still have bitter memories of the shot stopper.\nIn 2017, Daniel, who captained North Central at the U-13 NFF Zenith Future Eagles tournament, saved two penalties for his side in the final to lead them to the title.\nHis father, who watches him at every opportunity, also wants him to enjoy the game.\n“I am so happy and delighted watching my son improve in every game as a goalkeeper. The only thing I am expecting from ‘goalie’ is to keep having fun doing his thing, no pressure, stay humble and pray,” the Kwara United goalkeeper told The PUNCH.\nHaving been under the guidance of Kwara Football Academy since 2019, Daniel, who is currently in SS2, only joined Beyond Limits three months ago.\nFor about four years now, he has been combining football and education, and regardless of how difficult it is, he knows he must carry on.\n“It has not been easy. On Mondays to Fridays, we train from 7:30am till 10am. Then we go to the classroom from 11am to 1pm and there is also another class in the evening, between 5pm to 7pm. In between these periods, we also have some time to go to the gym and keep fit. Saturdays and Sundays are for resting, but we have league games and sometimes we do have friendly matches,” the lad explained.\nWith such heavy routine, the team, made up of school boys, went through the NLO campaign and were among the eight clubs that secured promotion to the NNL.\nThe Young Aiyenugba was in goal for six of their matches and kept three clean sheets. He noted that he missed few games while sitting for exams in school.\nAccording to his father, Daniel has the motivation to combine education and football and he believes in the system that he has been enrolled in to shape him for a greater future.\nThe lad also affirmed that he wants to study Human Kinetics at the university.\nEven for chaps who don’t have either of their parents as footballers, the thirst to play at the highest level for the country is ever present, unless quenched by circumstances. For the young Aiyenugba, he might not have watched his father’s heyday, but he has footage to inspire him and he believes it is enough to complement his hard work as he also hopes to represent Nigeria in the future and also play at the highest level of club football.\n“I’m very proud of my father, not because he even supports me, but because having him helps me to improve. The thought of him alone is enough and I want to do more than he did for Nigeria. I want to represent the country at all levels and enjoy my football at the highest level,” Daniel added.",
  "word_count": 1708,
  "scraped_at": "2026-02-14T01:50:37.803363",
  "_text_extracted": true
}