{
  "article_id": "e240d9286180",
  "url": "https://theathletic.com/4159340/2023/02/06/analysed-kane-greaves-liverpool-issue-balogun/",
  "title": "Analysed : Kane overtakes Greaves , Liverpool huge issue , Balogun the real deal",
  "date": "20230206T141500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Another weekend of European football is complete, and we are not short of talking points.\nArsenal’s 13-game unbeaten run in the league came to an end at Goodison Park, Harry Kane’s winner for Tottenham Hotspur broke an all-time club goalscoring record and Liverpool’s poor form continued with a seventh league defeat of the season.\nAdvertisement\nOn the continent, an Arsenal loanee is having the season of his career in France, a Real Madrid winger set an unwanted record for the season, and things — unusually — are very tight at the top in the German Bundesliga.\nLet’s spin the data wheel and get your week off to a numerically delightful start.\nKane leads the way for Spurs\nThere is nowhere else to begin.\nHarry Kane scored the only goal of the game as Tottenham Hotspur beat champions Manchester City 1-0 in the Premier League on Sunday, but his celebrations were not limited to the result.\nThe goal was his 267th in all competitions for Spurs, breaking the club’s all-time record held by Jimmy Greaves since 1970. It was also Kane’s 200th Premier League goal, putting him just eight behind Wayne Rooney and with Alan Shearer’s Premier League record of 260 absolutely in his sights at age 29. (Including pre-Premier League era games, my The Athletic colleague Shearer got 283 top-flight goals in his career).\n“It’s hard to put into words and I’m so glad it came in a win,” said Kane. “To do it in front of the home fans is a moment I’ll never forget. There has been so much talk about it over the last couple of weeks, I wanted to get it done as soon as possible, so to do it in a big game, against one of the best teams in the world, it’s a special feeling.”\nIf you are looking for a deeper dive into Kane’s goalscoring evolution to reach his record-breaking tally, The Athletic has you covered.\nTo rotate or not to rotate\nGiven their contrasting fortunes in recent weeks, Everton’s 1-0 win over league leaders Arsenal at Goodison Park was one of the notable shocks of the weekend.\nSean Dyche picked his first starting line-up as Everton manager, while Mikel Arteta named an unchanged starting XI for Arsenal — and not for the first time this season.\nAdvertisement\nAside from injuries, Arsenal’s XI has been picking itself for months, with Arteta sending out the same team that started the previous fixture on 10 occasions this season, which is more than any Premier League side.\nA settled line-up is rarely a bad thing, but could Arsenal be in danger of becoming too predictable to their opponents?\nArteta brought in Leandro Trossard and Jorginho in January to freshen up the squad for their push for the title, and Arsenal might benefit from a greater element of surprise in the coming weeks — be that tactical or personnel-based.\nGO DEEPER\nArsenal have shown why they could win the title - at Everton we saw why they might not\nAt the other end of the scale, Graham Potter hit shuffle once again for Chelsea on Friday evening, handing starting debuts to new signings Mykhailo Mudryk and Enzo Fernandez in their 0-0 draw with neighbours Fulham.\nPotter has now made 64 changes to his starting line-up in the Premier League since he replaced Thomas Tuchel in mid-September, which is more than any other team in the division.\nMuch has been made of Chelsea’s spending this season and, amid the glut of options available, Potter is still searching for the best formula among his squad to pick a consistent starting XI.\nChanges have been the order of the day for Potter, but things are not going smoothly at Stamford Bridge.\nBalogun flying high in France\nWhile Arsenal will want to forget all about their weekend, one player on their books has had a week to remember.\nFolarin Balogun’s loan spell at Reims has been a huge success so far, as the 21-year-old continues to set France’s Ligue 1 alight.\nWhile the goalless draw away to Auxerre on Sunday was a little less thrilling, Balogun must still be happy with his week’s work having netted his first senior hat-trick in a 4-2 home victory over Lorient on Wednesday — with his third goal being the pick of the bunch.\nMy first professional hat trick 🙏🏻. Merci l'équipe pic.twitter.com/hxn4QhSNUw\n— Balogun (@balogun) February 2, 2023\nThat’s now 14 league goals in 21 appearances for Balogun, and what is most encouraging is how sustainable his output looks, with his 10 non-penalty goals scored aligning closely with his non-penalty expected goals (10.5) this season.\nMore pertinently, that total makes the England Under-21 striker the leading scorer in the French top division, with more goals than all of Paris Saint-Germain’s superstar trio Kylian Mbappe, Neymar and Lionel Messi so far, helping Reims stretch their unbeaten run to 16 games under manager Will Still.\nTres bien, Folarin.\nAdvertisement\nLiverpool far too open against counter-attacks\nFor Liverpool fans, Saturday’s 3-0 defeat away at Wolves was less of a surprise than it should have been.\nJurgen Klopp’s men have now conceded three goals in each of their last three away games in the Premier League, bringing their total goals conceded tally to 28 in 20 games — more than they allowed in the whole of the 2021-22 league season (26) and as many as their next opponents, neighbours Everton, who started the weekend joint-bottom of the table.\nKlopp must feel like he’s living out Groundhog Day each time his side takes the field.\nGO DEEPER\n'Absolutely horrible': The problems facing Liverpool in the biggest crisis of Klopp's reign\nLiverpool conceded first for the 12th time in those 20 Premier League outings this season, and despite spells of territorial dominance in the second half, they were sucker-punched once again by a counter-attacking sequence for Wolves’ third goal with 20 minutes to go.\nThat means that Liverpool have now let in five goals from counter-attacks this season, which is more than each of the last six seasons — the closest being three goals they allowed that way en route to winning the 2019-20 title.\nTrending the number of direct attacks Liverpool concede per game — which is defined as a possession that starts in a team’s defensive half and results in a shot or touch inside the opposition penalty area within 15 seconds — we can see just how open Liverpool have been once they lose the ball.\nEleven points off the top four and with a Champions League last-16 tie against holders Real Madrid looming, Liverpool’s slump needs to end quickly if they are to salvage their season.\nThe Bundesliga is competitive again\nBayern Munich’s 4-2 away win over Wolfsburg got them back to winning ways, after three consecutive 1-1 league draws following the season’s post-World Cup resumption saw them attract criticism in Germany.\nAdvertisement\nSunday’s victory edges them one point ahead of Union Berlin (who beat Mainz a day earlier) after 19 games, with the Bundesliga table looking as tight as it has for a long time at this stage of the season.\nJust six points separate Freiburg in sixth (34) from leaders Bayern (40), making the title race as closely run as in 2019-20 when RB Leipzig were top, also on 40 points after the same number of games.\nOf course, Bayern fought back to win the league that year, and they have been champions in each of the past 10 seasons in Germany, but just when you thought the Bundesliga might be dead, it throws you a lifeline.\nIt is nice of Bayern to give others a chance this season, although the odds to win the title still look very much stacked in their favour.\nUsing FiveThirtyEight’s predicted league table — which forecasts the outcome of each of the remaining fixtures based on the strength of the respective teams to simulate how the season might end — Bayern’s 86 per cent probability to win the title again from here is rather overwhelming.\nCould Leipzig, Borussia Dortmund or cult favourites Union push them all the way?\nKeep a close eye on events in Germany in the coming months.\nPalhinha adds bite to Fulham’s season\nFulham’s first season back in the top flight has wildly exceeded most of their fans’ expectations.\nThat 0-0 draw with Chelsea on Friday was their third clean sheet in four away Premier League games — as many as they managed in their previous 15 matches on the road — and their defensive solidity was largely thanks to midfield destroyer Joao Palhinha.\nThe 27-year-old Portugal international is one of the signings of the season so far, adding steel to Fulham with his ability to break up the opposition attack and stick a foot in where necessary.\nSo much so that no player in Europe’s top five domestic leagues has made more tackles than Palhinha’s 98. Broadening this out to his “true” tackles made — which include tackles, fouls committed and challenges lost — only Manchester United’s Casemiro averages more than his 10.4 per 1,000 opponent touches.\nPalhinha has played the second-most minutes of any Fulham player this season (behind only Tim Ream) and his destructive displays have helped ensure that Fulham’s total of 32 points from the first 22 top-flight games has only been bettered once in their history (1959-60).\nAdvertisement\nVinicius Junior sets an unwanted record\nIt was a weekend to forget in more ways than one for Vinicius Jr, not least as his Real Madrid side slumped to a 1-0 loss away to Mallorca — they are now eight points adrift of La Liga leaders Barcelona, who won 3-0 at home to Sevilla later in the day.\nGO DEEPER\nLa Liga to investigate after Vinicius Jr subject to racist abuse at Mallorca match\nVinicius Jr will be (quite literally) nursing his wounds, as he was fouled 10 times on the day — the most that a single player has suffered in any game across Europe’s top five domestic leagues this season.\nControversies on and off the field have surrounded Vinicius Jr in recent months, but team-mate Nacho was quick to condemn the situation.\n“I think an atmosphere is being created with the issue of Vinicius that does not favour anyone, neither Vinicius nor anyone else,” the defender said after the game. “The public is getting involved with the boy without knowing why. We have to leave controversy and nonsense aside.”\nVinicius has been fouled 79 times in La Liga this season — comfortably the highest of any player across Europe, with Neymar of PSG (59) closest to him. His skilful style on the ball is naturally going to attract players towards him, but 10 fouls suffered in a single game was the most by a Real Madrid player in almost a decade.\nAt least he’s getting use out of his shin pads.\n(Main graphic — photo: Getty Images/design: Sam Richardson)",
  "word_count": 1819,
  "scraped_at": "2026-02-14T02:19:30.180454",
  "_text_extracted": true
}