{
  "article_id": "e257af170673",
  "url": "https://www.teamtalk.com/news/man-utd-poised-to-make-shock-move-for-17-goal-striker-as-ten-hag-eyes-instant-martial-upgrade",
  "title": "Man Utd poised to make shock move for 17 - goal striker as Ten Hag eyes instant Martial upgrade",
  "date": "20231219T183000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd poised to make shock move for 17-goal striker as Ten Hag eyes instant Martial upgrade\nManchester United are reportedly planning a shock move to sign Galatasaray striker Mauro Icardi on a loan deal until the end of the season.\nThe Red Devils have endured an underwhelming start to the season and currently sit in seventh place in the table – with pressure beginning to mount on manager Erik ten Hag.\nOne of Man Utd’s big problems in the Premier League this season has been their lack of a clinical striker.\nSummer signing Rasmus Hojlund is yet to make a single goal contribution in a domestic match, despite netting five times in the Champions League.\nAnthony Martial has also been heavily linked with moves away from Old Trafford, which has only increased the need for Ten Hag to bring in a new front man in January.\nSeveral strikers have been linked with Man Utd in recent weeks, but a shock report has now claimed that Man Utd are weighing up a move for Icardi.\nREAD MORE: Ratcliffe makes Newcastle man who’s among ‘best in class’ his No 1 Man Utd target\nMan Utd eye shock move for Mauro Icardi\nAccording to Football Transfers, Man Utd are ‘looking at Icardi as an option’ for a potential loan move in January.\nThe 30-year-old’s form has been inconsistent in recent years, but seems to be back to his best in Turkey.\nIcardi signed for Galatasaray from Paris Saint-Germain on an initial loan in 2022, before it was made permanent for €10m (£8.6m) at the start of this season.\nThe Argentina international made 25 appearances in all competitions for the Turkish giants this term, netting an extremely impressive 17 goals and making six assists in the process.\nDuring his career, Icardi has won eight major trophies, so could help bring a much-needed winning mentality to the Old Trafford dressing room.\nThe report claims that Man Utd’s chances of signing Icardi could be ‘boosted’ by the fact that he has ‘shown an interest in joining them in the past’ and is ‘seeking new challenges.’\nIcardi could help take the pressure of Hojlund and help Man Utd score some more goals in the second half of the season as they aim to bridge the gap with the top four.\nWith that in mind, it will be interesting to see if the Red Devils are able to convince Galatasaray into loaning him out in January – which certainly won’t be an easy task.",
  "word_count": 417,
  "scraped_at": "2026-02-14T01:48:34.026868",
  "_text_extracted": true
}