{
  "article_id": "e25878baed79",
  "url": "https://www.uefa.com/returntoplay/news/0288-19990da6fca0-dd554338a025-1000--uefa-euro-2024-prize-money-distribution-system-confirmed/",
  "title": "UEFA EURO 2024 prize money distribution system confirmed | Inside UEFA",
  "date": "20231202T173000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA EURO 2024 prize money distribution system confirmed\nSaturday, December 2, 2023\nArticle summary\nNew format for UEFA Women's Champions League and creation of a second European women's club competition approved.\nArticle top media content\nArticle body\nThe UEFA Executive Committee today in Hamburg approved the distribution system of the prize money for teams participating in the final tournament of the 2024 UEFA European Football Championship to be played in Germany from 14 June to 14 July.\nUEFA EURO 2024 prize money\nThe amount for distribution to the participating teams is confirmed at the same level as for UEFA EURO 2020, i.e. a total of €331 million. The distribution key will also be maintained as follows:\n• Participating fee: €9.25m\n• Match bonus: €1.0m for a win and €500,000 for a draw\n• Qualification to the round of 16: €1.5m\n• Qualification to the quarter-finals: €2.5m\n• Qualification to the semi-finals: €4m\n• The runners-up will receive an additional payment of €5m\n• The 2024 European champions will receive an extra payment of €8m\nThe maximum amount that the champion team may achieve, if they will have won all three of their group matches, is €28.25m.\nUEFA women's club competitions\nThe UEFA Executive Committee approved a new format for the UEFA Women's Champions League, consisting of an 18-team league phase with three home and three away matches followed by knockout rounds, and the creation of a second European competition for women's clubs, with the changes becoming effective as of the 2025/26 season. Full details on the competitions' format, access list and calendar will be announced in a separate communication on 4 December.\nUEFA Women's EURO 2025\nThe match schedule and tournament dates were approved, with eight venues across Switzerland (Basel, Bern, Geneva, Luzern, Sion, St. Gallen, Thun and Zurich), hosting matches from 2 to 27 July 2025. The opening match and the final will be played at St. Jakob-Park in Basel.\nUEFA Women's Futsal EURO\nFollowing the launch of the inaugural FIFA Futsal Women's World Cup in 2025, it was decided to cancel the 2024-25 edition of the UEFA European Women's Futsal Championship and implement a four-year cycle instead, with the next final tournament in 2027.\nThe number of teams participating to the final tournament will furthermore be increased from four to eight.\nUEFA Nations League 2024/25\nThe draw and fixture list procedure for the 2024/25 UEFA Nations League were approved, with the draw to take place at Maison de la Mutualité in Paris on 8 February 2024.\nUEFA Futsal EURO 2026\nLatvia and Lithuania were appointed as hosts of the final tournament of the 2026 UEFA Futsal EURO with matches to take place in Riga and Kaunas.\nNext meeting\nThe next meeting of the UEFA Executive Committee will take place on the eve of the 48th Ordinary UEFA Congress in Paris on 7 February 2024.",
  "word_count": 476,
  "scraped_at": "2026-02-14T02:07:27.053705",
  "_text_extracted": true
}