{
  "article_id": "e29823d27288",
  "url": "https://www.dw.com/en/bundesliga-5-questions-ahead-of-the-restart/a-64272687",
  "title": "Bundesliga : 5 questions ahead of the restart – DW – 01 / 19 / 2023",
  "date": "20230119T150000Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bundesliga: 5 questions ahead of the restart\nJanuary 20, 2023The Bundesliga is set to return after a prolonged World Cup break. From the top four to the relegation battle, DW looks at five burning questions before the German top-flight kicks off again.\nCan Edin Terzic steer Borussia Dortmund back on course?\nWhen Edin Terzic returned to the dugout to replace Marco Rose, the hope was for Borussia Dortmund to return to the heavy metal football that won them the German Cup in 2021. That aspiration has thus far turned out to be a pipe dream, with BVB sitting in sixth place and nine points off Bayern Munich.\nDortmund have run into their fair share of hard luck under Terzic. Sebastien Haller, their chosen replacement for Erling Haaland, has yet to play due to a cancer operation. Oft-injured captain Marco Reus was also unavailable with a calf issue, though he could make his return soon.\nThat said, Terzic has not got the best out of the talent at his disposal. Karim Adeyemi and Donyell Malen, two recent big-money signings, have yet to hit the ground running, nor has Anthony Modeste, who scored 20 goals last season for Cologne but has found the back of the net just twice this season.\nDortmund's defense, which was supposed to receive a boost from signings Nico Schlotterbeck and Niklas Süle, has conceded two goals or more in seven of their 15 Bundesliga matches.\nAll this has happened while Rose, who was let go after just one season, has breathed new life into RB Leipzig. Dortmund can still be a top-four team this season, but Terzic surely has his work cut out for him.\nCan Freiburg keep the pace?\nThis season has seen two of the Bundesliga's cult clubs, SC Freiburg and Union Berlin, ascend to previously unimaginable heights. Union led the Bundesliga for seven weeks, while Freiburg enter the new year in second place.\nSustaining a title challenge is difficult, though, and Union have already fallen off the pace, collecting just one point in their final three games ahead of the World Cup break. Whether Freiburg will suffer a similar fate remains to be seen, though FiveThirtyEight, a statistics and analysis website, still gives them a 56% chance of remaining in the top four.\nHead coach Christian Streich, who has led the club for 11 years, will undoubtedly continue to keep the expectations low, especially with the club also having to deal with Europa League fixtures. That said, Freiburg fans have every reason to dream their side can qualify for their maiden Champions League campaign.\nHow much will Bayern Munich miss Manuel Neuer?\nAfter Borussia Mönchengladbach confirmed on Thursday that Swiss goalkeeper Yann Sommer would be joining Bayern Munich, the answer to this is more positive than originally anticipated.\nThough many media outlets in Munich remarked on Sommer's stature — at 1.83 meters (6 feet) tall, he's 10 centimeters shorter than Neuer — his skill is undeniable. His 19 saves against Bayern in their 1-1 draw against Gladbach earlier this season were proof enough.\nThere is one thing Sommer hasn't done since moving to Germany in 2014: win a trophy. He would be likely to collect at least one in Bavaria — Bayern have a four-point lead atop the Bundesliga table and are still in the German Cup — but whether he can lead them to the European heights the club desires remains an open question.\nThough he will sit behind a stout defense that features World Cup finalist Dayot Upamecano and Dutch defender Matthijs de Ligt, Bayern's high defensive line might be something Sommer might need to adjust to. But as a 34-year-old who has experience on the international stage with Gladbach and the Swiss national team, any adjustment shouldn't take too long.\nWhether Sommer will accept a backup role is a problem for another day, but right now, the Swiss keeper has an intriguing opportunity he has otherwise not had in his career.\nWill Niclas Füllkrug maintain his scoring pace?\nThe Werder Bremen striker's 10 goals this season earned him a well-deserved spot in Germany's World Cup squad. With two goals and an assist in three games, he was one of the nation's lone bright spots in what was otherwise a catastrophic group-stage exit.\nBut now that he's back in the Bundesliga, can the 29-year-old keep up the pace? Some statistics would suggest he's been a bit lucky, but given his shot volume — 46 in 14 appearances, second most in the league behind Gladbach's Marcus Thuram according to Bundesliga.com — suggests that he could continue to find the back of the net even if luck doesn't fall his way.\nHis best Bundesliga season came in 2017-18, when he bagged 14 goals for Hannover, though that was also the only season in his career in which he played in all 34 league games. If healthy, Füllkrug, who will turn 30 next month, could well surpass that on his way to the coveted Torjägerkanone, Germany's prize for the Bundesliga's top goalscorer.\nAnd in doing so, he would surely contribute to newly promoted Werder Bremen staying up.\nCan Schalke save their season?\nAfter their disastrous relegation two years ago, Schalke are struggling once more in their return to the Bundesliga. Not only are they rock bottom of the table, they are also five points away from 15th place, the last spot for automatic survival.\nTheir sluggish start to the season cost head coach Frank Kramer his job. His replacement, Thomas Reis, also seemed uninspiring, having just been let go by similarly struggling club Bochum.\nThe squad has many players who were crucial to their promotion from the second division last season, but many have yet to prove they are good enough to stick around in the top flight. The fact that seven of their nine points have come at home provides some sort of optimism, but if they intend to continue in the first division, improvement needs to come in almost all areas.\nBut with the Royal Blues' coffers empty, that improvement will have to come from within.\nBundesliga fixtures:\nRB Leipzig vs. Bayern Munich (Friday 20:30 CET)\nBochum vs. Hertha Berlin (Saturday 15:30)\nStuttgart vs. Mainz 05\nWolfsburg vs. Freiburg\nEintracht Frankfurt vs. Schalke 04\nUnion Berlin vs. Hoffenheim\nCologne vs. Werder Bremen (Saturday 18:30)\nBorussia Dortmund vs. Augsburg (Sunday 15:30)\nBorussia Mönchengladbach vs. Bayer Leverkusen (Sunday 17:30)\nEdited by Matt Ford",
  "word_count": 1068,
  "scraped_at": "2026-02-14T02:19:30.184696",
  "_text_extracted": true
}