{
  "article_id": "e2a5757a77b2",
  "url": "https://www.gdnonline.com:443/Details/1364501/Muharraq-and-Khaldiya-aim-to-secure-full-points",
  "title": "Football : Muharraq and Khaldiya aim to secure full points",
  "date": "20251001T014500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – BAHRAIN’S Muharraq and Al Khaldiya are both in action tonight in the 2025-26 AFC Champions League (ACL) Two.\nMuharraq are set to take on Esteghlal FC of Iran at Shahr-e-Qods Stadium in Tehran in their Group A encounter, scheduled for a 7pm kick-off, Bahrain time.\nKhaldiya, meanwhile, host FC Arkadag of Turkmenistan at the National Stadium in Riffa. Their game is scheduled for a 9.15pm start.\nMuharraq are coming off a convincing 4-0 home win against Al Wehdat of Jordan in their opening ACL Two assignment last month. Wehdat are up against Al Wasl FC of the UAE in today’s other divisional clash, also set to get underway at 7pm, Bahrain.\nKhaldiya will be aiming for the full three points after kicking off their campaign with a goalless draw against Al Ahli SC of Qatar at Al Thumama Stadium in Doha. Arkadag had a similar outcome in their home tie with PFC Andijon of Uzbekistan. Andijon host Ahli in a match starting this afternoon at 4.45pm, Bahrain time.\nThe ACL Two is the Asian Football Confederation’s (AFC) second-tier club competition – one level below the AFC Champions League Elite and one above the AFC Challenge League.\nMuharraq and Khaldiya are amongst a 32-strong cast representing 22 AFC member associations who are playing in a home-and-away round-robin format.\nThe ACL Two group stage is scheduled to continue until December 24 before moving into the round of 16 between February 10 and 19 in 2026. The quarter-finals and semis will then be held in March and April, respectively, with the final pencilled in for May 16.",
  "word_count": 266,
  "scraped_at": "2026-02-14T02:12:04.359832",
  "_text_extracted": true
}