{
  "article_id": "e2c1b62868bd",
  "url": "https://www.managingmadrid.com/2024/4/18/24132931/player-ratings-manchester-city-1-1-real-madrid-3-4-pens-2024-uefa-champions-league-quarterfinal",
  "title": "Player Ratings : Manchester City 1 - 1 Real Madrid ( 3 - 4 Pens ); 2024 UEFA Champions League Quarterfinal",
  "date": "20240418T040000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Full match player ratings below:\nPlayer Ratings: Manchester City 1 - 1 Real Madrid (3-4 Pens); 2024 UEFA Champions League Quarterfinal\nMadrid hold on and win on penalties to secure their 12th passage to the semi-finals in 14 years.\nAndriy Lunin—10: The Ukrainian has proven that he is Real Madrid quality. When the big moments arrived, Lunin stepped up to the plate. In particular, his composure and confidence in the penalty shootout were inspiring.\nDani Carvajal—9: Never gave up - his 1 v 1 battle with Jack Grealish was a back-and-forth affair with Madrid’s pitbull of a rightback never giving the English winger an inch. Left his soul out on the pitch and was rewarded with passage to the semi-finals.\nRudiger—8.5: Madrid’s best defender of the season stepped up when the team needed him most, dispatching the fifth and final penalty to send the team to the semi-finals.\nNacho—8.5: Haaland tried to get the better of Nacho but failed. The Norwegian had a few aerial duels inside the box which he beat the Spanish defender, but otherwise the captain was foot perfect. Many doubted his ability heading into the match, but once again Nacho proved that he is a true defender. Warrior-like performance.\nFerland Mendy—8: Whether it was Bernardo, Foden, or KdB - very few Manchester City players had success going up against Ferland 1 v 1. The best defensive left back in the world.\nEduardo Camavinga—6: Put in a major shift defensively and looked visibly exhausted about 70 minutes into the match. Lost concentration on the City goal and failed to track KdB’s run despite Bellingham imploring him to follow. Drew fouls when Madrid were under pressure and helped slow the game down and give the team a chance to breathe.\nToni Kroos—6.5: Not as involved as he would like to be - only 52 touches and 41 passes — usually producing double or triple those numbers.Similar to the rest of the team, had to grind and suffer defensively but was often in the right spots to deny the English side.\nFede Valverde—8: The Uruguayan put in a monumental defensive shift. Oftentimes operated as a right wing back and defended Jack Grealish 1 v 1 down the wing to great effect. Played the extra-time at center midfield and had his best on-ball moments in that position.\nJude Bellingham—6: Like so many in the Madrid side, had to work tirelessly defensively to plug holes and prevent City from finding a goal. Despite the huge amount of defensive work, produced a moment of magic with a Zidane-like first touch to create the play that Madrid scored from in the opening 15 minutes.\nVinicius Junior—6.5: Played as the central focal point again and roamed all around the pitch. Came up with more end-product in the Champions League with the assist on the Rodrygo goal — a cross from the right. Had little service for most of the night and lost his foot-races with Kyle Walker.\nRodrygo—6.5: Like most of the attack, had so little of the ball but was lethal when he was in possession. Scored the go-ahead goal to give Madrid a crucial lead and set the new parameters of the match.\nSubstitutions:\nLuka Modric—6: Brought in for his fellow veteran, Toni Kroos, and tried to bring composure and calmness to the midfield. Unfortunately missed his penalty in the shoot-out but would not matter as Andriy Lunin, Toni Rudiger, and Lucas Vazquez all came up big.\nBrahim Diaz—5: Struggled with the physicality of the City team and never got going.\nLucas Vazquez—8: Played as a forward, right midfielder, and a right back in the span of 30 or so minutes. The team played some of its best football when Lucas was on the pitch. In another iconic penalty shootout moment, the former Castilla player juggled the ball before taking his spot kick and confidently dispatching into the net.\nEder Militao—N/A: Late substitution for Dani Carvajal in the 110th minute.",
  "word_count": 658,
  "scraped_at": "2026-02-14T01:51:24.798677",
  "_text_extracted": true
}