{
  "article_id": "e2f4be0eefa1",
  "url": "https://www.capitalfm.co.ke/news/2025/08/hesbon-hansen-chan-mccarthy-and-the-theatre-of-national-unity/",
  "title": "HESBON HANSEN : CHAN , McCarthy , and the Theatre of National Unity",
  "date": "20250811T063000Z",
  "domain": "capitalfm.co.ke",
  "source_country": "Kenya",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If ever there was proof that football mirrors the soul of a nation, CHAN has just delivered it in high definition. When President William Ruto stood behind the Harambee Stars, he wasn’t just cheering from the stands; he was stepping into the theatre of national unity. You could almost see him relish the presence of Baba as they celebrated Austine Odhiambo’s goal.\nFootball has that rare galvanising power. For ninety minutes, it can take a people battered by political divisions and economic strain and stitch them into one fabric of belief.\nWinning our opening game was more than a sporting triumph. It was a statement—reinforced by the President’s Sh1 million per player pledge, honoured on the spot, countering his often-questioned reputation for keeping promises. The second match brought calm nerves and freer play, with fans holding firm in their belief. In tournament football, that belief is priceless.\nThe McCarthy Factor\nSomething else is brewing in this team: the players look like they are enjoying the shirt again. Much of that credit may belong to one man—Benni McCarthy. Thanks to Vice President McDonald Mariga, who led the scouting and onboarding of McCarthy, Kenya has a coach whose playing pedigree towers over anything our Gen Z and millennial fans have seen in a national dugout.\nI was a schoolboy and ardent football fan when McCarthy announced himself at the 1998 Africa Cup of Nations in Burkina Faso, scoring seven goals and becoming the star of the tournament. From South Africa’s townships to lifting the UEFA Champions League with FC Porto, his career is the kind of story you tell to light up young players’ eyes. We’ve seen him at Ajax Amsterdam, Celta Vigo, Blackburn Rovers—and later, shaping strikers at Manchester United.\nMcCarthy brings more than tactics; he transmits culture, discipline, and a winning mentality. The players seem to enjoy playing for him. It’s an intangible lift Kenya hasn’t felt since the Reinhardt Fabisch era—only now, it comes with the credibility of a man who has reached football’s highest levels.\nMore Than Football\nHosting CHAN under McCarthy has also kept the national team in the public psyche. The facelift at Kasarani Stadium is no small feat, and the government will understandably claim part of the credit. Football, like politics, thrives on timing, delivery, and public perception.\nIt’s also the one sport in Kenya with a presence down to the grassroots. Look at the influence of Kerubo Momanyi, FKF’s NEC Women Representative—arguably one of the most consequential female leadership roles in our socioeconomic and political landscape. Her office reaches millions of girls and football organisations in every village. Any serious effort to address the plight of the Kenyan girl child—whether social or political—cannot ignore this position.\nHow Close We Came to Losing It All\nThe bigger story, however, is how close we came to missing this moment. Late last year, Kenya was on the brink of losing CHAN and facing a FIFA ban unless proper football elections were held.\nUnder the FKF constitution and FIFA statutes, I was entrusted—alongside Alfred Nganga, James Waindi, Dan Mule, and my steadfast secretary Merceline Sande Ligunya—to chair the FKF Electoral Board 2024. The brief was brutal: deliver free, fair, transparent elections in three months.\nWe built a professional team, navigated the politics, and—with quiet but crucial backing from then FKF President Nick Mwendwa and CEO Barry Otieno—pulled it off. Our secretariat team of Victor Ogalle, Patricia Nikita, Jesse Eyase, Christine Nzomo, and Victor Ombati was exceptional, working long hours under intense pressure with unwavering professionalism.\nBy the time the final ballots were counted, we had not only avoided a ban but fulfilled my inaugural promise—delivering free, fair, transparent, credible, and verifiable elections. We restored credibility to Kenyan football governance and unlocked the path for CHAN to be staged here.\nA Statement of Capability\nNow, as I watch packed stands, upgraded stadiums, and a national team playing with pride, I think back to those tense weeks and realise just how narrowly we avoided losing this opportunity.\nFootball, at its best, distils a nation’s resilience and ambition. CHAN is proving that Kenya can organise, deliver, and inspire when it matters. This tournament is more than a sporting event—it is a declaration that Kenyan football, like the country itself, is ready to step onto the bigger stage.",
  "word_count": 716,
  "scraped_at": "2026-02-14T01:52:36.779121",
  "_text_extracted": true
}