{
  "article_id": "e30267df68a6",
  "url": "https://www.90min.com/how-champions-league-table-works",
  "title": "How the new Champions League table works",
  "date": "20241126T051500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How the new Champions League table works\n- Champions League format was revamped for the 2024/25 season and beyond\n- 36 teams around Europe now competing for places in the knockout stage\n- Final league phase concludes in January\nUEFA took the bold step of reformatting their Champions League competition for the 2024/25 season, with 36 teams now competing for glory on Europe's biggest stage.\nWhile the early tussles in the season used to take place in a group stage round-robin form, a new league phase table has been introduced to decide who qualifies for the knockout rounds and at what stage.\nSo how does the table work? Here's everything you need to know about the reformatted competition.\nHow the Champions League table works\nA revamp this big hasn't been seen in Europe's top club competition since 1992/93, when the European Cup was rebranded as the Champions League with a group-stage format. It also allowed multiple entrants from select countries for the first time, but that process came to an end at the conclusion of the 2023/24 season.\nA 36-team league now opens the competition, with UEFA increasing the total number of competing clubs by four. Each team will play eight games but no longer face the same side home and away, instead taking on new opponents each gameweek.\nEach team's future in the competition will be decided by their position in the table at the end of the league phase in January. The clubs ranked from first to eighth qualify automatically for the last 16 and will be seeded in the draw where they will be pitted against one of the winners from the knockout play-offs, which will be made up of the teams who came ninth to 24th. Sides who end the league phase in 25th or lower are eliminated completely from European football with no Europa League consolation prize.\nThe teams from ninth to 16th will be seeded in the knockout play-offs draw, meaning they will play the return leg at their home stadium, and take on clubs ranked 17th to 24th.\nUEFA also vaguely added the league phase position \"lays out the route for teams to reach the final\", indicating it has an effect on pairings in the knockout stages.\nThe tiebreakers which are used to separate teams sat on the same number of points at the end of the league phase are as follows:\n- Goal difference\n- Goals scored\n- Away goals scored\n- Wins\n- Away wins\n- Points obtained league phase opponents\n- Goal difference of league phase opponents\n- Goals scored by league phase opponents\n- Lower disciplinary points\n- Club coefficient\nThe competition continues in its familiar format from the last 16 onwards before the final, where two teams fight it out to claim the silverware.\nIn the 2024/25 season, the knockout phase play-offs will take place in mid-February before the last 16 kicks off a month later in March.\nThe increase in teams and the reformatted league phase means the total amount of matches played in Champions League seasons has increased from 125 to 189. Prematurely eliminated teams will play eight games while the finalists will have gone through 17 fixtures after the showpiece event.\nThe Europa League and Conference League have also been rebranded. The Europa League follows the same format as the Champions League, while Conference League teams play six matches against six unique opponents in the league phase which still totals 36 clubs.",
  "word_count": 577,
  "scraped_at": "2026-02-14T02:11:20.849010",
  "_text_extracted": true
}