{
  "article_id": "e33424f93a78",
  "url": "https://www.bbc.com/sport/football/articles/cq536ln0zwno",
  "title": "Ballon dOr 2025 : Main contenders for men and women awards",
  "date": "20250922T100000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Who are contenders for 2025 men's & women's Ballon d'Or awards?\n- Published\nThe world's best male and female players will be crowned on Monday.\nThe winners of the two Ballon d'Or awards - for their performances last season - will be announced at a ceremony at Theatre du Chatelet in Paris.\nBut which of the 30 nominees that were announced last month are most likely to win?\nWe have analysed how six of the key contenders for each prize performed last season, using statistics from 2024-25 - across all club competitions for the men and all league matches for the women.\nYou can also have your say and tell us who you think top the class of 2025.\nGet in touch\nSend us your questions\nOusmane Dembele (Paris St-Germain)\nGames played: 53 Minutes played: 3,483 Goals: 35 Assists: 14 Goal contributions: 49 Minutes per goal: 99.5 Minutes per goal contribution: 71.1\nOusmane Dembele played a key role in helping Paris St-Germain win Ligue 1, become European champions for the first time and reach the final of the Club World Cup.\nHe scored 21 goals from 29 games in Ligue 1 to end the campaign as joint-top scorer. He was also named in the division's team of the season and won the player of the year award.\nThe 28-year-old was also the Champions League's player of the season after eight goals and six assists in the tournament, including two assists in the 5-0 final win against Inter Milan.\nDembele then scored in the Club World Cup quarter-final and semi-final victories over Bayern Munich and Real Madrid respectively.\nHarry Kane (Bayern Munich)\nGames played: 51 Minutes played: 3,955 Goals: 41 Assists: 12 Goal contributions: 53 Minutes per goal: 96.5 Minutes per goal contribution: 74.6\nEngland's record goalscorer claimed the first major trophy of his career when he inspired Bayern Munich to the Bundesliga title.\nThe 32-year-old netted 26 league goals to top the Bundesliga scoring charts, including three hat-tricks.\nIn September, he scored 10 goals in 11 days, starting with two for England against Finland in the Nations League on 10 September.\nHe got three more in Bayern's 6-1 league victory on Holsten Kiel three days later, scored four in Bayern's 9-2 Champions League thrashing of Dinamo Zagreb on 17 September and one in his club's 5-0 win at Werder Bremen on 21 September.\nKylian Mbappe (Real Madrid)\nGames played: 59 Minutes played: 4,742 Goals: 44 Assists: 5 Goal contributions: 49 Minutes per goal: 107.7 Minutes per goal contribution: 96.8\nThe France forward ended his first season in Spain as the top goalscorer in La Liga, his tally of 31 goals being four better than Barcelona's Robert Lewandowski.\nMbappe's total came from 34 matches and included hat-tricks against Valladolid and Barcelona. He also scored a treble to eliminate Manchester City in the Champions League knockout play-off round.\nThe 26-year-old became only the third player to score 50 goals for France, a figure he reached in June when he helped his country finish third in the Nations League.\nRaphinha (Barcelona)\nGames played: 57 Minutes played: 4,661 Goals: 34 Assists: 22 Goal contributions: 56 Minutes per goal: 137.1 Minutes per goal contribution: 83.2\nRaphinha helped Barcelona win three trophies in 2024-25 - La Liga, the Copa del Rey and the Supercopa de Espana.\nHis 18 goals and nine assists earned him La Liga's player of the season award.\nThe 28-year-old Brazil forward, who moved to Barcelona from Leeds United in 2022, also ended as the joint-top scorer in the Champions League, finding the net 13 times in 14 games including a hat-trick in a 4-1 win over Bayern Munich.\nMohamed Salah (Liverpool)\nGames played: 52 Minutes played: 4,497 Goals: 34 Assists: 23 Goal contributions: 57 Minutes per goal: 132.3 Minutes per goal contribution: 78.9\nMohamed Salah played a huge role in helping Liverpool become English champions for a 20th time.\nHis 29 goals and 18 assists gave him a total of 47 Premier League goal involvements, tying the record for the most in a 38-game season.\nHis goals tally also secured him the Golden Boot - the fourth time he has won it, a record shared with Arsenal legend Thierry Henry. The 33-year-old was also named the Premier League's player of the year for a second time.\nThe Egypt forward scored three times in the Champions League before Liverpool lost to eventual winners Paris St-Germain in the last 16.\nLamine Yamal (Barcelona)\nGames played: 55 Minutes played: 4,548 Goals: 18 Assists: 21 Goal contributions: 39 Minutes per goal: 252.7 Minutes per goal contribution: 116.6\nThe 18-year-old winger helped Barcelona to the Spanish treble of La Liga, the Copa del Rey and the Supercopa de Espana.\nHe won La Liga's player of the month award in September and was in the La Liga and Champions League teams of the season.\nHe scored twice for Spain in their 5-4 win over France in the Nations League semi-final, although the side lost on penalties in the final to Portugal.\nThe best of the rest\nFormer Manchester United midfielder Scott McTominay is the first Scot to be nominated for the award since former Rangers striker Ally McCoist in 1987.\nThe 28-year-old guided Napoli to the league title during his debut campaign at the club last term following a £25m move from Old Trafford.\nArsenal pair Declan Rice and Viktor Gyokeres are named, while Liverpool quartet Virgil van Dijk, Alexis Mac Allister, Mohamed Salah and Florian Wirtz have been nominated.\nChelsea playmaker Cole Palmer is the only other candidate from the Premier League.\nAitana Bonmati (Barcelona)\nGames played: 26 Minutes played: 1,913 Goals: 12 Assists: 6 Goal contributions: 18 Minutes per goal: 159 Minutes per goal contribution: 106\nOne of two Barcelona and Spain players who could lift the Ballon d'Or for the third time, but the only one who could do it in three successive years.\nAitana Bonmati is undeniably one of the world's best players and it would not be a surprise if she won again - although missing out on two major accolades might not help her cause.\nThere were doubts about her ability to play in the Euros when she was hospitalised with meningitis just days before it began, but she played a typically important role for Spain, including scoring the winner in their semi-final.\nShe was not however the brightest light in the knockout stage as others stole the show and England won the final.\nAlessia Russo (Arsenal)\nGames played: 21 Minutes played: 1,686 Goals: 12 Assists: 2 Goal contributions: 14 Minutes per goal: 141 Minutes per goal contribution: 120\nChampions League winner and Euro 2025 winner... it has been quite a year for the Arsenal striker.\nShe scored in the final of the Euros and found her groove for her club, playing a crucial role throughout the season in front of goal and with her work off the ball.\nThe 26-year-old was named the Football Writers' Association's women's footballer of the year for last season for good reason.\nShe was the Women's Super League's joint-top scorer, sharing the Golden Boot with Khadija Shaw.\nAlexia Putellas (Barcelona)\nGames played: 24 Minutes played: 1,620 Goals: 16 Assists: 11 Goal contributions: 27 Minutes per goal: 101 Minutes per goal contribution: 60\nAlexia Putellas is in the running for a third Ballon d'Or, and it's clear why she is a strong contender even in a year that has not gone entirely to plan.\nBarcelona missed out on the Champions League and Spain were beaten by England in the Euro 2025 final, but Putellas has still performed at a very high standard.\nShe provided 16 goals and 11 assists as Barcelona once again won Spain's top flight and secured a domestic treble.\nHaving already won it back-to-back in 2021 and 2022, she is a strong contender to do it again.\nClaudia Pina (Barcelona)\nGames played: 27 Minutes played: 1,557 Goals: 10 Assists: 7 Goal contributions: 17 Minutes per goal: 156 Minutes per goal contribution: 92\nShe did not win the Champions League, but she was the competition's top scorer. She netted 24 in total for her club and six for Spain.\nThe 24-year-old is a versatile player who is comfortable both as a midfielder and a forward.\nShe regularly makes the difference for club and country and was missed by Spain in the Euros final. Pina is among the favourites for the award.\nLucy Bronze (Chelsea)\nGames played: 19 Minutes played: 1,491 Goals: 2 Assists: 3 Goal contributions: 5 Minutes per goal: 746 Minutes per goal contribution: 298\nLucy Bronze played through the pain of a fractured tibia as she won Euro 2025, on the back of clinching the Women's Super League, FA Cup and League Cup.\nThe full-back secured her fourth WSL title as part of a domestic treble in her first season with Chelsea.\nThe 33-year-old played the fourth-highest number of minutes for the Lionesses in the Euros despite her injury, and scored an emphatic penalty in the quarter-final against Sweden.\nA defender lifting the trophy is never as likely as a forward, but Bronze has had a spectacular year.\nMariona Caldentey (Arsenal)\nGames played: 21 Minutes played: 1,774 Goals: 9 Assists: 5 Goal contributions: 14 Minutes per goal: 197 Minutes per goal contribution: 127\nMariona Caldentey joined Arsenal last summer and helped deliver the biggest prize in the team's history - the Champions League.\nShe hit the ground running and added a creative nous and cutting edge to an already strong frontline.\nShe performed so well since making the move from Barcelona that she was named the WSL's player of the year.\nThe Spaniard netted in the Euro 2025 final, albeit in a losing cause.\nThis article is the latest from BBC Sport's Ask Me Anything team.\nThe best of the rest\nRusso and Bronze were two of five England players from the squad that won the 2025 Euros to be nominated.\nChelsea goalkeeper Hannah Hampton is nominated following her heroic Euro campaign, as well as domestic success with Chelsea as the Blues won the treble.\nChloe Kelly, who scored the winning spot kick in the penalty shootout win in the final against Spain, is up for nomination, while Lionesses skipper Leah Williamson is also in contention.\nWhy are PSG and Real Madrid not at Ballon d'Or?\n- Published22 September 2025\nWhat is Ask Me Anything?\nAsk Me Anything is a service dedicated to answering your questions.\nWe want to reward your time by telling you things you do not know and reminding you of things you do.\nThe team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.\nWe will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.\nOur coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
  "word_count": 1825,
  "scraped_at": "2026-02-14T02:09:24.921330",
  "_text_extracted": true
}