{
  "article_id": "e364a937adce",
  "url": "https://www.gq-magazine.co.uk/article/kylian-mbappe-interview-2024",
  "title": "Kylian Mbappé on being France captain , PSG top scorer and his fitness goals",
  "date": "20240117T100000Z",
  "domain": "gq-magazine.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kylian Mbappé is sore. It’s November, and last night Mbappé’s Paris Saint-Germain fought out a bitter draw with Newcastle in the Champions League group stage at the Parc des Princes. Mbappé scored a penalty in stoppage time, rescuing a point after a frustrating team performance. But if he’s sour about it, Mbappé doesn’t show it, today dressed casually in a plain black T-shirt and a loose-fitting pastel-coloured Jordan tracksuit, Hublot Big Bang One Click peeking out from the sleeve. “Football is a complex thing and you quickly forget the positive experiences as well as the negative ones,” he tells me. “You always have to adapt and reinvent yourself.”\nA few post-game aches are standard for Mbappé, a player who, at 25, has already played more than 400 games at the summit of men’s football. After breaking through as a teenage sensation at AS Monaco, Mbappé won the World Cup with France at just 19. In 2017, he moved to PSG for €180 million (£155 million), becoming the most expensive teenage player ever and one of the most expensive jewels in an all-star team that for two seasons included Neymar and Lionel Messi. He is already Paris Saint-Germain’s all-time top scorer; it seems likely that sooner or later, he’ll achieve the same status with the French national team. (Along the way he became the youngest player ever to reach the shortlist for the Ballon d’Or.)\nIn that time, Mbappé says, he has learned what it takes to keep his body in peak condition: more stretching before matches, more time in the hands of physiotherapists afterwards. “It’s all that largely invisible work that makes it possible to string together matches and come back more easily from any injury,” he tells me, while also emphasising that unlike some players he prefers to draw a clear line between his professional and private life. “I have a well-equipped home gym, but I prefer to spend as much time as possible at the training centre and do whatever I have to do there, even if it means staying late. Recovery is also mental. The club is work, and home is a chill space where I’m more relaxed and where I get to spend time with my family, who I don’t get to see often enough.”\nThis season marks a new era for Mbappé. In July, Messi left PSG for Inter Miami and the MLS. A month later, Neymar moved to Saudi Arabia’s Al-Hilal. The twin departures marked the dismantling of one of the most electric forward lines in football; PSG, one of the most expensively assembled teams in Europe, has gone from a superstar-stacked squad to one that, according to most analysts at least, is now largely reliant on the prodigious talents of Mbappé. “Many great players who have shaped the history of football have left Europe this summer and we are entering a new era,” Mbappé says. “It’s become part of the cycle of this sport and at some point it will be my turn to leave. I’m not worried about these changes. I’m simply thinking about continuing my career and following my own path.”\nMbappé is a player who likes to control every aspect of his image, and how he presents himself to the world. But, throughout our conversation, I can’t help but note that there’s a childlike enthusiasm about him, and his obsession with winning. “The desire to win, to go beyond the limits of what is possible, and to do great things is deeply ingrained in me. I think I owe it to the education and guidance I received both on and off the pitch, which helped me to build myself as a player and as a man,” Mbappé says. “We tend to forget it, but we’re eternally children when we play football. The level at which we play the game changes, but the mentality doesn’t. The passion is constant through the years.”\nDespite leading the Ligue 1 top scorer charts for five seasons in a row – he scored 29 last year, as PSG pipped surprise challenger Lens to the title – Mbappe has recently reiterated his intention to become a more well-rounded player. “That doesn't surprise me because he’s a perfectionist and a competitor. He always wants to do more and be better in every area,” says France coach Didier Deschamps. Heading, for example, was not initially one of Mbappé's many strengths, but Deschamps notes that he’s made noticeable progress in this area, as demonstrated by the goal he scored for France against Australia at the 2022 World Cup in Qatar. “Even if the number of goals he’s already scored is impressive, he can probably still be a little more precise,” Deschamps says.\nMbappé has a more holistic approach to his training. “I think that beyond the technical aspects of becoming better with, say, your left foot or your head, what is most important is broadening your vision of the sport,” he says. “By playing for six or seven different coaches, I've learned six or seven different ways of doing my job. I developed different facets of my game and constantly grew. The right frame of mind requires being able to listen and adapt.” Mbappé says his own frame of mind, and his approach to the game, have been developed through listening to the many great athletes he’s encountered on his travels, such as Roger Federer, Rafael Nadal, Novak Djokovic and French handball star Nikola Karabatic. He’s starting to embrace opportunities to take on greater responsibilities – like being recently named captain of the French national team.\n“The big difference compared to before is that then my attention was really focused on my performance and what I personally could bring to the team,” Mbappé says. “Being captain provides me with a new, broader vision.”\nFour days from now, Mbappé and his teammates will make the short trip from Paris to Le Havre, in Normandy. Mbappé is looking forward to it; he has just bought himself a new PlayStation Portal for the two-and-a-half-hour bus journey. Is he going to play FC 24? “I'm going to load it up,” he says with a laugh.\nFor now, though, he has a few days to recuperate and prepare for the next game. These moments of respite are becoming rarer, due to the recent increase in the number of matches that top-level footballers are being forced to play. The new 36-team format of the Champions League next season and FIFA’s move to a 48-team World Cup in 2026 (up from the current 32) are likely to pile on fixtures for elite players already facing 30-plus league games, international football, and various commercially lucrative pre-season tours abroad. A report released in June 2023 by the players' union FIFPRO, emphasised that due to the lack of recovery time between games, the physical and mental health of professional footballers is deteriorating.\n“I'm afraid we're going to see much shorter careers… because physically or mentally, what's being asked of them today is simply beyond the limit,” Raphaël Varane, Mbappé’s former France teammate, told GQ last year, a few months after the Qatar World Cup. Other players, like Liverpool’s Virgil Van Dijk and Real Madrid’s French midfielder Aurélien Tchouaméni, have similarly voiced their concerns; Manchester City coach Pep Guardiola has spoken out angrily about the risk of injury.\nSure enough, injuries during the last international break in November sidelined several global stars, including Vinicius Jr, Erling Haaland, Gavi, and Marcus Rashford. Mbappé fears that the changes are symptomatic of a disconnect developing between players, fans, and football’s governing bodies. “We're getting closer to the NBA model, with seasons of 70 games. Personally, I’m not against playing that many matches, but we won’t be able to be good every time and give the public the spectacle they expect,” warns Mbappé. “In the NBA, players don’t play every game and franchises practise load management [allowing players to rest and prevent injury]. But if I said ‘I’m tired, I'm not playing on Saturday,’ it wouldn’t go down well. The spectator who pays for his ticket, and who may only see you once during the season, wants to see a performance worthy of the name, and that’s understandable.\n“I don’t want to preach, but we need to think together about how to offer the best possible solution so that players, spectators, and football’s governing bodies can all embrace it.”\nFor now, the Paris Saint-Germain striker is thinking first and foremost about getting through this season with his club and the Euros this summer. After a particularly disappointing tournament in 2021, losing to Switzerland in the round of 16, the French team is eager to do better. “We're one of the most eagerly awaited teams at this tournament and we’re ready and confident. We did very well qualifying and now our objective is to win,” Mbappé adds. “We’ve lost some great champions this year, some extremely important players like Hugo [Lloris] and Raphaël [Varane], but in the end the group hasn’t been affected. That demonstrates real cohesion and an ability to adapt.”\nThere’s also the question of the Olympics, which this summer takes place in Mbappé's home city of Paris. Mbappé would love to take part – and take home an Olympic medal – but he knows the choice is not his alone. “I’ve reached a stage in my life and career where I don’t want to force things any more. If I’m asked, I’d love to go, but if that's not possible, I’ll understand,” Mbappé says. “For every athlete, the Olympics hold a special place. I wanted to go to Tokyo [in 2020] because I want to win everything and write my name in the history of the French team as a player who mattered.”\nMbappé intends to write his own story off the pitch, too. He is aware of his outsized influence – other than Manchester City’s Erling Haaland and Real Madrid’s Jude Bellingham, there are no players under the age of 26 with a bigger profile than him – and wants to use it to serve his values, not just the interests of big brands. He has never hesitated to speak out on social issues, denouncing racism in the stands and on social media, and challenging football for exploiting the image rights of players. Mbappé went as far as boycotting two events with sponsors of Les Bleus in early 2022; being associated with a fast-food chain or a betting company was inconsistent with Mbappé’s beliefs. The tug-of-war with the French Football Federation culminated in September 2022, when the federation said it would review an agreement which, until then, had obliged national team players to take part in commercial initiatives without offering them an opt-out.\nLike many other athletes that he admires, Mbappé is also focused on giving back. In 2020, he launched Inspired by KM, a foundation that supports 98 young people in the Paris area, enabling them to take part in cultural events and leisure activities with the aim of opening their minds to new opportunities. “I’ve always been brought up to pay it forward and share my good fortune. Talent was key to getting where I am today, but I was also helped by being lucky enough to meet the right people at the right time,” he says. “Now that I'm in a position to pass it on, I want to help the next generation as best I can.”\nMbappé cites the example of basketball star LeBron James, whom he met in the US during a Nike campaign a few years ago. ”He is much farther along in his career than I am and projects outside of sport have cemented his place as a sporting legend. Being able to ask for advice from inspiring figures like him provides an opportunity to adjust my plan and create my own approach that is as effective as possible in terms of helping young people today,” he explains.\nThe one thing Mbappé won’t talk about is his future. His contract with Paris Saint-Germain ends in June, and after seven seasons of titles and records, as well as tensions and frustrations, the striker will once again be faced with a dilemma: whether to persist in building a team around him to lead PSG to its first Champions League win and thus etch his name permanently in the upper echelons of French football, or chart his own course by joining another team and shining elsewhere. He has, for several years, been linked with Real Madrid; last summer, Saudi Arabia’s Al-Hilal reportedly offered him one of the most lucrative athletic contracts in history. (Mbappé declined.)\nIt seems that whatever decision he makes, it will be based on more than money. He doesn’t think often about individual records (despite his feats, Mbappé has still never won the Ballon d’Or). Mbappé is more driven to win the Champions League for his team, just as he devotes his energy to finding ways to continue his growth as a player rather than listening to criticism from the media or speculation over his future. “We're in an age of over-consumption, where people expect a lot from players,” he explains. But the bar he sets for himself is far higher than those placed by anyone else. “I've shown that pressure doesn’t affect me negatively, and I’d even say that I need it to perform at my best. Pressure allows me to maintain the degree of excellence required to play at the highest level.”\nStyled by Stella Greenspan\nHair by Brice Tchaga\nMake-up by Mélissa Gateau\nSet design by Felix Gesnouin\nProduced by AP Studio, Paris",
  "word_count": 2262,
  "scraped_at": "2026-02-14T02:10:42.040603",
  "_text_extracted": true
}