{
  "article_id": "e36b5233cc2f",
  "url": "https://punchng.com/chiellini-hails-osimhen-quality/",
  "title": "Giorgio Chiellini Hails Victor Osimhen Quality",
  "date": "20260201T033000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MJuventusChiellini hails Osimhen quality director Giorgio Chiellini has praised Victor Osimhen’s qualities while insisting the Serie A giants were never close to signing the Super Eagles striker, PUNCH Sports Extra reports.\nThe Italian legend spoke after Juventus were drawn against Osimhen’s Galatasaray in the Champions League knockout play-offs, setting up a reunion between the Nigerian forward and Italian football.\n“It’s a strong team with great players. We’ll play the second leg at home, so it won’t end in Istanbul, but we’ll have to be good at going to that stadium to play our game and exploit their weaknesses and limit the big potential and individual players, not just in attack,” Chiellini told Sky Sport Italia from Nyon after the draw.\n“We all know Osimhen, but they are strong in other departments too.”\nWhen asked if he would have liked to play against Osimhen on the field, the former Italy defender smiled and replied, “Right now, I couldn’t cope.”\n“But I would love to mark him for 45 minutes. I was unlucky to face him once late in my career when my physical qualities were limited, and I had to rely more on the mental aspect. He’s a strong player, he attacks the space and has natural hunger within that you don’t see in many players.”\nChiellini praised Turkish football’s recent investments and described the tie as a fascinating challenge.\nAsked if Juventus had ever been close to signing Osimhen before he moved to Galatasaray from Napoli, Chiellini was clear.\n“If you mean that a club likes Osimhen, I think it’s true for all the teams, especially in Italy,” he concluded.\n“But realistically, there’s never been anything more than this.”\nBack in 2013, Chiellini was on the pitch and Antonio Conte on the bench when Juventus lost a group stage game against Galatasaray, facing elimination from the Champions League group phase.\n“Now we are two different teams. We must respect their quality, because they have quality players in all departments, but we must also be aware of our skills and put in an important performance. It will go down to details, like every knockout game, we’ll have to be mature to play in Istanbul and confirm it the following week,” he said.",
  "word_count": 371,
  "scraped_at": "2026-02-14T02:12:22.650482",
  "_text_extracted": true
}