{
  "article_id": "e3b4e9f8d840",
  "url": "https://www.geo.tv/latest/483037-inter-milan-secure-champions-league-semis-spot-after-win-over-benfica",
  "title": "Inter Milan secure Champions League semis spot after win over Benfica",
  "date": "20230419T231500Z",
  "domain": "geo.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "April 20, 2023\nInter Milan booked their place in the Champions League semi-finals by drawing 3-3 with Benfica and winning 5-3 on aggregate.\nInter will face their city rivals AC Milan for a place in the final, in a derby match that promises to be special. This will be the first time an Italian team will reach the final after six years.\nInter striker Lautaro Martinez, who broke his 10-game scoring drought with the team's second goal against Benfica, expressed his pride in representing Inter and being part of the team's resurgence. He emphasized the importance of the upcoming Milan derby in the Champions League semi-finals, stating that \"we all know what this game means.\"\nInter was in control against Benfica and played a resolute game to hold on to their advantage. After taking a 2-0 lead from the first leg in Portugal, Inter was content to sit back and wait for counter-attacking opportunities.\nInter opened the scoring after 13 minutes when Nicolo Barella smashed a left-foot strike into the top corner of the net after a one-two with Lautaro Martinez. Benfica equalized in the 38th minute through Fredik Aursnes, but Inter took control after the break, with Martinez and Joaquin Correa scoring close-range strikes to give the team a 3-1 lead.\nBenfica refused to give up, however, and Antonio Silva and Petar Musa scored late goals to rescue a draw for the Portuguese team. The Milan teams have met twice in the Champions League knockout stages before, with AC Milan winning both ties in the 2002-03 semis and the 2004-05 quarter-finals.",
  "word_count": 262,
  "scraped_at": "2026-02-14T02:06:55.006689",
  "_text_extracted": true
}