{
  "article_id": "e3b91594b760",
  "url": "https://www.espn.in/espn/story/_/id/46925077/nigeria-striker-ademola-lookman-atalanta-once-happy-marriage-seems-repair",
  "title": "Nigeria striker Ademola Lookman and Atalanta once - happy marriage seems beyond repair",
  "date": "20251111T081500Z",
  "domain": "espn.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nigeria frontman Ademola Lookman was part of Italian side Atalanta's brightest purple patches in recent years, but now, despite the departure of short-lived manager Ivan Juric, the Super Eagles man and his club need a mediator.\nRelations have deteriorated drastically, with Lookman deleting all references to the team on social media. A sideline spat with Juric, following former manager Gian Piero Gasperini's derisive comments about his penalty taking, seems to have erased any goodwill from the player.\nBut how did we get here?\nDespite not finding his feet in English football early in his career, Lookman's time in Italy during these recent seasons, has been the apex of his career to date, with the 28-year-old finally realising the potential he showed in glimpses as a youngster... and then some.\nLookman registered 39 league goals across his first three seasons at the club, far surpassing anything we'd seen up to that point in his career, with Lookman spearheading a remarkable episode in Atalanta's history.\nThe Nigerian was at the heart of the club's finest hour -- their 3-0 Europa League final victory over Bayer Leverkusen in May 2024 -- scoring three to become the first player to score a hat-trick in a major European final since 1975.\nHe was named in the Serie A Team of the Season last term, having earlier been named in the Africa Cup of Nations Team of the Tournament after playing a key role in guiding the Super Eagles to the final of last year's competition in the Cote d'Ivoire.\nIn December, he became the sixth Nigerian player to be named Africa's finest, clinching the CAF Player of the Year award at a glitzy awards ceremony in Marrakech, but things have not gone to plan for the attacker or his employers so far this season.\nA season to forget so far\nAfter knee problems impacted him at the start of 2025, Lookman has had to contend with a calf problem already this season, which meant he didn't take to the field for Atalanta until late September.\nSince then, he's struggled to hit anything like the form he's shown in recent campaigns, with a star showing against AC Milan on October 28 -- when the forward equalised for the hosts to salvage a 1-1 draw -- the only outing where Lookman has demonstrated anything like his top form.\nApart from that performance, there have been neither goals nor assists, and with their star man struggling, Atlanta find themselves down in 13th in Serie A, without an Italian top flight victory since September 21 (Lookman's first match back after injury).\nBubbling under the surface of La Dea's problems was an increasing dissatisfaction with head coach Ivan Juric, with both the club's supporters and Lookman failing to get on board with the ex-AS Roma man's vision.\nThe tensions between Lookman and Juric reached a head during the midweek Champions League victory over Marseille, when the manager appeared to grab and then shove his star forward at the Stade Velodrome, after the Nigerian had expressed his unhappiness at being substituted in the 75th minute with the scores still level.\nJuric attempted to downplay the spat after the match, but it dominated the headlines after the fixture, overshadowing an otherwise outstanding 1-0 triumph in France. It was hard to see a way back for Juric at Atalanta, or for the pair's relationship.\nUltimately, there was to be no long-term reconciliation. Lookman featured for 78 minutes of Atalanta's 3-0 hammering by Sassuolo in front of their own supporters on Sunday, a result that ultimately brought the curtain down on Juric's unhappy five minutes at the helm after replacing Gian Piero Gasperini in June.\nWill a new manager save the relationship?\nUnder his predecessor, Atalanta developed a reputation for intense and flamboyant football, with Lookman thriving alongside the likes of Mateo Retegui, Éderson and Teun Koopmeiners.\nJuric's successor -- former Fiorentina boss Raffaele Palladino appears to be the frontrunner -- would surely expect to be able to call upon the West African as he looks to drag Atalanta back up the Serie A table, although it remains to be seen whether the Croatian's exit can salvage a relationship between player and club that appears to have definitively soured.\nIn the aftermath of his touchline quarrel with Juric, Lookman took his grievances to social media, immediately unfollowing Atalanta on Instagram, while also removing all posts which mentioned the club from his handles.\nIt's the latest chapter in the forward's disintegrating relationship with the club who have helped him reach another level in the sport, with Lookman also deleting references to Atalanta during the summer after the club rejected an approach from Internazionale for his services.\nThe 28-year-old refused to turn up to pre-season training as he sought to force through a move to Inter, but then had to return with his tail between his legs after the Nerazzurri turned their attentions elsewhere.\nPreviously, he'd also been publicly criticised by former head coach Gasperini after missing a penalty against Club Brugge in the Champions League last season, with the Italian manager suggesting that Lookman was \"one of the worst penalty takers I've ever seen,\" in a seemingly needlessly exaggerated jibe at the Nigerian.\nRegardless of who comes in to replace Juric at Atalanta, it's hard to see whether Lookman's relationship with his employers can be salvaged in the short-term, let alone until the end of his current contract, which runs until June 2027.\nGiven the Africa Cup of Nations tournament, which runs from mid-December until mid-January, a mid-season transfer away from the Serie A club, wouldn't be the most straightforward option for anybody, but his latest public and social media separation from Atalanta surely necessitates a change of scene.\nTottenham Hotspur, themselves short of creativity and impact in the final third amidst a swathe of injuries and arrivals who haven't worked out, have been mooted as one possible mid-season destination for the attacker.\nFor Wandsworth-born Lookman, a return to his home city of London, and the prospect of signing for one of the capital's heavyweights, might hold genuine appeal, while Thomas Frank has already demonstrated - with the likes of Ivan Toney, Bryan Mbeumo and Yoane Wissa - how he can get the best out of talented attacking options.\nWould Tottenham, however, still a team in transition under Frank, who has been accused of rigid and overly pragmatic tactics at his new club, be the right environment for Lookman to rediscover the momentum he enjoyed earlier in his time at Atalanta.\nAS Roma, and a stay in Italy, has also been named as a potential destination in the local media, although would Lookman be keen on a reunion with former coach Gasperini?\nFor the rest of this week, Lookman can take his mind of his ongoing struggles at Atalanta, as his attentions turn to the Super Eagles, and their upcoming World Cup playoff against Gabon, but it's imperative a decision about the next chapter of his career is made, even if it means a divorce with La Dea.",
  "word_count": 1173,
  "scraped_at": "2026-02-14T01:55:28.736898",
  "_text_extracted": true
}