{
  "article_id": "e3d1017ffe65",
  "url": "https://www.fourfourtwo.com/features/manchester-city-vs-west-ham-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match",
  "title": "Manchester City vs West Ham live stream , match preview , team news and kick - off time for this Premier League match",
  "date": "20230502T201500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City vs West Ham live stream, match preview, team news and kick-off time for this Premier League match\nFind a Manchester City vs West Ham live stream for this Premier League clash.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester City vs West Ham live stream and match preview, Wednesday May 3, 8pm BST\nManchester City vs West Ham live stream and match preview\nLooking for an Arsenal vs Chelsea live stream? We've got you covered. Arsenal vs Chelsea is on Sky Sports in the UK. Brit abroad? Use a VPN to watch the Premier League with your subscription from anywhere.\nManchester City have kicked on recently, winning nine straight matches in the Premier League and going unbeaten in all competitions since the Manchester derby in January. Now the top spot in the league is finally theirs, is there any chance they will slip up before the end of the season?\nNorwegian goal machine Erling Haaland shows no sign of slowing down his alarming scoring rate – but with two games in hand, will Pep Guardiola's side have half an eye on the upcoming Champions League semi-final against Real Madrid?\nWest Ham will certainly hope so. They may well be in 15th but that four point gap to the relegation zone is not enough of a buffer to feel safe just yet. Back-to-back league defeats have seen Wolves and Bournemouth climb above them, and they can't afford to let their own upcoming European semi distract them from the business of Premier League survival.\nKick-off is at 8pm BST. Make sure you know how to watch the Premier League wherever you are.\nTeam news\nNathan Ake and Kevin De Bruyne could both be available for selection for Manchester City, although one is likelier than the other. Ake appears to have recovered from a hamstring injury he suffered against Bayern Munich, and returned to training on Monday.\nDe Bruyne was missing at the weekend and faces a late fitness test if he is to be back in contention.\nGianluca Scamacca is out for West Ham, and Kurt Zouma may also be out of action after picking up an ankle injury against Crystal Palace.\nForm\nManchester City: WWWWW\nWest Ham: LLWDW\nReferee\nJohn Brooks will be the referee for Manchester City vs West Ham.\nStadium\nManchester City vs West Ham will be played at the Etihad Stadium in Manchester.\nKick-off and channel\nManchester City vs West Ham kick-off is at 8pm BST on Wednesday May 3 in the UK. The game is on Sky Sports Main Event and Sky Sports Premier League in the UK. See below for international broadcast options.\nVPN guide\nUse a VPN to watch Premier League football from outside your country\nIf you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit.\nA Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result.\nThere are plenty of good-value options out there. For the Premier League, FourFourTwo currently recommends:\nExpressVPN including a 30-day, money-back guarantee\nFourFourTwo’s brainy office mates TechRadar love its super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS5 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Go get it!\nInternational Premier League TV rights\n• UK: Sky Sports and BT Sport are the two main players once again, but Amazon also have a slice of the pie in 2022/23.\n• USA: NBC Sports Group are the Premier League rights holders, with the Peacock Premium streaming platform showing even more than the 175 games it aired last season. If you pick up a fuboTV subscription for the games not on Peacock Premium, you'll be able to watch every game.\n• Canada: The way to watch Premier League football in 2022/23 is fuboTV, which has exclusive rights to all the action.\n• Australia: Optus Sport will screen every game of the Premier League season. Non-subscribers can access the action via a Fetch TV box and other friendly streaming devices.\n• New Zealand: Sky Sport are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nConor Pope is the former Online Editor of FourFourTwo, overseeing all digital content. He plays football regularly, and has a large, discerning and ever-growing collection of football shirts from around the world.\nHe supports Blackburn Rovers and holds a season ticket with south London non-league side Dulwich Hamlet. His main football passions include Tugay, the San Siro and only using a winter ball when it snows.",
  "word_count": 973,
  "scraped_at": "2026-02-14T02:06:54.986413",
  "_text_extracted": true
}