{
  "article_id": "e3db1d5638c4",
  "url": "https://www.90min.com/your-guide-watching-subway-womens-league-cup",
  "title": "Your guide to watching the Subway Women League Cup",
  "date": "20250203T003000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Your guide to watching the Subway Women's League Cup\n- The semi-finals of the Subway Women's League Cup take place this week\n- Chelsea stage West Ham whilst Arsenal host Manchester City\n- Gunners seek to make it three in a row after beating Chelsea in two consecutive finals\nThe semi-finals of the Subway Women's League Cup are set to take place during the week with Arsenal, Chelsea, Manchester City and West Ham battling it out against one another.\nThree of the four remaining contenders faced the advantage of entering the competition at a later stage, having played just one game due to their respective appearances in the UEFA Women's Champions League.\nArsenal, Manchester City and Chelsea currently have a horse in all four races with ongoing pursuits in the Women's Super League, Adobe Women's FA Cup and the UEFA Champions League. As for West Ham United, an eighth-place occupancy on the league table means that head coach Rehanne Skinner will be throwing all her eggs in one basket as they come up against the Blues in the semi-final stages.\nWith the semi-finals set to take place across Feb 5/6, 90min takes you through everything that you need to know ahead of the League Cup showdowns...\nWho won last year?\nA London derby in Wolverhampton ended with the Gunners lifting the silverware, as a 118th minute winner from Stina Blackstenius saw Chelsea defeated 1-0. The victory shone a positive light on a turbulent season for Arsenal, after failing to surpass the first round of the UEFA Women's Champions League qualifiers.\nA similar story played out the season before, as Arsenal defeated Chelsea 3-1 at Selhurst Park. Blackstenius was on the scoresheet once more as the Gunners clinched silverware amidst an injury-riddled campaign.\nSince the competition's inception in 2011, only Arsenal, Chelsea and Man City have won the League Cup. The Gunners are the frontrunners, having taken home the ultimate glory on seven occasions. The Cityzens have won the competition four times, the last time being in the 2021/22 campaign.\nAs for the English champions, Chelsea have lifted the League Cup silverware on two occasions but have fallen to defeat in the final for three years running.\nSemi final fixtures\nChelsea will be eager to make it to the competition's final once again as the side host West Ham in the opening semi-final. The Blues brushed past Championship side Durham with a 5-0 victory on their route to the semis, whilst West Ham defeated Tottenham Hotspur 2-1 to secure their spot.\nIt is West Ham's third time in the semi-final stages of the competition, making both of their previous appearances also against Chelsea. The Irons will be hoping for better luck this time around, having previously lost 6-0 in 2021 and 7-0 in 2023.\nIn north London, title holders Arsenal will host Manchester City at Meadow Park for a spot in the final. The Gunners will be eager to add a third-consecutive League Cup trophy to their cabinet after defeating Chelsea 3-1 in 2023 and 1-0 in 2024.\nThe League Cup is the last piece of silverware that City have managed to add to their cabinet, winning the competition in 2022 after defeating Chelsea 3-1 at Plough Lane.\nHow to watch\nThe Subway Women's League Cup have confirmed the broadcast options for the upcoming semi-finals.\nKingsmeadow is the confirmed venue for Chelsea vs West Ham United, which will take place at 19:00 GMT on Wednesday February 5. Arsenal and Manchester City will be hosted at Meadow Park, taking place on Thursday February 6 at 19:00 GMT.\nFans will be able to tune into the action on BBC iPlayer, as well as the official Barclays WSL YouTube channel.\nThe venue for the final\nDerby County's Pride Park Stadium has been named as the official host of the Subway Women's League Cup Final. With a capacity of 33,597, Pride Park will welcome fans through the turnstiles on Saturday March 15 for a 12:15pm kick-off.\nThis is not the first time the Derby stadium has hosted a major women's fixture, having previously hosted the 2009 FA Cup Final between Arsenal and Sunderland in front of 23,291 fans.\nThe 2024/25 League Cup Final will be looking to break the attendance record set by last season's final between Arsenal and Chelsea, which saw 21,462 fans fill Wolverhampton's Molineux Stadium.",
  "word_count": 723,
  "scraped_at": "2026-02-14T02:05:36.653260",
  "_text_extracted": true
}