{
  "article_id": "e3e16c19ff17",
  "url": "https://www.nytimes.com/athletic/5703354/2024/08/15/pochettino-usmnt-tactics-world-cup-2026/",
  "title": "Mauricio Pochettino tactics : How he can energise the USMNT ahead of World Cup 2026",
  "date": "20240815T200000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Following an underwhelming Copa America as the host nation this summer and with a men’s World Cup to be played mostly on home soil two years away, the USMNT needed to go big in replacing Gregg Berhalter as head coach.\nConsider their statement made.\nThere is a strong argument to say Mauricio Pochettino will become the most distinguished coach in the history of the United States men’s soccer team when he puts pen to paper. Across 649 games in the biggest competitions in the European club game since 2009 — including 45 in the UEFA Champions League, one of which was in its final — the 52-year-old Argentinian has built a wealth of experience, his bio weighty enough to become the face of the USA’s all-important 2026 World Cup campaign.\nAdvertisement\nBut reputation aside, what can USMNT fans expect from a Pochettino team? And is his appointment a good tactical fit for the current generation of American players?\nEver since Gregg Berhalter first took over almost six years ago, the shadow of the men’s World Cup being co-hosted by the United States, Canada and Mexico in 2026 loomed large. An objective at the heart of his tenure was to integrate young talent into the senior national team, with prospects such as Christian Pulisic (above, right), Tyler Adams and Sergino Dest establishing themselves in the side under his leadership.\nThere was a feeling that group was approaching its collective peak ahead of this summer’s Copa America, also played on U.S. soil, but while the debate rages on around the relative quality of the ‘golden generation’ of American players at Berhalter’s disposal, there is no doubt they underperformed. Defeat to Panama in their second of three group-stage matches may have hinged on an early red card for Tim Weah, but there was a worrying lack of creativity and forward drive from midfield, in a team seemingly still too reliant on Pulisic for moments of attacking inspiration.\nThe good news is that Pochettino is renowned for his work with younger players, and he should relish the opportunity to develop the squad he’ll inherit, with plenty of enthusiasm and exciting, versatile options in different areas of the pitch. Players including Folarin Balogun, 23, Gio Reyna and Yunus Musah, both 21, will appeal to Pochettino — players with star power, but also with something to prove.\nPochettino’s preference for working with young players is a deep-rooted belief that stems from his own formative years when Marcelo Bielsa — later his manager at Spain’s Espanyol and with the Argentine national team — handed him an early chance at Newell’s Old Boys club in their homeland, along with several other promising players who went on to make a major impact in the first team.\nAdvertisement\nHe also believes that it’s difficult to change the mentality or habits of more seasoned veterans who are sometimes unable to adjust to his methods. Pochettino seems wary of allowing a couple of big names to dominate a dressing room — remember, this is a man who lined up alongside both Argentina icon Diego Maradona and Brazilian superstar Ronaldinho in his playing days.\nPulisic carries status and reputation, but doesn’t dominate to a detrimental extent. Pochettino disliked working with a star-studded Paris Saint-Germain side from January 2021 to summer 2022, with big-name forward trio of Lionel Messi, Neymar and Kylian Mbappe undermining his focus on the team’s cohesion without the ball.\nIn that respect, the profile of this USMNT squad, in terms of their ages and characters, seems likely to suit him, with plenty of time to form relationships with the players ahead of that World Cup in just under two years.\nTactically speaking, Pochettino is renowned for a high-pressing ideology, something that he prefers a young squad for, insisting that it’s not about physical capacity but how much players are prepared to run.\nTo explore his style further, we can look at The Athletic’s playstyle wheel, using his solitary season in charge of Chelsea to outline how his team looked to play compared with Europe’s top seven domestic leagues. Those defensive metrics stand out, with their rating of 89 out of 99 for Intensity speaking to the front-footed nature of their press.\nA rating of 96 for Central Progression points to a desire to build attacks carefully and patiently through the middle — something that will suit the technical players at the heart of the USMNT midfield. While many failed to hit their rhythm in the three games at the Copa America, Pochettino will have plenty to work with in that part of the pitch.\nAdvertisement\nAdams, 25, brings unrivalled defensive tenacity at the base of the three-man midfield setup, and is a talented ball progressor who can pick out incisive passes to the more advanced No 8s, while 22-year-old Johnny Cardoso is a strong tackler who is a similarly natural tempo-setter from deep. The technical ability and versatility of Weston McKennie, 25, proved invaluable to Berhalter across the final years of his tenure, while Reyna provided real forward drive and fearlessness from a more advanced position as the USA won the CONCACAF Nations League in March this year.\nThrow in the ball-carrying ability of Musah, the devilish late runs of Luca de la Torre, 26, even the creativity and weight of pass of Malik Tillman, 22, and there are plenty of options for Pochettino to chop and change.\nLess encouraging from the playstyle wheel above will be a rating of 32 for Chance Prevention. Chelsea’s tally of 77 league goals scored last season was their third-highest in the past 15 years, but it came at a considerable cost, as they shipped more league goals (63) than in any other season since the Premier League was founded in the early 1990s.\nAs unglamorous as it may sound, international football is grounded in having strong defensive foundations first and Pochettino did not showcase that in his most recent spell in the dugout.\nSuch shortcomings would naturally put more focus on the individual quality of the back line and goalkeeper; areas where the States’ current roster has its problems. Goalkeeper Matt Turner barely played for his Premier League club Nottingham Forest last season and his kicking and distribution were at times questionable during the Copa America. Of the other options at the position, Ethan Horvath, of Cardiff City in English football’s second-tier Championship, is a step down in quality again and conceded a poor goal when he came on after Turner was injured in that match against Panama.\nThen there is a shortage of obvious candidates to replace centre-back Tim Ream, who turns 37 in October, plus doubts over the strength in depth that exists behind him and the other current starter at that position, Chris Richards.\nPochettino’s possession game will have to exert more control if they are to sufficiently mask that weakness on the biggest stage.\nAdvertisement\nUltimately, international soccer is a tricky arena to navigate. With plenty of time between sets of games, and a disproportionate share of straight-knockout, ‘do-or-die’ matches, ambitious projects can be reduced to individual results, years of work washed away in a few minutes of action.\nIt makes such managerial dismissals as Berhalter’s — and, indeed, appointments like Pochettino’s — difficult to evaluate; the “perfect” candidate nearly impossible to find. But for a squad as young as the one the U.S. currently has, with the eyes of the world set to be fixed firmly on them in two years’ time, a high-profile name like him certainly brings the experience and know-how required, even if this is his first venture into the international game as a coach.\nGolden generations don’t last forever.\nAt the very minimum, Pochettino will bring a welcome dose of belief and expertise to this one.\nAdditional reporting: Michael Cox and Mark Carey\n(Top photos: Getty Images)",
  "word_count": 1303,
  "scraped_at": "2026-02-14T02:10:58.957486",
  "_text_extracted": true
}