{
  "article_id": "e3f79ba2a5ab",
  "url": "https://www.masslive.com/tv/2025/09/how-to-stream-usmnt-vs-japan-friendly-free-today.html",
  "title": "Where to watch united states vs . Japan friendly free live stream today",
  "date": "20250909T213000Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There are plenty of international soccer matches happening on Tuesday, Sept. 9 as World Cup qualifying takes place, but there are also friendlies, including one taking place at Lower.com Field in Columbus, Ohio where the United States is taking on Japan.\nThis soccer match is scheduled to start at 7:30 p.m. EDT and will be broadcast on TNT, Telemundo and NBC Universo. Fans looking to watch this match can do so for free by using DIRECTV, which offers a free trial, or FuboTV, which also offers a free trial as well as up to $30 off your first month. SlingTV doesn’t offer a free trial but has promotional offers available for streaming the match. Max has plans starting at just $9.99/month, and includes movies, original series and more and has US Soccer content and matches available. Peacock has plans starting at $7.99 a month and has exclusive access to the Premier League along with US Soccer action.\nThese squads have met three times in the past, and two of those were friendlies, with the most recent being a 2-0 Japan win back in 2022 in Germany.\nThe USMNT won a 1-0 contest at the 2008 Olympics, and it won the first friendly between the squads in 2006, 3-2.\nWho: United States vs. Japan\nWhen: Tuesday, Sept. 9 at 7:30 p.m. EDT\nWhere: Lower.com Field in Columbus, Ohio\nStream: DIRECTV (free trial); FuboTV (free trial); SlingTV; Max; Peacock\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is DIRECTV?\nDIRECTV is an internet TV service that offers your favorite entertainment, news and sports channels, as well as local TV stations and regional sports networks. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $30 off the first month for new customers.\nWhat is Sling TV?\nSling TV offers a variety of live programming ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancellation.\nWhat is Peacock?\nPeacock offers a variety of sports, including: NFL, MLB, NCAA (football and basketball), Premier League, WWE, NASCAR, PGA Tour, and more. The dedicated “Sports” section within Peacock provides replays, news and analysis. Sports airing on NBC, NBC Sports, USA Network, NBC Universo and Telemundo will be available to you if you have the right Peacock plan. Peacock Premium costs $10.99 per month or $109.99 per year. Peacock Premium Plus costs $16.99 per month, and includes all the same content as Peacock Premium, but without ads. Premium Plus subscribers can also download and watch select titles on the go, and stream their local NBC affiliate.\nWhat is MAX?\nMAX is a streaming service that combines the catalogues of HBO and the various channels that make up the Warner Bros. Discovery Networks like CNN, Discovery Channel and TLC. The service is also partnered with Bleacher Report to provide sports coverage for anything covered by Turner Sports such as the NBA on TNT, the NHL on TNT, college basketball games on TNT and TBS and the Unrivaled 3x3 basketball league. You can also bundle your MAX subscription with Disney+ and Hulu.\nMore sports, gear and tickets\n- Where to watch NBA Celebrity All-Star Game today free\n- How to buy tickets to NBA All-Star Weekend: Celebrity Game, Rising Stars Challenge, All-Star Saturday Night, NBA ASG\n- Where to watch USA women’s hockey game today free\n- 2026 Olympics: How to stream Canada men’s hockey game today live\n- Where to stream Olympic figure skating today live",
  "word_count": 686,
  "scraped_at": "2026-02-14T01:49:53.054785",
  "_text_extracted": true
}