{
  "article_id": "e41927cc4d48",
  "url": "https://www.the42.ie/rory-mcilroy-43-6087663-Jun2023/",
  "title": "The day Rory McIlroy glumly summed up professional sport in the modern age",
  "date": "20230608T091500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A QUICK RUNDOWN of the week’s main sports headlines so far.\nManchester City, who are majority owned by the Vice President of the United Arab Emirates, won the FA Cup and began preparations for the Champions League final in a bid for a historic Treble against the backdrop of allegations of financial malpractice and dishonesty.\nSaudi Arabia’s Public Investment Fund (PIF) has taken control of four of the kingdom’s top football clubs and armed them with the funds to attract high-profile players.\nThe PIF announced a merger deal with the PGA Tour, which will see them take the chairmanship and exclusive investment rights in a new entity that will control the three main tours of global professional golf.\nSaudi Arabian club Al-Ittihad signed Ballon D’Or holder Karim Benzema on a four-year contract worth a reported €100 million per season.\nN’Golo Kante left Chelsea to join Benzema at Al-Ittihad on a three-year contract, also worth a reported €100 million per year.\nSaudi Arabian tourist board ambassador Lionel Messi caused surprise in leaving Qatar-owned Paris Saint-German not for a Saudi club but instead for MLS side Inter Miami, who are co-owned by Qatar ambassador David Beckham.\nAnd on Wednesday Rory McIlroy gave a press conference ahead of the Canadian Open and delivered an answer that glumly, pithily summed up this but not only this.\n“Whether you like it or not, PIF and the Saudis want to spend money in the game of golf. They want to do this and they weren’t going to stop…I’ve come to terms with it. I’ve seen what has happened in other sports. I’ve seen what has happened in other businesses. Honestly, I’ve just resigned myself this is…this is what’s going to happen. It’s very hard to keep up with people who have more money than anyone else.”\nMcIlroy was of course talking in the wake of the abrupt detente between the PGA Tour and LIV golf, which will see an end to the fighting and a merger which gives the Saudi sovereign wealth fund an integral role in professional golf around the world.\nHe could as easily have been talking about football or boxing or F1 or wrestling: it was about those who put the State in the absolute state of all of this.\nThey wanted to do this and they weren’t going to stop.\nWe’ve often talked about sportswashing and the involvement of nation states in sport as a cautionary, morality tale on behalf of those involved in the sport; we condemn the greed of the guardians and stakeholders who invited them in and lament the inertia of the regulators supposed to curb their powers.\nSure, too many people traded principle for profit and were far too lax in allowing global sport become an extension of Middle Eastern foreign policy and a kind of diverting carbon emission.\nIn this respect, the contemporary fate of golf does feel like an American parable. The sport that America privatised has now been nationalised, but by a foreign power. The exclusive, exclusionary golf club is largely an American invention: it is still possible, for instance, to rock up and play the Old Course at St Andrews. Best of luck finding a tee time at Augusta National. By stripping away so many of the sport’s virtues to make more room for money, golf was ultimately prey for those with more money than anyone else.\nBut if golf had erected all of the barricades against the Saudis, would they actually have kept the sport free from nation state clutches?\nThey wanted to do this and they weren’t going to stop.\nHow do you stave off an enemy with a limitless appetite for siege? For this week has clarified that LIV was nothing more than the Saudis’ multi-billion dollar Spite Store; the flex of a chokehold; a bombastic gambit in enthronement.\nThe Saudis were willing to sink hundreds upon hundreds of million dollars on LIV, a bad product with zero commercial prospects, just so they could simultaneously devalue and overstretch the PGA Tour. Those who left diminished the PGA Tour’s product, just as the Tour had to spend more money than ever to staunch the flow of bankable stars to LIV.\nLIV created the PGA Tour’s price and then the PIF were happy to honour it. LIV won’t endure in the new world, but PIF have the chairmanship and an exclusive right to investment so they have successfully captured the whole sport.\nJay Monahan’s volteface has been one of truly shameful distaste, but he has not flinched from saying he took the best deal possible for the PGA Tour, which of course it is, as it resolved a crisis created by the bare fact of the Saudis’ interest.\nMonahan is the latest supposed power broker of a major sport to be relegated to the status of feeble viceroy, following in the path of Premier League CEO Richard Masters, who become one of the first men to eat shit live on the BBC when he insisted to Dan Roan that the Premier League had received legally-binding assurances the Saudi government would have no control over PIF-owned Newcastle United.\nThe litigation between the PGA Tour and LIV is now set to end, but the early stages of that battle did reveal to us a LIV document submitted to a San Francisco court stating that PIF are “a sovereign instrumentality of the Kingdom of Saudi Arabia” and Newcastle and PIF chairman Yasir al-Rumayyan as a “sitting minister of the Saudi government.”\nBut if anyone at the Premier League tried to put a stop to the Newcastle takeover, they would have been met with opposition from Boris Johnson’s government, which lobbied for it to go through.\nThis was in 2021 and a delicate time for the Premier League, as it was not long after they fought off the existential risk of the Super League, partly with the help of Johnson’s government. The Super League, of course, was primarily a secretive plan cooked up by clubs who had been left behind by the outsized wealth of nation-backed clubs.\nThere is ultimately no resisting the awesome gravitational pull of petrowealth. Golf and football didn’t really try to defend themselves, but even if they had, they money would have talked in the end.\nRory McIlroy sat at the Canadian Open with wearied resignation and gave the world a maxim for professional sport in the modern age. Part epigram, part epitaph.\nThey wanted to do this and they weren’t going to stop.",
  "word_count": 1081,
  "scraped_at": "2026-02-14T02:24:42.721511",
  "_text_extracted": true
}