{
  "article_id": "e42a0f056bfe",
  "url": "https://www.teamtalk.com/chelsea/estevao-willian-barcelona-champions-league-real-madrid",
  "title": "Estevao : Real Madrid media react to Chelsea stunner vs Barcelona amid  growing unease  as Lamine Yamal comparison made",
  "date": "20251126T083000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nReal Madrid media react to Estevao stunner for Chelsea vs Barcelona amid ‘growing unease’ as Lamine Yamal comparison made\nEstevao Willian’s heroics for Chelsea against Barcelona at Stamford Bridge in the Champions League have been making the headlines in the Real Madrid media, just days after it emerged that there is ‘regret’ at Los Blancos over not signing the winger.\nEstevao has been a revelation for Chelsea this season, with the Brazil international winger having made an immediate impact for manager Enzo Maresca’s side. Chelsea struck an agreement worth €45million (£39.6m, $52.1m) with Palmeiras back in the summer of 2024 for Estevao to arrive at Stamford Bridge in the summer of 2025 after he turned 18 in April.\nThe 18-year-old has been one of the finds of the season, scoring five goals and giving one assist in 17 appearances for Chelsea.\nEstevao, who has already broken three Chelsea records, was in fine form on Tuesday evening, as the Premier League club beat Barcelona – Real Madrid’s bitter rivals – 3-0 at Stamford Bridge in London in the Champions League.\nThe teenager started on the right of an attacking-three in a 4-2-3-1 formation and scored a stunning goal in the 55th minute, as Chelsea eased past 10-man Barcelona.\nEstevao skipped past Pau Cubarsi, held off Alejandro Balde and powered his shot past Barcelona goalkeeper Joan Garcia.\nThe winger was substituted in the 83rd minute after playing three key passes, having a pass accuracy of 82.8%, and winning two dribbles, according to WhoScored.\nReal Madrid-leaning Spanish publication, Marca, celebrated Estevao’s heroics against Barcelona with gusto.\nWhile putting up a video of Estevao’s goal on their website, Marca wrote: ‘It’s not the first time he’s been compared to Lamine: Estevao’s stunning goal that sank Barca’.\nIn the match report, Marca described Estevao as ‘the star that arrives’ and noted: ‘The 18-year-old former Palmeiras player has arrived at Chelsea with the ambition of achieving great success, and he’s well on his way.\n‘After De Jong lost possession, the ball fell to him, and he beat Cubarsi and Balde before firing a powerful right-footed shot into the top corner past Joan Garcia.’\nReal Madrid ‘regret’ over Estevao Willian\nThe Real Madrid media’s praise for Estevao comes just days after it was revealed in Brazil that Los Blancos have ‘regret’ over missing out on the Brazilian gem to Chelsea.\nVinicius Junior, Rodrygo and Endrick are among the players that Madrid have signed from Brazilian clubs when they were teenagers in recent years, with the Spanish and European giants being able to spot a young talent early.\nESPN Brasil wrote about Estevao on November 17: ‘His meteoric rise also had repercussions in Spain.\n‘Behind the scenes at Real Madrid, there is growing unease over the fact that the club didn’t pursue Estevao when he was still at Palmeiras.\n‘The Brazilian gem was analysed, but the Merengue club decided not to proceed – a decision that, today, is viewed with some regret given the player’s immediate impact at Chelsea and with the national team.’\nIt was not only Marca that underlined comparisons between Barcelona winger Lamine Yamal and Chelsea star Estevao, as the media and pundits in England, too, made similar observations.\nBBC Sport noted that Yamal ‘found himself overshadowed’ by Estevao.\nFormer Chelsea winger Chelsea winger Pat Nevin said on BBC Radio 5 Live after the match: “The goal’s the bit everyone will see, and it was wonderful in a number of ways.\n“But all the other parts of his game, the intelligence, the movement, the picking up of position… he’s a natural.\n“Because usually footballers are called natural and they’re not – but it just looks so effortless for him.\n“Some players just move differently to other players, a grace and elegance. It’s beautiful to see.”\nWhen asked if Estevao and Yamal could reach the same heights as Lionel Messi and Cristiano Ronaldo, Chelsea manager Enzo Maresca said: “He and Lamine are very young, so if you start talking about Messi and Ronaldo – it is too much pressure.\n“They need to enjoy their football. It’s too much for them to be compared with Messi and Ronaldo.\n“He needs to relax, enjoy playing football and the training sessions.”\nLatest Real Madrid transfer news: First 2026 signing, Vinicius Junior update\nIn other news, reliable journalist Fabrizio Romano has named the first signing that Real Madrid will make in 2026.\nWhat Vinicius Junior has told Real Madrid about his future will be music to the ears of Manchester City, who are keen on a 2026 deal for the Brazil international forward.\nAnd finally, Real Madrid are ‘aware’ of Liverpool’s interest in one of their gems, but Los Blancos are not fearful of an imminent exit.",
  "word_count": 792,
  "scraped_at": "2026-02-14T01:49:57.607875",
  "_text_extracted": true
}