{
  "article_id": "e45cd998cf43",
  "url": "https://arsenalnews.co.uk/preview-arsenal-vs-fulham-h2h-best-xis-how-to-watch-more/",
  "title": "Preview : Arsenal vs Fulham – H2H , Best XIs , How to Watch & More – ArsenalNews . co . uk",
  "date": "20250328T201500Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal return to Premier League action with a tricky game against London rivals Fulham at the Emirates Stadium on April 1.\nThe Gunners went into the international break on the back of a crucial 1-0 win against fierce capital foes Chelsea at the Emirates, snapping a three-match winless streak in the Premier League (D2, L1).\nMakeshift striker Mikel Merino proved to be the difference between both sides after heading home a pin-point cross from Martin Odegaard in the 20th minute.\nThat victory reduced the gap to runaway leaders Liverpool at the Premier League summit to 12 points with nine games remaining in the 2024/25 season.\nDespite the gulf between both sides, Mikel Arteta’s side are prepared to fight until the end, and fans will buy Arsenal vs Fulham tickets from Seatsnet.com, hoping their side can build on the win against Chelsea.\nIt’ll take a capitulation of historic proportions from Liverpool and a spotless run of form from Arsenal to change the fate of the Premier League title, but it’s not entirely impossible.\nNevertheless, Arsenal are more likely to finish the season as runners-up for the third consecutive year, but Arteta will be keen for his side to wrap up the campaign with their heads held high.\nThey’re taking on a Fulham side, hunting down a European spot.\nMarco Silva’s side are just four points off fourth-placed Chelsea and three adrift of reigning Premier League champions Manchester City, who sit fifth on the log.\nWith nine games remaining, the Cottagers will back themselves to finish in the top six, which should be enough for them to make history by clinching a European spot.\nThe upcoming meeting with Arsenal will be an uphill task, but they’ll take confidence from their 2-0 win against Tottenham Hotspur before the international break.\nHead to head\nArsenal’s home clash against Fulham will be anything but straightforward, considering the Cottagers are pushing for a place in Europe next season.\nWhile Arsenal will head into this fixture as favourites to win, their recent record against Silva’s troops should send alarm bells ringing in the Gunners camp ahead of next month’s clash.\nArteta’s side are winless in their last three games against Fulham (D2, L1), with both sides sharing the spoils in their most recent meeting at Craven Cottage following a 1-1 draw.\nIt took Fulham just 11 minutes to break the deadlock, with Raul Jimenez opening the scoring, but Arsenal responded through William Saliba nine minutes into the second half.\nOn the plus side for Arsenal, Fulham have alternated between a win and a defeat in their last five games, which means they’re due for a defeat going off that algorithm.\nThe most superstitious Arsenal fans will back their team to inflict the Cottagers’ latest defeat to keep their run going.\nBest XIs\nArsenal\nArteta will be hoping to use the international break to recover some of his injured players ahead of a crucial nine-game run-in, although there’s no guarantee that his squad will be in better shape when club football returns.\nAt the moment, the Gunners are already sweating over the fitness of Jurrien Timber and Riccardo Calafiori after both players withdrew from international duty with knocks.\nThat said, Arteta might still be working with a depleted squad when Fulham visit.\nBarring any other injury worries, David Raya will start in goal with Ben White likely to come in for the injured Timber, lining up alongside Saliba, Gabriel Magalhaes, and Myles Lewis-Skelly.\nArteta’s most trusted lieutenants, Declan Rice and Odegaard, will dictate proceedings from the middle of the park on either side of midfield anchor Thomas Partey.\nArsenal talisman Bukayo Saka has been tipped to return after the break, but the Fulham game might come too soon for the England international, who is eyeing the Champions League tie against Real Madrid.\nWith Martinelli back in action, Merino may be relieved of his makeshift duties at centre-forward.\nLeandro Trossard will likely take the mantle from his Spanish teammate, flanked by Martinelli and breakout star Ethan Nwaneri.\n(4-3-3): Raya; Lewis-Skelly, Gabriel, Saliba, White; Rice, Partey, Odegaard; Martinelli, Trossard, Nwaneri.\nFulham\nSilva has been consistent with his team selection in recent games and has only been forced into the odd tweak due to fatigue or injuries.\nHowever, with only a handful of his preferred starting line-up representing their countries during the international break, the Portuguese manager should be able to name a familiar XI against Arsenal.\nBernd Leno has been a key part of Fulham’s fairytale push for a European spot this season.\nHe has kept five clean sheets, including their most recent game against Spurs, where he made four saves to keep out Ange Postecoglou’s side.\nBarring any unforeseen twists, he should retain his place as Fulham’s last line of defence, although he might find it a bit more difficult to keep the Gunners at bay.\nLeno will likely have a familiar backline ahead of him featuring Antonee Robinson, Calvin Bassey, Joachim Andersen, and Timothy Castagne.\nTwo of those four players are currently on international duty, and Silva will be hoping they return to Craven Cottage with a clean bill of health.\nSander Berge and Andreas Pereira should continue their solid partnership at the base of midfield, with Alex Iwobi, Emile Smith Rowe, and Adama Traore ahead of them.\nSilva is spoilt for choice at the top end of the pitch, with both Jimenez and Rodrigo Muniz producing attacking returns in recent games.\nHowever, unless Jimenez picks up a knock on international duty with Mexico, he should get the nod over his Brazilian counterpart.\n(4-2-3-1): Leno; Robinson, Bassey, Andersen, Castagne; Pereira, Berge; Iwobi, Smith Rowe, Traore; Jimenez.\nTicket Information\nWant to experience the thrill of Premier League football live? Secure your tickets through official club websites.\nFor great deals and a wide selection of seats, especially for Arsenal games, check out Seatsnet.com, a reliable marketplace for finding tickets to every Premier League fixture.\nHow to Watch in the United Kingdom\nCatch all the action of the 2024/25 Premier League season on Sky Sports, TNT Sports, and Amazon Prime Video.\nSky Sports offers the most comprehensive coverage with 128 live matches, followed by TNT Sports with 52 games, and Amazon Prime Video with 20 exclusive streams.\nNo matter your preference, there’s a way to watch your favourite team play.",
  "word_count": 1049,
  "scraped_at": "2026-02-14T02:02:35.596517",
  "_text_extracted": true
}