{
  "article_id": "e4757af34fa9",
  "url": "https://thepeoplesperson.com/2024/02/20/manchester-united-have-made-tijjani-reijnders-their-priority-summer-target-276332/",
  "title": "Manchester United have made Tijjani Reijnders their priority summer target - Man United News And Transfer News",
  "date": "20240220T081500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have chosen Tijjani Reijnders as the primary option to bolster their midfield in this summer’s market.\nCasemiro put in a disaster class of a performance on Sunday evening where he missed tackle after tackle, gave the ball away constantly and was lucky to escape a red card, all in the first 45 minutes of action.\nThe multiple Champions League winner was hooked at half-time as a consequence. United’s depth in midfield is also looking lighter due to Christian Eriksen’s inability to get meaningful minutes and an over-reliance on Scott McTominay, in spite of his goalscoring heroics this season.\nSofyan Amrabat has also failed to have anything like the impact fans believed he would during the summer transfer window, where the signing was massively hyped on social media.\nKobbie Mainoo seems to be the one player holding together the centre of the park at the minute, so it is clear INEOS will want to do something about this during July and August.\nSubsequently, Football Transfers assert that “Manchester United are interested in Tijjani Reijnders, with head coach Erik ten Hag making the AC Milan midfielder a top target for the upcoming transfer window”.\nReijnders is described as “versatile” and “can play in various positions, including defensive midfield, central midfield, and attacking midfield”.\nAt only 25, the Dutch international would also considerably bring down the current age of the midfield department.\nAs usual, no deal will come cheap for the Red Devils as “sources suggest that AC Milan’s hierarchy will not entertain offers below €60 million for Reijnders, owing to his glowing form at Milan this campaign and the fact his contract runs until 2028”.\nThe Red Devils were linked to the player back in October where the price tag was only reported to be at €40m, but clearly the Dutchman’s fine form has emboldened Milan to boost up the asking price.\nHe has already played 33 times this season for the Italian giants, scoring two goals and dazzling Serie A with his dominant midfield displays.\nNaturally, the Old Trafford side are not the only club that have Reijnders on their radar, as sources have informed Football Transfers that Paris Saint-Germain are also interested in the player and may use some their windfall from a likely Kylian Mbappe sale to fund such a move for the Netherlands international.\nUnited certainly need to infuse extra quality and youth into their midfield and if Erik ten Hag is still coach by the summer, it is highly likely he would be interested in a Dutch player with Eredivisie experience.\nWhether INEOS let him pursue the player is a different question as news has been recently relayed here that the petro-chemicals company don’t plan to give the former Ajax manager anything like the same freedom with transfers as he had in the previous regime.",
  "word_count": 470,
  "scraped_at": "2026-02-14T01:56:44.626542",
  "_text_extracted": true
}