{
  "article_id": "e49de113c83a",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-news-coverage/2024/12/8/24316098/possible-dates-emerge-for-the-postponed-merseyside-derby-liverpool-everton-epl",
  "title": "Possible Dates Emerge For The Postponed Merseyside Derby",
  "date": "20241208T140000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 245th Merseyside Derby was postponed yesterday due to safety concerns surrounding Storm Darragh, which produced winds of over 70 mph.\nPossible Dates Emerge For The Postponed Merseyside Derby\nA packed football calendar makes rescheduling a match difficult, so we will probably have to wait a few months for Everton and Liverpool to renew hostilities.\nThe next logical question becomes: when will the match take place?\nTwo possible dates, the midweek slots currently reserved for Champions League playoff matches to reach the official knockout rounds, the 11th or 12th of February, or the 18th or 19th of February. This, however, is dependent on Liverpool securing an automatic berth in the Round of 16, which currently looks likely. Everton, of course, do not have to concern themselves with the ongoings of European football.\nAnother date that has been mooted is New Year’s Day, which would be less desirable for both sides after a busy December.\nZooming out, it would be wonderful if the football calendar was such that matches could be postponed a day or two for whatever reason, and not postponed for months at a time. And also, that possible dates to reschedule matches do not depend on luck that one side or the other does not qualify for one competition or another.\nEverton could also feel aggrieved with the postponement, as Liverpool were without several key players due to suspension and injury, which will likely not be the case when the match does finally take place.\nOf course, this would require that football governing bodies work together for the benefit of players, fans, and the game, instead of trying to squeeze out a few more quid from their slice of the pie. So this will never happen.",
  "word_count": 288,
  "scraped_at": "2026-02-14T02:18:02.445139",
  "_text_extracted": true
}