{
  "article_id": "e4afe8125e49",
  "url": "https://www.bbc.com/sport/football/articles/cd9x25wvv8xo",
  "title": "How Sir Alex Ferguson built his last great Manchester United side",
  "date": "20241224T034500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How Sir Alex Ferguson built his last great Manchester United side\n- Published\nThis is a tale of two sets of tears.\nThe first takes place in the suffocating glare of the global spotlight - in Moscow's Luzhniki Stadium in 2008.\nMillions watch on television around the world, as a British manager ascends to icon status after a torrential downpour and that slip.\nThe second, three years earlier, and 3,000 miles away, takes place behind the locked dressing room doors of the Estadio do Benfica in Portugal.\nJohn Terry's miss in the 2008 Champions League final between Chelsea and Manchester United is the stuff of footballing folklore.\nThe narrative says the Chelsea talisman could have won the cup but messed it up.\nRio Ferdinand's take on proceedings is a little different.\nFor the former Manchester United and England defender, the origins of victory in the Russian capital must be traced back to an entirely different moment of emotion.\nYears earlier, in the dry heat of a Portuguese late evening, it was a young Cristiano Ronaldo who was left in floods of tears by the famed Sir Alex Ferguson hairdryer.\nUnited were in the initial stages of a rebuild phase.\nHaving won the league in 2002-03 they were unable to repeat the feat in any of the next three seasons.\nArsenal (2003-04) and Chelsea (04-05 and 05-06) were having their moment.\nFergie, unhappy about his monopoly being broken, snapped.\nThat moment, and Ronaldo's subsequent response, began, according to Ferdinand, a chain reaction that culminated in that Moscow triumph.\n\"I remember Cristiano in tears in the changing room and I was like, right, this manager don't care, man. He don't care who you are,\" Ferdinand says in the BBC Sport documentary Sir Alex that will be released on iPlayer on Boxing Day.\n\"I remember we'd been to Portugal and played a couple of games.\n\"And Cristiano hadn't played well because he was young and really trying to impress and show why he had gone to Manchester United. Everyone was talking about him and he was trying too hard. It never used to come off.\n\"I remember we played Benfica away, and the manager ripped into Cristiano.\n\"'Who do you think you are? Trying to prove yourself to everybody. Who do you think you are, a superstar?'\n\"He deserved it.\n\"Look at the player that he became.\n\"The manager knew that he could be soft and nice to him, but he had to be hard as well.\n\"To get to where he got to, to be world's best player when he left, he needed moments like that.\"\nFerguson was a man for the big moments and Moscow 2008 was the defining moment of his career.\nThe 2008 crop, even more so than the fabled \"Class of 92\" of David Beckham, Paul Scholes, Gary Neville and Co, were the team that cemented his United legacy with a second Champions League win.\nAnd, perhaps, the best XI Ferguson created across his 26-year career at Old Trafford.\nHow Ferguson built that last great United side (with honourable mention to the Robin van Persie-inspired squad who sent the Scot into retirement with a 13th Premier League title in 2012-13) is a masterclass in reinvention, relentless self-improvement and the not-so quiet revolution - as Ferdinand, Ronaldo and Wayne Rooney can attest.\nJune 2004. And Ferdinand is in another United dressing room hearing a speech showcasing another quintessential Ferguson character trait.\nThere are no tears this time, however.\nRather than losing his head and delivering the hairdryer, this time Ferguson was showing his bullish side.\nAn unwavering belief that he could, and would, rebuild the Reds - even in the face of the self-titled Special One.\n\"When Jose Mourinho came in to Chelsea in the summer of 2004 there were rumours that I and various other players might be leaving,\" Ferdinand remembers.\n\"But he was like, 'listen, we're going to build this team and you're going to be one of the main parts of it'.\n\"He was like, 'just stay with me'. And he's probably the only manager at that time in the world that I would have listened to like that.\n\"He said, 'just trust me. I don't get things wrong often when it's football. Stay with me and we'll get this right'.\n\"I was just like, 'I'm there. I'm behind you, I believe in you.'\"\nAlso on board in June of that summer were two men who were to have a huge impact on that 2008 Champions League triumph.\nThe first is a headline name.\nA once-in-a-generation English talent hot off the back of a breakthrough Euro 2004.\nA young forward by the name of Wayne Rooney whose transfer garnered headlines and newspaper column inches galore.\nThe second was an unheralded second coming. The return of Carlos Queiroz to the United fold as Ferguson's assistant manager following an unsuccessful spell at Real Madrid.\nMourinho's arrival in the Premier League, despite the Portuguese's \"Special One\" proclamations, wasn't all about him.\nIt was part of, and the start of, a wider internationalisation of the Premier League.\nThis was, in part, defined by the likes of Chelsea owner Roman Abramovich bringing an influx of money, and the resultant hike in transfer fees and wages. But it also saw the Premier League - and its managers - needing to embrace the global game.\nRooney was a precocious English talent from Croxteth in Liverpool who did his talking on the pitch. His impact, once he'd recovered from his broken foot at the Euros, was immediate.\nIn your face, in the goals and in the headlines.\nQueiroz was the Portuguese assistant manager who spoke a handful of languages and, in time, would prove to be a crucial bridge between Ferguson's Glasgow roots and an increasingly cosmopolitan squad.\n\"At the time I came to the club, the Premier League and Man United was not that international,\" former Serbia defender Nemanja Vidic told BBC Sport's new documentary 'Sir Alex'.\n\"Carlos was so smart,\" ex-England midfielder Michael Carrick, another of Fergie's signings during the pre-Moscow rebuild in 2006, added.\n\"He would take the coaching pretty much every day really, and lead the week and maybe a little bit more on the tactical side. He was quite dry at times, but focused and good at what he did. And he balanced off the boss particularly well.\"\nPrioritising speed - especially in attack - was key for Ferguson as, step-by-step, the rebuild on the road to Moscow started to take shape.\n\"Wayne and Cristiano had a massive impact, for sure,\" Queiroz says. \"It was part of that change that we had to bring in more speed to reduce the reaction time for our opponents. No doubt, those two kids, they changed completely the environment of that club.\n\"Sir Alex and I always used to think we'd be the first people at training. But, when those kids Cristiano and Wayne arrived at the club, they were there before us.\"\nRooney and Ronaldo were part of Ferguson's gift for reinvention that also included recruitment, with a specific brief: to bridge a gap between the Premier League and European football.\n\"Sir Alex said to me \"I'm looking for someone who can bring me more information about European football,\" Queiroz said.\n\"Someone who can communicate in different languages because in those days Manchester United started to have Spanish players, French players etc.\n\"My skills to communicate in those languages were good and then also we had the shift from Sunday to Tuesday.\n\"English football and culture on Sunday - I attack, you attack. Then on Tuesday in European football it is sometimes, wait and see. It is important to create traps. To wait, and catch opponents in their weaknesses.\n\"In England it was 'I do my best, you do your best, and we'll see'. But when you play Italians, when you play Spanish teams, it was not the same approach.\n\"When Sir Alex and I were having these discussions it was a case of keeping the balance inside the changing room to play in the English style at the weekend and then three days later in Europe, change our approach.\n\"When Sir Alex brought me in to Manchester United, one of the first conversations we had... I still remember his words. He said to me: 'Carlos, you have to understand, you are here to help me win another Champions League.'\"\nRooney was also at the heart of this driving ambition of Ferguson - another Champions League title to take back to Old Trafford.\nFor Rooney, one of the Scot's greatest gifts en route to achieving that goal was the capacity to rebuild.\n\"I think what Sir Alex did is he went through different phases of different teams and at Manchester United he was able to rebuild a squad and go in a different direction,\" Rooney says.\n\"To be able to do that and continue to be successful. That's some achievement.\"\nUnlike Ronaldo, who has spoken movingly of his difficult relationship with his dad, a former soldier who became an alcoholic and died when Ronaldo was 20, Rooney wasn't looking for a father figure in Ferguson - but that doesn't mean his man-management didn't resonate.\n\"I didn't really need that [father figure], I was very close to home as well and Liverpool obviously being 30 minutes down the road,\" Rooney says.\n\"I had a lot of friends and family around me, but I've seen it obviously with Cristiano and with different players and how they need that help a bit more.\"\nBy 2006-07 the rebuild was really starting to take shape: Ferdinand and Vidic at the heart of the defence; Carrick running the midfield, allowing Rooney, Ronaldo and Carlos Tevez to run riot in the forward line.\n\"We got to the Champions League semi-finals against Milan and we beat them 3-2 in the first leg,\" Rooney says. \"They had such a unbelievable team, you know - Kaka, Shevchenko, Pirlo, Seedorf, Maldini, Cafu.\n\"They had all really experienced players and we were just coming through and starting to find our feet.\"\nUnited lost the second leg 3-0 and were eliminated. But, a seed had been sown. \"I think from that moment, especially the first game when we won, we knew we were ready to compete,\" Rooney continues.\nThe Premier League title followed that summer - United's first for four seasons.\nA journey that was to end in Moscow was up and running.\n21 May 2008. Mid-morning.\nFerdinand, Rooney, Vidic et al are up and about.\nThey are sitting in a high-end hotel in Moscow being transported back in time 50 years to the shipyards of Glasgow in one of \"probably Sir Alex's best team talks\".\n\"He talked about our backgrounds, and the struggle to get to where we are now and asked us 'How can you not give me 90 minutes of your life now?' Ferdinand says.\n\"Bro, I wanted to get up and run through doors.\"\nFor Rooney and Ferdinand, the real Ferguson masterclass was his ability to tap into his working-class roots - and those of his players.\nAs the documentary 'Sir Alex' explores, Ferguson was the son of a shipbuilder in Glasgow and had spent time before his managerial career as a pub landlord in the city.\nIt was a time, place, and set of values that came to define Ferguson throughout his career.\nAnd it was a time and place he took his players back to as the hours ticked down to his, and their, career-defining moment in the Luzhniki Stadium.\n\"The final didn't kick off until about 11pm and so it was a very long day,\" Rooney remembers.\n\"Sir Alex did his team talk in the hotel before we left and, and it was, really intriguing.\n\"He spoke about the poverty in Russia and the things people have to do to survive in different parts of the world. He spoke about how in some parts of Russia people are fighting just to live and fighting to eat every day and how lucky we were to be going to play on this stage.\n\"He said 'You have money, you have nice houses, cars etc and we had to go out and perform really for 90 or 120 minutes'. It really humbled all of us and it was one of Sir Alex's best team talks.\n\"He was tapping into you as a human being, which obviously tried to help you perform better on the pitch.\"\n\"It wasn't relevant in many ways to the football aspect of the game that we're about to play,\" Carrick continues.\n\"It was about life. About family. And it was always about working hard, always about hard work and how to be proud to work hard.\"\nHard work and humility.\nA non-negotiable cornerstone of Ferguson's approach. And an insight into why a teenage Ronaldo's showboating so riled the Scot years earlier in Lisbon.\nFerguson - harnessing his ability to rebuild and reinvent both himself and his sides - had created arguably the best XI of his 26-year tenure by the time they arrived in Moscow.\nA little over 12 hours after the team-talk of his life, Ferguson's side delivered the defining result of his career.\nRonaldo scored the opening goal that night.\nAnd, while the Portuguese forward was to miss his penalty in the shoot-out, it was ultimately Terry, and Chelsea, who ended the match in tears.\nA tale of two sets of tears.\nAnd a tale about the second of two Champions League titles - a victory that came to define Sir Alex Ferguson's United tenure.\nAnd his footballing legacy.",
  "word_count": 2264,
  "scraped_at": "2026-02-14T01:52:10.149690",
  "_text_extracted": true
}