{
  "article_id": "e4b445a982f5",
  "url": "https://www.meathchronicle.ie/2023/04/30/erik-ten-hag-says-bruno-fernandes-is-proving-captaincy-doubts-were-crazy/",
  "title": "Erik ten Hag says Bruno Fernandes is proving captaincy doubts were  crazy  ",
  "date": "20230430T213000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag says Bruno Fernandes is proving captaincy doubts were ‘crazy’\nBy Simon Peach, PA Chief Football Writer\nManchester United boss Erik ten Hag says Bruno Fernandes’ match-winning display against Aston Villa highlighted just how “crazy” the recent debate about his captaincy was.\nThe Red Devils strengthened their grip on a Champions League spot on Sunday, when the 28-year-old’s first-half strike proved enough to seal a 1-0 win at Old Trafford.\nIt was the latest in a long line of impressive displays by Fernandes, who somehow recovered from sustaining an ankle complaint in last Sunday’s FA Cup semi-final against Brighton to play on Thursday.\nTen Hag heaped praised on the Portugal international after that 2-2 draw at Tottenham, calling him an “inspiration” and an example team-mates must follow.\nThe United boss offered similarly fulsome praise on Sunday and pointed out how laughable talk about his suitability for the captaincy was following the 7-0 loss at Liverpool.\nAsked what it says about Fernandes’ resilience to be playing like he is a week on from that ankle knock, Ten Hag said: “A lot. I emphasise it all on Thursday in London.\n“He’s so tough. A couple of weeks ago there was questions about his captaincy. It’s crazy because he’s such a big leader, by example.\n“He gives so much energy to the team besides his smartness.\n“But also his determination, his passion and his resilience, so I think we as a team are so happy.\n“We need such players if you want to win games, if you want to win trophies.”\nTen Hag says “it’s a pleasure to work with players like” Fernandes, who skippered the side again with Harry Maguire on the bench and fired United to a victory that keeps them well placed for Champions League qualification.\n“We have to keep going from game to game, but I think this is a brilliant week for us,” the Dutchman said.\n“When you’re in the semi-final in a tough game against a good opponent (Brighton) as we have seen in the week, we played a very good game and get through to the final.\n“Then Tottenham, in first half we played very well and today we play in two halves, I think, an impressive game, so big credit to the team.”\nUnited head to Brighton on Thursday night looking to maintain momentum, while Villa have the chance to bounce back from a first loss in 10 weeks at Wolves on Saturday.\nEmery’s men end the weekend seventh in the standings and the four-time Europa League winner is not giving up on continental qualification.\n“It’s more difficult when you are trying to be in the top 10,” the Villa boss said.\n“But it’s really difficult when you want to be in the European positions because you have to win and to win and to win.\n“We were doing that but now we have to do it again. That is the more difficult step ahead that we have but we deserve it.\n“Today against Manchester United we didn’t play as competitive as we have done in other matches.\n“It could be because Manchester United is difficult and controlled the game.\n“If we are defending more the attacking moments are more difficult.\n“We didn’t play good in the first half and we were defending more. It was not enough. The performance in the second half was better.”",
  "word_count": 563,
  "scraped_at": "2026-02-14T02:06:54.988848",
  "_text_extracted": true
}