{
  "article_id": "e4ba57ae9e8f",
  "url": "https://www.managingmadrid.com/2024/12/26/24329786/dani-carvajal-my-objective-is-to-be-back-for-the-club-world-cup",
  "title": "Dani Carvajal :  My objective is to be back for the Club World Cup  ",
  "date": "20241227T003000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid full-back Dani Carvajal, in an interview with Esquire, said his goal is to be back in time for the inaugural Club World Cup set to take place in June.\nDani Carvajal: “My objective is to be back for the Club World Cup”\nCarvajal spoke to Esquire.\nHe also talked about a host of other things, but highlighted his objective to return in time for the competition. He said: “That is my goal. At the beginning of June, it will be eight months since the surgery. We will see how everything progresses. The knee takes its time. I have set that as a goal, but as the date approaches we will see if it is feasible or not.”\nCarvajal on his best moment of 2024\n“I would say that scoring in a Champions League final is something unique, that will go down in history. Scoring in the 15th minute and doing it with a header from a corner, without being a tall player, was a very special moment for me. I think it is on par with winning the European Championship. For me, playing with the national team and defending your country is a great source of pride and winning a major title with Spain has been incredible.”\nCarvajal on Real Madrid not having many Spanish players\n“What you say is true. The fact that not so many Real Madrid players go to the national team is linked to the fact that there are not so many Spanish players starting at Real Madrid. But being a starter at Real Madrid is very complicated: there are the best in the world. To put it in context, our batch when we went up to Segunda in 2012, there was Morata, Nacho, Joselu, me... We came from a winning Castilla team, who in the play-off to go up to Segunda we scored eight goals against Cádiz. That’s when you could see that a very good generation of players was coming. In this case, we are seeing players go to the First Division, which is ultimately the objective of our youth academy, but playing for Real Madrid is very difficult. And no one can deny that the policy that the club has followed in this time has been spectacular, because they have continued to win leagues and Champions Leagues.”\nCarvajal on the Ballon d’Or\n“I’d rather avoid the question. I understand that you ask me, but I’d rather avoid answering because I think that whatever I say could be misinterpreted. I can only tell you that, if I’m not mistaken, I think I’m the right-back who has finished highest in a Ballon d’Or ceremony and, beyond whether I deserve to win it or not, I’m very proud and so is my family. That something like this comes to me at 32 years old is something to be happy about.\n“It does cross your mind. You think: ‘I have won everything, I have been important.’ But it is complex… you understand that from the position of right back it is much more difficult to win a Ballon d’Or.”\nCarvajal on Joselu\n“He is delighted. It is a different experience, isn’t it? It is a competition in which all the stadiums are close, there is a very high quality of life. And he has earned it, to have that important financial remuneration that puts a spectacular end to his career. I am very happy for him, for my sister-in-law and for my nephews. He told me: ‘I’m waiting for you here. I’m saving the right back position for you.’ [laughs].”\nCarvajal on whether he would consider playing overseas\n“Yes, definitely. I wouldn’t think it was crazy. I’ve already said that if I ever leave Real Madrid I won’t play in Europe, I won’t compete against Madrid in the Champions League or in Spain. And that would be a probable destination.”\nCarvajal on the future\n“No, and I dread it. I dread waking up one day and not going to training. Ugh, it terrifies me. That’s why I try to enjoy each day to the fullest. Now I even see my teammates training and I say: “Oh, I wish I could be there.” You value stepping out on the pitch more. Going to the club, being with my teammates, doing my gym sessions, being in the physio room, talking to one person after another, I value all that a lot because I know it’s coming to an end and you have to enjoy it.\n“Well, I’m 32, I’m not a child anymore. What do I have left? Four or five years of football? It’s not much, time goes by quickly.”\nYou can read the full interview here.",
  "word_count": 781,
  "scraped_at": "2026-02-14T01:52:10.148183",
  "_text_extracted": true
}