{
  "article_id": "e4bba9ecb195",
  "url": "https://english.aawsat.com/sports/5028820-chelsea%E2%80%99s-temporary-vision-has-led-shopping-championship-aisle",
  "title": "Chelsea Temporary Vision Has Led to Shopping in the Championship Aisle",
  "date": "20240608T060000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Perhaps it should be no surprise the club has started signing managers like they sign players. Enzo Maresca knows his fate.\nSeriously, Behdad: it’s going fine. Don’t worry, Todd. Everyone knew the plan from the start. Sack the guy who won you the Champions League, sack the promising young coach you hired to replace him, sack the experienced blue-chip coach you hired to replace him, hire a guy from the Championship, raise ticket prices for the first time in 13 years. This is the process. We get it. We see it working. Meanwhile, all the best in next season’s Conference League.\nAnd as sure as night follows day, eventually Enzo Maresca will be sacked too. Eventually. Even as he unfurls his club-shop scarf and smiles for the photographers, even as he moves his belongings into his new office at Cobham, a whispering shadow follows him through the corridors and across the training pitches. It may not happen next season. It may not happen the season after that. It may even be dressed up for the website as “mutual consent”. But it’s the fate that awaits them all in the end.\nEither way, best get to work. And yet if we have learned anything at all from the small sample size of Maresca’s managerial career – which takes in a grand total of 67 games, all at second-tier level – then it is that Maresca’s teams are happy to bide their time. In 2021 he was sacked by Parma just three months into the season with his team just outside the Serie B relegation zone, later insisting that everything would have worked out in the end. “With a little more time and some corrections, we would have got there,” he later said. “I had identified three signings in January and am certain we would have made the playoffs.”\nAt Leicester this season, his team beat a stately path to the top of the Championship: promotion sequestered, almost 100 points gained, and yet at times earning the frustration of fans for their slow, painstaking, passing football. They ranked 20th out of 24 in terms of the average speed of their ball progression up the pitch. They failed to beat either of their main promotion rivals, Ipswich and Leeds, in four attempts. And all this after being bequeathed a Premier League-quality squad boasting almost 400 international caps, featuring a top-flight Golden Boot winner in Jamie Vardy. By all accounts many Leicester fans are none too sad to see him go.\nOf course, none of this tells you anything on its own. Such as: what happens when you apply Maresca’s methods and tactics, honed at the heel of Pep Guardiola as one of his assistant coaches at Manchester City, to better players? What happens when you give him £250m worth of central midfielders, one of the deadliest midfield goalscorers in the Premier League, a fit Christopher Nkunku, a confident Nicolas Jackson, Mykhailo Mudryk on full blast?What happens when you give him a full summer of pre‑season and proper backing in the transfer window? What happens when you give him time?\nOK, we were joking about the last one. But basically this is the calculation the co-owners Todd Boehly and Behdad Eghbali, along with the sporting directors Paul Winstanley and Laurence Stewart, will have made: that Maresca is a young and developing talent, available relatively cheap and yet with a high potential ceiling. Does this sound like a familiar pitch? Perhaps it should be no surprise, ultimately, that Chelsea eventually started signing managers like they sign players.\nChristopher Nkunku celebrates after scoring Chelsea’s second goal against Brighton with Cole Palmer, Malo Gusto and Noni Madueke.\nThe other advantage of a fresh coach is that they are easier to mould and influence. Thomas Tuchel got grouchy. Mauricio Pochettino would slip little poison pills into his press conferences. Neither, ultimately, was comfortable with a business model in which players were signed for their appreciation value, sold to balance the books, where decisions were made by a gilded circle convinced that they had discovered the One Weird Trick to unlocking football. Maresca can grouse and grouch all he wants. But he can’t say he wasn’t warned.\nThere is of course an insoluble paradox here, in that Chelsea are a club trying to attract the sort of manager they have spent the past 20 years mercilessly sacking. The irony of the Roman Abramovich era is that he basically wanted two contradictory things: instant and permanent success, and a team that played that with the sort of technical sophistication that only comes through time and space, from being allowed the latitude to learn from mistakes.\nOver his era these two visions kept fighting each other. Success! But now less robotic, more attractive! Sack! Style, energy, vision! But now with less losing, more trophies! Sack! Wins, silverware, domination! Now do it on a budget with younger players! Sack! An academy paradise! Resale value!\nIf anything, these forces are now even more exaggerated, infused with obnoxious American disrupter vibes, where the very vision of a coach is basically as a temporary enabler, a necessary level of admin between the magnates at the top and the entertainers on the pitch. A guy who can work within the existing structure. A guy who will do what he’s told. But also a strong, ambitious guy with a vision, a guy who never compromises. But also a guy who takes the players he’s given and gets them into the Champions League.\nAnd this – in an admittedly thin market – is how you end up shopping in the Championship aisle. Let’s be real: nobody really knows if Maresca is the best man for the job. But we do know this: since the arrival of Abramovich, Chelsea have won 21 major trophies and the vast majority of them have been won under essentially pragmatic coaches, coaches who could adapt and mould themselves, coaches who could compromise. José Mourinho, Tuchel, Carlo Ancelotti, Guus Hiddink. Maurizio Sarri’s 2019 Europa League may be the only real exception.\nPerhaps the reason so few no-compromise coaches have succeeded at Chelsea is that in a way, going to Chelsea is the first compromise. The “impossible job”, “unmanageable club” stuff is occasionally a little overdone. But whether it is a restive dressing room or a febrile fanbase, a quixotic board or simply the cold reality of vampire capitalism, Chelsea is basically the place where principles go to die. And the coaches who succeed there are the ones who learn that lesson the fastest.\nPerhaps the coach Chelsea actually want does not exist. Maresca, for his part, may well be the next best thing: a guy who auditions well and yet is eternally grateful for the opportunity, a clear vision you can sell, one of the new breed of footballing fundamentalists whose most bankable quality is the ability to sell a 4-0 defeat as progress. And importantly, a coach nobody will mourn when he eventually gets sacked. He may not succeed. But perhaps the nicest thing we can say about Maresca is he may just get the chance to fail in a new way.\nThe Guardian Sport",
  "word_count": 1192,
  "scraped_at": "2026-02-14T01:54:40.190135",
  "_text_extracted": true
}