{
  "article_id": "e4cc42498138",
  "url": "https://www.geosuper.tv/latest/34397-laliga-to-lodge-legal-complaint-after-atletico-madrid-fans-racially-abuse-vinicius-junior",
  "title": "La Liga to lodge legal complaint after Atletico Madrid fans racially abuse Vinicius Jr",
  "date": "20240314T194500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nMarch 14, 2024\nLa Liga will report the \"deplorable racist chants\" directed at Vinicius Junior by Atletico Madrid fans to the legal authorities in Spain.\nThe Real Madrid forward once more seemed to be the subject of abuse from some Atletico fans before their Champions League last-16 match against Inter Milan on Wednesday night.\nThe Brazilian forward has urged UEFA, the governing body of the Champions League, to impose sanctions.\nThe governing body of European football is believed to be reviewing the official match report prior to making any decisions regarding disciplinary action, but La Liga has already taken action even though the match was not under its jurisdiction.\n“La Liga will report the deplorable racist chants against Vinicius Jr before Wednesday’s UCL match between Atletico de Madrid and Inter Milan to the Hate Prosecutor’s Office, regardless of the fact that the match was played in another competition and that the chants took place outside the stadium,” a league statement read.\n“La Liga is wholeheartedly committed to making football a hate-free space and will continue to work relentlessly to crack down on racism, homophobia, violence and hatred… whatever the competition.”\nVinicius replied to a post on X, formerly Twitter, about the chanting and wrote: “I hope you have already thought about their punishment @ChampionsLeague @UEFA.\n“It’s a sad reality that even happens in games where I’m not present!”\nVideos circulating on social media appeared to show some Atletico fans engaged in chants which referred to Vinicius as a “chimpanzee”.\nAtletico supporters have participated in racist chants towards Vinicius previously, notably during a Madrid derby in 2021.\nFans from several other clubs in La Liga have also targeted the 23-year-old with abuse in the past, including Valencia and Sevilla.\nIn May last year, La Liga president Javier Tebas issued an apology for implying that Vinicius was being \"manipulated\" when the Brazilian spoke out against the racism he had experienced in Spain.\nTebas stated that racism could be eradicated from his competition within six months with the appropriate legal framework in place.\n“What we want is the power to do more things. With the power we are convinced within months this would be solved,” Tebas said.\n“We are going along the legal route and I think in six months’ time this will be at zero and we will be the best league in the world.\n“The competencies we want are for those intolerable behaviours – racism, homophobia.”",
  "word_count": 408,
  "scraped_at": "2026-02-14T01:48:46.206561",
  "_text_extracted": true
}