{
  "article_id": "e4d290c7c95b",
  "url": "https://www.empireofthekop.com/2023/06/27/liverpool-rest-easy-salah/",
  "title": "Liverpool fans can rest easy - Mo Salah set to stay put",
  "date": "20230627T153000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool fans may have been worried to see the major names in world football that have been linked, or already succumbed, to the riches of Saudi Arabia and with officials from the middle east already name checking Mo Salah – fears have grown further.\nWriting for The Athletic, James Pearce responded to a question that stated: ‘Is there any risk that we lose Mo Salah to a Saudi Arabian club this summer?’.\nThe former Liverpool ECHO journalist replied: ‘Salah isn’t going anywhere this summer. He’s got two years left on his contract at Liverpool and I don’t see a scenario where either the club would consider selling him or the player would want to leave, regardless of what riches are on the table.\nREAD MORE: Defender Klopp thinks is ‘incredible’ linked with shock move away from Liverpool – report\n‘Salah was hurt by what happened last season, especially missing out on Champions League qualification, but he’s fully committed to leading the fightback in 2023-24’.\nLast season was undoubtedly disappointing for the Egyptian King, particularly given the team’s failure to secure Champions League qualification for the new campaign.\nHowever, this response above emphasises that our No.11’s commitment to the club remains unwavering – regardless of our final league position last time out.\nFor Liverpool fans, the prospect of the 31-year-old staying and not succumbing to the allure of financial gain in Saudi Arabia is a reason to celebrate and with two years remaining on his contract – his loyalty and determination to bounce back serve as a beacon of hope for the upcoming season.\nAs we all too eagerly await the new campaign, we can at least find solace in the knowledge that our beloved Egyptian superstar will be leading the attack, ready to create more unforgettable moments in his famous red shirt.",
  "word_count": 302,
  "scraped_at": "2026-02-14T02:12:52.292958",
  "_text_extracted": true
}