{
  "article_id": "e4db54cb9658",
  "url": "https://theathletic.com/4592794/2023/06/09/manchester-city-and-abu-dhabi/",
  "title": "Manchester City and Abu Dhabi : Triumphant passion project or geopolitical powerplay ? ",
  "date": "20230609T051500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There was an Emirati, a Thai and a Yorkshirewoman. The Thai was the right-hand man of a disgraced former prime minister. The Emirati fancied himself as the Arab world’s answer to Donald Trump. And the Yorkshirewoman used to date Prince Andrew.\nAnd if it sounds like the start of a particularly bad joke, it probably felt that way at the time too. Because in those not-so-distant days, Manchester City — poor, downtrodden Manchester City — were on the wrong end of a lot of them.\nAdvertisement\nCity were in a terrible state in the summer of 2008. They had gone 32 years since their last major trophy, but far more serious was the turmoil after a year under the ownership of Thaksin Shinawatra, who was facing corruption charges in Thailand and described by Human Rights Watch as “a human rights abuser of the worst kind”.\nAfter years in the doldrums, many of City’s supporters had welcomed Shinawatra with open arms, accepting his invitation to a free Thai buffet in the city centre and serenading him as “Frank” (as in Sinatra).\nBut that joke wasn’t funny anymore. Shinawatra had authorised an outlay of nearly £50million ($62.75m) on new players like Elano, Martin Petrov and Rolando Bianchi, but the down payments were small, borrowed against future income, and City were left facing a cash flow problem. Shinawatra’s assets had been frozen in Thailand.\nThree times under Shinawatra’s brief, turbulent ownership, City had to beg their previous owner John Wardle to lend a couple of million to help pay the bills. That was a sticking-plaster solution. Intermediaries and brokers, from the football world and far beyond, were instructed to find a buyer as a matter of urgency.\nAll of which brings us to the trio mentioned earlier:\n- a Thai businessman named Pairoj Piempongsant, whose questionable track record in football, with City under Shinawatra’s ownership and later as a director for Reading and owner of Belgian club Excelsior Mouscron, draws heavily on his links to powerful intermediaries Pini Zahavi and Kia Joorabchian\n- an Emirati real-estate tycoon and TV personality named Sulaiman Al-Fahim, who was quickly sidelined in Manchester after embarrassing the Abu Dhabi establishment with a series of bombastic statements about their plans for City, and who was later sentenced to five years in prison after being found guilty of stealing the money to finance a brief, chaotic ownership of Portsmouth;\n- a Yorkshire-born, Dubai-based financier named Amanda Staveley, who is now recognised as an influential broker in the Saudi takeover of Newcastle United and, on a far bigger scale, in the multi-billion-pound investment in Barclays by the ruling families of Abu Dhabi and Qatar, but who, as a court case in 2020 made clear, was subjected to derogatory comments by some influential figures in UK and Middle East finance circles who looked down their noses at her.\nYou would have been laughed at in 2008 had you suggested those three would cook up a deal that would launch Manchester City (Manchester City!) to the summit of English and European football, a 21st-century sporting superpower and a flagship for Abu Dhabi. None of it would have made sense.\nTo many, it still doesn’t.\nEverything we hear about the modern Manchester City, scaling ever greater heights on the pitch, and the modern Abu Dhabi, forever expanding its influence on the world stage with one multi-billion-dollar investment after another, is about strategy and long-term vision.\nAdvertisement\nIt’s Pep Guardiola, an innovative, imaginative, insatiable coach. It’s City chairman Khaldoon al-Mubarak, who runs Mubadala, Abu Dhabi’s $276 billion sovereign wealth fund, and speaks with an unfailing air of gravitas.\nFrom the outside, the whole thing looks incredibly joined-up — a strategy prepared and implemented almost as meticulously as Guardiola’s on-pitch tactics.\nThe people who work for City Football Group insist it isn’t like that: that Sheikh Mansour’s acquisition of the club was purely a personal investment; that the empire-building at City is wholly unrelated to the empire-building in Abu Dhabi; that the club is not, as many believe, a policy instrument to help advance Abu Dhabi’s geopolitical ambitions; that Manchester City, in the words of one senior executive, speaking on condition of anonymity due to the sensitivity around the situation, “does not produce any of those derivative effects for Abu Dhabi”.\nIt isn’t easy to believe. Looking back at everything Abu Dhabi and City have built, it is hard to get away from the idea that the club is a soft-power tool — all part of the masterplan since day one.\nWell, maybe not day one.\nYou might imagine a £210million transaction between the former prime minister of Thailand and the deputy prime minister of the United Arab Emirates would be negotiated at diplomatic level.\nBut this one wasn’t. At a stretch, you might call it back-channel diplomacy.\nSo much of Abu Dhabi’s growth, in terms of power and influence, has been carefully calculated in line with the aims laid out in its “economic vision 2030” — principally diversifying its economy in the long term to reduce its dependence on oil and gas, and by further integrating into the global economy.\nInitially, at least, Sheikh Mansour’s acquisition of City seemed nothing like that. He had toyed with the idea of buying a Premier League club, but, unlike the purchase of Paris Saint-Germain in 2011 by Qatar Sports Investments (QSI) and the Saudi Arabian takeover of Newcastle United 10 years later, it was a vague notion rather than a formal strategy.\nAdvertisement\nFar from honing on City the way Abu Dhabi and some of its neighbours have honed in on so many other investments in financial and cultural assets around the world, this deal was reactive, opportunistic, having been brought to the table by an unlikely group of intermediaries.\nShinawatra was desperate to sell up and his key aide Piempongsant was introduced to Al-Fahim, who had a route to the Abu Dhabi establishment.\nSo too, most certainly, did Staveley, who was trusted by Sheikh Mansour and his close advisor Ali Jassim. And somehow, over the course of a dramatic fortnight in August 2008, their fanciful notion of the sheikh buying City snowballed into a serious possibility.\nSheikh Mansour gave Staveley and Jassim the green light to fly to London to hear more and then to travel up to Manchester to watch City take on West Ham United. They sat just behind Shinawatra and his family and just in front of Joorabchian in the directors’ box.\nStaveley, having worn a red scarf when trying to broker a deal for Dubai International Capital to buy Liverpool a few months earlier, draped a sky-blue cardigan over her shoulders in what looked like a symbolic fashion choice.\nAfterwards, in the boardroom, Garry Cook, City’s chief executive at the time, made a 45-minute PowerPoint presentation to Staveley and Jassim. Knowing the club’s future was at stake, he went for the hard sell.\nCook recalled the episode in an interview with The Athletic in 2019, saying he had told them, “This is not just a football club purchase. This is an economic regeneration. This is land. This is a city that needs inward investment because public spending has gone away.”\n“They liked the story,” he added.\nBut Cook went further, telling them this was not just about what Abu Dhabi could do for Manchester City or indeed for the city of Manchester. In his eyes, it was about spelling what owning Manchester City could do for Abu Dhabi.\nAdvertisement\nHe was evangelical in his message that owning a Premier League football club — specifically this Premier League football club — would bring more exposure, prestige and global legitimacy than they could possibly imagine at a time when he was sure global television rights were about to skyrocket.\n“What was the purpose of Manchester City to them?” Cook recalled. “It was, ‘How do we create a proxy brand for Abu Dhabi? We’ve already built a racetrack, we’re in the sports business, we need a vehicle.’\n“And that was us.”\nNobody at Manchester City entertains such talk nearly 15 years later, particularly not at a time when the club is at an extraordinary peak of performance, far beyond their supporters’ wildest dreams.\nA vehicle? A proxy brand for Abu Dhabi? Tut tut. This was nothing more and nothing less than a private investment, no different to the sheikh’s investments in Virgin Galactic, Daimler and the media company which owns The National, Abu Dhabi’s English-language newspaper.\nHe just happened to fall head over heels for a success-starved club more than 3,000 miles away. No agenda. No wider motive: ‘Never mind the geopolitics, here’s an incredible football team.’\nSimon Chadwick, professor of sport and geopolitical economy at SKEMA Business School in Paris, takes a rather different view. “It’s not primarily about football,” Chadwick says. “Football is not the end in itself. It’s a means to an end.\n“Abu Dhabi is a rentier state. Like many of its neighbours, it’s resource-rich but it has an over-dependence on those oil and gas resources, so of course they want to diversify. And what they have done with Manchester City and City Football Group is classic rentier state activity. As City Football Group has developed, what we have seen is the club and its network being used as a policy instrument for building diplomacy.”\nAdvertisement\nChadwick cites Abu Dhabi’s investment in the £1billion ‘Manchester Life’ regeneration project. “This is a city that needs inward investment because public spending has gone away,” as Cook told Staveley and Jassim in 2008.\nAs a property investment, it has been successful — controversially so in the eyes of some — but, as with the acquisition of City, the buying up of prime real estate in London, the stakes in Gatwick Airport, Thames Water and the ExCeL exhibition centre and so on, it appears consistent with the idea of a wider strategy rather than just another investment or random act of kindness.\nAbu Dhabi’s Mubadala Investment Company, led by City chairman Al-Mubarak, invested £800million in UK life science research in March 2021, followed six months later by a £10billion commitment to Britain’s technology, infrastructure and energy sectors.\nThen came a “partnership for the future” signed at Downing Street by then-Prime Minister Boris Johnson and Sheikh Mansour’s brother Sheikh Mohamed bin Zayed Al Nahyan, Crown Prince of Abu Dhabi, to “dramatically expand the breadth and depth” of the relationship between the UK and the UAE.\nThese bilateral agreements are a regular feature of international relations, but increasingly buying into sport and cultural assets seems to work well as a sweetener when investing in the creaking economies of European nations.\nQSI’s acquisition of PSG came at a time of huge Qatari investment in France and a succession of agreements — defence, economic, trade — between the two nations. The Saudi-led takeover of Newcastle United in 2021 followed a similar pattern and, according to emails seen by The Athletic, its successful conclusion was considered important to the UK’s relationship with the Gulf nation.\nThe aforementioned City executive laughs at the suggestion that there is any link between the club’s ownership and this strengthening of the UK’s ties with Abu Dhabi and the UAE.\nAdvertisement\nWhat about Manchester Life? “No!” he says, still laughing, talking of the economic benefits to Abu Dhabi, in terms of return on investment, and the housing and infrastructure benefits to Manchester.\nIt still sounds like a soft-power play. It sounds like City would logically be among the many pillars of the soft-power strategy which, according to the UAE government’s website, aims “to increase the country’s global reputation abroad” and — contrary to the frequent criticisms from groups like Amnesty International and Human Rights Watch — “to establish its reputation as a modern and tolerant country that welcomes all people from across the world”.\nOr, as none other than Sheikh Mansour announced in September 2017 at a meeting of the UAE Soft Power Strategy Council, which he chairs: “Our goal is to build a strong reputation for the nation, through which we can achieve our developmental, economic and cultural goals and ambitions.”\nClearly, those ambitions stretch beyond Manchester and far beyond the UK. But so too, perhaps, does City Football Group and its usefulness — potential or actual — as an instrument of diplomatic policy.\nIn July last year, City Football Group (CFG) acquired a majority stake in Serie B club Palermo, expanding its global portfolio to 12 clubs, which range from long-established European clubs like Girona and Lommel SK to new franchises like New York City, Mumbai City and Melbourne City (formerly Melbourne Heart).\nThe appeal of establishing a presence in Italy was obvious. As for the specific appeal of Palermo, CFG chief executive Ferran Soriano praised “a great and historic club with a strong and proud identity”.\nChadwick found himself speculating about another possible attraction: Palermo, on the island of Sicily, is a busy port which, according to reports in Italy, is the subject of huge interest from two Chinese state-controlled shipping companies.\nAdvertisement\n“City Football Group and Palermo might be about football and there might prove to be major benefits from a football perspective,” Chadwick says. “But it’s also very interesting from a geopolitical perspective when China is interested in the port of Palermo, the UAE is a co-signatory to China’s Belt and Road Initiative (which aims to connect China with Southern Asia, the Middle East, Africa and Europe via new land and maritime trade networks) and Abu Dhabi is developing such strong links to China.\n“Maybe I’m wrong, but the way I see it, Manchester City and City Football Group are levers towards achieving other things. Strengthening the relationship between Abu Dhabi and the UK has been important. Strengthening the relationship between Abu Dhabi and China has been even more important.”\nIn October 2015, China President Xi Jinping, on the last day of a state visit to the UK, was given a guided tour of City’s training campus along with then-UK Prime Minister David Cameron. Their tour guide was Al-Mubarak.\nOn a trivial note, that visit is best remembered for the selfie Sergio Aguero took with Cameron and President Xi, which went viral. More significantly, Cameron took the opportunity to announce a new deal for Chinese investment in the north of England and in Manchester specifically.\n.@aguerosergiokun: \"Thank you for the selfie, President Xi\" 感谢能与您自拍，习主席！#CFAStateVisit pic.twitter.com/4du2zIaacY\n— Manchester City (@ManCity) October 23, 2015\nSix weeks later, the state-backed China Media Capital paid $400million to take a 13 per cent stake in CFG. Another week later, in a rather more significant deal, China and the UAE announced plans for a $10billion joint investment cooperation fund, to be managed by Mubadala, the sovereign wealth fund chaired by Al-Mubarak.\nAgain the City executive rejects talk of a link between these events and Abu Dhabi’s diplomatic interests and the club. Questions about CFG’s investment in Chinese club Sichuan Jiuniu in 2019 and last year’s acquisition of Brazilian club Bahia Esporte Club (not far from the Mataripe oil refinery, which Mubadala had recently bought for a reported $1.8billion) meet with a similarly dismissive response: no agenda, no geopolitical approach, all for football reasons.\nIt could have been another Premier League club.\nAdvertisement\nAt the time of the takeover, Al-Fahim said Arsenal, Liverpool and Newcastle had also been “possibilities”.\nFormer Liverpool captain and manager Graeme Souness once recounted a conversation in which Staveley had told him she “tried and tried“ to buy the Merseyside club on behalf of Sheikh Mansour.\nIt sounded like it was probably a misunderstanding, given Staveley spent the early part of 2008 engaged in a well-publicised bid to buy Liverpool on behalf of Dubai International Capital (DIC) in early 2008. “But (George) Gillett and (Tom) Hicks (who owned the club between 2007 and 2010) were so difficult to deal with, they just walked away in the end,” Staveley told Souness, which certainly reflected the way things went with DIC’s bid for the Merseyside club.\nMore intriguing was a line that cropped up in a court case between former Newcastle United owner Mike Ashley and the club’s former vice-president Tony Jimenez in 2018. Jimenez’s lawyer, Adam Johnson KC, stated that in 2008 “Mr Ashley refused to meet a potential buyer who went on to purchase Manchester City Football Club”.\nJimenez did not respond to The Athletic’s invitation to expand on this claim.\nAn intermediary who knows some of the figures involved believes someone connected to Abu Dhabi held talks with Alisher Usmanov, who at the time was Arsenal’s second biggest shareholder, but that the conversation went nowhere because the Russian oligarch wanted to retain a portion of his 24 per cent stake. A spokesman for Usmanov could not recall whether this was the case.\nAnother source suggests Tottenham Hotspur was the most likely alternative to City. But whatever the truth, none of those options had truly materialised by the time Staveley came to Sheikh Mansour with the idea of buying City.\nUnusually, contrary to their reputation for shrewd investments, the sheikh and his inner circle in Abu Dhabi did no due diligence before the memorandum of understanding. Time was of the essence — September 1 was transfer deadline day, leaving them with a matter of hours to pull off a major signing as a statement of their intent — so they simply took a leap of faith. Due diligence could wait.\nAdvertisement\nAl-Fahim was everywhere, presenting the deal as a personal triumph, revelling in the publicity as he reeled off a shopping list of superstars.\nThey had somehow gazumped Chelsea and signed Robinho from Real Madrid just before the transfer deadline, but Al-Fahim said that was only the start. He said they would bid for Arsenal’s Cesc Fabregas, Liverpool’s Fernando Torres and Manchester United’s Cristiano Ronaldo when the transfer window reopened. “Ronaldo has said he wants to play for the biggest club in the world, so we will see in January if he is serious,” Al-Fahim said, provoking a combination of fury and hilarity from Old Trafford.\nThe frontman for the takeover was regarded as a loose cannon. The image Sheikh Mansour wanted to project to the world was one of dignity and respect, of collaboration with the global elites rather than talking up plans for world domination.\nAl-Fahim was swiftly sidelined before resurfacing, briefly and fairly disastrously, at Portsmouth. He was sentenced to five years in prison in February 2018, having been found guilty of forgery, using forged documents and aiding and abetting, but it is not known whether he served a sentence. He has spent the past four years running a cryptocurrency exchange. He did not respond to The Athletic’s efforts to contact him.\nHe was effectively replaced as the frontman for the new regime by the far quieter, more thoughtful figure of Al-Mubarak, the respected chief executive of Mubadala.\nWithin days Al-Mubarak sent Simon Pearce, a trusted PR consultant based in Abu Dhabi, to Manchester for a fact-finding mission that threw up some alarming discoveries.\nPearce returned with positive feedback about key staff members like Cook and Vicky Kloss, the long-serving head of communications, and Mark Hughes, who had taken over as manager that summer. He was far less impressed — horrified in fact — by the facilities and the lack of infrastructure, efficiency and business strategy.\nAdvertisement\nThe transformation over the first five years of the new regime, let alone the decade since, was spectacular.\nIt has taken a great clarity of vision and thinking, as well as an enormous amount of money from those helpful new commercial partners in Abu Dhabi, to transform City from one of the most chaotic clubs in the Premier League to one which, in terms of infrastructure and strategy, has set a gold standard.\nAs for the “noisy neighbours” label that a distinctly unimpressed Sir Alex Ferguson stuck on City in the first year after the takeover, it has gone. City have done their talking on the pitch.\nYes, the spending has been extravagant, but the club has also benefited from a vision and clarity of thought as well as an ability to appoint and empower top-class operators like Guardiola and chief executive Ferran Soriano. And the club has projected itself — and by extension Abu Dhabi — in a far more restrained, measured, diplomatic way than Al-Fahim’s brash statements in those early days suggested.\nIf the Qatari regime at PSG has resembled a circus in recent years, City looks serene, which is just the way those in Abu Dhabi would like it.\nAnd now we come to the huge elephant in the room: those 115 charges relating to alleged breaches of Premier League financial regulations between 2009 and 2018, stemming from leaked emails which appear to show senior figures at City corresponding about ways in which to tweak the club’s commercial revenue from partners in Abu Dhabi — in some cases very substantially — in order to ensure compliance with UEFA Financial Fair Play rules.\nCity deny any wrongdoing, claiming “the attempt to damage the club’s reputation is organised and clear” and citing the “comprehensive body of irrefutable evidence that exists in support of its position”.\nEven Guardiola has acknowledged his discomfort at the charges hanging over the club. “What I would like is if the Premier League and judges could make something as soon as possible, then if we have done something wrong everybody will know it,” the City manager said last month. “And if we are like we believe as a club — for many years (behaving) in the right way — then the people will stop talking about that.”\nAdvertisement\nDoes the controversy temper what would otherwise be effusive, unqualified praise for what City have built? Among many, yes. Does it affect wider perceptions of Sheikh Mansour and Abu Dhabi? Probably not. Does it impact their wider objectives? Not in the slightest.\nWin or lose in Istanbul, the party line remains the same: this is a football operation linked to a private investment, not the “proxy brand” of Cook’s description or the “policy instrument” proposed by Chadwick.\nWhat would winning the Champions League mean for Abu Dhabi? A senior figure within the emirate’s executive hierarchy suggests pride, happiness for Sheikh Mansour but no great triumphalism — nothing of the type that characterised Qatar’s hosting of the 2022 World Cup for example.\nHe says it again: no geopolitical or wider strategic dimension to the sheikh’s ownership of City. Bringing a Formula One Grand Prix to Abu Dhabi — making it such an event that it is now the climax of the season — was “clearly a macroeconomic play as part of a multi-stakeholder plan”. Owning City, he insists, was not and is not.\nHe makes an exception for City’s commercial partners in the region, including Etihad Airways, Experience Abu Dhabi (the tourist board), telecommunications giant e& (formerly Etisalat) and even the Emirates Palace Mandarin Oriental Hotel, where the deal was struck between Piempongsant and Al-Fahim on that fateful day in 2008.\nThe benefits of those commercial deals have frequently been questioned, particularly in light of some of Der Spiegel’s allegations about where the money was coming from. So have the club’s claims to meet the “fair value” criteria laid out in UEFA’s financial regulations.\nBut the Court of Arbitration for Sport, finding in City’s favour after they were initially found guilty of FFP breaches by UEFA and banned from the Champions League in 2020, concluded that the club’s commercial deals were “fair value”.\nAdvertisement\nEtihad are understood to pay CFG in excess of £67.5 million a season to cover shirt sponsorship as well as naming rights for the stadium and training campus. The airline told The Athletic in 2020 that “the partnership remains very important to us as the cornerstone of our global sponsorship strategy, providing brand awareness through people’s passion across international borders”.\nThe benefits to Abu Dhabi’s tourism industry are hard to quantify. The Department for Culture and Tourism’s annual report in 2020 said that Abu Dhabi attracted 13.3 million “leisure visits” the previous year, of which around five per cent were from the UK — considerably more than any European nation.\nThe idea that owning City produces no other “derivative benefits” for Abu Dhabi, other than as a financial investment, is a surprising one given that so many of its other investments — including its partnerships with the Louvre, the Sorbonne and New York University — are framed precisely in those terms.\nIf a journalist were to write that Qatar’s ownership of PSG, or Saudi Arabia’s ownership of Newcastle, brought no derivative benefits, they might expect an angry call and a series of emails from a spin doctor, highlighting the synergy and multitude of strategic benefits while simultaneously taking issue with any mention of “sportswashing”.\nThe difference is that City have always been presented as a private investment by the sheikh. Any suggestions of “state ownership” have been rebutted from the outset. And that stance is certainly not changing.\nBut it looks a lot like state ownership. And it sounds a lot like state ownership. Not in a formal sense, clearly, but in a practical sense. And obviously not for PR in its traditional sense, among the public, but in terms of prestige, recognition and power at a diplomatic level, helping Abu Dhabi increase its geopolitical influence on the world stage.\nAgain the City executive shakes his head. He talks of a desperation, among the media and fans of rival clubs, to join up all these dots and, in doing so, end up with a false picture.\nAdvertisement\nThe truth, he keeps saying, is so much more straightforward. A football operation run by smart, passionate people. Nothing more complicated than that. A private investment devoid of any wider geopolitical dimension.\nJust a guy, standing 3,000 miles from a football club, asking it to bring him a decent return on investment and just a bit more reflected glory in Istanbul on Saturday night.",
  "word_count": 4323,
  "scraped_at": "2026-02-14T01:53:41.889618",
  "_text_extracted": true
}