{
  "article_id": "e4ee381bb2e0",
  "url": "https://www.twtd.co.uk/ipswich-town-news/26454/quite-a-boxing-day-to-look-forward-to-now--notes-for-brentford/onthisday",
  "title": "Quite A Boxing Day To Look Forward To Now - Notes for Brentford - Ipswich Town News",
  "date": "20231224T120000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wednesday, 24th Dec 2014 14:04 by HarryFromBath\nHarryfromBath assesses the mood in the opposition camp ahead of our Boxing Day encounter with the Bees.\n\"Is this the real life? Is this just fantasy?\", \"Is it real or just a dream?\", \"This team is brilliant, simply brilliant. How lucky and blessed we are to witness this season\", \"At this moment in time it is beyond my wildest dreams\", \"In some parallel universe we're losing at home to Dagenham.\"\n\"Twenty-one points out of 24 — a merry Christmas to all Bees fans everywhere.\" Brentford go into Friday's game on a barnstorming run of seven wins in eight games. They quickly picked up the baton after their only defeat in this run (at Huddersfield) winning at home to Blackburn and at Cardiff.\n\"Seriously, this season is just getting ridiculous, but I love it\", \"Every time I think things can't get any better this team just amazes me more\", \"A dream come true\", \"We're third in the table. You want some?\", \"There are cheesy grins that cannot be contained on Brentford faces throughout the land.\"\n\"We showed too much deference to other teams in the early part of the season because of their reputations. Everything has clicked into place for us as it became increasingly obvious that we could not only match them, but we are actually better in skill and organisation.\"\nMark Warburton\n\"When you were a kid, you played with freedom and no pressure. Mark has brought this freedom back\", \"In Mark, we have a far more progressive, positive empowering manager than Uwe Rosler. If Uwe had been in charge, we would have tried to defend a 1-0 lead at Cardiff and failed.\"\n\"This guy could manage England one day. He's in the top 10 managers in the country. He has taken us back to basics, like when I was a kid playing with my mates in the park. Express your talent. Don't be frightened to make mistakes. Know your role in the team. That's how it was and should be.\"\nThe former Watford academy manager is praised for giving his players freedom to express themselves within a clear tactical framework. \"Our tactics are as far from basic as you can get. I would describe them as cutting edge. Watch the movement and rotation of the midfield.\"\n\"The main thing I love is the belief he has instilled in the squad. Uwe Rosler was all about analysing the opponent and countering their threats. Now it's about doing what we do well, imposing our game on other teams and letting them try to adapt. It really is a fresh, positive approach.\"\nCardiff 2 — 3 Brentford\n\"When Michelangelo dismounted the Sistine scaffolding for the last time, he cannot have reflected more satisfyingly on his work than the Brentford XI on their 45 minutes of artistry in the Cardiff City Stadium\", \"Every time we got the ball in the first half, you just felt something might happen.\"\n\"Make no mistake. This was one of the all-time great Bees away performances. To destroy a Premier League team from last season in their own stadium was beyond reasonable belief\", \"Our work-rate in the first half was the ultimate compliment to Warburton and the coaching staff.\"\nBees were enraptured by the quality of their attacking play before the break last Saturday but were left biting their nails after the Bluebirds staged a two-goal fightback. \"Is time actually passing?\", \"God, this is killing me\", \"It was a great effort to hang on, but we sure made it hard for ourselves.\"\n\"We simply stopped doing the things we were so good at, and tried hitting long balls forward\", \"We lost our shape in the second half and gave the ball away, inviting pressure from a tough City side, with Kenwyne Jones a big aerial threat\", \"Thank God Kenwyne only played for 25 minutes.\"\nBrentford 3 — 1 Blackburn\n\"Who would fancy coming here?\" \"Teams arrive at Griffin Park trading on past reputations, but they leave with a lesson in what the reality of Brentford FC is all about\", \"That was an immense performance against one of the better footballing sides to come to Griffin Park this season.\"\nDespite conceding a deflected equaliser just before the break in their last home game, most Bees were confident that they would prevail against a Rovers team which played well. \"We're still the better side\", \"The only time we looked vulnerable was when we briefly stopped attacking.\"\n\"Blackburn Rovers were better than many think. They passed well, tried to close us down high up the pitch, were well organised and broke quickly, but we were better\", \"They tried to outmuscle us but failed. We looked our usual fluid selves for most of the game but battled when we had to.\"\n\"I haven't seen Bees' football at this level and skill in the nearly 60 years I have been coming to Griffin Park\", \"Let's all relish these days, this team, these players, this manager and the whole of Brentford FC. It's the wonderful stuff of tomorrow's history books.\"\nFormation\n\"It's funny - when you speak to Mark Warburton and say you are playing 4-1-4-1, he always says we play 4-3-3.\" Brentford generally play with four defenders, one striker, three central and two wide midfielders, but midfield positions and personnel can change during a game as the situation dictates.\n\"The general thought is that Pritchard plays in an attacking role. Judge used to play on the left but he plays a more central role. Toumani also plays a central role with Jota on the right but Jota can play in the middle. The make-up of our midfield is very fluid and changes constantly during the match.\"\n\"Any team that plays 4-4-2 against us will struggle if we are on our game. Our midfield will just over-run them\", \"Our energy and drive sets us apart from many other teams\", \"We are very fluid. Players swap positions and cover for each other exceptionally well.\"\nAttacking Till the End\n\"This is the new Brentford. We'll keep attacking till the end\", \"Defending the lead is not the way Brentford so things these days. We defend by attacking and pressing\", \"We attack quickly and in numbers. We find and get into space to hurt teams.\"\nThe attacking philosophy the manager has instilled in the team is as important as their formation and passing style of play. \"Warburton believes in attack, attack, attack. He believes it is much better to win four games and lose two rather than win three, draw two games and lose one.\"\n\"It's great to defend a lead late on by bringing on two fresh strikers. It's so refreshing not to sit back and defend a lead\", \"The look of confusion on Blackburn defenders' faces when they won their first corner and saw three Bees on the halfway line was priceless.\"\nDefence\n\"Good defending and hard work\", \"We showed Cardiff how to defend under pressure, by getting our bodies in front of every attack that the hosts could throw at us\", \"When they attempted to play football in the second half, we defended with passion.\"\nDavid Button\n\"Good save from Button. What a reliable keeper we have\", \"He has grown with the team, put in some top displays and has been immense for us this season \", \"What a difference a year has made for this guy. There is no doubt about who our number one is now.\"\nThe 25-year-old former Charlton keeper \"is a great sweeper and probably the best passer of the ball at the club\", \"The way we play out from the back means that Button has to clear up when the centre-backs get closed down\", \"Some of the long passes from his hands are stunning.\"\n\"Button's communicating and commanding his area on crosses and corners are areas to work on\", \"He must stop dropping the ball\", \"It's the weakest part of his game and possibly the only area he needs to work on\", \"He needs to power through and at least get a decent punch on the ball.\"\n\"Jake Bidwell is a most reliable left-back. I worry if he gets enough help from his midfielders, as they have a habit of working across the pitch quite a bit.\" The 21-year-old ex-Everton defender \"is an absolute professional who takes his job seriously. All the basics are done superbly\".\nHe struggled against Huddersfield winger Sean Scannell in their one recent defeat. \"Bidwell had a tough game against a tough opponent\", \"He was caught up-field when Huddersfield broke\", \"He could have got closer to Scannell and let him know he was there with a few strong tackles.\"\n\"Tony Craig keeps things simple.\" The 29-year-old former Millwall centre-back \"is an old fashioned defender who knows his limitations and always gives 110%\", \"He does nothing flashy, gets on with the job and is an inspiration for others\", \"Puts his body on the line. What a warrior! What a man!\"\n\"I have a man-crush on Tony Craig and am not afraid to admit it\", \"He's a good player but Danny Graham gave him the run-around [against Wolves], getting the wrong side of him and making Craig's positional sense look suspect. He battled physically and was fine but Graham had an edge over him.\"\n\"Harlee Dean is a tank, albeit a highly manoeuvrable one\", \"His commitment and desire are brilliant. Two crunching tackles against Rovers epitomised his desire to win. He's getting better on the ball and his piss-taking jinks are fun to watch, although high-risk\", \"He's playing with a lot of confidence.\"\nThe 23-year-old ex-Southampton centre-back \"is strong in the tackle, committed and his distribution is a mix of sublime 30-yard passes mixed with the occasional heart-in-your-mouth sloppy pass. His error did give Blackburn a way back into the game. Harlee's not a dull player by anyone's standards.\"\nMoses Odubajo\n\"We've got one hell of a player on our hands in Moses\", \"His pace is unbelievable. I haven't seen a better right-back this season.\" The 21-year-old former Orient man \"has tremendous recovery pace and more than Bidwell. I enjoy when you think he's caught up-field until he puts the burners on\".\n\"Moses is so much more dangerous coming from a deeper position. It's difficult to track him and he has often gone past the defending full-back before he realises it\", \"He's more easily marked and lost as a right midfielder\", \"He gets more protection from our right-sided midfielders.\"\n\"The Odubajo vs Sako contest was the key to the Wolves game [a 4-0 Brentford win]. Their early sparring was testing each other out, but Moses countered everything Sako did in attack. When the Wolves left-back went off injured, Sako was a spent force and Moses got forward and did damage.\"\nHolding Midfielders\n\"Toumani Diagouraga is an interesting one.\" The 27-year-old former Peterborough midfielder \"was seen as a 'bog standard Division One' midfielder who sometimes had great games and at other times had shockers\", \"He got a break in early November and fans now compare his play to Patrick Vieira.\"\n\"Toumani's positional sense is excellent. With him and Douglas working together, the opposition are forced to pass long\", \"If he had that eye for goal, he could be the Yaya Toure of the Championship. Sadly, he doesn't\", \"There's a glitch in the software which causes an air-kick in sight of goal.\"\nJonathan Douglas\n\"Shorn of the rugged and dependable Douglas, the agenda for the second-half at Cardiff was one of backs to the walls.\" The 33-year-old ex-Leeds man was substituted at half-time last week with a tight calf as a precautionary measure. Many Bees felt his loss was a key ingredient in Cardiff's fight back.\n\"We don't have like-for-like cover for Douglas\", \"The second half at Cardiff brought home that what we are doing is built around him and we are history without him\", \"He is the guvnor\", \"We missed a lot of his unseen work in the second half\", \"You only appreciate someone when he's not there.\"\n\"His drive through the middle puts the opposition on the back foot. His defensive protection and physical presence allows our tricky little guys to do their thing\", \"Douglas battles brilliantly, getting into positions to stop the opposition midfield and support our attacks.\"\nAttacking Midfielders\n\"The quality of our goals and the way we passed the ball around Cardiff made them look clueless\", \"We were absolutely shredding them apart in the first half\", \"Our passing is disciplined and our movement is imaginative\", \"Our midfield is fluid and interchangeable.\"\n\"All the attacking midfielders put in a shift and can interchange to the point where opposition defenders are mesmerised by our slick passing and movement into space\", \"We are fairly remorseless at taking teams apart at the moment.\"\n\"Jon Toral is fast, powerful and tricky, but still a lot to learn. He's getting better with each game he plays.\" The 19-year-old Arsenal loan signing, \"plays a key role in neutralising opposition playmakers. This has allowed us to impose our game and has been a significant factor in our golden November\".\n\"We have a habit of winning games with Stuart Dallas coming on from the bench.\" The 23-year-old former Crusaders winger \"usually comes on the left side of attack despite the fact he's right footed. I like his directness. He is one of the most clinical in front of goal of all our midfielders\".\n\"Tommy Smith is a well-respected professional with proven experience at this level.\" The 34-year-old former Cardiff man \"is an option off the bench and has looked lively when used\", \"He's a bit part player who links play well from time to time\", \"He comes on to change the game or to hold up play.\"\n\"Alex Pritchard's touch and ball control is terrific. At times he had three Wolves players around him and he still came out with the ball. In the end they were just backing off him.\" The 21-year-old loan signing from Spurs plays as an attacking midfielder. \"The ball just sticks to his feet.\"\n\"The diminutive Pritchard placed the ball perfectly into the bottom left-hand corner of Cardiff's goal for our opener\", \"He was given time and space in the first half and he destroyed Cardiff\", \"He lost his way with Douglas' departure\", \"He needs to work harder without the ball and not bottle tackles.\"\nAlan Judge\n\"If my son was an eight-year-old instead of 18, he'd have 'Judge' on his shirt instead of 'Tabb'.\" The 26-year-old former Blackburn player \"has everything, work-rate, skill and passion\", \"He's the best signing we made in the summer, and having him on loan last season helped us over the line.\"\n\"The little fella is unbelievable. He has an amazing engine coupled with great skill, and he plays with a smile on his face\", \"He's the heartbeat of the side and is involved in so much of our good play\", \"He makes things happen and is a joy to watch. The pocket rocket is making a real difference.\"\n\"The pace Judge plays at yet the control he has of the ball is amazing\", \"He's very entertaining to watch, a great team player with endless energy and drive. He's always at the centre of the action and won't shirk a challenge\", \"He has adapted to a more central role. His work rate there is superb.\"\nJota Peleteiro\n\"I would pay my entrance fee alone to watch Jota glide past players as if he was wearing a smoking jacket and a pair of slippers\", \"His speed is deceptive. He leaves defenders gasping in his wake as he effortlessly passed them by like a turbo-charged feather\", \"He ghosts past players at will.\"\nThe 23-year-old Spaniard \"is without doubt the greatest technically gifted Brentford player ever to set foot in Griffin Park\", \"He reminds me of David Silva. He links up play beautifully and has an eye for goal. I just love watching him make football look effortless.\"\n\"Opposition defenders go into panic mode once he gets the ball. They have no idea what to do\", \"You could see Cardiff's defenders were terrified of him\", \"His goal at Cardiff reminded me of Kenny Dalglish at his very best\", \"In four months, this guy has become part of Brentford's folklore.\"\nThe former Murcia player primarily operates on the right flank. \"It's obvious he's all left footed and will cut in 99% of the time, but no-one can stop him\", \"I wonder why people don't force him on to his right foot the whole time\", \"He faded in the second half at Cardiff, offering too little defensively.\"\nStrikers\n\"Being quite honest, we don't score very many goals from crosses. Corners are a no-no for us. We prefer to walk the ball into the back of the net. Until Cardiff last weekend, only one of all the goals Brentford scored was from outside the area.\"\nBrentford are at their happiest and most threatening when working the ball quickly into dangerous positions on the ground. Wide midfielders cut inside and all their attacking players move quickly to pull defenders out of position and create space.\n\"I hope big Nick turns it around.\" Former Hull striker Nick Proschwitz is one player who has struggled this season. \"He's just not been at the pace of the game\", \"He looks slow and clumsy. He mistimes his touch and makes bad decisions. I hope I'm wrong. Maybe he's nervous and trying to impress.\"\nSome Bees are cruel in their assessment of the 28-year-old. \"As long as we're winning, I look forward to Nick's cameo comedy performances. It's like a new episode of Fawlty Towers. You know you will be cringing at something but it's really funny at the same time.\"\nAndre Gray\n\"Andre Gray's pace is incredible. He was green and unfit when we bought him, not used to the pace of higher league football. He had to learn a lot in a short space of time, even though he was top scorer in the Conference last season\", \"The thought of him getting injured genuinely worries me.\"\nAndre 'celebrating' with Jonathan DouglasThe 23-year-old ex-Luton man \"still has a lot to learn but has proved a real handful. He has terrorised most centre-backs we have played so far\", \"He looked small when he arrived but is tough and robust\", \"He doesn't challenge centre-backs for high crosses because we don't play that way.\"\n\"He uses his pace well. If the midfielders can play the ball into him, he either runs onto the ball or runs with the ball into the danger areas. As you will see with his goal against Cardiff at the weekend, he has learned to deal with tough opposition defenders, beating them with pace and strength.\"\nBees' Thoughts on ITFC and the Game\n\"No disrespect to Ipswich, but I would bet a lot of money we play better football than you. I am not saying that as a dig. You are a very good team but I expect us to have most of the possession Friday. It will most likely be our toughest game yet though\", \"This Ipswich game is going to be massive\".\n\"I have watched Ipswich a few times this season. They pass it around from the midfield forward but like to lump it from the back. They mix it up well. They are not the total football side we are, but will definitely be a very tough test. Some key players such as Mings coming back in for them on Friday.\"\n\"I'm sure Ipswich are a disciplined side. They wouldn't be where they are if you weren't. I'm also sure Mick would have done his homework and will have a game plan. I think Ipswich will score so we'll probably have to get at least two to win the game.\", \"Berra could struggle against Gray's pace.\"\nMost Bees expect the usual tough game, but feel they have the similar edge in midfield that they have had over other visitors. \"Ipswich have a mean defence with Berra and ex-loanee Smith. Their midfield looks crap but I really fear McGoldrick and Murphy. It looks like a score draw for me.\"\nOne visiting Ipswich supporter to one forum made the mistake of saying he was expecting a physical encounter, and was ripped to pieces: \"If I tell you that one of the chants at Cardiff on Saturday was 'we're just too small for you' that'll be the most helpful bit you've read on us.\"\n\"Yep, that's us, physical long ball merchants. No skill really, we just bully the opposition out of the game\", \"It's the total bloody ignorance and arrogance that really pisses me off. Hopefully another 'big club's fans' will be in for an eye-opening 90 minutes.\"\n\"Oh yes, we are physical hard bastards we are. Brace yourself for good old-fashioned League One lump it forward football action. We're punching well above our weight. We will curtsey when the Tractor Boys take the pitch\", \"You'll certainly be needing shin pads against our fellas.\"\nBees' Thoughts on Jay Tabb\n\"Jay Tabb is my all-time favourite Bee\", \"One of the nicest blokes in football you will ever meet, a true professional and someone who loves Brentford\", \"I will be one of 10,400 giving him a decent and fully deserved welcome home\", \"He's very welcome to a consolation goal on Friday.\"\nTabb made over 100 appearances for the Bees at the start of his career between 2000 and 2006 and is held in the highest regard by their supporters. \"Tabby is a Bees' hero, and that applies even if he scores the winner against us\", \"He has nothing but the highest respect from me.\"\n\"Jay Tabb scored with a towering header against Boro\", \"That was pretty spectacular\", \"I had forgotten what a good header of the ball Tabby is. That was a fantastic goal for someone of his height\", \"He pretty much provided the assist for Ipswich's first goal.\"\n\"Players like Tabb are underrated because they are nor fanciful and come up with magic, but he worked hard and played for the team when here. He is clearly an important part of the glue in Ipswich's team\", \"Tabb was and is one of my favourites\", \"He'll get a good reception at Griffin Park.\"\nWebsites\nI am indebted to Billy Grant from the excellent Beesotted website for his really helpful insights. Beesotted is a lively and humorous site with a great variety of amusing articles, reports and videos.\nThe other Bees site worth noting is the Griffin Park Grapevine which has a busy and knowledgeable forum. Registration is required to access certain message boards.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nLadies and Gentlemen of Brentford, let me introduce you to Teddy Bishop and Kevin Bru.\n(Too obvious?)\nNice one Harry, happy holidays!\nI'm here all week, except for Christmas...\nand there lies the weakness ,he`s gonna really love what we throw at him\nHowever as things stand they are two of best footballing sides in the Championship and we will have our work cut out make no mistake.\nTheir fans certainly seemed to be getting carried away comparing their various players to Kenny Dalglish,David Silva,Patrick Viera and Yaya Toure;I am sure that Chambo and Co are quaking in their boots!\nBut credit where credits due, they look like a gifted bunch of footballers, i however do believe MM & TC would have a tactical surprise for this bunch.\nI'm sure they've had their fill of condescending opinions from other clubs, they're having the season of their lives and present a real threat to our unbeaten run as did Charlton, Bolton & Boro.\nWin, lose or draw where we finish in May is the be all and end all.\nGood luck to Brentford for the season, other than the games against us.... COYB\nI feel this is an acid test for both clubs right now - and, I am confident that they could get rolled over tomorrow - unless they are at the top of their game. But equally so, so could we - I just don't see it happening tho'.\nThree points tomorrow - although it could all depend on who wants it the most !!\nInteresting game for sure.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 4050,
  "scraped_at": "2026-02-14T01:48:34.024727",
  "_text_extracted": true
}