{
  "article_id": "e5132cb91d20",
  "url": "https://www.fourfourtwo.com/news/the-celtic-and-rangers-39-year-stranglehold-on-the-scottish-title-is-at-risk-with-sir-alex-ferguson-the-last-manager-outside-of-glasgow-to-win-the-league",
  "title": "Could Aberdeen really beat Celtic and Rangers to the Scottish title ? ",
  "date": "20241101T194500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Celtic and Rangers 39-year stranglehold on the Scottish title is at risk - with Sir Alex Ferguson the last manager outside of Glasgow to win the league\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nCeltic and Rangers are at risk of losing the Scottish title to a side from outside of Glasgow. Indeed, the rise of Aberdeen under Jimmy Thelin is impossible to ignore.\nAfter ten matches, Scotland’s familiar top two have been split by a rampaging interloper. Celtic are top of the Scottish Premiership, nine points ahead of Rangers but above the Dons only on goal difference.\nCeltic and Aberdeen are both unbeaten. They’ve only dropped points in their game against one another. That’s the minimum expectation for Brendan Rodgers and Celtic, but Aberdeen finished in the bottom half last season, sacked manager Barry Robson and turned, briefly, to Neil Warnock.\nThe turnaround under former Elfsborg manager Jimmy Thelin has been remarkable and continues to gather speed. Aberdeen overpowered Rangers on Wednesday and their title credentials suddenly came into sharp focus.\nCeltic and Rangers have been divided by Aberdeen. Can they go one better?\nBetween them, the Old Firm clubs have won the last 39 league titles in Scotland. Aberdeen’s win in 1984/85 was their second in a row and fourth overall. Alex Ferguson masterminded the last three in the 1980s and neither Aberdeen nor anybody else has toppled the Glasgow giants since.\nTheir season so far has been very promising and Thelin can take a great deal of satisfaction from being right on top of Celtic and a long way ahead of Rangers, but Aberdeen have pushed one of them into third in the proverbial two-horse race on nine occasions since they last lifted the trophy themselves.\nThis is Aberdeen’s best start to a season. They’ve never been in a better position after ten matches. In addition to nine wins in the Premiership, Thelin won his first six matches in the Premier Sports Cup to set up a mouthwatering semi-final against Celtic at Hampden Park on Saturday.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nChampions League qualification might be the priority at Pittodrie but the supporters are starting to dream of a historic fifth championship triumph. Still in the glow of the win over Rangers, the Dons face another big test of their mettle against the champions in Glasgow on Saturday.\nThelin has got almost everything right. He’s getting the best out of a squad that didn’t look likely to rock the boat. Pape Habib Gueye is the Premiership’s joint-top scorer despite last playing in September, Dimitar Mitov its second most effective goalkeeper. Aberdeen have scored one goal for every two shots on target.\nCeltic just continue rolling and Aberdeen are keeping pace by capitalising on their own momentum and playing with identity under Thelin in a way that’s sorely lacking in Philippe Clement’s Rangers.\nVIDEO: Why Man United HAD To Sack Erik Ten Hag\nThelin plays with a solid midfield base that frees dynamic right-back Nicky Devlin, whose eye-catching performance against Rangers was capped by a clever finish to score the opening goal – his third league goal of the season – and his involvement in the build-up to the eventual winner. He was excellent defensively too.\nCeltic represent a different challenge altogether. Blessed with quality all over the pitch, the champions have the answer to any question Scottish football can throw at them. If the Dons can knock them out of the League Cup on Saturday, belief in Thelin will go through the roof.\nIn this thrilling ding-dong battle between the top two, something finally has to give this weekend. It might be a semi-final in its own right but there’s much more on the line even at this early stage in the season.\nCeltic and Aberdeen meet at Hampden in the Premier Sports Cup on Saturday. Celtic return to Champions League action against RB Leipzig at Celtic Park on Tuesday.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.",
  "word_count": 800,
  "scraped_at": "2026-02-14T02:08:12.404731",
  "_text_extracted": true
}