{
  "article_id": "e51cdb142689",
  "url": "https://metro.co.uk/2025/10/17/ruben-amorim-names-man-utd-star-cant-compared-club-legend-yet-24454826/",
  "title": "Ruben Amorim names Man Utd star who cant be compared to club legend yet",
  "date": "20251017T133000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim says it’s too soon for Senne Lammens to be compared to Manchester United’s legendary former goalkeeper Peter Schmeichel.\nLammens produced a fine performance on his debut for the Red Devils as United secured a 2-0 Premier League win over Sunderland at Old Trafford.\nUnited signed Lammens from Belgian club Royal Antwerp on deadline day in the summer transfer window as a replacement for Andre Onana.\nIt was reported that United paid €21m (£18.1m) plus add-ons for the young goalkeeper, with the 23-year-old signing a five-year contract at the club.\nIn Amorim’s pre-match press conference on Friday, ahead of United’s trip to Liverpool on Sunday, one reporter asked the United head coach: ‘When your goalkeeper puts in a performance like that… Fans are calling Lammens the new Schmeichel. Does that make him impossible to drop?’\nAmorim said: ‘Nothing is impossible. You have to prove it during the week [in training].\n‘Of course, he did a great job. It is possible he is going to start [against Liverpool]. The first impression in this club is really important but to maintain it is even more. He is not Schmeichel yet.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He is a young guy with talent and he showed a lot of composure – the fans liked it. But that is now in the past, we need to show it in the next game.’\nSchmeichel played 398 games for United from 1991 to 1999, famously helping the Red Devils win a treble under Sir Alex Ferguson as United won the Premier League, FA Cup and Champions League in the same season.\nUnited won a total of five Premier League titles during Schmeichel’s time at the club and three FA Cups.\nMan Utd injury news ahead of Liverpool clash\nAhead of the clash against Liverpool, Amorim has provided an injury update on a number of his players.\n‘Licha (Lisandro Martinez) is not available,’ Amorim added. ‘He is near but he is just returning to training with the team.\n‘Noussair Mazraoui, I don’t know [yet]. The rest of the guys, the national players are ready but if you saw the games, some of the players played in Japan so we need to be careful to give more time.\nMore Trending\n‘Bruno [Fernandes] played 62 minutes so we give him one more day. We try to balance everything to get everyone ready but the guys who are returning from national teams are ready to play.’\nQuizzed about facing Liverpool, Amorim continued: ‘Sometimes things change really fast but if you see the history of both clubs, you can feel that sometimes you have one club that is winning, winning, winning and one club that is having a bad moment.\n‘That happened with Liverpool when Manchester United was winning everything and that happened with Manchester United when Liverpool was winning everything. We have to acknowledge that and be really honest with the fans.\n‘We can win any game, if we think about winning the next game, that is the most important thing, we can win the next game. If we are to be the same level as Liverpool in the future, that is the idea, I don’t know how long it is going to take.’\nMORE: Mikel Arteta reveals blunt warning he gave Viktor Gyokeres before signing him for Arsenal\nMORE: Pep Guardiola gives worrying Rodri injury update ahead of Man City vs Everton\nMORE: Nottingham Forest vs Chelsea: Latest team news, predicted lineups and injuries",
  "word_count": 625,
  "scraped_at": "2026-02-14T02:26:56.611377",
  "_text_extracted": true
}