{
  "article_id": "e53836f92260",
  "url": "https://www.twtd.co.uk/ipswich-town-news/30536/mccarthy-i-fully-understand-fans-frustrations/onthisday",
  "title": "McCarthy : I Fully Understand Fan Frustrations - Ipswich Town News",
  "date": "20231029T070000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 29th Oct 2016 19:12\nTown boss Mick McCarthy said he fully understood why fans vented their frustrations during the Blues’ 2-2 home draw with Rotherham, admitting that he’s “disappointed” by his own performance at present and that his team aren’t getting the results he believes they should.\n“I was disappointed with the second half, but I wasn’t disappointed with the first half at all,” McCarthy said reflecting on the game. “I thought we played some good football and we created some good chances.\n“But we gave a goal away. I say we gave a goal away, they scored by keeping on top of us, fair play to them.\n“We didn’t clear it enough for us to push up and Chambo had been knocked to the ground and played them onside by virtue of being there.\n“And I thought in the first half we did well. In the second, we never got a chance because we conceded that goal from a Keystone Cops moment.\n\"Two centre-backs collided with each other and it was just hooked in the net and we never got a chance to replicate the first half because we were 2-1 down.\n“We were nervous and cautious and they could sit back and protect their goal and try and catch us on the break which, of course, happened. Thankfully they didn’t catch us on the break.\n“But we kept going, that’s probably the biggest thing we could get out of it was that we kept going and if you’re ever looking for a point in a season when you want something to turn your bad moment around, maybe that’s it, a bit of luck, but a wonderful strike from a really good player, who it’s nice to have back.”\nRegarding Christophe Berra and Adam Webster’s collision which led to Danny Ward’s second goal, he continued: “When things are tough and things aren’t going your way you have uncharacteristic moments unfortunately, that’s what costs you. But they have been different class the pair of them.\n“The positive is that we got something, we kept going right to the very end, to the bitter end. Didzy’s had his 90 minutes and played well and it might be that one point which turns it around for us.\nHe added: “That’s not lucky, that’s a wonderful strike. He saved the bacon today, Didzy.\n“He was fine in terms of his fitness, no problems with him physically, he was great and I think he must be because he struck that ball.\n“If you’re knackered there’s no way he would have struck that ball as cleanly as he did, great technique.”\nRegarding Rotherham, now under Kenny Jackett’s management, he said: “I was under no illusions that Kenny’s team would come here and be anything other than pretty tough and hard to break down, although we scored two against them, against that tough and hard to break down.\n“And they are scrapping for their lives. Four years ago, Birmingham away, we had seven points, we go there and win 1-0. We managed to hold onto it and it made a big difference to us.\n“I don’t see their team and see a whole load of bad players and think they’re a relegation side by any stretch of the imagination.”\nMcCarthy was asked about the “boos and jeers” towards the end with fans in the Sir Bobby Robson Stand chanting, ‘Mick McCarthy, your football is s–‘,\n“That’s an understatement, that’s putting it politely, ‘Quite a few boos and jeers at the end’,” he said.\n“We didn’t play well, I fully understand it. I’ve enjoyed probably three years and nine months, almost four years, of relative success here and people think I’ve been doing a good job and people were saying the other things, ‘Super Mick’, ‘Mick McCarthy, isn’t it great?’.\n“It’s just tough at the minute for all of us, but I treat them both as impostors. I prefer the nice ones, but even that, I don’t get carried away with that and I don’t get carried away with being booed and jeered either.\n“I and the players will continue to work to try and turn the season around and I’m hoping that the point today, as disappointing as it seems that we haven’t got three, it might just be the positive point.”\nHe says he’d much prefer it if there was a more positive feel around Portman Road rather than frustrated chants from fans but says it doesn’t get to him.\n“Do I like them? No, I prefer a good atmosphere,” he said. “I prefer a good atmosphere around the club, the training ground - although the training ground’s a great atmosphere - but the town, the grounds, the matches.\n“I much prefer a nice atmosphere but there’s only us that can create that by playing better and winning games.\n“Quite clearly there’s an opinion about the way I play football today, but the only way I’ll [change] that is by winning games.\n“And when we were winning and we finished in the top six, there were no complaints. I didn't hear [any complaints]. Generally you don’t if you’re winning.\n“Does it bother me in terms of being shouted at? No, it doesn’t. But it bothers me because I am disappointed in my own performance at the moment that we’re not getting the results that I think we should with the team I’ve got.”\nMuch of the criticism aimed at McCarthy by his detractors has related to him fielding sides which they view as not particularly attacking and long-ball in their approach, but he says those accusations couldn't have been made about today's line-up.\n“I’ve seldom changed but over the four years, that's not been the case, nobody’s really levelled that at me, maybe a bit last year,” he said.\n“Some of my detractors, there are detractors giving all sorts of opinions about me at the minute.\n“With Tom Lawrence, Wardy, Freddie, Didz, Bish, I don’t know what we’re go and do other than try and play football, to be honest with you.”\nHe added: “David McGoldrick has been injured for 12 weeks, Pits is injured for 10 weeks, Bish has not been fit, he’s just coming back fit now. Jonny Williams is just about getting fit. Reg Varney has been injured.\n“It’s almost like I’m keeping all of them out. Do I go around and injure them all to keep them out of the team, my good sexy players, who can play football? No.\n\"Come on, give me a bit of credit for that. The more players you’ve got like David McGoldrick fully fit, we’re a better team.”\nMcCarthy was pleased with left-back Myles Kenlock, who was making his first appearance this season in place of the injured Jonas Knudsen: “Myles played well, I’m delighted with him. I didn’t take him off for any other reason but for moving to three at the back and putting players forward.\n“A great decision that, wasn’t it? I take something out of it that it worked. Everyone can say it’s lucky. Or is it that we’ve got players in forward positions and it’s ended up dropping to one of them. Myles was good, I was pleased with him, very pleased.”\nOn Jonathan Douglas’s omission from the 18, he said: “Jonathan Douglas isn’t injured, I just left him out. That was the team I wanted to play, that strangely defensive team I wanted to play to play s-– football, that’s why I did it.”\nRotherham manager Kenny Jackett was disappointed not to come away with the win but said that point was a step in the right direction for the Millers.\n“Football is a cruel game,” he said. “It was a terrific strike from David McGoldrick. We spent the last 15 minutes trying to get one of my midfield players to man mark him because I know if the ball does drop - although it was outside the box - inside the box invariably he’s going to hit the target.\n“It was a terrific strike and obviously deflating for us, particularly for the players as they’d worked so hard.\n“That’s two late goals in the last two weeks. We’re close anyway, sometimes close isn’t enough, but the bit that we have to find to be a successful team is there.\n“I think we’re very competitive, certain things we need to improve on but we’re certainly working hard enough and making it difficult for teams and looking like a goal threat, which are pluses that we can build on.\n“They’ve had a run of defeats, before today seven away defeats on the spin, so although it should have been three points and we’re desperately disappointed, it does stop the rot of defeats and gives the players a point to build on.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nAnd don't kid yourself that you've been some sort of messiah over the last 4 years (or 3 years & 9 months as you like to put it)..Murphy's goals papered over the average football that scraped us into the play-offs..since then the standard has been fairly abysmal.\nDeluded.\nEvans wont sack him 'cos it will cost him money.\nSo that's us up sh1t and no paddle.\nFirstly - so having played and defended Douglas continually - despite sustained criticism - saying \"he's the best we have\", \"he's the right solution\" etc etc ..... suddenly he's not even on the bench !!! Now I'm m not a fan of \"Skuglas\" as a partnership but if you think it's the right thing for as long as Mick has & to defend that decision continually - as you should if you think you are right & have some sort moral fibre - to suddenly completely change your mind - and claim somehow it's all your plan - smacks of major desperation, not knowing exactly what you are doing & complete lack of any integrity at all !!!\n(before Mick lovers jump do an my throat - yes I am glad he did it .... but from guaranteed starter to out if the he squad in one week ..... really ?!??!)\nSecondly - if you \"understand\" fans frustration Mick for the love of god do something about it !!!! GO !!!!\nPositives - Starting two strikers, who both went onto score. McGoldrick quality first half. Webster's forward runs really add something, I like him a lot. Sears first half runs and overall work rate very good. Kenlock really good first half.\nNegatives - Just about everything second half. Chambers not getting forward like a full-back should. Ward looking poor value for money. Lawrence not making the impact his skill warrants.\nWe can't use money as an excuse today. Ian Milne said we pay \"top quartile\" wages, yet we fail to beat a team who really do work on a shoestring, Rotherham. When Best and Ward were there last season they were part of their resurgence, and it is a worry if our coaching staff are not getting the best out of players.\nSaturday 29th October: Oops...\nFriday 4th November: \"Town boss Mick McCarthy admits that Saturday's away game against 7th placed Sheffield Wednesday is a match that the Blues definitely need to get something out of....\"\nSaturday 5th November - one to remember, or try to forget?\nLook at your Newcastle and Norwich of these world far more money than town and next year the teams coming down will have even more money to spend.\nMan U spend £89 million on Pogba and then gave his agent £24 million........ town can never compeate so a change of manager will not make a difference to town in getting in the prem.\nBest we can hope for is a new manager who wants to play entertaining football and if you want a team who will play champions league etc is to go support a team that are already there.\nStop wasting you money on over paid footballers and spend it on living your life\nCan't think that he's ever entertained wherever he's been and we shouldn't be surprised what has happened here. It's just that we as fans who are lucky to have been to have been around when Robson managed (and a few good years under Burley) feel we deserve better.\nHe tried to play against the grain today but as Mick Mills said the team have been over coached and none of the players are willing to create the magic required.\nIt has to end now, negativity is ingrained, it will only get worse. Mick do the decent thing, the club and its fans (yes, we are important) deserve better.\nYou need to login in order to post your comments",
  "word_count": 2122,
  "scraped_at": "2026-02-14T01:48:28.227875",
  "_text_extracted": true
}