{
  "article_id": "e53f1271f67f",
  "url": "https://www.uefa.com/news-media/news/028d-1ac8ff05c2dd-475c981a48f0-1000--futsal-flying-high/",
  "title": "Futsal flying high",
  "date": "20240501T221500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Futsal flying high\nWednesday, May 1, 2024\nArticle summary\nThe upcoming 2024 UEFA Futsal Champions League finals in Yerevan will showcase how UEFA’s investment in futsal is expanding participation and increasing interest in the sport across the continent.\nArticle top media content\nArticle body\nSince the inaugural UEFA futsal tournament in Cordoba in 1996 to the founding of the UEFA Futsal Cup in 2001, which included clubs from 27 different national associations, the sport has seen its popularity skyrocket. UEFA competitions and support for the grassroots game have helped European futsal go from strength to strength, and nowhere was this better exemplified than at the 2021/22 UEFA Futsal Champions League. Latvia is not a traditional futsal heartland and has never had a side reach the finals, but some 8,442 fans attended the decider between Barça and Sporting CP in Riga – a record for a neutral UEFA club futsal fixture.\nThe startling growth of the format and UEFA Futsal Champions League itself has continued in the 2023/24 season, with the finals taking place in Yereven, Armenia for the very first time. The four-team knockout, featuring holders Mallorca Palma Futsal, as well as Barça, Benfica and Sporting CP, will play out in the revamped 6,900 capacity Karen Dermichyan Arena.\nRecord-breaking numbers for European futsal\nFutsal participation rates and popularity are rising exponentially – UEFA Futsal EURO 2022 was watched by 19.8 million viewers, while the UEFA.com futsal section attracted 1.8 million viewers. It’s a success story that reflects the energy and resilience of the largely amateur European futsal community, but UEFA is also playing an important role – both by running four showpiece competitions and by funding the game’s development at all levels of the football pyramid.\nUEFA’s futsal competitions are giving both men’s and women’s players the opportunity to showcase this thrilling, dynamic format to wider audiences. In 2022, four UEFA futsal trophies were lifted – more than ever before in a single season – for men’s and women’s national teams, clubs and youth teams. The first Futsal Finalissima was also contested between the top European and South American men’s teams.\nEver-growing opportunities in futsal\nThe Futsal Champions League continues to expand, a reflection of an increase in the number of domestic leagues, often in places where futsal was not even recognisable a few seasons ago. In this year’s tournament, a total of 55 teams from 51 UEFA member associations lined up on the starting grid – more than double the number of clubs in the inaugural 2001/02 UEFA Futsal Cup.\nThe UEFA European Women’s Futsal Championship has provided another high-profile platform for the sport’s top players that gives female players an elite goal to aspire to – and an added incentive for associations to support teams. The result is a surge in women’s futsal across Europe. Before the competition’s launch in 2018, there were just seven national teams in Europe – 24 took part in qualifying for the next edition in 2022.\nUEFA's HatTrick programme continues to support futsal\nUEFA rewards associations that enter our futsal competitions via the HatTrick development programme, which channels men’s EURO revenue to all 55 of its member associations. In the case of the Futsal Champions League, each association represented at any stage receives €20,000 a season. With 52 nations fielding clubs in 2021/22, total payments topped €1 million. Further grants are made for entering the men’s and women’s national team competitions. Direct HatTrick funding has also brought impetus to projects further down the futsal pyramid, such as the construction of San Marino’s new national futsal arena.",
  "word_count": 593,
  "scraped_at": "2026-02-14T02:13:49.307503",
  "_text_extracted": true
}