{
  "article_id": "e55d7265f088",
  "url": "http://www.china.org.cn/2025-08/29/content_118049139.shtml",
  "title": "Newcastle agree deal for Stuttgart forward Woltemade",
  "date": "20250829T054500Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "At 23, Nick Woltemade has become a striking example of how quickly fortunes can shift in football.\nJust a year ago, the Bremen-born striker joined VfB Stuttgart on a free transfer from Werder Bremen. Initially seen as a squad option for the 2006/07 Bundesliga champion, the 1.98-meter forward wasn't even included in the club's Champions League roster.\nNick Woltemade (L) of VfB Stuttgart vies with Kim Min-Jae of Bayern Munich during the first division of Bundesliga match between VfB Stuttgart and Bayern Munich in Stuttgart, Germany, Feb. 28, 2025. (Photo by Philippe Ruiz/Xinhua)\nBut in the months that followed, Woltemade enjoyed a remarkable rise. He earned a call-up to Germany's national team, established himself as a key figure for Stuttgart, and attracted interest from Bayern Munich.\nStuttgart, however, stood firm. After the 2025 German Cup winner signed a contract through 2028, the club rejected a reported 60 million euro bid from Bayern, instead demanding 75 million euros. Several unsuccessful approaches from Bayern sparked turmoil, with Woltemade said to be frustrated at missing what he considered a career-defining move.\nWhen Stuttgart cut off negotiations with the Bavarians, Premier League side Newcastle United emerged as suitors. On Tuesday, English and German media reported an agreement between the clubs, with Woltemade expected to undergo a medical on Friday.\nThe Daily Mail, Kicker, Sky Sport and Bild all reported that the deal is worth up to 90 million euros. Talks were said to have concluded on Thursday, coinciding with the draw for the 2025/26 UEFA Champions League.\nFor Woltemade, the transfer represents his first taste of Champions League football, with Newcastle having qualified for the tournament while Stuttgart will compete in this season's Europa League.\nThough popular with fans for his unorthodox style, Woltemade was recently warned by Germany coach Julian Nagelsmann that he must secure consistent playing time to remain in contention for the national team.\nThe move also underlines how the Bundesliga continues to lose ground to the Premier League. Limited TV revenue and Germany's 50+1 ownership rule have fueled an exodus of stars: Bayer Leverkusen lost Florian Wirtz to Liverpool in a 150 million euro deal, with captain Granit Xhaka and Jeremie Frimpong also departing. RB Leipzig's Benjamin Sesko joined Manchester United, and winger Xavi Simons is reportedly negotiating a move to Tottenham.\nGerman media have described Bayern's summer as disastrous, with the club having missed out on several key targets.\nIn an official statement, Stuttgart confirmed Woltemade's departure, citing only \"a convincing offer from a European club.\" Reports suggest the striker has already traveled to England and informed his Stuttgart teammates of his impending transfer.",
  "word_count": 435,
  "scraped_at": "2026-02-14T01:58:57.507053",
  "_text_extracted": true
}