{
  "article_id": "e571a1b58fc0",
  "url": "https://metro.co.uk/2025/12/23/arsenal-star-sends-warning-chelsea-booking-carabao-cup-semi-final-25745275/",
  "title": "Arsenal star sends warning to Chelsea after booking Carabao Cup semi - final",
  "date": "20251224T014500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal booked a tantalising Carabao Cup semi-final against Chelsea after beating fellow London rivals Crystal Palace on penalties.\nAn 80th-minute own goal from Palace defender Maxence Lacroix looked to have sent Arsenal through to the semi-finals at the Emirates Stadium on Tuesday evening.\nBut Crystal Palace captain Marc Guehi equalised deep into injury-time to send the quarter-final tie straight to penalties.\nThe first 15 players to step up converted before Lacroix capped off a miserable night by seeing his effort saved by back-up Arsenal goalkeeper Kepa Arrizabalaga.\nThat means Arsenal will face London rivals Chelsea for a place in the Carabao Cup final, with Manchester City taking on holders Newcastle United in the other semi-final.\nThe first leg will take place at Stamford Bridge on January 14 before the Emirates Stadium hosts the second leg on February 3.\nChelsea briefly threatened to challenge Arsenal for the Premier League title earlier in the season but already appear to have fallen out of contention, slipping 10 points behind the title favourites.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Blues are a match for anyone on their day, however, having won the Club World Cup over the summer and sealing a thumping win over La Liga champions Barcelona last month.\nArsenal are top of both the Premier League and Champions League and could clinch their first bit of silverware of the season in the Carabao Cup, with the final taking place on March 16.\n‘That will be a big game, a massive game against a hard opponent,’ Arsenal midfielder Mikel Merino told ITV after the penalty shootout win over Palace.\n‘It didn’t matter who we played, everyone [left in the competition] is a really good team. We’ll focus now on the next game and then we’ll see Chelsea in the semi-finals.’\nGoalkeeper Kepa, who joined Arsenal from Chelsea last summer, added: ‘Right now, if you want a trophy, that’s something that we want. We have to fight against good teams.\n‘I think both semi-finals, are big games, it’s going to be tough, but we’ll prepare well the game. We’ll be ready and we’ll go for it.’\nSpeaking more generally about Arsenal’s quarter-final win, Merino said: ‘Unbelievable. It was more complicated than it should be to be honest.\n‘An amazing first half, we created so many chances. The team deserved to win comfortably today but this is football.\n‘This is why football is so great and everyone loves it. So to penalties, but a win is a win and we are in the semi-finals.\n‘This is the highest level and if you don’t take your chances, they will take one. So we have to learn from mistakes. We all want to score.’\nOn Kepa’s heroics, Merino added: ‘So pleased for him. He deserves it. He’s a very good guy, a hard worker and giving his best every training session.\n‘So happy for him. Many penalties and the decisive one he saves it. It shows everyone in this team has their time and he saved us.’\nMore Trending\nLike Merino, Arsenal boss Mikel Arteta also thought his team should have been out of sight before FA Cup holders Crystal Palace threatened to snatch victory.\n‘Very happy to be in the semi-final,’ he said. ‘We played against a team that is very difficult to generate chances against.\n‘We generated a lot and should have scored many more goals than the one we scored. When you don’t close the games, it [conceding] can always happen\n‘I think the players were so composed with the penalties and in the end, Kepa managed to save one. We are where we want to be.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ryan Giggs says Ole Gunnar Solskjaer’s £19m Manchester United signing is now irreplaceable\nMORE: Paul Merson tells Antoine Semenyo to snub Chelsea and Man Utd for surprise club\nMORE: Man Utd willing to sanction first transfer exit of January window – on one condition",
  "word_count": 718,
  "scraped_at": "2026-02-14T01:59:31.517125",
  "_text_extracted": true
}