{
  "article_id": "e57cfe6ea8f2",
  "url": "https://thepeoplesperson.com/2025/02/26/ben-foster-claims-man-united-would-never-have-loaned-marcus-rashford-to-arsenal-291348/",
  "title": "Ben Foster claims Man United would  never  have loaned Marcus Rashford to Arsenal - Man United News And Transfer News",
  "date": "20250226T193000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United would “never in a million years” have let Marcus Rashford join Arsenal on loan in January, according to former United goalkeeper Ben Foster.\nSpeaking on his podcast, Foster declared that the club “happily” sent the 27-year-old to Aston Villa who represent the “next rung down.”\nCertainly there is less historic rivalry between the Red Devils and the Villans, who are not one of the so-called ‘big six’ English sides, but it is an uncomfortable truth that Rashford’s only tastes of Champions League football this season will come under Unai Emery.\nThe player’s last minutes in United red came in the early December defeat to Nottingham Forest, with Ruben Amorim consistently overlooking him thereafter before sanctioning a loan departure in the winter transfer window.\nThere was tremendous speculation as to where the forward would end up, and Arsenal were among the names mentioned.\nBut for Foster, even the suggestion that the Carrington graduate could have ended up at the Emirates is laughable. He said: “Man United would never loan him to Arsenal, never in a million years.\n“Even if Marcus Rashford kicks off massively, Manchester United would never, ever, ever send him to Arsenal, never in a million years.\n“[They would] happily send him to Villa, it’s that next rung down, they won’t be sending him to Arsenal, I guarantee you that.”\nAs for the player himself, it seems that he sees Villa Park as a temporary home rather than the loan paving the way for a permanent move, as he stressed that “obviously it’s only short term that I’m here” in an interview with the club upon arrival.\nIt is widely believed that Rashford has his heart set on a switch to Barcelona, who are thought to have him on their shortlist for summer reinforcements but nothing concrete has materialised.\nMeanwhile links to Arsenal are unlikely to disappear as injuries have laid bare Mikel Arteta’s lack of depth in attacking areas.\nRashford has made a solid start to life at Villa, featuring in four Premier League matches for Unai Emery and returning two assists – one more than he managed for United in 15 matches.\nFeatured image Alex Pantling via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 369,
  "scraped_at": "2026-02-14T01:58:05.333425",
  "_text_extracted": true
}