{
  "article_id": "e58479540f96",
  "url": "https://www.90min.com/man-city-lauren-hemp-named-fsa-womens-player-year",
  "title": "Man City Lauren Hemp named FSA Women Player of the Year",
  "date": "20241203T191500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City’s Lauren Hemp named FSA’s Women’s Player of the Year\n- Lauren Hemp has been named the FSA’s Women’s Player of the Year\n- The winger is currently sidelined with a knee injury\n- She scored 12 goals and registered nine assists last season\nManchester City star Lauren Hemp has been voted the 2024 Football Supporters’ Association Women’s Player of the Year.\nThe 24-year-old’s performances helped Gareth Taylor’s side to second place in the Women’s Super League (WSL) last season as they narrowly fell short of the title against Chelsea. City matched their best ever points tally, but their inferior goal difference meant the trophy headed to London.\nLast term, Hemp scored 12 goals and registered nine assists across all competitions. Already this season, she has two goals to her name and she leads the way in the WSL for assists with five.\nCity confirmed last month that the winger sustained a knee injury and underwent a successful surgery, but faces a spell on the sidelines. Hemp’s last appearance came in the WSL in a 4-0 victory over Tottenham Hotspur as she provided assists for the second, third and fourth goals.\nSpeaking after collecting the award, she said: \"Hi everyone, I just wanted to say a massive thank you for this award. I'm really sorry I can't be there. I want to thank everyone so much for all your votes.\n\"Looking back on the season we were unfortunate to come so narrowly close to winning the league, but unfortunately we didn't. But we qualified for the Champions League and have now reached the knockout stages this season.\n\"We have an important back end of the season coming up and I can't wait for so many trophies, hopefully, coming our way. Hope you have a great evening and thank you so much for the award.\"\nTaylor’s side are currently second in the WSL table after eight games and they are five points behind leaders Chelsea. Brighton, however, are hot on their tails and are just three points adrift.\nCity return to league action after the international break with the visit of Leicester City, which will be followed by a Champions League clash against St. Polten. Before Christmas, they have away trips to Everton and Barcelona.",
  "word_count": 375,
  "scraped_at": "2026-02-14T01:52:10.166848",
  "_text_extracted": true
}