{
  "article_id": "e593318e58d8",
  "url": "https://www.opinionnigeria.com/maresca-describes-worst-48-hours-at-chelsea-despite-everton-win/",
  "title": "Maresca Says He Had  Worst 48 Hours at Chelsea  Despite Everton Win",
  "date": "20251214T033000Z",
  "domain": "opinionnigeria.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Breaking News\nMaresca Describes ‘Worst 48 Hours at Chelsea’ Despite Everton Win\nChelsea manager Enzo Maresca said he endured his “worst 48 hours” at the club after a 2-0 win over Everton, citing a lack of support despite the victory.\nChelsea manager Enzo Maresca said he had endured his “worst 48 hours” since joining the club, despite overseeing a 2-0 home victory over Everton on Saturday, citing a lack of support.\nThe win lifted Chelsea into fourth place in the Premier League and ended a run of four matches without a victory in all competitions. Cole Palmer scored on his first home start since August, while Malo Gusto added the second goal.\nHowever, Maresca was far from satisfied after the match, although he stressed that his comments were not aimed at Chelsea supporters.\n“The last 48 hours has been the worst since I joined the club because many people didn’t support me and the team,” he said.\nWhen asked whether he was referring to the fans, Maresca replied: “I love the fans and we are very happy with the fans.”\nThe Chelsea boss initially responded to a question about Gusto’s performance before raising concerns about a lack of backing, without specifying who he was referring to.\nSpeaking at a pre-match press conference on Friday, Maresca said he understood criticism from social media, adding that only wins would silence complaints. “I know that if you don’t win everyone complains,” he said, referencing his decades of experience in football.\nMaresca strongly defended his squad following recent struggles, which included defeats away to Leeds and Atalanta and a goalless draw at Bournemouth.\nHe also highlighted the importance of Cole Palmer, who missed Tuesday’s Champions League defeat to Atalanta while continuing his recovery from groin and toe injuries that sidelined him for two months.\n“With Cole we are a better team,” said Maresca. “I really praise the players because we played 16 Premier League games, five without Moises Caicedo, 11 without Cole Palmer, almost all of them without Liam Delap.\n“No matter who is playing is doing fantastic.\n“We played almost all season without our best player. This is the reason why I’m so happy for the players. I would like people from the outside to appreciate that.”\nOpinion Nigeria News",
  "word_count": 377,
  "scraped_at": "2026-02-14T01:52:59.296522",
  "_text_extracted": true
}