{
  "article_id": "e59b87d4ea96",
  "url": "https://www.fourfourtwo.com/news/liverpool-make-luis-diaz-transfer-stance-clear-as-barcelona-ramp-up-interest-and-manchester-united-could-benefit",
  "title": "Liverpool make Luis Diaz transfer stance clear as Barcelona ramp up interest - and Manchester United could benefit",
  "date": "20250605T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool make Luis Diaz transfer stance clear as Barcelona ramp up interest - and Manchester United could benefit\nBarcelona are determined to get their hands on Luis Diaz but may have to look elsewhere\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nBarcelona's ongoing efforts to prise Luis Diaz away from Liverpool have hit a significant snag.\nDiaz is ranked at no.6 in FourFourTwo's list of the best left wingers in the world right now and has just enjoyed his best-ever season for the Reds, prompting Barca to set their sights on taking the Colombian to the soon-to-reopen Camp Nou.\nBut they may have to turn their attentions to an alternative target if they cannot convince Liverpool to let Diaz go, with reports suggesting Barcelona already have a half-price option in mind.\nLiverpool tell Barcelona Luis Diaz is not for sale\nReports earlier this week suggested that Liverpool were after £80m for Diaz's services, and that while Barcelona were unwilling to match that fee, they felt confident they could pressure the Reds into sanctioning the move.\nHowever, the Independent now write that Liverpool have rejected an approach from Barcelona and told them that Diaz is not for sale.\nAs such, Liverpool are said to be unwilling even to enter into negotiations with Barcelona - contradicting a feeling on the Catalan club's end that the Reds can be enticed for the right price.\nBarca's claimed rationale there is that Liverpool may need to raise funds as they close in on a massive move for Bayer Leverkusen's Florian Wirtz for a frankly eye-watering fee, and that Diaz wants the move and could apply pressure on Liverpool to allow him to leave.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAlthough Liverpool have also already completed deals for Giorgi Mamardashvili and Jeremie Frimpong, that supposition does somewhat ignore two rather simple facts: that Liverpool spent very little last summer, and that they have other saleable assets who they would prefer to let go.\nAt this embryonic stage of the window, it seems to FourFourTwo that Liverpool would be sensible to keep their powder dry for now and see if they can first offload the likes of Darwin Nunez and Harvey Elliott, who played bit-part roles for Arne Slot's side in their title-winning season but could be valuable commodities to other sides.\nDiaz only has two years left on his current deal, which is typically seen as the prime time to sell players to maximise their transfer value.\nBut Liverpool have a track record for resisting that wisdom, most notably turning down a massive bid from the Saudi Pro League for Mohamed Salah in 2023 as they felt he was too valuable to let go.\nFair to say that worked out pretty well for them...and at 28 years old, Diaz should still have a good few years left in the tank.\nLiverpool's stance could well bump Marcus Rashford up Barcelona's list of priorities, which would come as welcome news to Manchester United.\nThe England international spend the second half of last season on loan at Aston Villa, who have a non-exclusive option to by Rashford.\nBut the forward is reported to want Champions League football, and the chance to move to Barcelona would surely be appealing if it finally came to fruition after 12 months of rumours.\nInformation is conflicting over the level of Barca's interest, with sporting director Deco confirming last month that they liked Rashford, but reports in Spain this week claiming head coach Hansi Flick is less keen and would much prefer Diaz as Rashford is too 'inconsistent'.\nIf a move for Diaz is off the table, though, the German could well be persuaded to accept the punt on Rashford.\nAtalanta's Ademola Lookman has been touted as a potential Barcelona alternative, though he is also said to be wanted by Liverpool. These transfer dominoes are getting mighty confusing, aren't they?\nSteven Chicken has been working as a football writer since 2009, taking in stints with Football365 and the Huddersfield Examiner. Steven still covers Huddersfield Town home and away for his own publication, WeAreTerriers.com. Steven is a two-time nominee for Regional Journalist of the Year at the prestigious British Sports Journalism Awards, making the shortlist in 2020 and 2023.",
  "word_count": 815,
  "scraped_at": "2026-02-14T01:58:41.961197",
  "_text_extracted": true
}