{
  "article_id": "e5a17f58c288",
  "url": "https://metro.co.uk/2024/12/11/chelsea-man-utd-fans-say-thing-50m-target-turns-messi-22163951/",
  "title": "Chelsea and Man Utd fans say the same thing after £50m target  turns into Messi  ",
  "date": "20241211T021500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Chelsea and Manchester United transfer target Michael Olise ‘turned into Lionel Messi’ as he scored a stunning goal for Bayern Munich in the Champions League.\nOlise stole the show for Bayern on Tuesday night, scoring twice and setting up another as Vincent Kompany’s side thrashed Shakhtar Donetsk 5-1 in Gelsenkirchen.\nBrazilian forward Kevin broke the deadlock inside five minutes but that was as good as it got for Shakhtar, who found themselves 2-1 down at the interval after Konrad Laimer equalised and Thomas Muller scored on the stroke of half-time.\nLaimer’s leveller came from an Olise assist and the ex-Crystal Palace star continued to impress after the break, scoring from the penalty spot before adding Bayern’s fifth late on with a sensational goal.\nOlise picked the ball up 40 yards out, turned and began to dribble towards the Shakhtar goal, taking on two players with neat footwork.\nA slaloming run took Olise to the edge of the box where he dribbled past two more opponents and dummied the goalkeeper to leave him on the floor by the time he passed the ball into a near-empty net.\n‘This is a brilliant run from Michael Olise,’ the TNT Sports commentator said. ‘It’s absolutely magnificent!\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Oh! What a goal. Utterly spectacular from Michael Olise, taking on and beating them all and then stroking it home. It’s simply world-class and outrageous.’\nThe goal had the Bayern Munich bench on their feet, with a grinning Muller raising his hand in appreciation.\nAnd for Chelsea and Manchester United fans, it was a reminder of what could have been.\nBoth Premier League giants were interested in signing Olise from Crystal Palace over the summer but it was Bayern who won the race, bringing him to the Allianz Arena in a deal worth £50m.\n‘Michael Olise would have been an amazing signing for Manchester United,’ one Red Devils fan posted on X. ‘Imagine a top player like him but we stuck with Rashford and Antony…’\nAnother like-minded United supporter added: ‘We made a mistake allowing him to join Munich. He would have been a massive addition to our team.’\nSeveral Chelsea fans also bemoaned the club’s failure to sign Olise, with one saying: ‘If we had signed Olise, we would’ve won the league this year.’\nAnother said: ‘Remember how we fumbled Michael Olise…’\nOlise, who made 90 appearances for Crystal Palace and has four caps for France, was likened to all-time great Lionel Messi after his spectacular goal.\nSpeaking after being named the Player of the Match, the 22-year-old told UEFA: ‘I thought we played a good game, stuck to what we know how to do and the coaches’ tactics, and it worked so we’re happy.\nMore Trending\n‘I think when you’re in a system that suits your style of play and that everyone’s happy with and enjoying playing in, then it’s simple to just come in and enjoy your football – and not think about anything else.\n‘We’re just trying to take it game by game. I don’t really look too much at the standings, we just play our games and see where it takes us.’\nBayern Munich boss Kompany, meanwhile, added: ‘It was a tough start. The way we took on the game, I think it was clear we were the better team.\n‘But sometimes you concede and we conceded early, but stayed calm, and I think most important is that we grew into the game.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Former Manchester United boss Ole Gunnar Solskjaer turns down approach to return to management\nMORE: Manchester United ‘in advanced talks’ to sign Diego Leon in £3.1m deal\nMORE: Enzo Maresca has been told which Chelsea star is his ‘biggest problem’",
  "word_count": 687,
  "scraped_at": "2026-02-14T01:52:10.160428",
  "_text_extracted": true
}