{
  "article_id": "e5babb46c172",
  "url": "https://www.brightonandhovenews.org/2025/09/19/brighton-and-hove-albion-boss-spells-out-spurs-challenge/",
  "title": "Brighton and Hove Albion boss spells out Spurs challenge",
  "date": "20250919T170000Z",
  "domain": "brightonandhovenews.org",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brighton and Hove Albion boss Fabian Hürzeler said that Tottenham Hotspur were “in a good place” under Thomas Frank following a good start to the season.\nAlbion face Spurs at the Amex tomorrow (Saturday 20 September) in a 3pm kick-off.\nSpurs are looking for their fourth win of the Premier League season but face the tricky task of beating Brighton, who remain unbeaten at home.\nThe Seagulls have otherwise had an inconsistent start. Their only win against Manchester City was sandwiched between a pair of away defeats to Everton and Bournemouth.\nHürzeler said that his side had a big challenge in front of them and hailed opposition boss Thomas Frank.\nHe told a press conference: “They have had a good start. They play with good energy, have a good intensity. Most of the time they go man-to-man.\n“They have some new high-quality individual players, especially Kudus and Simons. Overall, they seem to be in a good place.\n“They seem to very compact, have good energy in their team, so it will be a big challenge for us.\n“I think he’s (Frank) very humble. He doesn’t put his ego over the club. He always seems to be very respectful.\n“I had a small chat with him in the summer and he’s very friendly, very open-minded. I have a lot of respect for the work he did at Brentford.”\nHürzeler confirmed Jack Hinshelwood would be on the sidelines while Maxim De Cuyper faced an assessment before kick-off.\nHe added: “Jack (Hinshelwood) will be out for a long time. He has a ligament injury in his ankle. It happened in a very unlucky way but that’s football.”\nSpurs could go top of the Premier League if they win tomorrow but Thomas Frank insisted that he would not pay much attention to the table until April.\nThe north London club have made an excellent start under the Danish coach, with three wins from four in the league, and they triumphed 1-0 in their Champions League opener at home to Villarreal on Tuesday night (16 September).\nThird-placed Tottenham could hit the summit with victory at Falmer if Liverpool lose in the Merseyside derby to Everton in the lunchtime kick-off tomorrow.\nBut asked when he will look at the table, Frank smiled: “April? Let’s put it that way.\n“I think I looked at the table a couple of times after one of the last games and I thought, ‘ooh, is that team that high or that low?’ because I’m not looking at it.\n“I’m trying really to focus on our ourselves and our performances and what we can do.\n“It is so easy to get dragged into something you can’t control. I think for the fans, they should dream. They should hope and all that. That is what football is all about.\n“I also dream and hope but I’m a little bit closer to the action so I need to stay level-headed and focus on next training because it needs to be perfect like today.\n“It was very good training, with the coaches, with the staff, top players. Everything ran very well and then I need to do what I can to make sure we win more.”",
  "word_count": 531,
  "scraped_at": "2026-02-14T02:26:56.624600",
  "_text_extracted": true
}