{
  "article_id": "e5bc33176f13",
  "url": "https://www.independent.co.uk/news/uk/politics/us-uk-trade-deal-arsenal-trump-starmer-b2747485.html",
  "title": "Inside the historic US - UK trade deal and how Starmer finally struck breakthrough with Trump",
  "date": "20250508T214500Z",
  "domain": "independent.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The phone call from Trump to Starmer that finally led to a trade breakthrough\nAs his beloved Arsenal suffered defeat, Keir Starmer struck gold with a US-UK trade deal, as Kate Devlin and Millie Cooke report\n- Bookmark\n- CommentsGo to comments\nOn Wednesday night, the prime minister had been expecting to settle in to watch his beloved Arsenal take on Paris Saint-Germain in the semi-final of the Champions League.\nThe game would end in defeat for the London side, beaten in the French capital and ending another season trophyless.\nBut at the end of the fixture’s 90 minutes, Sir Keir Starmer had a reason to be happy.\nHalfway through the game, he received a call from Donald Trump. And his longed-for US-UK trade deal – crucial for mitigating the harm of the swingeing US tariffs announced last month, and perhaps the key to saving his premiership – was on.\nThe final agreement did not come easily, however. As the UK’s ambassador to Washington, Peter Mandelson, let slip in a hastily arranged press conference in the White House less than 24 hours later, there had been a hitch.\nThe Americans had made an 11th-hour demand for more concessions from the UK. The sticking point did not remain one for long, however. In another part of London on Wednesday night, after making a speech at the Mansion House, the business secretary, Jonathan Reynolds, was told the agreement was ready.\nMr Trump’s glee at striking the deal was evident. At one point, the president, who earlier this year had been minded to reject Lord Mandelson as ambassador, squeezed the Labour grandee’s hand in the Oval Office.\nIn astonishing scenes, he also told Tony Blair’s former spin doctor that he had a “beautiful accent”. Lord Mandelson, who is credited with being a key player in ensuring the UK became the first country in the world to sign a deal to offset tariffs with the US, quipped in return that his late mother “would be proud”.\nLord Mandelson even later joked with the president, trying to sell him that epitome of British style, a Rolls-Royce – at a discount, of course.\nOn the other side of the Atlantic, after signing up to the agreement with the US, the pressure was on to sell the deal to the public.\nA free trade agreement with India unveiled earlier in the week had got bogged down in a row with the Tories over exemptions to national insurance contributions for Indian workers and companies that employ them. Designed to prevent either side from paying the charge twice, in two different countries, ministers nevertheless found themselves firefighting what they had hoped would be an overwhelmingly positive announcement.\nThe unveiling of the US agreement did not go entirely to plan either.\nA decision to have the prime minister hold a press conference at the home of another iconic British car brand, Jaguar Land Rover, briefly looked as if it might be derailed when Downing Street accidentally sent the press to the wrong city in error.\nAlmost all the journalists hoping to question Sir Keir arrived in Coventry, only to find they had to scramble to make their way to the correct venue – located more than half an hour away in Solihull. Even more embarrassingly, it was the company that first realised the mistake, not No 10.\nThe leaders of the US and the UK also faced a rush to announce their deal before white smoke emerged – literally – from the Vatican with the election of a new pope. In the end, the agreement was unveiled with less than an hour to spare.\nGovernment insiders have been keen to stress Sir Keir’s role as the chief negotiator of the deal. He has had a number of private conversations with Mr Trump on the phone in recent weeks, as the two men developed a relationship and thrashed out a deal.\nHe also sent Lord Mandelson, a politician and not a career diplomat, to Washington in a decision that now appears to have been vindicated – at least, until the volatile Mr Trump changes his mind again.\nIf only Wednesday night had been so successful for Sir Keir’s football team.\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 715,
  "scraped_at": "2026-02-14T02:26:38.643179",
  "_text_extracted": true
}