{
  "article_id": "e5e068037b91",
  "url": "https://www.teamtalk.com/tottenham-hotspur/backed-to-submit-club-record-bid-for-bundesliga-winger-arsenal-away",
  "title": "Tottenham transfers : Spurs backed to submit record - breaking bid for Bundesliga winger and blow Arsenal away",
  "date": "20250221T233000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nTottenham backed to submit record-breaking bid for Bundesliga winger and blow Arsenal away\nTottenham are one of several Premier League clubs interested in Borussia Dortmund winger Jamie Gittens and could reportedly break their transfer record to sign him.\nSpurs have made signing a new winger one of their top priorities for the summer as they plan ahead for the departure of Son Heung-min, who is out of contract in 2026.\nTottenham are in a strong position in terms of PSR (Profitability and Sustainability Rules) and will be able to spend big this summer, even if they miss out on European football.\nAccording to respected journalist Christian Falk, Spurs are primed to compete with the likes of Chelsea and Arsenal for Dortmund’s 20-year-old superstar winger Gittens.\n“Dortmund crashed in the league, the Champions League is getting further and further away, and with that the income from the Champions League next season,” Falk told SportBILD.\n“They have to win it to be in it again. If they miss out, they’ll have to sell players and Gittens is highly regarded. Chelsea, Arsenal and Tottenham are said to be offering €100m. You have to say that would be nice money.\n“Hans-Joachim Watzke [Dortmund’s CEO] recently admitted that they will have to sell one or two players if they miss out on the Champions League. So, a transfer for Gittens could happen.\n“The English have the money; they have the TV contracts. Bayern Munich won’t pay this summer, and they could have him with that. But yes, Tottenham I think they’ll bet big.”\nREAD MORE: Sensational claim Arsenal would reject Harry Kane, with ‘farcical’ transfer ridiculed by insider\nTottenham could smash transfer record with Gittens swoop\nDortmund are indeed having a very disappointing season and currently sit 11th in the Bundesliga table – eight points outside the top four.\nGittens, however, has held his own and notched 11 goals and four assists across all competitions so far this term, hence why a number of top sides are tracking him.\nTottenham could capitalise on Dortmund’s situation in the summer and the suggestion from Falk is that they’d be willing to pay up to €100m (£82.8m, $104.7m) to sign Gittens.\nThe youngster would become Spurs’ most expensive signing of all-time if this does happen. That title is currently held by Dominic Solanke, who Tottenham signed from Bournemouth for £65m last summer.\nAs we reported on Wednesday, Arsenal are also admirers of Gittens and one German coach has tipped the Gunners to win the race for his signature.\nWith this in mind, it’ll be interesting to see who makes the first concrete move in the race for the Dortmund star and how high his suitors are willing to go with a bid.",
  "word_count": 460,
  "scraped_at": "2026-02-14T01:58:05.340825",
  "_text_extracted": true
}