{
  "article_id": "e5e41ba07b84",
  "url": "https://punchng.com/10-years-after-where-are-afcon-2013-heroes/",
  "title": "10 years after : Where are AFCON 2013 heroes ? ",
  "date": "20230212T050000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Friday marked 10 years since the Stephen Keshi-led Super Eagles won the 29th edition of the Africa Cup of Nations in South Africa. EBENEZER BAJELA and ABIODUN ADEWALE write on where the players and technical crew members are now a decade after the triumph\nPLAYERS\nVincent Enyeama\nRegarded as one of the greatest African goalkeepers of all time, Enyeama deputised for regular captain Joseph Yobo, who was benched for most of the games at the tournament.\nAnd he didn’t disappoint, leading the squad from the back with some eye-catching saves as the squad clinched their third continental victory. He kept a clean sheet in the 1-0 defeat of Burkina Faso in the final in Johannesburg. He was named first-choice keeper at the tournament, conceding only four goals in six matches.\nDuring his senior career, which spanned nearly 20 years, Enyeama won 101 caps and was Nigeria’s most-capped player until November 2021, when he was surpassed by Ahmed Musa.\nCurrently, in France where he continues to train despite retirement in 2020, the two-time CAF Champions League winner with Enyimba goalkeeper hinted at the possibility of making a sensational return to the Nigerian league last September.\nAustin Ejide\nAfter making his debut for Nigeria against Namibia on June 16, 2001, Ejide went on to make 33 appearances for the Eagles and was second choice at the tournament.\nNow 38, he was a member of the Eagles’ squad at five AFCON tournaments — 2004, 2006, 2008, 2010 and 2013 — before quitting the national team in 2014.\nHe’s currently without a club, and last played for Israeli side Ness Ziona in 2021.\nChigozie Agbim\nAged 29 at the 2013 AFCON, goalkeeper\nAgbim was one of the six home-based at the tournament. But unlike the five other players, Agbim didn’t secure a move abroad after the AFCON. That might not be unconnected with his no-show at the tournament, as Enyeama was in goal for all six games.\nAgbim moved to Gombe United from Enugu Rangers in 2014, before rejoining the Flying Antelopes again in 2015.\nIn 2019, he was unveiled by Delta Force, who gained promotion to the NPFL that season but that was the last time he was heard of in the football circle.\nElderson Echiejile\nA full international for Nigeria since 2009, Echiéjilé played in two AFCON tournaments, winning the 2013 edition. He was also part of the squads at two World Cups (2010 and 2018).\nAfter 59 appearances for Nigeria, where he scored three goals, the left-back called it quits with the national team after being overlooked for the AFCON tournament in 2019.\nThe 35-year-old, who spent most of his career playing for Braga in Portugal, signed with HJK Helsinki in March 2019, his last known club, teaming up with Paul Aibogun, the coach of the Danish club at that time before both parties agreed to terminate the contract by mutual consent three months after.\nJuwon Oshaniwa\nOshaniwa made his only appearance at the 2013 AFCON in the final, coming on as a substitute for Echiéjilé in the 66th minute, in the 1-0 win over Burkina Faso.\nThe following year, he played in all four matches as the Eagles reached the second round of the 2014 World Cup in Brazil.\nA year after he was released by his Scottish club Heart of Midlothian, the 32-year-old returned to Nigeria and signed for Akwa United in 2018. He was released after a season with the NPFL side and has since been without a club.\nJoseph Yobo\nOne of the most successful Nigerian players, Yobo captained the team to glory in South Africa.\nAfter a career span that lasted 13 years with the national team, the versatile defender announced his retirement in 2014 to focus on his club career.\nHe, however, made a return to the national team following his appointment as assistant coach of the Eagles by the Nigeria Football Federation in 2020 to replace Imama Amapakabo.\nYobo currently has a football academy in the Ogoni region of Niger Delta. He also runs football camps in Lagos. He’s also into punditry.\nMikel Obi\nOne of the most decorated African footballers, Mikel played a key role in the success story on South Africa.\nFollowing an 11-year spell with English giants Chelsea, Mikel moved to China with Tianjin TEDA in 2017 and then returned to England on a short-term deal with Middlesbrough two years after, before joining Trabzonspor on a free transfer in July 2019.\nMikel then moved back to England in August 2020, joining Stoke City.\nIn a 14-year international career between 2005 and 2019, he played 91 times for Nigeria, scoring six goals.\nLast September, the former Eagles captain took to his official Instagram account to announce his retirement from professional football at 35 and since then has kept a low profile, away from the media.\nOgenyi Onazi\nEnergetic, hardworking and highly creative, Onazi was one of coach Stephen Keshi’s key men despite starting the tournament from the bench.\nThe 30-year-old came on as a substitute in the Eagles first match olagainst Burkina Faso, before going on to play every minute of all of Nigeria’s games in the knockout phase, including the final.\nYet to announce his retirement from the national team, Onazi last official game was an AFCON qualifier against Seychelles in 2018.\nHe currently plies his trade in the Bahrain Premier League club with East Riffa.\nObiora Nwankwo\nA year after making his senior debut, the defensive midfielder was called up to Nigeria’s 23-man squad for the 2013 AFCON and was part of the team that last celebrated the country’s continental glory, his only silverware for the nation.\nNwankwo had eight caps playing for Nigeria.\nThe 31-year-old former Inter Milan player now plays for Chavez in the Liga Portugal.\nHe saw only 18 minutes of action at the tournament.\nAhmed Musa\nCurrently, the most capped Nigerian footballer with 106 appearances, Musa appeared in five of the team’s six matches in South Africa and scored a goal in the 4–1 semi-final defeat of Mali.\nThe Eagles captain was named in Stephen Keshi’s squad for the 2014 World Cup and scored two goals in the team’s final Group F match, a 3–2 defeat to Argentina.\nThe 30-year-old was also part of the Nigerian squad at the 2021 AFCON in Cameroon last year, where they crashed out in the round of 16 despite winning all three of their group matches.\nMusa currently plays in the Süper Lig in Turkey with Sivasspor.\nEmmanuel Emenike\nEmenike was crucial to the Eagles’ success in South Africa, emerging as too scorer with four goals.\nHe was a menace to defences at the tournament with his physicality, while his goals proved crucial to Nigeria’s progress throughout the tournament.\nHe was named to the team of the tournament and also received the Pepsi Tournament Top Scorer award, alongside Ghana’s Mubarak Wakaso.\nHe scored against Burkina Faso, Zambia, Ivory Coast and Mali.\nEmenike last played for Nigeria in a friendly against Cameroon in 2015 in Brussels.\nEmenike, who last played for KVC Westerlo, lives a luxurious lifestyle and has often been seen hanging out with celebrities.\nThe forward created a scare last year after he posted a video of himself receiving treatment in an unknown hospital and lamenting his health condition.\nBrown Ideye\nIdeye played most of the games at the tournament in South Africa and scored his side’s second goal in the semi-final win over Mali.\nStill active in the game, Ideye currently plays for Kuwaiti club, Al-Yarmouk, a club he joined last August.\nThe 34-year-old has 27 appearances for the Eagles and scored six goals.\nIkechukwu Uche\nAfter spending most of his career in Spain, where he played for Villarreal, Zaragoza, Getafe, Málaga among others, the forward has found a new home in Europe’s Iberian Peninsula, where he currently resides.\nUche has 49 caps and 19 goals for the Eagles, but failed to score at the tournament in four outings.\nThe 39-year-old retired from football in 2019, having last played for Gimnàstic in the Spanish Segunda.\nAzubuike Egwuekwe\nThree years after the AFCON triumph, Azubuike managed to join Finish side KuPS from Warri Wolves. After a year in Finland, he returned to Africa to join South Africa’s Super Sports United and Al-Nasr Benghazi of Libya, where he spent one year each.\nHe returned home in 2019 to join Rivers United. He’s back home and resides in Warri.\nGodfrey Oboabona\nFrom Sunshine Stars to the Super Eagles, Oboabona was one of the home-based players who needed a trial to stake a claim in Keshi’s team in South Africa.\nAfter a successful AFCON and coupled with his blistering form at club level, he moved to Turkish side Caykur Rizespor in 2013. After 95 appearances in four years, he joined Al Ahli of Saudi in 2017, before moving to Croatia’s HNK Gorica in 2018.\nThe last team he joined was FC Dinamo Batumi of Georgia in 2020, but he’s been without a club since quitting the European side.\nKenneth Omeruo\nOn loan from Chelsea to Ado Den Haag during the AFCON, Omeruo’s impressive performance couldn’t get him a starting role at Stamford Bridge, though.\nFrom Ado Den Haag in 2014, he had further loan moves to Middlesbrough, Kasimpasa and Alanyaspor in Turkey until.2018.\nHe was eventually given a full contract by Spanish club Leganese after initially joining them on loan in 2018.\nHe still plays for the Spanish second tier club.\nEjike Uzoenyi\nAfter his shock selection for the tournament, Uzoenyi didn’t get a chance to show anyone why he was there.\nAfter the tournament, he got a loan move from Enugu Rangers to Rennes in France but he only made an appearance for the senior team and two appearances for the junior side.\nIn 2014, he moved to South Africa where he played for Mamelodi Sundowns, Bidvest Wits and Ajax Cape Town, making 12 appearances altogether till 2017.\nIn 2020, Uzoenyi signed for Bosnia club Zvijezda 09. He then joined Montenegrin First League club Titograd. However, the deal was never officially confirmed and he played the rest of 2020 at Zvijezda 09.\nSunday Mba\nAs at 2018, Nigeria’s 2013 AFCON hero Mba had been without a club.\nFollowing a successful AFCON, Mba secured a moved to French club Bastia in 2014 and made 43 appearances.\nIn 2015, he joined Yeni Malatyaspor in Turkey, making 54 appearances.\nIn October 2019, he said he wanted to return to active football but that was the last that was heard of him.\nReuben Gabriel\nEven though he didn’t feature for Nigeria at the AFCON, Gabriel successfully switched from NPFL side Kano Pillars to Kilmarnock in Scotland.\nAfter a year in Scotland, he went on to play in Belgium, Portugal, Slovakia and Finland, before moving to Saudi Arabia in 2019.\nHe has played for four clubs in the oil-rich country, with the last being Al-Ain.\nFegor Ogude\nFrom Valerenga in Norway as at the 2013 AFCON, Warri boy Ogude immediately moved to Russia, where he played for Amkar Perm and Yenisey Krasnoyarsk for five years.\nAfter a spell without a club in 2019, he reportedly retired from football in 2020.\nEfe Ambrose\nA mainstay at the 2013 AFCON, Ambrose has been in Scotland ever since, except in 2019, during a short spell at Derby County, though he had no appearance for them.\nThe defender racked up 51 appearances for Nigeria and currently plays for Greenock Morton in the Scottish Championship.\nNosa Igiebor\nOften mistaken for a media practitioner when his name rang in the national team, Igiebor has been without a team since 2019, according to Transfer Markrt.\nFrom Real Betis in Spain as at the 2013 AFCON, Igiebor moved to Maccabi Tel Aviv in Israel, Çaykur Rizespor in Turkey, Vancouver Whitecaps in the US and Anorthosis Famagustain Greece.\nVictor Moses\nBreaking into the Nigeria national team before the AFCON, Moses was primed for instant success and he enjoyed that in the national team until he fell out after the 2018 World Cup in Russia.\nAt club level, although currently injured, he plays for Spartak Moscow in Russia, where he has been since 2021.\nAs much as he was a Chelsea player before then, his days in London was characterised by loan moves to Liverpool, Stoke City, West Ham, Fernabahce and Inter Milan.\nTECHNICAL CREW\nStephen Keshi\nAfter captaining the Super Eagles to victory in 1994 in Tunisia, Keshi guided Nigeria to success in South Africa to become one of only two people, along with Egypt’s Mahmoud El-Gohary, to have won the AFCON as both player and coach.\nKeshi had a heart attack and died en route to the hospital on June 7, 2016, in Benin City, aged 54 and was honoured by Google with a doodle on what would have been his 56th birthday.\nIke Shorunmu\nShorunmu was the team’s goalkeeper trainer.\nHe returned to his position with the team, following the appointment of Portuguese Jose Peseiro as Eagles coach last May, taking over from Alloy Agu.\nValere Houdonou\nThe Beninese easily passes as Keshi’s right-hand man, having worked with him in Togo, Benin and Nigeria.\nHoudonou had a short spell at Sokoto United after the AFCON triumph.\nDaniel Amokachi\nAs one of Keshi’s assistants, Amokachi capped an illustrious career with Nigeria with the 2013 AFCON title.\nHe was briefly the interim handler of the Super Eagles in 2015 before he worked with NPFL side FC Ifeanyi Ubah.\nAmokachi also coached JS Hercules in Finland between 2016 and 2017.\nHe is currently a Special Adviser on Sports to the President, Major General Muhammadu Buhari (retd.).\nSylvanus Okpala\nA 1980 AFCON winner himself, Okpala worked as one of Keshi’s assistants at the AFCON 2013. After the AFCON, he worked with Enugu Rangers in the NPFL and currently resides in Lagos. He later worked with Kwara United and Sokoto United in the domestic league.",
  "word_count": 2307,
  "scraped_at": "2026-02-14T02:16:35.965853",
  "_text_extracted": true
}