{
  "article_id": "e5fb201268a6",
  "url": "https://www.ocregister.com/2024/05/07/lafc-placing-more-emphasis-on-u-s-open-cup-this-year/",
  "title": "LAFC placing more emphasis on U . S . Open Cup this year",
  "date": "20240508T040000Z",
  "domain": "ocregister.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "During their historic congested schedule last year, the 2023 U.S. Open Cup felt diminished compared to previous attempts by the Los Angeles Football Club at claiming the oldest trophy in American soccer.\nLAFC featured in six competitions – going 0 for 6 wasn’t in the conversation – and the early stages of the U.S. Open Cup in the spring felt small fry compared to the weight of a nearly complete CONCACAF Champions League run or a handful of trophies that were up for grabs along the way.\nThe sense that the Open Cup had been relegated to the back seat was reinforced when LAFC head coach Steve Cherundolo left his regular starters and most of their backups in L.A., relying instead on the organization’s MLS Next Pro second team against an opponent familiar to many of them, second-tier USL Championship side Monterey Bay FC.\n“It was physically not possible last year to play that many games with our strongest 11,” Cherundolo recalled. “It was a moment where we needed to rotate heavily, and that’s what we did.”\nGoing with the youngsters created the conditions for a win-win. It provided the first team a break following 15 games in seven weeks. Meanwhile, homegrown talent Nathan Ordaz, Erik Duenas and Christian Torres had an opportunity to rally younger players they knew from the academy and reserve teams and do something special. After 120 minutes and penalty kicks, the outcome ranked among the club’s most memorable days.\n“It was a fun game,” said Ordaz, who started and scored in the decisive shootout. “It was really intense. Everybody wanted to win and it was good to pull out that underdog story.”\nSo much so that despite bowing out of the 109-year-old knockout competition against the rival Galaxy in the next round, the energy inside the club – from the academy through the first team, the coaching staff and the front office – turned the short-lived tournament into a prideful jolt.\n“It’s not like they threw a whole party for us but they definitely were proud of us,” recalled Christopher Jaime, a 20-year-old attacking midfielder for LAFC2 who assisted on the opening goal against Monterey. “Everyone in the club, whether it was right after both games or at the facility later, I think everyone from John Thorrington and the players like Carlos [Vela], they were just congratulating us and telling us how proud they were of us because no one really expected us to go through the first round and especially not to fight a full Galaxy starting 11.”\nFrom plucky underdog to clear favorites, LAFC is one of eight MLS teams stepping into the latest edition of the U.S. Open Cup, joining the top eight USL Championship teams from the previous season along with 16 other squads that won their way to this stage.\nFewer competitions and a light league schedule so far in 2024 have flipped the paradigm for LAFC’s Round of 32 Open Cup match against the Las Vegas Lights at Cashman Field, a converted minor league baseball stadium where Cherundolo’s first team should be well represented on Wednesday night.\nThere will still be some rotation, including goalkeeper Abraham Romero, a former player on the Lights, starting in place of Hugo Lloris.\nFor two seasons, Las Vegas served as LAFC’s second-team affiliate. That partnership ended when LAFC2 launched in MLS Next Pro last year.\nGoing further in the elimination tournament than ever before following a 2-1 win against the Spokane Velocity, the Lights have earned the right to engineer a shocker of their own.\nUnder new ownership, led by retired baseball player Jose Bautista, the current incarnation of the Lights, completely rebuilt a month before competition began in March, are 3-6 in the USL Championship this season.\nNews of a trip to Las Vegas marked a full-circle moment for numerous contributors in Monterey, including Cherundolo, who coached the Lights in 2021 in his transition from European to American soccer prior to replacing Bob Bradley.\n“It’s definitely a story to tell,” said Ordaz, whose pro debut came with the Lights in 2021.\nHalftime shows and starting lineup photos that included llamas named Dollie and Dotty; canceled games due to giant potholes in the middle of the turf; daytime bus rides through the desert with busted air conditioners; 3 a.m. return trips straight from Cashman Field to L.A., all the while learning how to be a professional.\n“I’d lie if I said it wasn’t emotional,” Cherundolo said. “When we heard the draw I got really excited. I’m looking forward to going back to Cashman with LAFC now.”\nU.S. Open Cup: LAFC at Las Vegas Lights\nWhen: Wednesday, 7:30 p.m.\nWhere: Cashman Field, Las Vegas\nHow to watch/listen: watch.usopencup.com, 710 AM",
  "word_count": 786,
  "scraped_at": "2026-02-14T02:17:35.179176",
  "_text_extracted": true
}