{
  "article_id": "e609ea2201fe",
  "url": "https://www.myjoyonline.com/french-minister-apologises-to-liverpool-fans-over-champions-league-chaos/",
  "title": "French minister apologises to Liverpool fans over Champions League chaos",
  "date": "20250505T230000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nFrance's former interior minister has apologised for the first time for the 2022 fiasco at the Stade de France which saw Liverpool football supporters wrongly blamed for a riot.\nGérald Darmanin admitted that security arrangements for the Champions League final between Liverpool and Real Madrid were wrong, and that his first public remarks – blaming English fans – were a mistake.\n\"It was a failure because I had not foreseen. That was a mistake on my part. I was led astray by my preconceptions,\" said Darmanin, now France's justice minister.\n\"The scapegoat was easy to find, and I apologise now to Liverpool supporters. They were quite right to be hurt. It was a mistake and a failure.\"\nPolice used tear gas on Liverpool supporters as they tried to enter the stadium in Paris. Some fans were also ambushed and mugged by gangs of French youths.\nIn a lengthy interview on the Legend YouTube channel, Darmanin said the night was \"the biggest failure\" of his career.\n\"What I did not appreciate that evening was that the real problem was not coming from English supporters, but from delinquents who were robbing fans.\n\"Our security arrangements were not designed for that eventuality. We had riot police … with big boots and shields – not great for running. What you need against that kind of delinquency is officers in running shoes.\n\"We got our arrangements wrong. We were expecting a war of (football) hooligans, and what we got instead was muggers.\"\nIn their first comments after the problems, Darmanin and police chief Didier Lallement said the dangerous crush at the stadium was largely caused by Liverpool fans in possession of fake tickets.\nThe claim was subsequently debunked in an independent report commissioned by UEFA.\nIn another section of the interview, Darmanin said that there was \"no longer any safe place\" in France - a comment that drew fire from the hard-right opposition.\n\"What a lot of French people can see is that (violence) has become general, it has metastasised. It's no longer only in the places where you once looked for potential problems.\n\"Nowadays you can see that the tiniest country village has experience of cocaine or cannabis.\"\nNational Rally MP Jean-Philippe Tanguy noted that Darmanin has been in government since President Emmanuel Macron's first election in 2017.\nTungay said he was \"treating the French like imbeciles, making all these so-called tough declarations when the record is so catastrophic\".\nDarmanin, who is 42 and from the political right, did nothing in the interview to dispel speculation that he might be in the running to replace Macron in 2027.\n\"Do I think of the presidential election? The answer is yes,\" he said.\n\"That does not mean that I am going to be a candidate, but it does mean I have ambitions for the country to do better than what I see now.\"\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n8 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n34 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n36 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 704,
  "scraped_at": "2026-02-14T01:49:39.553094",
  "_text_extracted": true
}