{
  "article_id": "e60a99382ed2",
  "url": "https://www.juneesoutherncross.com.au/story/9081325/jets-eye-a-league-men-finals-asia-after-cup-triumph/",
  "title": "Jets eye A - League Men finals , Asia after Cup triumph",
  "date": "20251004T181500Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fresh off a maiden Australia Cup title, Newcastle coach Mark Milligan wants the long-floundering Jets to embrace the expectation of finals, then a shot at Asian football.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Jets sealed their first trophy in 17 years with a 3-1 victory over Heidelberg United in Saturday night's final at Lakeside Stadium.\nThey have only played finals once in the past 15 years but former Socceroos captain Milligan believes Newcastle can return to the top six.\n\"We want to be a team that plays finals football. We want to compete for things. We're trying to build a brand of football that we think will do that,\" Milligan said.\n\"We're trying to create a squad in terms of the competitive nature that will do that. We want to be fighting for things. I want our fans to be excited by this.\n\"Expectation's not a bad thing. I want these players to be driven. I don't want them to feel like just because we've won the Cup we've succeeded, because we're a long way away from succeeding.\n\"There's still a lot of growth in this group to go. There's a lot of hard work to do, but I'm not going to cap what success looks like for them.\"\nNewcastle have also qualified for next year's Asian Champions League 2 competition.\nMilligan, who won the 2015 Asian Cup and had stints in China, Japan, the United Arab Emirates and Saudi Arabia, says Australian football needs to embrace that stage.\n\"We should all strive to do well, to be a part of and to do well in Asia,\" he said.\n\"Especially with my history as well. I played a lot of football through Asia. I have a great appreciation for a lot of countries over there and how they go about their business.\n\"It's a tough competition, but now I believe it's more rewarding for clubs to want to do well in it.\n\"As a nation, as a footballing nation, we should want to be a part of it and we should want to do well in it.\"\nHeidelberg, who won $25,000 as runners-up, will prepare for their Australian Championship campaign, which kicks off next week.\nBut coach John Anastasiadis wouldn't be surprised if some of his players receive late calls from A-League clubs.\n\"They haven't done themselves any disservice,\" he said.\n\"You can get a knock on the door, and I told them football changes every day.\n\"It can change in a moment, so I'm hoping some of them do get a chance.\"\nAnastasiadis is rated as one of the best coaches outside the A-League Men but was modest on his chances of a move to a higher league.\n\"It's great to have this success, no doubt it helps,\" he said.\n\"But you just wait and see. If it happens, it happens. If it doesn't ... well, we keep going.\"\nAustralian Associated Press",
  "word_count": 488,
  "scraped_at": "2026-02-14T02:12:04.357939",
  "_text_extracted": true
}