{
  "article_id": "e6288e389a7a",
  "url": "https://www.teamtalk.com/manchester-united/de-jong-debunked-ten-hag-needing-resist-fresh-push-sign-barcelona-midfielder",
  "title": "De Jong to Man Utd debunked with Ten Hag needing to resist fresh push to sign Barcelona midfielder",
  "date": "20240216T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nDe Jong to Man Utd debunked with Ten Hag needing to resist fresh push to sign Barcelona midfielder\nIn Erik ten Hag’s first weeks as Manchester United manager, there was seemingly one player he desired more than any other – Frenkie De Jong.\nA summer-long transfer saga ensued and United tried to prise the gifted Dutchman away from Barcelona, but with no joy.\nThe player didn’t want to leave and Barca, despite a precarious financial situation at the time, were content to retain him.\nTwo years on, however, the Catalan giants are again strapped for cash and reportedly need to sell some of their current stars to free up funds for new arrivals.\nThey are said to have made De Jong available for transfer this summer. And, this time, the 54-cap Netherlands international is more willing to consider swapping Montjuic for Manchester.\nTen Hag might at last land his most-prized player; the midfielder he helped nurture as a teen talent at Ajax; the man he long ago identified as the crucial puzzle piece to plug in at Old Trafford and allow him to produce his preferred style of play.\nBut this time, United should steer clear.\nDe Jong is still a magnificent footballer. And, if anything, he has improved in the season and a half since United targeted him.\nHis pass completion (92 per cent), expected assists per 90 minutes (0.29) and passes into the attacking third per 90 (11.2) are all at career-high levels this season.\nNothing about De Jong’s game has changed materially to make him any less of a player. But United are changing. And quickly.\nTen Hag doesn’t need another reunion with an ex-player\nFrom the instant Sir Jim Radcliffe’s 25 per cent stake in the club was ratified and his INEOS group assumed control of footballing operations at United, there has been a degree of clear-sightedness and competency in the swift structural changes wrought that has not been glimpsed at Old Trafford since Sir Alex Ferguson and David Gill left the club 11 years ago.\nThey poached the highly respected Omar Berrada from Manchester City, where he was the chief football operations officer, to be their new CEO. And they are targeting Newcastle United transfer guru Dan Ashworth to be their director of football.\nThey are also hopeful of adding Jason Wilcox, Southampton’s director of football and City’s former academy manager, to their hierarchy of decision makers as they shape the club’s new direction.\nAppointing figures with relevant experience and proven track records to key positions of influence might seem an obvious tactic when building a football club’s internal structure, but United too often seemed to adopt an almost opposite strategy under the Glazers’ stewardship.\nSo with all these layers of influence, and with INEOS’ expertise in running a club with a record of smarts in the transfer market at Nice in Ligue 1, United should be far less reliant on Ten Hag’s personal contacts book when drawing up their wish list of future targets.\nThe Dutch tactician has apparently been heavily involved in United’s transfer dealings to date, with the majority of those signed since his appointment being players he’d worked with previously (Antony, Lisandro Lopez, Sofyan Amrabat, Andre Onana), had seen play as an opponent (Mason Mount) or shared a connection with via his agent (Rasmus Hojlund). The results of those deals have been mixed at best.\nDe Jong doesn’t fit with the new Man Utd philosophy\nTen Hag wanted De Jong, another of his former players, to be the midfield fulcrum of his United side.\nBlessed with clean, Cruyffian technique and an ability to dribble through pressure in the middle third and launch attacks with incisive passing, his skillset would allow Ten Hag to implement a more possession-based approach at Old Trafford, affording a greater degree of control in matches.\nWhen they missed out on De Jong first time around, United pivoted to a swoop for Casemiro from Real Madrid following successive and embarrassing Premier League defeats to Brighton and Brentford.\nThe Brazilian boasts a CV that vastly outstrips De Jong’s in terms of top-level experience and titles won. But he is a very different kind of operator in midfield, an expert at breaking up opposition attacks but with a more rudimentary on-ball skillset.\nUnited soon leant into a more chaotic, counter-attacking ethos and found some success last term, qualifying for the Champions League and winning the Carabao Cup.\nFor much of this season, though, as results have disappointed and with United fighting to finish in the top five in the hope of the Premier League being granted an extra Champions League place, Ten Hag’s side have been criticised for lacking a discernible playing style.\nIf Ten Hag wished to remedy those concerns by a return to the pass-heavy play for which his Ajax side were known, then De Jong is again an obvious target.\nBut unlike two summers ago – or indeed any point during the last decade in which they have lacked a midfielder comfortable playing and creating through pressure – they now have a youngster in the De Jong mould.\nKobbie Mainoo is the answer to Man Utd’s midfield dilemma\nKobbie Mainoo is still just 18 years old and cannot be considered to be of De Jong’s calibre just yet. But the teenager from nearby Stockport has already demonstrated the coolness in possession, the tidy quick feet to escape pressure and the creativity to unpick defences that could see him fulfil the same role for United for years to come.\nSigning De Jong now would only clog his path to realising that potential.\nAnd what’s more, United should remember how things panned out the last time they spent heavily on a player who didn’t really want to join them.\nLike De Jong at Barcelona, Angel di Maria was happy at Real Madrid before he was sold to United in a then-British record £59.7 million deal in 2014.\nDespite a handful of promising early performances, he never settled in Manchester and was sold to Paris Saint-Germain for a significant loss a year later.\nIn Mainoo, United already have their future midfield star, and one who definitely wants to be there.",
  "word_count": 1036,
  "scraped_at": "2026-02-14T01:56:44.628914",
  "_text_extracted": true
}