{
  "article_id": "e6289bc2c681",
  "url": "https://www.prnewswire.com/news-releases/champions-receive-1v1-world-crown-from-lionel-messi-mas-by-messi-celebrate-inaugural-1v1-world-crown-tournament-final-in-miami-302562123.html",
  "title": "Champions Receive 1v1 World Crown from Lionel Messi : Más+ by Messi Celebrate Inaugural 1v1 World Crown Tournament Final in Miami",
  "date": "20250920T044500Z",
  "domain": "prnewswire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Two global winners were crowned at the first Más+ by Messi 1v1 World Crown Tournament in Miami, as part of a brand-new global search for the world's most talented ballers\nMIAMI, Sept. 19, 2025 /PRNewswire/ -- The inaugural Más+ by Messi 1v1 World Crown culminated in a thrilling final in Miami, Florida, on Messi's home turf, with two remarkable athletes receiving a crown from Leo Messi himself, as the first-ever men's and women's 1v1 champions. The global competition, backed by Leo Messi and his hydration drink, Más+ by Messi, showcased top grassroots talent from communities across the US, Canada, the UK, and Ireland.\nThe tournament, which kicked off on August 2nd in Los Angeles, traveled to Toronto, London, and Dublin, providing a platform for aspiring athletes to shine. The final showdown in Miami brought together the best of the best for a chance to compete under the watchful eye of Leo Messi himself, widely regarded as one of the greatest soccer players of all time.\nBallers from around the world transformed Wynwood Marketplace into a 1v1 battleground, where only two winners would walk away with the 1v1 World Crown. Attendees were treated to opportunities to win exclusive Messi-signed giveaways, experience live art, and more. Adding to the excitement of the final tournament, the pitch was lively with local support from Miami's-own Southern Legion 305 Band, creating a heartbeat of tradition for the sport. The semi-finals sent shockwaves through the crowd as Leo Messi entered the venue to spectate the final matches.\nAfter intense, head-to-head showdowns, Messi helped to announce the winners in front of the crowd, Evan Deasy, 18, Cork, Ireland and Melanie Russo, 29, Miami, USA. The victors each received $5,000 and a meticulously crafted World Crown, a symbol of glory modeled after the original, hand-forged creation by renowned jeweler Joe Bazanetti, the man behind Messi's eight Ballon d'Or rings.\n\"It is really so nice to see and to share this opportunity providing a platform for the game that is 1v1. It is super exciting and so engaging that you can't take your eyes off the game – I enjoyed it a lot!\nAt the end of the day, it was what we used to play when I was super young, we played 1v1 on the streets. This is the way you challenge yourself against another player. Football is a game of 11 players but there is always one player that is a savior. So it is really nice to see the 1v1 game because of this,\" said Lionel Messi.\n\"It is very nice that the world is full of players in the streets all around the world. So from my experience in Argentina, there is a love of great players, even though for one reason or another never made it as a professional. The athletes here are good players and it's special we created a platform to show it off like this Más+ by Messi World Crown tournament.\"\nMelanie Russo and Evan Deasy express their excitement about their historic victories.\n\"Winning the first-ever Más+ by Messi 1v1 World Crown is a complete dream come true. This has all been so crazy just to be able to play in front of my mom and my stepdad here in Miami since I relocated to live in Cork and they've been living here in the US, but I've completely changed as a player, a person, and everything. They have never seen me play at an actual game of football or even anything like this since I was so young. So for them to come here in front of Lionel Messi, no less, this is their first experience in three years of me playing, I mean, I don't think they can ask for much more, really. They mean so much to me and in front of the GOAT, Messi, I can't ask for anything more,\" shared Evan Deasy, Más+ by Messi 1v1 World Crown Champion and Dublin finalist.\n\"I love 1v1, it's my favorite part of soccer so I'm so grateful for this opportunity to make this a more recognized part of the sport. I'm ecstatic! I really wanted to impress Messi and I'm confident in my skills — I just wanted to do my best. I never imagined that I would ever meet Messi and as a champion in his first Más+ by Messi 1v1 World Crown tournament. I'm so thankful to Messi and Más+ for creating this platform for us who don't play professionally. I hope this opens doors for me in the future,\" stated Melanie Russo.\nThe inaugural Más+ by Messi 1v1 World Crown has set a new standard for grassroots soccer competitions, creating a global platform for the next generation of ballers to make their mark. Who will be crowned the next winner?\nImages + Asset Bank from the Miami event can be found HERE.\nAbout Más+ by Messi\nMás+ by Messi is a hydration drink co-founded by global superstar Lionel Messi together with Mark Anthony Group. It has a balanced blend of electrolytes, vitamins, and minerals, with natural flavors and no artificial sweeteners or colors. Más+ by Messi offers unmatched taste and contains just 10 calories per 16.9oz bottle. Hydrate like a champion with Más+ By Messi. Más+ By Messi is available in four delicious flavors, inspired by Messi's life:\n- Miami Punch - Hints of pineapple notes with classic fruit punch aroma and taste. Inspired by the city where Messi and his family live, Messi's current and next chapter.\n- Orange D'or - Smells like fresh-squeezed oranges, with a refreshing orange flavor. Inspired by Messi's record 8 wins of the Ballon d'Or Trophy.\n- Limón Lime League - Tastes like fresh lemons and green limes. Flavor name honors the time Messi spent playing in the UEFA Champions League, a cup he won four times.\n- Berry Copa Crush - Notes of blueberries, raspberries, cherries, and açaí berries. The perfect balance of sweet and citrus tastes with a smooth finish. Flavor name inspired by the many incredible trophies, including the World Cup, that Leo has lifted in his career.\nAbout Top Baller\nPioneers of 1v1 soccer - Top Baller creates events that celebrate community, sportsmanship and talent. We're finding Top Ballers around the world and showcasing grassroots talent across our media channels.\nOur goal is to bring together young players with a competition that celebrates community, sportsmanship and talent.\nAll events will be filmed and available to view on our Youtube channel @Top_Baller.\nSOURCE Más+ Next Generation Beverage Co.",
  "word_count": 1082,
  "scraped_at": "2026-02-14T02:09:24.922983",
  "_text_extracted": true
}