{
  "article_id": "e652f73f25b5",
  "url": "https://www.fourfourtwo.com/transfer/who-is-liam-rosenior-chelsea-set-to-announce-offbeat-managerial-appointment",
  "title": "Who is Liam Rosenior ? Chelsea set to announce offbeat managerial appointment",
  "date": "20260105T170000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nChelsea began 2026 with a managerial departure, confirming on New Year’s Day that they had parted company with Enzo Maresca after an 18-month stint in charge.\nThe Italian won the UEFA Conference League and the FIFA Club World Cup during his time with the Blues and led them back into the Champions League, but this was not enough to paper over the cracks of his strained relationship with the club’s hierarchy.\nChelsea are now in the thick of their search for a new boss and appear to be closing in on Strasbourg manager Liam Rosenior. FourFourTwo takes a closer look at the man set for the Stamford Bridge hotseat.\nLiam Rosenior expected to be named new Chelsea boss\nLiam Rosenior will be a name familiar to many English football fans, not least because of his famous father and his career as a player.\nBorn in 1984, Liam is the son of Leroy Rosenior, who enjoyed a 16-year career as a striker for the likes of Fulham, Queens Park Rangers, Fulham and West Ham United.\nFootball was clearly in the blood and young Liam began his career at Bristol City, making his first-team debut in April 2002. A year later, he scored in the Robins’ Football League Trophy final victory over Carlisle United at the Millennium Stadium and was soon snapped up by Premier League side Fulham in a £55,000 move.\nRosenior would become a regular for the Cottagers and earned seven England U21s caps before joining Reading in 2007. Spells at Hull City and Brighton followed before he hung up his boots in 2018.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAfter combining punditry with a coaching role in Brighton’s U23s side, he joined the first-team coaching staff of Phillip Cocu’s Derby County side in 2019, rising up to the assistant manager role when Wayne Rooney was appointed the Rams manager in 2021.\nRosenior took over as interim manager following Rooney’s June 2022 exit until September that year, with his first permanent senior head coach role coming in November, when his former side Hull City appointed him on a two-and-a-half year deal.\nThe 41-year-old would spend two seasons with the Tigers before being sacked by owner Acun Illcali after failing to make the playoffs. He quickly landed the top job at Ligue 1 side Strasbourg, replacing Patrick Vieira at the BlueCo-owned club.\nHe guided the French side to a seventh-placed finish and European qualification last term and was handed a fresh three-year contract amid reported interest from Premier League sides.\nDuring his coaching career, he built a reputation as an articulate, forward-thinking manager who uses a fluid 3-2-5 formation with a high press. He already has significant experience in developing young players, with his first Strasbourg starting XI seeing him field an entire outfield side of players who were aged 23 or younger - the first time that had happened in the French top flight.\nRosenior earned his UEFA Pro Licence when he was just 32 years-old and with the media-savvy coach already accustomed to working in the BlueCo multi-club ownership group, it is easy to see why the Chelsea board appear to have made this young, ambitious and thoughtful coach their top target.\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 783,
  "scraped_at": "2026-02-14T02:27:10.769389",
  "_text_extracted": true
}