{
  "article_id": "e6547cbcf3af",
  "url": "https://metro.co.uk/2025/10/23/david-james-warns-antoine-semenyo-january-transfer-liverpool-join-battle-24507700/",
  "title": "David James warns Antoine Semenyo over January transfer as Liverpool join battle",
  "date": "20251023T170000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David James has fired a warning to AFC Bournemouth’s Antoine Semenyo after transfer interest from Liverpool, Manchester United and Tottenham.\nIt was reported this week that Liverpool have ‘joined the battle’ to sign the Ghana international in January with United and Spurs also very keen.\nLiverpool are believed to view Semenyo as a long-term replacement for Mohamed Salah, who has been in poor form for the Reds in recent weeks.\nSemenyo, meanwhile, has shined for the Cherries this season with six goals and three assists across his opening eight Premier League matches.\nIt is understood Bournemouth received offers from United and Spurs for Semenyo in the summer but the bids were below the Cherries’ valuation.\nSemenyo signed a new deal with Bournemouth after those rejected offers – but his new contract on the south coast is said to include a release clause.\nWhile the exact figure of the release clause is not yet known, Bournemouth are thought to value the 25-year-old winger at over £75m.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut former Liverpool and Bournemouth goalkeeper James has warned Semenyo that he may struggle to get the same of amount of game time if he decides to leave the Vitality Stadium in the January transfer window.\nSpeaking exclusively to Metro via AskGamblers, James said: ‘I think Bournemouth have shown they’re not frightened to lose players. I think they’ve been excellent in that sense, just looking at this season and the players they lost. I think with Bournemouth, it will be a calculated decision.\n‘I think Bournemouth would have to have someone lined up [as a replacement], and it wouldn’t surprise me if they’ve already got someone lined up or have in the pipeline to get lined up.\n‘If I were Semenyo, well, we’re not talking about bad teams here, are we? I think the question would be, where is he going to get game time?\n‘It’s the Premier League with five substitutes, [so] there’s always going to be game time [but] is it going to be the game time that he wants, compared to what he is having at Bournemouth? Or is it just purely about where do I win trophies?’\nJames plays down Semenyo’s Arsenal support\nSemenyo is known to be an Arsenal supporter – but James has played down talk of him being a Gunners fan as a factor in which club he will decide to join next – if the north London side enter the transfer race.\n‘I love it when I hear that football players are fans of certain teams, because, you know, being a fan doesn’t mean that you’re there,’ he added.\nMore Trending\n‘You’ve not got your bedroom kitted out with posters of your favourite players on it. It might just be that he likes their style of play.’\nSpeaking last year, Semenyo said: ‘I am an Arsenal fan.\n‘It is great to play against Arsenal, a team I have watched all my life and I want to play for the top clubs as well.’\nQuizzed if moving to a club like Arsenal would be ‘a dream come true’, Semenyo added: ‘Yeah, any team that plays Champions League, Europa (League) – that’s the aim.’\nMORE: Gary Neville claims £38m Arsenal star is ‘the second-best in world football’\nMORE: Arsenal star Gabriel Jesus provides major update on ‘biggest injury of my life’\nMORE: Former Premier League star George Baldock left huge fortune for baby son after tragic death",
  "word_count": 622,
  "scraped_at": "2026-02-14T01:59:14.385885",
  "_text_extracted": true
}