{
  "article_id": "e67bca86373c",
  "url": "https://www.caughtoffside.com/2023/12/20/agents-column-arsenals-best-chance-for-title-ucl-change-is-good-chelseas-brilliant-business-and-more/",
  "title": "Agent column : Arsenal best chance for title , UCL change is good , Chelsea brilliant business and more",
  "date": "20231220T144500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In his fortnightly exclusive column for CaughtOffside, Jon Smith, one of football’s first-ever agents and a man who was an integral figure in the forming of the Premier League, discusses why this season is Arsenal’s best chance in 20 years to win the title, why change in the Champions League and a European Super League is good for football, why Todd Boehly did some brilliant business for Chelsea – and more!\n—\nSaudis need to focus on the long term not just throwing money at football\nI’m hearing that the Saudi Pro League are going to be spending a lot of money in January and in the summer, which is exciting for people in the business and intriguing to people watching from the sidelines.\nMost people don’t really see or get involved with the league outside of the local supporters, but I believe the league have got a long-term visual.\nBoxing, golf and various other sports are being played there now and I think tennis is one of the next sports that Saudi would like to add to their portfolio.\nFootball is obviously a major player and as we’ve said in the past that’s for political reasons, but that takes time. It’s not going to happen overnight.\nI think if there is a danger, then in my humble opinion, it will be because the league becomes a circus, and not taken as reality.\nYou can’t just throw money at it. In all those leagues that did that, like China, it just doesn’t work.\nSaudi must have a constructive 10-year plan at least; what this league looks like and what they want it to look like.\nIs the Pro League just a political play or a real attempt ahead of the World Cup and beyond to do like they did in the USA, where they had the World Cup in 94 and then MLS kind of grew out of the World Cup?\nRather than just continuously just buying in talent, the league needs competitive competitions which makes interesting viewing for supporters, and engages with them beyond their own boundaries.\nIn my opinion, they also have to be focusing hard on what happens next. How they will create that next phase and the one after that would be the telling points for me of how all this is going to end up.\nChampions League change could be good for football… as could a Super League\nBeing one of the pioneers of the Premier League I’m not against change. Change is good. Evolution is good.\nI sometimes think it’s a bit rabid when people get hold of change and then they take change to the nth degree, however.\nChanging the football landscape is good because it’s global entertainment and it needs to evolve.\nI don’t have a problem with UEFA evolving the Champions League, but I do I have a bit of a problem with FIFA and the Club World Cup. I kind of think it’s a game too far. They’re making so much money already and I don’t see it as a benefit for our game.\nIt’s just extra physicality on our players who, in my opinion, to perform at the levels they’re being asked to perform at to justify the monies that are paid for them, they need to be super fit and taken care of.\nYou can’t have a boxer fight in December and come back and fight again in January for example. It just doesn’t work that way.\nI don’t think the new Club World Cup is going to be a ‘best seller,’ and I’m not sure many football fans will care about it or be really looking forward to it.\nFIFA just need to keep banking the cheques from the biggest tournament on the planet. Just manage the game that you’ve got and give the players a little bit of recuperative time.\nRegarding the Super League, when you sign up to be part of the football community, you agree to abide by their rules.\nSo on the one hand, the court on Thursday could say, well, you’ve already agreed to abide by the rules and you’re just trying to break them, so the answer’s no.\nOn the other hand, in 2023, restriction of the ability to trade and advance that trade is of sizeable consequence. Why shouldn’t people be able to come forward from outside of the UEFA and FIFA framework and bring new ideas to the table?\nDon’t forget the people that control the game at the very top across the world are doing very nicely out of controlling the game at the top. They don’t want this change.\nThat’s not to say they’re wrong but I think we should listen to everybody.\nWe’re in a very interesting environment at the moment where Saudi as a major player is actually beginning to become a bit of a disrupter. And again, I don’t see that as a problem.\nIf the courts would allow discussion with the authorities and possibly have an open forum of what is best for the sport in the coming decade, then I don’t see that as a problem rather than just slamming the door and say no, not allowed.\nWe should be happy to entertain conversations in the round with all parties about what’s best for the game. Let’s throw it on the table and see what happens.\nFootball is doing so well with eyeballs from around the world on the game. We don’t want to lose that in a melee of in-fighting. We want to grow it in a in a manner that intrigues the next generation of football fans – and that means discussion.\nChelsea were canny but it’s right that the long contracts loophole was closed\nChelsea did what they did and I think it’s a very clever loophole that Todd Boehly found because he didn’t break any regulations.\nOn the playing field things don’t seem to have worked out, but he’s got a long time to make it happen.\nIt was right to shut the loophole down because it was sort of an upside down Bosman.\nMy desire as a football agent was to remove the shackles on footballers and let them have employment rights like everybody else.\nIn a way, what’s happened with the long contracts has meant that it’s become a gilded prison for players who are potentially stuck for eight years in an environment that they may not be compatible with after two.\nIt just leaves me with a queasy sentiment as I’ve always been for free labour, and I just find this, as I say, to be a gold, gilded prison.\nThe average top-class player is at the top of their game for the best part of 15 years. A five-year contract is equivalent to circa 30% of that and an eight year contract which has been used recently his over 50% of their playing career. I’m not certain that it’s a wise decision (albeit financial security will obviously play a part), to commit to one club in this environment for that long given the insecurity of most clubs football management.\nI’d like freedom of movement and freedom of choice please.\nArsenal’s best chance for the title but don’t discount Man City\nMan City are always dangerous and people say they’ve shot their bolt but they’ll be back because they’re mentally very strong and that gives them the ability to challenge all the way through to May.\nI would argue that this is Arsenal’s best chance to win the title now. I think they’ve got they’ve got the winning habit, which is great, though the goalkeeper issue concerns me a little bit.\nNeither of them have been inspired so far this year, but they do have the bit between their teeth and as long as they don’t start dropping points to lower clubs this could be a vintage campaign for the Gunners.\nLet’s also talk about Aston Villa for a minute. Great recruitment and great encouragement because if you talk to the people around Villa, everyone feels involved and there’s a happy environment about the place.\nThey’re playing enjoyable, attacking football that’s also effective, and keeper, Emi Martinez, underpins that. You know when you’ve got a really good keeper because he just makes you feel much better going forward. I don’t know why but I think he’s worth a few points by himself.\nClubs will ‘buddy up’ if Saudi continues to distort the market\nYes, Saudi has distorted the transfer market to a degree, but also don’t forget that the money at the top of the game is now so much bigger.\nFor example, I used to do a lot with Newell’s Old Boys in Argentina and back then they were selling players just to survive. So we could say ‘you want $200,000 for him? Here’s 50 grand,’ and they’d take it because it got them through the next three to six months.\nNowadays, whenever big clubs are looking at the market to purchase a decent player in South America, the clubs want €20m upwards.\nThere are restrictions on how transfer fees are funded in MLS and whenever you have big players like Citigroup in Australia, in America and in Europe, obviously, they can’t just work those rules.\nHowever, the money that’s available in the USA is now starting to become available in Australia and has certainly been available for a while in various quarters around Asia.\nThe Italian league has issues, Spain is still rich but the TV deal in France isn’t what they would’ve hoped.\nAnd then you’ve got England of course.\nAround the world, the market is relatively lucrative and if you’re sitting with a player in Chile for example, and you think he might be worth a million, you ask for five because you might get three.\nI think that together with what’s happening in the Gulf, that has driven prices up, which is why I think you’ll find more clubs, certainly in the likes of the Championship, that will be buddying up with clubs around the world so they can manoeuvre players around their rosters to save them having to go into quite expensive marketplaces.",
  "word_count": 1694,
  "scraped_at": "2026-02-14T01:56:38.146777",
  "_text_extracted": true
}