{
  "article_id": "e681ab8ef23d",
  "url": "https://www.themag.co.uk/2026/01/predicted-newcastle-team-v-aston-villa-in-the-premier-league-today-newcastle-united/",
  "title": "Predicted Newcastle team v Aston Villa in the Premier League today",
  "date": "20260125T131500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Predicted Newcastle team v Aston Villa in the Premier League today\nLooking at this Newcastle team v Aston Villa.\nEddie Howe’s side looking to build on a run of 10 points from a possible 12 in their last four Premier League matches.\nIf United win and other results go their way as well, NUFC could potentially end the weekend as high as fourth in the table.\nEddie Howe has won all four matches at St James’ Park against Aston Villa and if making that five in a row, Newcastle would cut the gap to seven points behind Villa who are third.\nNewcastle United aiming to continue in the form that saw that win comfortably 3-0 against PSV in the Champions League on Wednesday.\nAs a reminder, this was the Newcastle team v PSV four days ago:\nPope, Tripper, Thiaw, Botman, Hall, Tonali, Joelinton, Bruno, Barnes, Gordon, Wissa\nAfter the Eddie Howe pre-match press conference on Friday, it would appear that Fabian Schar, Tino Livramento, Jamaal Lascelles and Emil Krafth will all definitely not be involved today.\nHowever, with Jacob Murphy, Dan Burn and Will Osula, one or more of them could potentially make today’s matchday squad, as Eddie Howe keeps his cards close to his chest, as usual.\nThe same with the Bruno Guimaraes situation, the United captain forced off with an ankle issue against PSV, but a big unknown whether he will be involved today.\nTaking all of that into consideration…\nThis is my predicted Newcastle team v Aston Villa:\nPope, Tripper, Thiaw, Botman, Hall, Tonali, Joelinton, Miley, Elanga, Gordon, Wissa\nIf the above ends up as the reality, it would mean two changes for Eddie Howe compared to the team that started against PSV.\nWith coming in – Miley, Elanga\nDropping out – Bruno, Barnes\nEddie Howe, as always, has the challenge of balancing so many games with a limited number of players.\nHowever, at the same time, I think the United boss will prioritise today over PSG on Wednesday.\nIn terms of, I think Eddie Howe will play his best available team today, then worry afterwards about PSG.\nThe only exception to that, in a way, will be that I think he will use Harvey Barnes as an impact sub today. Barnes has played a lot of football in recent times and played until the end against PSV.\nIn contrast, we saw Anthony Gordon, Joelinton and Yoane Wissa all subbed after 70 minutes on Wednesday, so I expect all those three to start again today.\nNo surprise if Bruno Guimaraes bounces back and starts against Villa. However, I do think that even if available, Eddie Howe will be a little cautious with his talisman and have him on the bench.\nElanga did well against PSV as a sub and I think Eddie Howe will look to build on that. The former Forest winger made his debut in the goalless draw at Villa Park on the opening day of the season and hopefully he can now kickstart a decent run in to the closing months of the season for him.\nAiming for top five and ensuring more Champions League football next season, will for sure be the Newcastle United priority.\nSo with a win today potentially sending Newcastle as high as fourth in the table, if other results also go our way, then I think Eddie Howe will be going full on for that AND looking to close the gap to seven points on third placed Villa.\nWith Villa having played in Turkey on Thursday night, I think Eddie Howe will be looking to a similar high press that paid dividends against PSV. So with Gordon, Wissa and Elanga on the pitch, he will have the best chance of doing that.\nLewis Miley to step in for Bruno, if the captain is missing, looks the obvious move.\nI think Woltemade will be one of those to come into the team on Wednesday night, as one of a number of changes, with a trip to Anfield following just three nights later.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 686,
  "scraped_at": "2026-02-14T02:27:10.755866",
  "_text_extracted": true
}