{
  "article_id": "e6cfd7b5768c",
  "url": "https://www.liverpoolfc.com/news/liverpool-v-lille-champions-league-team-news",
  "title": "Liverpool v Lille : Champions League team news",
  "date": "20250120T204500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MatchLiverpool v Lille: Champions League team news\nLiverpool will continue to be without the injured Diogo Jota and Joe Gomez when they face Lille at Anfield in the Champions League.\nThe Reds are looking to maintain their perfect record in the league phase on Tuesday night by making it seven wins from seven.\nArne Slot is set to have the same squad that was available for the victory at Brentford at the weekend, with Jota and Gomez the only reported absentees.\n\"Maybe Jota [will be back] a bit earlier than Joe,\" Slot told his pre-match press conference. \"Both of them are expected to be back with us in weeks rather than months.\"\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeDarwin Nunez came off the bench in the second half on Saturday to score twice and decide the Premier League affair at Gtech Community Stadium.\nAsked whether Jota's absence gives the Uruguayan the chance for an extended run in the team, Slot said: \"Of course it's simple: at the moment we've got four attackers that are top-fit and able to start the game, and Darwin is one of them.\n\"Then the fifth one is Federico [Chiesa], and then the sixth one, he's not ready to start 90 yet in my opinion but is coming closer and closer to be able to do so. The reason why he isn't is because he hasn't had many minutes yet.\n\"So it's not about him, it's about me not giving him so many minutes, so that's difficult for him then all of a sudden to go from five minutes to 90 minutes.\n\"That increases the chance for Darwin of course to get more playing time if one of the six is injured, especially if it's a No.9.\"\nIbrahima Konate is at risk of collecting his third yellow card in the Champions League this season and being suspended for the trip to PSV Eindhoven on matchday eight.\nLille, meanwhile, arrived on Merseyside occupying eighth spot in the league-phase standings and unbeaten in their last 21 matches in all competitions.\nTheir travelling party is likely to not include the sidelined Tiago Santos, Matias Fernandez-Pardo, Edon Zhegrova, Samuel Umtiti and Nabil Bentaleb.\nFormer Everton midfielder Andre Gomes completed a permanent move to the Ligue 1 outfit in September – but after the Champions League registration period, meaning he is ineligible.\nEthan Mbappe and Gabriel Gudmundsson have, however, made the trip over and could return from injury in the 8pm GMT kick-off.\nPreviewing the game, head coach Bruno Genesio said: \"We'll approach the game with ambition, with this desire to play our own football.\n\"Quite clearly we're going to take into account our opponent's strengths and we'll be doing things to counter our opponents, to stop them playing their game.\n\"We're not here to put on a footballing demonstration, thinking we're going to have 90 per cent possession – we're pretty sure that won't be the case.\n\"But nevertheless, every time we are able to do so, we will play our own football, be ambitious and [try] to fend off their attacks as well because we know how good of a team they are.\"\nLast match\nBrentford 0-2 Liverpool (January 18): Alisson, Alexander-Arnold, Konate, Van Dijk, Tsimikas, Gravenberch, Mac Allister, Szoboszlai, Salah, Gakpo, Diaz.\nLille 2-1 Nice (January 17): Chevalier, Meunier, Diakite, Ribeiro, Ismaily, Andre, Gomes, Bakker, Cabella, Haraldsson, David.",
  "word_count": 570,
  "scraped_at": "2026-02-14T02:02:19.849550",
  "_text_extracted": true
}