{
  "article_id": "e6dfa1e0689e",
  "url": "https://tribune.com.pk/story/2527233/atletico-rested-and-ready-to-face-real",
  "title": "Atletico rested and ready to face Real",
  "date": "20250208T080000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Atletico rested and ready to face Real\nLos Blancos add fuel to derby fire with ref complaints\nAtletico Madrid have prioritised recovery over meticulous planning before facing city rivals Real Madrid in LaLiga on Saturday, coach Diego Simeone said, adding that his team was ready for the top-of-the-table clash.\nReal lead the standings with 49 points, one above Atletico, who are three points clear of third-placed Barcelona after 22 games. Atletico thrashed Getafe 5-0 in the Copa del Rey on Tuesday and Simeone said their focus had yet to turn to Saturday's derby.\n\"We haven't talked about the match yet,\" Simeone told a press conference on Friday. \"We have chosen to recover well and tomorrow afternoon we will decide where we are going to be in the match, knowing that we are facing an opponent with great individualities, which makes them extremely dangerous.\n\"With all that context, knowing what we're going to face, we'll be prepared to play the game we want to play.\"\nRecent Madrid derbies have been tight, with four 1-1 draws and two wins for each side in the league over the past four years. However, Real have not won any of the last four league fixtures between the teams.\n\"We know what we're up against, a rival who will start off strong, very determined,\" Simeone said. \"They're very good with and without controlling the space, and we will have to take the game to where we think we can hurt them.\"\nReal will host Atletico coming off a last-gasp 3-2 win over lowly local rivals Leganes in the Copa del Rey quarter-finals and a 1-0 league defeat at Espanyol last weekend, their third in the campaign.\nAtletico won their last three games across all competitions, including a 4-1 victory at RB Salzburg that helped them secure a top-eight finish in the league phase of the Champions League.\nThe Argentine coach added that he had not decided on his lineup for Saturday's match. \"You have to interpret what is most important for the team,\" he continued.\n\"I imagine a 95 or 96-minute match where we need to be prepared for everything. Everything has an influence, from who starts to who finishes.\"\nReal Madrid with complaints\nReal Madrid's complaints about refereeing have created an even tenser atmosphere than usual around their crunch La Liga derby clash with Atletico Madrid on Saturday.\nLeague leaders Madrid host their city rivals, second and trailing by a single point, at the Santiago Bernabeu, after a tumultuous week in Spanish football.\nLast weekend Los Blancos dropped three points in a shock defeat at Espanyol, after which they sent the Spanish football federation a letter blasting La Liga refereeing as \"rigged\".\nMadrid were left raging after Espanyol defender Carlos Romero scythed down Kylian Mbappe, avoiding a red card before going on to score the winner.\nCarlo Ancelotti left Mbappe out of his squad which beat Leganes on Wednesday to reach the Copa del Rey semi-finals, saying the striker had a bruised calf.\nThe French superstar will most likely return to face Atletico for the first time since joining Los Blancos. Mbappe missed the 1-1 draw in September at the Metropolitano stadium with a hamstring problem.\nMadrid scraped a late 3-2 win over Leganes which saw them avoid a draining extra 30 minutes of extra-time.\n\"The team is in good shape, we left some players out to rest and to be ready for Saturday,\" Ancelotti said.\nMadrid's vigorous complaints about refereeing have not gone unnoticed across town.\n\"Can you help us with the nuances of the following verbs? pressure, scare, intimidate, coerce, frighten, influence, impose...\" Atletico wrote in a sardonic message on X, in the wake of Madrid's letter.\nAtletico striker Antoine Griezmann said he was unhappy about the situation, including the focus in the media on Madrid's statement.\n\"Now the referees will be afraid of making mistakes because they know they are being watched,\" the French forward told Movistar.\n\"We have to let them be calm, they've got enough on their hands as it is on the pitch, let alone with stupid stuff going on off of it.\"\nAtletico themselves have been hinting at refereeing bias in favour of Madrid, most notably after Los Blancos beat Celta Vigo in a cup match in January with controversial calls in their favour.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 740,
  "scraped_at": "2026-02-14T02:20:55.375512",
  "_text_extracted": true
}