{
  "article_id": "e6e4704d016f",
  "url": "https://metro.co.uk/2026/01/20/very-special-mikel-arteta-backs-under-fire-arsenal-star-inter-milan-victory-26416194/",
  "title": "  Very special  - Mikel Arteta backs under - fire Arsenal star after Inter Milan victory | Football",
  "date": "20260121T001500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta was delighted Viktor Gyokeres got on the scoresheet in Arsenal’s 3-1 win over Inter Milan, telling the striker’s critics he brings ‘something very special’ to his side.\nGabriel Jesus took his opportunity with both hands after replacing Gyokeres in Arteta’s starting XI at the San Siro, scoring either side of a thunderous Petar Sucic strike to give the visitors a narrow lead at the halfway stage.\nEberechi Eze squandered an inviting opportunity to extend Arsenal’s advantage in the 50th minute, with Tuesday’s heavyweight Champions League contest still in the balance at the start of the second half.\nBut Gyokeres came on and sent an emphatic message to his doubters with a superb first-time effort in the 84th minute, securing the Gunners safe passage through to the last 16 of the competition.\nVictory over last year’s runners-up sent Arsenal six points clear at the top of the league phase after seven straight wins, with second-placed Bayern Munich preparing to face Union Saint-Gilloise tomorrow evening.\nArteta may, though, be scratching his head entering Arsenal’s upcoming clash with Manchester United given Jesus and Gyokeres have given the Spaniard an almighty selection headache with their well-taken goals.\nKai Havertz – who was an unused substitute in Milan – is also back fit and available again having returned to the fold following knee surgery.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I’m very proud of the team,’ Arteta told Amazon Prime shortly after the final whistle.\n‘We talked before the game about needing a special performance, a very complete performance, against a top side and we certainly did that tonight.’\nAsked what pleased him most about the display, Arteta replied: ‘The courage, the attitude, the willingness to go to another level.\n‘We’ve done it at home against two top sides this season in the competition, but to do it at the San Siro against the best team in Serie A and one of the best teams in Europe… it’s something else.’\nThe mere mention of Jesus’ name brought an immediate smile to the face of Arteta, who branded the forward an ‘unbelievable player’.\n‘The bigger the game is, the more comfortable he plays,’ the Arsenal head coach added.\n‘I’m so happy for him and he deserves the man-of-the-match award, not only for the goals but for all the work that he’s done.\n‘Not many players win here at the San Siro!’\nGyokeres has received his fair share of criticism in recent weeks and will no doubt have been relieved to see his late strike hit the back of the net after coming off the bench in Arsenal’s victory.\nWhile the Swede looked off the pace as Arsenal were held to a goalless draw at Nottingham Forest, the Gunners’ marquee summer signing took his goal well against the Serie A leaders.\n‘A great impact,’ Arteta said of Gyokeres’ eye-catching cameo performance.\n‘The game was taking a shape that was fitting him very much and he had two big chances, he put one of them away, and I think he really helped the team.’\nAsked what the goal will do for Gyokeres’ confidence, Arteta replied: It’s very important.\n‘It’s the second away game that he’s done really well, he’s finding some consistency.\n‘He brings something very special to the team. That’s some finish and I’m very happy for him as well.’\nMore Trending\nIn his post-match interview with Amazon Prime, Jesus remained coy when asked about his chances of starting against Manchester United – refusing to place any added pressure on Arteta.\n‘Everyone wants to start. I am a very respectful guy,’ he said.\n‘I am not a kid anymore, I am 28, so I understand football.\n‘I am very happy Vik [Gyokeres] came on and scored a goal. I am so happy I scored and Vik scored. I am confident Kai will score when he gets the chance.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Wayne Rooney hoping ‘clever’ Arsenal star is left out against Man Utd\nMORE: ‘Proved me wrong’ – Theo Walcott says Arsenal star has ‘surprised’ him after Inter win\nMORE: Alan Shearer names team that will stop Arsenal from winning Champions League",
  "word_count": 754,
  "scraped_at": "2026-02-14T01:53:15.587668",
  "_text_extracted": true
}