{
  "article_id": "e6f321a17588",
  "url": "https://www.teamtalk.com/tottenham-hotspur/ryan-mason-reveals-trend-tottenham-must-stop-big-team-updates-stance-permanent-job",
  "title": "Ryan Mason reveals trend Tottenham cant be  big team  without stopping and updates stance on permanent job",
  "date": "20230513T191500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nRyan Mason reveals trend Tottenham can’t be ‘big team’ without stopping and updates stance on permanent job\nTottenham Hotspur acting head coach Ryan Mason has highlighted how the team need to stop giving headstarts to opponents if they truly want to establish themselves among the elite.\nChampions League qualification is now impossible for Tottenham after a 2-1 defeat to Aston Villa. Harry Kane scored a late penalty for Spurs, but it was merely a consolation after earlier goals by Villa pair Jacob Ramsey and Douglas Luiz.\nWhile Villa are now looking up and dreaming of Europa League qualification, having moved level on points with Spurs, Mason’s side know they can aim no higher than UEFA’s secondary competition. It is a fate they have seen coming in recent weeks, but now know for sure.\nIt might raise further questions about Kane’s future as the final year of his contract approaches. But for now, Tottenham will be focusing on their final two games of the season. It remains possible they could qualify for the Europa League, Europa Conference League, or neither.\nSpurs being in the Champions League isn’t too distant a memory, but it might become the case if their next manager fails to stop their trend of conceding goals early on, as happened again against Villa.\nMason told Match of the Day: “It’s disappointing. Obviously the start is difficult to take. It’s happened too many times this season going a goal down very early.\n“First half, to be honest, I thought they were better than us. I didn’t think Fraser [Forster] had to do anything in goal in terms of pulling off a load of saves.\n“In the second half, we gained a little bit more control and we had our big moment at 1-0, but the keeper has pulled off an outstanding save.\n“If you want to be a big team and compete at the top of the table, you cannot give teams a goal headstart. It’s very difficult in this league to win games of football. You have to earn everything.\n“We understand today was a big game [in terms of qualifying for Europe] and I’m very disappointed in the outcome. But we do have two games to put it right. Hopefully we can respond well and put it right.”\nRyan Mason ‘absolutely’ still wants Tottenham job\nMason has recently thrown his name into the running for the permanent manager’s job at Tottenham.\nAsked at his post-match press conference if he doubts himself and how much he wants the job following another disappointing result, the 31-year-old replied: “Absolutely not. I’ve remained consistent.\n“I believe we’re doing a good job in terms of what we’re trying to create. I understand we don’t have a huge amount of time to change too much, and we’ve seen this kind of thing too many times this season – going a goal down early and making it difficult for ourselves.\n“But we understand we do have two important games, and it’s still in our hands what we want to achieve. We have to learn and be better for next week because we’ve got another difficult game.”\nSixth-placed Spurs are next in action on May 20 when they host Brentford, before visiting Leeds for their final game of the season a week afterwards.\nREAD MORE: Tottenham insider leaks triple transfer miss as Liverpool, Bayern capitalise on Levy failings",
  "word_count": 569,
  "scraped_at": "2026-02-14T02:24:42.739014",
  "_text_extracted": true
}