{
  "article_id": "e6f4890f655e",
  "url": "https://thepeoplesperson.com/2025/02/14/former-man-united-goalkeeping-coach-pinpoints-why-david-de-gea-was-a-safer-bet-in-goal-as-compared-to-andre-onana-290873/",
  "title": "Former Man United goalkeeping coach pinpoints why David de Gea was a safer bet in goal as compared to Andre Onana - Man United News And Transfer News",
  "date": "20250214T210000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have leaked goals consistently all season, which explains their 13th position in the Premier League table.\nAfter a strong start, Andre Onana has been culpable for a few howlers recently with the Cameroonian under pressure to prove his worth with rumours rife that Ruben Amorim might look to bring in a new shot-stopper during the summer.\nThe United No 1 has committed errors in both the Premier League and Europa League with the head coach handing more and more minutes to reserve keeper Altay Bayindir as a result.\nFormer manager Erik ten Hag had brought the 28-year-old to the club in 2023 after the club choose not to offer long-serving keeper David de Gea a lucrative contract extension.\nDDG has impressed since leaving United\nAfter spending a year away from football, the Spaniard joined Fiorentina last summer and has been a revelation in Serie A with the team from Florence currently occupying sixth spot in the league table.\nThe Spain international has shown he still possesses the same shot-stopping quality as before with the Italian club also pleased with his ability with the feet, an attribute that Ten Hag felt he lacked and hence the change in goal.\nFormer United goalkeeping coach Frans Hoek was asked by RG about the Spanish star and he revealed that the 34-year-old was the best goalkeeper he had ever trained.\nIt must be remembered that during Hoek’s illustrious coaching career, he had also trained the likes of Manuel Neuer at Bayern Munich, Edwin van der Sar at Ajax, Victor Valdés and Pepe Reina at Barcelona but he still felt De Gea’s consistency made him stand out from the rest.\n“I was involved in the whole scouting process that brought Manuel Neuer to Bayern Munich. I could have stayed and coached him, but I wanted to remain loyal to Louis after his sacking and left alongside him.\n“Everybody could tell Neuer was going to be one of the biggest talents ever. I worked with Edwin van der Sar at Ajax, Victor Valdés and Pepe Reina at Barcelona, they are all exceptional, but if you ask me to pick, I’d go with David De Gea.\n“I was very impressed that he was capable of playing at such an incredibly high level for two years in a row. During my time at Manchester United (2014-16), he didn’t really have a dip, you didn’t see him fall.\nHoek on DDG vs Onana\n“He didn’t make a lot of mistakes, but he also made a lot of important actions that gave us the win at the end. He was at an incredible level, three games a week.”\nAnd as per the Dutch coach, this is what separates Onana from De Gea at the moment — consistency. Fans have already seen the Cameroon international pull off world-class saves one moment and then flounder the next.\n“I was there at the 2023 UEFA Champions League Final and I thought Onana had a perfect game, he was amazing for Inter. He is capable of playing at an incredibly high level and can reach an incredible level, but you have to do it three times a week, 50–60 times a year, which is very difficult.\n“Consistency is the most important thing for a goal player, De Gea was incredibly consistent in my two years at United, and if I look at Onana, I can see he’s not consistent.”\nDe Gea’s shot-stopping had certainly let him down, especially under Ten Hag, while his passing ability was also not up to scratch. But nobody can deny how impressive he was during Louis van Gaal and Jose Mourinho’s reigns.\nAmorim will hope Onana can move on from his recent mistakes and bring his A-game to the fore as the club seek to end the season on a high starting from Sunday’s crucial league clash against Tottenham Hotspur.\nFeature image Simone Arveda via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 655,
  "scraped_at": "2026-02-14T01:52:15.338108",
  "_text_extracted": true
}