{
  "article_id": "e6f9b5f791de",
  "url": "https://bravenewcoin.com/insights/floki-becomes-official-cryptocurrency-partner-of-nottingham-forest-f-c",
  "title": "Floki Becomes Official Cryptocurrency Partner of Nottingham Forest F . C . ",
  "date": "20240816T064500Z",
  "domain": "bravenewcoin.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Floki Becomes Official Cryptocurrency Partner of Nottingham Forest F.C.\nFloki has partnered with Nottingham Forest football club, which currently is playing the English Premier League (EPL).\nAnnounced on Thursday, Floki will be the official cryptocurrency partner of Nottingham Forest and have extensive marketing and promotional rights.\n“We are proud to join the ranks of the Premier League with a club that is an institution in world Football,” a media representative of Floki said. “Just as Nottingham Forest are building a future as a dominant force in world football, Floki is on the same journey to establish itself as one of the most successful brands in its sector, constantly challenging and innovating with brands like Valhalla.”\nDuring all home games, the Floki brand mark will be featured for three minutes on camera-facing LED boards from kick-off to the final whistle. This ensures that the Floki brand is seen by both stadium audiences and TV viewers.\nThe Floki logo will also be prominently displayed. It will appear in four slots on official Premier League interview backdrops at each home match and in four spaces on press conference backdrops used throughout the season.\nFloki will have a strong presence on Nottingham Forest’s social media channels. The brand will be mentioned in posts related to full-time scores for both the men’s and women’s senior teams and in all substitution announcements.\nAdditionally, Floki will have a full-page presence in the matchday programmes distributed at each home game, and its logo will be displayed on the front cover. This helps connect Floki to the matchday experience and the fans.\nFans can look forward to exciting offerings, such as signed merchandise. At the end of the season, Floki will offer fans the chance to participate in a ‘play on the pitch’ experience at the stadium.\nPaul Bell, Nottingham Forest’s Chief Operating Officer (COO), said, “We are delighted to welcome Floki as an official partner and look forward to working closely with them as we head into the 2024/25 season. As one of the most innovative companies within this sector, we’re excited to work collaboratively with the Floki community.”\nPopularity of EPL\nEnglish Premier League (EPL) is the most popular sports league in the world. It has more viewers than both the UEFA Champions League and the Bundesliga combined. In the 2022/23 season, the EPL had a total audience of 3.23 billion people. These games were broadcast to 712 million households in 190 countries.\nAccording to Nielsen, 2.01 billion viewers watched live match broadcasts over the season. Additionally, 1.22 billion viewers tuned into highlight shows and other related programming. English Premier League clubs also have a massive following on social media with over half a billion followers spread across Facebook, Instagram, TikTok, X, and YouTube.\nNottingham Forest’s History\nFounded in 1865, Nottingham Forest is a club with a rich history. It is one of only eight clubs, including Liverpool, Ajax, Bayern Munich, and Real Madrid, to have won back-to-back European championships. Nottingham Forest also has a strong online presence, with over 4.5 million followers on various social media platforms. This includes one million fans on Facebook, 670,000 followers on X, one million followers on Instagram, 1.2 million followers on TikTok, and 184,000 subscribers on YouTube.\nAbout Floki\nFloki is the people’s cryptocurrency and utility token of the Floki Ecosystem. Floki aims to become the world’s most known and used cryptocurrency, focusing on utility, philanthropy, community, and marketing. Floki currently has over 490,000 holders and a strong brand recognized globally thanks to strategic marketing partnerships.\nWebsite | YouTube | Telegram | Instagram | TikTok | Discord | Facebook | Reddit | Twitch\nContact\nCommunity Relations Officer\nPedro Vidal\nFloki\nMarketing@floki.com\nBrave New Coin reaches 1M+ engaged crypto enthusiasts a month through our website, podcast, newsletters, and YouTube. Get your brand in front of key decision-makers and early adopters in 2026. Limited slots remaining! Find out more today!",
  "word_count": 648,
  "scraped_at": "2026-02-14T02:25:54.609179",
  "_text_extracted": true
}