{
  "article_id": "e704f5bec59f",
  "url": "https://www.france24.com/en/live-news/20230606-seoane-appointed-borussia-moenchengladbach-coach",
  "title": "Seoane appointed Borussia Moenchengladbach coach",
  "date": "20230606T180000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Seoane appointed Borussia Moenchengladbach coach\nFrankfurt (Germany) (AFP) – Gerardo Seoane has been appointed coach of Bundesliga side Borussia Moenchengladbach in place of Daniel Farke, the German club announced on Tuesday.\nIssued on:\nThe 44-year-old Swiss manager, who was in charge of Bundesliga rivals Bayer Leverkusen until last October, has signed a contract until 2026.\n\"He's a young coach, but one with lots of experience. He plays the style of football we want to see here,\" said Roland Virkus, Gladbach's managing director for sport.\n\"Seoane has been successful with several clubs over the past few years,\" Virkus added.\nHe notably led Leverkusen to the Champions League group stage after finishing third in the Bundesliga 2021-2022 campaign, but was sacked after a poor start to last season.\nPrior to that, he was in charge of Swiss side Young Boys, winning three straight league titles.\nLast week, Gladbach announced Farke was leaving after just one year in the job.\nThe former Norwich City coach arrived in the summer of 2022, but the club finished 10th this season with 43 points.\nSeoane will be Gladbach's third coach in as many seasons after Adi Huetter and Farke.\nThey won five German titles in the 1970s but have struggled since, with the 1995 German Cup their only trophy since.\nGladbach also announced the appointment of Nils Schmadtke, 34, as sporting director.\nHis father Jorg Schmadtke will take over the same position at English club Liverpool, starting on July 1.\n© 2023 AFP",
  "word_count": 247,
  "scraped_at": "2026-02-14T02:09:58.135507",
  "_text_extracted": true
}