{
  "article_id": "e74535166bc8",
  "url": "https://www.themag.co.uk/2023/12/positive-newcastle-united-outlook-now-emerges/",
  "title": "Positive Newcastle United outlook now emerges",
  "date": "20231212T151500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Positive Newcastle United outlook now emerges\nNewcastle United have it all ahead of them.\nIt is understandable why many fans are on a bit of a downer after these last couple of defeats.\nHowever, Newcastle United have a very positive outlook, if you scratch the surface.\nGiven some fair luck that is and that their form is what they are capable of.\nA step back first.\nFrom mid-September to the end of October, Newcastle United had a run of Played 10 Won 6 Drawn 3 Lost 1, in all competitions.\nThat has then been followed by…\nMan U 0 Newcastle 3\nNewcastle 1 Arsenal 0\nDortmund 2 Newcastle 0\nBournemouth 2 Newcastle 0\nNewcastle 4 Chelsea 1\nPSG 1 Newcastle 1\nNewcastle 1 Man U 0\nEverton 3 Newcastle 0\nTottenham 4 Newcastle 1\nA record from start of November to present day of Newcastle United with Played 9 Won 4 Drawn 1 Lost 4.\nA bit up and down but still not bad, with of course so many players missing, especially in recent weeks.\nThings though look to be turning on that side of things.\nWith Longstaff and Wilson having returned to the playing squad on Sunday, Barnes and Botman heavily rumoured to be the next ones back, with also Willock and Anderson reported to be expected back before December ends.\nThe cavalry may be arriving just in the nick of time, able to hopefully take advantage of this upcoming schedule…\nNewcastle United confirmed matches to the first week in January 2024:\nWednesday 13 December 2023 – Newcastle v AC Milan (8pm) TNT Sports\nSaturday 16 December 2023 – Newcastle v Fulham (3pm)\nTuesday 18 December 2023 – Chelsea v Newcastle (8pm) Sky Sports\nSaturday 23 December 2023 – Luton v Newcastle (3pm)\nTuesday 26 December 2023 – Newcastle v Forest (12.30pm) Amazon\nMonday 1 January 2024 – Liverpool v Newcastle (8pm) Sky Sports\nSaturday 6 January 2024 – Sunderland v Newcastle (12.45pm) ITV\nTaking those next three Premier League matches first. Once they have been played we will be exactly at the halfway point and able to take stock, a decent time to judge having played every other PL team once.\nThis is how the Premier League table currently looks:\nNot taking anything for granted but if Newcastle United, with the help of returning players, can produce a decent level of form, then very possible we could see three wins. It would give 35 points at the halfway point and if continuing that form into the second half of the season, well, 70 points would have given you top four last season and indeed with 71 points in fourth, that is where Newcastle United finished in 2022/23.\nHaving these next two games against AC Milan and Fulham at St James’ Park could / should be a massive factor and a help.\nEddie Howe’s side have won all of their last six PL home matches and in all competitions NUFC have won nine of eleven games this season at fortress St James’ Park.\nOnly a win is any use to AC Milan tomorrow night which should set the game up perfectly for Newcastle. Avoiding defeat will guarantee NUFC European football continuing until at least February 2024, whilst a win would give us Champions League last 16 if Dortmund avoid defeat at home to PSG.\nEddie Howe’s side also have the prize of another League Cup two legged semi-final if winning at Chelsea, having already knocked out the Manchester clubs. Chelsea continue to be a total mess and have won only two of their last fifteen Premier League games at home in the last nine months. If Newcastle United play well then I think we win at Stamford Bridge.\nAs for that FA Cup away match at a lower league club the first Saturday in January, well, Newcastle United will be big favourites to win that.\nYes, it is important to reflect and take onboard what went wrong at both Everton and Tottenham.\nHowever, at the same time, the possibilities are now opening up again and whilst no game is easy, this schedule of matches and the what should be the return of so many players, gives me every hope that things are set to be looking positive once again.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 724,
  "scraped_at": "2026-02-14T02:07:27.050979",
  "_text_extracted": true
}