{
  "article_id": "e779b2c0b455",
  "url": "https://www.barcablaugranes.com/barcelona-la-liga/102814/sevilla-barcelona-la-liga-team-news-match-preview-lineups-score-prediction",
  "title": "Sevilla vs Barcelona , La Liga : Team News , Preview , Lineups , Score Prediction",
  "date": "20251005T000000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sevilla vs Barcelona, La Liga: Team News, Match Preview\nBarça look to bounce back from a painful defeat in Europe and stay top of the La Liga table\n*Standings at the time of writing\nCompetition/Round: 2025-26 La Liga, Matchday 8\nBarcelona Outs & Doubts: Marc-André ter Stegen, Joan Garcia, Gavi, Lamine Yamal, Raphinha, Fermín López (out)\nSevilla Outs & Doubts: Tanguy Nianzou, Joan Jordán, Alfon González, Adnan Januzaj (doubt)\nDate/Time: Sunday, September 28, 2025, 4.15pm CET (Barcelona), 3.15pm BST/WAT (UK & Nigeria), 10.15am ET, 7.15am PT (USA), 7.45pm IST (India)\nVenue: Estadio Ramón Sánchez-Pizjuán, Seville, Spain\nReferee: Alejandro Muñiz Ruiz\nVAR: Carlos del Cerro Grande\nHow to watch on TV: ESPN Deportes (USA), Premier Sports 2 (UK), SuperSport (Nigeria), Movistar (Spain), others\nHow to watch online: ESPN+ (USA), Premier Sports Player (UK), FanCode (India), Movistar+ (Spain), others\nFollowing a painful first defeat of the season to Paris Saint-Germain in the Champions League in midweek, Barcelona return to action for the final time before the second international break of the season as the Blaugrana travel to beautiful Seville to face Sevilla at the Ramón Sánchez-Pizjuán on Sunday afternoon.\nBarça come into this one looking to bounce back from their worst performance of the season so far as the Catalans were outclassed in the final 60 minutes against the European champions on Wednesday in what proved to be a strong reality check for Hansi Flick and his troops in the early stages of the season.\nThe Blaugrana learned there are levels to this when it comes to conquering Europe as they lost decisively to a PSG side missing four of their best players, and the physical and tactical issues exposed in that loss should provide a pretty good lesson for Flick and the team in the upcoming months as they look to evolve ahead of what is expected to be another deep continental run.\nBut things are going well domestically, as Barça remain just one of two unbeaten teams in La Liga and will go into the break still top of the table if they get three points and win their fifth straight match in the league at the Pizjuán.\nWinning at the Pizjuán is no easy feat, however: Sevilla have one of the toughest home atmospheres in the league and always raise their game againts the big boys, and have made a solid start to the season with 10 points from their first seven games and just one loss in the last five.\nSevilla had to fight relegation last season and are still going through serious financial turmoil, but the good results on the pitch in the first couple of months of the campaign are helping relieve the pressure around the club. Pulling off the upset against Barça would be a major boost in many ways, and the home crowd will certainly provide the energy needed to help the team.\nHansi Flick spoke in his pre-match press conference about Sevilla’s intensity and counter-attacking threat, and the addition of former Barça star Alexis Sánchez has given the forward line a smart, experienced and talented option after the summer departure of their most dangerous forward player from last season in winger Dodi Lukébakio.\nBarça will be without Lamine Yamal, Fermín López and Raphinha for this one, so three of their best options in what is expected to be a high-intensity, fast-paced, transition-filled game will not be available. Other players will need to step up, and Marcus Rashford has a big opportunity to continue his excellent form and play a decisive part in this one.\nThe Catalans dominated Sevilla in both of their matchups last season, winning 5-1 in Montjuïc and 4-1 at the Pizjuán, but this is a much-improved Sevilla side that will ask a lot more from Barça on Sunday. The Blaugrana need to play smart, intense and clinical football, and must be ready for a real battle for all 90 minutes.\nLet’s dance.\nPOSSIBLE LINEUPS\nBarcelona (4-2-3-1): Szczesny; Kounde, Araujo, Christensen, Balde; De Jong, Pedri; Roony, Olmo, Rashford; Lewandowski\nSevilla (3-4-3): Vlachodimos; Azpilicueta, Cardoso, Marcão; Carmona, Agoumé, Mendy, Suazo; Alexis, Romero, Vargas\nPREDICTION\nThis is a better Sevilla team and Barça are missing three of their best attacking players, so this will not be easy at all. I’m expecting a tight encounter with a few scares for the Catalans, but I still believe they will find a way to win and stay top of the table: 3-2 Barça.",
  "word_count": 737,
  "scraped_at": "2026-02-14T02:26:56.615570",
  "_text_extracted": true
}