{
  "article_id": "e77b7711f3dc",
  "url": "https://metro.co.uk/2024/02/23/chelsea-icon-really-wanted-leave-exiled-frank-lampard-20338552/",
  "title": "Chelsea icon  really wanted to leave  after being exiled by Frank Lampard",
  "date": "20240223T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Antonio Rudiger says he ‘really wanted to leave Chelsea’ after getting surprisingly exiled from the first-team by Frank Lampard.\nThe defender moved to Stamford Bridge in 2017, and after five successful years he joined Real Madrid on a free transfer.\nFor the most part, the 30-year-old was a rock at the back for Chelsea, making 203 appearances and winning the Champions League, FA Cup, Europa League and Club World Cup.\nBut toward the end of Lampard’s first spell in the dugout, Rudiger found himself on the fringes of the team, scarcely featuring in the first-half of the 2020/21 season.\nThe German international has now opened up a little on his time playing under the Blues legend, revealing that he wanted out of west London, telling Goal.com: ‘To be honest, I still can’t say exactly what happened back then. That’s part of football.\n‘Maybe he [Lampard] had other ideas or saw other players better. But the good thing about football is that the answer is on the pitch and I think I gave the perfect one.’\nAsked if he or any other Chelsea stars ‘played against the manager’ at the time, he replied: ‘Nothing like that has ever happened in my career. I even played under Lampard again at the end of his tenure.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Let me put it this way: if it doesn’t fit at some point, then it doesn’t fit anymore. But no footballer in this world loses on purpose.’\nIronically, Rudiger claims that he was desperate to sign for Thomas Tuchel’s PSG in January 2021, only for his fellow German to replace Lampard at Chelsea the following month.\n‘I really wanted to leave. I wanted to leave. I wanted to join Thomas Tuchel at Paris Saint-Germain, that was my wish.\n‘But it didn’t happen and six months later Tuchel came from PSG to Chelsea. We then won the Champions League together. It was probably meant to be.\nMore Trending\n‘I probably just fitted in better with his idea of football and he also really liked me as a guy. That I can take the lead and lead the way.\n‘I got on particularly well with him. His honest manner simply suited me. Also, when I look at his tactical understanding: Wow!’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Real Madrid learn Jude Bellingham return date after ankle injury\nMORE: Liverpool captain Virgil van Dijk warns Chelsea not to make huge mistake in Carabao Cup final",
  "word_count": 475,
  "scraped_at": "2026-02-14T01:56:44.620420",
  "_text_extracted": true
}