{
  "article_id": "e77ccb48447c",
  "url": "https://www.justarsenal.com/former-arsenal-defender-says-spurs-will-collapse-as-usual/350939",
  "title": "Former Arsenal defender says :  Spurs will collapse , as usual . ",
  "date": "20231012T093000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Arsenal player does not believe Spurs will fight for the title\nAfter eight rounds of fixtures Arsenal see themselves locked in second place, behind their arch-rivals Tottenham Hotspur on goal difference.\nThe two North London sides are the only remaining unbeaten teams in the Premier League this term, and many are wondering whether this will form into a title rivalry as the season progresses.\nHowever, former Gunners defender Bacary Sagna has squashed that talk claiming that the white side of North London don’t have what it takes to triumph in the league.\nSagna told Paddy Power via Goal, “The title race will be between Arsenal and Manchester City, Spurs will collapse, as usual.”\nBacary Sagna:\n\"The title race will be between Arsenal and Manchester City, Spurs will collapse, as usual.\nAnd that’s not just me speaking as an Arsenal fan. I don’t see them (Spurs) being consistent enough all season.\" [metro] pic.twitter.com/hUePGTFu3b\n— AfcVIP⁴⁹ (@VipArsenal) October 10, 2023\n“And that’s not just me speaking as an Arsenal fan. I don’t see them being consistent enough all season.”\nThe Frenchman went onto say that apart from Son Heung-min, who has scored an impressive six goals in the league, the team lacks players who can make a major impact throughout the season.\nHe continued, “Apart from Heung-Min Son, I don’t see anyone in that team that can lead the team or play a vital role in Spurs’ title race. I have respect for the players, and they play good football under a good coach, but the season is very long, and I don’t see them competing on a long-term basis.”\nThe former fullback who made 284 appearances for Arsenal from 2007 to 2014 concluded, “They started well, and they can qualify for the Champions League, but I don’t see them competing for the title.”\nIt’s still very early days to truly know who will be battling it out for the top prize this campaign. A title fight without Man City involved in it seems ridiculous.\nNow, steadily and gradually Mikel Arteta’s Arsenal are putting themselves in that bracket. And that is visible to everyone.\nWriter – Yash Bisht\n————————————–",
  "word_count": 358,
  "scraped_at": "2026-02-14T01:51:09.240330",
  "_text_extracted": true
}