{
  "article_id": "e7bb48a54f90",
  "url": "https://www.billboard.com/culture/product-recommendations/ufea-champions-league-how-to-watch-1235453514/",
  "title": "How to Stream UEFA Champions League Online for Free – Billboard",
  "date": "20231025T001500Z",
  "domain": "billboard.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "All products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\nTrending on Billboard\nUFEA Champions League 2023 is here! The soccer matches began on Sept. 19 with group stages and will continue on until the finals taking place on June 1, 2024. If you love to watch soccer, but were not able to score some travel deals to watch the matches live, then you still have some online options that’ll have you catching every score, penalty kick and more from your couch.\nOur suggestion? Use Paramount+ to watch all the games live and take advantage of their 7-day free trial to see the games for free. Click here to start your free trial.\nThe next game will take place on Wednesday (Oct. 25) at 12:45 p.m. ET with Barcelona vs. Shakhtar Donetsk. Taking place at the same time is Feyenoord vs. Lazio, which you can watch using the same streaming options. Other matches taking place this week include Newcastle vs. Dortmund, RB Leipzig vs. Crvena zvezda, Young Boys vs. Man City, PSG vs. Milan, Celtic vs. Atlético Madrid and Antwerp vs. Porto all on Wednesday (Oct. 25) at 3 p.m. ET.\nClick here to check out the full UEFA Champions League schedule.\nKeep reading to learn how to watch the group stage matches below.\nHow to Watch UEFA Champions League 2023 Online for Free\nCBS Sports is the official English-language broadcaster for the U.S., which means you’ll need to tune into a CBS Sports or any of its affiliates. If you have cable, then you can view the games for free — just check with your provider’s channel guide to find out what channel CBS Sports is on. You’ll also be able to view it through CBSSports.com or the CBS Sports app (you’ll just need to log in with your provider’s info).\nDon’t have cable? There are a few streaming options for you to choose from that offer free trials and promotions or you can try an HD antenna like one here from Amazon, which may also work.\nParamount+ is considered the streaming platform for UEFA Champions League 2023 as its plans include CBS Sports as well as exclusive content and original shows and movies. If you’re already subscribed all you have to do is login to your account to begin watching the games.\nNot a subscriber? You can take advantage of the Paramount+’s 7-day free trial, which will allow you to watch the soccer matches for free. Once the free trial is over you’ll be charged the regular subscription price based on the plan you choose. There are two plans to choose from: Paramount+ Essential and Paramount+ with Showtime. The Essential plan is $5.99/month and includes some ads, thousands of episodes of Paramount+ Originals, movies, series and exclusives as well as NFL on CBS, UEFA Champions League and CBS News. Paramount+ with Showtime is $11.99/month and includes everything in the Essential plan except with no ads and access to the entire Showtime library, live TV, college football and the ability to download content to watch offline.\nDirecTV Stream also offers a five-day free trial that you can use to stream the UFEA Champions League online for free. After your free trial is up, you can take advantage of DirecTV’s limited-time promo, giving you $10 off its plans for three months; after that you’ll pay as low as $74.99/month.\nWant more affordable streaming options? FuboTV offers a 7-day free trial and gives you access to hundreds of live TV channels including CBS Sports. Once the free trial is over you’ll pay as low as $74.99/month.\nViewing outside of the United States? Make sure to use ExpressVPN which lets you watch the UFEA Champions League from Mexico, England, Canada and other countries around the world. ExpressVPN gets you a World Cup live feed in Spanish, French and dozens of local languages.",
  "word_count": 664,
  "scraped_at": "2026-02-14T02:10:28.704128",
  "_text_extracted": true
}