{
  "article_id": "e7d6731a1c2b",
  "url": "https://www.gdnonline.com:443/Details/1343941/Hilal-rout-Persepolis-to-reclaim-top-spot",
  "title": "Football : Hilal rout Persepolis to reclaim top spot",
  "date": "20250204T234500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – Al Hilal reclaimed top spot in the West Zone of the AFC Champions League Elite 2024-25 after a 4-1 win against Persepolis FC in their penultimate League Stage match yesterday.\nMalcom inspired the Saudi Arabia side to victory with a goal and two assists as Al Hilal moved ahead of Al Ahli Saudi FC on goal difference.\nAs for Persepolis, the defeat saw them drop out of the top eight but the Islamic Republic of Iran side retain a chance of progressing to the knockout stage with one round of fixtures to be played.\nPersepolis held their own in the opening exchanges at the Kingdom Arena but were undone in the 10th minute by a brilliant Malcom individual goal, his first of the campaign.\nPicking the ball up from just inside Al Hilal’s half, the attacking midfielder surged forward and with Persepolis players backing off him, the Brazilian ran unchallenged into the box before lifting his shot past the advancing Alexis Guendouz for the opener.\nBoosted by the goal, Al Hilal went in search for another and found it in the 25th minute when Joao Cancelo ran onto a Malcom pass just outside the box before smashing in a swerving low shot which Guendouz got a hand to but wasn’t strong enough to keep out.\nThe influential Malcom then earned his second assist, slipping skipper Salem Al Dawsari through in the 39th minute with the Saudi international then evading Guendouz to tuck away from a tight angle.\nAl Hilal were not done as they increased their lead in the first minute of added time thanks to a stunning Al Dawsari strike from outside the box following a Cancelo pass.\nPersepolis head coach Ismail Kartal rang in the changes for the second half with a triple substitutions by bringing on Giorgio Gvelesiani, Saied Mehri and Farshad Ahmadzadeh as he looked to give new-signing Serdar Dursun more support in attack.\nGvelesiani did pull one back for Persepolis in the 90th minute from the penalty spot after Isa Alkasir was fouled by Ali Al Bulayhi but it was nothing more than consolation for the visitors as Al Hilal’s fantastic first half display was enough to earn them the win.\nThe concluding fixtures in two weeks will see Al Hilal face Al Wasl FC of the UAE while Persepolis will hope to keep the fight going against Saudi Arabia’s Al Nassr Club.\nMeanwhile, Qatar’s Al Gharafa secured a 1-0 victory over Pakhtakor in Doha yesterday to edge closer to a place in the knockout rounds.\nThe Qatar Stars League side moved onto seven points from seven games after Ferjani Sassi’s 39th minute goal earned his club their second win of the campaign while Pakhtakor’s chances suffered a significant blow.\nThe club from Uzbekistan remain on four points with one round remaining, when Pakhtakor will face Al Sadd SC from Qatar in Tashkent on February 17.\nTop stories for today:\nOne-time extra payment of allowances approved\nLocals may get priority in school posts\nUS metal buyers likely to turn to Mideast and Chile",
  "word_count": 510,
  "scraped_at": "2026-02-14T02:18:11.281585",
  "_text_extracted": true
}