{
  "article_id": "e7dd93019c2e",
  "url": "https://www.france24.com/en/live-news/20240621-french-star-varane-s-intervention-a-game-changer-for-concussion-crusader",
  "title": "French star Varane intervention a game changer for concussion crusader",
  "date": "20240621T134500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "French star Varane's intervention a game changer for concussion crusader\nParis (AFP) – Michael Monsour, owner of Gibraltar football club Manchester 62 was in his \"darkest hour\" until ground-breaking comments by former France defender Raphael Varane reignited his goal to \"save millions of future players' lives\", he told AFP.\nIssued on: Modified:\nMonsour's mission, using his ownership of US club Pittsburgh City United and Manchester 62 in Gibraltar's top flight, has been \"widening research\" into concussion and chronic traumatic encephalopathy (CTE), a progressive brain condition caused by repeated blows to the head from footballs.\nThe 41-year-old American has seen at first hand the dreadful consequences of degenerative brain diseases after working for two decades in the field of senior living memory.\n\"I have assessed over 1000 patients and have been there for them through the early stages, until the very end,\" he said in a Zoom call.\n\"I have witnessed many friends suffer from dementia and Alzheimer's, very much like CTE it is a terrible disease,\" added Monsour, whose father and grandfather were physicians.\nConcussion and CTE has become an increasingly contentious issue in football -- heading in matches involving under-11 players is to be banned in England -- and just as in rugby a legal case is being brought by former professional players.\nIn England, 10 former players and the families of seven others who have died -- including that of 1966 World Cup winner Nobby Stiles -- are suing the governing bodies, which they claim have \"always been perfectly aware\" of the risks of concussions and brain injuries to players but failed to take the necessary precautions.\n'Still scarred'\nDespite the Manchester 62 players' initial reluctance, Monsour has succeeded in getting them to wear protective headbands which cushion the impact of heading the ball.\nIn January 2023, \"we became the first top-flight European football club to have all 10 of its outfield players wear (them)\".\n\"Headbands are so difficult for professionals,\" said Monsour, who bought Manchester 62 in 2022.\n\"It was very difficult and only one or two players wore it up to January 2023.\n\"It is heartbreaking on two fronts. I do not want to see them get hurt and also be in a situation of not connecting enough with them that they are not wearing protective headgear.\n\"The goal we are going towards is saving millions of future players' lives.\"\nHowever, off the pitch finances dried up -- nothing new to Monsour as he \"started Pittsburgh City United with 20 bucks in his pocket and finished with 10\" -- and he had a pressing bill to pay.\n\"It has been a rollercoaster, with many challenges,\" he said.\n\"I was an hour away from missing tax payments... we were down to the last hour or the darkest hour.\"\nHowever, then came the intervention of France's 2018 World Cup winning defender Varane in an interview with L'Equipe in April.\nThe 31-year-old former Real Madrid defender and four-time Champions League winner, who has just left Manchester United after three years at the club, said when he looked at three of the worst matches of his career \"there are at least two before which I had a concussion a few days earlier\".\n\"When you know that repeated concussions potentially have a fatal effect, you tell yourself that it could go very wrong,\" Varane said.\n\"We need to talk about the dangers linked to second impact syndrome, and to the repetition of knocks because of head play.\"\nThat proved a game-changer for Monsour.\n\"Raphael Varane's interview changed the situation,\" he said.\n\"I had nowhere to turn to prior to that moment, I had been pushing this envelope in the fight against CTE and investment interest would always come in heavy then suddenly back out.\"\nSince Varane's interview, Monsour has secured $20 million (18.6 million euros) of investment from US-based 'angel investor' Takashi Cheng, \"to allow us to continue our mission under my ownership\".\nMonsour concedes he is \"still scarred up from the battlefield\" but with the future secured they should heal -- \"we are not a risk anymore\", he said, adding that he believed the investment into CTE research was larger than football's governing body FIFA had made.\n\"We have the best researchers... and are not going to stop at headgear.\n\"We are flying towards the sun and to prevent being Icarus we will bring enough sun block!\"\n© 2024 AFP",
  "word_count": 730,
  "scraped_at": "2026-02-14T01:51:32.425632",
  "_text_extracted": true
}