{
  "article_id": "e7ed025d82c2",
  "url": "https://metro.co.uk/2025/05/22/man-utd-star-gets-furious-bust-up-cristian-romero-europa-league-defeat-23197707/",
  "title": "Man Utd star gets in furious bust - up with Cristian Romero after defeat | Football",
  "date": "20250522T001500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Harry Maguire was involved in a furious bust-up with Cristian Romero following Manchester United’s Europa League final defeat to Tottenham.\nBrennan Johnson’s first-half goal sealed victory for Spurs in Bilbao, securing their first piece of silverware since 2009 and their first in Europe in 41 years.\nMaguire and Romero were involved in a number of flashpoints as United pushed for an equaliser against a resilient Spurs backline. The United centre-half was booked in one of those incidents which left the Argentina international in a heap on the floor.\nAnd tempers flared again after the full-time whistle.\nAs the Spurs players and staff spilled onto the pitch, Romero, who captained his side with Son Heung-min named among the subs, was seen approaching a number of United players seemingly to shake hands.\nSpurs boss Ange Postecoglou also made the classy gesture, seen approaching every United player to offer some words of support while his players celebrated.\nRomero was seen embracing United boss Amorim before approaching Maguire, seemingly to shake hands with the England international appearing to reject his gesture.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRomero is then spotted approaching Diogo Dalot, putting his arm around the right-back with Maguire again taking exception.\nPushing Romero away from his teammate, Maguire is seen remonstrating with the Spurs, gesturing for him to go join his Tottenham teammates with backroom staff stepping in to separate the pair.\nMaguire’s fury appeared to be solely aimed at Romero, spotted congratulating his former Leicester City teammate James Maddison – who missed the game through injury.\nDefeat on Wednesday night ensured there will be no European football at Old Trafford this season with Tottenham set to join the Premier League’s top five in that competition next term.\nMore Trending\nThe lighter schedule will provide Amorim more time on the training pitch with his squad – something he has been desperate for with the United boss insisting he will not change his methods or tactics.\n‘It’s hard to talk about positives today but we need to take advantage of everything,’ Amorim said.\n‘We are going to suffer because we don’t have Champions League and it’s hard on the club, but on the other side we will have more time to develop the team, to pay attention to our academy and to prepare for the future.\n‘That is clear. We need to use every minute to improve the team and we always have plans to go to the summer.’\nMORE: ‘Far too easy!’ – Roy Keane blasts Man Utd star over Brennan Johnson’s winner for Spurs\nMORE: Micah Richards tells Man Utd to replace £19m signing after Europa League final defeat\nMORE: Alan Shearer blasts ‘embarrassing’ Ruben Amorim decision after Man Utd lose Europa league final",
  "word_count": 503,
  "scraped_at": "2026-02-14T02:02:47.545192",
  "_text_extracted": true
}