{
  "article_id": "e8026d099c2b",
  "url": "https://www.twtd.co.uk/ipswich-town-news/47179/mckenna-incredible-achievement-yet-to-sink-in",
  "title": "McKenna : Incredible Achievement Yet to Sink In - Ipswich Town News",
  "date": "20240504T203000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 4th May 2024 17:39\nTown boss Kieran McKenna admitted his side’s “incredible achievement” hadn’t sunk in after the Blues’ 2-0 victory over Huddersfield sealed a place in the Premier League and a second successive promotion.\nWes Burns and Omari Hutchinson netted a goal in either half to cement second spot in the Championship, although in the end even a defeat would have been good enough with third-placed Leeds having lost 2-1 at home to Southampton.\n“It feels incredible, it’s an incredible achievement, such a range of emotions today, thankfully all positive,” McKenna said in a press conference having been dragged away from selfie-hungry fans still celebrating on the pitch almost two hours after the final whistle.\n“Overjoyed for everybody, so proud of the efforts, relieved as well, I have to say when you get to the end point.\n“It’s such a big thing, it doesn’t come around every year, it doesn’t come around every decade something like this, so we wanted to finish it off right. Just delighted.”\nHas the scale of the achievement sunk in? “It hasn’t, to be honest. I have been so disciplined and the staff have and the players have, of not getting carried away, not thinking about what we’ve done, not thinking about what’s gone before.\n“I’m sure in the next couple of days, 96 points in the Championship as a newly promoted team with so many of the same group that we had two years ago, the way that we’ve done it, the style that we’ve done it in, I think it’s an incredible achievement and one that will go down for many, many, many years.”\nTown were 12th in League One when McKenna took over in December 2021, could he have dreamed his time at Portman Road would go as well.\n“I don’t think you could, certainly not on this timescale,” he reflected. “It was a long road, there was a lot of work to be done and we had the goal to get promotion and eventually to try and get promoted again, but everybody does. Not everybody but there are so many big clubs in the pyramid, who do.\n“To achieve it has taken an incredible amount of work, to have done it in the timescale that we’ve done it, to have done it with 98 and 96 points and to have done it this year in one of the toughest Championships there’s ever been from a statistical point of view, it’s incredible that it’s been done in this scale.\n“And that’s going to bring its challenges, there’s no two ways about it. It’s come before anyone could have expected. There’ll be some challenges ahead but they’re not for now, it’s to revel in this, these wonderful days that we’ve been privileged to have.”\nAsked whether he sees today’s achievement as a culmination of his work as a coach since his playing career was curtailed by a hip injury in his early 20s, McKenna said: “I’d probably even go back before that. I moved away from home when I’d just turned 16 to try and fulfil one dream and there are a lot of sacrifices that you make.\n“I’ve had to pivot on that journey at 22 and I’ve had 15 years-plus now of work, of sacrifice of learning, of trying to improve myself. Of course, you can’t do that without amazing support from your family.\n“It’s been an incredible journey for myself and I’m really, really proud of what I’ve achieved and really, really proud of the people around me and the way they’ve supported me to do that.”\nDid he have to toughen up when moving from coach to manager when he joined Town? “You can only speak for your own experiences and my answer to that has usually been that there are an awful lot more similarities than differences.\n“Of course, it’s a different job but my career to this point as a youth team coach, manager, if you want to call it, at Tottenham and Manchester United, has been trying to improve players, trying to improve teams, trying to develop a style of play. And then when you move into senior football it’s about winning.\n“That’s been the basis of my work, that’s what I’ve tried to make myself good at and worked really hard to improve at and I’m still doing.\n“That’s the basis of the job every day, come in, try to make the players better, try and make the team better and try and win games.\n“Of course, there are leadership elements to the job now in terms of leading people, leading staff, messaging, things like that. But I’ve enjoyed that side of it as well. It’s in my nature as well, I was always a captain, I quite enjoyed the responsibility of that side of it.\n“The coaching side is still a big passion for me, improving players, improving teams is still a big passion and the leadership side that comes on top of the job, that’s something that I’ve really enjoyed as well.”\nTown end the season with Conor Chaplin and Nathan Broadhead as joint-top scorers on 13 rather than having any one player with 20-plus. McKenna was asked whether sharing goals around was a conscious thing.\n“In some ways,” he said. “Conor Chaplin scored nearly 30 goals last year and is an incredible goalscorer. If somebody wants to score 25-plus, we’re not going to stop them and the boys have done terrific to chip in the goals.\n“Part of our culture is to be a team, that was what was going to make us successful, it was to have different ways to score goals, it was to have different threats.\n“Anyone who watches us will know part of our strategy is very often to rotate our forwards throughout the season, to rotate our forwards throughout the game, to make substitutions so there’s not many of our front players who play 90 minutes every week.\n“And we feel like we’ve developed a lot of threats, a lot of ways to score, a lot of players who can score and that’s been reflected in us finishing as top scorers in the league for the second time in a row. We scored 100-plus last year, we scored 90-plus this year.\n“I think we’ve got the best record for goals off the bench this season, last season. It’s things like that that reflect really, really well on the culture.”\nMcKenna was asked what the approach is going to be in the Premier League, what it’s going to be like preparing for Manchester United and Liverpool\n“Give me a break!” he joked. “It’s a massive step up, there’s no doubt about it, it’s not something I want to think about too much today but I know it’s a humungous step up in every single department of the football club it’s going to be a massive, massive challenge to even be competitive in the Premier League.\n“We know there are some big, big challenges ahead but they’re challenges to look forward to, challenges to embrace.\n“I don’t think anyone externally thought that we could get to this point as we have done. Those are things to look forward to but they’re things to think about next week. This weekend’s for revelling in what we’ve done so far.”\nHow does if feel to be a Premier League manager? “It’s nice but it’s not what consumes my focus, to be honest. I’ve coached in the Champions League when I was 31 or 32, I’ve coached in the Premier League, I’ve been involved in those big games, it’s brilliant, you want to test yourself against the best clubs, the best teams, best players, best coaches and it’s going to be a great challenge to go and do that again.\n“For me, my value comes in how we’re trying to help the people around me, how I’m trying to represent the football club I’m working for and how I try and improve that team, those players and that club.\n“Of course, it’s going to be fantastic to have that challenge in the Premier League next year, but it’s been fantastic to have it in the Championship this year and it was fantastic last year to do that in League One, to be honest.”\nHas he got anything booked in terms of a holiday? “Honestly nothing, it’s taken a monk-like discipline from everyone, to be honest. I’ve not booked dinner tonight.\n“I’ve not made a plan past Saturday at three o’clock, I have to say. We were so consumed by trying to go out there and perform in the schedule that we’ve had.\n“Thankfully, we’ve got some time, it’s quite a big break from the end of the Championship season to start of the Premier League season, so we’ll use the time well. There’s a lot of work to be done and we will work very hard over the summer.\n“But, for sure, I’m going to enjoy this moment, these moments, these last two years, I’m going to enjoy with a holiday, the family deserve to have a large share of my attention for a while and I’ll make sure I do that but I also know there’s going to be a lot of work going on.”\nPre-season plans, with a return to last summer’s destination Austria likely, have been pencilled in.\n“You have to in some aspects, booking training camps and stuff like that, you have to be ahead of that before,” he said.\n“We’ve prepared Plan A pre-season, Plan B pre-season, Plan C pre-season and Plan D pre-season because you don’t know if you’re going to be in the play-offs and which round you might go out in and then it would all change.\n“We’ve got all those scenarios lined up, that’s the one bit that we have planned, there’s still detail to add to it, but the start of that’s in place.\n“Next week, maybe not Monday, but shortly after that we’ll start to refine those plans.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nWhat strikes me most about him though is that he is used to coaching players at PL and Champions League level, so in theory he should embrace next season really easily.\nThe tough bit, is how we recruits and spend the money, MA will do the deals but it's the targets, the young and hungry players he has his eyes on, he will know Man Utd and we've seen what Kobee Manoo can do, it's those type of players he will be targeting, the very best of the up and coming players.\nLook what hes done with Omari !\nGreat times ahead and Im watching very eagerly mr Ham, i have real belief we will surprise a few next season\nMy best day out this century along with Wembley.\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1829,
  "scraped_at": "2026-02-14T02:01:16.468529",
  "_text_extracted": true
}