{
  "article_id": "e80af0893b14",
  "url": "https://www.teamtalk.com/news/man-city-in-talks-with-chelsea-as-guardiola-plots-shock-move-for-england-star-huge-offer-required-for-deal",
  "title": "Man City  in talk with Chelsea as Guardiola plots shock move for England star ; huge offer required for deal",
  "date": "20230918T223000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City ‘in talks’ with Chelsea as Guardiola plots shock move for England star; huge offer required for deal\nManchester City are reportedly considering a surprise move for Chelsea right-back Reece James as Pep Guardiola looks to bring in a long-term replacement for Kyle Walker.\nWalker has signed a new contract with the Cityzens until 2026 but given he is 33, Guardiola is already planning for the future without him.\nJames has struggled with injuries recently but has proven that he can be a top player on his day. He was also awarded the Chelsea captaincy by Mauricio Pochettino at the start of the season, which shows how important he is to the London club.\nJames made his breakthrough into the Chelsea first team in 2019. He has since made 148 appearances for the Blues, scoring 11 goals and laying on 20 assists.\nIn the process, he has helped his team win three major trophies, including the Champions League in 2021. James is also a regular in the England squad when fit, so there is certainly no doubting his quality.\nSeveral clubs are thought to hold an interest in signing James, including Real Madrid.\nWith that in mind, it will be interesting to see if Man City do make an offer for James when the transfer window re-opens in January, or at the end of the season.\nREAD MORE: Dyche anxious as Chelsea line up move for £70m Everton star; Pochettino copies Arsenal tactic\nMan City ‘in talks’ with Chelsea over James move\nAccording to Football Transfers, Man City are ‘in talks’ with Chelsea over a potential move for James.\nThe report states that Pochettino, understandably, does not want to sell the right-back to a Premier League rival like the Cityzens.\nHowever, it is claimed that the Blues could sell James if they get a huge offer because of the injury problems that the £250,000-a-week player has endured so far in his career.\nJames missed 25 games last season due to injury, and is now expected to be sidelined for several weeks after pulling his hamstring in training.\nDespite his lack of availability at the moment, James is still only 23 and has plenty of time to bounce back from his current ailments.\nIt seems that Pochettino agrees with this. Therefore, it would take a very sizeable offer from Man City to tempt Chelsea into selling their captain either in January or in the summer.\nNevertheless, with Real Madrid also interested, his future is increasingly uncertain at the moment.\nREAD MORE: Pep Guardiola says Man City are ‘nothing special’ despite treble win and demands another UCL victory",
  "word_count": 437,
  "scraped_at": "2026-02-14T02:00:57.130178",
  "_text_extracted": true
}