{
  "article_id": "e81f672b78c8",
  "url": "https://www.teamtalk.com/liverpool/james-pearce-tantalising-florian-wirtz-update-liverpool-near-historic-signing",
  "title": "Florian Wirtz : James Pearce drops tantalising Liverpool update with £169m double deal in  final steps  ",
  "date": "20250604T144500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nJames Pearce drops tantalising Florian Wirtz update as Liverpool near ‘historic’ transfer\nThere is a sense of “expectation” that Liverpool and Bayer Leverkusen will soon settle on a fee for Florian Wirtz, according to James Pearce, while the ‘historic transfer’ looks unlikely to be the next one done at Anfield with the Reds also now taking the ‘final steps’ towards another £42m deal.\nThe Reds have wasted little time in trying to upgrade their Premier League title-winning squad, with Arne Slot keen to create a dynasty at Anfield. Having only made one concrete addition to his ranks last season, the Liverpool manager, with a hefty transfer warchest at his disposal, is ready to make a serious splash in this summer’s window.\nHaving already secured Jeremie Frimpong as a successor to Trent Alexander-Arnold and with Milos Kerkez also closing in on a move, it has been a somewhat breathless opening to the summer window at Anfield.\nHowever, the biggest coup of them all is also now edging closer, with optimism now growing that a final and total agreement will soon be struck for Leverkusen superstar Wirtz.\nLiverpool have so far seen two offers rejected by the Bundesliga side for the 22-year-old playmaker, but with FSG granting transfer chiefs the green light to raise that bid further, Pearce now expects an agreement to be struck in due course.\nSpeaking on The Athletic podcast ‘Walk On’, Pearce stated: “David Ornstein reported late last week that a second bid of £109m went in. It wasn’t accepted, but those discussions are ongoing.\n“I sense an expectation from both ends that a compromise will be reached. I think it massively helped Liverpool that Wirtz has made it clear to Liverpool that he wants the move to happen.\n“There was a huge expectation that he’d be going to Bayern Munich. When we reported the interest, the people I’d spoken to said it was about trying to ensure that Liverpool would be at the front of the queue if he was prepared to move outside of Germany.\n“Clearly, Liverpool have done a magnificent job of selling the project to him.”\nAn update from Bild also reveals the ‘historic’ transfer is close, with Wirtz having already agreed terms on a five-year contract at Anfield and on wages understood to be for around £200,000 a week.\nThey state that the ‘deal could ultimately amount to a sum between €140 and the 150m (£118m – £127m) demanded by Leverkusen boss Fernando Carro’, with the transfer due to shatter the British transfer record, currently set by the £115m package Chelsea paid Brighton for Moises Caicedo.\nDON’T MISS ⭐ Gary Neville drops Florian Wirtz verdict for Liverpool as pundit admits ‘surprise’ at fee\nFlorian Wirtz: Liverpool in ‘last steps’ towards third huge transfer\nBild’s report continues that both Liverpool and Leverkusen ‘want to finalise the transfer as quickly as possible under their desired terms’.\nHowever, it’s claimed Leverkusen have the ‘advantage’ and look well placed to achieve their asking price, rather than the lower terms Liverpool have proposed as they know FSG’s CEO of football, Michael Edwards, ‘has already received approval from the club’s owners in Boston for €150m (£127m) for Wirtz’.\nDespite a belief growing that a deal will soon be struck, it is unlikely that the 29-times capped Germany star will be the next summer signing announced by Liverpool.\nThat honour looks set to fall on Kerkez, with a deal in the region of £40m to £45m closing in.\nPer TEAMtalk journalist, Rudy Galetti, writing on X, a deal to bring Kerkez to Anfield is now in the final stages.\n“Liverpool are taking the last steps for Milos Kerkez\n“The deal is almost sealed between Liverpool and Bournemouth for ~€50m plus performance-related bonuses as a final fee.\n“A five-year contract was already agreed upon with the player days ago.”\nLiverpool transfer latest: Chiesa agrees exit; Gomez wanted by eight; Isak claims\nMeanwhile, there have been updates on the futures of Federico Chiesa and Joe Gomez as Liverpool make big changes to their squad in preparation for their Premier League title defence next season.\nStarting with Chiesa, it is now claimed the winger has ‘agreed terms’ to join one a team of European football royalty after a frustrating time of things so far at Anfield.\nHe could be followed out the door by popular defender Gomez, who has as many as eight Premier League sides chasing him this summer.\nShould the defender depart, he could be replaced by Marc Guehi. And according to our transfer correspondent, Galetti, the Reds have thundered into the race for the England star, though do currently trail to a big Italian side who are also very much exploring his signing and with Crystal Palace reluctantly accepting they will have to sell him this summer.\nAnd finally, it seems Wirtz may not be the biggest signing of the summer at Anfield, with a journalist revealing fresh Reds plans to go after Alexander Isak in a deal that could top £150m.\n⭐ Florian Wirtz: His incredible career so far\nWirtz has recorded some impressive achievements by the age of 21 – becoming the youngest Bundesliga scorer when he got his first goal for Bayer Leverkusen, for example, although he has since been surpassed – but his recent record has shown he could be ready for the next step.\nSo far, he can boast that he:\nWas named the Europa League Young Player of the Season two years in a row (2022/23 and 2023/24).\nHelped Bayer Leverkusen win their first ever Bundesliga in 2023/24 and was named the league’s Player of the Season.\nHas been named the Bundesliga Player of the Month six times, including in two consecutive months this season.\nFinished second on the assists chart for the 2024/25 Bundesliga, after also being joint-second in that ranking last season.\nScored six goals in the Champions League this season, despite it being his first at that level – and was remarkably named man of the match in five of his first nine UCL appearances.\nHas scored double figures of goals in both of the past two seasons, with his career high being 18.\nWas the only player from Europe’s top five leagues to score 16+ goals and provide 16+ assists in all competitions last season.",
  "word_count": 1050,
  "scraped_at": "2026-02-14T01:49:39.541653",
  "_text_extracted": true
}