{
  "article_id": "e85ad61364f7",
  "url": "https://www.caughtoffside.com/2025/05/04/arsenal-star-signals-intention-to-leave-this-summer/",
  "title": "Arsenal news : midfielder signals intention to leave this summer",
  "date": "20250504T130000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are intending to make significant moves in the transfer market this summer, but there will also be notable departures. And one player that is destined to end his times at the Emirates is Jorginho.\nJorginho joined Arsenal two years from Chelsea, and for the most part, he has been a good addition to Mikel Arteta’s squad. But his prominence has dropped significantly this season, with Thomas Partey having been the preferred defensive midfielder – and especially in recent months.\nAnd with news that Arsenal are going hard to sign Martin Zubimendi this summer, it would push Jorginho further down the pecking order. As such, it is taken for granted that he will leave North London.\nJorginho ready to leave Arsenal when contract expires\nJorginho is out of contract at the end of the season, and according to Football Insider, he has made it clear that he would not accept a renewal offer if one were to come his way. At this stage, there are no talks planned between the two parties, which further indicates that there will be a separation in the summer.\nJorginho has spent seven seasons in the Premier League since his 2018 move to Chelsea, but his time in England now looks to be over. He has been strongly linked with a return to Brazil, which is the country of his birth. Flamengo have been pushing to sign him in recent weeks, and at this stage, they are favourites to secure his signature.\nJorginho is currently sidelined with a chest injury, so there are doubts about whether he will play again for Arsenal before his contract expires. But even if he does not, he will have been a solid player for them – and he could add to the Champions League winners’ medal that he won with Chelsea in 2021.",
  "word_count": 304,
  "scraped_at": "2026-02-14T02:02:47.558463",
  "_text_extracted": true
}