{
  "article_id": "e89902f2386e",
  "url": "https://metro.co.uk/2024/12/27/cristiano-ronaldo-reveals-pick-win-champions-league-22259364/",
  "title": "Cristiano Ronaldo reveals his pick to win the Champions League",
  "date": "20241227T210000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo has backed Real Madrid to win the Champions League again this season and insists Pep Guardiola’s Manchester City will overcome their slump.\nCarlo Ancelotti’s side, who beat Borussia Dortmund in the Champions League final last term, have endured a difficult campaign in Europe this season securing just nine points from six games so far.\nMadrid currently sit 20th in the Champions League table and four points behind an automatic place in the knockout stage.\nCity, meanwhile, have also struggled to dominate in the Champions League this season and also face the prospect of requiring a play-off to reach the next phase.\nGuardiola’s side are also falling out of the running in the Premier League title race after a 1-1 draw with Everton on Boxing Day left them 14 points behind leaders Liverpool, who also have a game in hand.\nWhen asked about City’s struggles at the Globe Soccer Awards on Friday night, Ronaldo replied: ‘Well, in football you never know what’s going to happen.\n‘The teams have moments, difficult times, good times and what, for example, City pass through this moment is a difficult time but I’m sure, 100 per cent that they will be back.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s like Madrid, people don’t expect that they’ve bene so brilliant in the beginning but they are not too bad, they are there, two points in front of Barcelona and they say it’s a bad season, I don’t understand why they say these kind of things.\n‘Every player, every team they have a rash moment but they will come back all the time. And Madrid, if you have to bet to win the Champions League again I would bet Real Madrid because you never know what’s going to happen.\n‘At the Bernabeu it’s different, all the teams are scared when they play there, this is a fact, history says that, and never consider Madrid dead because they always come back, City as well.’\nAsked how City turn their form around, Ronaldo said: ‘Probably say less and show more, this is what I would say.\nMore Trending\n‘I would probably push a few guys apart and say what I think. I don’t need to say it in front of everybody.\n‘But I think the big teams, the big players, they are smart enough to understand what is the problem, where is the problem.\n‘I’m sure 100 per cent they will be back, Guardiola is a very smart coach, he knows what the problem is coming from, and they will be there like always.\n‘As I said before, Madrid is the same. They are a little bit difficult in the beginning, some players have adjustments, some positions, but Vinicius Jr, Rodrygo, they will be back like always.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Nuno Mendes responds as Manchester United submit offer to sign £34m PSG defender\nMORE: Cristiano Ronaldo sends message to ‘fantastic’ Ruben Amorim over Man Utd slump\nMORE: Alan Shearer makes Chelsea trophy prediction after dropping points in Premier League title race",
  "word_count": 570,
  "scraped_at": "2026-02-14T02:14:55.041579",
  "_text_extracted": true
}