{
  "article_id": "e8a181a38c86",
  "url": "https://www.90min.com/ex-man-utd-manager-confirms-contact-bayern-munich",
  "title": "Ex - Man Utd manager confirms contact from Bayern Munich",
  "date": "20240425T001500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ex-Man Utd manager confirms contact from Bayern Munich\n- Ralf Rangnick has contacted Bayyern Munich over manager's job\n- Thomas Tuchel set to depart Allianz Arena this summer\n- Austria boss was previously an interim at Manchester United\nBayern Munich have been in contact with former Manchester Unitd interim manager Ralf Rangnick over the possibility that he could replace Thomas Tuchel this summer.\nTuchel is set to depart Bayern at the end of the season, prompting many to speculate over who will take his place when the 2024/25 campaign begins.\nThe Bavarian giants had been interested in Xabi Alonso until he pledged to stay at Bayer Leverkusen and have been linked with plenty of names, with Rangnick confirming there have been conversations with Bayern and that his current employer has been informed.\n\"There has been contact from the side of Bayern Munich and I have informed the Austrian Football Association,\" he told 90minuten.at.\n\"If Bayern say: 'We want you', then I would also have to ask myself: 'Do I really want this? If I want to do something else, I will first discuss it with the Austrian FA. My focus is on the Austrian national team. We are completely focused on the European Championship.\"\nRangnick was asked what would drive him to accept a job of this nature, to which he replied: \"For me it's about these things, can I make a difference? Is there a chance of developing a team and being successful?\"\nThe 65-year-old endured a six-month interim spell as Manchester United manager, an appointment that ended poorly and left football fans scratching their heads. Once regarded as the best German coach by Jurgen Klopp, Rangnick left his spell at Old Trafford with a measly 38% win rate.\nHowever, his coaching reputation in Germany is more positive. He set Ulm on course for promotion to the Bundesliga for the first time, as well as enjoying time at Stuttgart, Hannover, Hoffenheim, Schalke and RB Leipzig. His involvement with the latter was part of a lengthy association with Red Bull's football arm, ultimately becoming head of sport and development for of all the brand's clubs. He was appointed Austria head coach upon leaving Manchester in the summer of 2022.\nSchalke proved very successful for Rangnick, winning the DFB-Pokal and reached the Champions League semi-finals under his guidance in 2011. He may yet prove a fruitful option for Bayern, as they look to knock Bayer Leverkusen off their throne and reclaim the Bundesliga title next season.",
  "word_count": 415,
  "scraped_at": "2026-02-14T01:56:51.545385",
  "_text_extracted": true
}