{
  "article_id": "e8d931c1a527",
  "url": "https://www.teamtalk.com/news/jorrel-hato-real-madrid-ajax-summer-bid-liverpool-competition",
  "title": "Real Madrid transfers : Plan to sign £33m  sublime  Liverpool centre - back target and pair him with Asencio revealed",
  "date": "20250216T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid plot sensational summer signing of ‘sublime’ Liverpool centre-back target\nReal Madrid are planning to make a bid for Jorrel Hato in the summer transfer window, with a report in Spain revealing Los Blancos’s plan regarding the Ajax central defender and Raul Asencio as the defending Spanish and European champions plot to deal Liverpool yet another transfer blow.\nWhile Madrid are the defending Spanish and European champions and have one of the best squads in the world, there is a need for Los Blancos to address their defence in the summer transfer window. Eder Militao is on the sidelines at the moment, Antonio Rudiger is 31 and David Alaba is a year older and has had serious injury problems.\nIt has been so bad for Madrid this season that head coach Carlo Ancelotti has had to play Aurelien Tchouameni in defence despite the Frenchman being a midfielder by trade.\nThe Spanish giants are on the hunt for new centre-backs, and, according to Fichajes, they have identified Hato as a major target.\nLos Blancos have been impressed with how the defender can operate as a centre-back and left-back and can also contribute to attack.\nIn the 2023/24 season, Hato played 36 matches as a centre-back, but so far this campaign, he has operated predominately as a left-back, scoring three goals and providing four assists in 33 appearances in that position.\nMadrid’s interest in Hato has intensified in recent weeks, with the European powerhouse now ready to pay €40million (£33.3m / $42m) plus bonuses to secure his services in the summer transfer window.\nThe LaLiga leaders would also be willing to include one of their players in a potential deal for Hato, who has been described in Goal as “the archetypal modern defender” who is “technically sublime” and possesses “a football IQ that defies his tender years”.\nMadrid’s long-term plan for Hato is to play him alongside Raul Asencio in central defence.\nAsensio, 22, has emerged as an important player for Ancelotti this season and has done admirably well when he has turned out for Los Blancos.\nMadrid’s reported plan to bid for Hato will come as a blow for Liverpool, who too are keen on the Ajax star.\nTEAMtalk’s transfer correspondent Rudy Galetti reported last month that Liverpool have been looking at a summer deal for Hato but were considering making a late bid for him in the January transfer window.\nSources have also told TEAMtalk that Chelsea have taken a shine to Hato as well.\nREAD MORE ➡️ Free agents: The three best unattached players available in each position\nTrent Alexander-Arnold demands to Real Madrid\nNot only could Madrid stop Liverpool from strengthening their team in the summer transfer window by signing Hato, but the Spanish giants could also weaken the Reds by securing the services of Trent Alexander-Arnold.\nAlexander-Arnold is out of contract at Liverpool at the end of the season, and TEAMtalk understands that Madrid are determined to sign him on a free transfer.\nAlthough Liverpool have not given up hope of convincing Alexander-Arnold to put pen to paper on a new deal, Madrid are growing in confidence of reaching an agreement with the right-back.\nFichajes has reported that Alexander-Arnold has told Madrid that he wants a guaranteed annual salary of €10million (£8.3m / $10.5m) if he is to move to the Santiago Bernabeu.\nLos Blancos are reportedly stepping up their efforts and hope to complete a deal for the England international right-back as soon as possible.\nLatest Real Madrid news: Haaland injury update, Koulierakis interest\nMadrid will take on Manchester City at the Santiago Bernabeu in the second leg of the Champions League Knockout Round playoff tie on Wednesday evening.\nWhile Erling Haaland suffered an injury scare late in the Premier League game against Newcastle United on Saturday, the Norway international striker made an uplifting post on Instagram after the match, which suggests that he will be fine to feature against Los Blancos in Spain.\nMadrid have been linked with Konstantinos Koulierakis and are reportedly ready to make a move for the VfL Wolfsburg defender in the summer transfer window.\nWhile Los Blancos are still keen on a deal for Arsenal and France international centre-back William Saliba, the defending Spanish and European champions believe that Koulierakis is “a more accessible alternative”.\nLiverpool and AC Milan are also claimed to be interested in the 21-year-old Greece international centre-back.\nMeanwhile, Madrid are in danger of losing Rodrygo to Man City in the summer transfer window.\nMan City are reportedly interested in a deal for Brazil international forward Rodrygo, who was the subject of a world-record bid from the Saudi Pro League in the January transfer window.",
  "word_count": 778,
  "scraped_at": "2026-02-14T01:49:18.061073",
  "_text_extracted": true
}