{
  "article_id": "e8e75eed73fd",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=328527",
  "title": "TNT Sports & UNINTERRUPTED Partner in Development of New Show – Above the Fold with Jemele Hill – Debuting October 22 on truTV",
  "date": "20241021T193000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "TNT Sports & UNINTERRUPTED Partner in Development of New Show Above the Fold with Jemele Hill Debuting October 22 on truTV\nTNT Sports & UNINTERRUPTED Partner in Development of New Show Above the Fold with Jemele Hill Debuting October 22 on truTV\nThe Weekly Sports Magazine Series Will Focus on Diverse Stories Inside the Sports World\nTNT Sports and UNINTERRUPTED today announced a partnership to develop a new show that will be part of the TNT Sports on truTV programming lineup beginning later this week. The weekly show featuring acclaimed journalist Jemele Hill will delve into important stories and topics centered on the connection between sports and culture.\nThe weekly sports magazine series, Above the Fold with Jemele Hill debuting Tuesday, Oct. 22, at 5 p.m. ET on truTV will deliver a comprehensive and engaging exploration of diverse stories inside the sports world. The 60-minute show will feature Hill and a rotating lineup of correspondents who will discuss and debate the latest news surrounding some of the biggest and most relevant sports stories of the week.\nHill has previously appeared as a guest correspondent on TNT Sports The Arena, the in-depth storytelling franchise that offered thoughtful discussion centered on events taking place on and off the court during the 2020-2021 NBA season.\nIm very excited to be working with TNT Sports and UNINTERRUPTED on a project that centers sports journalism and compelling storytelling, said Hill. The sports media landscape is constantly evolving, but there is always room for nuance, depth and perspective.\nFollowing the debut of Above the Fold, the series will air each Thursday, beginning at 7 p.m. on truTV.\nAs we develop the TNT Sports on truTV programming lineup, were excited to partner with UNINTERRUPTED and Jemele to create a show that will be entertaining, insightful and thought-provoking, said Craig Barry, Chief Content Officer, TNT Sports. Jemele is an influential voice within the sports community and has a unique lens. We are looking forward to building a platform to share meaningful and compelling perspectives with our fans.\nTNT Sports and UNINTERRUPTED will continue to partner on the development of additional projects to be announced at a later date.\nUNINTERRUPTED is a big fan of Jemele Hill, and given our previous work with her, we know audiences are in for a treat as she shares her unique perspective on sports and culture, said Jamal Henderson, Chief Content Officer, The SpringHill Company. \"As a brand founded on providing a platform for diverse voices of athletes and their interests, were excited to partner with TNT Sports on truTV to bring this series to audiences every week\"\nThe new TNT Sports on truTV programming block weeknights at 6 p.m. ET officially launched earlier this month, featuring an expanded, consistent lineup of live sports, altcasts, original series, unscripted competitive shows, sports movies and more. TNT Sports on truTV live sports coverage includes the MLB Postseason, NBA, NHL, U.S. Mens and Womens Soccer, NASCAR, Roland Garros, Mountain West football, BIG EAST mens and womens college basketball, among others.\nTNT Sports will televise nearly 1,000 hours of sports programming on truTV in 2024 with plans to significantly increase its volume in 2025.\nJemele Hill will serve as Executive Producer. Executive Producers for UNINTERRUPTED are LeBron James, Maverick Carter, Jamal Henderson and Philip Byron. Joe Braswell and Steve Barry are executive producing on behalf of Kelchris who have an overall deal with The SpringHill Company. Camille Maratchi and Amy Glickman Brown are Co-Executive Producers for UNINTERRUPTED.\nUNINTERRUPTED\nUNINTERRUPTED is the award-winning athlete storytelling brand, within The SpringHill Company (TSHC), founded by LeBron James and Maverick Carter, that combines revolutionary content, experiences and consumer products. Since 2015, the UNINTERRUPTED brand has existed to partner with athletes to invite the sports community to celebrate the humanity in sport through culturally connected content. UNINTERRUPTED original content properties and franchises include Top Class, Iman Amongst Men and more. The award-winning studio team for the UNINTERRUPTED brand develops and produces high-quality sports-centered television, film, and theatrical releases with the biggest creators, brands and platforms in the world. All UNINTERRUPTED studio projects are empowerment led, where content isnt simply to entertain, but to inspire with thought-provoking themes, conversations and journeys. Studio projects within the unscripted and documentary space for UNINTERRUPTED include Starting 5, Untold: Sign Stealer, Whats My Name: Muhammad Ali, Greatness Code, Top Class, Golden: The Journey of USAs Elite Gymnasts, The Redeem Team and more. For more information visit www.uninterrupted.com and follow @UNINTERRUPTED on social media.\nAbout TNT Sports\nTNT Sports is a global leader in the delivery of premium sports content. The TNT Sports U.S. portfolio includes expansive, multi-platform partnerships with the National Basketball Association, Major League Baseball, the NCAA Division I Mens Basketball Championship, National Hockey League, United States Soccer Federation, NASCAR (coming in 2025) and a premier golf franchise in The Match. Owned and operated platforms are highlighted by Bleacher Report, the #1 digital destination for young sports fans, along with House of Highlights, HighlightHER, Golf Digest, and a full suite of digital and social portfolio brands. Additionally, TNT Sports co-manages NBA Digital comprised of NBA TV, NBA.com, NBA LEAGUE Pass, the NBA App and NBAGLEAGUE.com as well as NCAA.com and NCAA March Madness Live. TNT Sports in Europe and the Republic of Ireland includes partnerships with the NBA, Premier League, UEFA Champions League, UEFA Europa League, UFC, WWE and more, as well as much-loved brands Eurosport, Global Cycling Network (GCN), Global Mountain Bike Network (GMBN) and multi-sport programming and content on discovery+ and Discoverys free-to-air TV networks.\n( Press Release Image: https://photos.webwire.com/prmedia/8/328527/328527-1.jpg )\nWebWireID328527\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 951,
  "scraped_at": "2026-02-14T01:49:08.086345",
  "_text_extracted": true
}