{
  "article_id": "e90759f4ef56",
  "url": "https://www.caughtoffside.com/2024/10/27/man-city-pedro-porro/",
  "title": "Pedro Porro : Man City view Spurs star as future Kyle Walker replacement",
  "date": "20241027T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City are looking for a long-term replacement for Kyle Walker and have reportedly identified Spurs’ Pedro Porro as a possible target.\nThe 25-year-old full-back was on City’s books for three years between 2019 and 2022. The Spaniard failed to make a single appearance for the club before eventually joining Sporting Lisbon in a deal worth just £7.2 million.\nSigning for Spurs 12 months ago though, Porro has found himself back in the Premier League and has wasted no time in reminding City what they lost.\nArguably Ange Postecoglou’s most important player, Porro’s exciting style of play has seen him impress at both ends of the pitch. The Don Benito-born full-back has already registered 18 direct goal contributions in his first 63 games in all competitions.\nMan City identify Pedro Porro as possible Kyle Walker replacement\nAnd although the right-back is under contract with Spurs until 2028, according to a recent report from Football Insider, concerns are mounting that City are preparing a ‘big offer’ to re-sign their former defender.\nEven though Spurs won’t want to lose the 25-year-old, Daniel Levy has a history of trading his best players with City… Kyle Walker is the perfect example.\nJoining the Cityzens in 2017 in a deal worth £50 million, the now-34-year-old has lifted 15 major trophies, including six Premier League titles and the 2022-23 Champions League.\nThis season is likely to be the Englishman’s last at the Etihad though. He is out of contract in 18 months and is a top target for Saudi Pro League side Al-Ahli.\nWhether or not Porro follows suit and becomes the second Spurs right-back to join City remains to be seen.\nHowever, with suggestions the Spain international is wanted by some of Europe’s biggest clubs, also including Real Madrid, Spurs fans will be wondering just how much longer the club can keep hold of the in-demand full-back.",
  "word_count": 312,
  "scraped_at": "2026-02-14T01:51:57.638336",
  "_text_extracted": true
}