{
  "article_id": "e93189d8dfec",
  "url": "https://www.newcastleherald.com.au/story/8691043/newcastle-jets-face-mariners-in-f3-derby-during-unite-round/?cs=305",
  "title": "Newcastle Jets face Mariners in F3 derby during Unite Round | Newcastle Herald",
  "date": "20240710T103000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THE Newcastle Jets will play arch rivals Central Coast Mariners in an F3 derby in Sydney.\nSubscribe now for unlimited access.\nor signup to continue reading\nAustralia Professional Leagues confirmed on Wednesday that the oldest derby in the competition will be one of two feature fixtures during Unite Round on November 22-23.\nSimilar in concept to the NRL's Magic Round and the AFL's Gather Round, Unite Round debuted last season.\nAll six of the men's games will be played at Allianz Stadium, with all the women's matches to be held at Leichhardt Oval.\nThe Jets will take on the defending champions on Friday night and the Sydney derby between the Sky Blues and Wanderers will be the feature match on the Saturday night.\nThe rest of the A-League draw is yet to be released.\nThe Mariners were to host the Jets twice this season. One game will now be played in Gosford, Newcastle and Sydney.\n\"The fact the APL have taken an F3 derby to Unite Round is proof that it is one of the greatest rivalries in the A-League,\" Jets chief executive Shane Mattiske said. \"It demonstrates the passion which has been built between the teams. The timing of the game is not ideal. We would love to see our fans in Sydney to support us and are talking to the APL about what assistance they can provide with travel and accommodation offers.\"\nThe F3 derby is being played on the Friday to give the Mariners time to prepare for an Asian Champions League Elite match on Tuesday, November 26.\nOne of the figures behind the Mariners' success, Ken Schembri, has been appointed the Jets' new General Manager of Football.\nSchembri will work closely with head coach Rob Stanton on recruitment for the A-League roster.\nHe will also oversee the academy and identify talent in and outside the region.\nThe Mariners are regarded the best in the country at identifying and developing talent and have sold more than 10 players overseas in the past two seasons.\n\"Ken's appointment recognises the intent of the new owners of the club and the willingness to support the development of youth,\" Mattiske said.\n\"He will work alongside Damien Zane on the boys side to identify talent within our academy and in the region more generally.\n\"In addition to supporting our own talent, he will also have a line of sight of other talent out there in the system that we should be looking at.\"\nMeanwhile, Newcastle Jets attacker Lachy Bayliss has been named as alternate in the New Zealand squad for the Paris Olympics.\nBayliss flies to France on Sunday for a training camp in Niece.\nAlthough not in the nominated 18-man squad for the Games he could be drafted in. He is one of four players who will stay with the squad for the duration of the Games.\n\"The coach Darren Bazeley told me at the last Olympics, the alternate players were able to play. I'm hoping that is the case this time.\n\"He hasn't seem a lot of me. This will be my first camp. I'm hopeful after a week of training he realises I am good enough to contribute.\n\"I go over their to do my best, enjoy the experience and see what happens. I stay with the squad the whole time.\"\nBayliss had his mind on going with the Jets to Darwin, where he spent his formative years, for the Australia Cup qualifier against Western United when he received the call from Beazley.\n\"I got the call four or so days ago. I was organising all my Darwin connections. It was a bit of a shock. I'm excited for the opportunity. I will get to see different parts of the world and hopefully play a bit of footy.\"\nBayliss was born in Sydney but qualifies for New Zealand through his dad.\nNew Zealand kick off their Paris campaign against Guinea on July 25 in Nice, before facing the USA (July 28) and France (July 31), both in Marseille.",
  "word_count": 669,
  "scraped_at": "2026-02-14T02:20:39.358434",
  "_text_extracted": true
}