{
  "article_id": "e938e1977820",
  "url": "https://www.arsenalinsider.com/news/arsenal-loanee-forced-off-with-injury-in-derby-victory-he-could-be-sidelined-for-a-while/",
  "title": "Arsenal loanee forced off with injury in derby victory , he could be sidelined for a while",
  "date": "20231001T140000Z",
  "domain": "arsenalinsider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal loanee Kieran Tierney has now been dealt a blow, as he was forced off in Real Sociedad’s victory over Athletic Club.\nThe Scotland international joined La Real on loan for the season in order to gain more regular playing time, and had started well in Spain.\nHowever, the 26-year-old, who has struggled with injuries since his move from Celtic four years ago, is likely to be sidelined again with a potential hamstring issue.\nTierney forced off with injury\nFootball Scotland have now reported that Tierney could be set for a spell on the sidelines, having been withdrawn in the 25th minute of the Basque Derby after pulling up with a suspected hamstring issue.\nIt has now been claimed that he could miss Scotland’s trip to Spain in the next international break because of his injury, and with Champions League games also coming up for his club, he will be gutted to be sidelined again.\nTierney’s injury record\nThe defender missed an astonishing 48 games through injury during his time at Arsenal, and despite showing his immense quality at times, could not stay fit for long enough to keep his first team spot.\nWhilst he could have been a useful squad option this season, particularly given Arsenal’s lack of depth, his latest injury shows why Mikel Arteta felt he could not rely on Tierney.\nIf he can make a speedy recovery to play an important part for Imanol Alguacil’s side for the rest of the season, then he may still have a future at Arsenal.\nTierney’s quality was never in question, but his tactical fit under Arteta and his poor injury record prevented him from fulfilling his vast potential in North London, and this latest setback will be frustrating for him as he was aiming to build on his positive start in Spain.",
  "word_count": 303,
  "scraped_at": "2026-02-14T02:00:57.117883",
  "_text_extracted": true
}