{
  "article_id": "e93c1755415a",
  "url": "https://metro.co.uk/2023/12/26/tim-sherwood-names-two-players-man-utd-shouldve-signed-this-summer-20027253/",
  "title": "Tim Sherwood names two players Man Utd shouldve signed this summer | Football",
  "date": "20231226T203000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tim Sherwood has named two players Manchester United should’ve signed in the summer transfer window and wants manager Erik ten Hag sacked.\nThe Red Devils have struggled this term and find themselves eighth in the Premier League, while they finished bottom of their Champions League group.\nDutch boss Ten Hag has faced criticism over a number of issues, including his recruitment, with the arrival of Antony for £86m seen as a particular bad buy.\nAmid United’s terrible run of form, with the team failing to score in four games and suffering a 3-0 home defeat to AFC Bournemouth, Ten Hag is under more pressure than ever and Sherwood thinks the time has come to bin him off.\n‘I would have said two seasons ago that Tottenham needed a big clear out, but now they have a manager who is getting the best out of the individual players,’ Sherwood told Sky Sports.\n‘They can’t all leave. They need to get rid of someone. What Tottenham did was change their manager, and the manager they brought in (Ange Postecoglou) has been the right answer.\n‘That’s what’s got to happen at Manchester United. They need to change the man who is not getting the best out of the individuals on the pitch.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nMore Trending\nUnited were linked to England superstars Harry Kane and Declan Rice this summer before they joined Bayern Munich and Arsenal respectively and speaking about the club’s transfer business, Sherwood added: ‘Why on Earth did they not push the boat out to sign Harry Kane?\n‘I know I sound like a broken record but players like Harry Kane and Declan Rice would have improved a lot of players at that football club and they would have made the manager look better as well.\n‘They have an idea of what they are doing on the pitch. These lot have just been thrown on the pitch, wherever they land, they just like to play. It’s not good enough.’\nMORE: Belgian wonderkid Arthur Vermeeren responds to Man Utd transfer links\nMORE: Sir Jim Ratcliffe's message to Manchester United supporters group revealed",
  "word_count": 402,
  "scraped_at": "2026-02-14T01:56:38.137788",
  "_text_extracted": true
}