{
  "article_id": "e93c4bc59241",
  "url": "https://cartilagefreecaptain.sbnation.com/2025/5/27/24437312/should-ange-stay-or-should-ange-go",
  "title": "Should Ange stay , or should Ange go ? ",
  "date": "20250527T140000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s impossible to deny how bizarre the 2024/25 season has been for Tottenham Hotspur Football Club. In some ways, 17 has been the number of the season, with the club breaking its 17-year trophy drought (while setting a record for most home losses in a season that did not end in relegation); finishing 17th in the Premier League (despite scoring 64 goals); and Spurs’ #17 Cristian Romero being named Europa League player of the season (despite only appearing in seven of the club’s 15 fixtures).\nShould Ange stay, or should Ange go?\nAsking the tough questions\nBesides the number 17, there’s another thematic constant in those statistics: it’s been a season of contrasts.\nIt’s no wonder, then, why there are questions over Ange Postecoglou’s future as head coach. Some want him gone: league form dictates firing him is a no-brainer. Others want him to stay: winning the Europa League and bringing untold joy back to the club means he should be knighted and given every resource at the club’s disposal in order to succeed next season.\nMy stomach hurts.\nNot to worry, though! We here at Carty Free Towers are here to cut through all the noise and tell you what to think. Or maybe we need you to tell us what to think... because despite regular accusations of “masthead groupthink” (okay guys, the meta stops now) it turns out we’re not even in agreement on this either. Here are our takes, and feel free to make your voice heard in the poll or comments below.\nAnge In - Dustin George-Miller\nThere are several reasons why I’m still Ange-In. First, Ange has quietly addressed nearly every criticism that has been lobbed at him since his arrival, from the high line to accusations that he doesn’t adapt his tactics. He successfully focused this deeply flawed team and adapted his tactics masterfully in the Europa League, leading Spurs to their first trophy in 17 years and first European title in 41.\nSecond, while the league form has been wretched, there have been massive caveats. It’s now clear in retrospect that this current Spurs team was not equipped, either in depth or talent, to compete in four competitions. Add in the worst injury crisis I’ve seen in my time as a fan and it feels like we haven’t yet seen what Ange can actually do. His revelation that he abandoned the Premier League to laser focus on winning the Europa League this season now feels like a master stroke, even if it came with a very different style of football to what Ange actually wants to play.\nAnd finally, Ange is just a breath of fresh air. Yes, he can be tetchy at times, a little grouchy towards the media and irrationally angry supporters. But he is a supremely gifted communicator and genuinely cares about his players and the football club. He’s maybe the only Spurs manager in my fandom who actually seems to get what it means to be a Tottenham Hotspur fan. After several years of managers like Mourinho and Conte, is it wrong to want to stick with a manager who is a supremely good guy?\nLook, Ange still has a lot to prove with me. He needs backing and support, yes, but he also needs to prove that his preferred tactics will work in the Premier League. There are big questions. But after winning our first trophy in 17 years, he’s earned the right to give it one more go. If things don’t improve, I’ll join the group that will want to wish Ange well and move on. But I’m not there yet. Ange needs a summer of real support and a chance to show what he can do in the third season. After that, come what may.\nAngenostic - Matty Flatt\nI’m a coward. Conviction escapes me, and I find myself sitting painfully on a chain-link fence.\nThere’s a lot to love about what Ange Postecoglou has brought to this football club; and there’s a lot to dislike. It cannot be overstated just how good it feels to have broken the club’s trophy drought; I shed tears at fulltime last week, and Ange has had no small part of that success. At the same time, it’s hard to ignore the spiralling league form, the injuries, and the lack of succesful alternative ideas to Ange-ball.\nWhat it comes down to for me is that it just feels like there is no good option here. I’m not convinced Ange Postecoglou has the tools to maximize the squad talent he will get (which is not a huge amount), and I can see Spurs floundering on all fronts as the club is forced to balance a Champions League campaign with challenges in the league. Conversely, the optics of immediately firing Spurs’ first trophy winning coach in 17 years are horrendous, and anybody who would come in to fill that void would immediately be placed under immense pressure, putting that person and the club in a no-win position.\nThe thing that really concerns me though is Spurs’ front office. The managerial market isn’t exactly packed with available quality options right now, indicating perhaps stability is the best approach, and I’m not convinced the powers-that-be have the nous to identify any diamonds in the rough. Scott Munn, the man who in large part was responsible for appointing Ange Postecoglou, is by all acounts on his way out of the club; Spurs now have a new CEO in the form of Vinai Venkatesham; Fabio Paratici is reportedly rejoining the club in some sort of capacity; and Johan Lange’s role in this new hierarchy is murky at best.\nDo you remember Fabio Paratici’s last managerial search? I do. Paulo Fonseca seemed a leading candidate before being dismissed as “too attacking”, after which Paratici settled on Gennaro Gattuso as his preferred option - a hugely problematic hire for a number of reasons (including the fact that he is not very good and is now managing in the Croatian league) - before only fan pressure swayed the Italian’s hand, resulting in the appointment of the dour Nuno Espirito Santo, who barely made it half a season.\nDo I think Ange is the man to take Spurs to the next level? No. Do I trust the Spurs decision makers to appoint somebody who will? Not really. So here I sit, between a rock and a hard place, just waiting for the club to make a call on my behalf.\nAnge Out - Ben Daniels\nEditor’s note: And a special welcome back to our very own Lennon’s Eyebrow and Wheeler Dealer Radio extraordinaire, who unlike me is not a coward and was more than happy to wear the vitriol from our lovely commentariat.\nBefore the Europa League final Ange had delivered the worst domestic season in our history with a record number of league losses so staggering that no team in the Premier League has ever survived them. He coached a team that largely played insipid football, lacked any tactical identity beyond “run fast,” couldn’t balance multiple competitions, and suffered an injury crisis severe enough it’s hard to imagine he’s not at least somewhat responsible for it. Firing him would have been the least controversial decision an owner has ever made. If a comparable club were looking to hire a manager this season, few would see Ange’s resume at Spurs as worthy of consideration. But then warra trophy.\nFootball has a short memory, and success is nothing if it’s not sustained. I remember what a significant milestone it was when Martin Jol brought us back to the UEFA Cup, and in less than a decade it became a tournament most fans felt was beneath us. I remember Juande Ramos winning the League Cup, a trophy many fans once turned their noses up at as a Mickey Mouse trophy, and in hindsight became the only one we could point to for 26 years. I remember Harry Redknapp sending us to the Champions League, and how quickly that went from our biggest accomplishment to an annual expectation. I remember Mauricio Pochettino reaching a Champions League final, and instead of it being the dawn of the greatest era in our history, it was its death knell. All of these men delivered success, left shortly thereafter, and the club has gone on to new heights that made their achievements seem smaller.\nAfter six years of steady decline, and seventeen without silverware, Ange Postecoglou delivered a European trophy and qualified for the Champions League. The success of this victory is undeniable, but no matter how good we feel today the memory of this glorious moment will soon fade. The only question is whether Ange can take us the next step, because in football all that matters is what we do next.",
  "word_count": 1466,
  "scraped_at": "2026-02-14T01:55:13.640426",
  "_text_extracted": true
}