{
  "article_id": "e97ffaa066f7",
  "url": "https://www.soundersfc.com/news/sounders-look-to-continue-leagues-cup-run-beginning-with-round-of-32-on-thursday-night",
  "title": "Sounders look to continue Leagues Cup run on Thursday night , bounce back from loss against Necaxa",
  "date": "20240808T033000Z",
  "domain": "soundersfc.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sounders FC continues its run for the club’s first-ever Leagues Cup title on Thursday night when the team hosts the LA Galaxy in the Round of 32 at Lumen Field (7:30 p.m. PT; Watch on MLS Season Pass on Apple TV, FS1, 950 KJR AM, SiriusXM FC, El Rey 1360AM, Sirius Channel 999 | TICKETS).\n“It should be an exciting contest,” said Head Coach Brian Schmetzer.\nSeattle lost 3-1 in its final group stage match against Club Necaxa on Sunday, but with the prior win over Minnesota United, the squad managed to advance to the knockout rounds.\nThe loss over Necaxa was a learning experience for the Rave Green; while there were positives that came from the first 15 minutes of play with Obed Vargas scoring his first tournament goal and Pedro de la Vega nearly tallying another before it was called back, the team fell “out of sync” shortly after, according to Schmetzer.\nMidfielder Albert Rusnák added, “We’re not panicking after the Necaxa game, but there is stuff that we need to improve on.”\n“With a couple of video sessions, we have learned and seen the bad stuff that we did and [now,] we have another opportunity to fix it.”\nIn better understanding the drop-off that occurred in the previous match, the Rave Green are determined to flip the narrative tomorrow night and push past the Galaxy with a positive result.\nAs the Sounders enter the stretch run of the year still in content for several trophies across competitions, every match matters.\n“The standard in this football club is to win games,” said Rusnák. “Whether it's MLS, Open Cup, Champions League, or Leagues Cup, we want to win the game. We're at home and we have to be the aggressor with the ball.”\nUnlike competing against Liga MX teams, the Galaxy are familiar territory for Seattle. In the 2024 season alone, the two teams have gone head-to-head twice in regular season play, with the first ending in a 1-0 loss for Seattle and the second finishing in a scoreless draw.\n“In the game we played against them in LA and the game at home, I think we were on top and should have gotten better results than we did,” said midfielder Obed Vargas. “We know them, and hopefully, we're ready to beat them this time.”\nIt’s a make-or-break match with the team entering the single-elimination portion of Leagues Cup. The stakes are higher than a typical match, but Schmetzer is not expecting his opposition to adjust any serious tactics given its strong run of form thus far this season.\n“I don't think Greg [Vanney] is going to change the way he plays, said Schmetzer. “He's had a successful start to his year.”\nSchmetzer feels the same about his team.\n“As far as knockout games are concerned, we're not going to change either,” said Schmetzer. “I think we have a good team, so we're going to try and play to win…We're at home.”\nSchmetzer’s confidence in the group also comes with ensuring they recognize the threats on the Galaxy side. The Galaxy’s front four of Joseph Paintsil, Riqui Puig, Gabriel Pec and Dejan Joveljic is among the league’s best, combining for 38 goals and 35 assists in the regular season thus far.\n“We will have to play better defensively against the galaxy because they are a good attacking team,” said Schmetzer. “But we also know that their Achilles heel is sometimes their defending, so we have to have the right balance of making sure we're good on defense, but we want to transport two or three goals.”\nThe task is simple for the Sounders: Win on Thursday and get one step closer to lifting a trophy they’ve never won before. The team feels confident in their preparations for the match, but in order to play to their full potential against a star-studded opponent, they’ll need to feed off the energy of the fans at Lumen Field.\n“I'm expecting a decent amount of people to show up for the game and help us to go past this round and then go further in this competition,” said Rusnák.",
  "word_count": 686,
  "scraped_at": "2026-02-14T02:10:58.959953",
  "_text_extracted": true
}