{
  "article_id": "e98caeacdb11",
  "url": "https://www.barcablaugranes.com/barcelona-uefa-champions-league/99935/barcelona-champions-league-schedule-released-psg-chelsea-newcastle",
  "title": "Barcelona Champions League schedule released , including marquee matchup against PSG",
  "date": "20250830T153000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After the draw for the Champions League’s opening stage was made on Thursday, UEFA have released the full fixture list for the competition’s League Phase which begins next month, and Barcelona now know their exact schedule in Europe’s top tournament.\nBarcelona’s Champions League schedule released, including marquee matchup against PSG\nThe fixtures are official\nThe Blaugrana will kick things off on Thursday, September 18 with a trip to the iconic St. James’ Park to face Eddie Howe’s Newcastle, in what could be Barça’s toughest away game of the entire League Phase. The second trip to England to face Club World Cup champions Chelsea is scheduled for November 25.\nThe much-anticipated clash with European champions Paris Saint-Germain is scheduled for Matchday 2 on Wednesday, October 1 in Catalonia, meaning we won’t have to wait too long at all to watch the marquee matchup of the entire League Phase and the Champions League Final we were all robbed of last season.\nA game to watch on the European calendar is always the one before El Clásico, and Barça get lucky this time as they won’t have to travel and will play Olympiacos at home on October 21.\nBarça finish the League Phase at home to Roony Bardghji’s former club Copenhagen, and the hope is that Barça will have already wrapped up a Top 8 finish by then and will be fighting to guarantee a Top 2 seed and have second leg home games throughout the knockout rounds.",
  "word_count": 245,
  "scraped_at": "2026-02-14T02:15:40.832639",
  "_text_extracted": true
}