{
  "article_id": "e9935ac0ee3b",
  "url": "https://punchng.com/wafu-obaseki-hails-finalists-edo-queens/",
  "title": "WAFU : Obaseki hails finalists Edo Queens",
  "date": "20240821T021500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Edo State Governor, Godwin Obaseki, has congratulated Edo Queens for securing a place in the finals of the CAF Women’s Champions League WAFU Group B Qualifier, after defeating FC Inter D’Abidjan of Ivory Coast 2-1 in their semi-final match on Tuesday.\nEdo Queens took an early lead in the semi-final encounter thanks to Emem Essien, while Blessing Illivieda doubled the advantage before the hosts reduced the deficit.\nThe Nigeria Women Football League champions have been impressive in the tournament, winning their group with a 100 per cent record and the winner of the competition will pick the only slot for WAFU B at the 2024 CAF Women’s Champions League in November.\n“I congratulate Edo Queens for their victory today in Ivory Coast against FC Inter. Our girls dominated the game and gave a good account of themselves, dictating the pace of the game and holding on to the last minute.\n“They were spectacular today, keeping up with the pace from the beginning of the tournament. They have remained unbeaten and are today heading into the finals with much confidence. I celebrate their genius and want to tell them that every girl child in Edo today is proud of their performance.\n“As they continue with the laudable display at the WAFU Zone B CAF Women’s Champions League qualifiers, we are reassured of their resolve to come out victorious in the finals and ultimately make a loud statement on the continental stage.”\nEdo Queens are aiming to become the third Nigerian team to feature in the tournament introduced in 2021 after Rivers Angels and Bayelsa Queens.",
  "word_count": 264,
  "scraped_at": "2026-02-14T02:08:01.866317",
  "_text_extracted": true
}