{
  "article_id": "e9af7bbd8fd0",
  "url": "https://www.fourfourtwo.com/news/chelsea-priced-out-of-manuel-ugarte-move-despite-uruguayan-preferring-blues-transfer-report",
  "title": "Chelsea priced out of Manuel Ugarte move , despite Uruguayan  preferring  Blues transfer : report",
  "date": "20230605T153000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea priced out of Manuel Ugarte move, despite Uruguayan 'preferring' Blues transfer: report\nChelsea have refused to match the financial package that PSG offered to Sporting midfielder Manuel Ugarte – who actually wanted to go to the Premier League as his first preference\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nChelsea have pulled out of a move for Manuel Ugarte – despite the player wanting to go there over Paris Saint-Germain.\nThe Sporting midfielder has enjoyed a solid season both in the Primeira Liga and in Europe, with manager Ruben Amorim resigned to losing him this summer. Ugarte has a release clause of somewhere around £60 million and a host of top clubs have been tracking him for months.\nWhile Newcastle United were said to be in the mix at one stage, Mauricio Pochettino was reported as wanting the Uruguayan as his first signing, with PSG rivalling Chelsea for the signing. Now, The Guardian says that the Blues have pulled out.\nAccording to the report, Chelsea have refused to match PSG's financial package in order to make a deal happen. This tallies up with what Ben Jacobs of CBS Sports told FourFourTwo on June 1 about the situation at the end of last week.\n“With incomings, Manuel Ugarte is one serious target for Chelsea,” Jacobs said. “PSG are in that race as well and I think both clubs feel like the release clause of €60 million is pretty fair market value. Neither plan on triggering it: both are going to present options that are structured to that valuation but with different payment terms, and it’ll come down to Ugarte.\n“But the package PSG have offered is bigger, it’s healthier: at least one-and-a-half, if not two times bigger than Chelsea have offered. I think that’s normal because Chelsea’s offers are factoring in a season without Champions League football and would go up in valuation if Chelsea get back in the Champions League.\n“It may well come down to whether Chelsea see value in proceeding and having to pay a little bit more and second of all whether Ugarte prefers a Premier League move or whether the lucrative package that PSG have offered is more beneficial. So he’s one to watch.”\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAccording to the Guardian, “Pochettino could switch his focus to other targets after missing out on Ugarte but a deal to sign Declan Rice is unlikely. Arsenal are favourites to sign the West Ham captain.”\nUgarte is valued at €25m by Transfermarkt.\nMore Chelsea stories\nChelsea have been linked with Sadio Mane, along with Paris Saint-Germain star Neymar, in a bid to improve their squad.\nRomelu Lukaku has also been mooted for a return to the squad, though outgoings are inevitable. Mason Mount is linked with a Premier League move, as N'Golo Kante may well join Arsenal.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 652,
  "scraped_at": "2026-02-14T01:48:17.239013",
  "_text_extracted": true
}