{
  "article_id": "e9c1a0710ab1",
  "url": "https://metro.co.uk/2025/01/09/mikel-arteta-needs-replace-arsenal-star-starting-annoy-me-22323982/",
  "title": "  Mikel Arteta needs to replace Arsenal star – he starting to annoy me  | Football",
  "date": "20250109T100000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Emmanuel Petit has identified the three signings Mikel Arteta needs to make in January to kick-start Arsenal’s season and admits he is getting ‘frustrated’ and ‘annoyed’ by Gabriel Martinelli.\nThe Gunners are struggling to show the consistency that enabled them to rival Manchester City for the Premier League title over the past two seasons.\nArsenal have dropped points in nine of their 20 league games to slip six points behind Premier League leaders Liverpool, who also have a game in hand.\nArteta’s side were beaten 2-0 by Newcastle United in the first leg of their Carabao Cup semi-final tie earlier this week, a great chance for silverware potentially slipping through their fingers.\nArsenal are being linked with a host of players during the January transfer window and ex-midfielder Petit believes they need to secure ‘at least’ three new signings.\nThe Gunners’ apparent need for a new striker has been well-documented, with Kai Havertz and Gabriel Jesus enduring inconsistent seasons and accused of ‘going missing’ in big games.\nArsenal are interested in signing Alexander Isak from Newcastle United but the Magpies have placed a whopping £150m price-tag on his head.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAs well as signing a new goalscorer, Petit believes his former club should also be looking to bring a left-winger and attacking midfielder to the Emirates Stadium.\nPetit admits he is growing frustrated with current winger Martinelli, who has only reached double figures once over the past five seasons and has missed a number of chances this term.\n‘Arsenal don’t just need a striker, I think they needed at least three or four more players last summer,’ Petit told DisCasino. ‘They still need a left-winger, a striker and an attacking midfielder.\n‘This January transfer market is tough, though. It will be very hard to find good opportunities to sign good players for a reasonable price.\n‘I don’t think it’s part of Mikel Arteta’s policy to sign players for an absurd amount of money.’\nTo bolster Arteta’s options on the wings, Petit has suggested his former club should sign wantaway star Marcus Rashford from Manchester United.\nRashford admitted he was ‘ready for a new challenge’ last month and has been tentatively linked with Arsenal, though he is expected to move abroad as he looks to revive his stuttering career.\n‘Marcus Rashford would be an interesting signing for Arsenal,’ Petit added.\n‘I’m very frustrated with Gabriel Martinelli’s performances at the moment, he’s very inconsistent and it’s annoying to watch. He’s been like a ghost on the pitch.\n‘Competition for a spot in the XI is important for Arsenal, look at Liverpool’s bench, the quality they have is amazing.\n‘I know Nico Williams has been linked, but I’m told he’ll never come to the Premier League if he leaves Athletic Bilbao, he’d only go to Barcelona.\n‘The Raheem Sterling gamble has not worked. Rashford, if he’s in the team and playing football in a good environment with a manager who trusts him, you will see the best of him.\nMore Trending\n‘Is that manager Mikel Arteta? If I’m him, I would definitely have an eye on that situation at Manchester United.\n‘He’s not the same player from two years ago, but we all know the level he can reach, quality like that doesn’t just disappear.’\nArsenal face a crucial period of the season, preparing to take on Manchester United in the FA Cup this weekend before a north London derby against Tottenham at the Emirates Stadium next week.\nThe Gunners then face top-four contenders Aston Villa before resuming their promising Champions League campaign as they bid for automatic qualification to the knockout stages.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Zlatan Ibrahimovic makes his decision on AC Milan move for Marcus Rashford\nMORE: Emile Heskey names Manchester United star as the ‘biggest flop of the season’\nMORE: Jobe Bellingham makes transfer decision amid Arsenal and Man Utd interest",
  "word_count": 713,
  "scraped_at": "2026-02-14T02:08:52.968606",
  "_text_extracted": true
}