{
  "article_id": "e9d9a0cc0d3d",
  "url": "https://www.nytimes.com/athletic/6119209/2025/02/06/sergio-ramos-contract-monterrey/",
  "title": "Sergio Ramos joins Liga MX side Monterrey on one - year deal",
  "date": "20250207T001500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sergio Ramos has joined Mexican club Monterrey on a one-year contract.\nEarlier on Thursday, The Athletic had reported the 38-year-old was set to join having agreed a deal with the Liga MX side.\nRamos had a medical this week and joins Monterrey on a fixed salary with bonuses. He will be the highest-paid player in the squad.\nAdvertisement\nThe former Real Madrid and Spain centre-back had been without a club since leaving Sevilla at the end of his contract last summer and has not played a professional game since May 2024. He had, however, been doing his own personal training to remain fit.\n🇪🇸🔥🏟️ pic.twitter.com/InbCl19Gce\n— Rayados (@Rayados) February 6, 2025\nDespite his former club Madrid, for whom he made more than 650 appearances between 2005-2021, having injury problems in defence this season, there was no contact from the club over a return for their former captain.\nLast month, Monterrey president Antonio Noriega said his club were in negotiations with the centre-back over a proposed move. Ramos last summer had been in talks with San Diego FC, of MLS. Monterrey are currently 10th in the Liga MX Clausura table after five games.\nRamos started his career with Sevilla before winning five La Liga titles and four Champions League titles with Real. He joined Paris Saint-Germain in 2021 and won two Ligue 1 titles before returning to Sevilla.\nHe also won the 2010 World Cup and the European Championships in 2008 and 2012 with Spain before retiring from international football in 2023 after 180 appearances.\nGO DEEPER\nWhy Sergio Ramos, for all his history at the club, is not what Real Madrid need right now\n(Alex Caparros/Getty Images)",
  "word_count": 277,
  "scraped_at": "2026-02-14T02:02:19.834764",
  "_text_extracted": true
}