{
  "article_id": "e9f1406a6f05",
  "url": "https://metro.co.uk/2026/01/20/proved-wrong-theo-walcott-says-arsenal-star-surprised-inter-win-26414453/",
  "title": "Theo Walcott says Arsenal star has  surprised  him after Inter win :  Proved me wrong  | Football",
  "date": "20260120T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Theo Walcott admitted that Leandro Trossard has proven him wrong this season as the Arsenal forward put in another accomplished display to help his side beat Inter 3-1 in the Champions League.\nA brace from Gabriel Jesus saw the Gunners continue their perfect record in the Champions League with a hard-earned victory at the San Siro, which also guarantees Mikel Arteta’s side a top-two finish in the league phase.\nJesus diverted Jurrien Timber’s effort past Yann Sommer to give Arsenal the lead, but Inter drew level only eight minutes later through Petar Sucic’s well-hit strike.\nBut Jesus headed home from close range after Leandro Trossard kept a set-piece alive impressively at the back post to restore Arsenal’s lead before Viktor Gyokeres put the game to bed with a goal off the bench.\nFor Trossard, the assist marked the Belgian’s 14th goal involvement in 27 appearances in all competitions this season, continuing his fine form after a summer which saw his long-term Arsenal future called into doubt.\nAnd Walcott insisted that Trossard’s form this season has ‘surprised’ him, with the former Arsenal winger also suggesting he was wrong to think he was a player Arteta should be trying to replace.\n‘There were rumours of Leandro Trossard moving on, and Martinelli as well,’ Walcott told Amazon Prime.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘That was a position I thought was up for grabs but they have proved me wrong.\n‘They’ve both really picked up their levels, they are both competing in a healthy environment as well. It’s been a kind of ‘I’ll score more than you’ but in a good way.\n‘Leandro Trossard is the player I’ve really been impressed with because he’s different to everyone else they have got on that left-hand side.\n‘Martinelli has pace, and you can’t teach that, but Leandro picks up spaces, and what I really like about him is he’s so calm.\n‘You’re not quite sure what you’re going to get from him, and he’s been so consisent and it’s really surprising.’\nAsked about Trossard’s performances this season, former Manchester United and England captain Wayne Rooney said: ‘I think Trossard, as Theo said, has been excellent this season and he’s a difficult player to pick up.\n‘He drifts into the number ten position, at times he stays out wide. He can use both feets and scores big goals, so I think he’s been excellent.’\nArsenal’s strength in depth was on show again, with Declan Rice, Gabriel Martinelli and Gyokeres all coming off the bench in the second half to see out the victory.\nMore Trending\nAnd speaking after the game, Arteta was pleased with how his entire squad chipped in, telling Amazon Prime: ‘Very proud of the team, obviously. We talked before the game that we needed a special performance, a very complete performance against a top side and we certainly done that tonight.\n‘The lineup was about trying to be better than them and we knew that we would have to navigate through different stages of the game.\n‘The way we manage the game, the way we control the game in a very good way and we knew that we were going to have to do that on the pitch and through the subs.’\nArsenal return to Premier League action at the weekend with the visit of Michael Carrick’s Manchester United.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Alan Shearer names team that will stop Arsenal from winning Champions League\nMORE: Wayne Rooney backs Arsenal signing to become ‘great player’ after mixed start\nMORE: ‘I would stay’ – David Seaman questions Arsenal star’s decision to leave in January window",
  "word_count": 667,
  "scraped_at": "2026-02-14T01:53:15.587833",
  "_text_extracted": true
}