{
  "article_id": "ea038501d637",
  "url": "https://www.teamtalk.com/liverpool/redknapp-questions-unnecessary-signing-names-starter-needs-replacing-big-spending-summer",
  "title": "Redknapp questions unnecessary Liverpool signing and names starter who needs replacing in big - spending summer",
  "date": "20230301T090000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nRedknapp questions unnecessary Liverpool signing and names starter who needs replacing in big-spending summer\nFormer Liverpool player Jamie Redknapp believes his old club are still capable of signing big names next summer, even if they miss out on Champions League qualification – and he has a couple of theories in mind as to how they could improve their squad.\nLiverpool have never been in the top four this season, putting their chances of qualification for the Champions League at serious risk. It has been a sharp downturn in their fortunes after they reached the final of that competition last term.\nMissing out on Champions League football would have a major impact on Liverpool both from a sporting and financial viewpoint. But they have a lot of ground to make up if they are to avoid that fate.\nEither way, in the summer, they will need to improve their squad. A few roles have been found to be deficient this season, which Liverpool might only be able to rectify by spending.\nIn that regard, their managing director has recently promised that some of their record-breaking revenues can be reinvested into their playing squad.\nBut not being in Europe’s top competition could have a detrimental impact on their ability to attract world-class players.\nAccording to Redknapp, though, Liverpool will still be a go-to destination for elite targets in the summer. Indeed, they can see how their rivals Man Utd strengthened after a sixth-placed finish last term to take some kind of inspiration.\n“They will still get the best, even if they don’t get top four,” Redknapp told Sky Sports. “Manchester United have never had that problem, buying the big players [when they’re struggling].\n“I think the owners will spend. I think they know what they need to do. I think if Jurgen Klopp didn’t believe that, he wouldn’t stay there either. I think they will, whether it’s these owners or investors.\n“They get a lot of stick, these owners, but they’ve backed the manager as well and he knows that. He’s never once complained about the players they’ve bought.”\nHowever, one complaint that Redknapp would refer to is whether Liverpool have identified the right areas to invest in recently.\nSpecifically, he questioned whether they needed to sign Cody Gakpo during the January transfer window. After all, they already were well stocked in attack.\n“What you might say is, have they bought players they really need?” Redknapp continued. “Did they really need Cody Gakpo right now?’\n“But players will always want to go there. They will still be able to get the best.”\nLiverpool still in mix for Bellingham\nOne of Liverpool’s main targets for the summer could be Borussia Dortmund midfielder, Jude Bellingham. He will cost a fortune, though, and there is plenty of competition for his services.\nThat said, a recent update suggested failing to qualify for the Champions League may actually have a positive effect on Liverpool’s chances of signing Bellingham. Indeed, it is believed he would relish the chance to be a key part of a rebuild.\nRedknapp concurs with that, adding: “Jude Bellingham will look at Liverpool and look at Klopp as a viable option because of what he will bring and how much he can improve.\n“It’s not going to be easy to sign him because every club wants him. But that’s the sort of player you’ve got to be looking for if you want to improve and start challenging again.\n“As low as it’s been for Liverpool at times, you’re never that far away. You’re only one or two players away. Look at what Manchester United have done all of a sudden with Ten Hag. He’s brought in a couple of players, there’s a bit of belief again, and all of a sudden they’re flying high.”\nReflecting further on Liverpool’s midfield specifically, Redknapp indicated they might need to sign an upgrade on Fabinho.\n“With Liverpool, Fabinho is only 29 but he looks like he’s gone over the edge,” the pundit judged. “Maybe they need to find a young defensive midfield player to fill that void.\n“But I still feel they will get in the top four, and that next year they will be challenging again.”\nREAD MORE: Klopp tipped to bring rapid defender to Liverpool on free transfer as easy upgrade on struggling duo",
  "word_count": 723,
  "scraped_at": "2026-02-14T01:55:49.881482",
  "_text_extracted": true
}