{
  "article_id": "ea0c0fe5015f",
  "url": "http://www.theirishworld.com/mark-yeates-still-playing-the-game/",
  "title": "Mark Yeates : Still playing the game | The Irish World",
  "date": "20240621T004500Z",
  "domain": "theirishworld.com",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mark Yeates speaks to Damian Dolan about FA Cup giant-killings, Tottenham Hotspur and about having no regrets\nMark Yeates doesn’t do regrets. Eighteen years as a professional footballer, during which time he’s represented 15 clubs, has taught the 34-year-old Dubliner to accept the game’s highs and lows with equal good grace.\nInvariably, there are moments of his career he wishes had played out differently, but Yeates isn’t one to dwell – “that’s football” he says.\nGood enough to make his Premier League debut with Spurs at 19, he helped Watford reach a Championship play-off final and can count Sheffield United and Middlesbrough amongst his former clubs.\nHis list of former managers reads like a who’s who; Gareth Southgate, Gianfranco Zola, Sean Dyche, Gordon Strachan and the late Gary Speed, to name but a few.\nAnd he’s far from finished yet. On Sunday, he’ll return to Bramall Lane with his current club, National League side AFC Fylde, with a spot of FA Cup giant-killing mind.\nSomething Yeates knows a thing or two about.\nIn 2015 he was part of the Bradford City side which pulled off one of the greatest FA Cup upsets of recent times, when they beat out José Mourinho’s Chelsea at Stamford Bridge.\nThirty-five in January, Yeates is still “plugging away” and has no plans to hang up the boots just yet.\n“You can’t beat being in a changing room, it’s the banter and the camaraderie,” Yeates told the Irish World.\n“Plenty of gaffers will tell you that I didn’t run around enough. Now I’m coming to the end, I’m running around more because I need to keep a job!”\nFylde knocked out Kingstonian in Round 2 to reach the Third Round for the first time in the club’s history, and secure a plum trip to Sheffield United.\nThey’d previously beaten Peterborough Sports 6-1 in the Fourth qualifying Round, and Nantwich 1-0 in the First Round proper.\nOn Sunday, nothing will be expected of the Lancashire side – the lowest ranked team still left in the competition – against a Blades side currently just seven points off a Champions League place.\nFor Yeates, it’s an opportunity Fylde, who are captained by fellow Dubliner Neill Byrne, must embrace.\n“They’ve got to go out and express themselves, and show no fear.\n“No one’s going to give us a chance, but sometimes that helps. We’ve got to show everyone what we’re capable of and enjoy it.”\nYeates knows what he’s talking about. In January 2015, Yeates scored the fourth goal as League One Bradford stunned Chelsea 4-2 at the Bridge.\nChelsea went on to win the Premier League and the League Cup that season.\n“No one gave us a chance,” he recalls. Two-nil down with half-time approaching, Bradford crucially managed to pinch a goal.\n“It gave everyone a lift coming in at half-time and we just said we’d go out in the second half with no fear and give it a go. At least we could say we left it all out there,” he said.\nYeates sealed the win in injury-time to send the travelling Bradford fans into delirium.\nHe added: “The lads were unbelievable; we deserved it. We played them off the pitch on their own patch. No one can ever take that way from the boys.”\nBradford went on to beat Sunderland to reach the quarter-finals, where they lost to Reading 3-0 in a replay.\nBut it wasn’t the only time Yeates found himself swept up by the romance of the FA Cup. In 2005/06 he reached the Fifth Round with League One Colchester United.\nThey were eventually beaten 3-1 by Chelsea at the Bridge with Joe Cole coming to the Blues’ rescue with two late goals.\nYeates, on loan from Spurs, had earlier hit the Chelsea woodwork before the visitors had the audacity to take the lead.\nYeates and Colchester would have to content themselves with winning League One that season.\nColchester’s manager was Phil Parkinson, who was also Yeates’ boss at Bradford nine years later when the pair gained some measure of cup revenge.\n“I’ve been lucky; I’ve had some decent runs in the FA Cup and this one with Fylde is no different,” said Yeates, who joined Colchester permanently when he left Spurs in 2007.\nIt’s where he enjoyed his “best” and most “consistent” spell of football – he finished 2008/09 as the club’s top scorer – before Southgate brought the cultured wide midfielder to Middlesbrough in 2009.\nYeates hit it off with England’s future manager. A “top man” he calls him.\n“He’s such a clever man and he comes across really well,” he said.\n“But if you’d asked me when he got sacked by Middlesbrough if he’d be England manager, I’d have said ‘I can’t see that’.”\nYeates had enjoyed a good spell under Southgate, but a change of manager at the Riverside brought a change in fortune for Yeates. Left out in the cold by new boss Gordon Strachan, he moved on.\n“I never envisaged leaving as soon as I did, because I loved it there. A new manager came in and I had no problem with digging in, but I thought ‘am I fighting a losing battle?’,” he said.\nKevin Blackwell and Sheffield United offered a way out.\nIn January 2010 he completed his move to Bramall Lane and helped the club finish a respectable eighth in the Championship table – just five points off the play-offs.\nYeates remembers it being a club littered with Irish players, the likes of Stephen Quinn, Keith Treacy, Derek Geary, Michael Doyle and Andy Reid.\nBut the following season saw the Blades relegated, with the club going through three managers – Blackwell, Gary Speed and Micky Adams.\nIt was under Speed that Yeates played some of his “best football”.\nPlayer-coach at the Blades when Yeates signed, Speed took over from Blackwell as manager in August 2010, only to leave four months later to take up the Wales job.\n“He [Gary Speed] was really good with the lads – a real man-manager. He really cared for his players and wanted to get the best out of them.\n“I’d been in and out under Kevin Blackwell and Gary showed all the faith in me that I needed at that stage. I was one of the ones who felt his leaving the most. I’d found someone who put his full trust in me.\n“I can only speak very highly of Gary Speed, but I’d be only one of hundreds or thousands who’d have good things to say. He was an unbelievable man; a great gaffer and a great bloke,” added Yeates.\nAdams succeeded Speed at Sheffield United and Yeates admits it “didn’t work out” between them. Yeates didn’t feature as much and the club was relegated.\nDanny Wilson was appointed and Yeates had the option to stay, but he chose to remain in the Championship, joining Watford.\nDespite the manner of his departure, Yeates only has good things to say about his 18 months at Sheffield United.\n“It’s a great club and a great city. I had some good spells and moments there, and then some frustrating spells, but that’s part of football,” he said.\n“As you get older you realise how lucky you were. When you’re younger, you’re in the bubble and you probably don’t appreciate things as much.\nHe added: “You can only praise what’s going on there now. Everyone respects what they’re doing and the football they’re playing in the Premier League.”\nHis first season at Watford (2011/12) was under Dyche, his second under Zola, when the club reached the Championship play-off final only to lose 1-0 to Crystal Palace after extra-time.\nYeates was on the bench, but didn’t get on. It was as close as he got to getting back to the Premier League and adding to those handful of Premier League appearances at Spurs.\n“You always think you can help your team, you always think ‘if I’d have got on maybe I’d have been able to do something’. I might have put a cross in or a set-piece,” he says.\nFeeling the “writing was on the wall” he left Watford in 2013.\nAfter Bradford, Yeates added Oldham Athletic, Blackpool and Notts County to his list of former clubs, before dropping down into the National League with Eastleigh.\n“There’s not much I can have big regrets about. I’ve been lucky; I’m still doing what I love and still doing it at a decent level,” he said.\n“It would have been nice to have played more games in the Premier League or stayed longer at the some of the teams I signed for in the Championship, but that’s just the way it is.”\nHe added: “You do see lads that are at clubs for a long time and rack up a lot of appearances, but that just wasn’t the way my career went. But I’ve done alright.”\nAnd just enough time for one more FA Cup giant-killing. Maybe.\nYou might also be interested in this article\nhttp://35.176.73.46/taylor-made-for-kennys-kids/",
  "word_count": 1500,
  "scraped_at": "2026-02-14T01:51:32.426165",
  "_text_extracted": true
}