{
  "article_id": "ea16cb12aef1",
  "url": "https://theathletic.com/4323005/2023/03/19/chelsea-enzo-felix-everton-potter/",
  "title": "Felix and Fernandez are Chelsea new attacking brain – but defensive frailty remains",
  "date": "20230319T201500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With the benefit of hindsight, perhaps Graham Potter tempted fate when, abandoning his usual slavish devotion to measured statements and emotional stability, he allowed himself to indulge in a little populist rabble-rousing at an event for Chelsea members on Thursday.\nHaving thanked the fans for being fair with him, he ended his message to them with a bang:\n“We will try and beat Everton, take the draw and then we will try and win the fucking Champions League!”\nAdvertisement\nThe draw he referenced was the following day’s laying-out of the Champions League quarter-final and semi-final brackets, not the deflating blow Everton inflicted on Chelsea’s tentative recovery by snatching a late point at Stamford Bridge on Saturday. But it was at least conceivable for the football gods to hear Potter’s words and conclude that he and his team, a spring in their step thanks to three encouraging wins after three miserable months, were asking to be Dyched.\nOn the pitch yesterday evening, it was much easier to see exactly how Chelsea had contributed to their own undoing: both Everton equalisers were largely self-inflicted wounds, with this season’s ninth set-piece goal conceded in limp fashion to Abdoulaye Doucoure at a corner before startlingly poor individual errors from Kalidou Koulibaly and Kepa Arrizabalaga allowed substitute Ellis Simms to make himself this season’s Jarrad Branthwaite in the 90th minute.\nChelsea had twice edged themselves ahead, both of their goals just reward for one of the more convincing performances in possession of Potter’s seven-month tenure. Directed by the routinely excellent Enzo Fernandez at the base of midfield, they played through Everton’s press and then stretched and stressed Sean Dyche’s diligently-drilled low defensive block to its breaking point.\nFernandez’s long-range passing is particularly dangerous: he completed 10 of his 13 attempts, sometimes switching the point of attack to Reece James on the right but more often out to the left to Ben Chilwell, who touched the ball more (96 touches) than any other player on the pitch. One such combination yielded the first-time cross Michael Keane could only clear to the feet of Joao Felix for the opening goal.\nEverton had come to west London imbued with the fighting spirit of Dyche’s most dogged Burnley teams; he has spoken in recent weeks about transforming the mentality of a struggling squad since replacing Frank Lampard at the end of January and, at one point in the first half, Amadou Onana let out a fierce yell of triumph in front of the away dugout after forcing the ball out for a Chelsea throw on the halfway line.\nAdvertisement\nLed by Burnley alumni Keane and James Tarkowski, Everton also blocked 10 of Chelsea’s 20 shot attempts but in the 53rd minute, Joao Felix managed to squeeze one through the legs of the latter and into the only place it could evade goalkeeper Jordan Pickford’s desperate dive, kissing the inside of the far post before spinning across the line.\nA first goal at Stamford Bridge was no less than the Portugal star deserved for a display of elegant menace that prompted his name to be sung resoundingly and repeatedly in the stands.\nStarting in the No 9 role inhabited by Raheem Sterling against Borussia Dortmund in the previous home game and Mykhailo Mudryk away to Leicester City last weekend, he linked easily with the resurgent Kai Havertz and Christian Pulisic, who was making his first start in more than two months. The Atletico Madrid loanee’s movement between the Everton lines was a constant problem, punctuated by several skilful flourishes that dazzled the crowd — most notably one flick and spin around the corner that left Tarkowski pressing fresh air.\nUntil the final 15 minutes, there were plenty of signs of an exciting, dynamic Chelsea attack coming together.\nJames and Chilwell have returned to something close to full power following injury lay-offs, stretching opponents horizontally and giving this team back their old wings. Between them, January signings Fernandez and Joao Felix provide the Chelsea side with a new brain capable of creation as well as control. The first goal here was a product of Fernandez and Chilwell, the second a result of the panic caused by James combining with Joao Felix.\nThe broad reaction to Potter’s late-game decisions underlined the limited trust he commands with supporters, despite the recent upturn. The introduction of Conor Gallagher for Pulisic on the hour was widely interpreted as defensive, despite the change not actually changing Chelsea’s system at all (3-4-3 with the ball, 5-3-2 without it).\nAdvertisement\nIn the final minutes, he favoured the height of Ruben Loftus-Cheek and Carney Chukwuemeka to try to deal with Everton’s aerial barrage, with Chelsea’s game management undermined by the forced withdrawal of the excellent Wesley Fofana (“He was feeling his hamstring,” Potter said later). This was not the moment for N’Golo Kante’s long-awaited return — no point introducing the greatest midfield ball-winner of his generation against a team increasingly intent on bypassing their own midfield.\nWould weaponising the speed of Mudryk or Noni Madueke as Everton pushed up in search of an equaliser have been a better strategy? Perhaps, but encouraging the game to become more open and transitional comes with its own defensive risks. Potter took the more pragmatic approach — one perfectly aligned with the values of many of his more decorated Chelsea predecessors, if not quite so in tune with the current desires of many supporters.\nUltimately, two points were lost because of a disastrous cascade of individual errors: Fernandez leaving Doucoure uncontested to receive a pass forward from Vitalii Mykolenko and redirect it to the feet of Simms; Koulibaly opting to confront rather than contain a striker without a Premier League goal to his name at the time and only recalled from loan at Championship side Sunderland by Lampard at the turn of the year; then Kepa allowing a relatively tame shot to squirm under his left wrist.\nPotter’s decisions did not let Everton back into the game primarily because they were never out of it, and never gave the impression of a team who believed they were beaten. They made Chelsea feel their physicality throughout — by fair means and occasionally foul, best illustrated by one crude Tarkowski neck-pull on Joao Felix — and made maximum use of their physical advantages to ensure they were never more than one opposition mistake away from salvation.\nThe result further cements Chelsea in mid-table mediocrity and dulls the optimism of a timely recent revival, but it could also provide an opportunity for Potter to spend the two-week international break that starts tonight (Sunday) thinking about the flaws in this team that he still needs to address with that quarter-final against Real Madrid on the horizon.\nAfter all, defending set pieces and managing late-game leads are the kind of details a team needs to get consistently right if they want to try to win the fucking Champions League.\n(Top photo: James Williamson – AMA/Getty Images)",
  "word_count": 1158,
  "scraped_at": "2026-02-14T01:59:46.882368",
  "_text_extracted": true
}