{
  "article_id": "ea1690566384",
  "url": "https://www.nytimes.com/athletic/5551523/2024/06/16/englands-58-years-of-hurt-euros-world-cup/",
  "title": "England 58 years of hurt – by the players who lived it",
  "date": "20240616T050000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A version of this article was originally published in 2021 — it has been updated before England’s participation in Euro 2024\n“I remember thinking, as I watched Alf Ramsey’s amazing self-restraint during the celebrations, ‘Enjoy it, Alf — because it doesn’t get any better than this’.”\nThose were the prophetic words of Chelsea great Peter Osgood, who would start his England career four years after the World Cup success of 1966. He was right, it never did: not for Ramsey, nor for any other manager or player in the 58 years that have followed. This is the story of those failed tournaments, told by the players who lived them.\nAdvertisement\nNo one genuinely thought the wait would extend this far, which might explain why celebrations back in the afterglow of victory were comparatively sedate. Queen Elizabeth II, who’d only just turned 40, handed the Jules Rimet trophy to Bobby Moore and the players conducted a Wembley lap of honour, after which the squad headed to the Royal Garden Hotel in Kensington, west London, for dinner. Wives and girlfriends weren’t invited and stayed in a side room.\nThe prime minister, Harold Wilson, did pop in to pass on his congratulations, yet the players ended up drifting off into the night to take in the nearby West End.\nJimmy Greaves recalled it all being “quite low-key”. No specially curated bus parade, no Trafalgar Square ticker tape reception, no fly past or millions flocking to worship their heroes. The squad’s bonus of £22,000 was divided up evenly, £1,000-a-man, upon the insistence of captain Moore.\nThe biggest fanfare over the days that followed was reserved for the release of a commemorative postage stamp to mark the victory. Supporters queued up outside post offices up and down the country seeking their souvenir of the success before the focus was drawn back to more mundane matters and the ongoing struggle between Liverpool and Manchester United, then on six and seven titles respectively, for domestic dominance.\n- Latest Euro 2024 news here\n- Euro 2024 fixtures and schedule\n- Euro 2024 team guides: Everything you need to know\nRamsey’s aim was to maintain England’s momentum into the newly rebranded European Championship to be staged in Italy in 1968, a competition previously known as the European Nations Cup having been established in 1960. Qualification was achieved after topping a group incorporating the home nations — Scotland famously won at Wembley en route — before a two-legged quarter-final, won 3-1 on aggregate, against Spain.\nThe semi-final draw pitted the world champions against Yugoslavia in Florence where Alan Mullery would play the role of fall-guy. The Tottenham Hotspur midfielder was dismissed a minute from time in the 1-0 defeat, the first Englishman to receive a red card in the country’s 424th match.\nAdvertisement\n“They were doing all the dirty stuff, going over the top into tackles and the referee (the Spaniard Jose Maria Ortiz de Mendibil) was diabolical,” says Mullery. “With one minute to go he (Yugoslavia’s Dobrivoje Trivic) did me. I’d had enough of them injuring people so I kicked him in the bollocks. I regret it now and it’s something I have had to live with for the rest of my life.”\nBack in the dressing room at the Stadio Comunale, Mullery apologised to his team-mates post-match before Ramsey returned, digesting the defeat. “He looked at me with a stern expression and said: ‘I’m glad somebody retaliated against those bastards.’ He could swear his head off but outside he was a perfect gentleman. He could also put his arm round people, but he would never show that out on the pitch. When he talked you listened.\n“He was very angry that day and, when I got back, he paid my £50 fine from the FA. In ‘66 Alf got it right, but in ‘68 I wouldn’t say he got it wrong. It’s just in the semi-finals we got beaten by a side that kicked us to death.”\nOut of the frying pan and, as the holders, into the fiery heat of Mexico 1970.\n“The big fellows like Bobby Moore were losing 10 to 12 pounds and the smaller guys like myself were losing half a stone,” the former Manchester City forward, Franny Lee, tells The Athletic. “You weren’t allowed under FIFA regulations to drink water on the field. You had to wait until half-time or, if the game was stopped, you could try and sneak a mouthful. Who invented that rule? Everything seemed to be scaled around the South American teams to make sure they did well.”\nDespite the physical challenge, the defending champions beat Romania and Czechoslovakia 1-0 either side of meeting the eventual winners. “We got beat 1-0 by Brazil but should have beaten them about 5-1,” says Lee. “Pele said to Bobby Moore after the game, ‘If there’s one team we don’t want to meet again it’s England, because we were lucky today’. We had a swagger. We knew we were world champions, because we were a very good team.”\nAdvertisement\nGordon Banks’ save from Pele’s header during that game is still regarded as one of the greatest ever. The keeper’s absence from the quarter-final against West Germany is rued even now.\nIn the build-up to the last eight tie, England’s players were allowed to visit the Guadalajara Country Club resort close to their Hilton hotel base. They were even permitted a few beers. Banks was never sure whether the bottle he was served was opened in his presence or not but, within half an hour, he was bent double with stomach cramps and spent the rest of the night “being sick (or worse) so often that I was getting no rest”. He spent more time on the toilet overnight than asleep in his bed and, in his autobiography, admitted to feeling “as weak as a kitten”.\nIt was fuel to the fire of conspiracy theorists crying deliberate sabotage, especially after Moore’s arrest in Colombian capital Bogota prior to the tournament on charges of stealing a bracelet from a jewellery shop. Or the police force’s reluctance to move on local fans who kept the team up prior to the Brazil game by banging dustbins lids outside the hotel.\nBanks underwent a late fitness test but the cramps returned and a controversial choice was made. “Alf pandered to the London press by playing Peter Bonetti when he should have played Alexc Stepney who’d just played in the (1968) European Cup final for Manchester United at Wembley when they won it,” says Lee.\nDespite the selection drama, England led 2-0 courtesy of goals from Mullery and Martin Peters, before Franz Beckenbauer’s shot went under Bonetti midway through the second half. Bobby Charlton was controversially substituted before the restart. “I felt I could run all day, even though we were in Leon and 6,000ft up,” Charlton later said. Uwe Seeler equalised with eight minutes to go before Gerd Muller completed the comeback win in extra-time. Alan Ball described the capitulation as “spooky”, not least because he had “never been in a more one-sided international”.\nFour years on, West Germany had their revenge.\n“You want to get off the pitch as soon as you can. But if Beckenbauer wants to come and shake your hand, you shake his hand,” says Mullery. “It was one of the most horrible feelings going back on the coach after the game knowing it was your time to go home, especially knowing that you had it in you to go all the way again. People will always remember 1966 because we won it and 1970 because we lost it.”\nAdvertisement\nOne fan held up a banner at the airport as they returned home which read, ‘Welcome back lads, better luck in 74’. “We had a very good reception really,” says Lee. “But even today I still think about it. We were a very, very good team.”\nIn arrivals back in London, Ball was asked whether it was the time for Ramsey to depart, “There’s no chance of that. who would take his place?” was his curt response.\nYet plenty were critical of the manager’s perceived conservatism. “Every move is analysed and I’m going to be in the limelight more often that not,” Ramsey said after the tournament. “This word flair keeps cropping up and other words that infer that you know absolutely nothing about the game of football.”\nMedia pressure and Ramsey didn’t mix. “He hated the press,” says Mullery. “Once we were down at Roehampton and, after training, he was reading the team out to the press — the 11 players and one sub as it was then — and then just turned on his heels and walked away. The press guys didn’t know what to do with themselves.”\nYet something had changed. The balance of power had tipped. England failed to make the final stages of the European Championship in 1972, losing again to a West Germany team inspired by the untouchable Gunter Netzer in another two legged quarter-final qualifier.\n“A lot of those players from ’66 were being phased out, and others followed after 70 — Bobby Charlton, Geoff Hurst, Roger Hunt — and we ended up with the whole squad feeling in transition,” says Rodney Marsh, who earned his second and third caps in those games against the Germans. “We were embarrassed at Wembley. It felt like we were playing football from a previous era, while they were there running rings round us.”\nWhether he’d earned the right to take England to another tournament or not, the FA felt Ramsey had enough credit in the bank to retain his position. Yet there was to be no reinvention of this side as the favourites from 1966 faded. Seven years after that triumphant afternoon at Wembley, England were held 1-1 at home by Poland and their inspired goalkeeper, Jan Tomaszewski, to finish behind the visitors in their qualifying section. They would miss the 1974 World Cup.\nRamsey would limp on for another two games and six months before the axe fell on his 11-year tenure. “I was surprised that he’d stayed on after 1970 when his conservatism had been catastrophic,” adds Marsh. “As it was, the FA made another incredible mistake (in 1974) because Brian Clough was the best manager in the world at that time, but the FA were terrified of him because he was such a maverick, almost anti-establishment. They didn’t want him going out there, this loose canon, no matter how great he was. So they turned to Don Revie who was far more establishment. Far more like Ramsey.\n“It took years to recover from that.”\n“We haven’t got the players — there is no Bremner and no one like Giles.”\nDuncan Revie, son of the newly appointed England manager, had been expecting a very different welcome on walking into his dad’s suite at a top London hotel.\nAdvertisement\nThe previous evening, Revie senior’s reign had begun in what had seemed, at least to Duncan and the rest of the 83,858 crowd inside Wembley, to be dream fashion courtesy of beating Czechoslovakia 3-0 in the opening qualifier for the 1976 European Championship. Supporters had been euphoric and the press coverage borderline gushing. Yet Revie, mindful of how Leeds’ success had been built on the midfield brilliance of Billy Bremner and John Giles, could not be consoled.\nHis foreboding that things would not work out on the back of just 90 minutes proved spot on. Less than three years after that triumph over the Czechs, Revie’s time with England was over. He had quit to take up a lucrative job managing the United Arab Emirates’ national team, leaving behind a side almost certain to miss out on the 1978 World Cup finals in Argentina.\nIt was not supposed to be like this when the FA had turned to Revie shortly after Leeds had been crowned champions for a second time in May, 1974. “Don was a popular choice,” recalls Colin Todd, the former Derby County defender. “There was a big rivalry between ourselves and Leeds — or, more accurately, Brian Clough and Don Revie — but his record after building that wonderful team at Leeds meant he had earned his chance.”\nRevie’s Leeds may not have been to everyone’s liking. Clough, in one of his regular swipes at a squad he bizarrely took over following Revie’s departure to England, even went so far as to claim: “Don Revie’s so-called family have more in keeping with the mafia than Mothercare.”\nBut, what even those fiercest critics recognised deep down was that Revie had intentionally built not just a football team but a band of brothers so devoted to one another that if you made an enemy of one, you made an enemy of them all. He wanted that same esprit de corps with England. And what had worked in West Yorkshire, Revie reasoned, should work with the national team, as quiz nights and carpet bowls contests suddenly became part of the international set-up.\nThis desire to foster an inclusive spirit was also behind 81 squad members and potential England players being invited to a ‘getting-to-know-you’ session in Manchester soon after Revie got the job. However, as with the carpet bowls and bingo that many resented for their forced camaraderie, inviting so many players ultimately backfired. Critics, including several of those present, felt it smacked of indecision — an accusation given credence by 47 of the 81, including five of the half dozen who travelled north from West Ham United, never kicking a ball for England under Revie.\nAnother initiative designed to help the players that was later used as a stick to beat Revie came via an improved rewards scheme. Where before representing England had brought a flat appearance fee of £60, now there was a sliding scale that brought an extra £200 for a win and £100 for a draw on top of the raised £100 flat fee. Past internationals were quick to condemn the plan, insisting the honour of representing your country should be enough. But Revie, recognising the life of a footballer was a short and precarious one, pressed on anyway.\nAdvertisement\nRevie ended his first season unbeaten, a 5-1 thrashing of Scotland proving the perfect sign-off in May as England clinched a 35th Home Championship. The opening fixture of the 1975-76 season also yielded a victory, as Switzerland were beaten in a friendly that saw Revie try to out-fox the watching Czech scouts ahead of the following month’s key qualifier in Bratislava.\nNot only was the team sent out sporting numbers that paid little heed to their positions but Mick Channon, the recognised penalty taker, was also told to step aside if England were awarded a spot-kick so as not to give away his technique. The subterfuge, however, failed with a 2-1 defeat to the eventual Euro 76 winners effectively putting paid to any hopes of reaching the finals.\nRevie did not know his best team, the one consistency of team selection being a distrust of flair players. Tony Currie, who made just one appearance during Revie’s reign after starting five of Ramsey’s final six games, tells The Athletic: “This is the bit I could never understand about Revie. For a decade from 1965, there was only really Liverpool and Leeds who were consistently up at the top. He had so much talent in that Leeds side and yet, with England, he didn’t want to know.\n“To have all those skilful players but not play any of them just made no sense. The bottom line is he just didn’t trust us. I’ll always remember the day he told six of us we wouldn’t be involved. It was a training camp at Bisham Abbey, no match or anything like that. There was (Alan) Hudson, (Frank) Worthington, (Stan) Bowles, (Rodney) Marsh and Charlie George, plus myself, all lined up in a crescent as he told us, ‘You don’t figure in my plans’. We just looked at each other and walked away.”\nSuch was the mistrust that developed between some players and the manager that Hudson, the mercurial Chelsea midfielder, even suspected his surprise selection for a friendly against West Germany in 1975 had been a ploy by Revie to get the critics off his back. “I am sure to this day he only picked me because he wanted me to fail,” Hudson told Revie: Revered and Reviled — The Authorised Biography, published in 2010. “They were the World Cup holders and we were expected to get thrashed.\n“If I’d had a poor game, he would have had a ready-made reply to those saying I should be in the England squad. Unfortunately for him, I played well so his plan didn’t work.”\nCurrie, whose only appearance under Revie came in that 1975 friendly win over Switzerland in Basle, feels that initial 81-player get together in Manchester helped sow the seeds of mistrust. “I remember sitting in the front row with Emlyn Hughes, who was captain at the time. He called the manager ‘Don’ and was quickly put in his place by being told. ‘You either call me Boss or Mr Revie’.\nAdvertisement\n“Emlyn wasn’t being disrespectful. We’d always called the previous manager ‘Alf’. Same with Joe Mercer when in temporary charge, using his first name. He then banned everyone from going out that night, too. Most still did, of course.”\nThe carpet bowls, bingo and the like may not have been to everyone’s liking. But some, such as Joe Royle, enjoyed them. “They were better than playing cards all night — which was the alternative,” he says.\nThe opposition dossiers, often running to 20 or so pages, that Revie brought with him from Leeds also had their supporters among the squad even if, as Revie subsequently discovered, some only used them to keep score when playing cards.\n“History has shown that Don was ahead of his time with those dossiers,” says Colin Todd. “I came in from Derby, where Cloughie wasn’t bothered about the opposition. So, this was quite a contrast. But, I certainly took on board what was in them. Don’t forget, this was a time when not a lot was known about some opposition teams. Don just wanted us to be the best prepared we could be. I liked him.”\nOther initiatives Revie pushed for that have since become the norm included longer preparation time before matches. He found it ridiculous that, for instance, Ramsey had only had three days with his players before that fateful World Cup qualifier against Poland in 1973. Alan Hardaker, the Football League secretary who had a loathing for the England manager that was very much reciprocated after umpteen clashes between the two men when Revie was at Leeds, initially pushed back.\nRevie’s response was to chip away at his enemy through the media, even revealing how he had set up a dedicated hotline at Lancaster Gate that he would man personally on a Saturday evening for injured players to call.\nIn the end, Revie got his way in time for the World Cup qualifying campaign. On the pitch, however, things did not go his way with a 2-0 defeat to Italy in Rome leaving England’s hopes of reaching the 1978 finals hanging by a thread.\nAdvertisement\nInevitably, the manager found himself in the firing line. Even the players were questioning his selection policy. Peter Taylor, having been a surprise call-up from Third Division side Crystal Palace, remembers sitting in the dressing room with Derby pair Roy McFarland and Todd for 15 minutes before one of them asked, “Look, give us a clue. Who are you?”\nIf the players were unhappy, that was nothing compared to the FA chairman. Sir Harold Thompson had played a major role in Ramsey’s removal, an act of revenge many felt could be traced back to an incident on his first international trip as an executive director. He had been asked to put a cigar out by the manager due to it annoying the players at breakfast. Thompson complied but took umbrage at being told what to do by someone he considered a mere employee.\nRevie’s own relationship with Thompson got off to a similarly inauspicious start during an early dinner between the pair. “When I get to know you better, Revie, I shall call you Don,” the former professor at Oxford University pompously informed the newly-appointed manager.\n“Well, when I get to know you better Thompson, I shall call you Sir Harold,” replied Revie, well aware how Thompson had riled the class conscious Ramsey by only using his surname.\nLater, Thompson would start to deliberately mispronounce his manager’s name — saying ‘Revvie’, rather than the correct ‘Reevie’ — knowing how it irritated the manager.\nOnce results started to go against England, Thompson saw his opportunity to make a change. This much became clear to Earl Harewood, the FA president and a first cousin to the Queen. When making his way through the Royal Retiring Room ahead of kick-off one night at Wembley, Earl Harewood turned to Thompson and said, “Let’s hope we win.” To which Thompson’s wife replied, “Yes, or let’s hope we lose and we can get rid of that man.”\nHer husband, by nodding along, made his own feelings clear.\nAdvertisement\nLater, Earl Harewood, who was Leeds United’s president for 50 years until his death in 2011, was informed by a member of the Ipswich Town board that the club had been approached by the FA about Bobby Robson succeeding Revie. The Earl immediately told his good friend about what had been going on behind his back.\nThompson eventually got his wish, though very much not in a fashion he had anticipated. Revie — sensing his time was up — negotiated a move to coach the United Arab Emirates that would eventually bring a 10-year ban from English football. The suspension was later overturned in the High Court, but the bitterness over Revie’s exit lingered.\nWhen the former England manager died from motor neurone disease in May, 1989, at the age of just 61, every aspect of his career and life was represented at the funeral in Edinburgh. All bar one, that is.\nThe FA delivered one final snub by staying away.\nA Wednesday afternoon in mid-June, 1982, and Bilbao is baking.\nThe England players, in a nod towards recent advances in sports science, are weighed pre-match before swallowing their salt tablets, pulling on those glorious red Admiral shirts and striding out into the sweltering Estadio San Mames to confront the French in their opening group game and their first at a World Cup finals in 12 long years.\n“They recorded it at around 105 degrees Fahrenheit and there was nowhere to hide – not a breath of wind, not a cloud in the sky, and no shade at all,” says Steve Coppell, the Manchester United winger and a starter that day. “Those shirts looked lovely but they were thick acrylic… I mean really, really thick. They were actually the kind of shirts you’d wear in an English winter and, once you started sweating, they absorbed all the moisture and weighed a ton. When you took it off it would drop like a stone to the floor.\nAdvertisement\n“We simply cooked in them. The ice towels they gave us at half-time, and the cold showers we all grabbed, were the only relief. We were all absolutely exhausted by the end. You can see Paul Mariner hardly has the energy to celebrate scoring our third goal. They did the follow-up checks on our weight after the game and Paul had lost over 11 pounds.”\nThe team, collectively, shed six stone out on the turf that day. But at least they departed post-match back to their Los Tamarises hotel in good spirits, buoyed by the quickest goal ever recorded at the World Cup and an impressive 3-1 success over France. They had set a promising tone for the tournament.\nIt was Ron Greenwood who had instigated the upturn. The man initially appointed on a caretaker basis following Revie’s defection had landed the job full-time while, not for the first time, the clamour across the country was for Clough to be handed the reins.\nGreenwood was considered a calming influence, a safe pair of hands, but also a figure who had achieved success at club level, had coached the national team’s under-23s and, having sat on FIFA technical committees in 1966 and 1970, was respected internationally.\nThe final game of that three-match stint as an interim was a World Cup qualifier against Italy, a fixture won 2-0 against the side who would claim the group on goal difference. Victory was not enough to secure passage to the tournament in Argentina in 1978, but it did restore national pride.\n“Qualification was already done and dusted so, in many ways, it was a meaningless game,” says Coppell, one of three debutants in that win at Wembley. “But it was meaningful because it was the start of a new chapter. Ron had already gone through his Liverpool phase by selecting six players from their team, plus Kevin Keegan who had just left for Hamburg, for his first match in charge. But he then had a rethink and changed direction. It was all about progression.\n“We played Hungary, a team who had reached the World Cup, in the May before the tournament and beat them 4-1. We had Kevin in his pomp, Trevor Brooking, the new players who were coming into the team, people like Glenn Hoddle, Trevor Francis. If we’d actually qualified for the tournament, we would have done very well over there. We were a good team, so you could sense the frustration in the country. Our teams were doing well in Europe. Kevin Keegan was at Hamburg and European player of the year. So why weren’t we at the finals?\n“The mood was, ‘This is a disgrace and it has to be turned around’.”\nAdvertisement\nGreenwood was a success on that front. England sailed through a relatively straightforward qualifying campaign unbeaten to reach the revamped eight-team European Championship in 1980 and a first major finals in a decade, only for their participation in the tournament in Italy – a logjam of games blighted by stodgy football and low crowds – to end in anti-climax. Defeat to the hosts in their second game effectively eliminated Greenwood’s team though, by then, their participation had been blighted by crowd trouble.\nPolice had arrested 36 English supporters on the eve of the side’s opening fixture, against Belgium in Turin. When the Belgians equalised the following day, trouble flared on the terraces. Riot police moved in, firing tear gas grenades into the crowd in an attempt to quell the disturbances, only for England fans to hurl the canisters back towards the pitch. The referee, Heinz Aldinger, had to suspend play for five minutes with the players badly affected by the fumes. The goalkeeper, Ray Clemence, suffered blurred vision and had to be treated by the physio, Fred Street. “That peppery aftertaste, the smell, the tears…,” says Coppell. “Not a pleasant experience.”\nManagement and players denounced the violence. Keegan condemned the minority who had stirred trouble as “drunks”. Greenwood expressed a desire that “these bastards” should be “put in a boat and dropped into the ocean”. The Football Association’s chairman Thompson, called the troublemakers “sewer rats”. UEFA subsequently fined the FA £8,000, a sanction even they considered lenient.\nFor Greenwood, the sense of disappointment extended beyond the tournament. England’s qualification campaign for the 1982 World Cup was fitful at best, downright awful at worst. The team had talent, as showcased in their fine 3-1 win in Hungary, but was also prone to implode as a subsequent, inexplicable 2-1 defeat in unfancied Norway demonstrated. The manager was subjected to fierce criticism by a media who travelled with the squad to away fixtures and had to be talked out of retiring on more than one occasion. Yet, other results in the section went England’s way and, when Hungary were defeated 1-0 at Wembley in the return fixture, that long elusive passage to a World Cup finals was secured.\nThe sense of excitement was palpable. The squad, all bubble perms and dodgy chorusing, crammed into a studio alongside Noel Edmonds to record their tournament song – “This Time” – which would peak at No 2 in the charts in early May, some six weeks before the tournament. The record was actually en route out of the top 75 by the time Greenwood’s team kicked off their campaign in Bilbao. “Believe it or not, I’ve been involved in four top 20 singles,” says Coppell, a legacy largely of United’s four FA Cup final appearances over his stint at the club. “I turned down Top of the Pops. There was no way I was going on there prancing around, miming along to that song.”\nThis time, the song went, England were “going to find a way” to “get it right”. To a certain extent, they did.\nTheir preparations were relatively meticulous. Greenwood tested the mattresses himself before confirming the booking at Los Tamarises, a hotel sufficiently secluded by a cliff face to deter prying eyes (and photographers). Not that the vista from the front in Bilbao was particularly scenic. The red top newspapers had christened the bay Dead Dog Beach after they discovered a deceased mutt on the rubbish-strewn shore. The seaview rooms actually looked out on to a refinery. But there was a games room to keep the players amused, and it afforded England some privacy.\nAdvertisement\n“We’d taken over the entire hotel, which was unique back then, and the whole experience was an absolute blast,” said Terry Butcher, who celebrated that opening win over the French, sparked by Bryan Robson’s goal after 27 seconds, with a squad meal and “a good few drinks”. The group enjoyed a round of golf, in 90 degree heat, “and a few more drinks” the following day. “We came back to the hotel on the bus and Ron Greenwood was holding a press conference in the foyer,” said the former Ipswich centre-half. “Ray Wilkins, bless him, came back and fell asleep on one of the sofas in the lobby. That press conference was held around Ray. He slept through it all.”\nOut on the pitch, progress through the first group stage appeared serene. England won all three of their games in Bilbao, with Admiral having flown over a lighter, more breathable kit. The shirts were packed in cardboard boxes and driven from the factory by the design manager, Debbie Jackson, in her VW Polo across Snake Pass to Manchester airport where she stayed up all night sowing badges on to the breasts by hand. “She was that panicky that she actually sowed the badges on in the wrong places,” said Peter Shilton. “There was one virtually under the armpit. So not the best start from a kit point of view.”\nThe kitman on the scene in Spain had ironed on squad numbers – allocated in alphabetical order for everyone other than Keegan, who retained the No 7 – to the shorts to satisfy FIFA’s new protocol. “But by half-time in the Czechoslovakia game, all the numbers had fallen off and were dotted all over the pitch,” said Butcher. “It was amazing. Actually, it was embarrassing.”\nThe side still advanced with a pristine record and, in a daunting second group phase, played out a cagey goalless opener with West Germany with the absence of Keegan and Brooking, both in the squad but carrying back and groin injuries respectively, keenly felt. Their team-mates had painted a red cross on their door at the hotel to signify theirs was effectively a hospital ward. With epidurals having offered no relief, Keegan had eventually been given the go-ahead to fly back to Hamburg ahead of the German fixture to be examined by his regular specialist, Jurgen Rehwinkel.\nThe surreptitious dash across the continent – involving Keegan, wearing sunglasses and a hat to remain incognito, driving a tiny Seat 500 five hours through the night to catch a 7am flight from Madrid – was kept quiet, though he and Brooking, England’s best players, were still only deemed fit enough to deliver cameos in the decisive fixture against Spain. They needed to win by two to advance to the semi-final. Keegan was summoned off the bench 26 minutes from the end and duly guided a header wide with virtually his first touch of the tournament.\n“That should have been Kevin’s tournament,” says Coppell, who missed that game against Spain after suffering an allergic reaction to a steroid injection in his knee. “He was at the very peak of his powers and should have been the dominant player at the finals, only to be left on the outside looking in. Trevor had been playing superbly well for England, too, and was the Jack Grealish of the day. He’d run at people and make things happen. So we were basically denied possibly our two best creative forces which meant that, inevitably, it all ended with a sense of ‘what if?’”\nEngland were unbeaten in their five games at the tournament, had conceded only once, but, courtesy of that goalless draw at the Bernabeu, they were also out. “The atmosphere was poisonous that day, properly horrible,” said Butcher. “The Spanish wanted to stop us getting through because of the Malvinas… because of the Falklands war (a 10-week conflict with Spanish-speaking Argentina that had extended into mid-June, 1982). They never let us forget it. The mob were outside the dressing room and around the bus – it was pretty scary, not nice at all.\nAdvertisement\n“There were a lot of tears, particularly for Ron because he had announced he was leaving. He was such a good guy with a lovely demeanour. But there was no backlash. It was all just low-key. We flew back with the wives and girlfriends, I got into my car and drove back to Ipswich. It’s when you get back home that it hits you.\n“You feel like there’s something missing because you’ve been living this dream for five weeks. And it had come to nothing.”\nBobby Robson was well aware of the task he was taking on. “If I can get it right, it’s utopia,” he said upon his appointment as England manager. His eight-year spell in charge almost delivered. No one had come closer since Ramsey two decades previously. Yet an intensely pressurised period in charge would culminate at Italia 90 with heartache at the semi-final stage.\nFailing to qualify for Euro 84 was an inauspicious start. Indeed, his tenure almost ended there. “It was a very difficult period from the start as we tried to work out how we were actually going to play the game,” says Luther Blissett, who made his debut in Robson’s second game in charge, a 2-1 defeat to West Germany in 1982. “We all saw how they played in Europe, but we didn’t naturally play that way.\n“We tried by playing slowly and passing the ball around, but we never really affected the game. You look at the England team now and probably 90 per cent of them play the way that suits them. That’s how you get success.”\nDefeat at Wembley against Denmark cost them a place at the tournament in France and the tabloid press, in the midst of a circulation war, targeted Robson. “Dad was boxed from pillar to post,” says Mark, Robson’s son. “The vitriol the day after the (Denmark) defeat was incredible. I don’t think the reporters were gunning for Dad. They were gunning for circulation. Dad said many times he felt like he was caught in the crossfire.”\nRobson twice offered to resign. Clough, previously linked with the job at the end of Ramsey’s reign, had transformed Derby and Nottingham Forest into league title winners. Moreover, he won back-to-back European Cups with the latter. Many people felt it was finally his time. Yet Robson was told to “soldier on” by the FA chairman, Sir Bert Millichip, after his second attempt to hand over the baton to someone else.\nSupport from Ramsey, his most successful England predecessor who’d also managed before him at Ipswich, would have been helpful, but it never came. Robson called him “a bizarre fellow” who was “either hostile, in print, or unfriendly, in person”. Robson wrote to Ramsey while in charge at Portman Road saying that tickets would always be available in the directors’ box, but never received a reply. Robson also offered to give Ramsey a lift home after a game at Chelsea only to receive an “icy” reply.\n“Thank you, but I came by train and I’ll go home by train.”\nAdvertisement\n“I found it odd because I had always been respectful to Alf. For God’s sake, he won us the World Cup,” Robson wrote in his book Farewell But Not Goodbye.\nRamsey had been publicly critical of Robson’s team, as had former captain Hughes. “Each time we lost I was back in the stocks to be pelted,” wrote Robson. “Emlyn, God rest his soul, was a great player but I had to ask what did he achieve as a manager? When his playing days were over, he went off to manage Rotherham, found it bewildering and resigned. He couldn’t cut it as a manager, but there he was telling me what I was doing wrong with the England team.”\nAn unbeaten Mexico ’86 qualifying campaign steadied the ship, but a group stage defeat to Portugal (0-1) and subsequent draw with Morocco (0-0), in which Wilkins picked up England’s first World Cup red card, turned the screw. “There’s no point talking about despair, because it’s not in that situation,” said Robson after the game. “I’m cursing everything that has gone wrong for us because two years of work has disappeared.”\n“It almost felt like the media had wanted what was happening and they turned on us badly,” defender Terry Fenwick tells The Athletic. “We were always fighting the negatives, but Bobby kept that away from us and shouldered a lot of the blame, which I thought was magnificent.”\nAs it transpired, Gary Lineker’s hat-trick against Poland helped England advance to the knockout phase, with another 3-0 win against Paraguay setting up a quarter-final against Argentina. Dave Sexton, the FA’s technical director, prepared the scouting report and described Diego Maradona as “the little pocket Hercules with exceptional speed” in his pre-match briefing.\nFenwick was there first-hand to witness the match’s two Maradona moments: one born of treachery, the other of trickery.\nThe ‘hand of god’ incident was “crystal clear” for Fenwick. “You see my reaction more than anyone else, I’m pointing out to the referee that it was handball and chased him to the halfway line,” he says. “The officials were out of their depth. If only we had VAR in those days. It’s almost as if that was one of many moments of payback over the years for the Geoff Hurst controversy of ’66.”\nIt left the England players “all over the place” according to Fenwick and, four minutes later, Maradona picked up the ball on the half-way line and scored one of the great goals. “Believe me when I tell you this: we were still in shock, like Bambi in the headlamps. The amount of space he had to run into was unbelievable because we were still thinking, ‘What the hell just happened… with the handball?’”\nAdvertisement\nButcher was in the drug testing room after the game with Maradona and, yet to see any television replays, asked whether he’d used his head or his hand. The Argentinian pointed to his head. “If he’d said he handled the ball I think my hand would have been round his throat, so he was clever as well as being a very good player,” he recalled.\nSteve Hodge, whose lobbed back-pass had inadvertently set up the first goal, swapped shirts with Maradona after the game, much to the distaste of room-mate Peter Reid. “I was lying on the bed when Steve went to his kit bag and got it out,” he says. “You can imagine what I said to him. I couldn’t imagine anyone going into that Argentine dressing room, let alone asking for that.”\nNot that Mexico 86 and a first World Cup quarter-final proper since 1970 provided an immediate springboard to further progress. England lost all three group games at Euro 88. Robson felt England had matured and it was right to rank them among the favourites for the tournament in West Germany, not least with the forwards he had at his disposal. He counted Chris Waddle, Gary Lineker, Peter Beardsley and John Barnes in his armoury. Yet Waddle was still feeling the after-effects of a double hernia operation, while the Liverpool pair “were running on empty, absolutely bushed, and could hardly raise a gallop” in the eyes of the England manager.\n“On yer bike Robson,” and “Go Now Robson,” screamed the tabloids with the term the “impossible job” coined after the early exit. The 1-1 draw with Saudi Arabia later that year brought with it the infamous “In the Name of Allah, Go” headline.\nMillichip’s patience eventually snapped. “The irony was that, just before the 1990 World Cup, the chairman let his tongue run away with him, and said Robson either had to win the World Cup or go, and Bobby reacted by approaching PSV Eindhoven,” said the FA chief executive, Graham Kelly. “Had this not happened, he would have served another four years, believe me.”\n“It was brutal,” Mark Robson says. “He had managed England for eight years and, realistically, they weren’t going to renew his contract. He agreed to take a new job after the World Cup — and he was called a traitor for it. It was completely wrong and incorrect. To be called a traitor and unpatriotic, that hurt him.”\nAfter the blood (mainly Butcher’s in a goalless qualifier away to Sweden), sweat and tears, it meant Italia 90 would be the finale. “Everything came together in that World Cup,” says the England squad member, Tony Dorigo. “The location, the team, how football captured a lot of people’s hearts and minds… to be part of all that was pretty darned special.”\nDavid Platt started scoring from midfield. The precocious Paul Gascoigne became a star of the tournament. Everything seemed to click, and even their mind games paid off.\nAdvertisement\nRobson and his staff became aware that a spy had been dispatched from the Cameroon camp to watch England training ahead of the quarter-final between the teams. Lineker, who routinely practised his favoured penalty routine 40 or 50 times at the end of a session, was pre-warned by the manager and deliberately switched to an alternative to put the scout off the scent. England were subsequently awarded two spot-kicks in Naples, with the striker twice beating Thomas N’Kono, who dived in the decoy direction.\n“I told you, I told you,” Robson said to Lineker before the start of extra-time once the plan had come together.\n“I’d got a massive amount of time for Bobby (Robson). He wasn’t the greatest tactician of world football. He wasn’t Pep Guardiola. But he had a good understanding of the game,” says Lineker. “He was fiercely loyal to the players who served him well, he understood the game and he had this magnetic enthusiasm, not just for football, but for everything in life. You just wanted to go out there and run yourself into the ground for him and the team.”\nIn the end, that tournament culminated in Gascoigne’s tears after picking up a second yellow card in the semi-final against West Germany and the subsequent penalty misses from Stuart Pearce and Waddle in the shoot-out. “Watching my friends and colleagues, Stuart and Chris, miss the penalties was heartbreaking,” says Lineker. “It’s the one thing I look back on in my whole career with massive disappointment and a feeling of ‘if only’.”\nThere was one more game to play, a third-placed play-off against the tournament’s hosts. “My father is Italian and I’ll always remember what he said to me after we’d lost 2-1,” says Dorigo. “I’d played the full 90 minutes, and he came up to me and said, ‘I couldn’t be prouder — my son has played incredibly well and we won the game’. I was, like, ‘Dad, that’s not right. We lost’.\n“But he was adamant. ‘Son, we won. Italy won and you also played well’. That put me in my place. We’ll be having a bit of FaceTime before the game on Sunday, so that should be interesting as we will definitely be on opposing sides.”\nThe squad had returned to Luton airport to be greeted by 300,000 fans, confirmation that the nation had re-engaged with the national team. Gascoigne donned a pair of fake breasts, supporters attempted to board the team bus as it crawled through the streets away from the terminal. The wide-eyed Wolverhampton Wanderers striker, Steve Bull, described the whole scene as “madness”.\nAdvertisement\nRobson, his reputation transformed, departed for Eindhoven as a national treasure. “It’s a wonderful feeling to know that your father was so well liked and so well respected — and a large part of that is respect for the way he coped with that pressure,” adds Robson Jnr. “I think it was only after he left the England job that people really began to appreciate his true character.”\nAs pre-tournament omens go, Dorigo reasoned as darkness closed in, this was hardly ideal.\nThe 1992 European Championship was just a couple of weeks away and Graham Taylor’s England had decamped to Finland. “Graham wanted to try a few new things,” explains Dorigo. “This was the first time a sports psychologist had been part of the set-up.\n“He and Graham were keen to use the time away in Finland as a bonding exercise. Nowadays, this sort of thing is the norm. But, back then, this was something new and I liked it.\n“One day, we were out in the sticks. Totally in the middle of nowhere. We’d been split into five teams of four and then had to do all these tasks, which were basically designed to get us to work together. There would be a puzzle, where there’d be all these pieces and we had to solve it among our team as quickly as possible. Cycling and running were also part of it, but orienteering is when things went a bit wrong.\n“Des Walker was in our team. He liked to do things his own way. So, we sent Des out to aim for the furthest point, meaning he could do that as we picked up the other flags or whatever it was we had to collect, and then meet him at the end — a great plan in theory, but the problem is Des got lost in the middle of this forest. By the time it had got dark and there was no sign of Des, we were starting to worry. A search party had to be sent out.\n“Thankfully, we found him in the end. But I do remember thinking, ‘Losing your centre-half when out orienteering isn’t the best omen for a big tournament’.”\nAs Dorigo feared, that exercise set the tone for much of what followed as the 1990 World Cup semi-finalists lost their way. After uninspiring goalless draws against Denmark and France, England crashed out via a 2-1 defeat to hosts Sweden. Taking off Lineker, England’s all-time top tournament goalscorer at the time, with a little under half an hour to play meant Taylor’s critics were handed an open goal.\nAdvertisement\n“Swedes 2 Turnips 1” screamed The Sun’s infamous headline, together with a photo of the manager’s head superimposed on a previously unassuming root vegetable.\nThat the squad was very much in transition — Peter Shilton, Terry Butcher and Bryan Robson all retired from international football after Italia 90 — or that defeat in Malmo had been only Taylor’s second in 24 games at the helm was neither here nor there to his critics. Likewise, the reality that injuries had ensured both Gascoigne and Barnes had sat out the finals.\nThe public. Even a quiet stroll down the street could find Taylor subjected to some fool bellowing ‘Turnip-head’ from a passing car.\nTaylor’s family were also considered fair game by some in the media. After one defeat, a television camera crew visited the manager’s parents. However, instead of knocking at the front door, they went round the back and walked straight in, camera running. “My parents were in their seventies and absolutely stunned by the intrusion,” he later wrote.\nFurther trial by tabloids lay ahead. Twelve months on from the disappointment of Euro 92, England’s qualifying campaign for the next World Cup was in trouble. So, when England lost to the United States in a summer friendly, the response was predictably vicious. “There was one headline that read ‘Yanks 2 Planks 0’,” recalls Dorigo. “Things like that must have hurt Graham.\n“Sure you can say, ‘Just ignore it’. But people are only human. I always say, ‘Put yourself in that situation — how would you have responded?’ Graham really got the rough end of things. After the defeat to the United States, we didn’t see Graham for two or three days. He was ill. Everything had got on top of him.”\nThere was little respite for Taylor or his players once the qualifying campaign for USA 94 resumed in the autumn. A controversial defeat by the Netherlands ultimately inflicted the fatal blow, even if further insult followed as the group’s minnows, San Marino, took just eight seconds to open the scoring in what proved to be Taylor’s final game in charge.\n“Not getting to the World Cup was massively disappointing,” recalls Shearer, who started up front in the critical 2-0 loss to the Dutch. “I was injured for a lot of that campaign. I snapped my cruciate ligament on Boxing Day 1992 and was out for the best part of a year once you factored in the operation, recuperating and getting back to fitness. Gary (Lineker) had also retired after Sweden, so I’m sure that didn’t help us in terms of qualification.\nAdvertisement\n“I’ve got a lot to thank him for and I always had a huge admiration for Graham because he gave me my England debut. But, if you look at it now, we just didn’t have the players.”\nTaylor bowed to the inevitable and stepped down in November 1993. Then came The Impossible Job, a Cutting Edge documentary for Channel 4 that was subsequently retitled Do I Not Like That when released on video. The intention had been to provide supporters with an insight into the unique pressures that come with managing the England football team. It did that alright, as the public was offered a ringside seat to a set-up that seemed beyond parody.\nThe documentary covered the full qualifying campaign but it was the trips to Poland, Norway and the Netherlands that dominated the final cut, as Taylor’s increasingly tortured touchline persona emerged in painful detail. “I’m just saying to your colleague here,” he said to the linesman in a near-whisper as the final few minutes counted down in Rotterdam. “The referee has got me the sack. Thank him ever so much for that.”\nOnly someone with a heart of stone could not have felt for Taylor in that moment. Sure, he had made mistakes — not least phasing out the likes of Chris Waddle and Peter Beardsley when they still had plenty to offer. But here was a thoroughly decent man who had simply been swallowed up by what, in his case at least, very much proved to be an impossible job.\n“I would never speak badly of Graham Taylor,” says Les Ferdinand. “But I always felt that he was never really accepted as a manager by the English press, they felt his football wasn’t worthy of the job. From Taylor’s side, I felt that he tried very hard to be what the press wanted him to be.”\nDorigo has similarly conflicted views when it comes to Taylor, who passed away in 2017 at the age of 72. “As a man, Graham was amazing,” he says. “A lovely guy who you wanted to run through a brick wall for. The flipside, though, is tactically some of the things we did were just not the way to do it. We just made life more difficult for ourselves.”\nAfter the darkness comes the dawn. Not usually a phrase associated with football, but there can be no doubt Terry Venables succeeding Taylor helped usher in a bright new era. A quarter of a century has passed since Euro 96. But, as the past few weeks have proved, a huge appetite remains to relive those glorious few weeks when the “30 years of hurt” that David Baddiel and Frank Skinner sang about on the soundtrack to the summer really did seem to be coming to an end.\nGazza’s goal against Scotland, redemption from the penalty spot for Pearce, even Andreas Kopke’s save from Gareth Southgate that brought the party to an abrupt halt… all moments when viewed again that transport us back in an instant.\nAdvertisement\nWhat many forget, however, when enjoying this saunter down memory lane is that the journey itself to that golden summer of 1996 contained more than a few bumps in the road.\nPerformances at a time when England could only play friendlies could be underwhelming as the public scratched their heads as to what exactly was a “Christmas tree formation”. Attendances, too, could be low with some fixtures at Wembley attracting barely 20,000 fans through the turnstiles.\nThrow in an ill-fated trip to Beijing and Hong Kong just before the tournament that proved to be the last hurrah for the hard-drinking footballer and it was no wonder the public were finding it hard to like its team as Euro 96 got under way.\nBut then Gazza turned Colin Hendry inside-out, the Dutch were blown away and, suddenly, “Three Lions” was blaring out everywhere.\n“Terry was one of the best coaches I’ve worked with,” says Ferdinand. “There wasn’t a player that went out who didn’t know what was expected from him in the system. He was also very confident in himself. With Taylor, it was as if he felt he had to produce otherwise it was going to be his last game. But Venables was pretty blase, with a confident swagger.”\nVenables was helped by having strong characters in his squad. These senior pros even helped turn the avalanche of negative publicity following that unseemly pre-tournament trip to Hong Kong into a huge positive by galvanising team spirit.\n“We went to this bar and it was initially going to be a couple of drinks,” explains Steve Howey, the Newcastle centre-half who had been handed his international debut the year before Euro 96. “We found this chair and didn’t know what it was for. The lads were inquisitive, went across and found out. The geezer would stand above you and pour it from a height and you had to swallow it, otherwise it spills all over the place. So, a good few of us had a go. It’s probably a bit sad that I was quite good at it!\nAdvertisement\n“Maybe not the best way to go about it before you play a big tournament. But we felt as though the criticism was completely over the top. It was the likes of Tony Adams, saying, ‘Look, fuck ’em — we close ranks, do it for the fans and ourselves, but not for the press because the press are wankers’.”\nAfter Spain were beaten on penalties in the quarter-final came Germany and a true classic. Gazza surely cannot be the only one who watches replays of his run and desperate stretch in an attempt to Shearer’s cross and still expect — this time — the net to bulge. “I still think about it now, the celebrations I would have done,” says the former midfielder, who expected Kopke to have cut out the cross. “I would have just kept running around the stadium.”\nSouthgate’s miss in the shootout meant the party really was over.\nEuro 96 had gripped the country, re-establishing the national team’s credentials at the top table, but it had been pursued by change.\nVenables was no more. It would be Glenn Hoddle, one of the country’s most technically gifted players and fresh from a three-year stint at Chelsea, who took his place in the dugout charged with maintaining momentum and leading the team to the World Cup. He inherited a group blessed with that rare blend of experience and exciting, emerging talent. Not that his tenure would pan out smoothly.\nIf victory at the preparatory four-team Le Tournoi de France a year earlier had served to whet the appetite, the finals proper at France 98 would end up the latest instalment of what might have been.\n“Glenn was a superstar and one of the best players I’ve seen play in English football,” says Les Ferdinand, a player who would earn seven of his 17 caps under Hoddle’s management but would fail to feature at all at the summer tournament. “It wasn’t simply a case of him saying: ‘Do as I do, not as I say’. But he just couldn’t get to grips sometimes with people not being as gifted as him. To Glenn, everything came so naturally.\nAdvertisement\n“It would be that he would almost say, ‘You can do that’, not realising what he’d just done was sensational.”\nHoddle, keen to show he could make the big decisions from the get-go, had introduced the young, fresh blood of Rio Ferdinand, Michael Owen, Paul Scholes and David Beckham. But, having won Le Tournoi in the summer of 1997 and gone on to top their World Cup qualification group above Italy after a nail-biting goalless draw in Rome, the manager controversially omitted Gascoigne for the tournament.\nHoddle later claimed it was the “saddest decision” he had ever had to make, but pointed to the 31-year-old’s fitness as justification. Gascoigne never added to his 57 caps.\nThe group still travelled across the Channel confident they would make a positive impression on the finals. “It felt like a good squad, the right mix of excitement, experience and talent, and we fully expected to go deep into the tournament and, in fact, win it,” says Alan Shearer, who captained the side.\n“When you look at the group you thought, ‘Wow, we’ve got some very good players here’. I felt the combination of the team was good at the time in terms of the experienced and younger heads,” adds Ferdinand. “Glenn was a very good tactician himself and just took it over from where Venables left off.”\nFor a while, it seemed promising. Scholes, Owen and Beckham all made a scoring impression to help England advance out of Group G, for all that the loss to Romania ensured a second-place finish and a trickier knockout tie. Yet Argentina represented a considerable barrier between Hoddle’s side and the quarter-finals. Progress appeared considerably trickier when Beckham’s petulant flick out in retaliation at Diego Simeone saw the midfielder sent off – he would later admit that was the worst moment of his career – just after half-time in Saint-Etienne with the score locked at 2-2.\n“I still think we’d have won the tournament if David hadn’t been sent off against Argentina,” says Shearer. “You go into tournaments believing you can win it. It didn’t happen because of the sending-off, although we very nearly did it with 10 men; we had a goal disallowed, then it went to penalties. I’m pretty sure we would have won it with 11 men.”\nThe Danish referee, Kim Milton Nielsen, was not done yet.\nAdvertisement\nIn extra time, Sol Campbell rose to meet Darren Anderton’s corner and nod the ball into a gaping net, only for the official to rule out the golden goal for an apparent push by Shearer as the centre veered in. “We had all jumped on his back and ran over to the dugout, going mad,” said Ince. “There was the gaffer shouting ‘Get back, get back’. The Argentines were bombing down the pitch trying to get a goal because the ref had given a foul. It was comical, really.\n“We didn’t know who was going to take the penalties at the end of the match. When we got to that situation, it’s like, ‘Who wants one?’ I felt I’d played really well and thought, ‘Yeah, I’m definitely taking one’. I just had that confidence. Now, when I look back at it, all I ever think is I should have put it to the other side.”\nCarlos Roa in the Argentinian goal palmed Ince’s effort away, cancelling out Hernan Crespo’s earlier miss in the process. When the goalkeeper repeated that trick to thwart David Batty at England’s fifth penalty, the older members of the team were left contemplating that familiar sinking feeling.\nInce departed the Stade Geoffroy-Guichard to be greeted by his wife and young son, Thomas, in floods of tears. “We believed we had the right quality of player, the right mentality, physicality, and an unbelievable spirit. Looking round that changing room, you just got that feeling, ‘This is it.’”\nHoddle would plough on towards Euro 2000 only for his position to be rendered untenable after he gave an interview to The Times in which he implied disabled people were being punished for sins committed in a former life. The Football Association digested his comments through 24 hours of meetings and discussions, but ended up determining he could not continue. In February 1999 they turned to Keegan to revive a spluttering qualification campaign. He would combine his duties with those as Fulham manager over the first three months of his tenure as he steered the club to promotion from the third tier.\nThere was relief to be had in edging out Scotland over two legs in the play-offs to reach the tournament, staged in Belgium and the Netherlands. But a team that, only recently, had counted themselves contenders had been rendered rather awkward. Other than one group game victory over a misfiring Germany, the finals were a reminder of more desperate times.\n“By 2000, it was just different,” says Shearer. “We were in transition as a squad, between generations of players. Older guys were dropping out or being phased out. Others were coming in and it was a balancing act which just didn’t work. It was an in-between tournament and nothing clicked.\nAdvertisement\n“Yes, we beat Germany 1-0, but their tournament was even worse than ours and ours was a disaster. There’d been loads of crowd trouble off the pitch and it was a very sour way for my England career to end.”\nEngland ended eclipsed by Portugal and Romania, again, to depart at the group stage. Within four months, Keegan was resigning in the toilets next to the home dressing room after a qualifying defeat to the Germans in the final match staged at Wembley before it was rebuilt.\n“I gave it my best shot, but I had also come to realise it wasn’t the job it was cracked up to be,” he offered in his autobiography. “I didn’t enjoy dealing with the FA. I didn’t like the way I had so little time with the players. I didn’t like the long, frustrating periods between games when the job could feel soulless, and it wasn’t easy knowing how to fill my time, sometimes bored rigid.\n“As great an honour as it was, England didn’t suit my style of management.”\n“What a climbdown. What a humiliation. What a terrible, pathetic, self-inflicted indictment,” cried The Sun.\nFor once this was not about an England performance that had fallen short of the expected standard. It was about the FA’s decision to put a Swede in charge of the English national football team.\nOr, as Jeff Powell put it in the Daily Mail, “we’ve sold our birthright down the fjord to a nation of seven million skiers and hammer-throwers who spend half their year living in total darkness”.\nSo it is fair to say not everyone rolled out the welcome mat for Sven-Goran Eriksson in November 2000. He had won league titles with IFK Gothenburg, Benfica and Lazio, plus the UEFA Cup and European Cup Winners’ Cup and got to a European Cup final, but there was resistance to the idea of appointing a foreigner to take charge for England. Powell said the fans would have settled for “Billy Anybody” rather than “Gianni Foreigner”.\nAdvertisement\nAnd yet chants of “Sven-Goran Eriksson”, to the tune of La donna e mobile, rang out around Villa Park as England beat Spain 3-0 in his first game in charge three months later. The public warmed to him with his clipped tones, gentle smile and ability to approach English football with a fresh eye. He won his first five games in charge and made it all look very easy.\n“As a foreigner, he had a kind of mystique,” Jamie Carragher recalls. “He had done big things with Lazio and we as players respected him. He took a lot of the emotion out of the job and that felt like a good thing. He didn’t get carried away. And he got results. But at the same time, I was never really that impressed by anything he did where you’re thinking, ‘Wow!’”\nWhat about the famous 5-1 win over Germany in a World Cup qualifier in Munich? “It’s funny. I analysed that game for my book,” Carragher says. “I watched it back and, although we were 2-1 up at half-time, we were a bit lucky. They were toying with us in the first half. And then we ran riot in the second half with the speed of Owen and Heskey. But I wouldn’t call it the great performance that people remember.”\nQualification for the 2002 World Cup was secured by Beckham’s stoppage-time free-kick equaliser against Greece and it felt as if England were heading to the finals on the crest of a wave. With Rio Ferdinand, Ashley Cole and Steven Gerrard joining the established figures of Gary Neville, Campbell, Beckham, Scholes, Owen and Emile Heskey, the FA chief executive Adam Crozier declared England had a new “golden generation” capable of ending that long, long wait.\nNeville and Gerrard missed Japan/Korea 2002 through injury, but England fought their way through a difficult group of Sweden, Argentina and Nigeria. Danny Mills, who deputised for Neville, recalls the joy and excitement from a win 1-0 over Argentina, thanks to a Beckham penalty. “Beating Argentina for the first time in a competition, with all the feeling from four years previously, was pretty special,” he says.\nHaving drawn the other two group games, Eriksson’s team progressed to the knock-out stage, where they swept aside Denmark 3-0. Optimism was soaring, particularly when they went 1-0 up against Brazil in the quarter-final.\nBut ultimately Brazil had too much quality: Ronaldo, Rivaldo, who equalised late in the first half, and Ronaldinho, who settled it with a long-range free kick that deceived goalkeeper David Seaman, who was anticipating a cross. “We got knocked out and Rio and I were dragged off for drug testing and we had to sit in a room with Cafu and Ronaldinho for something like three hours — which wasn’t great fun, as you could imagine,” Mills says. “Ultimately, we weren’t quite good enough.”\nWhen England players from that so-called “golden generation” look back in frustration at the opportunities missed in the 2000s, it is Euro 2004 that causes the deepest regret.\nAdvertisement\n“That was one where you think we could have done something,” Carragher says. “We had Sol Campbell, Gary Neville, David Beckham and Paul Scholes in their prime, and we had John Terry, Frank Lampard and Steven Gerrard, who were all approaching theirs,” Carragher says. “And we had Wayne Rooney.\n“Wayne was unbelievable at that tournament. He was only 18, but I can remember him dragging Lilian Thuram and Mikael Silvestre all over the place in that first game against France. We were sitting on the bench just watching with our mouths wide open because it felt like, with Rooney in that form, we could do anything.”\nFrom 1-0 up, England lost that opening game to France when Zinedine Zidane scored twice in second-half stoppage time. But they cruised through to the knockout phase, beating Switzerland 3-0 and Croatia 4-2. Rooney was outstanding, his impact likened by Eriksson to that of Pele as a 17-year-old at the 1958 World Cup.\nIt was an exciting time. Rooney looked fearless, unencumbered by the burden of expectation that would weigh so heavily at later tournaments. Lampard, too, was revelling in his first tournament experience.\nIn the quarter-final against hosts Portugal in Lisbon, Owen put England 1-0 up inside three minutes and the opposition defenders looked terrified of Rooney. England were heading towards the semi-finals and looking confident … but then Rooney cracked a metatarsal and limped off, his tournament over, and without him his team lost their way.\nStruggling to retain possession, with legs tiring, they dropped deep and conceded an 83rd-minute equaliser to former Tottenham forward Helder Postiga. As against Argentina in 1998, Campbell thought he had scored a late winner, only for the goal to be ruled out for a foul. Extra time was a gruelling test of endurance, with Rui Costa’s goal cancelled out by Lampard. The outstanding Cole won an enthralling duel with a young Cristiano Ronaldo, but others were flagging as the game drifted towards a penalty shootout.\nBeckham, who had looked tired throughout the whole tournament, missed the target with England’s opening kick, looking accusingly at a scuffed penalty spot. Rui Costa missed his too and the shootout went into sudden death, at which point substitute Darius Vassell had a weak shot saved by Ricardo, who then got up to smash the winning penalty past David James.\nAdvertisement\n“You just wonder what could have happened if Wayne hadn’t got injured,” Carragher says. “Germany, Italy and Spain had gone out earlier. You look how the draw opened up, you look at the fact that Greece won it and you think, ‘Maybe that was the one’.” So near, yet so far.\n“Going into that penalty shootout, I was so confident,” Paul Robinson says. “I was thinking, ‘This is going to be my moment’.”\nThat’s right. It came down to penalties again at the 2006 World Cup in Germany. Once again, it was Portugal at the quarter-final stage and once again Rooney had left the stage early — this time sent off for stamping on Ricardo Carvalho, a show of frustration, having suffered another of those dreaded metatarsal fractures in the build-up to the tournament and never managing to regain his sharpness.\nIt was Robinson’s first tournament as England goalkeeper and, after keeping three clean sheets in four matches, he felt this was their time to win on penalties. As Hugo Viana and Armando Petit missed the target, that conviction grew.\nBut among Robinson’s team-mates, a sinking feeling had taken hold. Lampard and Gerrard, so assured from the penalty spot for Chelsea and Liverpool respectively, had their kicks saved by Ricardo. Gerrard admitted to having been haunted for weeks. Carragher, who was brought on specifically to take a penalty after converting them reliably in training, beat Ricardo but was told to retake it, having gone too early. His second attempt was saved, setting up Cristiano Ronaldo to send Portugal into the semi-finals.\n“We did practise penalties at that World Cup,” Carragher says. “But… I’ll put it like this. When it went to penalties with Liverpool, I always thought we would win. With England, I didn’t.”\nNothing had really felt right from the start of the tournament. Victories over Paraguay and Trinidad & Tobago in the group were laboured, as was a 1-0 win over Ecuador in the last 16. “We were winning games and people kept saying, ‘Don’t worry about the performance’, and ‘Think how good it will be when we play well’, all of that rhetoric, but we didn’t play well,” Carragher says. “And that’s the thing about England at tournaments. We rarely played well.”\nEriksson, in his final tournament, appeared too conservative in certain areas selection-wise and perhaps a little too carefree in others. Taking a 17-year-old Theo Walcott, who had yet to kick a ball in the Premier League for Arsenal, seemed eccentric, as did the manager’s willingness to allow his players to leave their hotel to visit their families who were staying in the nearby town of Baden-Baden. The presence of the so-called “WAGs” (wives and girlfriends) and the ensuing media frenzy around them was described by Ferdinand as a “circus”.\nAdvertisement\nRobinson calls it a “media circus” but adds, “I don’t think it really affected the players or the team.” Carragher says, “It wasn’t ideal, but I would never use that as an excuse for us not playing well.”\nIt just felt like Eriksson and England had reached the end of the road.\nHis departure was hastened by a News of the World “Fake Sheikh” undercover operation which yielded little of substance, but by that stage the FA seemed ready for a change of direction.\nUnder Eriksson, England had been a “nearly team”, serial quarter-finalists, never quite getting the rub of the green when it mattered. But whatever that sense of missed opportunities and underachievement at a time when so many top-class players at the peak of their powers, things were about to get a lot worse.\nThe rain lashed down so hard, it felt like it was never going to stop. The new Wembley stadium had risen to dominate the London skyline, its 133-metre arch visible from miles around. But on the foul, filthy evening of November 21, 2007 it felt like a monument to English football’s hubris.\n“Golden generation”? From falling at the quarter-final stage at the previous three tournaments, they missed out on Euro 2008 altogether. A miserable qualifying campaign under Eriksson’s successor Steve McClaren came down to tense final game at home to Croatia — and within 14 minutes England were 2-0 down as their poor, beleaguered, bedraggled manager sheltered on the touchline under an umbrella.\nMcClaren had gambled, dropping Beckham and picking Scott Carson in goal for only his second cap after losing faith in Robinson. That gambled backfired spectacularly as Niko Kranjcar’s long-range shot squirmed through the 22-year-old’s grasp and into the net. Ivica Olic made it 2-0 six minutes later and by half-time FA board members in the hospitality suite had agreed that McClaren would have to go even if somehow England fought back to qualify.\nAdvertisement\nBriefly, they seemed to have done so as Frank Lampard pulled a goal back from the penalty spot and Peter Crouch equalised. But they still couldn’t see the game out and secure the draw would have taken them through. Carson was beaten from distance again, this time by Mladen Petric, and the boos and jeers at the final whistle told of anger with a group of players who excelled at club level but seemed to have lost the ability to play for their country.\n“A horrible night,” says McClaren, who was sacked the next morning.\nThe McClaren regime had started brightly enough with three straight wins, but then, in the space of four days, came an abject 0-0 draw at home to Macedonia and a 2-0 defeat by Croatia in Zagreb when Gary Neville’s backpass took a bobble and ended in the net as Robinson thrashed at a ball that was no longer there.\nAnother low point was a 3-0 victory away to Andorra, when it took England 54 minutes to make the breakthrough against a backdrop of hostility from their own fans in Barcelona’s Olympic Stadium.\n“That for me was the worst moment in terms of the fan and media intensity,” McClaren says. “My boys were being ridiculed and I was thinking, ‘Is it even worth carrying on?’”\nHe did carry on and results briefly picked up, but then came a costly defeat in Russia and, finally, what McClaren describes as “Croatia and the insanity of that”.\nMcClaren says “with hindsight there were a lot of things I wasn’t ready for” but insists he was right to take the job when it was offered. “I still believe it was the right step for me, having worked under Sven,” he says. “But I wasn’t able to take the opportunity. I didn’t manage to grasp it.”\nAs for the players, Gerrard, Lampard, Rooney and others found themselves booed by opposition fans on away grounds over the weeks that followed.\nThe England team seemed broken.\nAdvertisement\nFabio Capello was a winner. That’s how he was introduced by FA chairman Brian Barwick at a press conference to confirm his appointment in December 2007. “A winner with a capital W,” Barwick said. “That was the template, this is the man. Fabio Capello.”\nFew would argue with that. Quite apart from his successful playing career in Italy, Capello had won five Serie A titles (plus another two that were revoked at Juventus), two La Liga titles and one Champions League. He arrived with a richly impressive CV, a formidable aura, an iron fist and a disregard for the culture of failure that some were telling him had become ingrained. Nor did he care for reputations; Owen, who had been firmly on course to become England’s record goalscorer, was cast aside, his international career over at the age of 28.\nCapello quickly got to work, sifting through the wreckage of the Euro 2008 qualifying campaign. He demanded discipline and structure both on the pitch and off it. There was a strict rulebook: no phones at mealtimes or in meetings, no flip-flops and certainly no agents or WAGs at the team hotel.\nEngland players of that generation shudder at the memory of Heskey daring to glance at his phone under the dinner table and Capello flying into a rage, banging a silver tray down on a table in fury.\n“But I didn’t mind him,” Heskey recalls. “He was a disciplinarian, very strict, but I can get on with anyone. And we were getting results.”\n“Capello was like a breath of fresh air when he came in,” defender Matthew Upson recalls. “I totally respected him and his methods and learned a lot from him defensively. He could have told me to stand on my head for three hours and I would have done it.”\nFrom failing to qualify for Euro 2008, they qualified for the 2010 World Cup with two games to spare. They headed off to South Africa as one of their favourites.\nAnd then… it unravelled very quickly. Ferdinand suffered a serious knee injury in their first training session and flew home; Ledley King broke down as England were held to a 1-1 draw by the United States, who equalised when Clint Dempsey shot somehow squirmed through Robert Green’s grasp; a dreadful 0-0 draw against Algeria followed; through it all there were rumblings of discontent within their camp near Rustenburg, of tensions between various players and growing frustration with Capello’s austere, hard-line approach.\nAdvertisement\n“The facilities were the best we ever had,” physio Gary Lewin says. “They were brilliant. But we were in the middle of nowhere and the players got completely bored. Some of them went a bit stir-crazy. They felt like they were in a goldfish bowl.”\nThey scraped a 1-0 victory over Slovenia to reach the last 16 and an early encounter with Germany. There was talk of revenge for previous defeats and of how England’s greater experience might prove too much for Joachim Low’s young side. England suffered a humiliating 4-1 defeat.\nSome still clutch to the injustice of seeing Lampard denied what would have been an equaliser at 2-1 down just before half-time — the officials’ oversight proved the catalyst for FIFA to introduce goal-line technology — but Germany were superior in every respect. The so-called “golden generation” had been brought to its knees and Capello was left shaking his head at the failure of so many experienced players to handle the pressures of a World Cup.\n“It was a great squad,” Upson says. “But we really underachieved in the tournament, like so many have in the past. Why? A lot of things, but one of them was not being able to handle the expectation and the pressure. To play with total freedom, without fear, takes everything a group has. And we weren’t able to create that environment.”\nCapello survived a vote of confidence and led England to qualification for Euro 2012, but his authority and aura never really recovered from the misery of that World Cup. He resigned in February 2012 in protest at the FA’s decision to strip Terry of the England captaincy while awaiting trial over alleged racial abuse of Queens Park Rangers’ Anton Ferdinand. (Terry was acquitted at Westminster Magistrates Court, but was later banned by the FA.)\nThe mood and the spirit within the camp felt like a significant issue in 2010. But so did the lack of young players coming through now that one after another of the “golden generation” had reached the end of the road. Sir Trevor Brooking, the FA’s director of football, warned that the lack of emerging talent in English football might mean there were some tough times ahead.\nHe was right.\nAdvertisement\nThe Icelandic thunderclap echoing around the Allianz Riviera. The panicked look on the faces of the England players, helpless and hopeless. A group utterly overcome by fear, almost pleading for it all to be over so they could escape this ignominy. The colour draining from Roy Hodgson’s cheeks, a haunted look in his eyes, as he realised the game was up.\nAnd that spiteful, disgusted chant of, ‘You’re not fit to wear the shirt’ from those who expected so much more.\nA sense of shock pursued England out of Euro 2016. A team who had appeared to be growing ahead of the tournament had wilted horribly, all the familiar anxieties flooding back to choke all the ambition and pattern from their play. They were a group utterly overwhelmed by a one-off occasion. A team frozen by expectation. This side had won a friendly in Germany earlier in the year, recovering from 2-0 down. They had beaten the much-fancied French at Wembley.\nThose performances were supposed to be evidence of progress. In the end, they were exposed as a mirage.\nHodgson tends to grimace when talk of Iceland crops up these days. It was his nadir, an indefensible display and one that neither he nor his coaching staff that night can still truly explain. “There’d not been a performance like that in each of the two previous seasons with that squad,” said the assistant coach, Gary Neville, talking to ITV in 2018. “On and off the pitch in that Iceland game, we couldn’t impact the momentum of that atmosphere in the stadium, that feeling of negativity. That feeling of weirdness, really, because the atmosphere in that stadium was weird. The stage was weird.\n“The right substitutes? The timing of the changes? The right team selection? The right mentality going into the game? Were the players a little bit complacent? You never think any of that at the time. It came out afterwards that ‘we were complacent’ and thought we were going to get through. But I’ve known Germany book hotels for finals before and they’re called ‘prepared’. I didn’t see one player going into that game thinking it would be easy to win.\n“But we simply didn’t play well. That’s the one big regret.”\nAdvertisement\nHodgson’s four years and three tournaments in charge of the national team are tainted by the nightmarish memories of Nice. The events of that cataclysmic night overshadow all the positives of his four-year stint in charge. It is easy to forget how the players’ enthusiasm with the national set-up appeared rekindled over his tenure, with drop-outs from squads with mysterious injuries suddenly something of an exception. Or the attempts that had been made to implement a more possession-based game with the national team, an attempt to exert more control in tight contests and manage energy levels going into the finals.\nThe manager’s integration of Raheem Sterling, a player who had been handed his debut at 17, and Harry Kane tends to be shrugged off. It was Hodgson who first offered Luke Shaw, John Stones and Marcus Rashford a route into the senior setup. His record in qualifiers was exemplary. England were unbeaten in 20 fixtures on his watch, winning all but four.\nIt was just in the tournaments proper, when it really counted, where form deserted them.\nHis most impressive finals were his first, when he had barely had time to gauge the job at hand having been appointed seven weeks before the opening fixture, against France, at Euro 2012. Hodgson’s tenure actually began as a job-share as he concluded his contract at West Bromwich Albion and oversaw their final two games of the Premier League season.\nHe had two friendlies prior to the tournament in Poland and Ukraine before departing with his squad to Krakow, a city where the FA were convinced the players would feel freer than in Rustenburg two years earlier. Unfortunately, that choice had been made well in advance of the draw for the finals. “We ended up travelling to and from Ukraine for all four of our matches,” says Green, one of England’s back-up goalkeepers on the trip. “All that travel took more out of us than the games did.”\nThere was a draw with France in Donetsk and a rare victory over Sweden in Kiev before Wayne Rooney, banned for the first two games having been dismissed for kicking Miodrag Dzudovic in a draw with Montenegro the previous October, returned to score the only goal to beat the hosts back at the Donbass Arena. “In some respects when he came back, it raised the expectation levels again. We were only adding one player but because it was Rooney, suddenly it felt like we should win,” says Green. “The group stage went well. The momentum was good, the atmosphere in the camp was good. The manager couldn’t be questioned – he had been a coach for longer than we had been alive.\n“And then came the knockout against Italy. We were under clear instructions from the coaching staff to get close to Andrea Pirlo. ‘Do not give him the space to manipulate beyond our two banks of four. If you do, we’re knackered.’ But Pirlo knew that. It was like he was playing a game of chess with unlimited moves in any direction. He made more passes than the rest of our players put together. He was playing in slippers.\nAdvertisement\n“We were very defensive that night and not keen to play out short from the back. I remember chatting to Joe Hart in goal at the end of 90 minutes, when the score was still somehow 0-0. Joe was more used to dominating matches with Manchester City at the time and came up to me, saying: ‘How do you take all these goal kicks for every game?’ I presume he was referring to my more demanding task at West Ham. ‘I can’t do it. I’m fucked. My leg is hanging off.’”\nThere was an air of inevitability to the penalty shootout that decided that tie. Riccardo Montolivo may have missed the Italians’ first kick, but Pirlo ignored Hart’s best attempts at distraction to chip in a Panenka, Ashley Young struck the bar and Ashley Cole was denied by Gianluigi Buffon. “My former club-mate, Alessandro Diamante, was down to take their fifth and, as soon as he stopped to look back at me and wink, I knew we were out,” says Green. “Diamante knew how much I studied penalties from our time together at West Ham. I would spend half an hour before team meetings working on our opponents and which way they took it.\n“He was West Ham’s penalty taker that season so I knew his preferred side. The problem was, he knew I’d pass that on to Joe. When he deliberately went out of his way to acknowledge me before taking his spot kick, I wish I could have frozen time and run to Joe to tell him to dive the other way. Normally Diamante would whip the ball with his left foot into the right corner. That’s where Joe dived on my advice, too, but Diamante stroked it to the other side and that was that.”\nIf that tournament had been a free hit for Hodgson, there was arguably more expectation – and certainly anticipation – at the World Cup in Brazil two years later.\nAlongside Sterling in a youthful squad were the likes of Shaw, Ross Barkley, Alex Oxlade-Chamberlain, Phil Jones and Jack Wilshere. Only six players had previously featured at a World Cup. They prepared for the Amazonian heat by wearing three layers of clothing on a training camp on the Algarve in Portugal, then played friendlies against Ecuador and Honduras in Miami.\nThen it was off to Brazil and a base in Rio de Janeiro. Italy awaited in distant Manaus, then Uruguay in Sao Paulo. There was a thrill at the prospect of it all. “And then, after two games, we were out,” says the former Liverpool striker, Rickie Lambert. “All the preparation, all the hope, all the dreams… just gone in the blink of an eye.\n“I’m not going to try and dress it up. Once the Uruguay game was over, you just wanted to get home as quickly as possible. But, instead, we had to stick about for another four or five days to play the last group game (against the section’s winners, Costa Rica). That was like a testimonial. Just horrific.\nAdvertisement\n“Maybe we were too cautious. We’d been playing a diamond formation (in the qualifiers) and getting in everyone’s faces, but it changed a couple of weeks before the Italy game when we went to a rigid four at the back and five in midfield. With the players we had, we could have gone for it a little bit more. That may be a little bit harsh on Roy and Gary, which is the last thing I want. But I felt, with the pace we had, we should have got at Italy more. Gone for the kill from the off. They wouldn’t have been able to live with us.”\nRoy is one of the best man managers I came across and all the players loved him,” adds Lambert. “Even when we were out, everyone was more than happy to go forward with him. But when it really mattered, it never happened.”\nThat theme was maintained at Euro 2016. England had their moments in France. They were the better side in Marseille only to be deflated by a late Russian equaliser. There was the drama of their comeback victory over Wales in Lens, a success sealed in stoppage time at the end. But there was also the sight of Kane taking corners – “If the gaffer thinks I’ve got the best delivery to set up for others, that’s fine,” offered the striker – or Rooney operating in central midfield.\nAnd, ultimately, there was Iceland.\nThe FA’s five-man delegation present at Parc des Princes had been visibly pleased when Arnor Ingvi Traustason scored the stoppage-time goal against Austria that ensured England would be pitted against the smallest nation in the tournament in the round of 16. Hodgson and his assistant, Ray Lewington, were enjoying a sightseeing trip around the capital that day. They visited Notre Dame and took a boat trip along the Seine. Admittedly, they had access to extensive video footage of their next opponents, but the optics were hardly great.\nFor two days, the players practised repelling the threat posed by Arnur Gunnarsson’s long throw-ins. But six minutes into the game itself, with England actually already 1-0 up, Kari Arnason leapt above Rooney and Ragnar Sigurdsson, neglected by Kyle Walker, volleyed home from close range. “We never practised set-pieces at Manchester United in 20 years under Sir Alex Ferguson apart from when we went to Stoke and they had Rory Delap,” said Neville. “We practised it meticulously then. So we did the same with England, and then didn’t do our job on that first throw-in.\n“That first goal unnerved us. The whole thing changed.”\nAdvertisement\nThey were trailing to Kolbeinn Sigporsson 18 minutes in, and gripped by panic thereafter. Wilshere, with one Premier League start to his name all season, came on at half-time, though no one really noticed. “There was such a long period of the game still to be played, and we had total possession to try and break them down,” said Gary Cahill. “But I was watching everything in front of me and it was so frustrating. We couldn’t create a clear-cut chance. We ran out of ideas.”\nFor the second time at the tournament, England’s players would depart at half-time with the supporters’ boos ringing in their ears. The atmosphere was more poisonous still once their second half huff and puff had run aground. Hodgson and his staff, whose contracts were up over the summer, resigned just after full time. The players filed out of the Allianz Riviera in dribs and drabs. Joe Hart offered an apology to the fans.\nThe FA’s chief executive, Martin Glenn, had a brief chat with Kane as he was boarding the bus outside the ground ahead of the flight back north to their base in Chantilly. “He said, ‘Look, we all want to do better. It’s not just about being unlucky. We have to figure out how to make all this better.’”\nNot for the first time, the sense was something simply had to change.\nIt was approaching 1am on a Tuesday night in mid-July, 2018, by the time England’s crestfallen players, led by their manager, trooped back out onto the turf at the Luzhniki stadium to be serenaded one last time. Those supporters who remained – and there were plenty of them – bellowed their appreciation.\nThere was a rendition of that Southgate song, the one that had accompanied the team’s campaign and was somehow putting Atomic Kitten back on the map. There were tears. There was frustration and all the emotions generally associated with this team’s exit from a major tournament. But there was also something unfamiliar. Pride.\n“It was really moving,” said Jordan Pickford, who had lingered to survey the scene in the immediate aftermath of the World Cup semi-final loss to Croatia. “The fans were still there, long after the final whistle, chanting our names, celebrating what we’d achieved. That got to me. As a group of lads, we’d wanted to win the World Cup first and foremost for ourselves, but also for our families, for our fans and for the country. In the end we came up slightly short, but we could still look back on the tournament with a lot of pleasure.\nAdvertisement\n“And the country believed in us again. Beforehand, I’m not sure anyone was expecting too much from us. But we showed them the character in our squad. They could see we were capable of progressing.”\nIt should be acknowledged from the outset that Gareth Southgate, the architect of the revival, had initially not been that enamoured at the prospect of managing England. Or, at least, not in the circumstances originally and implicitly thrust upon him.\nHe had watched from afar in the summer of 2016 as Hodgson glumly endured his final press conference in Chantilly on the day after the dismal night before, in which the outgoing manager had three times muttered “I don’t really know why I am here” having resigned immediately after the defeat to Iceland in Nice.\nThe process would take time, those present were told. The selection committee would be prepared to wait for a candidate to complete a contract elsewhere. There was interest in Arsene Wenger, Brendan Rodgers, even Slaven Bilic. If it was all to drag, an interim could always oversee the beginning of the qualification campaign for the 2018 World Cup, starting in Slovakia in nine weeks’ time, and Southgate.\nBut the under-21s manager, fresh from victory at the Toulon Tournament, was not quite so sure. He had had no contact with Glenn, the technical director Dan Ashworth or the FA vice-chairman David Gill since the humiliation in Nice, and had no interest in being a stopgap. Indeed, he had justifiable concerns that taking on the role even for a temporary period might affect his future career.\nIn truth, he did not even consider himself ready to be a candidate for the full-time job and was more inclined to see out the final year of his contract with the under-21s before re-entering club football. Over the jittery 48 hours that followed, realisation dawned at the FA that they might have to look elsewhere, or at least speed up their selection of a successor.\nIt would be Sam Allardyce, a more experienced campaigner who was awarded a two-year contract, who would oversee that 1-0 win in Bratislava. It was also Allardyce who, after only 67 days in situ, was forced out of the role over allegations of malpractice after a sting by undercover reporters, provoking the appointment from which England are still benefiting now.\nAdvertisement\nThat unanticipated and unprecedented crisis dragged English football to new low and convinced Southgate he had no choice but to step in to fill the breach. He recognised the FA, now under the new chairmanship of Greg Clarke, had been placed in a dire position with so little time to find a replacement – Allardyce had been within days of naming his squad for the upcoming qualifiers against Malta and Slovenia when the mutual decision was taken to part ways – and duly agreed to fill the void.\nSo much about England’s tournament felt revelatory. Perhaps the joy the team induced merely reflected the depths to which the national side’s stock had fallen. They were far from the finished article. They lost three games at the finals, after all, and could not quite capitalise upon what had seemed an obliging draw to force passage into the final. Some of their key players ran out of steam as the games kept coming. But no one had expected such a young group to make it into the last four at the World Cup for the first time in 28 years.\nYet it was the manner in which it was all achieved which really caught the public’s imagination. Southgate’s group were open and encouraged to tell their stories by the management, whether to each other or to the media. There was a humility to them. They seemed to appreciate the circuitous journeys they had all been on to reach this point.\nPickford’s back story had included a loan spell at Darlington when they were relegated from the Conference, following by a stint at Alfreton Town. Jamie Vardy had his tales from Fleetwood Town in the lower leagues. Dele Alli had played in League One with MK Dons. Harry Maguire had done likewise for Sheffield United and, two years earlier, had been in the stands in France with a group of childhood friends urging England on. Even Kane had spent periods on loan further down the pyramid at Leyton Orient and Millwall.\nIt was an ego-free environment. Southgate asked them to play “with character”. That is what they did.\nThey were fearless, until that semi-final in Moscow anyway. They won their opening group game at a finals for only the sixth time across World Cups and European Championships since 1950, and had effectively qualified by half-time in their second fixture. At the Otkritie Arena in the capital, they exorcised their penalty-shootout demons to edge beyond Colombia and register a first knockout tie victory at the tournament in 12 years. And, from Volgograd to Samara, Kaliningrad to St Petersburg, plenty of on-lookers scarred by this team’s failures rejoiced in what felt like refreshingly uncharted territory.\nThis was new. This was fun, for those inside and outside the group. “People had a feeling that playing for England was always misery and regret and recrimination,” said the manager. “In Russia, I think they saw it can be enjoyable.”\nAdvertisement\nUltimately, of course, it fell slightly short. “We felt we were good enough and could have done it, so it hurt,” said Kane. “But the fact we got as far as we did showed can be up there. It showed we could win knockout games. Reaching a semi-final was such a huge stepping-stone from what we’d been through two years before. But, obviously, the next step had to be to go one step further.”\nEven in defeat, they strove to learn. “We hadn’t been to a semi-final in so long as a country, so maybe the belief wasn’t there (in Moscow),” says Maguire. “Could we have been a little more brave with the ball? A little more composed?”\nSouthgate had kick-started the next stage of this team’s development even in the desolation of the post-match dressing-room at the Luzhniki in the small hours of that Muscovite morning. He had pointed out to his players, many of them tearful, what they had to do better in future if they were to improve. How they had “to learn from the moments that matter”. Already, he was looking ahead.\n“We have one of two paths to go,” said the England manager. “This is either a moment of rare hope and we sink back. Or we build in the way that Germany did in 2010.”\nFor the first time in what felt like an age, England had momentum. They had a new confidence, a unity of purpose and, in Declan Rice, Phil Foden, Jadon Sancho, Bukayo Saka and Jude Bellingham, an exciting crop of young talent emerging.\nThey were exciting times ahead of Euro 2020, which was to be held in venues across Europe but with the semi-finals and finals all at Wembley. The only concern was that the tournament might come too soon for some of the youngsters.\nThen came the Covid-19 pandemic, forcing football to shut down and then resume behind closed doors. Euro 2020 was postponed for a year. Still, might that bring more time to grow?\nAdvertisement\nEuro 2020 kicked off — on June 11, 2021 — in a strange atmosphere. Due to ongoing pandemic-related restrictions on crowds to stem the spread of the virus, there were only 18,497 spectators at Wembley to watch England beat old foes Croatia 1-0 in their opening match with a controlled performance and Raheem Sterling’s second-half goal. They won their group, drawing 0-0 with Scotland and then beating the Czech Republic 1-0, but there was nothing like the “Football’s coming home” atmosphere that had been hoped for.\nGermany, dauntingly, lay in wait in the round of 16. After an easing of Covid-19 rules, Wembley was almost half-full for the match. Or almost half-empty. Optimism was in short supply. That wasn’t a vintage Germany team, but the 2014 World Cup winners still had Manuel Neuer, Mats Hummels, Toni Kroos and Thomas Muller. They were still Germany. England were still England. They had not beaten Germany in a knockout game since… yes, 1966.\nChances were scarce, the atmosphere tense. But on 75 minutes, Kane, substitute Grealish and Shaw combined to tee up Sterling, who scored his third goal of the tournament. Cue bedlam.\nMoments later, Muller ran clear and looked certain to equalise, but he shot wide. Then Grealish crossed for Kane to head England into a 2-0 lead and euphoria swept through Wembley like, um, a contagious virus.\nYou might have thought a generation of England fans had built up immunity to false hope. But confidence soared as Southgate’s team thrashed Ukraine 4-0 in a quarter-final at Rome’s Stadio Olimpico, with Kane scoring twice. As well as Sterling and Kane, players such as Pickford, Walker, Stones, Maguire, Rice, Kalvin Phillips and Saka were growing in stature as the tournament went on.\nNow riding a wave of public fervour, England came from behind to beat Denmark in extra time back at Wembley in the semi-finals: grateful that a soft penalty was awarded in the 104th minute for a challenge on Sterling, grateful that Kane followed up to convert the rebound after his first kick was saved by Kasper Schmeichel. England were through to their first major final since 1966. Fans and players celebrated with a raucous singalong to Neil Diamond’s ‘Sweet Caroline’ (“So good! So good! So good!”).\nFour days later, that feelgood factor — along with Shaw’s left boot — swept England into a second-minute lead against Italy in the final. There had been mayhem outside Wembley, with thousands forcing their way in without tickets, but inside everything was going to plan for Southgate’s team.\nAdvertisement\n“We were on the front foot. Everyone was buzzing for it,” Rice recalled on former England full-back Gary Neville’s Overlap show. “Aggressive tackles were going in, strong winning headers, winning the second ball.”\nBut guess what happened. The tide turned and a sinking feeling took hold. As Rice put it, Italy’s midfielders “started to get on the ball and make things happen”. Leonardo Bonucci scrambled an equaliser midway through the second half. It had been coming.\nIt was all so familiar. There were echoes not just of that World Cup semi-final against Croatia in 2018, but of other occasions (Euro 2012, Euro 2004) when England lost control of the midfield and ended up clinging on desperately before paying the penalty in a shootout.\nThis time, after Pickford flung himself to block Andrea Belotti’s kick, England led 2-1 after two penalties each. Glory was almost within touching distance.\nBut from there, the sinking feeling took hold again. Rashford and Sancho, whom Southgate had sent on in the final seconds of extra time specifically for their penalty-taking prowess, could not convert their kicks. That meant Saka, just 19, had to score to keep England’s hopes alive. He hit it firmly, but Gianluigi Donnarumma dived to his left to make the save. Italy were champions of Europe. England’s agony went on.\n“And it’s awful, horrible, because we were so close to creating history,” Rice said. “Gareth said some lovely words: that we’d been amazing in this tournament, that we’d made so many people proud and it’s not the last of us — ‘We’ve got the World Cup coming up. We’ll push again’.”\nOn the eve of their quarter-final in that 2022 World Cup, Southgate declared his players ready for the challenge posed by reigning champions France.\n“On these nights, you’ve got to have men that stand up and take on the challenge,” Southgate said. “We’ve got to nail this type of game now. Historically, we’ve always talked well, but the evidence wasn’t there. Now I feel differently and that’s because we’ve got evidence over a long period of results.”\nAdvertisement\nWorld Cup semi-finalists, then European Championship runners-up… was World Cup glory the next step? Rice, Bellingham, Saka and Foden were all gaining influence. A winter tournament for northern hemisphere nations — as opposed to the end of their club season, when England’s players have often appeared fatigued — to avoid the worst of the Gulf’s summer heat seemed to be a potential upside of the controversial decision to stage it in Qatar.\nFor once, England hit the ground running, thrashing Iran 6-2 in their opening game. Bellingham, at 19, announced himself on the World Cup stage with a goal that day and an excellent performance, surpassed only by Saka, who scored twice. A 0-0 draw with the United States four days later tempered optimism, but successive 3-0 victories over Wales and Senegal sent them into the last eight in confident mood.\nFor those watching back home, it was a strange experience, watching a World Cup with the central heating on. For many of those fans who travelled to Qatar, it was even less familiar — watching in sobriety and in atmospheres that were frequently sterile.\nBut some things don’t change. When it really mattered, when it was time to “nail” a game against top-class opposition, England fell short. Not far short by any means, but it was precisely what Southgate had talked about beforehand in terms of getting the job done.\nEngland, having fallen behind to Aurelien Tchouameni’s long-range shot on 17 minutes, looked the better team for much of the second half after Kane’s 54th-minute equaliser from the penalty spot — but on 78 minutes Olivier Giroud’s towering header deflected in off Maguire to restore France’s lead.\nWith six minutes of the 90 left, England were awarded another penalty. Kane stood behind the ball, up against his Tottenham team-mate Hugo Lloris for a second time that evening. He had the chance to break Rooney’s record and become England’s record goalscorer and, more importantly, to equalise in a World Cup quarter-final. He stepped up and… sent the ball flying over the crossbar. And the years of hurt go on.\n“It’s tough watching it back now,” Kane said as he sat through it again on UK TV’s Channel 4 three months later. “It still hurts. It probably will for most of my life.”\nAdvertisement\n“Statistically, it’s a game that you should win,” Southgate said in the same interview, pointing to an apparent foul on Saka in the build-up to Tchouameni’s goal. “It felt like a game that we should win. But we didn’t, and of course it’s (moments in) both penalty boxes and the fine margins that make the difference in the end.”\nEighteen months on from that night, opportunity is knocking once more at Euro 2024 in Germany. It is Southgate’s fourth tournament as manager to add to the four he was involved in as a player. He was in the thick of action — right in the firing line — at Euro 96 when the song was about just “30 years of hurt”. Unless he can lead England to glory in Berlin on July 14, it will become 60.\n“We’re trying to break this historic barrier,” he said, “and it’s a bigger one for us than the other six or seven (leading) nations, because there’s this additional feeling that we want to overcome. In the end, you have to keep knocking on the door.”\nKnocking, always knocking politely. Well, sometimes not even daring to knock at all. When it comes down to it, England are just going to have to work out how to force their way inside.\nGO DEEPER\nThe Radar - The Athletic's 50 players to watch at Euro 2024\n(Contributors: Oliver Kay, Dominic Fifield, Richard Sutcliffe, Adam Leventhal, Simon Johnson, Dan Sheldon, Charlie Eccleshare, George Caulkin)\n(Photos: Getty Images; artwork: Sam Richardson; graphics: Sam Richardson, Eamonn Dalton)",
  "word_count": 18484,
  "scraped_at": "2026-02-14T01:48:52.511692",
  "_text_extracted": true
}