{
  "article_id": "ea20db81f1bc",
  "url": "https://www.caughtoffside.com/2024/08/04/aston-villa-ready-to-sell-joao-felix/",
  "title": "Club ready to sell 24 - year - old ace to Aston Villa , but the player has other plans",
  "date": "20240804T134500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Atletico Madrid striker Joao Felix has been linked with a move away from the club this summer.\nThe 24-year-old Portuguese international was on loan at Barcelona last year and there have been rumours that Barcelona could look to sign him permanently this summer. So far, the two clubs have not been able to reach an agreement.\nPremier League club Aston Villa are keen on securing his signature as well and a report from the Spanish publication Sport claims that the 24-year-old attacker would prefer to wait for Barcelona. The situation is clearly complicated and it will be interesting to see how it unfolds. Atletico Madrid or desperate to get rid of the player and they are pushing for him to join the English club.\nMeanwhile, Barcelona were impressed with his performances last season and manager Hansi Flick is keen on signing him permanently. However, the two parties have not been able to secure an agreement yet.\nJoao Felix would be a quality addition\nAston Villa need to bring in attacking reinforcements and Felix would be the ideal partner for Ollie Watkins. The 24-year-old is more than just a goalscorer and he will add technical ability and creativity to the side as well. He could form a lethal partnership with the England international.\nFelix has played in England before during his loan spell at Chelsea. He should be able to settle quickly and make an instant impact at Villa Park. It will be interesting to see if the English club can convince the player to join them instead of Barcelona. They have secured Champions League qualification and they will be able to provide him with a lucrative contract as well.\nAston Villa will need to improve their squad this summer if they want to do well across multiple competitions next season. Someone like Felix would improve them immensely.",
  "word_count": 307,
  "scraped_at": "2026-02-14T01:48:56.590055",
  "_text_extracted": true
}