{
  "article_id": "ea768a9cadca",
  "url": "https://www.con-telegraph.ie/2024/04/23/mikel-arteta-says-mauricio-pochettino-was-like-a-father-to-him-as-young-player/",
  "title": "Mikel Arteta says Mauricio Pochettino was  like a father  to him as young player",
  "date": "20240423T104500Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta says Mauricio Pochettino was ‘like a father’ to him as young player\nBy Reuben Rosso-Powell, PA\nMikel Arteta said Mauricio Pochettino was “like a father” to him in his early playing days ahead of their meeting in Arsenal’s clash against Chelsea in the Premier League.\nArteta played alongside the Chelsea boss at Paris St Germain before their rise as coaches in Europe’s top divisions.\nThe Arsenal manager talked up the influence Pochettino had on him as a player, admitting he was inspired by the Argentinian as a teenager.\nThe pair will face off at the Emirates on Tuesday.\nWhen asked how influential Pochettino was for Arteta as a player, he said: “He’s one of the most.\n“I was 17 or 18 in Paris with no experience in professional football. He doesn’t like me saying it but to me he was like a father, he took me under his arm, he gave me incredible advice and protected me, he inspired me and I learned so much in our two years together.”\nArteta’s top-of-the-table Gunners have come a long way since he took over in 2019.\nThey sit one point ahead of Manchester City, who have a game in hand, and lead Liverpool on goal difference as they continue their bid for Premier League glory with five games remaining.\nArteta sought the opinion of Pochettino before leaving Manchester City as Pep Guardiola’s assistant to become manager of the north London side.\n“When I had to make a decision I asked him and explained the situation and he gave me some advice and he was needed,” Arteta added.\n“I admire what he’s done in his career and he’s someone I’ve looked to because he was impactful to me in the most important stage of my career. As a role model I can’t pick anyone better.\n“He doesn’t need to help me about tactics. The best influence he has had on me is the way he speaks about his life, his professionalism, his family and who he was as a figure in the dressing room and the passion and love he has for the game.\n“That for me is the most important things which I learnt from him.”\nA league title will be Arsenal’s first since 2003-04.\nArteta, whose side were dumped out of the Champions League by Bayern Munich last week, noted that there are further steps he wants his team to make in their development.\nHe said: “We need to see how we can make another step or two forward because that’s what this team is demanding to keep moving forward in a ruthless way because we’re not satisfied.\n“You can see the team really wants it. We will try to be as fresh as possible but I think we can cope with that.”",
  "word_count": 464,
  "scraped_at": "2026-02-14T01:51:24.793548",
  "_text_extracted": true
}