{
  "article_id": "ea97aa6e44f6",
  "url": "https://www.empireofthekop.com/2025/12/01/borson-liverpool-120m-loss-warning-europe/",
  "title": "Expert : Liverpool could lose £120m if they fail to qualify for Europe",
  "date": "20251202T014500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have been given a stark warning about the potential consequences of failing to qualify for next season’s Champions League.\nThe Reds have been near-annual participants in the competition over the past decade, missing out only once in the past eight years (2023/24), but a dismal run of results during the autumn has left them in eighth place in the Premier League at the start of December.\nArne Slot’s side are only three points adrift of fourth-placed Aston Villa as of Monday night, although the extraordinarily tight clustering of teams behind leaders Arsenal could lead to a frantic scramble for European places later in the season.\nExpert: Liverpool at risk of missing out on £120m in revenue\nStefan Borson – a former financial adviser to Manchester City – has warned of the scale of revenue that Liverpool could miss out on if they fail to qualify for the Champions League or even the Europa League.\nHe told Football Insider: “If they drop 10 places in the Premier League, that’s £30m straight away for this season. On top of that, you’ve got £100m let’s say of Champions League revenue at stake.\n“You can mitigate that somewhat by being in the Europa League, because you know if Liverpool were in the Europa League, you’d think that they’d get at least to the semi-final, so you’re talking probably downside of £70m maybe versus the Champions League.\n“If you were in the Conference League, you can forget about it. I mean, you’re talking about a downside of £90m probably. Obviously you make some savings on things like bonuses, but with those two together, you could easily lose £120m of revenue.\n“The league revenue would be this season, and the UEFA revenue loss would be next season. Over the two seasons, you’d lose £120m in that scenario. I don’t think it’s going to happen, but it could.”\nHowever, despite that chilling warning from Borson, he has backed Liverpool to ‘turn it around’ and finish in the top four.\nChampions League qualification is a must for Liverpool\nThe Reds did manage to bounce back at the first attempt after being absent from the Champions League two seasons ago, but unlike in 2025, the preceding summer didn’t see them splash out almost £450m in the transfer market.\nIt’s safe to say that FSG have budgeted for the club to be in Europe’s premier club competition at an absolute minimum, and the consequences of missing out on it for even one campaign could be dire, and not just in terms of bruised pride (or Slot’s job security).\nGiven that we’re still only 13 matches into the Premier League season and how tightly the teams are bunced right now, it’d be hard to make any definitive predictions about where Liverpool will finish, particularly given our Jekyll-and-Hyde record of seven wins and six defeats.\nOf course, the Reds could assure themselves of Champions League football for 2026/27 by winning the tournament outright this term, but despite being among the pre-season favourites, few would realistically back them to do so based on the drubbing they received against PSV Eindhoven last week.\nIt’ll be a tall order for Slot’s team to retain their top-flight crown from here, but they should still be finishing no lower than fourth with the quality that they have in the squad. For now, they just need to string together a few more wins, and that bare minimum objective should at least seem likelier to materialise.\nYou can watch Slot’s full post-West Ham press conference via Empire of the Kop on YouTube:",
  "word_count": 594,
  "scraped_at": "2026-02-14T02:09:38.455888",
  "_text_extracted": true
}