{
  "article_id": "eab9ab70552b",
  "url": "https://www.empireofthekop.com/2025/10/28/former-pl-ace-liverpool-man-disappointing/",
  "title": "Ex - PL ace claims Liverpool man is no longer what  he once was  ",
  "date": "20251028T223000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Matt Le Tissier has claimed Virgil van Dijk is no longer ‘as superior as he once was’ following Liverpool’s fourth successive Premier League defeat at the weekend.\nThe Reds suffered a 3-2 defeat away to Brentford on Saturday night in what was a performance Arne Slot admitted was one of the worst of his Anfield tenure.\nThe champions did not have any control of the game in west London and now find themselves seven points adrift of league leaders Arsenal.\nLe Tissier, who scored 100 Premier League goals during his career, believes Liverpool’s biggest problems lie in defence and has singled out the captain as a main concern.\n“I do think it’s probably at the back, is the real issue. I think they’ve lost a bit of quality in the full-back areas, and Virgil van Dijk is probably not as superior as he once was,” Le Tissier told Football Insider (as quoted by Live4Liverpool).\n“I remember watching him play at Southampton and in the first couple of seasons at Liverpool, he was like a man playing a game in kids football. You know, he was that good. He would would just control everything.\n“You never saw him out of position. He would never panic. But all of a sudden, I think you’re just starting to see him and Konate not really at their best, and teams are, kind of, thinking, ‘well, do you know what? If we have a go at them, we might have a chance.\n“So, yeah, I think the defence (is the biggest issue) at Liverpool. (Arne Slot) is still searching for the right combination in midfield, with (Florian) Wirtz still not firing properly.\n“And, obviously, (Alexander) Isak is still not really hitting the heights that he did at Newcastle just yet, but I’m sure that will come. It might just mean that it’ll be another two or three weeks before they really hit their straps.”\nLiverpool were very keen to bolster their squad during the summer transfer windows and spent over £400m on bringing the likes of Alexander Isak, Florian Wirtz and Hugo Ekitike to the club.\nThose signings were viewed as brilliant business from the Merseysiders but it’s yet to click for Slot’s side this term.\nDespite winning their opening five league games and thrashing Frankfurt 5-1 in the Champions League last week – there is plenty of work for our Dutch head coach to do if we’re to be anywhere near the Gunners come the end of the season.\nThere’s a feeling amongst Reds supporters that there’s far too much talent in the squad for this season to be a disaster but if we don’t tighten up our shaky defence soon then the season could prove to be a very disappointing one.\nVan Dijk is not alone in being well below par this term and the skipper will be more eager than anyone to turn things around!",
  "word_count": 483,
  "scraped_at": "2026-02-14T01:59:14.378553",
  "_text_extracted": true
}