{
  "article_id": "eabb8a901d82",
  "url": "https://www.90min.com/posts/power-rankings-the-best-teams-in-europe-week-30",
  "title": "Power Rankings : The best teams in Europe",
  "date": "20230413T173000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Power Rankings: The best teams in Europe - Week 30\nFollowing a week in which:\n- Man City steamrolled Bayern Munich.\n- Real Madrid obviously beat Chelsea.\n- AC Milan rather shockingly beat Napoli again.\n90min's Sean Walsh and Jack Gallagher sat down to record the first episode of our new podcast series '90min's Definitive European Power Rankings' and, yep you guessed it, rank the 10 best teams in Europe right now.\nLISTEN NOW\nOn this edition of 90min's Definitive European Power Rankings, part of the 90min podcast network, Sean Walsh and Jack Gallagher discuss the top 10 teams from across the continent after a busy week of Champions League and domestic football.\nIf you can't see this embed, click here to listen to the podcast!\n10. Villarreal (new entry)\nIn at number 10 this week thanks to their stunning 3-2 win over Real Madrid at the Santiago Bernabeu at the weekend. Go watch Samuel Chukwueze's goals if you haven't seen them yet, they were stunning.\nJack: \"They're not just in the rankings because of that one win, they've also in general been very good recently. They're unbeaten in the league since mid-February, and with five wins in their last six games they're really starting to push for that last Champions League place.\"\n9. Aston Villa (up 1)\nSeven games unbeaten and four wins on the bounce - there's no stopping little old Aston Villa under Unai Emery.\nThey're legit good.\nSean: \"The mood around the club has lifted...Emery and the players are going on a journey to prove people wrong. It's a great moment to be a Villa fan.\"\n8. Atletico Madrid (new entry)\nOne of the most quietly in-form teams in Europe right now is Diego Simeone's Atleti, who have won their last fives game on the bounce and are unbeaten in their last 12 La Liga matches.\nJack: \"Antoine Griezmann has been fantastic recently, and Atletico Madrid in general have been too.\"\n7. Real Madrid (-)\nAs expected, Real Madrid beat Chelsea 2-0 to take a commanding lead in their quarter-final tie.\nAs expected, Karim Benzema scored.\nAs expected, Real Madrid are one of the favourites to win the Champions League.\nSean: \"They're finding some form again. They're not contending for the title but they're gunning for the Champions League again and they're the Champions League team.\"\n6. Newcastle United (up 2)\nAnother week, another win for Newcastle.\nThey've really turned a corner since Alexander Isak returned to full fitness and are looking more and more likely to finish in the top four with each passing week.\nSean: \"If Newcastle are serious about being a Champions League qualifying team they have to beat these fairytale mid-table teams. They have to find a way to win these games. And they did just that.\"\n5. Lazio (re-entry)\nMaurizio Sarri's Lazio put his former club Juventus to the sword on Saturday, proving, without a shadow of a doubt, that they're the second best team in Serie A this season.\nJack: \"A lot of why Lazio are so good is down to Sarri and the club's willingness to back him and give him the time he needs.\"\n4. Barcelona (down 1)\nDown one this week following a rather boring 0-0 draw with Girona on Easter Monday.\nNot that they care, they've basically won La Liga already.\nSean: \"What Barça should be focusing on now is smashing all sorts of defensive records. They've played 28 games in La Liga and conceded nine goals. It's astonishing.\"\n3. AC Milan (up 2)\nA defensive masterclass against Napoli in midweek saw Milan take the driving seat in their all-Italian quarter-final.\nStefano Pioli may just have worked out how to beat Napoli...\nJack: \"AC Milan are so well coached and Pioli has worked out a way to play these huge Champions League knockout round games.\"\n2. Arsenal (down 1)\nDown to second place...which sounds quite foreboding for Arsenal, doesn't it?\nIn general, Gunners fans will be happy with one point at Anfield, but also know full well that Pep Guardiola's outrageous Man City side are primed to capitalise on the two points dropped.\nJack: \"It feels like every time Arsenal drop points Man City will make them pay for it.\"\n1. Manchester City (up 1)\nObviously Man City are top this week.\nThey put in an all-time great performance against Bayern Munich in midweek, and don't really look like they'll ever lose a game ever again.\nSean: \"Man City: the buzz-saw that's just taking everything in wake apart right now.\"",
  "word_count": 754,
  "scraped_at": "2026-02-14T02:16:40.056424",
  "_text_extracted": true
}