{
  "article_id": "ead45f660af2",
  "url": "https://clutchpoints.com/absolutely-absurd-uefa-chief-blasts-premier-leagues-new-stoppage-time-rules",
  "title": "UEFA chief blasts Premier League new  absurd  stoppage - time rules",
  "date": "20230831T214500Z",
  "domain": "clutchpoints.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA‘s Chief of Football, Zvonimir Boban, has strongly criticized the Premier League‘s new stoppage time rules, reported by goal.com. Boban labeled them as “absurd” and confirmed that these rules will not be adopted in UEFA competitions.\nThe Premier League's decision to implement longer stoppage times, inspired by the 2022 FIFA World Cup, aims to increase actual playing time and reduce time-wasting. This change has led to an increase in effective playing time from 54 minutes and 57 seconds to 58 minutes and 50 seconds, with some matches even exceeding the 100-minute mark.\nDespite this shift in the Premier League, UEFA remains steadfast in its approach. Boban, a former captain of Croatia's 1998 World Cup team, expressed his concerns over the impact of these extended stoppage times on player welfare. He stated that adding an extra 12 to 14 minutes of play in the final stages of a match when players are already fatigued is a “big tragedy.” Boban criticized the lack of consideration for player and coach input and referred to the move as “crazy.”\nZvonimir Boban's sentiments were echoed by UEFA's Chief Refereeing Officer, Roberto Rosetti. Rosetti highlighted the importance of the intensity and non-stop nature of matches, a characteristic that contributes to the allure of competitions like the Champions League. He emphasized that UEFA's approach focuses on increasing effective playing time by expediting the restart of play, rather than prolonging stoppage time.\nWhile some Premier League players, including Raphael Varane and Kevin de Bruyne, have voiced their dissatisfaction with the new stoppage time rules, UEFA's stance remains unchanged. The organization will continue to prioritize player welfare and maintain its distinct guidelines, indicating that these rules will not be implemented in UEFA competitions. The Premier League's decision, however, stands for the current 2023-24 season, with potential changes to be considered for the upcoming campaigns.",
  "word_count": 305,
  "scraped_at": "2026-02-14T01:50:52.139702",
  "_text_extracted": true
}