{
  "article_id": "eb115f53c090",
  "url": "https://auckland.scoop.co.nz/2025/04/the-scene-is-set-for-ofc-mens-champions-league-2025-final-in-solomon-islands/",
  "title": "Auckland . Scoop » The Scene Is Set For OFC Men Champions League 2025 Final In Solomon Islands",
  "date": "20250411T054500Z",
  "domain": "auckland.scoop.co.nz",
  "source_country": "New Zealand",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Scene Is Set For OFC Men’s Champions League 2025 Final In Solomon Islands\nPress Release – Oceania Football Confederation\nThe 2025 OFC Men’s Champions League final promises a thrilling encounter as Auckland City FC and Hekari United FC face off at the National Stadium in Honiara tomorrow.\nThe match features Oceania’s most decorated club and a former champion making a long-awaited return to the final.\nAuckland City go in as favourites, chasing a remarkable 13th title in this competition, while the team from Papua New Guinea is bidding for a second Champions League title, 15 years after their first.\nUnder the guidance of coach Paul Posa, the New Zealanders have demonstrated consistent dominance throughout the tournament having conceded just one goal in four matches.\n“It’s just a thrill to be in another final. These things should not be taken lightly, least of all by our club. I know we’ve been in plenty of finals, but every single time it’s a privilege and a hard-earned and hard-won honour.” Posa remarked at the pre-final media conference.\n“The favourites tag comes with the territory now, so I don’t see it as any added pressure. We’re not foolish enough to know that on the day, the better team is going to pick up that trophy and if Hekari are the better team on the day, they will pick up the trophy. So, it’s up to us, each and every one of us, to put our best foot forward and give ourselves the best chance we have.” Posa added.\nHekari United FC are making their first appearance in the final since their historic 2010 championship win. Led by coach Jerry Allen, who was also at the helm during their previous triumph.\n“I think firstly, to me, it was really special for us, especially the people of Papua New Guinea (to make the final). They’re really happy, been waiting for 15 years to come this far. Hekari supporters, non Hekari supporters, I would like them to support the team.”\nAuckland City captain Adam Mitchell is aware Hekari United will not make it easy for them.\n“We have watched a lot of footage of them. We watched them throughout the group stage this year. So, we’re well aware of their threats. They’re a very, very good team. We always respect our position, and we respect Hekari United as well. Look, we’re going to hopefully mitigate their chances because they’re a really good attacking side.” Micthell said.\nAnd Mitchell reserved some special praise for the host country.\n“I think everybody in the team would say they love this country. People are so happy and they’re so accommodating. The hospitality has been amazing, whether they’re a young person at school or it’s the hotel staff or just everyone involved in the community.”\nHis counterpart, Hekari United goalkeeper Dave Tomare said his side would do everything possible to bring the trophy home.\n“My boys, we’re going to work very hard to beat Auckland and as a team we will work together.”\nBoth sides have almost identical records having conceded just one goal each during the tournament.\nThe winner will represent Oceania at the FIFA Intercontinental Cup later this year.\nContent Sourced from scoop.co.nz\nOriginal url",
  "word_count": 536,
  "scraped_at": "2026-02-14T02:11:32.316841",
  "_text_extracted": true
}