{
  "article_id": "eb3237479e5e",
  "url": "https://economictimes.indiatimes.com/news/international/us/psg-vs-bayern-munich-in-champions-league-time-date-tv-channel-live-stream-of-lionel-messi-kylian-mbapps-match-in-us-uk/articleshow/97889468.cms",
  "title": "psg : PSG vs Bayern Munich in Champions League : Time , date , TV channel , Live stream of Lionel Messi , Kylian Mbappé match in US , united kingdom ",
  "date": "20230213T203000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "However, due to his participation in team training on both Sunday and Monday, Mbappé has been able to return to the squad earlier than initially predicted.\nOn Saturday, Christophe Galtier, the coach of PSG, stated that he would not take any chances with the French star and would opt for caution. Lionel Messi is also uncertain to play in the match as he has just recently returned to training following his own injury. In their recent games, PSG has suffered two losses, including a 2-1 loss to Marseille in the French Cup and a 3-1 defeat against Monaco in Ligue 1.\nPSG vs Bayern Munich: Kick off timing\nThe first match of the Round of 16 in the Champions League between PSG and Bayern Munich begins at 8:00 PM GMT, 3:00 p.m. ET on Tuesday, February 14.\nPSG vs Bayern Munich: TV, Live Stream\nThe match between PSG and Bayern Munich will be telecasted on BT Sport 2 in the UK. The live stream will be available on BT Sport website or app.\nIn the US, viewers can watch PSG vs Bayern Munich live on CBS and Paramount+.\nFAQs:\n- Who is the manager of Bayern Munich?\nJulian Nagelsmann. - Who won the Champions League final 2022?\nReal Madrid holds the title.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 278,
  "scraped_at": "2026-02-14T01:59:41.714612",
  "_text_extracted": true
}