{
  "article_id": "eb539ef7bff0",
  "url": "https://www.teamtalk.com/tottenham-hotspur/spurs-step-up-pursuit-world-cup-winner-insiders-check-three-traits-before-deciding-bid",
  "title": "Tottenham step up pursuit of World Cup winner as insiders check three traits before deciding on bid",
  "date": "20230224T144500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nTottenham step up pursuit of World Cup winner as insiders check three traits before deciding on bid\nTottenham Hotspur decision makers are investigating three key aspects related to one high-profile target who could solve one of their most pressing issues, according to the latest updates.\nAhead of the summer transfer window, Tottenham are already deciding what their priorities will be. First of all, they need some certainty about who their head coach will be. Whether that is Antonio Conte or someone else, there will then be some areas of the playing squad to reinforce.\nFor example, Tottenham might need to upgrade their defence, which has come under scrutiny at times. And behind them, there is the major issue of who their first-choice goalkeeper should be.\nHugo Lloris has held that role for a decade and will still be under contract next season. However, there is a feeling that the club captain’s time as a regular starter could be up.\nTottenham might be ready to evolve their goalkeeping department by bringing in a new shot-stopper to take over from Lloris. In that regard, they have been linked with plenty of potential targets.\nA recent report listed David Raya, Robert Sanchez, Mike Maignan and Giorgi Mamardashvili as potential options. There have also been links with the likes of Jan Oblak, Altay Bayindir and others.\nAnother of the contenders to sign for Spurs appears to be Emiliano Martinez. Currently with Aston Villa, he recently won the World Cup as Argentina’s number one.\nHowever, his future at Villa Park is unclear under his former Arsenal head coach, Unai Emery. Although under contract until 2027, Martinez could step up to the level of a club in European competition.\nA move to Tottenham would certainly be intriguing, given his past with their rivals Arsenal and the ill feeling that has developed between him and his former side.\nTottenham putting research in for Emiliano Martinez\nAccording to Football Insider, there is a concrete chance that Tottenham could make a move for Martinez in the summer.\nBut before they consider making a bid to Aston Villa, Tottenham are conducting checks about three things. The report claims they want to find out about his “skill-set, character and lifestyle”.\nThey are already impressed by his ability and mentality, but it seems they want to be sure about his background as well.\nFrom Martinez’s perspective, it would be ideal to join a club competing in the Champions League. Spurs are in that tournament this season and currently occupy a top-four place in the Premier League.\nWith that in mind, it is unlikely this will be the last update about Martinez being a Tottenham target. Obviously, though, they are covering all bases at present in their pursuit of a successor to Lloris.\nAs things stand, there doesn’t seem to be any leading candidate for the potential vacancy. Spurs should keep doing their research, as they are with Martinez, in order to make the most informed decision that they possibly can.",
  "word_count": 504,
  "scraped_at": "2026-02-14T01:55:49.892546",
  "_text_extracted": true
}