{
  "article_id": "eb54922560f9",
  "url": "https://www.chinadailyhk.com/hk/article/596936",
  "title": "Real Madrid coach Ancelotti : Football should stop after Valencia floods",
  "date": "20241105T084500Z",
  "domain": "chinadailyhk.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Published: 09:49, November 5, 2024\nReal Madrid coach Ancelotti: Football should stop after Valencia floods\nBy Xinhua\nMADRID - Real Madrid entertain AC Milan in the Champions League with fresh legs after their weekend game away to Valencia was postponed as a result of the flooding that has so badly affected the Valencia region, although coach Carlo Ancelotti admitted on Monday, he would like to see Tuesday's match postponed as well.\nIn his press conference, Ancelotti, who has also coached AC Milan, spoke about the Valencia floods and indicated that he would prefer Tuesday's match to also be postponed.\n\"Football is a celebration, and you can celebrate and have a party when things are good when your family is well, and everything is fine. When people aren't well, you shouldn't have a celebration,\" said Ancelotti.\n\"Football should stop,\" Ancelotti added that although \"there is a saying, 'the show must go on,' that isn't the case.\"\nWith Real Madrid also exempt from the first round of the Copa del Rey knockout competition that was played last week, it means it will be Carlo Ancelotti's side's first game since their 4-0 defeat at home to FC Barcelona in the Clasico on Oct 26.\nALSO READ: All weekend games in Spanish region of Valencia postponed after tragic floods\nIt is also the first match since the club boycotted the ceremony for the Ballon d'Or after learning that Vinicius Jr was not going to win the prestigious award, which instead went to Manchester City's Rodrigo Hernandez.\nAncelotti has been able to use the last week to work with his players and currently only has long-term injury victims, David Alaba and Dani Carvajal unavailable.\nHis side have two wins and one defeat from their three Champions League games to date, although they suffered a major scare at home to Borussia Dortmund in their last European game, falling 2-0 behind before a Vinicius hat-trick helped them roar back to win 5-2.\nTuesday also sees Girona in Champions League action as they travel to face PSV Eindhoven in the wake of Saturday's thrilling 4-3 win at home to Leganes, that game saw Bojan Miovski added to Girona's already long injury list, which has been a problem for coach Michel Sanchez all season.\nREAD MORE: La Liga clubs to help raise money for victims of Spain's flash floods\nGirona have already been beaten by Dutch opposition in this season's Champions League, with Feyenoord taking all three points in their Montilivi Stadium, and they will have to improve a defense that has been far from watertight to have a chance of finishing in the top 24 of the group.\nALSO READ\nMore\nWinter Games: Jilek makes progress for Czech skaters, Klaebo equals gold record\nMilan-Cortina day 6: Sun earns China's first medal of short track speed skating\nArsenal miss chance to go six points clear with draw at Brentford\nAtletico hit Barcelona for four to take giant step toward Copa del Rey final\nItaly's Olympic venue a pacesetter for Chinese resorts\nEarning her wings\nMilan-Cortina day 5: Ning earns China's first skating medal\nReal Madrid reaches agreement with UEFA to officially end Super League project\nFOCUS\nColumnists\nCOMPANY\nDownload Our App\nCopyright 1995 - 2026. All rights reserved. The content (including but not limited to text, photo, multimedia information, etc) published in this site belongs to China Daily. Without written authorization from China Daily, such content shall not be republished or used in any form.",
  "word_count": 576,
  "scraped_at": "2026-02-14T02:18:02.449629",
  "_text_extracted": true
}