{
  "article_id": "eb7a8fee0ecf",
  "url": "https://www.nytimes.com/athletic/6080808/2025/01/23/stefan-bajcetic-salzburg-liverpool-madrid/",
  "title": "Stefan Bajcetic Salzburg struggles : What next for the Liverpool loanee ? ",
  "date": "20250123T061500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is nearly two years since an 18-year-old Stefan Bajcetic lined up as part of Liverpool’s midfield when they took on Real Madrid in the Champions League round of 16.\nHe had seized the opportunity given to him by then-manager Jurgen Klopp and looked to be the next gem to graduate from the club’s academy.\nAdvertisement\nDespite the 5-2 defeat at Anfield in February 2023, the game confirmed Bajcetic had become a key part of Klopp’s squad as injuries, tiredness and other players’ poor form left the German searching for midfield solutions during a challenging campaign.\nBajcetic played four more times after that night, taking his tally of appearances to 19 that season, before injuries halted the Spain youth international’s progress and paused his career.\nNow, 20, the central midfielder once again found himself facing Madrid in the same competition on Wednesday — but this time he watched from Red Bull Salzburg’s bench.\nAfter joining the Austrian side on loan in the summer, Bajcetic’s move has yet to take off. While he has earned valuable experience by appearing in five Champions League matches, four of which have been from the bench, he was an unused substitute at the Bernabeu. His absence from the starting XI in eight of Salzburg’s last nine matches is not ideal.\nEarlier this month, reports emerged suggesting Real Betis were interested in signing Bajcetic on loan for the second half of the season. But a potential move was denied by sources from both clubs — who, like all those cited in this article, asked to remain anonymous to protect relationships.\nFollowing the sacking of Klopp’s former assistant Pepijn Lijnders at Salzburg in December, Liverpool gave no consideration to recalling Bajcetic. That plan remains unchanged and Bajcetic is set to stay at Salzburg for the rest of the season — where he will hope to make a more significant impact under new manager Thomas Letsch.\nSo, what is going on with Bajcetic and what is next for the Liverpool loanee?\nBajcetic’s rise to Liverpool’s first team was quicker than most imagined when he arrived at Anfield in December 2020 for around £224,000 ($276,000 at current exchange rates) from Celta Vigo.\nAdvertisement\nLiverpool saw off interest from Manchester United and Real Madrid to secure the highly-rated 16-year-old and academy staff had high hopes.\nAfter impressing for the Under-23 side and during pre-season with the first team, Klopp turned to Bajcetic in December 2022 when a number of midfielders were out of form or injured.\nHis impact was impressive given his age and lack of experience, but an adductor issue in March ruled him out for the end of the 2022-23 campaign. Attempts to return the following season (he played twice in September 2023) were thwarted by a calf injury and back problems — the latter were growing pains, which are common to young players who are exposed to increased activity.\nIt was a type of injury that meant it was difficult to project a return time. When Bajcetic felt close to recovery, pain would return and so too would the frustration. Surgery was considered but ultimately not required and instead Bajcetic underwent an extensive recovery programme which prioritised rest, patience and gym time. He did not return to the pitch until May 2024.\nWith his injury problems behind him, Bajcetic enjoyed a positive last summer working on his fitness and aimed to hit the ground running with Liverpool, featuring in their behind-closed-doors friendly against Championship side Preston North End in July.\nBut his hopes of playing a substantial role for Liverpool this season appeared to fade as he struggled to make his mark in pre-season. He played just 68 minutes across three games during the club’s tour of the United States and a further 16 minutes against Sevilla at Anfield.\nSeeking regular game time elsewhere was seen as the best possible solution instead of remaining on Merseyside. The midfielder is viewed by some at the club as more of a player suited to a Klopp team than one managed by new head coach Arne Slot at present, meaning further development was necessary.\nAdvertisement\nThe idea of reuniting him with Lijnders, who was instrumental in Bajcetic’s progression into the first-team squad at Liverpool and was appointed Salzburg boss last summer, suited all parties. It offered Bajcetic the chance to play Champions League football, experience a title challenge in Austria and gain regular minutes in a squad usually blessed with exciting, talented players.\nBarcelona made a late attempt to hijack the deal. They wanted to secure Bajcetic, who was born in Vigo and has appeared three times for Spain Under-21s, on loan – offering a fee of around €4m ($4.2m; £3.4m at current exchange rates) following a serious knee injury suffered by academy graduate Marc Bernal.\nBajcetic spoke to former Liverpool and Barcelona midfielder Thiago Alcantara, whose father Mazinho played alongside Bajcetic’s dad, Srdan, for Celta Vigo, about the move. The pair played for the same youth team, ED Val Minor Nigran, during the early years of their careers.\nThe idea of an option to buy was proposed, but did not appeal to Liverpool, and there were also concerns about the Spanish side’s ability to register the midfielder due to their financial problems. Liverpool did not want to take a gamble on him not being able to play.\nIt has not been the season Salzburg wanted. Lijnders inherited a squad that was full of young talent but lacked leadership. Despite a positive start, results tailed off. Salzburg sit fifth in the Austrian Bundesliga and have now lost six of their seven league phase matches in the new-look Champions League – including a number of heavy defeats, with the latest a 5-1 hammering by Real Madrid.\nThe youngster has made 18 appearances in all competitions, starting eight games. Bajcetic’s minutes played began to decrease in Lijnders’ final eight games in charge before the manager was sacked after a poor run of results.\nRegardless of age, a Premier League player signing for Salzburg meant there were huge expectations on him. Lijnders spoke very positively about the influence Bajcetic would have, but the midfielder has yet to become the dominant force supporters hoped for.\nAdvertisement\nSalzburg secured Champions League qualification through the play-offs in August before the arrival of Bajcetic and Bobby Clark, a fellow Liverpool youngster who was signed permanently for £10m.\nBajcetic’s role has been made trickier by playing in front of a backline that was weakened by the departures of Oumar Solet to Udinese and Strahinja Pavlovic to Milan. Staff felt there was insufficient business done to replace them.\nInjuries to key players compounded problems, further adding to a sense of instability in the team that grew as the season went on. The intense schedule meant there was little time to put things right on the training pitch, and ultimately Lijnders was unable to find a solution.\n“It all started so well for Pep,” says Michael Unverdorben, a sports writer for the newspaper Salzburger Nachrichten. “They qualified for the Champions League and then brought in two players from Liverpool. Pep told everyone, ‘They’re so good, they will play’. But something seemed to break in the squad after that. There are some difficult characters in the dressing room.\n“Bajcetic was infected by the general lethargy in the club. He has also had a difficult time.”\nIn October, before his side’s match against Brest in the Champions League, Lijnders said Bajcetic would be fined €500 for being late to training. This was an isolated incident, though, with disciplinary issues not a concern.\nAfter missing so much football in the previous 18 months, Bajcetic needed time to regain his competitive match fitness. A 26-minute cameo against Tottenham Hotspur in May was the only senior football he had played since September 2023. So far, he has completed 90 minutes only once and been given limited game time — 890 total minutes in all competitions.\nLiverpool have been pleased with the amount of minutes he has played. The expectation was never for the youngster to play every minute of every game, having been out for so long, but instead be managed carefully during the first half of the season.\nAdvertisement\nHe has been given little time to show his quality but there have also been more than a few glimpses of his talent. Liverpool have been in regular contact with the player and his loan club and see his spell there as very positive so far. His passing data in particular has stood out to his parent club.\n“From his first moments at Champions League level, his time with Salzburg has been characterised by a great first touch,” Tom Middler, a football commentator based in Austria, tells The Athletic.\n“He’s got excellent awareness in terms of his positioning, and that allows him to evade pressure, touch the ball away from markers and draw fouls time and again, plus nip in and intercept forward passes, all of which he has done frequently. He looks impressive on the ball too. From his passing vision to his flair when dribbling forward, he exudes confidence on the ball.\n“Unfortunately, that hasn’t resulted in Bajcetic being a player who can take the game by the scruff of the neck, and he just hasn’t accumulated enough minutes to really be the player to turn tough situations back into Salzburg’s favour. It’s a challenge to be regaining your sharpness when your team is struggling and the pressure is building on the manager. Perhaps he’s had the right skill set for the wrong situation.”\nBajcetic showed what he is capable of during his spell in the Liverpool side in 2022-23. There is a shortage of accomplished No 6s in Europe’s top leagues, so the approach has always been to allow him to build rhythm as he attempts to return to the levels he showed before injury problems took over.\nWhile a manager being sacked while a player is on loan is far from ideal, Liverpool believe it can be a chance for their players to adapt and respond to new challenges and changing situations. Dealing with adversity is all part of a young player’s development.\nBajcetic did not start either of Salzburg’s mid-season friendlies this month against Bayern Munich or FC Midtjylland. They have a squad packed with midfielders and, in the first friendly against Vincent Kompany’s side, he came on at half-time and was substituted with 10 minutes left.\nAdvertisement\nSalzburg have one Champions League game remaining before their domestic season restarts. Despite some struggles, Bajcetic is in good spirits after the club’s winter training camp based in Portugal, heading into the second half of the campaign before an important pre-season.\nHe will return with a view to forcing his way into Slot’s plans for the 2025-26 season.\nAdditional reporting: Mario Cortegana and Caoimhe O’Neill\n(Top photo by Justin Setterfield/Getty Images)",
  "word_count": 1809,
  "scraped_at": "2026-02-14T02:02:19.846443",
  "_text_extracted": true
}