{
  "article_id": "ebcdfcc99a2f",
  "url": "http://www.geosuper.tv/latest/42148-carlo-ancelotti-dismisses-manchester-citys-underdogs-claims",
  "title": "Carlo Ancelotti dismisses Manchester City underdogs claims - Football Leagues",
  "date": "20250218T234500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Reuters\nFebruary 18, 2025\nReal Madrid manager Carlo Ancelotti brushed aside Pep Guardiola's claim that Manchester City have a \"one percent\" chance of beating the Spanish side on Wednesday, saying that the defending European champions only hold a small advantage.\nReal came back to win 3-2 late on against City at the Etihad last week in the first leg of their Champions League playoff, but Ancelotti urged his side not to get ahead of themselves as they seek to seal a last 16 place in front of their own fans.\n\"Honestly, not even (Guardiola) believes what he said, but I'm going to ask him about it before the game anyway,\" the Italian joked in a press conference on Tuesday.\n\"He doesn't think they have a one percent chance of advancing and neither do we think we are 99 percent favourites. We have a small advantage due to what we did at Manchester and we have to use it in our favour.\n\"Learning to play with the advantage is a psychological issue and it is difficult to deal with it. I could come here and say that we have no advantage and will play as if we were 0-0... but it's nonsense and nobody would believe me.\n\"What you can control is the attitude of the team and ensure we play the same game as a week ago because it went well for us. But you can't forget that you have the advantage.\"\nAfter Real Madrid lodged a letter of complaint against LaLiga's referees after what they considered to be a number of unfair decisions, Carlo Ancelotti said the Champions League had fewer controversial calls, though he still had issues with VAR.\n\"I do (feel calmer), the statistics speak for themselves. There is less controversy and less intervention by the VAR (in the Champions League), which only intervenes when necessary,\" Ancelotti said.\n\"In the Champions League, only the best referees from each country are assigned and the quality is very high in this respect.\n\"I have doubts (about the VAR) because I think the VAR has taken too much responsibility away from the referee. It's a bit of a dangerous system.\n\"The VAR has been introduced to avoid blatant and obvious mistakes, not for interventions that are football-related. Often the aim is to remove all the naturalness of football for the sake of an image.\"",
  "word_count": 395,
  "scraped_at": "2026-02-14T02:26:28.924021",
  "_text_extracted": true
}