{
  "article_id": "ebefcf9ad850",
  "url": "https://www.aol.co.uk/articles/wednesday-briefing-tuchel-laughs-off-033059163.html",
  "title": "Wednesday briefing : Tuchel laughs off taunts and Republic keep hopes alive",
  "date": "20251015T041500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wednesday’s briefing: Tuchel laughs off taunts and Republic keep hopes alive\nEngland head coach Thomas Tuchel has achieved the first of his short-term objectives by qualifying for next summer’s World Cup with two matches to spare after a 5-0 win in Latvia.\nElsewhere the Republic of Ireland kept their hopes alive, while Cardiff have an altogether furrier problem at home to deal with.\nTuchel entertained by taunts\nThomas Tuchel took the taunts from England fans on the chin as his side booked their place at next summer’s World Cup.\nHarry Kane (two), Anthony Gordon, Eberechi Eze and a Maksims Tonisevs own goal earned a 5-0 victory over Latvia but Tuchel was on the receiving end of light-hearted chants responding to his criticism of the Wembley atmosphere in last week’s friendly against Wales.\n“I got a bit of stick today,” said the head coach, referring to chants like ‘We sing when we want’ and ‘Are we loud enough for you?’\n“So fair enough. Well done. I take it and good humour, good sense of humour.\n“They had a reason today from my last comments and I guess that’s fair enough. I got a bit of stick and I found it quite creative. It made me smile and this is how it has to be.”\nHallgrimsson remains hopeful\nHeimir Hallgrimsson has admitted the Republic of Ireland may need to do something special against Portugal next month if they are to make it to the World Cup.\nIreland’s relief at a hard-fought 1-0 Group F victory over 10-man Armenia courtesy of Evan Ferguson’s header was tempered by the news of Hungary’s late equaliser against the group leaders.\n“It doesn’t change anything. We always knew we needed to go to Hungary and have a win,” said Hallgrimsson.\n“This looks like we need a point against Portugal, or Armenia to do us a favour in Yerevan. We all see that this Armenian team is no roll-over.”\nWiegman wishes Bright well\nEngland boss Sarina Wiegman will always be grateful to Millie Bright after the Chelsea defender’s retirement from international football.\nBright, who was not part of England’s Euro 2025 squad after pulling out before the tournament, stepped down from national team duty on Monday after 88 caps.\n“At the back of the Euros we had a conversation and Millie told me she was retiring,” said Wiegman.\n“When a player makes a decision like that, it’s not appropriate to have that conversation (to persuade her to stay). I just totally accept it and respect it.\n“I’m just really grateful I’ve been a little part of (her) journey and hopefully she’s grateful about being part of my team because she had a massive influence.”\nCardiff tackling rat problem\nCardiff have defended their pest control policy after a rat halted play during the second half of Wales’ World Cup qualifier against Belgium.\nReal Madrid goalkeeper Thibaut Courtois made an unsuccessful attempt to catch the rodent during Belgium’s 4-2 win on Monday night before Wales substitute Brennan Johnson ushered the rat off the Cardiff City Stadium pitch.\n“The stadium is close to allotments and railway sidings and we know rats can be problematic. But we work closely with our pest control partners and do everything we can to keep them away,” said Wayne Nash, the club’s head of operations.\nWhat’s on today?\nChelsea will be looking to improve on last week’s disappointing draw with Twente when they host Paris FC at Stamford Bridge in the Women’s Champions League.\nSo far this season Sonia Bompastor’s side have only scored more than one goal in three of their seven matches in all competitions.",
  "word_count": 601,
  "scraped_at": "2026-02-14T01:52:49.025746",
  "_text_extracted": true
}