{
  "article_id": "ebf547ee586b",
  "url": "https://theathletic.com/4997511/2023/10/26/barcelona-lamine-yamal-rocafonda-el-clasico/",
  "title": "Lamine Yamal : Barcelona young prodigy and the proud neighbourhood that shaped him",
  "date": "20231026T113000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rocafonda is where Lamine Yamal grew up — if you can say that of a 16-year-old.\nThe Barcelona winger’s football development has progressed at an astonishing pace since his first-team debut, against Real Betis, at the age of 15 years, nine months and 16 days on April 29.\nThat evening, he became the club’s youngest player since La Liga was formed more than 90 years ago and earlier this month, on October 8, he became the competition’s youngest goalscorer after finding the net in the 2-2 draw with Granada.\nAdvertisement\nThis weekend, Real Madrid will consider him one of their most dangerous potential opponents in El Clasico and everyone who has watched him play will expect him to take the excitement in his stride. His talent has, inevitably, been compared to Lionel Messi’s — in the ongoing conversations at Barca and beyond about the need to carefully nurture his progress, too.\nIn Rocafonda, they have always known he is special and he remains strongly connected to the place. It is his “family and emotional core”, as one resident puts it.\nRocafonda is a neighbourhood that forms part of Mataro — a town of about 120,000 inhabitants roughly 40 minutes up the coast from Barcelona. It sits in a privileged position geographically but is a humble neighbourhood in the middle of a region of rich cities.\nLooking down from its hills on a Sunday afternoon, the Mediterranean Sea shines an especially stunning turquoise in the sun. It is October, but people are walking the streets in short sleeves, the temperature more typical of August than autumn.\nThe area around the local municipal sports ground is filling up with children and parents, ready to watch Rocafonda’s Juvenil A (under-17s) take to the field. Some onlookers approach and lean their elbows on the bars by the side of the pitch — a very typical image of Spanish regional football at grounds that do not have stands.\nYamal never got to play in this stadium. But he started on the concrete football court right next door, where children who cannot afford the registration fee at local clubs tend to play. It is one of the focal points of the neighbourhood and is graffitied at its head: ‘Rocafonda’.\nThere is more graffiti too, just with a number: 304. It’s on walls, on rubbish bins, everywhere. It refers to the local postcode: 08304. When Yamal celebrated his first Barca goal, he made a gesture in reference to the code, a symbol of identity, of belonging.\nAdvertisement\nOn the opposite side of the street, there are more signs of connection between Yamal and this place — at a small bakery run by one of his 23 cousins and uncle, Abdul. At the entrance, there is a mural of Yamal in his Barcelona shirt, completed by the flags of Morocco (his father’s country of origin), Equatorial Guinea (his mother’s) and Spain, where he was born.\nSurrounded by fresh pastries, bags of crisps and soft drinks, Abdul and his son are waiting for the rush to come. Since Yamal made his debut with the Barca first team, the bakery has become even more crowded than its strategic position allows. Soon, scores of children, hungry after playing football, will hurry here to buy their favourite snack.\nYamal’s grandmother Fatima appears. She is very petite and very kind, always grateful to anyone who shows interest in her grandchild. She was the first to move her family from Morocco to Spain 35 years ago. She came first, alone, and then she brought her children. Abdul has been living in Rocafonda for 30 years.\nFatima has been present in her grandson’s childhood, just like Abdul and his children. They have grown up together. But when Yamal was three, his parents separated and he went to live for a while with his mother Sheila in La Torreta, one of the neighbourhoods of Roca del Valles, very close to Granollers, a city to the north of Mataro.\nHis mother had found a new job at a fast food chain and there she met Inocente Diez, one of the key people in the turn that Yamal’s future was to take.\nDiez is known as ‘Kubala’ (after the Barcelona legend Laszlo Kubala) from his time as a local footballer, and he encouraged Yamine’s mother Sheila to sign up her son for the club where he was coordinator, La Torreta.\nView this post on Instagram\n“You could tell he was special,” Diez tells The Athletic. “At that age, you never know what’s going to happen, it’s such a big industry. But he seemed touched by a magic wand.\nAdvertisement\n“When he returned to live in Mataro, on many days his father could not accompany him to training, so he would call me and ask me to come and pick him up by car. On the way there we would always talk and I would tell him that one day, Barca were going to come and sign him. He would tell me no, no, no.\n“He was a very shy boy, very reserved. He was very sweet and charming. He listened to me when I gave him advice, and still comes to see me sometimes. He’s very humble and he’s still very close to his old friends. He doesn’t like to show off.”\nLa Torreta helped Yamal and his family when they had financial problems, as they did with other children, so they could continue playing.\nIt was common to see scouts at matches from regional lower-league clubs that try to invest in youth players, such as Damm or UE Cornella. But Yamal’s case was rare. He went straight to Barca.\nAs the story goes: one day a guy saw him from the stands and from there he called Barca and said they simply had to give Yamal a trial. It only took him one, and in 2014, when he was seven years old, he started training with them.\nGO DEEPER\nLamine Yamal and the Lionel Messi debate at Barcelona: Play him or protect him?\nDespite going to school in Granollers and playing in La Torreta, for Yamal, Rocafonda had still been home. He made a life there with his friends and cousins. Even when he later moved into accommodation at Barcelona’s youth academy, to the west of the city, that connection remained.\nWhen he first joined Barca, the club would provide a taxi service for him and some of the other children so that they could go to training during the week. On weekends, when he was with his mother in La Torreta, she would drive him to Barca games. When he was with his father, who didn’t have a car, often one of his youth coaches, Jordi Font, would pick him up in the early hours of the morning.\n“He usually spent the trips sleeping,” says Font, who coached Yamal with Barca’s under-10s during the 2016-17 season. “At that age, the movement of cars is like a sleeping pill for children and even more so at the times we had to travel. He wasn’t very talkative, only with his team-mates. But he was never one of the most talkative in general.”\nAdvertisement\nRocafonda is a neighbourhood that was formed with mostly new construction in the 1970s. It was a simple neighbourhood of working people — for locals and for economic migrants from other parts of Spain.\nOver the years, that demographic has changed. Gradually, Rocafonda emptied of the first families who arrived and the fact that many of the buildings housing flats had no lift meant that when people got older, they left. At the time of its construction, the place looked like a modern urban development in a city where the historical part was very old, but in some buildings, construction was not of the highest quality and renovations have not been made. Some flats are still without heating.\n“It is a neighbourhood that, with a different urban planning, would have been one of the best in the city,” says Maria Majo, a former teacher and member of the Rocafonda Neighbourhood Association.\n“It is an area with many possibilities but also with many limitations.”\nRocafonda has something of a reputation as a troubled place in the wider region, due to reports of violence between rival gangs in certain areas, or the high number of vacant buildings occupied by squatters in recent years. Residents say that yes, there can be fights, but it is generally a safe neighbourhood with a lot of family life.\n“The human quality is very good, but the economic and family situations are sometimes very difficult,” Majo says. She worked here for 41 years and has seen how many in the neighbourhood with unfavourable family situations have ended up studying at university.\nShe believes that since Yamal made his debut with Barca he has served as an example for many children who have seen how, through hard work and effort, he has managed to build a successful future for himself.\nThe last few months have been a whirlwind in Yamal’s life. He has gone from being an unknown teenager to an international star compared to Messi.\nAdvertisement\nHe has set record after record: the youngest to play for Barca for a century, the youngest to play in La Liga, the youngest to start a Champions League match, the youngest to play for Spain, the youngest to score for Spain.\nHe has become one of the players Xavi counts on. The Spanish Football Federation rushed to give him his international debut — not that he has looked out of place. He has made Barca fans forget about Ousmane Dembele. All this at just 16 years of age — he celebrated his birthday in July.\nYamal’s family and those who have followed his remarkable rise closely say the special bond he has for the neighbourhood where he grew up has been important in this. And even if his world has changed, his cousins, uncle and grandmother Fatima still live here. His father no longer lives in Rocafonda, but he frequents its streets a lot. He often goes to local bar El Cordobes, which proudly displays another Yamal Barca shirt.\nMany people here claim to know the footballer, and they each point out his humility; how little he has changed despite everything. They know he has not forgotten Rocafonda’s narrow streets, the smell of the sea on the wind, nor the three numbers that are part of his identity: three, zero, four.\nGO DEEPER\nEl Clasico: Real Madrid and Barcelona's week of tension won't change their alliance\n(Top photo: Eric Alonso/Getty Images)",
  "word_count": 1766,
  "scraped_at": "2026-02-14T01:51:09.224710",
  "_text_extracted": true
}