{
  "article_id": "ebf94e49096e",
  "url": "https://www.barcablaugranes.com/2024/1/14/24036945/real-madrid-barcelona-spanish-super-cup-el-clasico-team-news-match-preview-lineups-score-prediction",
  "title": "Real Madrid vs Barcelona , Spanish Super Cup Final : Team News , El Clásico Preview , Lineups , Score Prediction",
  "date": "20240114T030000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid vs Barcelona, Spanish Super Cup Final: Team News, Match Preview\nLos Blancos want revenge and Barça want a new start\nCompetition/Round: 2024 Spanish Super Cup Final\nBarcelona Outs & Doubts: Marc-André ter Stegen, Gavi, Raphinha, Iñigo Martínez, Marcos Alonso (out), João Cancelo (doubt)\nReal Madrid Outs & Doubts: Thibaut Courtois, David Alaba, Éder Militão, Lucas Vázquez (out)\nDate/Time: Sunday, January 14, 2024, 10pm AST (local time), 8pm CET/WAT (Barcelona & Nigeria), 7pm GMT (UK), 2pm ET, 11am PT (USA), 12.30am IST (India, Monday)\nVenue: Al-Awwal Park, Riyadh, Saudi Arabia\nReferee: Juan Martínez Munuera\nVAR: César Soto Grado\nHow to watch on TV: ABC (USA), Startimes World Football (Nigeria), Movistar (Spain), others\nFollowing a commanding win over Osasuna in Thursday’s semi-final, Barcelona return to action for The Biggest Game in the Game as the Catalans face their biggest rivals Real Madrid in the latest edition of El Clásico with the 2024 Supercopa title on the line at the Al-Awwal Park in Riyadh, Saudi Arabia on Sunday night.\nBarça come into this one after one of their most complete performances in months, with a somewhat uneventful 2-0 win that actually showed a lot of positive signs: Barça had more control of the game and their defense was almost never in trouble, and the Catalans finally won by more than one goal for the first time in literally four months.\nIt was a step in the right direction after a dreadful December and a poor performance against a fourth tier team in the Copa del Rey, but the Blaugrana are still in search of their best football as we enter the home stretch of the season and the opponents become tougher and the games are more important.\nThis was pretty much the same scenario Barça were facing ahead of last year’s Super Cup final against Madrid, and then the Blaugrana produced 90 minutes of breathtaking football that led to a dominant 3-1 win and the first trophy of the Xavi Hernández Era. It also started a seven-week stretch of beautiful football and great wins, and even though Barça couldn’t maintain that momentum for the rest of the season they proved they could compete against the very best.\nTwelve months later the Catalans are looking for yet another new beginning, and a big Supercopa Clásico win could provide yet another boost for the team as they look for a deep run in the Champions League and a serious challenge in La Liga. Barça showed against Osasuna that they are capable of doing better than what we’ve seen for most of the season, and they’ve raised their level against Madrid time and time again under Xavi.\nBut they’ll be facing a different Madrid team compared to last year, and Los Blancos showed in their epic semi-final win over Atlético Madrid that they have threats everywhere. Jude Bellingham and the two Brazilian forwards, Rodrygo and Vinicius Junior, were not near their best and the team still scored five goals and could have scored a lot more. Their defense is vulnerable but their attack feels unstoppable, and the team looks fully comfortable in their new system under Carlo Ancelotti this season.\nThey are also hungry for revenge after being torn apart by Barça a year ago, and even though they won their first meeting in the league this season Madrid were second-best in every department in the first 60 minutes of the game and needed two remarkable Bellingham goals to escape with a victory they absolutely did not deserve.\nLos Blancos want to leave zero doubts this time, and are motivated to win their first trophy of the season and show that they’ve finally cracked the code when it comes to facing Xavi’s Barça. They are in better form and are more dangerous than the Catalans, and there’s no shame in saying they are favorites in this one.\nBarça aren’t underdogs often, but they definitely relish playing that role under their current boss. Xavi’s Barça seem to play their very best when no one expects them to, and usually find themselves in trouble when they are supposed to beat everyone they face. They aren’t supposed to win this one, and if the Blaugrana can tap into the underdog mindset that seems to bring the best out of them they have a real chance.\nThe Super Cup is the least important trophy of the season, but El Clásico makes it means a lot more. It means everything to Madrid, in fact. And Barça must have the same attitude. This should be fun.\nLet’s dance.\nPOSSIBLE LINEUPS\nBarcelona (4-4-2): Peña; Kounde, Araujo, Christensen, Balde; Roberto, Gündogan, De Jong, Pedri; Ferran, Lewandowski\nReal Madrid (4-4-2): Kepa; Carvajal, Nacho, Rüdiger, Mendy; Valverde, Tchouaméni, Modric, Bellingham; Rodrygo, Vinicius\nPREDICTION\nThis is the least confident I’ve been going into a Clásico under Xavi. I know Barça always raise their level for Madrid, but Madrid really want this and they usually win the games they really want to win: 2-1 to the bad guys. Sorry.",
  "word_count": 833,
  "scraped_at": "2026-02-14T02:07:39.568844",
  "_text_extracted": true
}