{
  "article_id": "ebfbd3bfe1e5",
  "url": "https://www.bbc.com/sport/football/articles/cqeed7g5mzzo",
  "title": "Arda Guler :  Turkish Messi  shines in Euro 2024 win against Georgia",
  "date": "20240618T233000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Turkish Messi announces himself' - young stars shining at Euro 2024\n- Published\nAnother day, two more youngsters taking centre stage at Euro 2024.\nArda Guler curled in an early contender for goal of the tournament as Turkey broke Georgia hearts on their European Championship debut with a 3-1 win.\nAnd just a few hours later, 21-year-old Francisco Conceicao scored 111 seconds after coming on to earn Portugal a late 2-1 victory over the Czech Republic.\nGuler, the 19-year-old 'Turkish Messi', became the third teenager to score on his first Euros appearance - after Ferenc Bene for Hungary against Spain in 1964 and Cristiano Ronaldo for Portugal against Greece in 2004 - with a brilliant 20-yard strike.\nHe is also the youngest player to score on his European Championship debut.\nGuler joined Real Madrid in July from Fenerbahce and, after initially struggling for fitness and form, finished the season with five goals in five league matches as his club won La Liga and he became the first Turkish player to lift the Champions League.\nFormer Wales captain Ashley Williams said on BBC One: \"An incredible goal. We spoke about this being a chance to announce himself on the major tournament scene and boy did he do that.\n\"He showed his quality. We were expecting to see something from him - that is unbelievable.\"\nFormer England defender Stephen Warnock added on BBC Radio 5 Live: \"Earlier on in the game we saw Arda Guler roaming round the pitch [and showing] those nice touches that he possesses.\n\"The moment of magic that we saw with the goal was quite brilliant - that is only a glimpse of what he can do.\"\nWith veterans like Robert Lewandowski, Luka Modric, Ronaldo and 41-year-old Pepe possibly in their last European Championship, Guler is just the latest of the new generation to show European football is in good hands.\n\"The Turkish Messi has delivered - what a tournament this is becoming for the youngsters,\" said commentator Guy Mowbray.\nIn Group F's second game of the day, Porto's Conceicao continued the trend of young players impressing in this tournament as he drilled home an injury-time winner in his first competitive game for his country.\nEuro 2024's other shining stars\nJamal Musiala: Bayern Munich's 21-year-old forward caught the eye in Germany's opening-day rout of Scotland. Musiala, who represented England at youth level having spent much of his childhood in the country, was likened to Kaka by Arsenal legend Ian Wright post match.\nFlorian Wirtz: Another Germany youngster who took centre stage on Friday night. The 21-year-old Bayer Leverkusen forward became the youngest player to score for Germany at a European Championship.\nLamine Yamal: The Barcelona 16-year-old became the youngest man to play at the European Championship as he played a key role in Spain's 3-0 win against Croatia on Saturday. Yamal made a mockery of his age by dazzling Croatia defenders as his country make a real statement in their Euro 2024 opener.\nJude Bellingham: England's 20-year-old, who plays for Real Madrid, is the first European player to make an appearance at three major international tournaments before turning 21. The midfielder scored the Three Lions' winner against Serbia.",
  "word_count": 530,
  "scraped_at": "2026-02-14T01:51:32.428110",
  "_text_extracted": true
}