{
  "article_id": "ec28f5317bee",
  "url": "https://www.themag.co.uk/2025/10/truth-is-the-first-casualty-newcastle-united-form-and-goals/",
  "title": "Truth is the first casualty - Newcastle United form and goals",
  "date": "20251023T120000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Truth is the first casualty – Newcastle United form and goals\nFor Newcastle United fans, this has been an ‘interesting’ start to the season.\nFor some time we had been forced to accept that off the pitch matters were going to severely impact the early stages of this 2025/26 campaign.\nAlexander Isak was determined to force his way out of St James’ Park.\nYoane Wissa was determined to force his way into Newcastle United.\nThe summer transfer window as a whole had been a relatively slow one, with also injuries for Eddie Howe to deal with, plus longer-term recoveries back to full fitness still in progress for others.\nAhead of this match on Saturday against Fulham, I am hearing plenty of people (journalists, pundits, Newcastle fans…) asking when Newcastle United are going to find their goalscoring form.\nI want you to consider two sets of stats…\nOpening six Newcastle United matches of this 2025/26 season;\nVilla 0 Newcastle 0\nNewcastle 2 Liverpool 3\nLeeds 0 Newcastle 0\nNewcastle 1 Wolves 0\nNewcastle 1 Barcelona 2\nBournemouth 0 Newcastle 0\nPlayed 6 Won 1 Drawn 3 Lost 2 Goals Scored 4 Goals Conceded 5\nThe most recent six Newcastle United matches of this 2025/26 season;\nNewcastle 4 Bradford 1\nNewcastle 1 Arsenal 2\nUnion S-G 0 Newcastle 4\nNewcastle 2 Forest 0\nBrighton 2 Newcastle 1\nNewcastle 3 Benfica 0\nPlayed 6 Won 4 Drawn 0 Lost 2 Goals Scored 15 Goals Conceded 5\nThe thing is with statistics is that there are many different ways to present them.\nDifferent variations on the truth.\nFor those wanting to be negative, they are wanting to solely focus on AND present the Premier League statistics, especially when it comes to goals, as well as results.\nTo me, that is a ridiculous way to look at what has happened with Newcastle United so far, to ignore all of the other results (and goals and performances) in other competitions.\nAlso, you have to include all of the various other factors as well, not purely present chosen statistics that suit your agenda.\nThe fact is that Newcastle United have scored in all of their last six matches, 15 goals in total, winning four matches and losing two. We all know what happened in the Arsenal and Brighton matches, not beyond possibility that if things had fallen only slightly differently, this could have been six wins out of six, Newcastle were still leading deep into that Arsenal game despite second best with their performance, whilst Newcastle were well on top at Brighton and looking likely to get the winner, only to be sucker punched by the Seagulls on the break. That is football, it happens.\nHowever, the underlying facts, the statistics, also point to Newcastle United far better these most recent six matches, compared to the opening six.\nNo doubt some of you will say, well the last six games have been against generally lesser opposition, which may be true. Which is also kind of the point, or a large part of what I am getting at.\nHowever, the fact is that Eddie Howe has been in a far better position to deal with these last six games, as opposed to the first half dozen. You know, like having a striker available…\nWhat is more relevant when judging what kind of state Newcastle United are in to get a result in this Fulham match in the Premier League on Saturday….should we be giving so much weight to what happened say in the early goalless draws at Villa and Leeds, or should we be looking at games such as Benfica, Forest and Union S-G, even that (second half of the) Brighton match, United’s last four games?\nAs well as Woltemade and Wissa signed so late in the window and having no pre-season with their new teammates and unavailable for the opening games, you then had the attacking options further crushed with Gordon’s three game ban, plus then injuries to Wissa and Ramsey.\nAgainst the likes of Benfica, we saw just how devastating Woltemade and Gordon can be, that third goal when they combined to set up Barnes, was simply delicious.\nNewcastle United were undeniably poor in that first half at Brighton but this was away to a very good team, who have made a habit of winning against the likes of Man City, Liverpool and Arsenal. Eddie Howe\nApart from that, in the last six matches, the only time Newcastle United have been second best in terms of performance, was against Arsenal. Who were at the very top of their game and showed why they are top of the league and favourites to stay there.\nThis article isn’t to say that Newcastle United have now arrived, that everything is perfect and there will be no more setbacks.\nThis is football and so many teams are competitive now, whether that is Premier League, Champions League, or League Cup.\nHowever, what I would say, is that Eddie Howe and Newcastle United are getting there. They are now well on their way to recovering from so many obstacles that made the start to the season so difficult.\nAs someone once said/sang, maybe NUFC are “Halfway there” and Newcastle United aren’t simply “Livin’ on a Prayer”…\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 888,
  "scraped_at": "2026-02-14T01:59:14.386022",
  "_text_extracted": true
}