{
  "article_id": "ec3226adc426",
  "url": "https://thepeoplesperson.com/2023/05/01/sir-jim-ratcliffe-demands-transfer-control-while-sheikh-jassim-asks-for-financial-oversight-263444/",
  "title": "Sir Jim Ratcliffe demands transfer control while Sheikh Jassim asks for financial oversight",
  "date": "20230501T231500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are in the middle of a takeover process with the third round of bids recently getting over and now it is up to the Glazers to decide.\nAs recently reported by The Peoples Person, Sheikh Jassim bin Hamad Al Thani’s bid is circa £5bn ($6.3bn), but number includes the debt & around £0.8bn ($1bn) in pledged investment.\nSir Jim Ratcliffe’s bid for control of the club is significantly higher and he seems to be the favourite at this stage of the process.\nPre-sale demands from both bidders\nAnd according to The Telegraph, the INEOS founder is demanding for “immediate control of transfers” from the moment a potential sale has been agreed.\nSheikh Jassim, on the other hand, wants even wider oversight of club affairs if his offer for a full buy-out is accepted.\n“Under that request, the current Glazer family ownership would be running any potential financial commitment past the Qatari banking executive as soon as a deal got the green light.\n“Requests for complete control of the club prior to sale completion are unlikely to be accepted by the Glazers,” the report stated.\nDespite the Glazers’ stance, it is understood that such demands are not uncommon when it comes to major acquisition deals, especially when parties are aware that significant time will be required in between agreeing a deal and formal closing of said deal.\nInterestingly, these demands have come about potentially because there is a risk that the entire process could go on beyond the season ending and even spill onto the summer transfer window period.\nUnited fans protested against the Glazer family yet again prior to the game against Aston Villa, wherein they made it pretty clear that they want a full sale.\nClub takeover process might not finish before season-end\nRatcliffe’s bid includes the option of Joel and Avram Glazer staying on as minority shareholders without voting powers but fans want the American family removed from the equation completely.\nBoth bidders are aware of how crucial this summer is for Erik ten Hag and his project. The Red Devils are on the right track and on course for Champions League football next season.\nAdd the Carabao Cup trophy and the potential of adding the FA Cup to the mix, and new owners would like to back the Dutchman in the market as the club seeks to continue on its upward trajectory.\nIt will be interesting to see what turn the takeover story takes next. For United’s sake, it should be done and dusted as soon as possible as the club cannot afford to waste too much time in getting transfers over the line.\nFollow The Peoples Person on Twitter or Instagram for all the latest news as it happens and to join in the conversation.",
  "word_count": 461,
  "scraped_at": "2026-02-14T01:55:54.918485",
  "_text_extracted": true
}