{
  "article_id": "ec3affeb0500",
  "url": "https://www.caughtoffside.com/2026/01/14/newcastle-transfer-news-joe-willock/",
  "title": "Newcastle transfer news : Joe Willock could leave",
  "date": "20260114T150000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United midfielder Joe Willock reportedly wants to leave the club this January and they could be prepared to sanction his departure.\nThis comes as Willock supposedly attracts transfer interest from two Premier League clubs in the form of Leeds United and Crystal Palace, according to Football Insider.\nWillock had initially been a key player for Newcastle when he first joined from Arsenal a few years ago, but it’s fair to say he’s fallen down the pecking order in more recent times.\nSo far this season, the 26-year-old has started only six games in total in all competitions, so it seems clear that he needs to leave St James’ Park to get his career back on track.\nJoe Willock could be set for transfer away from Newcastle this month\nWith the likes of Bruno Guimaraes, Sandro Tonali and Joelinton to compete with for a place in Eddie Howe’s midfield, it’s not too surprising that Willock has seen less playing time.\nOne imagines Newcastle could do business this January as the likes of Leeds and Palace hover, though Football Insider suggests this will only be if they’re content they have the depth to cope without him.\nWillock might not be the best midfielder in this NUFC squad, but he remains a proven Premier League player who can come in and reliably do a job as a backup option.\nNewcastle have a lot of games this season as they’re in the Champions League and still have the second leg of the Carabao Cup semi-final to play, so they’ll want to ensure they have a decent amount of rotation options available to them in the weeks and months ahead.",
  "word_count": 276,
  "scraped_at": "2026-02-14T02:09:43.008865",
  "_text_extracted": true
}