{
  "article_id": "ec3ac3fafb94",
  "url": "https://www.teamtalk.com/manchester-united/ashworth-planning-audacious-man-utd-raid-for-dazzling-world-star-also-on-man-city-wishlist",
  "title": "Man Utd transfers : Ashworth looking to barge Man City aside with audacious raid prepped for dazzling world star",
  "date": "20240925T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nAshworth planning audacious Man Utd raid for dazzling world star also on Man City wishlist\nManchester United have made Nicolo Barella a prime summer target, according to a report, though Dan Ashworth’s prospects of a deal look extremely difficult with his valuation coming to light and amid claims Manchester City could beat them to the punch.\nThe Red Devils have invested heavily since the appointment of Erik ten Hag as manager, splashing out £560m (€670m, $749m) on new players across his three summer windows at the helm and with Antony, Casemiro and Rasmus Hojlund all costing fees over £60m apiece.\nDespite that, the Manchester United squad remains a ‘work in progress’ and they remain some distance short of the quality needed to challenge for the Premier League trophy. At a minimum, though, Ten Hag will be expected to steer the side into the Premier League’s top four again this season after an underwhelming campaign last time out that saw them finish eighth and leave the Dutchman on the cusp of the sack.\nOne area they did address over the summer was the midfield, having shelled out a fee that could top £50.7m (€60m, $67.8m) for Uruguayan destroyer Manuel Ugarte.\nHowever, TEAMtalk understands both Christian Eriksen and Casemiro are likely to depart at the end of the current campaign – and potentially as soon as January for the Dane – meaning the Red Devils will soon have at least one midfield signing to make.\nNow according to Fichajes, United are preparing a big-money offer to prise Barella to Old Trafford in 2025 – but will likely have to battle with noisy neighbours Manchester City if they are to win the race for the Italy midfielder’s signature.\nEXCLUSIVE ➡️ Barella makes four-man Man City wishlist as Guardiola seeks out replacement for injured Rodri\nMan Utd battle Man City as Barella price tag emerges\nThe 27-year-old is now in his sixth season for Inter Milan, who he joined from Cagliari back in summer 2019 on an initial loan.\nNow regarded as one of the premier central midfielders in the world game, Barella has long been linked with a move to Liverpool with the player often cited as being high on previous manager Jurgen Klopp’s wishlist.\nHowever, TEAMtalk revealed on Tuesday that the 57-times capped star is just one of four names that Manchester City are considering as they look to fill the gap left by Rodri’s ACL injury which will reportedly rule out the Spain star for the entirety of the 2024/25 season.\nFichajes though now claims United are readying a move of their own and are willing to meet the minimum £62.5m (€75m, $83.6m) valuation Inter Milan have on the player.\nPer their report, Ashworth has placed Barella right at the top of his 2025 wanted list in midfield, believing he will be the ideal foil for one of Kobbie Mainoo or Ugarte in the engine room.\nCurrently on a salary of €10m a year – around £160,000 a week – TEAMtalk understands that a deal to bring the midfielder to Old Trafford will be far from easy to pull off.\nFirstly, United will have a big issue convincing Inter to cash in. Contracted to the San Siro until 2029, they have regularly branded the player untouchable in the past amid big-money links elsewhere and it is unlikely their stance over his sale will change any time soon, given he is seen as vital to Inter Milan’s cause.\nFurthermore, with City potentially looking into a January move for the player, United are not in a position to make a move for Barella in the winter window, having budgeted for a summer move instead. But even then, talking Inter into a deal, let alone the player is understood to be far from easy.\nBig-money Man Utd flop ‘will be sold’ / major Luke Shaw problem emerging\nMan Utd, meanwhile, have been scolded for wasting millions on Brazil winger Antony, who has been told he is “more suited to playing in other leagues” and is now “playing for a transfer away from Old Trafford”.\nHaving slipped down the pecking order and with a miserable record since joining United, the 24-year-old must currently be regarded as one of the biggest-ever transfer disappointments in the club’s history, as things stand.\nElsewhere, the Red Devils have been warned by Sir Alex Ferguson’s former No 2 Rene Meulunsteen that they face a big problem down the line with Luke Shaw, with the left-back not appearing for United since February of this year.\nWith his deputy Tyrell Malacia not faring much better, United have been told why they will soon need to face a big decision over Shaw in particular.\nBarella stats show why he’s one of the best midfielders in world football.\nAn all-action midfielder, Barella has often been a regular source of goals for the Nerazzurri, contributing a total of 73 goals (22 goals and 51 assists) from 235 matches across his first five seasons at the club.\nRarely injured, his best season came in the 2022/23 campaign when he contributed 19 goals for the Italian giants as they reached the Champions League final, only to fall just short against Manchester City.\nDON’T MISS ➡️ Man Utd prepping mega-money offers to secure young duo who have blown Dan Ashworth away",
  "word_count": 889,
  "scraped_at": "2026-02-14T02:01:51.729429",
  "_text_extracted": true
}