{
  "article_id": "ec6ea85ba86f",
  "url": "https://www.teamtalk.com/liverpool/exclusive-liverpool-succession-plans-ageing-pair-revealed-new-signing-coming-shock-salah-exit-claim-is-clarified",
  "title": "Exclusive : Liverpool succession plans for ageing pair revealed with new signing coming , as shock Salah exit claim is clarified",
  "date": "20230302T171500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nExclusive: Liverpool succession plans for ageing pair revealed with new signing coming, as shock Salah exit claim is clarified\nTEAMtalk has learned how Liverpool plan to replace Roberto Firmino and it involves a new signing, while reporter Ben Jacobs has delivered an emphatic update on shock claims Mohamed Salah could join PSG.\nLiverpool have endured a nightmare campaign that has raised questions over many elements of their squad. The midfield is the area coming in for most criticism, though the defence and attack have come under the microscope too.\nJurgen Klopp boasts an all-star crop of forwards following the additions of Cody Gakpo and Darwin Nunez over the last two windows. Joining them in Liverpool’s final third are Mohamed Salah, Roberto Firmino, Diogo Jota and Luis Diaz.\nOf that quartet, both Salah and Firmino are the wrong side of 30. Salah committed his future until 2025 when penning fresh terms in 2022, while Firmino is poised to become a free agent at season’s end.\nThe Brazilian is expected to sign an extension, though speaking exclusively to TEAMtalk, reporter Ben Jacobs has shed light on Liverpool’s succession plan for the Anfield favourite.\nBut first, Jacobs ran the rule over Mohamed Salah in the aftermath of shock links to PSG.\nReports out of Spain recently claimed Liverpool would be willing to sell the Egyptian in the summer.\nAn €80m (approx. £70.5m) fee would apparently be enough to swing a deal and the tension was heightened amid the claim Salah would be willing to wave goodbye if Liverpool don’t qualify for the Champions League.\nHowever, Jacobs told us Salah remains “untouchable” on Merseyside and links with PSG are “wide of the mark”.\nSalah fully invested in Liverpool\n“It will be really interesting to see depending on how the second half of the season goes, how high in their priority list Liverpool consider a goalscorer or a creative minded player to be at the moment,” said Jacobs.\n“My sense from talking to sources is that Liverpool love the different ingredients that they have as far as their attack is concerned. But it’s about creating that balance and chemistry and Mo Salah is a good example.\n“It’s strange with Salah because a lot of people feel like he’s had an inconsistent or slightly underwhelming season and yet he’s scored 20 goals and nine of them have come in the Premier League. But Salah’s standards are so high that those numbers are a little bit down.\n“One of the reasons for that is because Salah has spent so much time for Liverpool playing in a very balanced front line and he had worked very well with Sadio Mane and continues to play effectively alongside Bobby Firmino.\n“But Firmino hasn’t had as much game-time and at their peak it was a devastating partnership. Now Salah’s having to play in a system that he’s familiar with, but he’s a little bit wider and is getting fewer touches in the box.\n“He also has to navigate a situation where Cody Gakpo is new and hasn’t yet found that World Cup form and everything is framed around Darwin Nunez scoring goals.\n“I think Salah has had to adapt a little bit and that creates question marks over the future of Firmino for example who Jurgen Klopp really likes even though he’s getting on a bit in terms of football years.\n“Salah is as well but those two are players that Liverpool really value and although there’s been rumour that Salah somehow wants to leave at the end of the season if Liverpool don’t get Champions League football, that’s not my understanding.\n“Liverpool remain fully invested in Mo Salah and he’s happy at Liverpool. Links for example with PSG at this stage are wide of the mark.\n“The fact of the matter is that Liverpool are invested in Salah, the player is invested in Liverpool, so he is effectively untouchable at this point.”\nProfile of Firmino successor revealed\nRunning the rule over Liverpool’s front line, Jacobs then divulged what he’s heard on the subject of replacing Firmino, as well as the standing of Klopp’s other attacking talent.\n“Obviously a player like Gakpo isn’t going anywhere,” continued Jacobs. “He’s only just joined Liverpool and they also appreciate Jota at this point.\n“Luis Diaz still has a role to play too so on paper, it does look like Liverpool have got maybe one too many forward-thinking players, but they’re versatile.\n“They can slot into different systems and formations and they’re all good characters as well that are quite prepared to buy into rotation. This is why Liverpool have got a lot of stability.\n“So whereas Chelsea have got a big squad and everyone wants to play, Liverpool are very consistent in their narrative to players.\n“They understand their pathways in the first team and they respect and appreciate how Klopp chooses to balance his squad.”\nHowever, Jacobs went on to note another central striker option is in the club’s thinking, though the player they sign is likely to be a long-term successor rather than short-term replacement for Firmino.\nAs such, any arrival at No 9 is likely to revolve around a younger player in the early stages of his career who the club hope to develop into a world class star over time. Moves for more expensive players in the primes of their careers will likely be left to the midfield.\n“That’s part of creating a succession plan for one or two of the older players like Salah and Firmino,” continued the reporter.\n“I don’t think it’s about replacing, I think it’s more about planning. So what Liverpool want to do is bring in a younger star for the future that can be part of a succession plan, rather than getting rid of and then replacing one of their star names.\n“This is what Liverpool have always done very well, they made sure that they went windows ahead.\n“They’ve also had that smoothness of transition to not have to scramble in the market and try and buy urgently because a player leaves unexpectedly or they have a hole in their system.\n“As a consequence, it’s all very calm from Liverpool’s perspective.”",
  "word_count": 1033,
  "scraped_at": "2026-02-14T02:12:28.617530",
  "_text_extracted": true
}