{
  "article_id": "ec73b1d7bb73",
  "url": "https://www.caughtoffside.com/2025/12/18/haaland-bellingham-rice-man-united-move/",
  "title": "Man United failed to sign Haaland , Bellingham & Rice",
  "date": "20251218T130000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ole Gunnar Solskjær’s time as Manchester United manager continues to be re-examined, and fresh insight into his transfer wishes has only intensified debate around the club’s recruitment strategy during that period.\nWhile at the helm at Old Trafford, Solskjær reportedly urged the club’s hierarchy to pursue future superstars Erling Haaland, Jude Bellingham, and Declan Rice, three players who have since gone on to become among the most influential figures in European football.\nInstead, United opted for a very different recruitment path, bringing in Donny van de Beek, Jadon Sancho, and Cristiano Ronaldo, according to Daily Mail.\nMan United wanted to sign Erling Haaland\nSolskjær’s admiration for Haaland was well documented. Having managed the Norwegian striker at Molde, Solskjær was acutely aware of his immense potential and believed he could become the focal point of United’s attack for a decade.\nDespite United holding a long-standing relationship with Haaland, the club hesitated over release clauses, agent fees, and long-term control, a delay that allowed Borussia Dortmund to secure the striker before his eventual blockbuster move to Manchester City.\nSimilarly, Solskjær pushed hard for Bellingham. United held talks with the teenager and his family, but concerns over pathway clarity and football structure reportedly played a role in Bellingham making a differenct choice for his career.\nHe is now among the top players in the world and shining for Real Madrid where he has also won the Champions League.\nRice was another key target. Solskjær viewed the West Ham captain as the ideal long-term anchor for United’s midfield, a leader capable of becoming an influential player.\nHowever, United baulked at West Ham’s valuation, a decision that later saw Rice join Arsenal for a record-breaking fee while United continued to search for midfield stability.\nRed Devils settled for other players who failed at the club\nInstead of securing these long-term cornerstones, United signed Donny van de Beek, who struggled for minutes and consistency, Jadon Sancho, whose time at the club has been defined by inconsistency and off-field issues, and Cristiano Ronaldo, whose emotional return initially lifted spirits but ultimately disrupted the club’s tactical balance and long-term planning.\nSuch decisions have proved to be harmful for the Red Devils and raises questions about their recruitment strategy.\nIt is clear that with all those three players that Man United missed out on, they would be title challengers now and a world class team.\nInstead, they have struggled for consistency and fallen behind teams like Man City, Arsenal and Liverpool.\nSources: Man United eager for double Premier League transfer raid but face City threat",
  "word_count": 426,
  "scraped_at": "2026-02-14T01:59:31.521441",
  "_text_extracted": true
}