{
  "article_id": "ec859fc56494",
  "url": "https://www.bbc.com/sport/football/articles/c203pj2gw81o",
  "title": "Can Tottenham salvage their campaign with cup success ? ",
  "date": "20250124T000000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'It could be a remarkable season' - can Spurs salvage campaign?\n- Published\nThere has not been a great deal for Tottenham fans to smile about this season.\nSpurs have won just one of their past nine games in the Premier League, are closer to the relegation places than the top eight and have a lengthy injury list that would hurt most teams.\nBut despite all that, there is still a chance this season could prove, as some pundits say, to be a special one.\nThat is because they are in three cup competitions, with Thursday's 3-2 win at Hoffenheim putting them on the verge of reaching the knockout stage of the Europa League.\nTheir dreadful Premier League form means it will be hard for any Tottenham fan to link this season to the word success, but Spurs have not won a trophy of any sort since 2008, so securing some silverware would be a huge positive.\n\"It could be a remarkable season for Tottenham,\" former Manchester United midfielder Owen Hargreaves said on TNT Sports.\n\"They could win a couple of trophies.\"\nWhat trophies could Tottenham win?\nEuropa League final day - who is through and what's at stake?\n- Published24 January 2025\nTottenham's Solanke out for 'around six weeks'\n- Published23 January 2025\nIs Postecoglou's style causing Tottenham's injury crisis?\n- Published21 January 2025\nAs well as the Europa League, Tottenham are also in the FA Cup and have a 1-0 first-leg advantage over Liverpool in the semi-finals of the Carabao Cup.\nThe win at Hoffenheim means victory for Tottenham at home to Elfsborg next week will see them into the knockout stage.\nThat game comes before a huge couple of days for Spurs as they travel to Liverpool in the EFL Cup on 6 February before going to Aston Villa in the FA Cup fourth round three days later.\nAround those they have important league fixtures against Leicester, Brentford and Manchester United as they look to avoid dropping lower than their current 15th place in the Premier League.\n\"It is a huge couple of weeks for the club,\" Hargreaves added.\n\"It defines their season, with the FA Cup and the second leg of the League Cup.\"\nFormer Tottenham striker Peter Crouch said: \"They are one game away from a final.\n\"They are in the ascendency there. If they get to a final that is a good season.\"\nTottenham are now among the favourites to win the Europa League.\nWith finishing in the top four unlikely, success in Europe's second-tier competition is their best way of securing Champions League football next season.\n\"The Europa League they have to prioritise now,\" added Crouch.\n\"I look at the teams and they are capable of beating any of them.\"\nHow bad has this season been for Spurs?\nTottenham manager Ange Postecoglou claimed earlier in the current campaign that he always wins a trophy in his second season at a club.\nThey are words he may well regret saying given how often they are used against him after a bad result, but while they may well turn out to be true, it does not excuse just how bad Spurs have been at times this season, particularly in the league:\nSpurs have lost 12 games in the Premier League this season, making it only the sixth campaign in which they have lost as many as 12 from their first 22 league matches, and the first time since 1997-98 (also 12 defeats).\nThe only sides who have lost more in the league this season are Wolves, Leicester and Southampton.\nSpurs have lost 18 points from winning positions in the Premier League this season - only Fulham (19) have lost more.\nThat final statistic has been particularly concerning, with Spurs often getting into decent positions only to capitulate.\nIt will have been on the minds of Tottenham fans watching Thursday's game against Hoffenheim as, after getting into a 2-0 lead, a poor second half almost proved costly.\nWith the Germans pressing high, Spurs retreated further and further back until Anton Stach made it 2-1.\nSon Heung-min's second goal should have ensured a comfortable end to the game but Hoffenheim scored again through David Mokwa with two minutes to go.\n\"We looked a bit tired in the second half but hung on,\" Postecoglou told TNT Sports.\n\"Sonny scored a great goal to give us that extra buffer. We had the schoolboys out there in the end.\"\n'They need to get players back' - but injury news gets worse\nThere is a sizeable caveat to Tottenham's struggles this season as they headed to Germany this week with 14 players out through injury.\nNews did not get any better after the game as Postecoglou confirmed striker Dominic Solanke will be out for six weeks. He missed the weekend loss to Everton after twisting his knee in training.\n\"No surgery but we're looking around six weeks,\" Postecoglou said. \"It might be quicker but we'll see.\"\nThere could, however, be some good news around the corner with some of Tottenham's injured players expected to return by the end of the month.\nThey include defenders Micky van de Ven and Cristian Romero, and midfielder Yves Bissouma.\n\"You would expect Tottenham to be back up there at the end of season when everyone is fit,\" Crouch added.\n\"We would forget this time if they go and win a trophy. There has been ridicule from other fans - they need to get that off their back and it has been far too long.\"\nPressure eased on Postecoglou?\nThe pressure has certainly been mounting on Postecoglou following Tottenham's poor domestic form and that would likely have increased had they failed to beat Hoffenheim.\nThe Australian was in a positive mood after Thursday's win, saying: \"I thought the senior boys all really stood up. You need your leaders to stand up and they did.\n\"I told the players to enjoy it. Winning away in Europe - it's a significant victory for us and gives us a good foothold to get into those top-eight spots which will give us a week off.\"\nBut that pressure will likely return unless Tottenham can go all the way in a cup competition.\n\"It has been proven. Nuno, Conte, Mourinho - they are not bad managers but none brought the success Tottenham crave,\" Crouch added.\n\"Ange is not a bad manager but delivering success seems to be the holy grail.\n\"Whoever delivers it will be loved at Tottenham for so long because it has been so long.\"\nHargreaves added: \"Back the manager and this season could turn into something special.\"\nWhat will be a successful season? Fans have their say\nSimon: As a Spurs fan I would take finishing 17th if we win a cup. Winning something is the priority, but only if we stay up.\nGareth: To be honest, I think the league is done for us this season. I'd rather we settled for a mid-table finish and instead focus on the cups. A cup win - any cup win - would make this season a success, especially with all the injuries we've had. For me, this is a transitional season. Things will get better next season… I hope.\nBen: Success this season depends on how quickly players return from injury. Currently getting into the Europa League play-offs and avoiding relegation would be good. If we get players back then it could become positive very quickly. I believe in Ange, anything is possible.\nTom: Let's be honest, Spurs' season has been totally ruined by injuries. From here, a trophy and a top-half finish would be exceptional, and something for Ange to build on.\nRelated topics\n- Published16 August 2025",
  "word_count": 1279,
  "scraped_at": "2026-02-14T02:08:52.964336",
  "_text_extracted": true
}