{
  "article_id": "ec875638b5e6",
  "url": "https://www.theguardian.com/world/2023/dec/19/first-edition-israel-hostagesalon-shamriz-samer-al-talalka-yotam-haim-",
  "title": "Tuesday briefing : Will the accidental shooting of three Israeli hostages be a  sea change  moment ? | World news",
  "date": "20231219T071500Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning. On Friday morning, in broad daylight, three young Israeli men who had been taken hostage by Hamas emerged near an Israel Defence Forces (IDF) position in Gaza, waving a white flag. They were unarmed, and shirtless, to show that they were not carrying explosives. An IDF sniper shot two of them dead, and wounded the third.\nThe survivor fled to a nearby building. He was heard shouting for help in Hebrew. When he reemerged from cover, he too was shot dead. A search of the building was carried out, revealing banners bearing the messages “Help, 3 hostages” and “SOS”.\nThe killing of Yotam Haim, Alon Shamriz and Samer Talalka (above) was described by IDF chief of staff Herzi Halevi as contrary to the military’s rules of engagement. They “did everything so that we would understand,” he said. But he also said: “We must continue the fighting with might, without taking our eyes off its goals.”\nIn the days since, Israeli prime minister Benjamin Netanyahu has also doubled down on the goals of the war – but today, he faces the possibility of a unanimous security council vote for a ceasefire, with even the US considering supporting a resolution for a suspension of hostilities. For today’s newsletter, I spoke to Bethan McKernan, the Guardian’s Jerusalem correspondent, about whether Netanyahu’s line will hold – or if dismay at the deaths of the hostages will change the political calculus. Here are the headlines.\nFive big stories\n-\nPPE Medpro | A furious row has broken out between the disgraced Conservative peer Michelle Mone and the government over how much they knew about her links to a company that won lucrative deals during the pandemic. On Monday, as Rishi Sunak said he was taking the case “incredibly seriously”, Mone claimed the government “knew about my involvement from the very beginning”.\n-\nChina | At least 118 people have been killed and more than 500 injured in an earthquake in China’s north-west Gansu and Qinghai provinces, state media has reported. The strong shallow earthquake struck shortly before midnight on Monday, with the toll rising on Tuesday as rescuers reached affected areas.\n-\nTechnology | TikTok has given special status to certain high-profile accounts, with moderators in Europe encouraged to be more lenient with content posted by people including Russell Brand, according to internal messages seen by the Guardian. TikTok said it was inaccurate to say that staff had been asked to be less stringent with certain accounts and its guidelines are applied to everyone who uses the app.\n-\nIceland | A volcano in southwest Iceland has erupted after weeks of intense earthquake activity. Fearing a significant outbreak on the Reykjanes peninsula, authorities had evacuated the nearly 4,000 inhabitants of the fishing town of Grindavik and closed the nearby Blue Lagoon geothermal spa.\n-\nAssisted dying | The ChildLine founder and broadcaster Esther Rantzen has said she has considered the option of assisted dying if her ongoing lung cancer treatment does not improve her condition. She told the BBC that there should be a free vote on the subject so that family members of people in her position do not face prosecution if they provide support.\nIn depth: ‘Netanyahu looks like he will continue to brazen it out’\nWhen the news emerged that IDF troops had killed three Israeli hostages, Netanyahu took the same approach as he has since 7 October to anything that others might seek to lay at his door: he sought to keep his distance. He had nothing to say about the actions of the soldiers responsible, and framed the incident passively, by saying that “disaster struck”. He said: “It is important for me to stand by our soldiers.” The conclusion he drew: “The military pressure is essential both for returning the hostages and achieving victory over our enemies.”\nWith the fate of the hostages taken by Hamas such a psychologically wrenching question for so many Israelis, that line might be expected to galvanise internal opposition. But, Bethan McKernan said, the fallout has not been as straightforward as that.\nProtests | ‘The mood was very fatigued and sad’\nBethan attended a protest in Tel Aviv on Saturday night, the latest weekly demonstration calling for the resumption of talks to secure the remaining hostages’ release. “The families of the victims are of course distraught – they feel abandoned,” Bethan said. Raz Ben-Ami, a former Israeli hostage whose husband, Ohad, is still being held, told the rally: “I begged the cabinet, and we all warned that the fighting would likely harm the hostages. Unfortunately, I was right.” At Samer Talalka’s funeral (pictured above), his father said: “The army must release the hostages immediately, and draw lessons from what happened. Samar was supposed to be with us … his death broke me.”\n“People are shocked and angry,” Bethan said, “but the mood at the protest was not as intense as I expected it to be. This is a subjective view, but I thought it might be a crystallising, sea change moment of opposition, and I don’t know if you can say that that is the case.”\nPartly, she said, that might be because of an ebb in the intensity of the movement since the release of almost all women and children held by Hamas during the recent ceasefire. “That was very cathartic for the country. It’s not that the hostages left are viewed as less valuable – but people are tired,” she said. “The mood on Saturday was very fatigued and sad.”\nWider opinion | ‘Positions on both sides have only hardened’\nWhile the Israeli public remains broadly supportive of the war, “the country is very divided into pro- and anti-Netanyahu,” Bethan said. “This doesn’t change that. Positions on both sides have only hardened.”\nThe continued support of Netanyahu’s base and loathing of his opponents explains the plausibility of his “continuing to prosecute the war on the basis of self-preservation,” Bethan said. “He is blocking any possible resolution, like the Palestinian Authority taking charge in Gaza – that is very difficult to make workable anyway, but the fact he’s said that there will never be any Palestinian governance implies an open-ended military presence. He’s making it impossible to end the war.”\nThe question, then, is whether there will ever be a point where “the desire to end the war outweighs the support he has among his base.” But even if that happens, Netanyahu is very unlikely to voluntarily do anything that could put his own position at risk – and the hostages’ deaths have not shifted the public discourse in a way that will force his hand.\nMilitary conduct | Palestinian anger at ‘double standard’\nThe IDF’s public response to the incident on Friday suggested, at least, an understanding that it was a catastrophe for which they would be expected to answer – and, perhaps, a danger that it would be seen as an insight into the army’s treatment of Palestinian civilians, as well. Herzi Halevi sought to emphasise the military’s probity: “If it’s two Gazans with a white flag coming out to surrender, why would we shoot at them? Absolutely not. Absolutely not. That’s not the IDF.”\nBut there is evidence to the contrary. “There are hundreds of videos from the West Bank and Gaza in recent years of soldiers clearly shooting people injured, or running away, or lying on the ground without weapons,” Bethan said.\nThe IDF says that Hamas sets up ambushes by playing recordings of Hebrew voices on loudspeakers. “We don’t know about the evidence of that, but it does sound credible – Hamas are happy to use that kind of tactic,” Bethan said. But there are other incidents where the military’s conduct has been questioned. On Saturday, a mother and daughter were killed in a Gaza City church, allegedly by an Israeli sniper, the Latin Patriarchate of Jerusalem said, adding that there were “no belligerents” on the site; seven others were wounded. The IDF has denied responsibility.\nIn a Guardian opinion piece published yesterday, Dahlia Scheindlin writes, “The one-way road to Friday’s nightmare was paved by the de facto indulgence of shoot-first policies.” Avner Gvaryahu, head of Breaking the Silence, a whistleblower group that collates testimony from former soldiers, told the Associated Press: “The army said this happened in violation of the rules of engagement. I’m skeptical of that, based on what we know of previous operations in Gaza. How many Palestinians were shot at like this?”\nThe surprising thing about Friday’s shootings, said Bethan, “is that they acknowledged it. You suspect that if there had been a way to not come out with the details, they would have avoided it – but maybe the news had spread too far within intelligence circles. There’s usually no investigation for these incidents, and the double standard has made a lot of Palestinians very angry.”\nInternational pressure | ‘The US is still not forcing Netanyahu to come to the table’\nFor all the above, the hostages’ deaths do appear to have made some impact. “It seems to have led to the resumption of negotiations over hostages,” Bethan said. “Over the weekend, the head of Mossad, David Barnea, was in Qatar to talk to mediators.” That trip had reportedly been blocked by Israel’s war cabinet as recently as Thursday. Yesterday, Barnea met in Warsaw with Qatari prime minister Mohammed bin Abdulrahman Al Thani and CIA director Bill Burns to talk further about a possible deal.\nMeanwhile, Joe Biden has said that Israel is losing support over its “indiscriminate” bombing, and Germany and the UK have backed a “sustainable ceasefire”. A security council vote on a ceasefire on Monday was delayed to give more time for diplomats to meet US objections to the wording – and there is a possibility that the US, which has previously used its veto, could back a call for a “suspension of hostilities” today.\nNonetheless, the US – which has far more leverage over Netanyahu than any other player – “is still not forcing him to come to the table,” Bethan said. Other than increasing the flow of aid into Gaza, “they have got very little back on their demands, like transitioning to a more targeted, intelligence-led phase of the war.”\nIf one of the hostages who were killed had held an American passport, that might be different, she added. “But as it is, Netanyahu looks like he will continue to brazen it out. His strategy is always the one which gives him the best chance of his own political survival.”\nWhat else we’ve been reading\n-\nA new report has found that more young people are taking up smoking. Coco Khan asks whether loneliness is playing a role in the resurgence. Nimo\n-\nAfter the car took over cities across Europe, a fightback is now well under way, driven by a need to cut pollution and combat the climate crisis – and a wish to reclaim cities as pleasant places to live. Clare Longrigg, acting head of newsletters\n-\nThe anticipation and fuss around parties can be anxiety-inducing. In this week’s edition of the big idea, Jess Cartner-Morley explains why it’s actually important for many of us every now and then to take part in the festivities. “Partying together strengthens the bonds of community and society”, Cartner-Morley writes. Nimo\n-\nWhy do people eat pencil nibs, chalk, plaster, dirt … and firelighters? Those with pica syndrome yearn to eat non-foodstuffs. Their cravings may be due to mineral deficiencies, but people with pica often link them back to childhood. Clare\n-\nIt has been 25 years since the ultimate cosy romcom hit the big screen. New York magazine writers rewatch You’ve Got Mail (a personal favourite, if you couldn’t tell) and discuss what the film tells us about online dating, books, money, and the elusive perfect New York City apartment. Nimo\nSport\nFootball | Title holders Manchester City were drawn against Copenhagen for a relatively kind assignment in their last-16 Champions League match. Elsewhere in the Monday lunchtime draw, Arsenal face a familiar opponent in Portugal’s Porto while Barcelona will take on Napoli in arguably the pick of the round’s ties. Jonathan Wilson breaks down the ties.\nOlympics | The World Athletics president, Sebastian Coe, has expressed concern over ticket prices for the Olympic Games next year, warning they will price out genuine fans and lead to empty seats. With some prices as high as €990 in Paris next summer, Coe said: “These are going to be the most expensive ticket prices in an athletics arena that we have witnessed”.\nBasketball | Stephen Curry’s NBA-record 268 straight games with a three-point basket ended on Sunday night in the Golden State Warriors’ 118-114 victory over the Portland Trail Blazers. Curry (above) was 0-8 from 3-point range, scoring seven points overall. He began the streak December 2018.\nThe front pages\nThe Guardian’s headline reads “‘They all knew’: Mone hits back at PM in row over PPE deals scandal”. The i leads with “New Brexit fingerprint checks for UK travellers start in 2024”. The Times says “New homes to be forced through”.\nThe Mail reports “NHS dentists on the brink” with a report claiming that services are facing their worst crisis in “75 years”. The Telegraph says “Schools told to presume children can’t change their gender”.\nThe Financial Times reports on a potential merger from the world of software with “Adobe and Figma drop $20bn tie-up after balking at regulators remedies”. The Sun reports that missing teen Alex Batty has broken his silence, under the headline “Happy to be home”. And finally the Mirror carries comments from Esther Rantzen with “Why I’ve joined Dignitas”.\nToday in Focus\nUkraine’s fight for funds to keep Russia at bay\nAs the Ukraine war heads into a new calendar year, the country is battling not just the Russian army but also on the diplomatic front, to secure further aid from its allies. Luke Harding and Dan Sabbagh report\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nThis time of the year is the perfect opportunity to over indulge in everything that we enjoy but, as a result, it is also a time of extreme waste. To have a more sustainable festive period, a number of chefs and campaigners have compiled a list of easy tips and tricks to minimise food waste.\nThe first piece of advice is fairly simple: budget and plan. The biggest stumbling block for many people is panicking and buying way too much in the first place: make a list, stick to it and don’t let the supermarket deals lure you in. Christmas vegetables are all seasonal, so buy them loose to cut down on plastic and if you are having meat, buy it on the bone because you can use it to make stock afterwards. Find interesting recipes to help use up all your left overs in a fun and delicious way and, crucially, make sure there is plenty of room in the freezer so nothing spoils.\n“Christmas is traditionally a feast holiday, but having a more sustainable one doesn’t mean we have to eat less – it’s more about being conscious of what we eat,” says author Conor Spacey.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 2591,
  "scraped_at": "2026-02-14T01:48:34.027126",
  "_text_extracted": true
}