{
  "article_id": "ec9e5d47e85f",
  "url": "https://www.yahoo.com/entertainment/liverpool-chief-exec-hails-fans-162323604.html",
  "title": "Liverpool chief exec hails fans for averting disaster at Champions League final",
  "date": "20230216T144500Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool chief exec hails fans for averting disaster at Champions League final\nLiverpool chief executive Billy Hogan has paid tribute to fans for averting a disaster at last year’s Champions League final.\nHogan said the experience of the 1989 Hillsborough tragedy, in which 97 people were killed, and the after-effects and understanding which had taken place since meant a significant loss of life at the Stade de France was avoided.\n“(There is) just a sense of pride in terms of our supporters and the behaviour of our supporters,” Hogan told the club’s website.\n“I think if you read the report, it’s mentioned a number of times in terms of being called a near-miss and, frankly, I think if it wasn’t Liverpool supporters, people might have reacted differently.\nLiverpool FC's chief executive officer Billy Hogan today offered his reaction to UEFA's independent report on the events at the 2022 Champions League final in Paris.\n— Liverpool FC (@LFC) February 14, 2023\n“I think the history that we have as a club going back to Hillsborough really made people behave and I think the sense of our supporters policing themselves in the face of what was incredibly heavy-handed policing.\n“I was in those crowds and I saw the behaviour of our supporters and that’s the reason why it was a near-miss and why it wasn’t an actual disaster.”\nThe independent report discovered that references to Hillsborough had formed part of the police’s strategy in planning for the final, but the panel concluded “no one involved in the planning of a major football match has any excuse for believing it was a disaster caused or contributed to by the actions of supporters”.\nClaims by the French authorities that thousands of ticketless fans or those with forgeries had caused problems was also debunked by the report.\nPeter Scarfe, who runs the Hillsborough Survivors Support Alliance, said events at the Stade de France had understandably triggered memories for some fans who had been involved in the 1989 disaster and two members of the group had taken their own lives since the May final.\n“Praise should go to the Liverpool fans who understand and have a lived experience because it prevented what would have been a disaster,” he told the PA news agency.\n“Without a shadow of a doubt it was down to relatives of the 97, the Hillsborough survivors themselves, their families and those who have been educated by people at Hillsborough to self-police.\n“Fans themselves self-policed, stayed calm, controlled the situation and prevented another catastrophe happening.\n“UEFA have to accept they got it wrong and whoever was in charge didn’t do their job properly. It is a massive failure and people should lose their jobs because of this.”\nAmong the 21 recommendations made by the panel is one which urges UEFA to “include fuller and more proactive engagement with disabled supporter organisations and the respective clubs to determine needs and requirements”.\nI was in those crowds and I saw the behaviour of our supporters and that’s the reason why it was a near-miss and why it wasn’t an actual disaster\nBilly Hogan\nTed Morris, chairman of the Liverpool Disabled Supporters Association, believes that is a major step forward.\n“The emphasis put on disabled fans and the harrowing and horrific experience they went through, I think we will see some change from UEFA and that’s good for disabled supporters,” he told the PA news agency.\n“It is quite an historic moment for disabled supporters and I hope through this change is facilitated. I think it is a turning point.\n“I think it is the behaviour of fans which has set the tone for this report.\n“There was nothing to absolve us for because people who were there that day, even non-Liverpool supporters, knew Liverpool supporters did nothing wrong from the moment they arrived at the stadium.\n“It is nice to see it in writing, it is nice the truth is out there, because we know how important the truth is and the damage which can be done when falsehoods and lies are spread.\n“We are not looking for recrimination and blame. To facilitate change the people who are there (at UEFA) first of all need to hold their hands up and say ‘OK, this clearly went wrong’.\n“If they can bring about change and admit their mistakes then everyone in life deserves a second chance. Sacking people may change nothing.”\nFans group Spirit of Shankly also welcomed the publication of the report.\n“The blame game began even before a ball was kicked, and in the immediate aftermath those supposedly in charge – UEFA and the authorities – had no hesitation in pointing the finger at supporters,” said a statement.\n“But now with the publication of the report it is clear, the fans bear no culpability, the panel concluding “overarching organisational failures” were the root of what went so badly wrong.”",
  "word_count": 815,
  "scraped_at": "2026-02-14T01:37:53.570846",
  "_text_extracted": true
}