{
  "article_id": "ecaae4855526",
  "url": "https://theathletic.com/4629826/2023/06/30/lesley-ugochukwu-50-watch-midfielder/",
  "title": "Lesley Ugochukwu : The Rennes teenager with a Premier League dream",
  "date": "20230630T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This summer, we are running a series profiling 50 exciting players under the age of 25 — who they are, how they play, and why they could be attracting interest in the coming transfer windows.\nYou can find all our profiles so far here. Until now, we have run the rule over a Leverkusen livewire, the France forward who went from zero to €100million in the space of a year, and Brazilian football’s “Little Tiger”.\nAdvertisement\nLesley Ugochukwu sits at his desk on a mezzanine floor in his apartment in Rennes. He ponders the question — what are his hopes and dreams for the future?\n“For now, I’m really happy to be at Rennes. It’s a club that has confidence in me and I also have confidence in them. I’ve grown up here,” he tells The Athletic in fluent English.\nOne day, the 19-year-old — contracted at the Ligue 1 club until 2025 — would like to do more than just speak the language.\n“The Premier League is somewhere that I’d like to reach,” he says. “I have things to improve but my dream is to play in the Premier League.”\nEnglish clubs — and others in Europe — have had Ugochukwu on their recruitment watch lists since his first senior appearance in April 2021. He debuted for Rennes aged 17 years and 30 days against Dijon, making him the club’s fourth-youngest player at the time.\nTop of that list? Ugochukwu’s former team-mate at Roazhon Park, Eduardo Camavinga, who left just a few months later to join Real Madrid. “What he’s doing actually is really inspiring to me because I’m like, if he can do it, I can also do it,” he says.\nLike Camavinga, Ugochukwu is considered to be a significant prospect.\n“His potential is very high,” said one Premier League scout from a top-six club who shared his thoughts on Ugochukwu but spoke anonymously to protect relationships. The 6ft 2in midfielder’s “athletic presence… with room to fill out”, notably big stride and ability to progress and drive with the ball have led to comparisons with two French World Cup winners: Patrick Vieira and Paul Pogba.\n“When I was small, I would watch the skills of players like Pogba and Vieira on YouTube,” he says. “They inspired me a lot because of the way they play. When I grew up, my academy coach sometimes called me ‘Vieira’ because they could see some techniques that he had before. I kind of see myself in both players.”\nAdvertisement\nComparisons to successful, tall, footballers didn’t always make it easy, though, and led to some unsavoury critiques.\n“When I was younger, I had some tournaments where I was among the tallest and sometimes you’d hear people say, ‘He’s not really 12’ or ‘He’s not born in France’,” explains Ugochukwu.”But it didn’t really affect me because I know the truth.”\nUgochukwu’s assist for Arnaud Kalimuendo’s goal for Rennes against Paris Saint-Germain in March — the second in a 2-0 victory — was reminiscent of former Arsenal star Vieira. In a slick counter-attack, Ugochukwu ate up the space between halfway and the penalty box with ease before producing a calm, measured pass into the feet of striker Kalimuendo, leaving him with a simple finish.\n“It’s an advantage being tall and powerful,” says the teenage midfielder. “People like Vieira inspire me a lot because of what he did for Arsenal. It’s something that I want to do during my career, to live like that and for people to say, ‘Lesley was that kind of player’.”\nThe midfielder was born Chimuanya Ugochukwu in the Maurepas region of Rennes in Brittany in 2004 before moving close to his club’s Roazhan Park stadium. “Lesley” was the name he and his Nigerian parents — who worked for the region’s paper recycling company — chose to make “it easier for people to pronounce, and we liked the name,” says Ugochukwu. The eldest of three kids is now nicknamed “Chuks” or “Chukwu” in the dressing room at Rennes, who finished fourth in Ligue 1 last season and qualified for the Europa League.\nUgochukwu has accelerated quickly to become a sought-after European footballing talent. He’s grateful to the “patience” shown by his parents, in “helping him on his journey”, as he puts it. Basketball was an option but it was “always football, football, football,” he says, especially after being spotted playing in an indoor football tournament by a scout from Rennes.\nAdvertisement\nHis dad Godfrey was an amateur player in Nigeria and his uncle Onyekachi Apam blazed a trail in French football. Apam played for Nice (2006 to 2010) before joining Rennes, where his nephew would come to watch him.\n“When I had the possibility to go to the stadium, me and my dad always loved to watch football,” says Ugochukwu. “Having an uncle who played for Rennes also made it a bit easier for us to go to the stadium and watch a game. He was a defender but he had a lot of injuries. That’s why he had to stop early.”\nApam retired in 2014 aged 28 after a brief spell with Seattle Sounders, by which time he’d collected 14 caps for Nigeria, including featuring in a 1-0 defeat against Lionel Messi’s Argentina in the 2008 Olympic final.\nNow it’s Ugochukwu, a France Under-19 international but eligible for Nigeria, who is coming up against the big stars including Messi, Kylian Mbappe and Neymar.\n“When you play against big teams, people are able to see that I’m capable to play against these big players. Let me show them that I’m also a good player and I can beat them,” he says. “This season, we played and beat PSG twice. It’s important to gain experience being consistent in these games.”\nAfter a one-minute debut from the bench against Dijon in April 2021, Ugochukwu was handed a start against PSG two games later. New coach Bruno Genesio had liked what he’d seen in training. “The day before, he put the starting 11 up and he said, ”Lesley you’re going to start,” says the young Rennes midfielder. “So I was like, ‘Wow.’ Even some of my teammates were surprised too and thinking, ‘He’s never started a game and he’s gonna start against PSG? So that was insane but I told myself I have to play like I always play.”\nIt meant a restless night’s sleep for the then 17-year-old. “During the night, I was thinking ‘Wow, I’m going to be playing against Neymar’,” says Ugochukwu. “When I was a kid, I used to watch his skills on YouTube and tomorrow, he’s going to be my opponent’, so everything went fast but in football, you have to be ready in any circumstance.”\nPinching himself quickly changed to pinching the ball.\nAdvertisement\n“I wasn’t worried that it was Neymar or Moise Kean in front of me — it was just that we have to win the game and do my job properly,” he says with a smile. “Afterwards, it could be that I took the ball from Neymar.”\nCamavinga missed that game with injury as he closed in on his move to Real Madrid but the France international was still there for Ugochukwu. “During half-time, he (Camavinga) came and he was talking to me, and giving me good advice, saying ‘You’re doing this well, but try to do this and that’,” says Ugochukwu. “When he was 15, I was 13. When I made the first team, he helped integrate me into the group. He was like a big brother to me.”\nUgochukwu’s positional journey began with him wanting to score as many goals as possible, as a striker who idolised Cristiano Ronaldo, before a switch, aged 12 after he joined Rennes’ academy, to an imposing defender.\nAt 14, his academy coach William Stanger then nudged him into midfield. By 15, he was playing for Rennes’ under-16s and impressing as coaches began to make his case for promotion towards the senior team, but an ankle ligament injury ruled him out for six months. “It wasn’t easy for me and my family, because we didn’t expect that.” Yet Ugochukwu overcame the physical and mental hurdle of having his momentum stunted.\n“During that time, I learned a lot: never give up, work hard all the time and have faith,” he says. “You think, ‘Will I come back better? But I told myself I would do it and I came back better than before.”\nAfter his injury, during the disruption caused by the pandemic, came a promotion to the under-19s. “It helped my development fast as I was only 16, 17, and it accelerated the process. I didn’t expect it all that fast.”\nHis first involvement with Rennes’ senior team was in the Champions League in October 2020 as an unused substitute for a trip to Sevilla. Then another unexpected trip, this time to London. “It was Chelsea away and the day before we travelled at around six o’clock in the evening, they called me to do a Covid test, and I thought, ‘Why?,” Ugochukwu recalls. “They told me a player had failed, so I would replace them. It was a really good opportunity for me.”\nAdvertisement\n“The next day, I went to Chelsea and I saw Stamford Bridge. When you go from being a kid seeing it on the TV and then being there, you’re like ‘Wow!’.”\nHe made three Champions League squads in total during the 2020-21 season but didn’t play. At that stage, he was predominantly being used as central defensive cover, meaning having to come up against top-scorer Serhou Guirassy in training. “It wasn’t easy but I had to be ready and I wasn’t afraid,” says the Rennes youngster. After head coach Julien Stephan left in March 2021, things moved up a gear under replacement Genesio.\nUgochukwu didn’t see age as a barrier and famous French peers had already demonstrated that. “I was very young but like Kylian Mbappe has shown, when you feel you’re ready, then you’re ready. There is no age in football. They saw it in me to be part of the group.”\nThree games at the end of the season, including that maiden start against PSG, were the foundation. In 2021-22, 22 appearances followed, including one against Tottenham in the Europa Conference League. His first — and so far only — professional goal came in a 5-0 win over Saint-Etienne just two minutes after coming on as a sub.\nTeam-mate Gaetan Laborde recognised a strong, determined run to the edge of the box and Ugochukwu precisely drilled the finish into the bottom-left corner. “Honestly, in my opinion, I’m here to help the team to win and that’s how I see myself. If I score or assist it helps,” the midfielder explains.\nUgochukwu knows more goals will come but aren’t the priority for now. They’re an embellishment rather than the cornerstone of his game.\n“During my development, I was more of a box-to-box midfielder and then when I came in the (senior) group, I was put more into the No 6 (central defensive midfield) role,” he says. “I like it because it’s where I can win the ball and position myself to control the ball. It’s a new position that I’ve learnt and I see myself growing there.”\nAdvertisement\nHis establishment as a No 6 was reflected in 35 appearances during the 2022-23 season, including during Rennes’ Europa League campaign. Ugochukwu’s growing confidence in the role was reflected in a snapshot moment against Cypriot side Larnaca.\nWith little room to manoeuvre on the right-hand touchline, he used his physical presence but fleetness of foot to take three opposition players out of the game. One right-footed touch to control followed by another, whilst opening his body up wide to shield the ball created space to then pop a pass off to a team-mate for a give-and-go. Curiously, it was the sort of physical movement that mimicked former Tottenham and Watford midfielder Etienne Capoue.\n“I know the moment you are talking about,” he says with a smile. “I’m always learning new things in training and I have the abilities and the height, so I have to use it well. In that action, I knew if I took the ball like that, no one was going to take it.”\nThe Athletic broke down Ugochukwu’s possession and defensive metrics into nine categories and compared them to other Ligue 1 midfielders. In five — tackles, interceptions, blocks, clearances and completed pass — he positions highly in the upper echelons, including sitting in the 99th percentile for aerials won. But as an indicator of his determination to improve, even that final statistic is pulled apart.\nAfter digesting his numbers, Ugochukwu says: “I agree (that it’s good to see) but I would say that I have to improve because I have the height, but sometimes I don’t calculate (my positioning in relation to) the ball, so it’s something that I have to improve, especially because I have that height to also win more in the box for corners. Attacking too.”\nUgochukwu is an advocate of video analysis, frequently sitting with coaches watching clips to “see what works well and where I can do better,” as he puts it. His Rennes manager Genesio remarked that the French youth international goes about his work — even when out of the team — without “making noise”.\n“It’s very important to be humble and to work on yourself,” Ugochukwu says. “I get that from my parents, they are like that too. If you’re not playing, you have to ask yourself: ‘How can I improve to always be in the team? Why has the coach left me out? Is there another player who is a better option? If so, then why?’. You have to work hard and stay humble, and then nothing is going to be a problem. I try to take criticism well and prove people wrong.”\nAdvertisement\nUgochukwu’s work ethic has also been influenced by Joe Rodon, who spent last season on loan at Rennes from Tottenham. “He showed me the British mentality with a strong mindset,” he recalls. “I remember one training game — both us of weren’t in the first eleven and we were 2-0 down, and some people were giving up but Joe was shouting, ‘Oh come on guys, be strong’. I want to be like him and have this kind of mentality when he never gives up. It was inspiring.”\nUgochukwu said he “loved” spending time with Rodon and another Tottenham loanee Djed Spence, and got an insight into what playing in England would be like. “If I want to go to the Premier League, it’s good to learn (about the people and the English game) to make it easier.”\nWith pre-season not due to start until July 7, he recently visited London during his summer break, “It’s a city I love. The buildings are really big. I like the restaurants. It was just to chill and spend some good times.”\nEdouard Mendy (Chelsea), Raphina (Leeds), Ismaila Sarr (Watford), Nayeef Aguerd (West Ham) and Kamaldeen Sulemana (Southampton) are among the players that have made the move from Rennes to Premier League clubs in recent years.\nIt’s a well-trodden path across the nearby Channel. It may not be long before Ugochukwu is enjoying more than just the sightseeing in England too, with plenty of clubs watching his next steps with interest.\n(Other contributor: Mark Carey)\n(Top photo: Getty Images; design: Sam Richardson)",
  "word_count": 2571,
  "scraped_at": "2026-02-14T01:50:37.767974",
  "_text_extracted": true
}