{
  "article_id": "ecba07a3a14a",
  "url": "https://www.teamtalk.com/liverpool/reds-bid-e200m-kylian-mbappe-revealed-reasons-aborted-transfer-e100m-alternative-emerging",
  "title": "Liverpool transfers : Bid for €200m Kylian Mbappe revealed as reasons for aborted move and €100m alternative emerging",
  "date": "20240911T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool bid for €200m Kylian Mbappe revealed as reasons for aborted transfer and €100m alternative emerging\nLiverpool launched a huge offer to sign Kylian Mbappe from PSG before his move to Real Madrid, with an explanation for his failure and the man they signed instead coming to light.\nThe France superstar moved to the Bernabeu over the summer at the end of his contract in the French capital, with the transfer arguably the most high-profile free transfer in the history of football. Rated as one of, if not the, best player in the world right now, Mbappe has scored a hugely-impressive 290 career goals from 385 games spanning a 10-year career so far.\nThe move to the Bernabeu was certainly a long time coming, with Real Madrid having courted the player’s services for a number of years and seeing a £188m (€220m / $246m) bid rejected by PSG back in summer 2021.\nDON’T MISS ➡️ Ten of the best players Jurgen Klopp missed out on during his time at Liverpool: Bellingham, Tchouameni…\nHowever, Liverpool had also been regularly linked with a move for the 86-times capped France attacker, with Mbappe making clear his admiration for the Merseysiders and having constantly come clean on his admiration for the Merseyside club.\nAccording to L’Equipe, the Reds did indeed hold concrete talks over a move for Mbappe back in 2022, with the player even agreeing to make the move to Anfield as he sought an escape route from the Ligue 1 giants.\nThey claim the Reds were willing to spend as much as £168m (€200m / $220m) to sign the 25-year-old, though a sudden price hike from PSG and the player’s wage demands ultimately ended their chances.\nLiverpool went on to sign Darwin Nunez from Benfica instead that summer, paying the Portuguese side an initial £64m (€75m / $83.8m) for his services, with the deal for the Uruguayan ultimately hitting £85m (€100m / $111.3m).\nKylian Mbappe to Liverpool: what has been revealed?\nGoing deeper into that 2022 approach for Mbappe, once Liverpool’s interest and apparently willingness to spend €200m on the player came to light with the Ligue 1 giants, a PSG director at the time, Antero Henrique, stunned the Reds by instead demanding €400m with the new figure clearly way beyond their reach.\nAn unnamed source at PSG denied that version of events, telling L’Equipe: “Liverpool never came with a written offer. And Liverpool were never able to get this money.\n“As soon as Mbappe renewed his contract, we agreed that in the event of an interesting offer for the player and the club, a solution would be found.\n“After 2022, the only serious offer came from Saudi Arabia and was accepted by the club.”\nAt the time, Mbappe looking to force his way out of the Parc des Princes, before eventually settling his differences with the club and agreeing a one-year extension on his current contract, running through to June 2024.\nAnd the player had made no secret of his desire to move to Anfield, regularly flirting with the prospect of a move to Liverpool and subsequently revealing to the Daily Telegraph of more historic talks about a move: “We talked a little bit, but not too much.\n“I talked to Liverpool because it’s the favorite club of my mum, my mum loves Liverpool. I don’t know why, you will have to ask her.\n“It’s a good club and we met them five years ago. When I was in Monaco I met them. It’s a big club.”\nLiverpool linked with another LaLiga colossus\nWhile Liverpool were not successful in landing Mbappe – and given the player will earn an estimated £95m across a five-year deal at the Bernabeu – that probably worked out for the best.\nHowever, the Reds are reported to be pursuing another highly-rated LaLiga star in the form of Sevilla defender Loic Bade, who has a mammoth exit clause in his contract.\nSeen as a potential long-term heir for Virgil van Dijk, whose deal at Anfield expires next summer, they have at least been boosted by news that the Dutchman does still see his future at Anfield.\nBut there is better news over the future of Mo Salah with Fabrizio Romano delivering a promising update on the Egyptian superstar’s contract renewal talks.\nMbappe stats make him worthy of global phenon status\nWhile the stars may one day align for Mbappe and Liverpool to unite, the player’s stats over the years prove he is one of the very best around and worthy of the future Ballon d’Or award that Cristiano Ronaldo is backing him to win.\nREAD MORE ➡️ Cristiano Ronaldo picks Real Madrid duo, Barcelona talent as five future Ballon d’Or winners\nLooking at his stats, it’s easy to see why he is so highly coveted and his record in the Champions League – which he will be hoping to win for the first time in his career this season – is second to none, with the player holding a number of incredible records.\nPer the official UEFA website, Mbappe holds the following records in the competition.\n- Youngest player to ten goals – 18 years 350 days\n- Youngest French player to score in a Champions League knockout round match – 18 years 63 days (Man City 5-3 Monaco, 21/02/17, round of 16 first leg)\n- Youngest player to score more than one goal in a Champions League knockout round match – two goals: 18 years 113 days (Dortmund 2-3 Monaco, 12/04/17, quarter-final first leg)\n- Youngest player to score in two successive Champions League knockout round matches – 18 years 85 days (Monaco 3-1 Man City, 15/03/17, round of 16 second leg)\n- Youngest player to score in three successive Champions League knockout round matches – 18 years 113 days (Dortmund 2-3 Monaco, 12/04/17, quarter-final first leg)\n- Youngest player to score in four successive Champions League knockout round matches – 18 years 120 days (Monaco 3-1 Dortmund, 19/04/17, quarter-final second leg)\n- Most Champions League knockout round goals scored by a teenager – six goals, the last of which was scored at the age of 18 years 140 days (Juventus 2-1 Monaco, 09/05/17, semi-final second leg)\n- Most Champions League knockout round goals scored under the age of 21 – seven goals, the last of which was scored at the age of 20 years 54 days (Man United 0-2 Paris, 12/02/19, round of 16 first leg)\n- Youngest scorer in a Champions League semi-final match – 18 years 140 days (Juventus 2-1 Monaco, 09/05/17, semi-final second leg)\nMost Champions League goals scored as a teenager – 13 goals in 23 matches, the next best is Haaland with ten goals in eight matches - Youngest French player to score a hat-trick in the Champions League – 20 years 306 days (Club Brugge 0-5 Paris, 22/10/19, group stage)\n- Youngest player to score a hat-trick away from home in a Champions League knockout round match – 22 years 58 days (Barcelona 1-4 Paris, 16/02/21, round of 16 first leg)",
  "word_count": 1177,
  "scraped_at": "2026-02-14T02:08:12.428760",
  "_text_extracted": true
}