{
  "article_id": "ecbbd6cb4cb8",
  "url": "https://www.gdnonline.com:443/Details/1372388/Chelsea-part-ways-with-Maresca",
  "title": "Football : Chelsea part ways with Maresca",
  "date": "20260102T014500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – CHELSEA parted ways with Enzo Maresca yesterday, a dramatic fall from grace for the Italian who was named manager of the month for November before the club won just one of their last seven league games to fall out of the Premier League title race.\nThe Italian, who joined Chelsea in 2024 after steering Leicester City to Premier League promotion, leaves 18 months to the day since he was tasked with reviving the club’s fortunes after two years of failing to qualify for the Champions League.\nMaresca eventually guided the London side to Champions League qualification with a fourth-placed finish, the Conference League trophy and the Club World Cup title in his first season with a young but expensively-built squad.\nBut a poor run of form in December and an uncharacteristic outburst from the Italian prompted the club hierarchy to take action and part ways with the 45-year-old manager.\n“Chelsea Football Club and head coach Enzo Maresca have parted company,” the club said in a statement.\n“With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the club believe a change gives the team the best chance of getting the season back on track.”\nChelsea were as high as third in November and were among the title contenders, high on confidence after they had also crushed Barcelona 3-0 in the Champions League at Stamford Bridge.\nBut they have since slipped to fifth in the league to sit 15 points behind leaders Arsenal at the halfway stage of the season.\nLast month, Maresca voiced frustration over issues behind the scenes, saying he felt he had a lack of support from the club, describing a period after a 2-0 win over Everton as “the worst 48 hours” of his tenure.\nThe Italian did not clarify what he meant by the comment but the damage seemed to have been done as Chelsea’s league form nosedived.\nAlthough Chelsea beat Cardiff City to reach the League Cup semi-finals, they picked up only two points in their last three Premier League games.\nOff the pitch, there was also the unwelcome distraction of rubbishing links to the Manchester City job as Maresca pointed out that he was committed to Chelsea where he had a contract until 2029.\nBut Tuesday’s 2-2 home draw with Bournemouth – where fans chanted, “You don’t know what you’re doing,” when he substituted playmaker Cole Palmer while they also booed at the final whistle – proved to be his final match in charge.",
  "word_count": 420,
  "scraped_at": "2026-02-14T02:09:38.442616",
  "_text_extracted": true
}