{
  "article_id": "ecdaeae0c426",
  "url": "https://www.westmeathexaminer.ie/2023/07/29/england-midfielder-keira-walsh-has-not-suffered-acl-injury/",
  "title": "England midfielder Keira Walsh has not suffered ACL injury",
  "date": "20230729T164500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England midfielder Keira Walsh has not suffered ACL injury\nBy Rachel Steinberg, PA, Sydney\nEngland midfielder Keira Walsh’s World Cup hangs in the balance after a scan revealed she did not suffer an anterior cruciate ligament injury in the Lionesses’ 1-0 victory over Denmark on Friday.\nThe 26-year-old will miss the Lionesses’ final group-stage clash with China on Tuesday but will remain in Australia as she undergoes further medical assessments.\nWalsh left the pitch on a stretcher in the 38th minute of England’s second group game and could clearly be seen telling the team’s medical staff “I’ve done my knee” after sliding to collect the ball late in the first half.\nThe Champions League winner later appeared on crutches.\nFollowing a scan late on Saturday afternoon, the Football Association said in a statement: “We can confirm Keira Walsh has not suffered an anterior cruciate ligament injury.\n“The midfielder was substituted during Friday’s 1-0 win against Denmark.\n“Walsh has been ruled out of Tuesday’s final Group D match against China PR in Adelaide and will remain at England’s Terrigal base to continue her recovery.\n“Her knee injury will continue to be assessed by England medical staff and no further update will be provided at this stage.”\nEarlier, Walsh’s team-mate Rachel Daly revealed she feels the need to block out the frightening possibility of becoming a victim of the devastating injury crisis besetting women’s football and this World Cup.\nBoth Euro 2022-winning England captain Leah Williamson and Golden Boot winner Beth Mead were unavailable for Sarina Wiegman’s World Cup side due to ACL injuries, for which women are at a three-to-six times higher risk than men, while midfielder Fran Kirby also underwent surgery for a different knee issue.\nThe Netherlands’ Vivianne Miedema, Canada’s Janine Beckie, United States duo Catarina Macario and Christen Press, New Zealand’s Katie Rood and Zambia goalkeeper Hazel Nali are among the other top talents who were ruled out of this tournament with ACL injuries.\nDaly said: “I don’t think you can think about it, for me, those three letters (ACL) scare the absolute you-know-what out of me.\n“Fingers, toes, everything crossed for Keira, but that’s football isn’t it, it’s tough, you have your highs and your lows and you just hope that everything is all right and she’ll be all right for the future. It’s a tough one but I hope she’s all right.\n“I think losing anyone is tough, but a player with the ability of Keira is a tough one to lose. She’s such an integral part of the way we play and it’s tough, but that’s why Sarina’s built a squad, we’ve got depth, and (Laura Coombs) came on and did really well. So it’s obviously disappointing and heart-breaking for Keira, but hopefully it’s nothing too serious.”\nThe recent Women’s Football Review, led by retired Lioness Karen Carney, recommended the FA introduce a centrally-funded research unit with a dedicated research budget for issues affecting female footballers.\nEarlier, at a press conference in Brisbane, Australia captain Sam Kerr made reference to Walsh’s injury as she confirmed she would be available for the Matildas’ final grou- stage encounter with Canada after missing their first two World Cup matches with a calf injury.\nShe said: “It was obviously disappointing and then I had to kind of suck it up. I’m part of a team, I’m not part of an individual sport.\n“It’s not about me and that’s what I’ve done over the last however many days it’s been.\n“I’ve had to put the team first and I’ve been lucky enough over the past couple of years, I’ve always been on the pitch for this team, and I’ve always had team-mates that have not been on the pitch and supported me and got me over the line.\n“That’s been my role the last 10 days and, to be honest with you, it’s an honour to be here. I feel really lucky and privileged to be here.\n“I look around women’s football at the moment and I’m lucky that it’s only a small injury compared to some other people. You look at Keira Walsh last night, so you have to look at the bright side on everything.“It kind of sucks but there’s always someone worse off.”",
  "word_count": 706,
  "scraped_at": "2026-02-14T02:00:36.688543",
  "_text_extracted": true
}