{
  "article_id": "ed13e6f0fa79",
  "url": "https://metro.co.uk/2025/08/12/christopher-nkunku-approves-transfer-new-club-chelsea-make-two-demands-23897106/",
  "title": "Christopher Nkunku approves transfer to new club as Chelsea make two demands",
  "date": "20250812T220000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Christopher Nkunku has approved a move to Bayern Munich but the Bundesliga champions still face a battle to reach a transfer agreement with Chelsea.\nChelsea have put Nkunku up for sale this summer after another underwhelming season for the French forward at Stamford Bridge.\nNkunku could blame injuries for his poor first season in the Premier League but that was not a reasonable excuse last term as he scored just three league goals.\nMuch was expected of Nkunku following his £52m move from RB Leipzig in 2023 given he was the top goalscorer in the Bundesliga during his final season in Germany.\nNkunku was also named the Bundesliga player of the season earlier in his Leipzig career, but that form has been non-existent in two disappointing years at Stamford Bridge.\nA number of domestic and foreign clubs have expressed interest in signing Nkunku and Chelsea offered the France international back to RB Leipzig during transfer talks for Xavi Simons.\nBut Nkunku rejected a return to his former club due to their absence from this season’s Champions League, while Leipzig even had reservations themselves given his inflated salary in west London.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nNkunku has no such concerns about a move to Bayern Munich, however, and has indicated he is open and willing to move to the Allianz Arena this summer.\nThe 27-year-old’s desire to join Bayern comes as no surprise given their status as one of the biggest clubs in the world.\nNkunku agreed to join the German giants back in January but Bayern Munich were unable to reach an agreement with Chelsea over a fee.\nThe Blues were optimistically holding out for £70m at the start of the year but have halved their asking price this summer.\nBayern sporting director Max Eberl is said to ‘love’ Nkunku’s versatility but it remains to be seen whether they are willing to meet Chelsea’s valuation.\nAnother potential stumbling block is Chelsea’s insistence that Nkunku leave on a permanent transfer. RB Leipzig, for example, were keen on a loan deal.\nBayern have revived their interest in Nkunku as Kingsley Coman closes in on a lucrative move to Saudi Pro League side Al Nassr.\nVincent Kompany’s side have already spent £65.5m to sign Luis Diaz from Liverpool but rejected the chance to sign Manchester United striker Rasmus Hojlund.\nMore Trending\nHojlund has been offered to a number of clubs after United signed Benjamin Sesko as Ruben Amorim’s new first-choice striker.\nThe sale of Nkunku will likely clear Chelsea to complete a deal for Netherlands playmaker Simons, who is valued at around £60m by RB Leipzig.\nChelsea are also open to offers for Nicolas Jackson following the summer additions of Joao Pedro and Liam Delap.\nEnzo Maresca’s side, who won the Club World Cup in the off-season, face London rivals Crystal Palace in their Premier League opener on Sunday.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Jamie Carragher reveals Arsenal’s biggest ‘problem’ and his ‘worry’ for Liverpool\nMORE: Rio Ferdinand ‘disagrees massively’ with Manchester United transfer move\nMORE: Man Utd players desperately trying to convince Ruben Amorim target to join",
  "word_count": 582,
  "scraped_at": "2026-02-14T01:52:36.777638",
  "_text_extracted": true
}