{
  "article_id": "ed15edd0260a",
  "url": "https://www.90min.com/arsenal-boss-renee-slegers-expecting-unorthodox-juventus-uwcl",
  "title": "Arsenal boss Renee Slegers expecting the  unorthodox  from Juventus in UWCL",
  "date": "20241112T153000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal boss Renee Slegers expecting the 'unorthodox' from Juventus in UWCL\n- Arsenal travel to face Juventus in the UWCL on Tuesday evening\n- The Gunners are level with the Italian side in Group C\n- Interim manager Renee Slegers is expecting the unorthodox from the Italian side\nArsenal interim manager Renee Slegers is expecting to face a different style of football against Juventus in the UEFA Women's Champions League on Tuesday evening.\nThe Gunners are currently second in Group C having beaten Valerenga last time out in the competition, after a heavy defeat to Bayern Munich earlier in the competition. Juventus, on the other hand, are also on three points with one win and one defeat to their name.\nAs far as qualification for the knockout rounds goes, the double header against the Italian side could be decisive in what is one of the toughest groups. In terms of their league form, Juve are currently top of Serie A Femmenile and are yet to lose a game.\nMax Canzi's side haven't conceded a single goal in their last four matches across all competitions, and dropped points in just one of those. Slegers, who has been in charge of Arsenal since Jonas Eidevall resigned last month, says she expects an unorthodox style from the Italian team.\n\"It's a different kind of football than what we usually play against in the WSL,\" she said in a press conference. \"We're expecting them to make it really hard for us in the way they defend.\n\"I think, from a WSL perspective, it's unorthodox. They're a little bit more player-for-player in the way they play. So that's a new challenge for us, and we've tried to prepare the girls as best as possible to be able to exploit this defending system in the best way.\"\nSlegers refused to be drawn on the magnitude of the game, despite the fact it represents a must-win in the context of qualification for the next phase. Bayern remain top of the group, having beaten both Arsenal and Juventus in recent weeks.\n\"We are going [to Turin] to play our best football,\" Slegers continued.\n\"We have a big belief in what we can do, looking at what we've been performing lately, and obviously scouting Juventus, we have a big belief in ourselves, and then we'll see how the game progresses, what decisions we have to make, but we go there to win.\"",
  "word_count": 403,
  "scraped_at": "2026-02-14T02:05:30.919237",
  "_text_extracted": true
}