{
  "article_id": "ed17acc1142b",
  "url": "https://cartilagefreecaptain.sbnation.com/2024/10/16/24271659/tottenham-hotspur-news-ange-postecoglou-coaching-methodology-optus-interview-pragmatism",
  "title": "Ange :  Im not going to do what everyone else does  - Cartilage Free Captain",
  "date": "20241016T180000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ange Postecoglou is not every manager, and he’ll be the first to tell you that. The international break has given the Tottenham Hotspur boss a solid two weeks in which to stew over the disastrous 3-2 loss at Brighton, a match in which Spurs led 2-0 at halftime and looked like they were set to cruise, before giving away three second half goals in one of Spurs’ worst halves of football this season.\nAnge: “I’m not going to do what everyone else does”\nOnce again Ange has offered a full-throated defense of his tactics and approach to football.\nIn a wide-ranging interview released today by Optus Sport that touched on both domestic and Australian international football, Ange was once again asked about his approach to the game and to address the constant criticism from both fans and pundits that he needs to be more “pragmatic” in his approach. Postecoglou noted that he’s not immune or unaware of criticism directed towards him and his way, but said he’s not had success because he’s been like other football managers, but because he’s done things differently from day 1.\n“I mean it’s impossible to to kind of block out [the criticism] because even if I don’t hear it or read it somebody will, and it kind of does infiltrate.\n“But I also don’t need to because I already know what they’d be saying so it’s like kind of new to me but I I just I guess from my perspective it’s about... well, what everyone is wanting me to do is what everyone else does now. I’m just not going to do that because there’s a reason that I’m here where I am today and it’s not because I’ve done what everyone else does.\n“So I think everyone has their own sort of unique journey to get to somewhere. I didn’t get here by doing what everyone else is doing so I get the people who say we’ll be more pragmatic like everyone else... [But] I don’t want to be like everyone else.\n“Now that doesn’t mean that I’m going to be successful necessarily and my approach is going to work, but what I’m not going to do is just become one of the masses because if I do that then what’s the point? I mean I’m going to get lost in that and eventually I’ll sort of fade away and not make the impact I want to.\n“So you know what others see is kind of stubbornness or me being dogmatic about something I see it’s just real belief in what I’m doing.”\nI appreciate these comments from Ange regarding his methods because I think he has a point — the criticism coming towards him are from people who want him to do the things that a lot of other managers are doing... and which are often (but not always) successful. But Ange has had to fight his entire career to progress to higher levels of football management, and he’s been successful precisely because he’s marched to the beat of his own drum. Sure, that means sometimes his teams stumble, but the proof has always been in the pudding, and there’s at least $240 worth of pudding on which to evaluate him by now.\nOne of the main criticisms levied at Ange is that, after many years of exceeding expectations in leagues such as the A-League, J-League, and Scottish Premier League, he’s finally hit a ceiling in what his tactics and approach can accomplish in the English Premier League. But Ange doesn’t think so, and sees that opinion to be one borne out of what he calls “arrogance” at the top level of football.\n“There’s a little bit of pretentiousness and arrogance about people in the Premier League thinking that they’re in a special space, right. But it’s still football and whether it’s a thousand South Melbourne supporters who weren’t happy with me after a game and gave me direct feedback or hundreds of thousands around the world, it’s still the same to me.\n“You know what, I care about what I do and if I’m upset one person that’s enough for me so the scrutiny and that... it’s not the challenge for me. The challenge is, yes the competition is more challenging for sure because you’re competing against the best and the demands of that are pretty. dramatic in terms of where I’ve come from in terms of starting my journey.\n“But at the same time I’ve kind of moved up the levels. The club has its own unique challenges for sure. Are they more difficult than others? I don’t know, I mean when I was at Celtic people said ‘Well yeah but Celtic expected to win’ and I go yeah that’s right they’re expected to win so you lose one game at Celtic that’s a major problem for you and not many could cope in that.\n“So it’s just a different challenge for sure um but I get why people would say well no it’s because of the level you’re at now and the scrutiny that you’re you’re not having success. I don’t believe that I think I still believe we are going to have success but there’s nothing that I’m kind of facing here that I think is insurmountable.”\nAnge recently managed his 50th match as manager of Tottenham Hotspur, and he was asked about where the club is relative to his expectations and if he’d do anything differently in hindsight. Postecoglou has always been consistent in his messaging on this issue — he refuses to set benchmarks or markers on the road to success because he views it as limiting to where he wants his teams to go.\n“Look, where we are right now is kind of where we are. Again if you if you start, and I’ve never put landmarks along the way to where to measure our progress because then sometimes that limits your progress because you go ‘well we might achieve what I wanted to achieve 10 games in, why wait for 50 games.’\n“But where we are is where we are and I think we’ve definitely made progress in terms of the squad in terms of the way we play our football. I definitely think there’s progress there and I guess from my perspective it’s every decision you make, you make in the isolation of where you’re at at that time. So when people say well would you do anything differently — no I wouldn’t because I I’ve always tried to make decisions that I believe are going to stay true to what we’re trying to create.\n“Now in the cold light of day and in retrospect where a lot of people end up making assessment after everything’s... after watching you go, okay, maybe I would have done something differently there, but I didn’t have that information then, I had the information I had.\n“So there’s nothing I would have done differently I think. What I do know is that people forget the starting point. It becomes really blurred. When I said had doing these interviews last year, you know Harry Kane had left and quite a bit of experience had left and we finished eighth. I didn’t take over a club that finished in the Champions League. At that time the measures and the kind of assessments were totally different. But you know I don’t forget the starting point because that’s how I measured progress.”\nAnge also had interesting things to say about his time with the Socceroos and about opening doors of opportunities to other Australians entering into the managerial market at the top level. The full video is embedded at the top of this article and I’d encourage you to watch the whole thing.",
  "word_count": 1293,
  "scraped_at": "2026-02-14T01:54:48.965487",
  "_text_extracted": true
}