{
  "article_id": "ed2de328cf77",
  "url": "https://news.yahoo.com/liverpool-don-t-look-champions-070000476.html",
  "title": "Liverpool dont look like champions – but beating Man Utd and Arsenal will change my mind",
  "date": "20231215T074500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I do not think Liverpool will win the title. . . yet\nLiverpool do not look like Premier League champions. Not yet. We are awaiting a statement performance from Jürgen Klopp’s rebuilt side.\nThis month offers the ideal opportunity to deliver it, with Manchester United, a marquee fixture regardless of both clubs’ current standing, and Arsenal to follow next weekend. The moment of truth is approaching, after which we will have a clearer idea of exactly how good Liverpool are and what is achievable this season.\nKlopp will be the first to admit there is plenty more convincing to do.\nLiverpool are top of the league and I am not really sure how. The league table says one thing but my eyes tell me something else. The balance of the team is still not quite right, and it is hard to imagine it will be without a ready-made defensive midfielder.\nThere has not been a Liverpool performance with that ‘wow’ moment yet. Many Liverpool fans will tell you they are unsure about how good the current side is, and it is far too early to compare it to Klopp’s previous title winners.\nAway form has been inconsistent with a couple of scratchy wins and draws, and although there has been plenty of talk about Liverpool 2.0, in reality they are winning games because of the foundations laid in Klopp’s first great Anfield team.\nTo me, at its heart this is still Liverpool 1.0.\nVirgil van Dijk, Alisson Becker, Trent Alexander-Arnold and Mohamed Salah – the backbone of the title win in 2020 – are doing a lot of heavy lifting.\nThere have been signs of promise from the recent signings like Dominik Szoboszlai, and those who joined the club over the last 18 months like Cody Gakpo and Darwin Núñez, but they have not shown they can produce week after week in the same way as Sadio Mané and Roberto Firmino at their peak.\nThe much talked about new midfield is not fully functioning yet, the trio of Szoboszlai, Alexis Mac Allister and Ryan Gravenberch impressing in moments rather than in back-to-back fixtures.\nFor Liverpool to maintain their position at the top, that has to change and the additions must raise their level from promising and occasionally good to consistently outstanding. A decision may be looming in January regarding a top No 6. If there is one out there, why not push for it now rather than wait?\n‘Moving quicker than anticipated’\nBut for all that, there are moments when I wonder if I – and maybe even some Liverpool supporters – are being hypercritical in our judgment of an emerging side which is ahead of schedule in its progress. The immediate ambition going into this season was to get back into the Champions League, not to close a 22-point gap to the Treble winners and go past Manchester City. This season felt like it was going to be about building towards a title bid next year so everything seems to be moving quicker than anticipated.\nThen you look at the fixture list at the start of this season and realise Liverpool have had it as tough as anyone near the top. Of their 16 games, nine have been away and they have already been to Manchester City, Newcastle, Spurs, Chelsea and Brighton.\nA more positive assessment is this: if Liverpool are top while in transition, how good will they be when it really clicks? Does everything have to be flawless to win the title? Maybe not.\n‘Finishing top does not have to be about breaking records’\nManchester City and Liverpool have set such a standard over the past five years, we have become conditioned to expecting near perfection from title winners. That means City, Liverpool and Arsenal are currently being judged to a different standard to the rest because we are in an era where an away draw is followed by a discussion about ‘how much of a blow is this to championship ambitions’.\nThis is a direct consequence of the ridiculous levels since Pep Guardiola and Klopp came to England. We could be seeing a temporary return to normality. Finishing top does not always have to be about breaking points records, or becoming one of the greatest teams of all time. I can recall plenty of sides who won titles despite not being as good as those who finished runners-up in other years.\nThis could be one of those seasons in which a side wins the league with a points total in the mid-80s. In all but three of the last 10 seasons, the tally of the leaders after 16 games was higher than Liverpool’s going into this weekend.\nMore in Sports\nNobody will write City off yet. To me, they remain the favourites. But their sluggish start by their standards has given the others a chance, and their participation in the Club World Cup presents a golden opportunity for their rivals to open up a considerable gap and generate some scoreboard pressure. Even with games in hand, if City return from Saudi Arabia and find themselves 10 points behind, they will be thinking they cannot afford many more mistakes.\nThat is why this Christmas period is so vital. Next weekend’s game between Liverpool and Arsenal will obviously be more influential in this year’s title race, but Klopp knows the significance of games against Manchester United. As with derby games, whoever wins carries momentum and belief into their following fixtures, while defeats have the opposite effect.\nWe saw that when the sides met last season. Early in his reign, Erik ten Hag was under pressure after some poor defeats and performances. A win over Liverpool at Old Trafford was the initial spark that led to finishing in the top four and eight points ahead of Klopp’s side, United losing only three of the next 22 league games.\nSimilarly, United have never recovered since losing 7-0 to Liverpool last March. They went into that game full of confidence having just won the Carabao Cup. United have lost 11 of their last 30 league games since boarding the coach to Anfield. It was as if all the belief that was growing sapped away. Ten Hag will hope it can be retrieved with what would be his biggest win of this season, and potentially a turning point in his reign given the questions around him in the aftermath of a miserable European exit.\nI have been involved in Liverpool versus United games in which we were on a terrible run and produced a brilliant, match winning performance to defy expectations. There will be no appetite at Anfield to believe Sunday will be anything like last season. That was a freak.\nFor all that, Liverpool go into it looking like they know what direction they are going, while United have stalled. The bottom line is all the class is in Klopp’s team with a goalkeeper, centre-back and goalscorer among the best in world football.\nFive years ago, the signings of Salah, Van Dijk and Alisson transformed a side on the cusp of success into winners.\nDespite my reservations about the side’s current form, there will be no lessening of expectations with world-class players of that calibre around.\nAs a team, Liverpool have not played like champions-in-waiting yet, but individually Van Dijk, Alisson and Salah are up there with the Premier League’s best performers.\nDo I think they will be lifting the title in May? No. But to paraphrase Klopp, the next eight days might turn this doubter into a believer.",
  "word_count": 1258,
  "scraped_at": "2026-02-14T02:20:16.280583",
  "_text_extracted": true
}