{
  "article_id": "ed38020b3bfb",
  "url": "https://theathletic.com/4929639/2023/10/10/real-madrid-santiago-bernabeu-grada-fans/",
  "title": "Real Madrid south stand : How the club transformed a former far - right stronghold",
  "date": "20231010T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If you have watched any of Real Madrid’s recent home games, you will have noticed a block of supporters, all dressed in white, at one end of the Bernabeu. They are known as the Grada Fans (‘grada’ means stand in Spanish) and occupy the stadium’s south side.\nNearly 2,000 fans are concentrated there and they all must follow a strict set of rules imposed by the club — they have to be aged between 14 and 45, for example. They are the loudest bunch of supporters and the ones that stir up the rest of the stadium — so much so that even new signing Jude Bellingham was surprised on his home debut last month.\nAdvertisement\n“The moment of the goal was the loudest I’ve ever heard on a football field,” said Bellingham after the game against Getafe, when he scored in the 95th minute and celebrated at one of the corners in the south end.\nIt was a moment to remember for Madrid fans — and especially for the south end of the Bernabeu — but things have not always been so harmonious on this side of the ground. Until as recently as 2013, it was dominated by a far-right ultras group that became increasingly vocal during Jose Mourinho’s reign as manager.\nSo how did Real get back their south stand? And who is behind the group that now occupies it? The Athletic explains.\nIn the early years of Madrid’s Nuevo Chamartin stadium, which was renamed the Santiago Bernabeu in 1955, there was no artificial lighting and all matches were played in daylight.\nMany areas of the field were unprotected from the sun and Madrid preferred to attack towards the shaded south stand in the second half, which led to many fans crowding there, where tickets were also cheaper.\nThere were still no seats in place, every spectator stood and, despite the arrival of night games and artificial light, the south end became the most raucous part of the Bernabeu.\nLa Pena De Las Banderas (The Supporters Group Of Flags) was one of the first groups to orchestrate fans in that section of the stadium (they are now known as La Clasica, or The Classic One). But it did not take long for radical members of that group to break away and form the Ultras Sur in the 1980s — ‘sur’ means south in Spanish. They had an extreme right-wing ideology, influenced by hooligan movements in England and Italy.\nThey soon displaced moderate fans and were given legitimacy by Madrid presidents such as Ramon Mendoza (who served in that role from 1985-1995) and Lorenzo Sanz (1995-2000), who posed for pictures with them. Until the 2000s, the ultras even had their own space at the Bernabeu where they could keep their banners with racist and violent symbols and messages.\nAdvertisement\nLike Atletico Madrid’s Frente Atletico or Barcelona’s Boixos Nois groups — both of whom position themselves on the far right — the Ultras Sur were a relic of dictator Francisco Franco’s Spain in an increasingly democratised country.\nThings started to change for the ultras when, in 1998, they broke the goal in the south end just before a Champions League semi-final against Borussia Dortmund after climbing the metal fence behind it. The game was suspended for 75 minutes and the club were punished with a one-match stadium closure and a fine of 115million pesetas, around €691,000 by today’s exchange rates ($726,000; £599,000).\nThat was when the rest of the Bernabeu and part of the club began to view the ultras’ radicalism with more misgiving. But they managed to keep their place in the stadium and took on fresh prominence during Mourinho’s reign as manager between 2010 and 2013.\nMourinho became a darling of the Ultras Sur with his outspoken public defences of his team against Pep Guardiola’s all-conquering Barcelona. They dedicated banners to him, including one that read “Your finger points the way” after the Portuguese coach poked then-Barca assistant Tito Vilanova in the eye in one hotly contested Supercopa de Espana Clasico in 2011.\nThe admiration appeared to be reciprocated. When Mourinho took charge of his last Real match against Osasuna in June 2013 after his tenure had grown sour, he only applauded the south end. On the same day, six members of the Ultras Sur came down to the pitch to present him with a plaque.\nIt would prove to be one of the last images of the far-right group at the Bernabeu. They descended into internal conflict after long-standing leader Jose Luis Ochaita stood down and ended up being expelled from the stadium by president Florentino Perez in December 2013.\nIt was then that the Ultras Sur started a campaign against Perez. This included death threats against Madrid’s longstanding president and the alleged desecration of his wife’s grave.\nAdvertisement\n“I know who are the ones who painted my wife’s grave, with names and surnames, but they are not going to intimidate me. They are not going to come in here,” Perez said on radio station Cadena SER in 2014.\nThat was a turning point for the club. In 2013, Madrid founded the Grada Joven de Animacion (Young Supporting Stand), now known as the Grada Fans RMCF. The idea was to create a youthful south stand not associated with their far-right predecessors who would generate the same atmosphere.\nGO DEEPER\nReal Madrid’s €1bn Bernabeu rebuild is fun, futuristic - and almost finished\nThe new-look stand was first made up of two groups of fans, La Clasica and Primavera Blanca (White Spring), along with a certain number of Ultras Sur who were forced to comply with rules set out by the club for all fans to exist in harmony.\nOn January 8, 2014, when the new environment was inaugurated, ultras waited for the new members and formed a corridor through which they were forced to pass. The aim was to intimidate them, and many were scared off.\nBut the club stood firm against the Ultras Sur and more and more supporters’ groups were convinced to join. These days, it is estimated between 30-50 groups are represented in the Grada Fans section, from Spain and beyond.\nSome ultras tried to take up other seats in the stadium, but they were nowhere near as prominent as before, while some others are still banned. They have always met at the nearby Marceliano Santa Maria street before games, and some still do so, staying close by, outside the stadium, while matches are going on.\nThe club moved the singing section to the lowest tier of the ground due to safety, among other reasons. Madrid gave those fans strict conditions: all members had to sign an agreement so the area would always be filled with young people, all had to be dressed in white without exception and all had to cheer in a peaceful way — with no chants that could harm the club’s interests.\nAdvertisement\nThe decision did not please everyone, especially the move to give those in the south stand cheaper tickets. It is hard to become a Real Madrid season ticket holder, as fans must first be members and tickets are often passed down through generations.\nWinning La Liga and Champions League titles seems to have silenced the critics, though. And, as Bellingham has quickly discovered, the south stand is as loud as ever.\n(Top photo: Victor Carretero/Real Madrid via Getty Images)",
  "word_count": 1231,
  "scraped_at": "2026-02-14T02:07:14.742402",
  "_text_extracted": true
}