{
  "article_id": "ed3f884cdd38",
  "url": "https://metro.co.uk/2026/01/07/ruben-amorim-pole-position-new-job-manchester-united-sacking-26135049/",
  "title": "Ruben Amorim in  pole position  for new job after Man Utd sacking | Football",
  "date": "20260107T184500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim is being lined up for a new job just days after he was sacked by Manchester United.\nAmorim’s disappointing 14-month reign at Old Trafford came to an end on Monday morning.\nThe 40-year-old, who arrived from Portuguese champions Sporting, won just 24 of his 63 games in charge of United, the lowest win percentage of any permanent manager since Sir Alex Ferguson.\nPoor results are only one side of the story, however, as Amorim also fell out with the Old Trafford hierarchy in the days leading up to his dismissal.\nAmorim established himself as a highly-rated and successful coach in Portugal and it remains to be seen whether he makes an immediate return to management or has some time off following a difficult spell in Manchester.\nManchester United’s largely dismal form under Amorim does not appear to have put off his potential suitors, however, and one of his former club have already been linked with a move.\nAmorim understandably dismissed links with a return to Benfica back in September after presidential hopeful Joao Noronha Lopes revealed his interest in bringing him back to the club.\nLopes, who ended up losing the election with Rui Costa, even attended a match at Old Trafford after making it clear he saw Amorim as a future Benfica manager.\nShorty after winning the presidential election, Costa sacked struggling manager Bruno Lage and appointing Jose Mourinho as his successor.\nBut the Daily Mail say legendary boss Mourinho is ‘looking increasingly vulnerable’ after Benfica slipped 10 points behind Portuguese leaders Porto and down to 25th in the Champions League.\nThe report adds that Amorim could be in ‘pole position’ to take over Benfica in the summer should Mourinho lose his job.\nAmorim, a former midfielder who earned 14 caps for Portugal, spent almost a decade at Benfica as a player, winning three league titles with the club.\nMourinho was asked about Amorim’s exit from Manchester United earlier this week and said: ‘What happened with Ruben is something that only Ruben can analyse.\n‘I believe he will do it, he and his staff. Whether he will do it with you and make his view public, that I do not know.\n‘My career at Manchester United, I know it well. I also know the reason why I ended up leaving.\n‘But as I always do, or try to do, when I leave a club I close the door and then I do not make comments. I do not analyse externally what happened.\n‘A door closes and another one will open. That is what happened when I left. The history stayed there, the numbers stayed there, the three medals came home and that is it.’\nIn an exclusive interview with Metro, Manchester United legend Gary Pallister tipped Amorim for a return to Portugal.\n‘He’s a young man and this may take time to get over,’ Pallister said on behalf of Hard Rock Bet. ‘He certainly looked like a manager under immense pressure.\n‘The spotlight at Manchester United is like nothing else and he wouldn’t have experienced anything like this before in his life. It’s one of the two biggest clubs in the world.\n‘He didn’t have Premier League experience, and that showed at times. He was looking like a bright young coach which is what the management of Manchester United had decided upon.\nMore Trending\n‘I don’t know where Ruben ends up next. He might go back to Portugal. I’m sure someone from Portugal would want him after the job he did over there with Sporting.\n‘He has got time to sit and think about it. I’m sure there will be some scar tissue from this. It’s been a tough ride.’\nEx-United midfielder Darren Fletcher has been placed in temporary charge of the side while Old Trafford bosses appoint a caretaker manager until the end of the season.\nOle Gunnar Solskjaer and Michael Carrick are the two leading contenders for that role.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: John Terry makes Chelsea transfer demand after Liam Rosenior appointment\nMORE: Dominik Szoboszlai sends warning to Arsenal over Premier League title race\nMORE: Liam Rosenior hails ‘outstanding’ £18m star after Chelsea appointment",
  "word_count": 708,
  "scraped_at": "2026-02-14T01:50:01.810232",
  "_text_extracted": true
}