{
  "article_id": "ed4a910c16b9",
  "url": "https://www.politico.eu/newsletter/brussels-playbook/inside-the-commission-reshuffle/",
  "title": "Inside the Commission reshuffle",
  "date": "20251021T134500Z",
  "domain": "politico.eu",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CIAO THERE. This is Gerardo Fortuna, back for another week after indulging in my favorite fall hobby: going for long walks, pretending I’m not procrastinating, watching the foliage turn shades of gold and red. The Japanese have a word for it: momijigari. But it’s not just the trees turning — Brussels is too, with posts shifting and power moving.\nDRIVING THE DAY: COMMISSION RESHUFFLE\nMUSICAL CHAIRS IN THE BERLAYMONT: European Commission President Ursula von der Leyen and her chief of staff, Bjoern Seibert, are sketching out a high-stakes reshuffle of the EU executive’s top ranks. Several directors-general could move places in what one official described as a “chess play” by von der Leyen’s arch-strategist to fill strategically vital positions with figures aligned with the president’s political vision.\n“Big changes are on the horizon,” one Commission insider said, but only a restricted group of officials know what’s going on. There were whispers last week it might even have sneaked onto the agenda at the College of Commissioners today, but it’s still being worked on behind closed doors. In recent days, POLITICO’s Mathieu Pollet, Jacopo Barigazzi, Gabriel Gavin, Seb Starcevic and yours truly spoke to 13 Commission officials in the Cabinets and deep in the machine — all granted anonymity to speak freely — to piece together secretive high-level discussions.\nCh-ch-ch-changes: Top staffers in trade, competition, communications, enlargement, communications network, health and energy are expected to be on the move. The reshuffle is driven partly by structural realities: some directors-general have hit their tenure limits, others are retiring, and in one case a DG shares the same nationality as her commissioner (never ideal).\n**A message from Amazon: 60% of sales on Amazon come from independent sellers like Caroline from 3Bears in Munich, Germany. “We're beginning to reach customers across Europe and, as a small team, it's so exciting to see where we'll go next,” says Caroline. Learn how Amazon helps European small businesses grow.**\nWhy it matters: The names circulating are familiar — and so are their loyalties — but where they land could reshape the power balance inside the Berlaymont. Some DGs are particularly strategic, too. Take DG COMP, for instance: not just any directorate, but also the one where Teresa Ribera, von der Leyen’s most powerful internal critic, holds sway. Interim chief Linsey McCallum — seen as Ribera’s favorite — has already ruled herself out. Whether the next appointee is a von der Leyen loyalist or simply someone Ribera can work with will say a lot.\nThe shake-up began with the need to replace Olivier Guersent, who left his post as head of DG COMP in August. That vacancy has set off a domino effect across the institution. Once one piece moves, the rest follow.\nCOMP contenders: The strongest contenders for DG COMP are Gert Jan Koopman, the enlargement DG chief (yes, the one known for owning that eco-luxury resort in Bali with its famous infinity pool), and Ditte Juul Jørgensen, current boss of DG ENER. Some insiders also float Céline Gauer, head of the reform and investment task force, though she’s seen as a more likely pick for Commission secretary-general.\nWho’s not going to COMP: Sabine Weyand — the familiar face from DG TRADE … and the “sad face” from the U.S.-EU deal — is expected to leave her post, where she’s served with distinction. She could move to DG GROW or even DG ENEST, especially if the directorate is split again into Enlargement and Neighborhood, as it has been in the past (insiders say the current setup is overstretched).\nEnergy shifts: At DG ENER, the departure of Jørgensen — who shares the same nationality and surname as her commissioner, Dan Jørgensen — looks increasingly likely. She’s being talked about for both DG TRADE and DG COMP.\nOther question marks: Then there’s Anthony Whelan, another of von der Leyen’s close aides. He’s rumored to be in line to replace Roberto Viola at DG CONNECT, though some suggest he could instead take a deputy role in state aid in DG COMP, which would suit von der Leyen’s “go and spend” stance on the matter. Meanwhile, the potential retirement of DG SANTE’s Sandra Gallina could open yet another vacancy in the coming months.\nThe biggest mystery: The job of secretary-general remains the toughest nut to crack. Weyand would be a natural choice — but as a German senior figure in the European People’s Party (sounds familiar, right?), politically complicated. That leaves Gauer as the frontrunner. Still, the post doesn’t carry the same clout it once did under Martin Selmayr, as one source put it.\nTiming? The reshuffle isn’t “imminent imminent,” according to one official. Whatever happens, the changes will only take effect next year, two officials told Playbook. A Commission spokesperson said there’s “no comment on the timing or scope” of the planned reshuffle.\nCautionary tale: This whole process is extremely delicate. One senior Commission official recalled Jean-Claude Juncker’s reshuffle in 2018 — the one that elevated Selmayr to sec-gen — also paved the way for his downfall, after it was handled entirely in-house without consulting member countries. Could von der Leyen and Seibert be making the same mistake?\n3 THINGS FOR YOUR RADAR\nTHREE IS THE MAGIC NUMBER: There’s action today across all three EU institutions and in all three of the bloc’s main centers — Brussels, Luxembourg and Strasbourg.\nCOMMISSION — MOMENT OF TRUTH FOR YOUNG FARMERS: It’s College day, with the unveiling of the 2026 work program (the Commission’s to-do list, which we talked about last week) and the long-awaited strategy on generational renewal in farming — Brussels’ bid to tackle the bloc’s looming rural demographic crunch.\nFarmers, endangered species: It’s a slow-moving crisis that looks more like the EU’s mission impossible: stopping young farmers giving up before they’ve even begun. Curtain-raiser here.\nCOUNCIL — BUYING OFF THE DOUBTERS: EU climate chief Wopke Hoekstra will tell environment ministers in Luxembourg today that Brussels plans to rein in its new carbon price — a move aimed at winning support for the bloc’s 2040 climate target.\nWhat to expect: In a letter Monday, von der Leyen said Hoekstra would propose tweaks to the carbon price on heating and transport fuels to calm fears of “too high or volatile prices.” The goal: get leaders on board with climate targets ahead of this week’s European Council. Full story by my colleague Zia Weise.\nPARLIAMENT — MEPs TAKE THE AX TO FOREST MONITORING: The EU’s plan to track the state of Europe’s forests faces another likely defeat in Parliament today, after the environment and agriculture committees voted it down.\nThe issue: Lawmakers from the EPP, European Conservatives and Reformists (ECR) and Patriots for Europe argue the proposal oversteps national powers — and this right- to far-right majority is expected to hold in today’s plenary.\nLast-ditch push: The Socialists and Democrats’ Eric Sargiacomo and co-rapporteur Emma Wiesner have put forward amendments to save the file, with support from the Greens, but few expect a miracle. Even if rejected, the ball moves to the Council, which can either shelve the file or send its own position back for a second reading.\nEU-CHINA: INSIDE THE CALL\nCAN YOU HEAR ME, BEIJING? When Trade Commissioner Maroš Šefčovič and China’s Commerce Minister Wang Wentao speak on the phone today, they won’t be short of issues to discuss.\nOn Brussels’ mind: Beijing’s recent export controls on rare-earth magnets and their raw materials top the agenda.\nOn China’s mind: Brussels’ plans to require Chinese companies to transfer technology to European firms as a condition for investing in the EU.\nWhat now: “We need to get the Chinese to agree to carve-outs and waivers on certain issues that are particularly sensitive for us,” former Trade Commissioner Pascal Lamy told my colleague Camille Gijs. “And that’s something that can be negotiated. Basically, the Commission is saying to the Chinese, ‘Look, we understand that you’re at loggerheads with the Americans, but if you want us to stay somewhere in between, don’t treat us the way you treat the Americans. There are five or six issues where, if you hurt us, we will be forced to react.’”\nOne of them is rare earths: China dominates the global rare earths supply chain, controlling 61 percent of extraction, 92 percent of refining, and supplying nearly all of the EU’s rare earths and magnets, per the IEA.\nCase in point: The Dutch government this month moved to seize control of Chinese-owned chipmaker Nexperia, barring it from transferring assets or appointing executives without approval. Lamy called the move “embarrassing,” saying it showed Dutch sensitivity to U.S. pressure — a claim the Netherlands denies.\nComing up: EU leaders are set to discuss rare earth dependency at Thursday’s European Council. “That is a topic that can no longer be avoided,” a German official told our Berlin-based colleague Nette Nöstlinger, though they added no decisions are expected yet.\nUKRAINE-RUSSIA LATEST\nBELGIUM BLINKS ON FROZEN ASSETS: In a key shift, Belgium signaled it won’t block an EU plan to tap billions in frozen Russian state assets to fund a major loan for Ukraine. My colleague Gregorio Sorgi has everything you need to know about it.\nAll systems go: Euroclear, the financial giant that holds the assets, is based in Belgium. The country’s government was against seizing the money due to fears a court could one day hold Belgium liable and order it to repay the funds. But a Belgian diplomat told POLITICO his country will not oppose a call for the Commission to draft a legal proposal on the use of frozen assets. A draft of European Council conclusions seen by Playbook will give the “political go-ahead” for the Commission to move forward after the EU summit on Thursday.\nThe stakes: If approved, the plan could unlock up to €140 billion for Kyiv — enough to finance two to three years of military and budget support — by leveraging interest from frozen Russian state assets seized after the February 2022 invasion. Even with the green light, though, the Commission’s proposal faces tough negotiations with national capitals in the weeks ahead.\nMeanwhile, in Washington: The Trump administration is stalling the EU-led plan for the G7 to expand the use of frozen Russian assets to help Ukraine, Bloomberg reports.\nPUTIN’S FLIGHT OF FANCY? European countries are grappling with the prospect of Russian President Vladimir Putin — who is wanted by the International Criminal Court on war crimes charges — paying a visit to an EU capital in the coming days. The plans, endorsed by Donald Trump, have divided governments and raised both practical and legal questions.\nNot for us: Responding to a question from POLITICO’s Gabriel Gavin in Luxembourg on Monday, Lithuanian Foreign Minister Kęstutis Budrys said he “cannot imagine him [Putin] crossing our airspace” to take part in a proposed summit in Hungary.\nOthers are more cynical … “If the U.S. wants Putin to come, he’ll find a way to get there,” said a senior European diplomat, granted anonymity to speak frankly. “The real challenge is responding to the constant changes — it’s two or three new developments a day from Trump.”\nRomain where you are: Romania — which sits between the Black Sea and Hungary — said Monday it had not received any requests to use its airspace for the Russian leader. The country’s foreign minister, Oana-Silvia Țoiu, said Moscow would have to ask if it planned to fly over its territory, despite Budapest’s insistence it can host the talks.\nMeanwhile … Top EU diplomat Kaja Kallas told journalists in Luxembourg that the principle of territorial integrity for Ukraine should be non-negotiable in any discussions. More from Playbook’s Nick Vinocur.\nPATRIOTS’ GAMES\nCALLS GROW FOR VÁRHELYI TO RESIGN OVER SPY CLAIMS: Ursula von der Leyen is facing growing calls to force Health Commissioner Olivér Várhelyi to resign over the alleged spying scheme that operated out of the Hungarian permanent representation during his time as the country’s ambassador.\nThe push: More than 60 academics from the Good Lobby Profs network have written to von der Leyen saying new revelations — including the former Hungarian intelligence chief confirming the network’s existence — “significantly strengthen the credibility of earlier claims.”\nThe demand: If she doesn’t ask him to resign, von der Leyen should “explain publicly why she doesn’t do so despite having manifestly lost confidence,” the group says — and to refer him to the EU Court of Justice for possible sanctions.\nThe reply: A Commission spokesperson told my colleague Mari Eccles that Brussels takes the allegations “very seriously” given their security implications and has launched an internal group to examine the claims. The spokesperson added that Várhelyi told von der Leyen he was not aware of recruitment attempts by Hungarian intelligence services targeting European Commission staff while he was at Hungary’s permanent representation and declined to comment further.\nSWEDISH PLAN TO TURN SCREWS ON HUNGARY: Stockholm is circulating a proposal to restrict access to EU funding for countries that flout the bloc’s rules.\nHarsher than Brussels: The Commission has already proposed tightening “conditionality” for obtaining EU funds under the bloc’s long-term budget, but Stockholm’s plan, seen by Nick Vinocur, aims to close loopholes that could allow scofflaw states to keep pulling in EU cash.\nNo names (but no doubts): Under the draft plan, loopholes in the conditionality restrictions would be closed. While Stockholm doesn’t name Hungary in its paper, it’s the country most immediately concerned by such moves.\nIt’s simple — no EU funds without rule of law: Sweden’s European Union Affairs Minister Jessica Rosencrantz told Playbook: “Our position is clear — all screws need to be tightened to implement President von der Leyen’s clear principle: no EU-funding without the rule of law. I don’t want to see a single euro to member states that do not respect our fundamental European values.”\nFALL OF THE GENERAL: Roberto Vannacci, the colorful ex-general who has become a far-right firebrand in Brussels and Rome, is heading toward a reckoning in Italy after embarrassing the League party in a regional election.\nA general with an army: Vannacci made his name with a controversial book entitled “The World Upside Down” that slammed progressive values, and he has since been made deputy of Matteo Salvini’s League party, while overseeing an array of “teams” that function as a kind of parallel organization.\nFall from grace: But now the erstwhile military man is under a growing barrage of criticism after garnering a miserable 4.48 percent of the vote in a regional election in Tuscany following a campaign for which Salvini gave him full responsibility.\nDo or die: According to one League grandee, speaking on condition of anonymity, Salvini is now expected to present Vannacci with an ultimatum at a party council scheduled for today. The choice: either he keeps his prestigious deputyship of the League but dismantles the “teams,” or leaves the party altogether. “I don’t expect the general to attend the board meeting, so it could become a sort of trial in absentia,” the official said.\nRipples in Brussels: That could knock Vannacci’s standing not only in Rome but also in the European Parliament’s Patriots family, in which he became a prominent member after last year’s EU election. That’s if he doesn’t take a good chunk of the League’s constituents — and MEPs — with him. Italian media also reported on the meeting.\nIN OTHER NEWS\nLIKE CLOCKWORK: Spanish Prime Minister Pedro Sánchez has revived the never-ending EU debate on scrapping daylight saving time ahead of this week’s clock change. “I, frankly, no longer see the point in it,” he said in a social media post Monday.\nSARKOZY BEHIND BARS: Former French President Nicolas Sarkozy is expected to begin a five-year sentence today in Paris. My Playbook Paris colleagues report that Sarkozy’s children are organizing a rally in support of their father before he heads to La Santé prison.\nAGENDA\n— General Affairs Council in Luxembourg. Arrivals from 9 a.m. … Press conference around 5:30 p.m. Full agenda. Watch.\n— Environment Council in Luxembourg. Arrivals and doorsteps around 8 a.m. … Press conference around 5:25 p.m. Watch.\n— EU-Uzbekistan Council. Arrivals at 7:30 a.m. EU High Representative Kaja Kallas chairs the meeting.\n— Weekly College of Commissioners meeting.\n— European Parliament plenary session continues in Strasbourg. Debate on the recent Gaza peace agreement and the role of the EU at 9 a.m. Full agenda.\n— European Parliament President Roberta Metsola addresses the #All4Cyber Exhibition at 4 p.m. … attends award ceremony for the Daphne Caruana Galizia Prize at 6 p.m. Watch the ceremony.\n— Trade Commissioner Maroš Šefčovič has a videoconference call with India’s Commerce Minister Piyush Goyal.\nBRUSSELS CORNER\nWEATHER: High 17C, cloudy with a chance of rain.\nGREEN GOALS: After POLITICO’s global breaking news editor Ali Walker sliced down Commission staffer Ignazio Cocchiere to concede a penalty in the amateur BXL Euroleague cup final last season, he was inspired to track down the former professional footballer who scored one of the most consequential goals in recent Belgian football history — and now works as a policy assistant in the cabinet of climate chief Wopke Hoekstra.\nBig stage: Before two of Cocchiere’s former clubs — Union Saint-Gilloise, where he remains a club legend, and Inter Milan — face off in the Champions League in Brussels tonight, read our profile of the man who went from playing with Mario Balotelli to working in the Berlaymont.\nFRAUD WARNING: Limburg police are warning against a growing number of scammers targeting users of the Belgian digital identity card Itsme. One victims lost €100,000 last week, VRT reports.\nON STAGE: The Bridge Theatre is putting on rock musical “tick, tick … BOOM!” It runs until Nov. 2.\nBIRTHDAYS: MEP Rosa Estaràs Ferragut; former MEP Matthias Groote; Mastercard’s Katie LaZelle; European Commission’s Tobias Müllensiefen and Annemarie Huber; Israel’s PM Benjamin Netanyahu.\nTHANKS TO: Mathieu Pollet, Jacopo Barigazzi, Gabriel Gavin, Seb Starcevic, Zia Weise, Leonie Cater, Max Griera, Camille Gijs, Antonia Zimmermann, Gregorio Sorgi, Gabriel Gavin, Mari Eccles, Ben Munster, Nicholas Vinocur, Ali Walker; Playbook editor Alex Spence, reporter Ketrin Jochecová and producer Dean Southwell.\n**A message from Amazon: Caroline's 3Bears started as a dream. “It was kind of a fairytale idea, but we made it a reality,” says Caroline. “We wanted to help people start their day with high-quality porridge.” 3Bears represents thousands of European success stories selling on Amazon. In 2024, EU-based small businesses sold more than 1.3 billion products and generated more than €34 billion in sales within the EU alone. These entrepreneurs are creating an estimated 350,000 jobs across the EU, many in rural areas. Learn more about how Amazon helps European businesses thrive in our latest EU Small and Medium Enterprises Impact Report at AboutAmazon.eu.**\nSUBSCRIBE to the POLITICO newsletter family: Brussels Playbook | London Playbook | London Playbook PM | Playbook Paris | EU Election Playbook | Berlin Playbook | Global Playbook | POLITICO Confidential | Sunday Crunch | EU Influence | London Influence | Berlin Bulletin | Living Cities | D.C. Playbook | D.C. Influence | Canada Playbook | All our POLITICO Pro policy morning newsletters",
  "word_count": 3176,
  "scraped_at": "2026-02-14T01:59:14.388679",
  "_text_extracted": true
}