{
  "article_id": "ed69b2e64950",
  "url": "https://metro.co.uk/2024/11/01/jhon-duran-sends-message-arsenal-75m-transfer-move-21912664/",
  "title": "Jhon Duran sends message to Arsenal over £75m transfer move | Football",
  "date": "20241101T203000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jhon Duran has distanced himself from rumours of a possible move to Arsenal, insisting he is ‘happy’ at Aston Villa and confident he can achieve ‘big things’ under Unai Emery.\nThe 20-year-old striker has been forced to play second fiddle to Ollie Watkins throughout much of his stay at Villa Park but has made himself nigh-on impossible to ignore with a string of eye-catching performances this season.\nIt comes after months of speculation over Duran’s future, with West Ham reportedly launching an unsuccessful bid of £30million – plus teenage midfielder Lewis Orford – for the Colombia international towards the end of the summer transfer window.\nDuran’s impressive return of eight goals in 14 appearances this term – containing just three starts – has won the forward plenty more admirers across European football, including Barcelona and Arsenal, who have both contacted Villa over a potential deal this January.\nBut Villa are relaxed about the situation given Duran recently extended his contract until 2030 and the club are not prepared to do business unless they receive an offer north of £75m for the attacker.\nOn speculation linking him with a move away from Villa in the summer, Duran told Sky Sports: ‘Yes, I think there were rumours. As a young man, the head goes to other places.\n‘But there was always total support from Unai, from [president of football operations] Monchi, and above all from Damian [Vidagany, director of football operations].\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘The three of them are important pillars in this club. They have achieved many things in a short time, and they have helped me a lot. They were very valuable to me because they kept me grounded, they told me things as they have to be said.\n‘I think that helps, in a way, the mind, and they… I don’t know, the start of the season was about my mind. Now it’s different.\n‘With experience, we’re going to do big things, and we’re working for that. Thanks to them, we’re here, and I’m happy here.’\nDuran’s frustrations over a lack of regular playing time boiled to the surface when he was substituted in the second half of Villa’s Champions League victory over Bologna.\nThe Colombian was pictured punching his seat in the dugout before kicking the chair in front of him – but Emery insisted he had ‘no problem’ with the reaction.\n‘There are [moments of] love and hate, sometimes! But no, I feel very grateful to him, very grateful to him and his coaching staff,’ Duran added.\n‘We’ve had many problems, but they’re normal, I think.\n‘The truth is, I’m very happy to be here with him, to share the space with him, to learn from his teachings. He wants to teach me all the time. He’s protective, sometimes.\n‘Sometimes it happens, and there are sparks! So we’re constantly fighting! But I think it’s normal for a young man of my age, and a person like him who already knows a lot, who has already achieved so many things.\n‘The truth is, I feel very, very grateful to be in this space, and that he’s a person as great in football as he is. To learn more from him every day, and I’m very happy with him here.\n‘Yes, sometimes we argue. Because he has his point of view, I have mine, and I’ve never been the one who stays quiet. If I have something to say, no matter who it is, I say it.’\nDuran ‘likes to be different’ both on and off the pitch and views Zlatan Ibrahimovic as one of his footballing role models.\n‘I love him for his personality, his self-confidence, his scoring ability, his temper on the pitch,’ he continued.\nAnd he always said, “Why be like everyone if you can be different?”, so I like the way he approaches football and life, and I like that example.\n‘I like to be different. I like to do what’s good for me, what makes me feel good, not what everyone wants me to do.\n‘I think that’s how it’s going to be until the day I’m gone. This is me.\n‘I’m going to try to do everything to be happy, and I don’t care what they say outside, it’s me and my family, and here I am.’\nAmong Duran’s many admirers is Patrick Vieira, who urged Arsenal to pursue a move for the striker earlier this week.\nMore Trending\n‘I loved his performance against Bayern Munich,’ the ex-Arsenal captain told bettingexpert.com.\n‘He’s the right player for Arsenal – quick, unselfish, solid in the air, technically skilled, and intelligent in his movement.’\nDuran started and scored in Villa’s Carabao Cup defeat to Crystal Palace on Wednesday night and will no doubt be desperate to continue his run in Emery’s XI at Spurs this weekend.\nVilla have suffered just one loss in an impressive start to the new Premier League season and sit fourth in the table ahead of their trip to the Tottenham Hotspur Stadium.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Joe Cole predicts Manchester United vs Chelsea and makes Viktor Gyokeres transfer claim\nMORE: Paul Merson warns Arsenal ‘will get found out soon’ because of Mikel Arteta tactic\nMORE: Alan Shearer’s Premier League predictions including Manchester United vs Chelsea",
  "word_count": 943,
  "scraped_at": "2026-02-14T01:57:46.235561",
  "_text_extracted": true
}