{
  "article_id": "ed6e48bcc7d4",
  "url": "https://www.nytimes.com/athletic/6882189/2025/12/19/afcon-2025-too-big-to-ignore/",
  "title": "AFCON has become too big to ignore : Unpredictable , dramatic and elite - level stars",
  "date": "20251219T061500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Follow all of The Athletic’s AFCON coverage here: https://www.nytimes.com/athletic/tag/afcon-2025/\nThe fingers of Europe and Africa were almost touching and between them, at the end of a golden hour, the sun merged with the horizon.\nWith the sky turning from orange to purple, the serrated edges of Morocco’s extreme north became clearer.\nAdvertisement\nThe Port of Tarifa in Spain was getting smaller, yet it never disappeared. Laurie Lee described the town as “washed-up Africa” because of its proximity to the continent, which is just nine nautical miles away.\nFrom the eastward-facing deck of the Balearia ferry, you could see the white cliffs of Gibraltar. There, you have warm beer, Marks & Spencer, red phone boxes and cannons facing towards the invisible enemies.\nOn the other side, you could see Morocco, with Jebel Musa brooding and the sparsity of the Rif mountain range behind it, which forks sharply like a sheath of daggers.\nThe Greeks and the Romans called these opposite peaks the twin pillars of Hercules. It was the end of the world, beyond which lay a void.\nToday, it is the choke point separating the Atlantic Ocean and the Mediterranean Sea; dangerous waters of swollen currents, ship movements and sharks chasing in the slipstreams. Beneath, a gas line helps partly explain Morocco’s value to Europe.\nIt seemed like a good place to begin The Athletic’s coverage of the 2025 Africa Cup of Nations. Geographically, the tournament has never felt closer to the rest of the world, not since 1988, anyway, when Morocco last hosted.\nOn that occasion, only eight teams qualified and all the games were played in Casablanca and Rabat. This time, 24 nations are competing, and six cities are involved.\nOne of them is Tangier, a city as Moroccan as a lamb’s head seared and scraped onto bread, albeit one with an international outlook. From the avenues that sink towards the Mediterranean from Boulevard Pasteur, Europe is right there.\nYet it was once called the Interzone, a tag created by William Burroughs, one of many writers who based themselves in Tangier between 1923 and 1956, when it was governed by Western powers and became a magnet for artists and spies.\nAdvertisement\nBurroughs, like many of Tangier’s famous foreign expats, was escaping a past, having killed his wife in Mexico City, where he was convicted of manslaughter in absentia with a suspended sentence.\nIn Tangier, he discovered a native quarter that was a “maze of sunless, twisting streets and blind alleys”. There is always a sense that something is happening just beyond the shuttered windows, or that something is going to happen, though it is not quite obvious what it is until it is in your face.\nOn this occasion, it is surely AFCON, a spectacle that Veron Mosengo-Omba, the secretary general of the Confederation of African Football (CAF), claimed on Tuesday, would be “the best edition ever” due to its “global” appeal and Morocco’s “world-class” infrastructure.\nIn 1988, AFCON seemed much further away, but it has since become too big to ignore.\nMoments after The Athletic came ashore in Tangier’s port on Wednesday evening, CAF announced a “record-breaking” 20 media rights partnerships for the competition across more than 30 European territories. This came after a “landmark” agreement this month with Channel 4, which means all of its 52 matches will be on free-to-air television in the United Kingdom for the first time.\nThe broadcaster was not the only British company competing for this deal. In its press release, CAF nodded to Moroccan diasporas, explaining some of the wider interest, particularly in Spain. If that is the case, qualified nations with huge populations and significant communities abroad, such as Nigeria, Egypt and DR Congo, will also have contributed.\nThe attention surrounding AFCON also stems from the selection of high-level players from the most popular European leagues, including Mohamed Salah, who has placed himself in the spotlight recently with his comments rather than his performances, in case you hadn’t noticed.\nAdvertisement\nIf these leagues are defined as England, Spain, Italy, Germany and France, then 124 players from 62 clubs will be available for their countries in Morocco over the next month. For the record, two days before the opening ceremony in Rabat, a total of 45 Premier League players representing 14 clubs are present. And in descending order, there are 25 from 15 Ligue 1 teams, 21 from 12 Serie A sides, 17 from 10 German Bundesliga clubs and 16 from 11 in La Liga.\nThis, at the very least, will cause sideways glances from Europe, initially laced with some resentment depending on the fortunes of the weakened clubs. Yet Channel 4 took confidence from the figures towards the end of the previous AFCON in February 2024, suggesting that viewers were continuing to engage with the tournament because they were enjoying it.\nA recap of what happened at that competition in the Ivory Coast: when the hosts were humiliated 4-0 in their third and final group game by Equatorial Guinea, they were on the brink of elimination and needed favours from other countries to go through. In the meantime, they sacked their French coach Jean-Louis Gasset without knowing their fate. Somehow, they ended up winning the whole thing.\nFootball is at its best when it is pure, unscripted drama. Given that it is easier to predict who will win the Premier League, the Champions League and the European Championship, AFCON provides a sense of the unknown because the favourites seldom deliver when it matters. This tournament has not been ruined by monopolies.\nNo African nation has won the World Cup, so AFCON also takes on an extra significance because it is a tournament where palpable success feels realistic.\nYet a World Cup looming just around the corner does bring an extra dimension to this edition. History shows that African teams tend to do better on a global stage immediately after encouraging results on their own continent.\nIn 2002, Senegal finished as AFCON runners-up for the first time before then matching Cameroon’s 1990 achievement of reaching the World Cup quarter-finals. Eight years later, Ghana did the exact same. In 2022, Morocco became the first African nation to reach the semi-finals of a World Cup, having only got to the quarter-finals of AFCON months earlier, although that experience provided vital tournament exposure for some players who subsequently emerged as key men in Qatar.\nAdvertisement\nWith more African countries competing at the World Cup in 2026 than ever before, the next month should provide a glimpse into the near future for a continent that has a deeper footballing past than some of those that have overtaken it in other ways.\nAFCON, first played in 1957, is only a year and a half younger than the European Cup/Champions League and is more than three years older than the European Championship, yet it has often been viewed outside of Africa as a disruptor because of the way it sometimes clashes with the calendars of competitions with more money behind them.\nThis year, AFCON begins a few days before Christmas for the first time because FIFA events did or will occupy the summers of 2025 and 2026. We already have dates for the European Championship in 2028 and the World Cup two years later, but we don’t know exactly when the next AFCON after this one will take place (even though it is scheduled for 2027), a fact that says much about the power CAF lacks compared to other federations.\nIt also helps explain why AFCON has easily been framed as an inconvenience for anyone who is not instinctively invested in it.\nIt is here now, though. And if you cast it to one side, you are missing out.\nEvery football country claims to be mad about the sport, but Morocco really is.\nAs the sun set on Thursday evening, Morocco were playing Jordan in the FIFA Arab Cup final thousands of miles away in Qatar.\nThey’d sent a second-string team to that competition because AFCON was starting three days on from its final, but if you assumed all of the country’s focus and energy would be around hosting responsibilities and the chance of winning the continental title for the first time since 1976, you’d be wrong.\nAll around the medina, Tangier’s old city, shop workers were following what was happening in Qatar on their phones. Given the enthusiasm of the commentary, it sounded like the game was deep in added time. It wasn’t. When Jordan took a 2-1 lead with 20 minutes to go, the Moroccans in Cafe Tingis went berserk and it felt like arguments were breaking out everywhere. By the time I returned to my accommodation further into the medina, the scores were level again, but I only knew that because of the noise rushing through the area’s alleyways.\nMorocco ended up winning the game 3-2, and it really did illustrate how narrowly we tend to see things in other parts of the world.",
  "word_count": 1491,
  "scraped_at": "2026-02-14T02:09:38.450020",
  "_text_extracted": true
}