{
  "article_id": "ed9415e6cb7b",
  "url": "https://www.westmeathexaminer.ie/2025/05/21/man-united-want-to-be-at-the-top-of-everything-bruno-fernandes/",
  "title": "Man United want to be at the top of everything – Bruno Fernandes",
  "date": "20250521T091500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United want to be at the top of everything – Bruno Fernandes\nBy Simon Peach, PA Chief Football Writer, Bilbao\nBruno Fernandes says Manchester United need to start fighting at the “top of everything” as Ruben Amorim’s side attempt to kickstart their rebuild by winning the Europa League.\nThe 20-time English champions are coming towards the end of their worst top-flight season since suffering relegation in 1973-74, but their European efforts have offered hope in a campaign to forget.\nUnited remain unbeaten in the Europa League heading into Wednesday’s final against fellow domestic strugglers Tottenham, with Champions League qualification and silverware on offer to a club longing for a brighter future.\n“It’s very important – I think the manager has been very clear with that,” skipper Fernandes said of the chance to secure a place at European football’s top table with victory in Bilbao.\n“We want to be at the top of everything – not only the Europa League, not only the Premier League. We want to be at the top of the FA Cup, Carabao Cup, everything we are involved (in).\n“This club needs to be fighting for everything we have ahead of us, obviously knowing that it’s not always possible to be in the finals, it’s not always possible to be winning trophies.\n“But our aim and our goal has to be always to be until the end of the competitions fighting for the possibility of winning trophies and that’s what we want.\n“Tomorrow we have a big chance in a competition where our aim since the beginning of the season was being in Bilbao in the final and everything we have to focus on is that we have a big game, a big final and a big opportunity to get silverware.”",
  "word_count": 295,
  "scraped_at": "2026-02-14T02:26:38.635448",
  "_text_extracted": true
}