{
  "article_id": "ed97bd56b192",
  "url": "https://www.justarsenal.com/could-caldentey-kafaji-be-arsenal-womens-secret-weapons-in-uwcl-knockout-rounds/375059",
  "title": "Could Caldentey & Kafaji be Arsenal Women secret weapons in UWCL knockout rounds ? ",
  "date": "20240904T140000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal Women must compete in the Round 1 and Round 2 Champions League to qualify for a chance in the 2024-25 UEFA Women’s Champions League group stages, after finishing third in the WSL last season. Last season, our Gunner women were eliminated in the round one qualifiers by Paris FC. So one could wonder how different they are now from the team that failed to advance past the Round 1 qualifiers last season.\nWell, this time around, most Gunner women stars enjoyed a decent summer break and were available for preseason. And if that wasn’t enough, Eidevall has hinted at the secret weapon he’ll be bringing to these qualifiers.\nThe Arsenal boss was asked ahead of the game if new additions Mariona Caldentey and Rosa Kafaji’s Champions League experience will help them in these qualifiers. He responded: “The Champions League experience is an important part, the European experience is different to the domestic games. It is knockout football, nights under the lights and it’s a special feeling. You are coming up against opponents that might do different things to what you are used to. We have a lot of players who have performed well in the Champions League. Then it is really exciting to get a player like Mariona who has so many good experiences from what Barcelona have been doing that we can learn from as a team. Rosa comes with her whole football career in front of her and all that excitement and belief that that brings, there are things we can learn from that.”\nKafaji broke into the season last year, putting on impressive performances in the UWCL against Real Madrid. Many big European clubs wanted to sign her this summer, but Arsenal did, and she’s been a revelation thus far.\nMariona Caldentey, for her part, has won the Champions League with Barcelona Femeni for the past two seasons, so she knows a thing or two about winning Europe’s top prize. Arsenal Women have two prominent players, in Kafaji and Caldentey, who could be their hidden secret weapon against Rangers.\nWhat do you think?\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 380,
  "scraped_at": "2026-02-14T02:17:48.913667",
  "_text_extracted": true
}