{
  "article_id": "edae023a14e8",
  "url": "http://europe.chinadaily.com.cn/a/202402/02/WS65bc52c2a3104efcbdae94f6.html",
  "title": "Liverpool threaten knockout blow to Arsenal Premier League title challenge",
  "date": "20240202T044500Z",
  "domain": "europe.chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool threaten knockout blow to Arsenal's Premier League title challenge\nLIVERPOOL - Arsenal must stop a Liverpool juggernaut, inspired by the impending departure of Jurgen Klopp, if the Gunners are to maintain Premier League title aspirations at the Emirates on Sunday.\nLiverpool restored a five-point lead over Arsenal and Manchester City, who have a game in hand, with a dominant 4-1 destruction of Chelsea on Wednesday despite missing Mohamed Salah due to injury.\nThe Egyptian will again be absent, but Klopp's men have shown no sign of missing their top goalscorer since he departed to represent his country at the Africa Cup of Nations.\nDiogo Jota opened the scoring against Chelsea to take his tally to four in the last four games.\nDarwin Nunez did everything but score in midweek as the Uruguayan set a record as the first Premier League player to hit the woodwork four times in one match but he teed up Luis Diaz to round off a night to savour for the home fans at Anfield.\nKlopp is determined that the news of his exit at the end of the season does not become a distraction as Liverpool remain in the hunt for trophies in four competitions.\nSo far it appears the Reds are inspired to send their boss out on a high and Klopp is blessed with a wealth of options thanks to a combination of rising stars and returning veterans.\nTrent Alexander-Arnold and Andy Robertson made their comebacks off the bench against Chelsea, but the former has a huge challenge to get back into the team after Conor Bradley's man-of-the-match performance.\nThe Northern Irishman scored his first Liverpool goal and provided two assists from right-back against Chelsea.\n\"It is a joy to watch him,\" said Klopp of the 20-year-old. \"The academy is doing an incredible job.\"\nArsenal's cup exit rounded off a run of three consecutive defeats around the turn of the year that has severely damaged their quest for a first league title in 20 years.\nMikel Arteta's men have steadied the ship with back-to-back victories over Crystal Palace and Nottingham Forest.\nBut defeat could realistically end Arsenal's title challenge should they fall eight points behind a relentless Liverpool.\nRicharlison's return threatens Everton\nAcross Merseyside, the outlook is not so bright, as Everton dropped into the bottom three in midweek.\nThe Toffees are feeling the effect of a 10-point deduction for breaches of the Premier League's financial rules and could yet face further sanctions for overstepping spending restrictions again last season.\nEverton's appeal against the points penalty was heard this week with a verdict expected by the middle of February.\nBut they desperately need to get back to winning on the pitch after a five-game run without victory in the Premier League.\nTottenham travel to Goodison on Saturday fresh from moving into the top four thanks to a 3-2 victory over Brentford.\nIn the absence of Son Heung-min, who is leading South Korea's bid for Asian Cup glory, a familiar face poses the biggest threat to Everton.\nAfter a difficult start to his Spurs career, Richarlison has scored seven times in his last seven Premier League games.\nMan Utd eye Champions League charge\nManchester United's dramatic 4-3 win at Wolves on Thursday cut the gap to the top five to eight points.\nThere could be a fifth place in next season's Champions League depending on how English sides perform for the rest of this season in European competition.\nUnited remain in the race with Aston Villa faltering and with a trip to come to Villa Park next weekend.\nFirst up, there is the chance for Erik ten Hag's men to move into the top six when West Ham visit Old Trafford on Sunday.\nUnited produced perhaps their best 45 minutes of the season in the first half at Molineux in midweek and will hope the return of Luke Shaw, Lisandro Martinez and Casemiro from injury will result in a strong end to the season.\nAFP\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 731,
  "scraped_at": "2026-02-14T02:07:39.558381",
  "_text_extracted": true
}