{
  "article_id": "eddc543a7185",
  "url": "https://www.uefa.com/insideuefa/news/0282-182b13f32ee5-897d0ec22895-1000--pride-of-a-nation/",
  "title": "First - timers become pride of their nations | Inside UEFA",
  "date": "20230603T200000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "First-timers become pride of their nations\nSaturday, June 3, 2023\nArticle summary\nThis season, three teams represented countries that had never before featured in a UEFA club competition group stage. Here, players, coaches and fans celebrate the all-embracing nature of the Europa Conference League.\nArticle top media content\nArticle body\n\"Living the dream.\" That was how it felt to watch Žalgiris in this season’s Europa Conference League according to Jokūbas Plytnikas, who’s a stalwart fan of the first team from Lithuania to reach the group stage of a UEFA club competition.\nThe second edition of the Europa Conference League has carried on the inclusive spirit of the first, giving more teams from more countries the chance to compete in the high-stakes environment of a continental group stage. So it was that Žalgiris broke new ground for Lithuanian football, a feat matched by Vaduz of Liechtenstein and Kosovan outfit Ballkani. They all lined up alongside the likes of Villarreal, Fiorentina and West Ham when the competition kicked off.\nSeizing the moment\n\"I’d dreamt of this ever since childhood,\" says Plytnikas as he recalls Žalgiris’s opening game, a noteworthy 0-0 draw away to Slovan Bratislava. \"There were people flying in from different continents just to be there. In total there were more than 100 people supporting Žalgiris at that first away game. When we all gathered at the stadium and saw how many people there were, most of us just started laughing because this was us living the dream.\"\nPlytnikas attended all six matches. And although the Lithuanian champions finished bottom of their section, they more than held their own: they beat Pyunik at home and battled back from 2-0 down to draw 2-2 away to Swiss giants Basel. \"The recurring theme throughout those games was joy,\" he says. \"We were just seizing the moment. Whatever happened on the pitch, we were super happy we’d got the chance to be there and be the first club from the country to break that barrier. We were so proud of our club.\"\nIt was a similar story for their fellow newcomers. Kosovan title holders Ballkani also recorded a famous victory during their maiden campaign: a rollercoaster 4-3 triumph at Sivasspor in which they trailed 1-0, led 3-1 and were then pegged back to 3-3 in added time, only to dig deep and conjure a last-gasp winner. \"To be honest, I couldn’t believe it,\" says fan club chief Edon Kabashi. \"It was a very emotional game with a lot of adrenaline. For me, it was the best game Ballkani have played in Europe.\"\nSuch performances underline the rationale of the Europa Conference League, boosting local pride in towns, regions and nations that previously felt estranged from European football – and sending a positive message to other less-heralded teams. \"It’s had a really good influence,\" says Kabashi. \"Ballkani are now known for representing Kosovo in the best way possible. For the city of Suhareka, it has been a great achievement. We’d never had this opportunity; it’s a great feeling of satisfaction.\"\nThe view from within the clubs\nThat same feeling was shared within the clubs as well. \"A first-time qualification is a memorable event,\" says Žalgiris coach Vladimir Cheburin. \"Moreover, this coincided with the club’s 75th anniversary. We can say it was a present for the club and the supporters. It’s very important, it really is. In order to move forward, we needed to achieve something first. Many people didn’t believe in us because we’d been on the verge of qualifying for a group stage on many occasions but couldn’t cross that bridge. But this has now happened, and the most important thing is that we did it.\"\nFor the players too, making that major step up to another level felt like the start of something special – and vindication for all the years of hard work. \"The success shows that you’re never too old to dream and you can always set new goals,\" says Vaduz midfielder Nicolas Hasler, who finally graced a UEFA competition group stage at the age of 31, after five frustrating seasons of falling short in Europa League qualifying. \"There are always things you can do better and that’s why we’re athletes: to be successful.\"\nTo give proper context to Vaduz’s landmark feat, the club from Liechtenstein actually compete in the Swiss league pyramid because their tiny home nation does not have a league system of its own. They earned their qualifying berth by winning the Liechtenstein Cup, though they still had to defeat teams including Konyaspor and Rapid Wien to book their place in the group stage.\n\"I get goosebumps if I just think about that night in Konya against Konyaspor, and especially that last game against Rapid Wien,\" says Hasler. \"The little people have arrived from Liechtenstein: that’s how they referred to us. It just made it even better that we actually did it.\"\nŽalgiris also faced a tough road to the competition proper, effectively booking their place by dispatching European regulars Malmö in Champions League qualifying. \"We made it to the group stage as champions and we played against champions to get there,\" says club chair Vilma Venslovaitienė. \"It’s a unique feeling and a unique achievement, especially bearing in mind our budget.\"\nOff-pitch gains\nOf course, the list of rewards for reaching the Europa Conference League also includes a financial component, further bolstering the competition’s positive impact on smaller clubs. All 32 group stage sides received €2.94m as a starting fee, with bonuses of €500,000 per win and €166,000 per draw up for grabs as well – a significant boon for all involved. Indeed, along with Žalgiris, Ballkani and Vaduz, six more clubs made their debut in a European group stage this season: Djurgården, Dnipro-1, Pyunik, RFS, Silkeborg and Slovácko.\nFor Žalgiris fan Plytnikas, these bonuses may mean less than the thrill of the action, but they help to safeguard the future of the club. \"I was a supporter when we dropped into the second division,\" he says. \"At that point there was no money. Players were playing for free and we were collecting money ourselves, donating it to keep the club going. That was back in 2009, so not that long ago.\n\"Just to think: in the space of 14 years we’ve gone from being on the brink of no longer existing to writing history. And I’m hoping that next season we’ll either play in the group stage again or, fingers crossed, maybe go even further. One can dream, right?\"\nOfficial programme available now\nThe official final programme for the 2023 Europa Conference League has landed. As the much-awaited final between Fiorentina and West Ham United draws nearer, you can get stuck into a bundle of football storytelling containing everything from history, culture and food, to tactical analysis, captivating imagery as well as player and coach interviews. Click here for access.",
  "word_count": 1143,
  "scraped_at": "2026-02-14T02:09:58.138455",
  "_text_extracted": true
}