{
  "article_id": "ededf29148ce",
  "url": "https://www.myjoyonline.com/an-honour-to-face-ronaldo-says-mbappe/",
  "title": "  An honour  to face Ronaldo , says Mbappe",
  "date": "20240704T223000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nKylian Mbappe says it is \"an honour\" to play against Cristiano Ronaldo as France prepare to take on Portugal in their Euro 2024 quarter-final.\nFrenchman Mbappe, 25, signed for Real Madrid this summer - a club where Ronaldo won four successive Champions League titles.\nThe two will go head-to-head in Hamburg on Friday (kick-off 20:00 BST) and Mbappe describes it as \"a pleasure\" to face Portugal's five-time Ballon d'Or winner.\n\"It's the admiration I've always had for Cristiano, for the player. Over time, I've had the chance to get to know him and talk to him many times. We're still in touch,\" said Mbappe.\n\"He's always trying to give me advice and keep up to date with what's going on. Playing against him is an honour for everything he's done in football.\n\"No matter what happened before or what happens after, he'll always be a legend of the game. But of course we hope to win and reach the semi-finals.\"\nRonaldo, 39, said this week it would be his last Euros so this showdown with Mbappe is being described as a \"handover\" between two great players.\nBut Mbappe says the Portugal legend is \"unique\" and he will follow his own path when he begins his stint with Madrid.\n\"There will only be one [Ronaldo] I was lucky enough to have the opportunity to start living my dream as a player in Madrid,\" he added.\n\"I hope I'll write a great story there, but I'm certainly not going there to write the rest of Cristiano's story. What he did in Madrid is unique.\n\"You have to appreciate what he has been, what he is. I've never been an envious person, so I just want to admire the greatness of the player.\n\"He left his mark on the history of football. He inspired generations. He has scored many goals and won many titles. So his CV speaks for itself.\"\n'It's not about Mbappe v Ronaldo'\nManchester City and Portugal midfielder Bernardo Silva played with Mbappe at Monaco and said he always \"stood out from the crowd\".\n\"Kylian is a wonderful player and started with us at AS Monaco when he was 16. I remember after his first week we would say 'who's this kid?'\" added Silva.\n\"I am so delighted for him that he was able to have a wonderful career. I wish him the best but not [against us] obviously. I want us to qualify.\"\nBut Silva would not be drawn on comparisons between Mbappe and Ronaldo.\n\"It's not about Kylian and Cristiano – it's about Portugal and France. They are both two unbelievable players,\" said Silva.\n\"Cristiano is one of the best to ever play the game. Kylian is still going through the beginning or middle of his career. But it's not about them. As Portugal, we want to go through and qualify for the semi-finals.\"\nPortugal boss Roberto Martinez has faced criticism for his team selection and their performance so far in the tournament.\nThey needed extra time and a penalty shootout to overcome Slovenia in their last-16 tie on Monday.\n\"Criticism is part of the job description. Criticism shows how passionate people are about the national team and I accept that,\" said Martinez.\n\"I believe we have very important players and a very competitive dressing room. I see them every day in training so can make decisions.\n\"In the qualifying campaign we won 10 matches and I was criticised. I'm not focused on myself. My job is to help our players perform as best we can and that's what I promise all fans.\"\nWhere can I watch Portugal v France?\nThis match is being shown live on BBC One and BBC iPlayer from 19:20 BST on Friday evening.\nThere is live commentary on BBC Radio 5 Live with build-up from Kelly Cates kicking off at 19:30 BST.\nYou can also follow live text coverage on the BBC Sport website and app.\nTeam news\nThere are no injury concerns for Portugal but after a gruelling 120 minutes against Slovenia, there could be rotation.\nFrance midfielder Adrien Rabiot is suspended after picking up a second booking in their 1-0 win over Belgium.\nThat means there could be starts for Ousmane Dembele or Eduardo Camavinga, while Kingsley Coman left camp for the birth of his child earlier this week.\nBest of the stats\n- France have only lost one of their past 14 games against Portugal (W11, D2), although that defeat came in the Euro 2016 final at the Stade de France (0-1).\n- This will be Portugal's seventh appearance in the quarter-finals of the Euros - the most of any side since the round was introduced in 1996.\n- France are looking to reach the semi-finals for the fourth time in the past five major tournaments.\n- France have failed to score a goal from open play in their past five matches, with their three goals at Euro 2024 coming from two own goals and a penalty by Mbappe.\n- Portugal have failed to score in their past two matches. They've never failed to score in three consecutive games at a major tournament.\n- Having scored 10 goals in nine major tournament games between 2018 and 2022, Portugal's Ronaldo has now failed to score in his past eight appearances at the World Cup/Euros.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n6 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n31 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n33 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 1110,
  "scraped_at": "2026-02-14T02:08:01.884735",
  "_text_extracted": true
}