{
  "article_id": "edf4de132af2",
  "url": "https://www.caughtoffside.com/2024/10/24/simone-inzaghi-erik-ten-hag-man-united/",
  "title": "Simone Inzaghi is ready to replace Erik ten Hag at Man United",
  "date": "20241024T064500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to InterLive, Inter Milan manager Simone Inzaghi has given his approval to become the new manager of Manchester United.\nAs per the report, the Premier League giants have decided to part ways with Erik ten Hag at the end of the season.\nThe Red Devils have realised that their progress under Ten Hag has stalled and they are looking for another manager to take them back to the top of English football.\nMan United are currently 12th in the league and they have made a disastrous start to the new season.\nEven in the Europa League, they have failed to win both their matches, showing that the Dutch manager has failed to improve the level of the team despite being backed heavily with new signings in the summer.\nThe report has mentioned that Inzaghi has been contacted by Man United and the manager has had the opportunity to talk to the club chiefs over video conferences and he has been offered an unlimited budget to revamp the squad in the next summer transfer window.\nThe Italian manager has proved himself as one of the best managers in the game right now.\nHe has guided Inter Milan to a league title win and also took them to the Champions League final where they lost against Pep Guardiola’s Manchester City.\nA three year deal has been offered to Inzaghi who is ready to take charge of Man United next season.\nThe latest win against Brentford might have saved Ten Hag’s job at the club till the end of the season.\nMan United have already made a decision on Erik ten Hag\nClub hierarchy have decided to keep the former Ajax manager at the club but it is getting clear that he does not have a long term future at Old Trafford.\nInzaghi plays a style of football that is attractive but also produces result, something the Red Devils have lacked under the leadership of Ten Hag.\nThe Italian tactician has made players like Lautaro Martinez and Nicolo Barella world class, showing that he can improve the level of the players at Man United.\nFormer Barcelona manager Xavi has also been linked with Man United with the Red Devils looking to make a change at the club while Italian manager Vincenzo Montella is another name connected with the Old Trafford job.\nTen Hag’s team will come up against former manager Jose Mourinho’s Fenerbahce side in the Europa League today and they are desperate for a win in the competition.",
  "word_count": 417,
  "scraped_at": "2026-02-14T01:57:46.242329",
  "_text_extracted": true
}