{
  "article_id": "edfa9e08f415",
  "url": "https://metro.co.uk/2024/10/28/rio-ferdinand-slams-man-utd-not-hiring-thomas-tuchel-chance-21879034/",
  "title": "Rio Ferdinand slams Man Utd for not hiring Thomas Tuchel when they had chance | Football",
  "date": "20241028T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Roy Keane has sent a stern warning to Manchester United’s players in the wake of Erik ten Hag’s sacking on Monday.\nTen Hag was sent packing on Monday less than 24 hours after the 2-1 defeat at West Ham which has left the club 14th in the Premier League.\nIt brings to an end the Dutchman’s reign at Old Trafford after just two-and-a-half years but that’s still longer than some expected given that he was close to losing his job over the summer.\nDespite a worst-ever finish in the Premier League last season, United ultimately stuck with Ten Hag after he masterminded an FA Cup final win over rivals Manchester City.\nHowever, new minority owners INEOS have now pulled the plug on Ten Hag’s time at the club, with Ruud van Nistelrooy set to take charge on an interim basis.\nThe club will hope that Van Nistelrooy can spark an immediate uptick in performances, but Keane has insisted that the players must also take the time to hold themselves accountable for their part in the poor start to the season.\nPosting a selfie on Instagram, the former United captain wrote: ‘In good teams, coaches hold players accountable. In great teams, players hold players accountable.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRio Ferdinand, meanwhile, has questioned whether the club will now be regretting their decision to not hire Thomas Tuchel in the summer.\nThe German had been heavily linked with the Red Devils before the FA Cup final having just left Bayern Munich and was keen on a return to English football.\nThe former Chelsea boss remained linked with Old Trafford up until just two weeks ago when he was announced as the new England manager, replacing Gareth Southgate.\nReflecting on Ten Hag’s departure on Monday, Ferdinand thinks his former club should have acted sooner to land the ideal replacement for Ten Hag.\n‘My big thing is it’s taken so long,’ he said on his YouTube channel. ‘One of the best candidates that was sitting out there was Thomas Tuchel and he’s gone now, he’s become England manager.\n‘England fans will be delighted with that but I think Man United will be looking at that and saying “Is that one that got away?”.’\nVan Nistelrooy, given a chance to impress as interim boss, is the early favourite to succeed Ten Hag on a full-time basis, with the likes of Thomas Frank, Gareth Southgate, Julian Nagelsmann and Sporting boss Ruben Amorim also contenders.\nFerdinand is backing former teammate Van Nistelrooy to do well but says he could also see former Barcelona boss Xavi at Old Trafford.\nMore Trending\n‘I’d probably give it to Ruud right now. He’s in the hot seat,’ he added.\n‘He’s seen the place, like I say, it’s not going to be a big upheaval in terms of knowing and getting to know the players. He knows them all right now.\n‘But Xavi, if we could get someone like him. Playing football the way Barcelona did with that aggressive football.\n‘He won the league when he was at Barca, introducing young players into the team. He brought through Lamine Yamal. That’s what Man United’s DNA is about.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Xavi stance on becoming Manchester United manager revealed after Erik ten Hag exit\nMORE: Gareth Southgate has made his plans clear amid Manchester United links\nMORE: Erik ten Hag’s worst Man Utd signings and how much he spent at Old Trafford",
  "word_count": 639,
  "scraped_at": "2026-02-14T02:14:47.093446",
  "_text_extracted": true
}