{
  "article_id": "ee47dd1de271",
  "url": "https://www.twtd.co.uk/ipswich-town-news/49142/palmer-its-not-about-revenge",
  "title": "Palmer : It Not About Revenge - Ipswich Town News",
  "date": "20250315T071500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 15th Mar 2025 06:00 by Kallum Brisset\nTown goalkeeper Alex Palmer does not feel the Blues’ FA Cup exit to Nottingham Forest a fortnight ago will have any bearing on this weekend’s Premier League clash at Portman Road.\nPenalty kicks decided the fate of Town’s journey in the FA Cup earlier this month when the Reds won a shootout to knock the Blues out at the fifth round stage at the City Ground.\nThe two sides will do battle once more with three league points on offer for the winner which will go a long way to deciding the outcome of each team’s differing seasons.\nTown are six points away from safety with just 10 matches remaining, while Forest are currently third and have their eyes firmly set on a place in next season’s UEFA Champions League.\n“I don’t think it’s revenge,” Palmer said. “This part of the season especially, we’ve got to pick up results and that’s it.\n“So every game we’re going into we’re looking to pick up a positive result so we can build on and hopefully our fortunes can change.\n“We’ll go into it the same as we’ve done every other game, with a game plan and try and perform as well as we can. That’s all we can really do to affect the result.\n“I got close to a few but it shows that they were pretty good penalties, I was doing my best.”\nThe form of one-time Blues loanee Chris Wood has played a key role in Forest’s success this season, contributing 18 goals in the Premier League this season, including the winner in Town’s defeat at the City Ground in November.\nPalmer says the goalkeeping unit prepares for all scenarios, but understands the threats that the New Zealand international may pose.\nHe said: “This is the level that we’re at now where you’ve got so much technology and footage of opposition where that’s part and parcel of the game. You look at the opposition, the individuals and what they might offer or occasionally do.\n“You’ve got to take that into consideration but then again it’s a game of football and anything can happen. You’ve got to be ready for what their strengths are but ultimately as a goalkeeper you’ve got to be ready for the unexpected.\n“Definitely there are things that go into that and you look at opposition players sometimes a little bit more than others.”\nPalmer and his Blues teammates are fully aware the form has to improve if they are to have any chance of survival having lost seven of their last eight matches and are the only Premier League side yet to win in 2025.\nBut the goalkeeper maintains the belief that the task is possible, highlighting the togetherness of the squad as one of the factors.\n“It’s massive for us, the club and the fanbase,” he said on the run-in. “We’re doing everything we can to go into every game and get a positive result.\n“The position we’re in is tough but it helps that we’ve got the team spirit here to do so.\n“It’s hugely important. Keeping a lot of lads that have had the success through the leagues has been pivotal, you can see there’s a close bond and really close relationships and that helps when it’s tough on the pitch.\n“When you’re coming in after a tough result it helps to have that friendship and that bond to roll our sleeves up and dig in together. You can see that on the pitch that we’re not rolling over lightly, we’re trying to get results.\n“You’ve seen in the last few weeks have been close games and we’re in it but that’s how the Premier League is, it’s ruthless. Hopefully we can be on the right side of the result this weekend.\n“We’re getting closer to [a first clean sheet]. In the Palace game we were 10 minutes out and I think it would have been a deserved clean sheet and fair result, if I’m honest.\n“But the Premier League is ruthless, we’ve got to earn it and be deserving of it. Hopefully we can improve on that, get a clean sheet and have something to build on.”\nPalmer’s performance levels since his deadline day arrival from West Bromwich Albion may make it easy to forget he is still in his first few weeks at top flight level.\nHaving played every minute in all competitions since signing, the Blues’ newest recruit is enjoying the change to being a Premier League footballer for the first time.\nHe said: “It’s been a bit of a whirlwind. The lads, the gaffer and having a few lads who I know here has helped me settle a lot quicker.\n“Being thrown in so quickly as well helps, the lads get to see what you’re about. It’s all well and good being in training but when you get stuck into the games they can properly see what you’re about so it helps.\n“I’ve really enjoyed the day to day training environment. The camaraderie between the lads is all good, you can see why they’ve been so successful in the last few years. I’ve really enjoyed my time here.”\nAsked to compare it to life as a Championship player, he added: “It’s just how ruthless it is, it’s that sharpness of the opposition.\n“It’s the defence as well as in how athletic they are, you look at a lot of the backline for the opposition teams and they’re all 6’3”, built really well, quick and strong. That is one of the differences and teams are hard to break down.\n“But apart from that and the sharpness, I try and keep it as a football game and try not to overthink it or complicate it too much.”\nMaking it easier to adjust is having former Baggies teammates Dara O’Shea and Conor Townsend in the building, two players who Palmer says he is close to.\nHe said: “I came through the youth set-up at under-18 and under-21 with Dara so I’ve known him for a while and have got a really good relationship with him.\n“Conor I’ve spent a number of years with at West Brom and lived fairly locally to each other.\n“It’s good to have that kind of friendship to come into and it helps you integrate into the group, they’ve been great to have here.”\nO’Shea recently claimed Palmer ‘talks too much’ with the goalkeeper clearly known for his bubbly personality.\n“You can’t really win either way can you,” Palmer joked. “You’re coming here trying to get to know people then he gets like that.\n“Whether he’s on about on the pitch or off the pitch, he’s probably on about both. But that’s my job and my personality, I like to get to know people and have conversations.\n“Even more so on the pitch, I probably talk his ear off which they all want a need a goalkeeper like that. That’s one of my strengths is to do that and it keeps me in the game and keeps me concentrated.”\nAlongside Palmer, the Blues’ goalkeeping group included the recently fit again Christian Walton, Kosovo international Aro Muric and Scotland international call-up Cieran Slicker.\nOn the options between the sticks, Palmer said: “It’s a really strong department with Christian, Aro and even Slicks as well. We’ve got a good relationship, the goalie coaches push us and it’s very challenging and that’s how you want it to be.”\nPalmer has always been quick to heap praise on his family who have played a key role in his progression to where he is today, nobody more so than his mum Lisa.\n“I appreciate massively for what they did,” the 28-year-old said. “It’s probably all over the world that parents have had to do that so they’re probably not alone.\n“It was a great upbringing that I had, I had brothers and sisters that I could go outside and play with. They put in a lot of effort and hours to be able to get me to training and matches, ultimately it’s ended up getting me this far.”\nPalmer’s brother Tom is also a goalkeeper and has had a similar journey, albeit without ending up at the level of Alex.\nPalmer added: “He’s playing for Kidderminster Harriers, he’s the second-choice and goalkeeper coach there. He’s only 26 and he’s really enjoying his role there at the moment.\n“Unfortunately I don’t get to see him too much because they’ve got a lot of games and so do I. I speak to him on a regular basis, he’s really enjoying his role down there.\n“We both started off as outfielders wanting to play in goal but never getting the opportunity. Then eventually getting the opportunity and all of a sudden you’re playing in these massive 11-a-side goals at the age of 11 and 12 and everything’s going in.\n“It’s tough for young kids now to enjoy goalkeeping at such a young age because of those aspects, the goals are sometimes too big and that’s just how it is.\n“We both had a stint where we were both playing in goal and outfield, then eventually we decided we wanted to stick with goalkeeping.\n“Growing up we were playing everything - cricket, tennis, rugby, you name it. That’s a childhood that you want to have, that’s why I encourage any kid to have a childhood where they’re playing multiple sports because it’s only going to benefit you.”\nPalmer’s brother-in-law James Fry also comes with a footballing background, playing his senior football in non-league, also with Kidderminster for a spell, as well as the likes of Tamworth, Stratford Town and Leamington, and has also since entered coaching.\nPalmer said: “He was a no-nonsense centre-half. I don’t think he’d like me saying that, he could play as well.\n“He’s currently in the coaching aspect as well but he went through the Blues [Birmingham City] academy.”\nTWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nGood luck today\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1688,
  "scraped_at": "2026-02-14T02:11:32.326709",
  "_text_extracted": true
}