{
  "article_id": "ee4a7645c7f2",
  "url": "https://www.ocregister.com/2023/12/12/lafcs-giorgio-chiellini-retiring-after-22-year-career/",
  "title": "LAFC Giorgio Chiellini retiring after 22 - year career – Orange County Register",
  "date": "20231212T210000Z",
  "domain": "ocregister.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Giorgio Chiellini, considered by many to be the best defender of his generation, announced his retirement from professional soccer Tuesday.\nThe decision closed a decorated and respected 22-year career during which the center back won 27 titles for club and country.\n“You have been the most beautiful and intense journey of my life,” Chiellini, 39, wrote on social media. “You have been my everything. With you, I have traveled a unique and unforgettable path. But now it is time to start new chapters, face new challenges and write further important and exciting pages of life.”\nDuring his last competitive chapter with the Los Angeles Football Club, which began in June last year, Chiellini added an MLS Cup and Supporters’ Shield to his long list of honors.\nChiellini also finished runner-up three times in 2023, falling short in the CONCACAF Champions League, Campeones Cup and Saturday’s 2-1 MLS Cup loss to the Columbus Crew, dashing LAFC’s hopes of repeating as league champions.\nChiellini declared afterward that it was better to lose in a final than not make one even if it meant the “fantastic journey would remain in your heart, not in a history book.”\nMaking a habit of winning for Juventus, the Italian club with which the defender spent nearly 18 years, Chiellini won nine consecutive Serie A titles from 2011-2020, adding five Italian Cups and Super Cups as well. He was named Serie A defender of the year three times,\nPlaying 117 times for Italy, most recently leading the Azzurri to the 2020 European Championship as Defender of the Tournament, Chiellini, born in Pisa, became an icon for his country, appearing at the 2010 and 2014 FIFA World Cup competitions.\nJoining LAFC midway through the 2022 season, he made both an immediate and lasting impression.\n“We’ll never have another player like Giorgio,” LAFC co-president and general manager John Thorrington said Saturday in Ohio.\nChiellini secured 45 appearances across all competitions for LAFC, scoring one goal and adding an assist, but it was his defensive prowess that mattered most on the field with 18 shutouts for the Black & Gold.\nChiellini arrived in Los Angeles to play. Just as importantly, he said, he wanted to experience American-style sports on and off the field, taking time to learn how business is conducted to see if he could bring lessons back to Italy when the time was right.\nIn a statement provided by the club, Thorrington added, “Giorgio exceeded the incredibly high expectations we had for him both on and off the field. His leadership, professionalism, and character will leave a lasting legacy at LAFC, and we trust that our relationship with Giorgio will continue.”\nHis departure was among a bevy of roster moves revealed by LAFC on Tues.\nThe club exercised contract options on Chiellini’s center back partner Jesús Murillo, midfielders Ilie Sánchez and Erik Dueñas, and goalkeeper Abraham Romero.\nLAFC declined options for midfielders Christian Torres and Danny Crisostomo; defenders Julian Gaines, Tony Leone, Mohamed Traore, Denil Maldonado and Diego Rosales; and goalkeepers John McCarthy and Eldin Jakupovic.\nJakupovic, Cristosomo and Maldonado, the Honduran center back who arrived on a loan at the start of the 2023 season and played significant minutes, are eligible for the MLS re-entry draft process.\nMcCarthy, the 2022 MLS Cup most valuable player, is a free agent.\nLAFC, in a statement announcing the roster decisions, affirmed it is in talks to retain free agents including longtime captain Carlos Vela, talented fullback Diego Palacios, American international Kellyn Acosta, Canadian goalkeeper Maxime Crépeau, as well as McCarthy, Maldonado, Gaines, Leone and Rosales.\nEighteen players are currently under contract for 2024.\nDefenders include Mamadou Fall, who is on loan to FC Barcelona, Ryan Hollingshead, Aaron Long, Sergi Palencia, Eddie Segura and Murillo.\nContracted midfielders are Mateusz Bogusz, Filip Krastev, Francisco Ginella (currently on loan to Uruguay’s Club Nacional), Timothy Tillman and Sanchez.\nLAFC’s attackers feature Dénis Bouanga, Cristian Olivera, Stipe Biuk, Mario Gonzalez and Nathan Ordaz.Following a three-month roster freeze, the MLS trade window opened Monday.\nThe league will announce players available for the waiver process on Tues. Eligible players include those whose options are not exercised, who are not subject to first right of refusal, and who are not eligible for free agency or the re-entry draft.\nFree agency for out-of-contract players 24 years old and above with five years of service in the league commences on Wednesday, at 10 a.m. PT.",
  "word_count": 735,
  "scraped_at": "2026-02-14T01:51:13.784971",
  "_text_extracted": true
}