{
  "article_id": "ee7a48ba6a1e",
  "url": "https://metro.co.uk/2026/01/11/joe-cole-says-chelsea-made-stunning-transfer-bid-liverpool-star-26221740/",
  "title": "Joe Cole says Chelsea should have made stunning transfer bid for Liverpool star",
  "date": "20260111T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Joe Cole believes Chelsea missed a trick by not trying to sign Virgil van Dijk last season before he agreed a contract extension at Liverpool.\nVan Dijk has been virtually an ever-present figure at the heart of the Reds’ defence since joining from Southampton in January 2018,\nThe Dutchman, now captain of the side, has helped Liverpool win two Premier League titles and the Champions League during his time on Merseyside.\nAs Arne Slot’s side cruised to the league title last season, there were doubts over Van Dijk’s long-term future at the club, with his contract set to expire in the summer of 2025.\nBut Van Dijk ended that speculation by eventually agreeing a new two-year extension to his deal prior to the end of the season.\nThe 34-year-old never appeared to truly entertain the possibility of leaving Liverpool, but Cole believes that Chelsea should have tested the waters with a bid last season to try and lure the experienced defender to Stamford Bridge.\nAsked who he would sign for the Blues this January, Cole told Paddy Power: ‘I would have gone down the road of going really big for Virgil van Dijk when he was coming to the end of his contract at Liverpool last summer.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘You need seasoned winners in the side.’\nCole added: ‘I’d be looking at the PSG squad, which I think is bloated. Players who understand winning and know how and what it means to win.\n‘I don’t think Arsenal are going to be able to keep up with all their players, certain players there will be available at the end of the season.\n‘Unfortunately, none of the top, top players are going to be coming to Chelsea, because if they’re available, then the Man City’s, the Arsenal’s and the Liverpool’s will come calling and they will go there first.\n‘So Chelsea are still in their rebuilding phase.’\nThe latest chapter in Chelsea’s rebuild has come in the appointment of Liam Rosenior, the former Strasbourg head coach arriving to replace Enzo Maresca following his sacking on New Year’s Day.\nThe Englishman got underway with an emphatic 5-1 win over Charlton Athletic in the FA Cup, but Cole believes Chelsea fans should not expect miracles overnight from their new head coach.\n‘He needs time, that’s the crucial thing,’ he added. ‘There’s no magic wand to get things going straight away.\n‘There’s good players at Chelsea and we’ve seen they’re capable of beating anyone. Performances against Barcelona and Arsenal where they were down to 10 men and they were superb.\nMore Trending\n‘You’ve got the two semi-finals against Arsenal in that [seven games], plus some other London derbies in there [Brentford, Crystal Palace and West Ham].\n‘The expectations are massive but the Fulham loss was a real killer blow because it’s put Chelsea down to 7th or 8th, the league is so tight.\n‘I said it from the start of the season, Champions League football is the target, so they need to get results and you need to give Liam time.’\nChelsea are back in action on Wednesday when they host Arsenal in the first leg of their Carabao Cup semi-final.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal and Man Utd’s £87m target says he ‘dreams’ of playing for Liverpool\nMORE: Kobbie Mainoo’s surprise stance on Manchester United future after Ruben Amorim sacking",
  "word_count": 626,
  "scraped_at": "2026-02-14T02:09:43.013773",
  "_text_extracted": true
}