{
  "article_id": "ee8189336fe3",
  "url": "https://www.kyivpost.com/post/18197",
  "title": "Serhiy Rebrov Takes Charge of Ukraine National Football Team",
  "date": "20230612T174500Z",
  "domain": "kyivpost.com",
  "source_country": "Ukraine",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After considerable anticipation and speculation, the Ukrainian Football Association (UAF), finally announced Serhiy Rebrov as the new manager of the national football team on June 7. Tonight, Monday, June 12, he faces his first test in his new position when Ukraine meet Germany in a friendly match in Bremen.\nSince Andriy Shevchenko departed in 2021, Rebrov has been the UAF and the fans first choice to take over as coach. With an impressive track record as a player and a coach, Rebrov is poised to lead Ukraine to new heights, giving hope to Ukrainian football fans when they need it most in these trying times.\nJOIN US ON TELEGRAM\nFollow our coverage of the war on the @Kyivpost_official.\nSerhiy Rebrov, renowned for his partnership with Andriy Shevchenko at Dynamo Kyiv in the 1990s, is a familiar name to Ukrainian football enthusiasts. The duo's attacking prowess and chemistry on the field propelled Dynamo Kyiv to domestic and European success. Rebrov's contribution to Ukrainian football history is further highlighted by his status as the all-time top scorer in the Ukrainian Premier League, alongside Maksim Shatskikh. His football career extended beyond Ukraine, with notable stints in the Premier League representing West Ham and Tottenham.\nRebrov's coaching journey began in 2014 when he assumed the role of caretaker manager at Dynamo Kyiv, during which he guided the team to two Ukrainian Premier League titles, two Ukrainian Cup titles, and one Ukrainian Super Cup. Rebrov's tenure also witnessed Dynamo Kyiv's return to the knockout stages of the UEFA Champions League after a 15-year hiatus.\nUkraine Says Russia Behind Fake Posts Targeting Winter Olympics Team\nHis other successful tenure was when he took over the Hungarian side Ferencvaros in 2018, his arrival marking the beginning of a positive transformation for the club. Under his guidance, the team reached milestones not seen in decades; they clinched three consecutive league titles, a feat last accomplished by the club between 1926 and 1928. Under Rebrov the team qualified for both the UEFA Europa League and Champions’ League group stages, from which they had been absent for 25 years, further enhancing his reputation as an outstanding coach.\nNow Serhiy Rebrov has taken on arguably his biggest challenge, signing a three-year contract to take over as the head coach of Ukraine's national team. The appointment is crucial as Ukraine tries to qualify for the upcoming European Championship. Keeping the squad focused and motivated will be crucial with the war on everyone's minds.\nRebrov is the first permanent coach since Oleksandr Petrakov's departure in January. Under Petrakov's guidance, Ukraine narrowly missed qualifying for the previous World Cup after a heartbreaking playoff defeat against Wales. In the meantime, Ruslan Rotan temporarily took charge of the team's recent 2-0 loss to England in March. Despite the challenges of being unable to play on home soil due to the Russian invasion, Rebrov's arrival injects fresh optimism and determination into the squad.\nRebrov's immediate focus is implementing a unified model for the entire national team structure, encompassing youth development and the senior squad. He aims to build a sustainable and prosperous football ecosystem in Ukraine by nurturing young talent and promoting cohesion across all levels. As Rebrov takes charge, Ukraine faces the challenge of a complex Euro 2024 qualification group. In March, they experienced a defeat in their only qualifying match under interim coach Ruslan Rotan. However, Rebrov and his new squad and staff have their first friendly match against Germany, which should feature a lot of experimentation.\nThis friendly match with Germany is a valuable opportunity for Rebrov to assess his team's strengths and identify areas that can be improved. Rebrov's tactical approach will likely remain consistent with his predecessors, featuring a lone striker, a holding midfielder, two central midfielders, two wingers, and a four-player defensive line.\nSerhiy Rebrov's appointment also holds special significance, as he becomes the fifth former international player to manage the Ukrainian national side, joining the ranks of Oleksiy Mykhaylychenko, Yuriy Kalitvintsev, Andriy Shevchenko, and Ruslan Rotan.\nThe appointment as the national team head coach has generated immense anticipation and excitement among the media and fans. There is a great sense of optimism surrounding Ukrainian football as Rebrov takes the helm. With his experience and track record, there is no doubt that the national team is in capable hands.\nRebrov has already made a strong impression during his first press conference as Ukraine's head coach, speaking in Ukrainian his opening words being to thank the Armed Forces “for their continued fight for our freedom and for allowing us to talk and play football.” It is a reminder that even in sports, Ukraine has much to fight for. With Ukrainian soldiers sitting in trenches under constant bombardment watching the national team games, represents the promise of a brighter future, where all Ukrainians can come together in peace and celebrate even the simplest joys, like the thrill of a football match.\nOnwards to glory for Ukraine, Serhiy.\nThe views expressed are the author’s and not necessarily those of Kyiv Post.\nYou can also highlight the text and press Ctrl + Enter",
  "word_count": 848,
  "scraped_at": "2026-02-14T02:24:42.720010",
  "_text_extracted": true
}