{
  "article_id": "ee8afc41502b",
  "url": "https://www.liverpoolecho.co.uk/sport/football/football-news/liverpool-transfer-news-live-matip-26134727",
  "title": "Liverpool transfer news LIVE - Joel Matip future , Roberto Firmino latest , Jude Bellingham stance",
  "date": "20230202T123000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to our latest Liverpool live blog for Thursday, as we provide you with all of the latest goings on from Anfield.\nVirgil van Dijk and Roberto Firmino have both made positive advancements in their return from injuries, with both captured outside at the AXA Training Centre on Thursday afternoon.\nThe January transfer window may be closed, but that does not stop rumours swirling over players that the Reds could sign in the summer.\nJoel Matip could make a surprise departure from Liverpool this summer according to reports on Thursday morning, the Cameroonian defender made the move to Anfield in 2016 from Bundesliga side Schalke 04.\nThe agent of Roberto Firmino has also spoken about the striker's future, with the Brazilian's current deal set to expire at the end of the season.\nElsewhere, Liverpool are continuing to be linked with a move for Jude Bellingham, and there has been an update on the future of the Borussia Dortmund midfielder.\nGet involved and send your thoughts to @LivEchoLFC.\nAnd don't forget to subscribe to our free Liverpool FC newsletter, our YouTube channel and listen to our Blood Red Podcast, with all your favourite ECHO regulars including Paul Gorst, Ian Doyle, Joe Rimmer, Sean Bradbury, Theo Squires, Richard Garnett, Mark Wakefield, Tom Cavilla, Charlotte Coates and Keifer MacDonald.\nGood news\nIt was great to see Virgil van Dijk and Roberto Firmino both posing for a picture together earlier today as they step up their recovery from injury.\nThe Liverpool pair won't be in action on Saturday against Wolves but could have an eye on the Merseyside derby on Monday, February 13.\nInjury for Real Madrid?\nReal Madrid defender Eder Militao was subbed off with a suspected injury as the La Liga champions took on Valencia.\nLiverpool take on Madrid in 19 days in the first leg of the Champions League last 16 clash and the Brazilian defender could now be a doubt for the huge encounter at Anfield.\nAs a Man United fan...\nLouis Saha is hoping to see Jude Bellingham join Man United over Liverpool in the summer.\nHe told The Games Cabin: “For a player that’s very young, he has the luxury of having interest from many, many big clubs. His heart should always go for the team he really loves, where he believes he can achieve a lot of things and where he believes he could improve. That’s up to him.\n“As a fan of Manchester United, I would obviously say that Manchester United is the ideal destination for Jude. A lot of the time, players don’t necessarily go to the clubs they love and respect the most. A lot of it is to do with the salary and what their agents are thinking, so a lot of it will depend on that.\n“The kid is so talented and he deserves to make his own choice. This season, Manchester United are so exciting and for a player like Jude, who’s got intelligence, great energy, composure and all the skills you need, then he can go anywhere he wants.”\nPaul Merson makes prediction\nPaul Merson wrote for Sportskeeda after predicting a 1-1 draw at Molineux: “Liverpool defeated Wolves comfortably in the FA Cup, but they need to get going in the Premier League.\n“They played a lot of high-pressure games last season, and it’s caught up with them. They’re paying the toll with injuries and a lack of form, and they’re in a bad space at the moment.\n“Wolves are going to make it hard for Liverpool and will try to get something out of this Premier League game. I like their manager, and I think they’ll pull off a draw this weekend.\nWho would you start?\nLiverpool need to beat Wolves on Saturday if they are to try and close the gap on the top four. They are currently 10 points behind Man United and Newcastle.\nOne change we know Jurgen Klopp will have to make is Joel Matip starting in place of the injured Ibrahima Konate - the Frenchman damaged his hamstring in the loss at Brighton on Sunday.\nYoungster Stefan Bajcetic could keep his place in midfield alongside Thiago and Naby Keita or could we see Jordan Henderson and Fabinho brought back in?\nYou'd think Darwin Nunez would come in to start in the front three also.\nNunez on his struggles\nDarwin Nunez has admitted he has struggled since arriving at Liverpool in the summer, but he looks to his idol Luis Suarez for inspiration and hopes to 'explode' soon.\nNunez still has 10 goals in 25 matches, but has missed a host of chances as Liverpool currently sit in ninth place.\nHe told Sky Sports: \"I don't think I'm playing well at the moment, but I always want to improve. I try to improve every day. Klopp knows my strength is my speed, running into space. Also, he tells me that I need to be more calm when I'm playing, and that I need to move more.\n\"Of course, it's always helpful to speak with Suarez. For me, he is an idol. He is a great example. In the national team, I now have a much better relationship with him.\n\"We are always talking and he is always giving me advice. I always try to keep in touch with him.\"\nSign N'Golo Kante?\nLiverpool have been urged to sign Chelsea midfielder N'Golo Kante as his contract is due to expire in the summer.\nLiverpool legend Steve Nicol told ESPN FC: \"If I am a coach of the best team on the planet, and he’s [Kante] available, then I want to sign him. There are certain things that you take a chance on in football, and this is one of them.\n“You know exactly what you are getting when he is fit. You know you are getting a player, a gentleman and an experienced winner. He’s the whole package. The nicest guy in the world. Fantastic in the dressing room. You are getting everything.”\nLiverpool have great Wolves record\nLiverpool take on Wolves on Saturday at Molinuex and the Reds have a fantastic record against their next opponents.\nLiverpool have won their last 11 Premier League meetings with the Midlands side and are looking to make it 12 at the weekend.\nSalah will make his 200th appearance in the Premier League this weekend and he will be desperate to help Liverpool turn their form around with a much-needed goal.\nOn this day 12 years ago\nCan you believe it's 12 years to this day when Luis Suarez came off the bench at Anfield against Stoke to score his first goal in a Liverpool shirt?\nSuarez made an instant impact since sealing a switch from Ajax and soon became a fan favourite on the Kop. Despite winning just one trophy in his time with the Reds, he will go down for many supporters as one of the best they have seen pull on a Liverpool shirt.\nCommunication difficulties\nDarwin Nunez has opened up on how he communicates with Jurgen Klopp seen as though neither speak the same language.\n\"He doesn't speak Spanish and I don't speak English, so we don't understand each other, but ever since I arrived at Liverpool, he has always given me confidence,\" Nunez told Sky Sports.\nThis is just a little indicator into the difficulties faced by Nunez after moving to England in the summer.\nLeBron x Liverpool\nLeBron James once again showed his love for Liverpool.\nWhile playing for the LA Lakers on Wednesday, James wore red Nike trainers with a Liverbird on the heel.\nA special collaborative shirt between the two is said to be coming out soon.\nA special guest in training\nThere was a special guest at the AXA this afternoon as Liverpool took to the training pitches ahead of Saturday's clash with Wolves.\nSir Kenny Dalglish was in attendance as he watched Jurgen Klopp put the squad through their paces.\nGreat stuff from King Kenny!\nA long time coming\nIt's been a long time coming, but Liverpool seem to finally have some good news as Virgil van Dijk and Roberto Firmino are stepping up their recoveries with a view to a return to action very soon.\nLiverpool have missed the duo and their return would provide a much needed boost to Jurgen Klopp's side.\nWolves on Saturday will probably come too early for the pair, but the Merseyside derby on Monday, February 13 may be in their sights as Real Madrid in the Champions League is also approaching.\nWelcome back!\nIt's a welcome sight for Jurgen Klopp as Virgil van Dijk and Roberto Firmino are back in training following a hamstring and calf injury.\nBoth have been missed by Liverpool, who take on Wolves on Saturday in the Premier League. The Reds are currently ninth in the league and 10 points behind the top four. A win is vital.\nSheffield United failed to make Rhian Brewster payment to Liverpool before transfer embargo\nSheffield United have failed to make a recent payment to Liverpool after signing Rhian Brewster in October 2020.\nThe striker joined the Blades in a £23.5m move two-and-a-half years ago, with the Reds negotiating a 15% sell-on clause and a guaranteed buy-back option, which would be valid for three years.\nHowever, the 22-year-old failed to score in his first season at Bramall Lane as Sheffield United were relegated from the Premier League. And while he would break his duck for the Blades in the Championship, his record for the club currently stands at five goals from 63 appearances in all competitions.\nRead the full story, here.\nOdds on Declan Rice's next club\nLiverpool are outsiders to sign West Ham and England midfielder Declan Rice, according to the latest odds.\nThe Hammers' captain has been touted with a big-money move to Arsenal after excelling at the Olympic Stadium in recent years. However, Liverpool have also been linked with a move ahead of what promises to be a busy summer on Merseyside.\nHere are the odds of Rice's next club, according to Betfair.\nArsenal: 7/4\nMan Utd: 3/1\nNot to sign or agree a contract with any other club: 7/2\nChelsea: 4/1\nLiverpool: 9/1\nNewcastle: 10/1\nMan City: 14/1\nWould you take Rice as Anfield, Reds?\nICYMI: Jurgen Klopp sent message by young defender amid Liverpool injury crisis\nLiverpool Under-21s suffered a defeat in the Premier League International Cup clash against Hertha Berlin.\nThe young Reds hosted the German club at Kirkby on Wednesday night, but succumbed to a 3-2 defeat. Calvin Ramsay scored Liverpool’s first goal of the contest, as he continued to gain match sharpness.\nBarry Lewtas’ side trailed in the 17th minute with a goal from Lukas Ullrich. Things got worse on the half-hour mark, when Ibrahim Maza put Hertha 2-0 up.\nBut Liverpool soon responded, with Ramsay meeting a Max Woltman cross to narrow the deficit. It was his third goal since moving from Aberdeen in the summer.\nRead the full report from last night's action, here.\nSteve Nicol backs Cody Gakpo for Anfield success\nSpeaking to ESPN, the former Liverpool midfielder said: “Gakpo’s a good signing. He’s a young player and there’s no question that there’s loads of potential there.\n“It’s not like [Jurgen Klopp] has signed another Arthur, shall we say. Now that was a complete shambles – so it’s not one of them.\n“This guy can play, this guy will absolutely help Liverpool in the future.”\nJoel Matip to depart Anfield this summer?\nThere have been \"growing whispers\" that Joel Matip could leave Liverpool this summer, according to reports.\nThe former Cameroon international is out of contract next summer and has been one of a number of players who have suffered a huge drop-off in form during a wretched season so far at Anfield.\nAccording to Goal's Neil Jones, the defender could end his seven-year stay at Anfield this summer.\nReviewing the Reds' potential departures ahead of a key summer transfer window, Jones wrote: \"There have been growing whispers from within the club that Matip may move on this summer.\n\"Virgil van Dijk and Konate look to be the Reds’ preferred centre-back pairing going forward, while Joe Gomez signed a long-term contract last summer and provides a homegrown squad option.\"\nThe defender made the move to Merseyside after the expiration of his contract at Bundesliga side Schalke 04 in the summer of 2016. He has won the Premier League and Champions League in the years since.\nEx-Manchester United star tells Jude Bellingham to make Old Trafford\nSpeaking to Games Cabin, Louis Saha said: “For a player that’s very young, he has the luxury of having interest from many, many big clubs. His heart should always go for the team he really loves, where he believes he can achieve a lot of things and where he believes he could improve. That’s up to him.\n“As a fan of Manchester United, I would obviously say that Manchester United is the ideal destination for Jude. A lot of the time, player’s don’t necessarily go to the clubs they love and respect the most. A lot of it is to do with the salary and what their agents are thinking, so a lot of it will depend on that. The kid is so talented and he deserves to make his own choice. This season, Manchester United are so exciting and for a player like Jude, who’s got intelligence, great energy, composure and all the skills you need, then he can go anywhere he wants.”\nParis Saint-Germain 'strongly interested' in Mohamed Salah\nLigue 1 champions Paris Saint-Germain hold an interest in Mohamed Salah, according to reports in Italy.\nThe Egyptian has struggled for form this season at Anfield and has only managed seven goals in 19 Premier League appearances since signing his record-breaking contract extension last summer.\nItalian publication CalcioMercatoweb report that PSG are interested in the forward and claim the Reds would be open to selling the 30-year-old for a fee of around €80m.\nHowever, any move away from Anfield seems highly unlikely given how integral Salah is to Jurgen Klopp's plans despite his struggles in recent months.\nIn his press conference last week, the Liverpool boss jumped to the defence of Salah for his below-par performances this term and explained why it has been a period of transition since Sadio Mane's departure and the arrival of Darwin Nunez.\nSpeaking to reporters at the AXA Training Centre, Klopp said: \"Yes, of course, Mo is suffering, but it was a well-drilled machine that front three (of Salah, Firmino and Sadio Mane), everything was clear in what we were doing.\n\"So it's Mo, Luis and Darwin who have played just 343 minutes together? And Diogo was not in that combination or Bobby (Firmino), that is not helpful. Not helpful. Everyone has suffered from that, that is clear.\n\"The offensive play, even with all that quality, is a lot of work. There's a lot of information given. It is how to work to move, you create a feeling about a lot of these things, you know where your team-mate is.\n\"That is not cool but we cannot expect just to be back to our best and win 5-0 and go to the next game. We have to work hard, no-one wants to hear it but we have to do it. And then in two or three weeks we have other options and can mix it up.\"\nHow Liverpool's February looks\nFebruary's fixtures pic.twitter.com/WXtgiIQ6VE\n— Liverpool FC (@LFC) February 1, 2023\nLiverpool loanee makes big debut impression\nLuke Chambers provided an assist for the winning goal on his debut for Scottish Premiership side Kilmarnock on Wednesday evening.\nThe defender, who made the loan switch north of the border on deadline day in a bid to gain senior experience between now and the end of the season, impressed his manager Derek McInnes with his performance in the league encounter with Dundee United.\n\"36 years ago I made my senior debut and I certainly didn't play as good as him.\"\n— Kilmarnock FC (@KilmarnockFC) February 1, 2023\nThe boss was full of praise for debut boy Luke Chambers.\nWelcome to the Killie family, pic.twitter.com/sNkMrRAfX6\nNews from elsewhere in the Premier League\nTottenham revealed on Wednesday the Italian had undergone surgery after being diagnosed with Cholecystitis.\nAn update from Antonio after his surgery today pic.twitter.com/xBkkIvdyue\n— Tottenham Hotspur (@SpursOfficial) February 1, 2023\nJude Bellingham remains Real Madrid's 'priority' ahead of the summer transfer window\nBorussia Dortmund and England midfielder Jude Bellingham remains a priority for Real Madrid this summer despite their hopes of bringing in a long-term replacement for Karim Benzema, according to reports.\nThe former French international, 35, won the 2022 BallonD'or due to his fine performances in Los Blancos' Champions League and La Liga-winning campaign.\nHowever, with Manchester City's Erling Haaland and Paris Saint-Germain's Kylian Mbappe off the market after signing contracts at their current clubs within the last twelve months, the Spanish giants will continue to pursue Bellingham.\nA report from the publication AS reads: \"Real Madrid are clear about their main objective for next summer: Jude Bellingham. The club is also keen to sign a top-level striker who will eventually replace Benzema, but that plan is far more complicated due to the lack of viable candidates (with Mbappé or Haaland both out of reach, the club does not see a clear objective). So Bellingham is the priority - a signing which hopefully will extend Madrid’s step to replenish the midfield, an upgrading process that began a while back with the arrival of players like Valverde, Camavinga, Tchouameni...\n\"Bellingham already knows from Madrid that he is on their agenda and that they will have their proposal in place before June. There is currently no contact with Borussia Dortmund, but that’s not a huge problem - the relationship between the two clubs has been excellent for years and, when the time comes to negotiate, Madrid is confident that the process will be short and satisfactory for all parties.\n\"Liverpool’s determination to land Bellingham presents a problem for Madrid. Firstly, like most other Premier League clubs, they have the economic power to lure the midfielder, while Klopp has allies within Dortmund to tip the scales in his favour. It’s hardly surprisingly Klopp is so revered - he helped them to win two Bundesligas, end as runners-up twice and lift another three titles in Germany as well as coming close to winning the Champions League. And there is an extra attraction for the player - the possibility of playing in his home country again - the place he left for Germany in 2020.\"\nRoberto Firmino's agent breaks silence on Liverpool contract talks\nRoberto Firmino's talks over a new Liverpool deal are \"on the right track\" with the striker expected to make a decision on his future this month.\nFirmino, who arrived at Anfield in the summer of 2015 and has made 348 appearances, is out of contract at the end of the season with talks having been ongoing for several months over a new deal.\nJurgen Klopp has long made clear his desire to keep the 31-year-old Brazilian, with the player himself having expressed his intention to stay.\nNow Firmino's agent Roger Wittman has detailed the current position of his client with a final call likely in the coming weeks.\nRead the full story, here.\nPaul Ince sends Roberto Firmino warning to Liverpool\nPaul Ince has warned Liverpool of the further problems they could face if they don't extend Roberto Firmino's contract.\n\"The reason that Mane, Firmino and Salah were unplayable a couple of years ago was because of Roberto Firmino,\" Ince argued, speaking to Boylesports.\n\"He used to pull centre-halves out of position to allow Salah and Mane space to run into.\n\"As much as Liverpool have invested in very good players like Luis Diaz and Darwin Nunez, they don't do what Firmino does.\n\"If I was Liverpool, I'd be looking to keep hold of him.\"\nWelcome\nGood morning and welcome to our Thursday LIVE Liverpool blog.\nThere is plenty to talk about around Anfield, despite the January transfer window now being closed.\nWe'll be providing you with all of the latest talking points, transfer rumours, speculation, plus anything else of note from Liverpool.\nMake sure you stay tuned!",
  "word_count": 3377,
  "scraped_at": "2026-02-14T01:59:41.725142",
  "_text_extracted": true
}