{
  "article_id": "ef244eb18045",
  "url": "https://www.ummid.com/news/2025/october/21-10-2025/ronaldo-skips-but-al-nassr-vs-fc-goa-acl2-clash-leaves-fans-in-frenzy.html",
  "title": "Ronaldo skips , but Al Nassr vs FC Goa ACL2 clash leaves fans in frenzy",
  "date": "20251021T094500Z",
  "domain": "ummid.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tuesday October 21, 2025 2:50 PM, Zohair M Safwan Faizee\n[Al Nassr players upon their arrival in Goa Monday]\nAFC Champions League Two 2025: Saudi Pro League giant Al Nassr will be playing its AFC Champions League Two match against FC Goa without its Captain Cristiano Ronaldo, but football fans in the Indian coastal state are already in frenzy.\nAl-Nassr Vs Goa FC is scheduled to be held at Fatorda Stadium Wednesday October 22, 2025. The match will start at 07:15 PM Indian Standard Time (IST).\nAl-Nassr is leading the AFC Cup Chart in Group D Standings with 6 points.\nThe Roshn Saudi League (RSL) giant has won its previous two matches – defeating Istiklol 5-0 in its opening match played in Riyadh on September 17 and Al-Zawraa 2-0 played in Baghdad on October 01, 2025.\nOn the other hand, FA Goa has both the matches it played in the AFC Cup 2025 and is placed last in the Group D table with zero point.\nGoa FC previous matches were Vs Al Zawraa SC of Iraq played at Fatorda Stadium in Goa on September 17 and Vs Istiklol FC of Tajikistan played at Central Stadium in Almaty on Oct 01, 2025.\nThus the local football team will be playing against Al Nassr Wednesday with zero point. Yet, whole of Goa is in the grip of football.\nMost of the tickets, which went for sale online September 19, 2025, have already been sold out. For the remaining, the organisers have advised fans to book well in advance to avoid last minute hassle, especially because the match is coinciding with Diwali vacations.\nAl Nassr players arrived in Goa late in the evening Monday.\nOn their arrival at the Mopa International Airport, they were given a rousing welcome where a huge crowd was waiting outside despite light showers.\nThis is the Al Nassr’s players’ first visit to India. The state government had deployed extra security for the Saudi Pro League giants.\nAl Nassr players arrived in Goa to a rousing welcome Monday. Al Nassr will play against Goa FC Wednesday Oct 22, 2025. The Saudi FC will play, its first match in India, without its captain Cristiano Ronaldo.#ALNASSR #football #AFChamp #AlNassrvsGoa #Ronaldo #cristiano pic.twitter.com/H8y27N4yCB\n— ummid.com (@ummid) October 21, 2025\nAccording to Goa FC sources, the Al Nassr players are being treated as State Guests.\nExtra security was also deployed in the city as there was a huge euphoria about Portuguese star footballer and Al Nassr captain Cristiano Ronaldo.\nThere were speculations that CR7 will lead Al Nassr against Goa Football Club Wednesday October 22, 2025 playing in the AFC Champions League Two (ACL2) Group Match.\nHowever, Ronaldo did not turn up, and there are various reasons cited on why the highest goal scorer in international football has given Goa football fans a miss.\nAccording to Al Nassr sources, Ronaldo has been managing his workload wisely, especially with the 2026 FIFA World Cup in sight.\nThis is why he had skipped Al Nassr's previous AFC Champions League Two fixtures against Tajikistan FC Istiklol in Riyadh and Al Zawraa SC in Iraq.\nThis is because, the sources said, as per the contract between Ronaldo and Saudi FC Al Nassr, the football legend can opt out of a match or two in a tournament if he wishes to.\nBesides Ronaldo, Al-Nassr have several stars like Sadio Mane, Joao Felix, Inigo Martinez and Kingsley Coman, all of whom have been involved in the previous AFC Champions League Two (ACL2) group games.\nOrganised by the Asian Football Confederation (AFC), the AFC Champions League Two is the second-tier club football tournament in the continent after the AFC Champions League Elite. The competition started on September 16, with the group stages ending on December 24, 2025.\n[Zohair Mohammed Safwan Faizee is Staff Writer at ummid.com. With inputs from Goal and agencies.]\nFollow ummid.com WhatsApp Channel for all the latest updates.\nSelect Language to Translate in Urdu, Hindi, Marathi or Arabic",
  "word_count": 661,
  "scraped_at": "2026-02-14T01:52:49.021203",
  "_text_extracted": true
}