{
  "article_id": "ef4a413b1830",
  "url": "https://theathletic.com/4773869/2023/08/14/spain-have-an-alexia-putellas-aitana-bonmati-dilemma-on-their-hands/",
  "title": "Spain have an Alexia Putellas - Aitana Bonmati dilemma on their hands",
  "date": "20230814T121500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In some ways, the fact Spain are in the semi-finals of this Women’s World Cup should not be that surprising, since they have what is undoubtedly their best generation of players ever. The younger ones — champions of everything at youth level — have come together with senior team-mates to mark a turning point in Spanish women’s football.\nAdvertisement\nIt is a potent combination that has led Spain to a position as one of the four best teams in the world for the first time in their history.\nAdded to this is the fact their squad contains reigning Ballon d’Or winner Alexia Putellas, who has won the award for the past two seasons, and one of the leading contenders to win that same award this year in Aitana Bonmati.\nHaving two of the best women’s players in the world should be a blessing for any squad. And even more so when they are both part of one of the best midfields in Europe with their club, Barcelona.\nBut, ahead of their semi-final against Sweden tomorrow (Tuesday) in the New Zealand city of Auckland, it is not quite that simple. In some ways, it is actually a problem for manager Jorge Vilda.\nThey say it takes a year after returning from an anterior cruciate ligament (ACL) injury for a player to get back to their best.\nPutellas is definitely not there yet.\nShe made it to the World Cup by the skin of her teeth.\nInjured in training on the opening day of the European Championship last July, she made her comeback — nine months after surgery — on April 30. But she played no more than 29 minutes in any of six appearances for Barca over the final weeks of the club season, improving to around an hour each in pre-tournament friendlies against Panama and Denmark.\nPutellas has had to re-learn how to walk, run, control the ball and play. Before the injury, she was at her best. Now it will take some time before she regains her old spark.\nThere have been some glimpses of her world-class ability in this tournament, especially in the game she started against Zambia (and was replaced at half-time) and in extra time of the quarter-final against the Netherlands. But it was telling that Putellas did not start that match, or the last-16 win over Switzerland.\nAdvertisement\nShe was a starter in the final group game with Japan and it seemed her minutes and prominence were on the rise, but she did not perform during her hour on the pitch in that match, though in fairness neither did her team-mates in a humbling 4-0 defeat. Since, she has played only 36 minutes across the two knockout ties. This shows the seriousness of her injury — one of the worst any athlete can have — and how difficult serious ACL damage is to come back from.\n“It’s hard, especially because of the media pressure she is under,” her team-mate and friend Irene Paredes said before the tournament started. “It’s complicated to get back to her best and everything takes time. We have to give her that.”\nIn Putellas’ absence over the past year, Bonmati has emerged as a leader for Barca and the national team.\nShe has just had her best season at club level and looks set to be one of the standout players at the World Cup, too, although she cannot claim to have been entirely consistent. She was also ineffective against Japan, didn’t touch the ball that much against Zambia and was substituted with the Dutch game in the balance.\nBut she is one of five players who have become vital in Vilda’s highly variable starting line-up — Ona Batlle, Irene Paredes, Jennifer Hermoso and Tere Abelleira being the others.\nWhat is clear is that Spain’s best moments have been when Bonmati has been at her most influential. That game against the Swiss looked very dangerous, coming so soon after their embarrassment against Japan, but she led the team to a 5-1 victory, both in terms of the result and morale.\nIt was their best performance of the World Cup so far and was particularly impressive because of the amount of chances they made from the middle of the field. And that’s where Bonmati had the responsibility, helping to stretch the team and creating a lot of danger. She scored two of the goals and assisted two more.\nAdvertisement\nOne of the most notable things about her play in this tournament is that her most effective games have come when Putellas has not been in the team. Against Zambia and Japan — when she had less of an impact — Putellas was there in the starting XI alongside her. It is also true that Bonmati was not at her most dangerous against the Netherlands, perhaps because Mariona Caldentey played and she likes to occupy similar spaces.\nGiven Putellas and Bonmati have played together at club level for years, why is this a problem? Surely they should be able to combine with complete ease on the international stage?\nThe thing is, Bonmati has had to change her game over the past year at club level in the absence of her midfield partner. Patri Guijarro — the team’s defensive pivot par excellence — has played alongside her in a more advanced role. Manager Jonatan Giraldez believed this was the best way to maintain the Barca essence, and he used Keira Walsh as a pivot.\nBonmati has played much closer to the box, scoring more goals, especially in the Champions League, and has often found herself in wider positions. She has grown used to playing like this and has found the best version of herself.\nWhen she plays with Putellas now, she lacks that freedom and space. They are two players with very similar characteristics and, in order not to step on her team-mate’s toes, Bonmati is more restricted.\nBut they are both leaders of the team. One has been that in the absence of the other. Putellas has understood that her role in this World Cup will not be the one she wanted because of the limitations of her fitness. She knows her leadership role will not be so much on the pitch but in the dressing room.\nShe is learning to accept a role she has not had until now. Lower, more humble.\nSo much so that, right now and given the circumstances, the best midfield for Spain is Teresa Abelleira as a pivot — one of the big surprises of the World Cup, covering for Guijarro — Bonmati and Jennifer Hermoso.\nIn other words: no Putellas.\nAdvertisement\nThis may come as a surprise to the fans who give the best player in the world a standing ovation every time she comes on in the second half of a game. She and the coach have understood that her role here is from the bench. Meanwhile, Bonmati is at the top of her game.\nFor Vilda, having the two best players in the same team has become an unexpected dilemma.\nBonmati sets the tempo for Spain, and the issue for Vilda seems to be whether to let his (currently) best player shine and be decisive for his team, or whether to put Putellas in and risk limiting Bonmati’s freedom.\nIn theory, it is a nice problem to have.\nGetting it right might determine the outcome of Spain’s World Cup campaign.\n(Top photo: Angel Martinez/Getty Images)",
  "word_count": 1241,
  "scraped_at": "2026-02-14T02:00:36.671145",
  "_text_extracted": true
}