{
  "article_id": "ef6a544ed35c",
  "url": "https://www.bbc.co.uk/sport/football/65955025",
  "title": "Haaland , Bellingham , Vinicius , Mbappe : Who will win the 2024 Ballon dOr ? ",
  "date": "20230622T090000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Haaland, Bellingham, Vinicius, Mbappe: Who will win the 2024 men's Ballon d'Or?\n- Published\nAn initial version of this piece was first published on 22 June 2023.\nIt's official: Lionel Messi is once again the best player on the planet after he was awarded the Ballon d'Or in Paris on Monday.\nThe World Cup winner's reward for an eye-catching 12 months brings with it a familiar feel to the top of men's football. For many years it was a given that either the Argentine forward or his great rival Cristiano Ronaldo would scoop the top individual prize.\nOf the 15 men's Ballon d'Or awards handed out since 2008, the pair have claimed 13 of them, with only Luka Modric (2018) and Karim Benzema (2022) breaking their dominance.\nHowever, Messi has moved to the MLS, Ronaldo and Benzema are in Saudi Arabia, and Modric is not the force he once was at Real Madrid. All four are deep into their 30s. A changing of the guard is coming.\nThe shortlist for this year's award contained plenty of familiar names, but it also offered a hint at a future in which the Premier League and English players could come to the fore.\nSo, who could pick up the mantle? BBC Sport takes a look...\nJude Bellingham (Real Madrid, England)\nOne of the top performers at last year's World Cup in Qatar, Bellingham became the third-most expensive teenager in history - and the second-most expensive English player of all time - when he joined Real Madrid for an initial 103m euros (£88.5m) from Borussia Dortmund.\nHe was unable to guide the Bundesliga club to a first league title in 11 years but excelled in his final season in Germany, making history in October last year when he was made the club's youngest captain at just 19 years of age.\nBellingham, who left Birmingham City for Dortmund for £25m in 2020, registered 14 goals and seven assists in 42 appearances in 2022-23.\nHaving turned down a host of Europe's top clubs in favour of the 14-time European champions, the midfielder has made a remarkable start to his career in the Spanish capital. He has 10 La Liga goals already in 2023-24, making him the competition's leading scorer, including Saturday's decisive double against Barcelona in El Clasico.\nErling Haaland (Manchester City, Norway)\nThe first player to win the Premier League player and young player of the year awards in the same season, the prolific Norwegian is perhaps the most obvious heir apparent to Ronaldo, Messi and co.\nHaaland sent records tumbling in his debut campaign in England's top flight, his 36-goal tally breaking the previous best mark shared by Alan Shearer and Andy Cole (34) for nearly three decades.\nThe 23-year-old ended the season with 52 goals in 53 appearances, making him only the second player in English top-flight history - and the first in 95 years - to net more than 50 times in all competitions.\nHe has shown no signs of letting up this season, with 11 goals in 10 Premier League appearances, including a hat-trick against Fulham - his fifth in England's top flight - and a double against Manchester United on Sunday.\nVinicius Jr (Real Madrid, Brazil)\nIn the aftermath of Madrid's demolition of Liverpool in the last 16 of the Champions League back in March, head coach Carlo Ancelotti called Vinicius the \"most decisive player anywhere in the world - the one who determines matches most on a consistent basis\".\nThe Brazilian, who terrorised the Manchester City defence with pace and trickery in the 2021-22 semi-finals before scoring the winner in the final against Liverpool, is already a proven finisher and a goal-maker and looks to be improving all the time.\nThe target of racist abuse on multiple occasions last season, one particular incident involving Vinicius in Valencia sparked outrage in both Spain and Brazil.\nSeven people were subsequently punished for acts of racism, Valencia were sanctioned with a partial stadium closure and Vinicius was recruited by Fifa to be part of a new anti-racism task force., external\nKylian Mbappe (Paris St-Germain, France)\nThe prolific Frenchman has scored 224 goals and contributed 87 assists in 272 games since joining Paris St-Germain from Monaco in 2017, contributing to 13 domestic trophies with the Qatari-owned club.\nAn integral part of France's World Cup triumph in 2018, Mbappe has also registered 43 goals in 73 appearances for Les Bleus, placing him fourth on their list of all-time scorers - 11 goals behind record holder Olivier Giroud.\nHe was denied back-to-back World Cup victories by a Messi-inspired Argentina, despite scoring the first final hat-trick since England's Geoff Hurst in 1966.\nTransfer speculation continues to surround Mbappe. Wherever he plays at club level, he will no doubt keep scoring goals - he has 10 in nine Ligue 1 games already this season.\nHarry Kane (Bayern Munich, England)\nEngland captain Kane ended his record-breaking career at Tottenham to spread his wings in the Bundesliga with German champions Bayern Munich.\nThe 30-year-old netted a club record 280 goals for Spurs in 435 appearances, which included 218 goals in the Premier League, leaving him second behind Alan Shearer in the division's leading scorer list.\nHowever, crucially he has no trophies on his CV - a fact he will be looking to put right in Germany.\nHe has already broken records at his new club, becoming the first player in Bundesliga history to score 12 goals in his first nine games. He also has five assists.\nHe also continues to be prolific for an England side regularly challenging on the biggest stages, with a national record tally of 61 goals in 87 caps.\nOther Premier League contenders\nThere are 12 players on the Ballon d'Or shortlist who play their football in England's top flight.\nHaaland is arguably the most prominent as regards the pursuit of individual honours, but some of the others have also had fine recent seasons and could yet improve further.\nThe City forward's Norwegian compatriot Martin Odegaard excelled in Arsenal's title challenge in 2022-23, as did England forward Bukayo Saka, who contributed 14 goals and 11 assists in 2022-23 and has 11 goal contributions (five goals, six assists) already this season.\nAnother City player - Julian Alvarez - has had a stellar 12 months, making history as the first player to win a treble of Champions League, league and domestic cup - plus a World Cup - in the same season. He has scored seven goals and created another four this season.\nOnly three out-and-out defenders have won the Ballon d'Or and it has not happened since Italy's World Cup-winning captain Fabio Cannavaro was crowned in 2006. Could Manchester City's Ruben Dias or Josko Gvardiol add their name to the list?\nOr maybe City's Kevin de Bruyne or Liverpool's Mohamed Salah can stay fit and firing into their mid-30s to hit the heights we know they are capable of to propel their clubs to further success?\nIf you are viewing this page on the BBC News app please click here to vote., external\nOur coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment",
  "word_count": 1213,
  "scraped_at": "2026-02-14T01:50:37.794281",
  "_text_extracted": true
}