{
  "article_id": "ef951bcbccf4",
  "url": "https://thepeoplesperson.com/2023/06/02/erik-ten-hag-press-conference-manchester-united-have-the-chance-to-turn-this-season-into-a-perfect-one-with-fa-cup-final-triumph-264828/",
  "title": "Erik ten Hag press conference : Manchester United have the chance to turn this season into a perfect one with FA Cup final triumph",
  "date": "20230602T144500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag, in his first season as Manchester United manager, has guided the club back to the Champions League via a third-place finish in the Premier League.\nHe has also ended the club’s wait for silverware by claiming the Carabao Cup. But his biggest test could be coming up on Saturday.\nThe Red Devils have the chance to add another trophy to the cabinet in the form of the FA Cup but even more important than that is the chance to preserve the club’s long-standing legacy of being the only Treble winners in the country.\nThe team will have play out of their skin to be able to stop the Manchester City juggernaut but the Dutchman will not be able to count on Anthony Martial for the contest and there is very little chance of Anthony playing a part as well.\n“Unlikely. Antony still [has] a chance but a really small chance. He didn’t make progress, so he still has a chance but unlikely he is available,” Ten Hag said during the pre-match press conference.\n“These questions, so many times from the media about absence of players in the last couple of months and every time I say the same answer: it is about the players who are available and many times we were successful.\n“So we have a good squad and from the good squad we make a good team.”\nThe former Ajax manager was asked about Pep Guardiola’s side and about whether he has formulated plans to stop them.\nTen Hag lauded City’s style of play but also pointed out that it is not about stopping the neighbours but about making sure United play well and eventually regain their place at the top of the English footballing pyramid.\n“I think they do a very good job. They play very good football, they deserve [the plaudits]. Of course, I look at our opponents, I evaluate, but we look to ourselves and you have to see where you are as a club and from there on, you have to make progress and I think we did over the last season.\n“We made very good progress, we are in a good direction and now we have the opportunity in the summer to make new targets, new goals in the short-term. But the longer term will stay the same. As I said last year, we want to restore United but we have a way to go.”\nWhen asked whether he rated the season as a successful one considering his first campaign in England, Ten Hag said while it was a good start, the ending could make it even more beautiful.\n“I think it is very good when you see where we came from and then you see the progress and the development of the team. And in a tough league like the Premier League, you are third and winning the League Cup and in the final of the FA Cup, you can be happy with the season.\n“I think we had a good season but of course, we have a great opportunity to make it a very good season.”\nHe is aware that fans desperately want to stop the unthinkable from happening and while Ten Hag understands its importance, he just wants to focus on winning instead of stopping the opposition.\n““We want to win. We want to win a cup. And it’s not about stopping them. It is about that we win, that we win a cup. We have a great opportunity.”\nImagine an FA Cup Final programme, but 100% online!\nWith just a couple of clicks you could be reading the FA Cup final special edition of United Matchday Magazine, right here on your device. All the latest news, meet the teams, tactical preview, opinion, debate, transfer news, quiz and much more! Get yours now for just £3/$3.75 and\nbe in the know about everything in red!",
  "word_count": 648,
  "scraped_at": "2026-02-14T02:24:42.725943",
  "_text_extracted": true
}