{
  "article_id": "efef0ae291ff",
  "url": "https://www.teamtalk.com/arsenal/plot-signing-barcelona-star-arteta-huge-fan-lethal-alternative-off-market",
  "title": "Arsenal transfers : Edu plots signing of Barcelona star Arteta is a  huge fan  of , as lethal alternative taken off market",
  "date": "20241025T123000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal plot signing of Barcelona star Arteta is a ‘huge fan’ of, as lethal alternative taken off market\nArsenal are interested in landing Barcelona forward Ferran Torres after learning that they will be unable to sign his team-mate Raphinha, as per a report.\nTBR Football claim that Arsenal are one of several Premier League clubs keen on Torres, with manager Mikel Arteta a ‘huge fan’ of the former Manchester City ace. Despite having improved their financial situation in recent months, Barcelona will ‘consider offers’ for Torres as they look to increase their transfer funds.\nBarca boss Hansi Flick would not stop the winger – who can also play as a centre-forward – leaving, as he is struggling to hold down a starting spot. Torres has registered one goal and two assists in 10 appearances for Barca this season, with four of those outings lasting less than 20 minutes.\nTBR Football add that Arsenal will face competition for Torres, as Aston Villa and Newcastle United are also ‘admirers’ and are ‘keeping tabs’ on his situation.\nAll three English sides have begun pursuing the Spain international after finding out that fellow attacker Raphinha will not be on the move next summer.\nBarca have ‘removed Raphinha from the transfer list’ after an excellent start to the campaign in which he has managed nine goals and eight assists in 13 games, which includes a brilliant hat-trick during the 4-1 win over Bayern Munich in the Champions League on Wednesday.\nBattle for Ferran Torres\nArsenal are on the hunt for a new winger who can provide cover and competition for the likes of Bukayo Saka, Gabriel Martinelli and Leandro Trossard. Torres fits the bill as he can operate anywhere across the forward line.\nThe Gunners did sign Raheem Sterling on loan from Chelsea in the summer, but they are unlikely to agree on a price with Chelsea over a permanent deal for the Englishman.\nTorres would be a better option for Arteta than Sterling as he is five years younger at 24, which means he has his prime years ahead of him.\nThere is good reason to suggest that Torres is being undervalued by Barca, too. The player put up decent numbers at City – 16 goals and four assists in 43 games – before being sold to Barca in a £55million (€66m / $71m) deal in January 2022.\nGiven Torres’ previous experience in the Premier League, Arsenal will know that he should adapt quickly to English football once again, if they sign him.\nBut there could be a bidding war for the former Valencia star as Villa and Newcastle both have the finances to give Arsenal problems.\nCity, meanwhile, could now find it tough to land Raphinha as his importance to Barca grows. On Tuesday, TEAMtalk revealed City have shortlisted the Brazilian as a potential big-name addition to their attacking ranks.\nREAD MORE: Man City considering beating Arsenal to spectacular Real Madrid raid for De Bruyne’s heir\nArsenal transfers: Striker green light, shock player suggestion\nMeanwhile, Arsenal have reportedly been given a boost in their chase to sign Juventus striker Dusan Vlahovic.\nJuve are ready to sanction Vlahovic’s exit, with Arsenal poised to move forward their striker plans and bring in a new No 9 in January.\nVlahovic’s price tag has been set at €70m (£58m / $76m). Although, any deal for him would see Arsenal give up on top forward target Benjamin Sesko.\nElsewhere, former Arsenal star Bacary Sagna has surprisingly suggested the Gunners enter the frame for Manchester United flop Paul Pogba, who could soon become a free agent.\n“The Premier League suits Paul Pogba – I would love to see him join Arsenal,” Sagna said.\n“It would be great – he has experience; he loves to play with young players around him – that is when he is most efficient.\n“At the 2018 World Cup, that was when he was most efficient – he had friends around him.\n“Arsenal have a young, fresh team, and I see him performing in an Arsenal shirt. He will get love from their fans.\n“Now, he can start from scratch again – he’s had time away from football, and he’ll be back with a desire to get back into a good space and play football again.”",
  "word_count": 716,
  "scraped_at": "2026-02-14T01:51:57.639649",
  "_text_extracted": true
}