{
  "article_id": "f00e9eaceabc",
  "url": "https://www.caughtoffside.com/2025/02/25/agent-liverpool-transfer-left-back/",
  "title": "Liverpool have been tipped to sign Bournemouth left - back Milos Kerkez",
  "date": "20250225T101500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool manager Arne Slot has had success in his first season at the club and his team is most likely going to win the Premier League.\nWith minimum spending, Slot has worked wonders at Anfield and he has managed to raise the level of the players that former manager Jurgen Klopp left behind.\nOne of the concerns for the Dutch manager is the left-back position where Andy Robertson has struggled to perform this season.\nWhile the club could lose right-back Trent Alexander-Arnold to Real Madrid at the end of the season, they could also replace Robertson in the starting line up.\nThe Reds have been linked with a move for Bournemouth left-back Milos Kerkez who has impressed this season for Andoni Iraola’s side.\nAnfield Watch talked to Richard Henczi, who is an agent and a former youth football coach about Kerkez potentially joining Slot’s team.\n“I think he’s ready to go to a higher level club [than Bournemouth],” said Henczi.\n“If he wants to go to Liverpool, he will go to Liverpool,” he said.\n“I mean he has everything [to be one of the best left-backs]. I think he can’t be in the top five left-backs around the world if he plays at a smaller club. So it depends on his next transfer – how many minutes will he play there and how well will he play there?\n“[Do they] play in the UEFA Champions League or just the Europa League and you know, these kinds of decisions. If he gets the chance, I think he has everything to be in the top five or ten left-backs in the world.”\nLiverpool are desperate for a new left-back\nA new left-back is on the agenda for Liverpool and Kerkez is going to be among the players they will target in the summer transfer window.\nClub legend Jamie Carragher has also urged the Reds to sign the Premier League star in order to address the issue of the left-back position.\nKerkez is would be the ideal left-back for the Merseyside club since he is equally good as an attacking option as he is as a defender.\nWolves left-back Rayan Ait-Nouri is another player which is on the shortlist of the Premier League leaders to replace Robertson at the club.\nLiverpool star teases move to European giants with his latest comments",
  "word_count": 388,
  "scraped_at": "2026-02-14T01:58:05.338452",
  "_text_extracted": true
}