{
  "article_id": "f02bd0eeffe7",
  "url": "https://www.teamtalk.com/tottenham-hotspur/thomas-frank-sack-odds-dramatically-slashed-spurs-clear-path-mauricio-pochettino",
  "title": "Thomas Frank sack : Tottenham axe odds dramatically SLASHED as Spurs are granted clear path towards world class successor",
  "date": "20260209T100000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nThomas Frank sack odds dramatically SLASHED as Tottenham are granted clear path towards world class successor\nThomas Frank will do well to see out the season as Tottenham Hotspur manager in the wake of another disappointing defeat over the weekend, with the club sucked into a relegation battle and with the odds on him being sacked radically shortened, and with TEAMtalk learning how an elite manager has now said YES to the job.\nThe Dane was named as manager last summer as a successor to the sacked Ange Postecoglou and is only 37 matches into his reign in N17. But after Saturday’s 2-0 defeat to Manchester United at Old Trafford, Frank has only collected 13 wins so far, the same number of matches he has now lost, and overseeing an abysmal 35.14% win percentage record.\nThat leaves Tottenham way down in 15th place, and the club are now just six points clear of the relegation zone after a somewhat surprising revival from London rivals West Ham, who are 18th.\nSaturday’s defeat was not helped by a reckless challenge from skipper Cristian Romero, who was handed a straight red card for an ugly tackle on Casemiro on 29 minutes and with the Argentine now facing a four-match suspension.\nWhile without his captain, Frank has an immediate chance to bounce back in a home game against Newcastle on Tuesday evening (7.30pm) and another defeat could prove catastrophic to his chances of keeping the job.\nIndeed, having collected just one win in his last 10 Premier League games, the tide against Frank is rapidly turning.\nTo that end, bookmakers have now slashed the odds on Frank becoming the next Premier League manager to lose their job to 6/4 favourite, dropping another strong hint that his sacking could be in the offing this week.\nFurthermore, in a major development as revealed by our correspondent, Fraser Fletcher, we can reveal that Mauricio Pochettino would unequivocally accept a return to Tottenham if offered the role, and with sources shedding further light on the precarious position Frank now finds himself in.\nWant breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nThomas Frank sacked; Mauricio Pochettino to return?\nWith matches to follow against Newcastle, Arsenal and Fulham to follow, Fletcher understands that the Spurs board’s patience is starting to wear thin – especially given the club’s delicate position that now sees them sat on the cusp of the relegation dogfight.\nInsiders suggest that poor results could precipitate Frank’s sacking, paving the way for an interim appointment. Johnny Heitinga, already embedded in the coaching staff, has now emerged as the frontrunner to steady the ship until summer.\nThe rationale behind retaining Frank for now amid the turmoil is starting to wear thin, though we can reveal Tottenham’s hierarchy is playing the long game, and are now eyeing superior managerial options post-World Cup.\nPochettino, set to take the United States national team through the tournament, tops that list. Despite interest from Manchester United, where he remains on their radar as a potential successor in their own manager hunt, Pochettino’s deep affection for Spurs is said to be unshakeable.\nA sense of unfinished business – after his abrupt 2019 departure despite leading the club to a Champions League final – fuels this narrative. “For Poch, Spurs is a pull that’s too strong to ignore” one source confided.\nDespite that, we have been told that Pochettino will want to fulfil his contract with the United States through the 2026 World Cup before officially green-lighting a return to Spurs.\nBut once their interest in their home-staged tournament is over, an emotional reunion between Pochettino – still considered a world-class manager – and Tottenham could well be on the cards.\nBefore the weekend, Pochettino was 7/2 to make a return to N17 as the next manager; those odds are now just 2/1 and with traction growing all the time.\nLatest Tottenham news: Bayern linked with Van de Ven; Kolo Muani future mapped out\nSpurs’ continued struggles this season will cast further doubts on their chances of retaining the services of their best player – defender Micky van de Ven – with a lack of Champions League football likely to prove significantly detrimental to their prospects of the Dutchman’s stay.\nAlready linked with the likes of Real Madrid and Liverpool, it’s now claimed Bayern Munich are paying close attention to Van de Ven’s situation – and a respected Bayern Munich account has shed light on how the player would react if the reigning Bundesliga champions were to make a summer move.\nOn the subject of Van de Ven, former Tottenham manager Tim Sherwood has named Van de Ven’s next destination – and it is not Liverpool or Real Madrid.\nElsewhere, sources have told our transfer insider, Graeme Bailey, whether Tottenham plan to keep Randal Kolo Muani at the club beyond the end of the season.\nAnd finally, Tottenham and Arsenal are in a battle for a former Manchester United midfielder who is starring in Serie A.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 876,
  "scraped_at": "2026-02-14T01:59:36.838087",
  "_text_extracted": true
}