{
  "article_id": "f033e6b63321",
  "url": "https://www.fourfourtwo.com/features/ranked-the-10-best-chelsea-players-of-all-time",
  "title": "Ranked ! The 10 best Chelsea players of all time",
  "date": "20230627T150000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! The 10 best Chelsea players of all time\nFourFourTwo runs down the greatest names to grace the turf at Stamford Bridge\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nChelsea are one of the most successful English football clubs in history, having won 34 trophies - including two Champions Leagues - since the club's inception in 1905.\nDuring that period, some of the best players in world football have adorned the Blues' shirt, stamping their authority within the club's history and etching their names into the pantheon of greats to have plied their trade in west London.\nWhile Winston Bogarde certainly had an, ahem, impact at Stamford Bridge, making just 11 appearances in his four seasons, all while pocketing a reported £40,000 a week, some others fared slightly better when they pulled on the Chelsea shirt.\nBelow, FourFourTwo runs down the 10 best Chelsea players of all time, separating the greats from the legends, and even those deserving of a statue at the club's stadium.\nThe 10 best Chelsea players of all time\n10. Peter Sillett (1953-62)\nAshley Cole and Steve Clarke deserve honorable mentions, but as a full-back Sillett had the lot. Described by Stanley Matthews as the best defender he played against and by Roy Bentley as one of the best passers he had ever seen, Sillett also had an eye for goal, only surpassed by one other - more on him later - of Chelsea’s clinical defenders.\nSillett the title with the Blues in 1955 and would have won many more than his three England caps were it not for a relaxed approach to the game. Still, he made more than 250 appearances for Chelsea in his 11 years at the club, scoring over 30 goals.\n9. Ron Harris (1961-80)\nWhen you’re better known for the sobriquet ‘Chopper’ it’s little wonder people question your footballing ability, but as well as being able to dish it out – and boy could he dish it out – Harris was a central defender of no little ability, playing just five shy of 800 games for the Blues, mainly in the top flight. He remains the club's leading appearance maker, no mean feat for a 5\"8 centre-back during that era of the game.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nHaving won the League Cup in 1965, Harris led the Blues to FA Cup and Cup-Winners’ Cup victories in 1970 and ’71 respectively. While he never played for England's senior side, Harris proved influential to a successful Chelsea side during his 19 seasons with his boyhood side.\n8. Jimmy Greaves (1957-61)\nBetter known as a Spurs and England legend, it was for Chelsea whom Greaves was most prolific, scoring at nearly a goal a game in his four seasons – 132 in total for what was largely a struggling First Division team – before leaving for AC Milan little after his 21st birthday.\nManaging such a prolific return in his first seasons in professional football seems almost incomprehensible - Greaves bagged 22 times as a 17-year-old alone.\nOne of (Ted) ‘Drake’s Ducklings’, a less successful answer to the Busby Babes, Greaves combined pace and dribbling ability with deadly finishing – a true phenomenon. It's no wonder he went onto set a seemingly uncatchable tally of 357 goals in English football, making him the highest goalscorer in the history of top-flight football in this country.\n7. Petr Cech (2004-15)\nIt took some time before Cech was back to his best following the collision with Stephen Hunt in October 2006 that left the Czech keeper with a fractured skull. However, before that he was imperious as Chelsea won back-to-back Premier League titles, breaking several clean-sheet records along the way.\nAmong the very best of a new generation of stoppers who were equally adept at making saves, dominating their box and using their feet, he won two more Premier League titles and every other major domestic and European trophy going before joining Arsenal in the swansong of his career. Cech just edges out the legendary Peter Bonetti, who played nearly 500 times for the Blues in his esteemed playing days.\n6. Gianfranco Zola (1996-2003)\nIf Ruud Gullit was Chelsea’s most important signing – indeed, the catalyst for them eventually becoming a global superpower – then the Dutchman’s own first signing, on being made player-manager in the summer of 1996, was their most popular.\nZola won two FA Cups, a League Cup and a Cup-Winners’ Cup with the Blues, but, more than that, he was a rare combination of genius and gent, loved by his own fans and admired by everybody else’s. The diminutive Italian represents everything good about Chelsea pre-Abrahamovic takeover, providing plenty of flair for fans to get excited about on a weekly basis.\n5. Roy Bentley (1948-56)\nBristol-born Bentley only moved south from Newcastle on medical advice in a bid to cure a lung problem, and at first struggled to fill the boots of Tommy Lawton. But after finding his home as deep-lying striker, Bentley became the model of consistency, his powerful shot and aerial prowess enabling him to break double figures for eight straight seasons.\nBentley found the net 21 times in the 1954/55 campaign – including twice against rivals Wolves – when he captained Chelsea to their first-ever trophy, the league title. Having scored 150 goals in 367 appearances, Bentley is Chelsea's fifth joint-top goalscorer, an incredible achievement for someone who only spent eight years in west London.\n4. Didier Drogba (2004-12, 2014-15)\nFor that 2012 Champions League final display against Bayern Munich, where he scored a bullet header and then later the winning penalty in the shootout, Drogba would make this list. However, he achieved so much more at Stamford Bridge, winning trophies aplenty across his two spells at the club.\nArriving relatively late to the big time at 26, his mix of pace, power and goalscoring ability made Drogba near-unplayable at time during his Blues pomp, and he had a knack for scoring cup-final goals. His induction to the Premier League Hall of Fame in 2022 was just reward for the Ivorian's imperious time bullying defenders and clinically finding the back of the net with all manner of finishes.\n3. Peter Osgood (1964-74)\nFrom amateur legend Vivian Woodward and pre-war stars Hughie Gallacher and Tommy Lawton, to Kerry Dixon in the ’80s and more recently Drogba and Diego Costa, Chelsea’s history is littered with fine centre-forwards. None, however, were as iconic as the ‘King of Stamford Bridge’, whose statue stands outside the West Stand.\nTall yet skilful, ‘Ossie’ played a key role in two Chelsea triumphs; scoring in every round on the way to lifting the FA Cup in 1970, and finding the net in both games of the final a year later as the Blues won the European Cup-Winners’ Cup.\nOsgood was resilient, too, proved by his return from a broken leg in 1967 where he adapted his game to become a central midfield player. Such was his quality, he lasted seven more years at Stamford Bridge until he left for Southampton in 1974. A true Chelsea legend.\n2. Frank Lampard (2001-14)\nPerhaps there's an argument to be made for Frank to pip top spot, but, regardless, Lampard was exceptional during his 13 years at Chelsea. An £11 million signing from West Ham, where his time was overshadowed by accusations of nepotism and taunts about his weight, Lampard proved his class and professionalism over the next trophy-laden seasons at Stamford Bridge.\nPossessed of a high IQ on and off the field, Lampard was everything a modern midfielder should be, but it was his goalscoring ability that stood out. He comfortably broke double figures for 10 straight seasons, scoring 20-plus in five of those, and passed Bobby Tambling’s all-time club record in May 2013.\nIndeed, 211 goals in 648 appearances is some return for a midfielder, let alone one playing in some of the biggest games in world football on a regular basis.\n1. John Terry (1998-2017)\nFew can question the consistency and quality of Terry's defending over the near 20 years he spent with Chelsea, the majority of which he led as captain. His leadership regularly inspired others to up their game, while his distribution from central defence was certainly underrated.\nHe's also the best-scoring defender in Chelsea's history, bagging a remarkable 67 times across 717 games for the Blues. It's not too surprising, though, considering his determination to win every single ball that came into either box. Lifting 14 trophies as skipper certainly doesn't harm his playing image either, including the Champions League and five Premier League titles.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 1612,
  "scraped_at": "2026-02-14T01:50:37.781809",
  "_text_extracted": true
}