{
  "article_id": "f06d9bf5a47a",
  "url": "https://www.fourfourtwo.com/features/ansu-fati-was-seen-as-messis-heir-so-why-have-barcelona-loaned-him-to-brighton",
  "title": "Ansu Fati was seen as Messi heir , so why have Barcelona loaned him to Brighton ? ",
  "date": "20230901T193000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ansu Fati was seen as Messi's heir, so why have Barcelona loaned him to Brighton?\nThe 20-year-old forward has moved to the Seagulls on a season-long deal after a few difficult seasons at the Catalan club\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nFrom Barcelona to Brighton: Ansu Fati has swapped the Blaugrana for the Seagulls in a surprise season-long deal which will see the young forward attempt to rebuild his reputation on the south coast of England.\nNot long ago, such a move would have been unthinkable. Fati burst onto the scene at Barcelona as a talented 16-year-old and such was his impact, he was considered an heir to Lionel Messi at the Catalan club.\nAway to Osasuna on August 31, 2019, Ansu became the youngest player in Barcelona's history to score in LaLiga. At 16 years and 304 days.\nTwo weeks after that, he became the youngest player to score and assist in a LaLiga game as Barcelona beat Valencia 5-2 at Camp Nou.\nLater in the season, he then became the youngest Barcelona player to score twice in a LaLiga fixture. More records soon followed as he became the youngest goalscorer for any club in the Champions League and also the youngest to net for Spain.\nThat season finished with 33 appearances and eight goals and in the summer, he was officially promoted to the first team.\nBut everything changed in November 2020. After a promising start to the season which saw him score five goals in 10 appearances, Fati was struck down with a serious knee problem in a game against Real Betis.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nInitially expected to be out for four months, he was ultimately sidelined for the remainder of the campaign.\nFollowing around 11 months out altogether, he returned in the number 10 shirt recently vacated by Lionel Messi and scored a super goal against Levante. He was hailed as an heir to the Argentine and the future of Barça, but again it was short-lived as he was restricted by injuries and went on to make just 15 appearances, scoring six goals in 2021-22.\nLast season was much improved under Xavi as Ansu stayed fit and hit 10 goals in 51 games for Barcelona, but only 14 of those came as a starter.\nAlthough he has avoided serious injury in recent times, Fati has not hit the heights from earlier on in his career. There are signs that he is slowly getting back to form, perhaps trusting his body again, but Barça cannot guarantee him his place in the team at the moment and he has therefore decided to move away on loan.\nAnsu is under contract at Barcelona until 2027 and Brighton have no option to buy the Spain attacker, who will return to the Catalan capital after this loan spell at the Amex ends next summer.\nWhy Brighton and not Tottenham?\nTottenham were pushing hard for Ansu Fati's signature in a season-long loan and Spurs are a bigger club than Brighton. So why did the 20-year-old opt for the Seagulls over the north London club?\nFati is thought to have favoured a move to Brighton because of the club's outstanding record with young players over the past few years, which has seen some of those enhance their reputations, become big stars and make big-money moves to top teams.\nRoberto De Zerbi's attacking style of play was also understood to be a consideration, with a phone call from the Italian manager said to be have convinced Fati that the Seagulls were the right fit for him.\nBrighton have a smaller squad than Spurs and also European football, which means more games and more possible appearances. Tottenham are not in Europe this season and are also already out of the Carabao Cup, meaning there are likely to be more opportunities for Fati at the Amex than in north London.\nMore Barcelona and Lionel Messi stories\nIn FourFourTwo's season preview, we ask whether Barcelona or Real Madrid will win the La Liga title this term.\nBroadcaster Jules Breach, meanwhile, looks at Messi Mania making its mark in Miami, with the Argentine set to break records at his new club.\nNow that Messi is playing in America, is it time to take MLS seriously?\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 906,
  "scraped_at": "2026-02-14T01:50:52.138108",
  "_text_extracted": true
}