{
  "article_id": "f0711471efb7",
  "url": "https://www.uefa.com/uefachampionsleague/news/0284-18c96679e324-08f5ecb58dbb-1000--squad-registration-in-depth/",
  "title": "Champions League group stage squads , player registration deadlines : All you need to know | UEFA Champions League",
  "date": "20230821T084500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League group stage squads, player registration deadlines: All you need to know\nThursday, August 31, 2023\nArticle summary\nHow many players can a club register, when is the deadline and what changes can they make? All you need to know about the 2023/24 UEFA Champions League group stage squads.\nArticle top media content\nArticle body\nThe squads for the 32 UEFA Champions League group contenders must be submitted by 24:00 CET on Monday 4 September: we explain the rules.\nWhen do clubs submit their squads?\nEvery club must submit two lists of players, including details such as shirt number, date of birth and nationality. In addition, the lists must include confirmation by the club's doctor that all players have undergone the requested medical examination. List A needs to be submitted to the relevant association to be verified, validated and forwarded to UEFA by 24:00 CET on Monday 4 September. The same process applies to List B (more details below), which must be submitted no later than 24:00 CET the day before each match.\nWhen does the transfer window close?\nDomestic transfer windows involving clubs in the Champions League group stage vary by nation. However, all clubs have to register their Champions League squads by 24:00 CET on 4 September and any subsequent transfers will not be eligible for the group stage.\nCan clubs include players who were fielded in qualifying for the UEFA Champions League or in either of the other men's club competitions?\nYes. A player who has been fielded in the preliminary round, or in the first, second or third qualifying round, or in the play-offs of the Champions League, UEFA Europa League or UEFA Europa Conference League, is entitled to play in the Champions League, Europa League or Europa Conference League for another club as from the group stage.\nPlay-off winners\nThe six teams that qualify from the play-offs do not have to use the same squad in the group stage. Indeed, after each qualifying round, clubs are permitted to submit a completely new squad.\nWho can be on List A?\nNo club can have more than 25 players on List A during the season, of whom at least two must be goalkeepers.\nAs a minimum, eight of those 25 places are reserved exclusively for 'locally trained players' and no club may have more than four 'association-trained players' listed among those eight places. If a club have fewer than eight locally trained players in their squad, then the maximum number of players on List A is reduced accordingly.\nWhat's a 'locally trained player'?\nThere are two categories:\n1. Club-trained players who were on a club's books for three entire seasons (i.e. the period between the first and last official match of the relevant national championship) or 36 months between the ages of 15 and 21.\n2. Association-trained players who were on another club's books in the same association for three entire seasons (i.e. the period between the first and last official match of the relevant national championship) or 36 months between the ages of 15 and 21.\nWhat is List B?\nA player may be registered on List B if he is born on, or after, 1 January 2002 and has been eligible to play for the club concerned for any uninterrupted period of two years since his 15th birthday by the time he is registered with UEFA – or for a total of three consecutive years with a maximum of one loan period to a club from the same association for a period not longer than one year. Players aged 16 may be submitted if they have been registered with the club for the previous two years without interruption.\nEach club must include at least two goalkeepers on List A and at least three in total (List A and List B combined).\nClubs are entitled to register an unlimited number of players on List B during the season, but the list needs to be submitted no later than 24:00 CET the day before a match.\nCan clubs change their squads again this season?\nYes, if they get through to the knockout stage. Ahead of the round of 16, clubs can register a maximum of three new players by 24:00 CET on 2 February 2024.\nAny or all of the players from the above quota of three may have been fielded for another club in the qualifying phase, play-offs or group stage of the Champions League, Europa League or Europa Conference League.\nThe overall limit of 25 players on List A remains, though, along with the quota of eight locally-trained players.\nIs that it?\nNot necessarily. If a club cannot count on the services of at least two goalkeepers registered on List A because of long-term injury or illness (i.e. one that lasts 30 days), a club can temporarily replace him at any time during the season.",
  "word_count": 811,
  "scraped_at": "2026-02-14T01:56:26.908879",
  "_text_extracted": true
}