{
  "article_id": "f0839a89086b",
  "url": "https://www.goal.com/en-us/lists/wayne-rooney-takes-wife-coleen-and-children-on-barbados-new-years-holiday-with-three-ex-man-utd-team-mates/bltef2da8ddd801de80",
  "title": "Wayne Rooney takes wife Coleen and children on Barbados New Year holiday with three ex - Man Utd team - mates",
  "date": "20260101T021500Z",
  "domain": "goal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Presented byDrink responsibly. Modelo Especial® Beer. Imported by Crown Imports, Chicago, IL For 21+\nGetty/GOAL/IG:coleen_rooney\nWayne Rooney takes wife Coleen and children on Barbados New Year's holiday with three ex-Man Utd team-mates\nManchester United legend Wayne Rooney and wife Coleen have swapped the bitter British weather for Barbados for New Year's. The ex-England international and his family were spotted on the idyllic island with Rooney's former United team-mates Michael Carrick, Jonny Evans and Darron Gibson as the quartet and their families jetted abroad for some much-needed Vitamin D.\nKai the attraction during Rooney family getaway\nThe Rooney family were pictured enjoying a beach day in the Caribbean after jetting off to take in some sun. With average highs of around 29°C, the former United star is looking to ring in the New Year in style.\nWhile Wayne is the icon in the Rooney family, it was son Kai who proved a hit while abroad and even challenged Evans to a race on the sand, according to The Sun. The 16-year-old is hoping to follow in his father's footsteps and play for Manchester United, with the teenager currently on the books with the U18s at Old Trafford.\nResponding to a question from The Talent Hunter on Instagram on where he hopes to be in five years, Kai replied: \"Playing on the biggest stage amongst the best players, winning trophies.\"\nKai Rooney made his debut for the U18s against Everton in August, before scoring off the bench in the following game, a 5-0 win over Middlesbrough at Carrington. Injury did sideline the forward for a few months, but he recently returned to action for Darren Fletcher's side.\nAcademy players 'deserved' chance, says Amorim\nRooney will hope to follow in the footsteps of the likes of Jack Fletcher and Shea Lacey, who have recently earned their senior debuts for an injury hit United side. Red Devils boss Ruben Amorim spoke extensively about the prospects for academy players following their 1-0 win over Newcastle on Boxing Day.\n\"We have a squad and I try to choose the best players to play. I understand the history of the club. I want to be part of that. Sometimes, you just need to choose the best players to win. Today was the opposite of many games; we put players of the academy in because we had to do it, and they deserved it,\" Amorim said.\nAnd on Fletcher, who is the son of U18 United boss Darren, Amorim added: \"It's very important for any kid. He is going to hear from his father already. I know Darren is going to talk about a lot of things, but he needs to back up, calm down, and just praise the kid because he's really humble. He works really hard and deserves this.\"\nUnited, though, were unable to follow up their win over the Magpies with another victory as they were held to a 1-1 draw by table footers Wolves on Tuesday night at Old Trafford.\nLooking for smarter football bets? Get expert previews, data-driven predictions & winning insights with GOAL Tips on Telegram. Join our growing community now!\n- Instagram (@kairooney.10)\nRooney on Kai's development\nRooney senior has previously spoken highly about Kai. While watching him play at the SuperCupNI tournament in Northern Ireland, the former striker told the BBC: \"He has great coaches at Manchester United, so I take a stand-off approach. I speak to him, but for me it's all about his mentality and his mindset, to make sure he keeps enjoying it - that's the main thing for me.\"\nWhile Rooney has spoken warmly of his son, he'll hope to one day return to club management in the future. The 40-year-old, who has been a pundit on Match of the Day this season, has been out of work since leaving his role at Plymouth last year.\n- Getty Images Sport\nRooney will find it 'hard' to switch back to coaching\nHowever another former team-mate has suggested it won't be an \"easy\" road to get back into management. Earlier in the year, Louis Saha said of Rooney: \"Wayne Rooney has some great views to share to the public, I think previously his target has been to be on the bench coaching a good team which hasn’t really worked out.\n\"I think he can do a great job but it will be hard to switch back, we saw that with Roy Keane and Gary Neville, they wanted to be managers but realised it’s not that easy.\n\"Gary Neville found out that he was better as a pundit than a coach, so we will see.\"\nAdvertisement",
  "word_count": 767,
  "scraped_at": "2026-02-14T02:03:26.503010",
  "_text_extracted": true
}