{
  "article_id": "f08bf2905303",
  "url": "https://www.dutchnews.nl/2025/12/ajax-face-heavy-fine-after-fireworks-force-match-to-be-abandoned/",
  "title": "Ajax face heavy fine after fireworks force match to be abandoned",
  "date": "20251201T110000Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ajax face heavy fine after fireworks force match to be abandoned\nAjax’s Eredivisie match against Groningen was abandoned amid chaotic scenes after just five minutes of football after supporters let off tonnes of fireworks in the Johan Cruyff arena.\nThe fireworks began in the fifth minute of Sunday’s game as a tribute to a member of the club’s hard-core F-side contingent, forcing referee Bas Nijhuis to suspend the game and take the players off the field.\nThe referee tried to restart the match once the smoke had dispersed three-quarters of an hour later, only for the fireworks to start again almost immediately.\nNijhuis again suspended play and shortly afterwards confirmed the match had been abandoned after consulting with city mayor Femke Halsema.\nAjax later said the match would be finished on Tuesday afternoon behind closed doors. The club will also face sanctions from the Dutch football association KNVB, including a hefty fine.\nThe club has also banned the F-side from the home match against Feyenoord on December 14. Stands 125 to 129, where the hardcore fans congregate, will be empty.\n“I don’t want to have it on my conscience that I compromised the players’ safety,” Nijhuis told ESPN after halting the match for the second time. “But the mayor has the final say because things were happening outside the stadium.\n“Insanity”\n“The club can’t do anything about it, but I hope that they have the guts to get tough with these people. It’s time to take action, because this is insanity.”\nMarketing director Menno Geleen said the fans had got fireworks into the stadium by forcing an emergency exit. “A large group of people without tickets but with a large quantity of fireworks made their way in. We are currently working to identify these people,” he said.\nAjax released a statement condemning the events in the stadium as “utterly scandalous”. “We apologies to everyone who was disrupted by this in any way,” the club said.\nAjax vindt het ronduit schandalig wat vanavond in het stadion is gebeurd. Wij bieden onze excuses aan, aan eenieder die hierdoor op welke wijze dan ook gedupeerd is. De veiligheid van toeschouwers en spelers is in gevaar gebracht. Dat is onacceptabel. Wij nemen nadrukkelijk… pic.twitter.com/G57vimgQy3\n— AFC Ajax (@AFCAjax) November 30, 2025\n“The safety of spectators and players was endangered. That is unacceptable. We explicitly reject this appalling behaviour. Fireworks have no place in our stadium.”\nTwo years ago Ajax were fined €25,000 and the F-side fans were banned from a home game after the match against Feyenoord had to be abandoned when plastic cups, flares and other items were hurled onto the pitch.\nThe KNVB’s investigation is another headache for the crisis-hit club, who sacked manager John Heitinga three weeks ago after losing their first five Champions League matches.\nSince then they have sunk to sixth place in the Eredivisie, level on points with Groningen, after winning just one of their last six league matches.\nAjax are also looking for a technical director after Alex Kroes confirmed he would be leaving at the end of the season, or earlier if a replacement can be found.\nLast week Ajax confirmed talks were being held with Jordi Cruyff after he was spotted meeting club executives in Barcelona.\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 597,
  "scraped_at": "2026-02-14T01:49:57.607322",
  "_text_extracted": true
}