{
  "article_id": "f0a62e2a7cdc",
  "url": "https://www.arsenal.com/news/every-word-artetas-pre-newcastle-presser-0",
  "title": "Every word from Arteta pre - Newcastle presser",
  "date": "20250106T210000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The day before semi-final cup football returns to Emirates Stadium, Mikel Arteta was at the Sobha Realty Training Centre fielding questions from the media ahead of our Carabao Cup semi-final first leg against Newcastle United.\nHe gave an update on the wellbeing of the squad and the latest fitness issues, his thoughts on the Magpies and the January transfer window.\nHere is everything he had to say:\non Ethan Nwaneri’s injury:\nUnfortunately he’s picked up an injury and is going to be out for a few weeks.\non the type of injury:\nIt’s a muscular injury.\non if Kai Havertz will be back for Newcastle:\nI hope so but I don’t want to say yes because last time I said I thought he was going to be fit and he wasn’t fit.\non if there are issues with illness:\nYes.\non if we could be missing other players:\nHopefully not.\non how much importance he places on the semi-final:\nWe’re very excited to play the game in front of our crowd. A semi-final, an opportunity to earn the right to be in a final and that starts tomorrow with two legs. Obviously they’re going to be two long games against a very competitive team, we know that, but very excited and we need a big, big atmosphere in our stadium.\non what winning the competition would do for the squad:\nI don’t know, we have to win tomorrow. There is still far to go, so we have to try to be better than the opposition and win the game.\non how to stop Alexander Isak:\nHe’s a top player in top form scoring a lot of goals and we try to minimise the strength of the opposition. That’s a big part of the plan when we’re playing any opponent.\non Newcastle’s midfield:\nI think about my players, the ones that we have available and how to get the best out of them.\non the Brighton penalty on the weekend:\nI gave my opinion. Unfortunately we played twice against Brighton, one for another reason for 45 minutes with 10 men, another with a penalty that clearly is not a penalty. But those are the conditions that we played in and we cannot change it now.\non if there’s any chance to add to the squad before the end of January:\nThat hasn’t changed - again the focus is our players. Whatever is in the market, we’re very alert, but the priority is working with the players that we have at the moment and tomorrow night, which is a big night for us. It’s not a yes, it’s not a no!\non if the semi-final should be one game:\nIt doesn’t matter, there are two beautiful games to play. My opinion doesn’t count unfortunately, so if I have pick, it would be one and at home. If you gave me the chance, that’s what I would like!\non what Eddie Howe has done differently recently:\nI don’t know, that’s a question for him. They’re a tough opponent for everybody because they’re a really good side, they’re really well coached, they have really good individual players. The same as it’s difficult to play against us.\non being able to hear the VAR in the stadium during the semi-finals:\nAny decision that brings clarity and communication that is clear and transparent, I think it’s helpful.\non how hard it is to coach players on what the laws of the game are now:\nWork by the rules and try to coach them, and then if it’s a part of those rules, it’s the interpretation and it’s not easy for the referees to make that call. We understand that and coaching differently, I think it’s impossible.\non if it’s not easy for him:\nSometimes it is for coaching because we don’t coach any players to have the arms away from their body or just to keep the ball when the opponent is away from you, it’s very difficult to coach that. I think it’s difficult for everyone.\non if he’s enjoyed this season:\nI love it. We are in all the competitions; we are where we want to be in most of them. Obviously, in the league for a lot of circumstances, we are not where we want to be which is top, I understand that. That willingness to be better every single day to try to improve and not look for excuses because in anything that you do, you look for excuses, you are going to find them. These are challenges, these are situations that we are facing, and we are trying to do the very best to overcome them and still be a really good team.\non how the players are feeling:\nWe discussed the situation and the fact that we have to use players in positions that they probably haven’t played in before. We are learning a lot from that and what I learn especially is the willingness of the team; you speak to any individual and ask him to play anywhere on the field and they say: ‘I’m there’. That’s great as well to learn from your players.\non Kieran Tierney:\nThere is absolutely no news, Kieran is our player.\non how hard it’s been tactically trying to come up with solutions to problems:\nIt’s a good learning process, not only tactically but also preparation and training with very few players. Today we had seven or eight players with us just to fill the squad which isn’t normal but it’s a weird way to learn, but I’ll take it. I cannot change it so let’s take the things that we can get out of it to be better.\non Mikel Merino’s adaptation to the team:\nI think in the last two weeks he’s made a big stride, obviously he’s had more minutes, physically he’s in a much better place. He missed the whole pre-season and then he missed a lot of weeks with an injury and you can tell that he’s growing.\non how a two-legged tie with the away leg last changes things:\nIt’s similar to the Champions League but the aim is always to win the game, be better than the opposition and earn the right to win the game. That’s not going to change because we’ve had a lot of games.\non having to be reactive in the January window and lowering our expectations:\nHopefully not because we set very high standards and we really want to only have players here that are coming from our academy or we have to sign players to really elevate and impact the team, otherwise just bringing in bodies doesn’t help us.\non hoping the Emirates atmosphere can affect the opposition:\nI admire the Emirates the most - 100%. The way we can feel at the Emirates with our people is incredible and I’m very positive that tomorrow we’re going to create a big one against really good opposition in the semi-final of the cup that we want to win, so let’s go for it.\non whether it was a mistake not to have a winter break this year:\nCertainly it would have helped every team and especially the players because we’re putting more games on them on the back of two seasons that have been really high in terms of numbers. We knew from the start that if you are in every competition you’re not going to have that break, and that’s how we’ve prepared as well.\non whether it’s impossible for our players to play every minute with our style:\nSometimes it’s credit to the opposition as well because it can be extremely demanding and the way we play as well, when you have less players and less capacity to rotate, it becomes more difficult, but the idea and the aim is to be able to sustain that.\non how Ethan is doing:\nHe didn’t really know, he said: “I’m feeling something but I don’t really know, what is it?” He has earned the right to step up and play for us and now he starts to have some games, some big games as well, and impact those games which he’s done in different positions as well, so I’m gutted for him because it’s going to stop that a little bit. But it’s another step in that development phase that he’s in, but I’m really happy with the way he is going.\non when Raheem Sterling will be back:\nHopefully very soon.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1438,
  "scraped_at": "2026-02-14T02:02:19.853943",
  "_text_extracted": true
}