{
  "article_id": "f0ff64db63d6",
  "url": "https://www.arsenal.com/news/every-word-mikel-artetas-pre-man-utd-presser-0",
  "title": "Every word from Mikel Arteta pre - Man Utd presser",
  "date": "20250110T200000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With our FA Cup quest getting underway on Sunday against Manchester United, Mikel Arteta held his pre-match press conference 48 hours the game at the Sobha Realty Training Centre.\nThe boss was asked what he's made of United under Ruben Amorim, whether he'll be recruiting in the January window and the No More Red campaign, which will see us don our all-white kit again to help keep young people safe from knife crime and youth violence.\nHere is everything he had to say:\non the importance of the FA Cup for us this season:\nIt’s a massive part of our history, we’ve won it 14 times and it is a competition very attached to us. It’s a beautiful game to play against a massive club, and a very special occasion as well with the amount supporters that they're going to bring, so it’s a very big game.\non whether his final win in 2020 was his best day in management:\nThe memory of winning something and celebrating and sharing it with your people is the ultimate goal. I will never forget the process and the people that you meet, but overall I have great memories about the competition.\non what he’s made of Ruben Amorim at United so far:\nWhen you look especially at the big teams [they’ve played], how they perform and the results that they’ve got, it’s very impressive. I know him well, I followed him a lot when he was in Portugal and there is a big reason why he is where he is at the moment, and he deserves to be there.\non the difficulty of turning a club’s fortunes around mid-season:\nEvery manager when he is appointed is for a reason, but the reasons can be different. Sometimes it’s just to improve a football team and get more performance out of certain players, sometimes it’s to transform to the football club. That's a totally different dimension of a job, and if I have to relate to mine at that time, it was more towards that than the previous one I mentioned.\non the profile of player he looks to recruit in the January window:\nFirst of all, someone that can impact the team, bringing in bodies doesn't help us all. It’s just about somebody who can immediately impact our performance and can bring something that we don't have. To find that in this market is very difficult to achieve.\non how he’ll get more out of the players to improve our cutting edge:\nIf you look at a sample of a game or two or three, that’s a very small sample. You cannot use that, we don’t use any short samples because they don't correlate to team performance when you look at a year or two, and the team performance, scores, the amount of players that are involved. There is no discussion that we have to focus on our players.\non whether there are discussions about recruitment:\nWe always have discussions with the ones above about how we can improve the team, whether the market is open or closed because you have to plan for what the necessities are right now. and what they could be in a month. Those discussions are always open.\non if a forward is a priority area:\nNo, the circumstances change because we have certain injuries for some big players, so it's always a possibility but always it’s about somebody that is really going to make us much better.\non the FA Cup ball:\nMaybe it will make a good difference! We adapt in the Champions League as it’s different. If you’re relating to the question I got the other day about the ball and what I said, every ball is different. The Champions League ball is different, different grip, different flight, different feeling, that’s it. It’s not an excuse, it’s a reality. Every pitch is different, the weather conditions are changing in football, that’s the beauty of it. That’s it, we adapt to that, and I never use it as an excuse.\non the importance of wearing the NMR shirt on Sunday:\nIt’s great because we have so many people who put in so much effort, putting their lives to try to improve the quality in so many people’s lives, creating safe spaces, safe environments. When we get an opportunity to raise that in such a big occasion, we have to do it. Well done to the club, well done to everybody that is participating in that because they put so much effort into it and the impact is huge.\non Manchester United having 8,000 fans on Sunday:\nWe have to be noisier, more on the front foot, certainly [more] than them. It’s a special occasion to create that atmosphere, I think it’s a beautiful football atmosphere, so let’s make it our own.\non if playing in a different kit changes preparation:\nIt does change, it’s not something that we are used to. I think it’s for the right reason, the right motive and let’s use it in the right way.\non Neto making a big contribution off the field:\nThat’s always for the players who have not played many minutes, in his case as well because he was cup-tied in the Carabao Cup and David [Raya] has done so well. We will decide [if he plays] what’s the best option because historically the cup competitions have changed a lot. When you look at last week, the line-ups years ago were completely different, so everybody has to be available and ready to play.\non if our form in front of goal is cause for concern:\nWe’re the team that has scored the most goals in the calendar year in the Premier League, so that can’t be a problem.\non Martin Odegaard’s goalscoring return this season:\nThere are moments sometimes and probably sustaining [his form over the past couple of seasons], and that’s again when you go to probability and when you go samples. Sustaining an attacking midfielder to score 15 goals maybe two years ago, it doesn’t happen. It hasn’t happened in 15 years, so we were very aware of that on the other side of the coin. So, he’s trying very hard; he had some big chances, we missed some opportunities. Just help him and make sure that he’s confident to take the shots when he needs to because he’s so good at it.\non if we’ve been reliant on Bukayo Saka and Odegaard playing together:\nIt can be an element of that. Martin] came back from an injury and in the first week or two, you have that extra energy and then you play every three days. He was ill as well for over a week and then plays a part, so there’s a lot of circumstances. Obviously, it’s inevitable to think when you have such a chemistry with a player and you’re not together next to each other, you’re going to notice that something is different.\non Odegaard adjusting to playing without Saka:\nIt can be an element of that. Obviously, he’s come from an injury and first maybe week or two you have that extra energy and then you play every three days. He was ill as well for over a week, so that plays a part. A lot of circumstances but obviously, it’s inevitable to think when you have such a chemistry with a player and you’re not together next to each other, then you will notice something that is different.\non whether he would like a versatile forward:\nIn the front positions, compared to what other clubs have done and the expenditure that we have there, we are very far from it, over the years, for different reasons. Firstly that we have already have very good players and we have many necessities in the squad to achieve in that period.\non the focus on his squad building shifting from defence:\nYes, it will because we have certain limitations and we have a lot of gaps and a lot of things to cover to become the team that we want and then the ability of those players - can you afford them, even if you want to. Sometimes, it’s not been possible.\non winning the FA Cup in 2020:\nI was so happy and proud because it was a really tough period, emotionally as well. To take my first managerial job in the middle of the season, then go home for two-and-a-half months, then start competing again in those circumstances, it was tricky. But I was so happy with the result, it was a long time ago that we didn’t win a trophy as well and just want to replicate the same but, sharing it with other people.\non the motivation to win a trophy in front of fans:\nThat’s what we want. Some taste is not the same like when we won the Community Shield a few times but, we want the big ones and we want the big ones in front of our fans.\non implementing his own style when he first joined without many training sessions:\nRuben [Amorim] has much more experience than I had at the time. So he’s in a place and it’s not Covid so I think he’s got better options in that case. It is tough because you need time to generate ideas, especially your way of playing and explaining that and when you have that many games, it’s tricky, so I understand.\non noticing any differences in Man United when they played Liverpool:\nIt’s true they played a little bit differently, with the personnel that they used, the location of certain players. The characteristics of the players that they had dictate what they do, where they are, have more threat on both sides, to feet and in behind because in the end that’s what determines the behaviours of a team. It is different the last few weeks to when we played them here at home so I’m expecting a few different things.\non Ian Wright’s comments on needing help from the board to score goals:\nI have so much support from the board, and I continue to have it and we are all sitting and willing to do the same; just to win the maximum amount of football matches in the way that we want to play, and achieve ultimately the goals that we want to achieve which is to win trophies. That support to continues to be there.\non people always telling him what he needs to do:\nThat’s their job, to have an opinion and to present them. For me, it’s not a problem at all.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1799,
  "scraped_at": "2026-02-14T02:02:19.852375",
  "_text_extracted": true
}