{
  "article_id": "f11f4057bd12",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/good-morning-britain-apologises-after-28364169",
  "title": "ITV Good Morning Britain apologises after using footage of Liverpool supporters for  ticketless fan segment",
  "date": "20231229T184500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ITV Good Morning Britain apologises after using footage of Liverpool supporters for 'ticketless fans' segment\nLiverpool fans were exonerated in multiple reports, with false claims by the French authorities quashed\nGood Morning Britain (GMB) has apologised after the programme used footage of Liverpool supporters attending the disastrously-mismanaged 2022 Champions League final for a \"ticketless fans\" segment.\nThe ITV programme featured a segment this morning, Friday, December 29 on the Department of Culture, Media and Sport (DCMS) committee's recommendation to punish ticketless fans forcing entry to football stadiums. The recommendation came in response to the unrest during England's Euro 2020 match v Italy at Wembley, where it was estimated 2,000 fans stormed the stadium without tickets.\nThe committee's chair, Dame Caroline Dineage, said: \"Tailgating and other forms of unauthorised entry into grounds are an increasing problem at high-profile matches, putting safety at risk from overcrowding. Those involved should know that they will face consequences and the government should back legislation to ensure they can be banned.\"\nREAD MORE: Teacher who began inappropriate relationship with pupil at prestigious Liverpool school banned\nREAD MORE: Try Liverpool Echo Premium for 99p with no ads, fun puzzles and brilliant new features\nHowever, in a segment titled \"Tailgating 'rising problem' at matches\", GMB used footage of Liverpool fans outside the Stade de France in Paris during the Champions League final in May 2022. The match v Real Madrid was marred by a number of organisational failures from UEFA and the French authorities.\nThe ECHO has reported extensively on the chaos and heard from multiple fans who described being tear gassed by police, denied access to the stadium despite having valid tickets, and being attacked and robbed by locals in the Saint Denis region of Paris. A French Senate report released in July of last year found French authorities had \"stereotyped\" and labelled LFC fans as \"hooligans\".\nIn the days following the match, French Interior Minister Gérald Darmanin falsely claimed \"30-40,000 fake tickets\" were in circulation by LFC fans. Over 1,000 fans caught in the crush outside the stadium are currently bringing a group legal claim against UEFA on the basis the governing authority failed to ensure a safe and secure environment for those attending.\nThe same DCMS committee report suggested the French police's treatment of Liverpool fans was \"disgraceful\", and attitudes towards British football fans heavily contributed to the chaotic scenes that saw 238 people injured.\nThe footage used in the GMB segment showed Liverpool fans holding up tickets and standing behind a fence while being sprayed with tear gas. The presenter's voiceover while the footage was shown referenced \"the disorder of Euro 2020\".\nThe segment was criticised by Liverpool fans following its publication. Liverpool FC YouTuber Courtney Neary posted: \"GMB going on about ticketless fans...especially mentioning the Euros final at Wembley...yet using images of Liverpool fans at Paris which was confirmed to be an issue with policing and the venue, not ticketless fans.\"\nJournalist Tom Dunn, who has extensively covered the events surrounding the Paris final, added: \"Using images of Liverpool fans who were beaten and gassed by police when they had valid tickets for a match for a piece about tailgating at football is just another lazy example of some in national media who hold certain opinions about people from Liverpool.\"\nThe Hillsborough Survivors Support Alliance (HSA), who campaign for Hillsborough survivors and their families, added: \"GMB, you need to issue an apology. Using images of Liverpool fans and talking about ticketless fans. Ticketless fans were not the issue in Paris.\"\nResponding to the complaints, a spokesperson for Good Morning Britain said: \"We are aware of this error where incorrect footage featured during our 8am news bulletin broadcast today and plan to address this on our next GMB programme airing next Tuesday.\n\"The previous longer versions of this package at 6am and 7am aired correctly but the later report was truncated resulting in the image error. We of course apologise for any confusion from this unintentional error.\"\nThe ECHO understands the error has since been removed from ITV's catch up service.",
  "word_count": 677,
  "scraped_at": "2026-02-14T01:48:34.022183",
  "_text_extracted": true
}