{
  "article_id": "f12267a5956f",
  "url": "https://www.hexham-courant.co.uk/news/25386397.legal-challenge-newcastle-st-james-stacks-stay-til-2031/",
  "title": "Legal challenge against Newcastle St Jame Stack stay til 2031",
  "date": "20250813T120000Z",
  "domain": "hexham-courant.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "An alliance of more than 100 Newcastle bars and pubs has mounted a legal challenge against the Stack fanzone outside St James’ Park.\nBut city centre businesses, uniting under the banner of the newly-formed NE1 Hospitality Group, are now trying to get that decision quashed.\nThey claim that the St James’ Stack, which opened in 2024 and now has approval to keep running until 2031, is endangering the city’s famous nightlife.\nThe group said that soaring footfall at the Stack, throughout the week and not just on Newcastle United matchdays, is taking trade away from other venues and putting jobs “at serious risk” at a time when the hospitality industry is struggling across the nation.\nAn application has been made for a High Court judicial review of the council’s decision to extend the planning permission, which the NE1 Hospitality Group believe is “unlawful”.\nJudicial reviews can only be used to challenge the legality of a planning decision that has been made, not the merits of the application in question.\nA spokesperson for the alliance said on Tuesday: “This isn’t about growth — it’s about displacement. The Fanzone is drawing trade away from the very venues that helped build Newcastle’s reputation for hospitality. We’re not against progress but it must be fair and sustainable.”\nThey added: “Several major venues have already closed this year. Investment is drying up. Jobs are under threat. And the council seems unwilling to listen.\n“This Judicial Review is a last resort, but we cannot allow the voices of local businesses to be drowned out. We intend to seek an order to quash the decision as we have been\nadvised that it is unlawful. However, we would wish to negotiate an outcome acceptable to all which would avoid continuing these proceedings. The sooner that we can do this the better it will be for all concerned, both now and in the long run.”\nPopular Tyneside venues like Prohibition, Leila Lily’s, The Earl of Pitt Street, and Horticulture have already closed their doors this year, as small businesses complain of crippling costs including increases to employers’ national insurance contributions.\nBarry Ladhar, whose Ladhar Group counts Pleased To Meet You and Lady Greys among its portfolio of leisure destinations, said it had seen a drop in takings on matchdays since the Stack opened.\nHe said: “These should be golden days for local hospitality, with Champions League nights and a thriving pre and post football culture — instead, last season showed that trade is being diverted to the fanzone.”\nHospitality bosses are known to be angry that the decision to extend the Stack’s temporary planning permission was made by council officers, rather than being put before elected politicians who sit on the authority’s planning committee.\nTommy Byron, of the Dog and Parrot bar on Clayton Street West, added: “I’m a Geordie through and through and have followed NUFC since I was a bairn. I want to celebrate the club’s success — but right now we’re fighting for survival. We’re asking the council to think long-term, to support the local businesses and communities that make this city unique.”\nVaulkhard Group boss Ollie Vaulkhard, whose venues include the Town Wall and Bridge Tavern pubs, said his business was suffering “a steady erosion of income” and that “growth should benefit the whole city, not just one mega-venue”.\nThere are 175 people employed at Stack, which is built from 56 repurposed shipping containers, and more than 1,400 stage performances have been held there since its launch.\nThe venue welcomed 35,000 patrons during Sam Fender’s concerts at St James’ Park this summer, around a fifth of the total number of people who attended the three gigs.\nNewcastle City Council said that it wanted to “work with businesses to ensure Newcastle continues to thrive as a hub for hospitality”.\nA spokesperson added: “We understand that recent years have been difficult for businesses, in hospitality and elsewhere, both here and in other towns and cities across the country. While we have seen some operators sadly close their doors, other new businesses have opened in Newcastle and are flourishing, adding to the offer in the city centre and beyond.\n“We had agreed to meet a number of businesses who had raised concerns around pressures on the hospitality industry, we recognise the concerns and want to work together. Prior to that meeting taking place we became aware that some of those businesses were planning to submit a judicial review to challenge the decision to extend the time limit for the Stack. As a result of these legal proceedings, which we would not be able to address in any meeting, it was postponed.\n“While we understand and recognise the concerns raised, as a council, we cannot regulate competition in the city centre and that would not be grounds to refuse a planning application.”\nBoth Stack and Newcastle United were contacted for a response.",
  "word_count": 813,
  "scraped_at": "2026-02-14T02:11:49.089204",
  "_text_extracted": true
}