{
  "article_id": "f129aa30d20a",
  "url": "https://www.justarsenal.com/justarsenals-euro-2024-predictions-quarter-finals-can-england-cope-with-switzerland/370571",
  "title": "JustArsenal Euro 2024 Predictions - Quarter Finals - Can England cope with Switzerland ? ",
  "date": "20240704T144500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dan’s Euro 2024 Predictions Q-finals\nSpain 1-1 Germany\nPerhaps the two most convincing sides so far?\nSpain have done this before though in competitions. They play free flowing football in the group stages before becoming unstuck in knockout football where they dominate but can’t unlock a defence.\nHence why in their last three major tournaments they have been knocked out on penalties having passed the ball sideways around for 120 minutes.\nThe difference now is they have an alternative. Their plan B (their wingers) have been so good it’s become their plan A.\nYet this is Germany in Germany!\nMost of us grew up with Germany not always having the best players but finding a way to get over the line.\nIf it wasn’t for home advantage, I would pick the visitors, but I can see a tie where they can’t turn possession into goals and get caught cold in extra time or on spot kicks.\nFrance 1-0 Portugal\nIf want to base life on black and white, then no it’s not ideal for Portugal ‘s captain to be crying after missing a penalty when there are still 15 mins of a game left that is 0-0.\nNo, it can’t help the rest of the squad to see their leader upset.\nYet to clarify Ronaldo didn’t break down on purpose. He didn’t decide halfway through extra time to make it about himself so made tears appear.\nWas it unusual? Yes\nBut that’s kind of the point!\nName the most talented players you have ever seen and think how long they spent at the apex of the sport.\nWhat makes Ronaldo and Messi so special is for nearly two decades they have the mentality which is unrivalled.\nHaving won Champions League’s, multiple Balon D’ors, trophies for their countries, become millionaires, where do they find the motivation to care as much as they do?\nYet both are spending their summers on international duty still trying to achieve even more.\nMost players nearly 40 would just be grateful to be in the squad, content to get off the bench for a few minutes to add to their caps.\nFor Ronaldo, he’s desperate to be the only man to score in 6 European Championships and for every chance he missed against Slovenia, I think he knew his best chance of that happening was fading, hence why he got more desperate.\nIs that self-involved?\nOf course.\nYet, take away that aspect of the 39-year old’s personality and you never get all the glorious things he’s done in his career including the only trophy his nation have ever won.\nHe’s the last Portuguese who needs to hold up his hands and apologise.\nI think his thought process was the first few games was a golden opportunity to break his own record.\nNow that it’s a quarter final and the opponents are France, I think his priority won’t be about who scores, but finding anyway to get to the semi-Final.\nPut it this way, he won’t be shooting at free kicks from ridiculous angles against the French like he was doing Monday night.\nFrance incredibly are in the last 8 despite being the only team not to score in open play at Euro 2024.\nBack in his homeland Deschamps continues to be questioned for being too conservative and not getting the best out of his attack.\nWhat he can do is make his team hard to score against. They are yet to concede in open play\nEngland 1-0 Switzerland\nThe biggest compliment I can give Switzerland is England that will have to play better than they have in Germany so far if they want to be in the semifinal.\nI said this before the Italy tie, a lot comes down to if Murat Yakin remains positive or goes back to his conservative self?\nThe longer the game is level neither coach is the type to take chances and risk losing the game.\nI still maintain there is a line between criticism and hysteria. Pundits, especially ex-players, have a duty to not be reactionary.\nI like Gary Neville, but him demanding Southgate make 5 subs at half time last Sunday because his team were trailing 1-0 is what I expect off a YouTuber, not someone getting paid to talk about the sport.\nFor the next 45 mins I had to listen to commentary demanding substitutions.\nIf the English manager had listened, Bellingham and Kane wouldn’t have been on the pitch to score, proving their boss correct to leave his best talent on.\nThere are teams who have won trophies with a solid defence and rely on a moment of magic from an individual.\nLaw of averages though, you’re not going to keep getting away with playing poorly. Eventually that catches up with you.\nNetherlands 2-3 Turkey\nLet’s make it clear, it’s not just England who will be thinking they will never have a better chance to get to the Final.\nBoth of these two nations will feel if they play how they did in the last round they don’t have to fear anyone (including the Three Lions).\nThe Netherlands struggled against Austria in the Group stages and Turkey play a similar style.\nIn my opinion Turkey have been involved in the most entertaining games and Saturday will be another one.\nThey give so much energy though, that if it goes to extra time though the Dutch become the favourites.\nDan\n————————————————\nQ Final\nMe Vs Antivirus\nJRA Vs Jon\nOkobino Vs NOAS\n1 point for correct result\n3 points if Score line is correct (based on 90 mins).\nIf level on points you will be separated on who got the most correct scorelines this round.\nIf still level, you will be separated on the most correct scores in the entire tournament.\nIn the unlikely event things are still even whoever had the most points in the group stages is put through.\nIf all of the above remain identical you will be separated by who finished higher in Just Arsenal’s domestic table",
  "word_count": 1003,
  "scraped_at": "2026-02-14T02:08:01.884882",
  "_text_extracted": true
}