{
  "article_id": "f1384468731c",
  "url": "https://punchng.com/transfer-manchester-city-eye-gyokeres-as-haaland-replacement/",
  "title": "Transfer : Manchester City eye Gyokeres as Haaland replacement",
  "date": "20241024T104500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City is reportedly considering Sporting CP striker Viktor Gyokeres as a potential replacement for Erling Haaland, which could disrupt Arsenal’s transfer plans for the forward.\nA post by Mirror UK on Wednesday noted that Gyokeres, 26, has been linked with a move to the Emirates, but City may swoop in if Haaland departs for Real Madrid.\nHaaland, who joined City from Borussia Dortmund in 2022, has been in sensational form, scoring 101 goals in 109 appearances and helping the club secure two Premier League titles, the FA Cup, and the Champions League.\nHowever, Sky Sports reports that Real Madrid is interested in signing the Norwegian international, with Haaland reportedly keen on a move to Spain. The report also highlights a €150million (£125m) release clause in Haaland’s contract, which runs until 2027.\nDespite City’s efforts to extend Haaland’s contract, talks have stalled, and it is claimed he could join Madrid in 2026. Should this happen, Gyokeres, who has impressed since joining Sporting from Coventry City last year, netting 55 goals in 62 games, is the leading candidate to replace him at the Etihad.\nCity has already initiated contact with Gyokeres’ representatives, and Sporting’s director of football, Hugo Viana, is set to join Manchester City at the end of the season, succeeding the long-serving Txiki Begiristain.\nA club statement read, “Manchester City can confirm that Txiki Begiristain will step away from his full-time role as Director of Football at the end of the 2024/25 season.”\nThe statement added, “Following a trophy-laden twelve years at the Etihad Stadium, Txiki will leave his current post… and will be succeeded by Hugo Viana of Sporting CP. Viana will begin his full-time role in the summer of 2025, but will collaborate with Txiki in the preceding months to ensure a smooth transition.”\nViana, who made 39 Premier League appearances for Newcastle as a player, has been a key figure at Sporting, contributing to their recent success under manager Ruben Amorim.\nHis arrival at City could facilitate Gyokeres’ potential move to Manchester, leaving Arsenal’s pursuit of the striker in jeopardy.",
  "word_count": 344,
  "scraped_at": "2026-02-14T01:57:46.241634",
  "_text_extracted": true
}