{
  "article_id": "f139941c5434",
  "url": "https://metro.co.uk/2023/10/10/euro-2028-uefa-confirm-uk-and-ireland-as-hosts-19636340/",
  "title": "Euro 2028 : UEFA confirm united kingdom and Ireland as hosts | Football",
  "date": "20231010T104500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UK and Ireland have been confirmed as the host nations for Euro 2028, officially announced by UEFA on Tuesday morning.\nThe tournament scheduled for June and July 2028 will be played across 10 stadiums in England, Scotland, Wales, Northern Ireland and Republic of Ireland.\nUEFA posted on social media: ‘CONFIRMED: #EURO2028 will take place in the UK and Republic of Ireland!\n‘Proposed venues include Belfast, Birmingham, Cardiff, Dublin, Glasgow, Liverpool, London (x2) Manchester and Newcastle.\n‘Congratulations to our confirmed hosts!’\nItaly and Turkey have also been confirmed as the hosts for Euro 2032, having been the sole bidders for that tournament.\nEuro 2028 | Host Stadiums\nENGLAND\nEtihad Stadium\nWork is set to begin later this year on increasing the capacity of treble-winning Manchester City’s ground to almost 62,000 by 2025.\nEverton Stadium\nThe Toffees’ new home at Bramley-Moore Dock is scheduled for completion late next year. Developers are working to a capacity of 52,888.\nSt James’ Park\nSt James’ Park also hosted matches at Euro 96. Newcastle are considering options to develop the stadium which might mean the capacity has increased by the time the championships begin in 2028.\nTottenham Hotspur Stadium\nSpurs’ home is the largest club stadium in London, with a capacity of over 62,000. Opened in April 2019, the stadium includes a retractable pitch with a synthetic NFL surface underneath.\nWembley\nEngland’s national stadium is widely expected to host the final, having also been the venue for the Euro 96 finale and the decisive England v Italy clash at Euro 2020. The Football Association will be working hard with the authorities to ensure there is no repeat of the chaotic scenes which surrounded that match. Wembley is celebrating its centenary this year, with the original stadium opening in 1923 for the British Empire Exhibition.\nVilla Park\nThe 52,190 capacity home of Aston Villa hosted four games at Euro 96, including two of Scotland’s group stage matches and Czech Republic’s quarter-final win over Portugal. The iconic Birmingham venue was also used back in 1966 for World Cup matches featuring Argentina, Spin and West Germany.\nNORTHERN IRELAND\nCasement Park\nConstruction on the site in the Andersonstown area of Belfast is due to get under way next year with completion by 2026. The capacity of the stadium is set to be 34,500.\nREPUBLIC OF IRELAND\nAviva Stadium\nThe Dublin venue, which holds over 51,000 people, regularly hosts Republic of Ireland football matches and those of the Ireland rugby union team, as well as high-profile Gaelic sports. The stadium had been part of the original multi-country plans to host Euro 2020 but could not ultimately provide UEFA with the necessary assurances over minimum spectator levels amid the Covid-19 pandemic.\nSCOTLAND\nHampden Park\nScotland’s national stadium did host matches at Euro 2020. The Scottish Football Association has also bid to stage the Champions League final in 2026 or 2027 at the stadium, which currently holds just over 50,000. However, developers have put forward proposals to upgrade the stadium and increase capacity to 65,000.\nWALES\nPrincipality Stadium\nThe Cardiff venue has hosted major European football events before, having staged the 2017 Champions League final. Set to be the second-largest venue in the tournament with a capacity of 74,500.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe confirmation of the host nations was a formality after Turkey withdrew interest last week, leaving the UK and Ireland as the only option on tte table.\nUEFA issued a statement last week (4 October) which read: ‘Further to the announcement on July 28 which revealed the desire of the Italian and Turkish FAs to submit a joint bid to stage UEFA EURO 2032, the UEFA administration has today written to both associations to confirm that their joint bid has been duly received and will go forward for assessment and consideration by the UEFA executive committee.\n‘As indicated by the FA of Turkiye with its submission of the request for a joint bid, their bid to stage UEFA EURO 2028 is consequently withdrawn.’\nMore Trending\nIt is expected that all five home nations will go into qualifying as normal, but there will be two qualifying places set aside by UEFA for the 24-team tournament, for any of the host countries that fail to qualify through the normal route.\nIt is an unusual step as hosts tend to qualify automatically, but with five nations it has not been deemed practical to send them all straight into Euro 2028.\nMORE: England to reject automatic qualifying spot for Euro2028\nMORE: Kyle Walker angered by Arsenal coach’s gesture after Manchester City defeat\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 830,
  "scraped_at": "2026-02-14T02:10:28.711968",
  "_text_extracted": true
}