{
  "article_id": "f17930da44db",
  "url": "https://thepeoplesperson.com/2025/10/30/jason-wilcox-sheds-light-on-manchester-uniteds-recruitment-plans-300496/",
  "title": "Jason Wilcox sheds light on Manchester United recruitment plans - Man United News And Transfer News",
  "date": "20251030T193000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United director of football Jason Wilcox recently opened up on the club’s plans for squad reinforcements. The Red Devils have invested wisely in the transfer market in recent times.\nThe English giants added Premier League experience to Ruben Amorim’s front line by signing Matheus Cunha and Bryan Mbeumo this summer. The club even invested in Benjamin Sesko to solve their No. 9 concerns.\nUnited also prised Senne Lammens away from Royal Antwerp on deadline day in a bid to address their goalkeeping issues.\nFocus on midfield in 2026\nHaving significantly strengthened their attack this summer, United are expected to turn their focus to midfield in 2026.\nAmorim has used Bruno Fernandes and Casemiro as a makeshift midfield pivot to good effect this season, but the Red Devils are already looking ahead to the future.\nThe Premier League giants are seeking a long-term replacement for Casemiro, who is out of contract next summer, while they also need more cover in the position amid Kobbie Mainoo’s uncertain future.\nOther areas of the pitch could also come under consideration for reinforcements, with recent reports suggesting that United are interested in AC Milan’s Rafael Leao.\nWilcox has now shed light on United’s recruitment plans.\nUnited want to sign the right character\nSpeaking to the club’s official website, Wilcox said that United are looking to sign talented players with the right character.\n“We have got a clear plan. We know what we have got to do, we know the areas of the team that we have got to improve. For us to get in the top four and consistently challenge for Champions League places, win Champions Leagues, win Premier Leagues, we have got to invest in the squad,” said Wilcox.\n“We have got to buy the right players. The right players who are talented but also who can deal with the pressure, who can take the squad forward. It is not always about just signing elite talent, they have got to have the right character and be somebody who can bring something different to the team.\n“We are really happy with where we are, we know we have got to improve and, you know, the players, they will never be satisfied, Ruben will never be happy, I will never be happy, it is just how we are built.\n“We are always looking to improve. Anybody who works at Manchester United should be thinking the same and they do, with the standards we are driving every day.”\nUnited are already reaping the rewards of investing wisely in the squad over the summer. Cunha and Mbeumo have hit the ground running, while Sesko has shown plenty of promise.\nSenne Lammens, meanwhile, has also earned widespread praise after helping the Red Devils secure three wins in his first three starts. Amorim’s side are now sixth in the Premier League table after nine games and have won four of their last five.\nFeatured image Justin Setterfield via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 514,
  "scraped_at": "2026-02-14T01:59:14.377542",
  "_text_extracted": true
}