{
  "article_id": "f1b8d8ad0707",
  "url": "https://theathletic.com/4577838/2023/06/08/lieke-martens-my-game-in-my-words/",
  "title": "Lieke Martens : My game in my words",
  "date": "20230608T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In this My Game In My Words series,\nThe Athletic builds towards the Women’s World Cup by talking to leading players around the world to find out how they think about football, why they play the way they do and to reflect — through looking back at their key career moments — on their achievements so far.\nParis Saint-Germain’s Lieke Martens knows what it means to set a tournament on fire.\nAdvertisement\nWith a Champions League winner’s medal to her name, Martens has earned a reputation for the spectacular and is certain to be a key player for the Netherlands in next month’s Women’s World Cup in Australia, starting on July 20. The winger’s international record speaks for itself; 58 goals for the Netherlands in 144 appearances.\nBut it is hard to forget one of Martens’ most spectacular years — 2017. She spent it ripping through defences and destroying rivals’ European Championship dreams.\nShe won the Player of the Tournament award at the 2017 Euros, a winners’ medal and a flurry of individual prizes the same year, including FIFA Best Women’s Player and the UEFA Women’s Player of the Year. A Cruyff turn in a group game against Belgium saw the two defenders tracking her left so disorientated that they ran into each other and clashed heads.\nShe built a tournament on such moments, each movement pivotal and brimming with flair. More than five million in the Netherlands watched on TV as Martens and her team-mates, managed by Sarina Wiegman, lifted the trophy. Later that year she made her Barcelona debut and became part of the attacking trident, along with Caroline Graham Hansen and Jenni Hermoso, which proved a nightmare for Chelsea in their 4-0 2021 Champions League final defeat.\n“After 2017, everything changed,” 30-year-old Martens said. “We’re the first generation who are getting so much attention and getting to know how it is to be a public person. Those things are totally different than the generation before us.”\nWhat was the biggest surprise about finding herself a public figure? “Your freedom is different. People are watching you without you having any idea that people are watching you. They’re asking things on the street. The most important thing is that little kids, little girls have a dream they can accomplish now.”\nAdvertisement\nWe want to know how she manages the on and off-field pressures. We cannot do so fully without understanding the laser focus, on display as young as 10, that has guided her thus far. From PSG’s training base, she conducted the interview in perfect English. She speaks five languages — Dutch, English, Spanish, German and Swedish — and said modestly that she understands French but finds it tougher to speak, even if she can get by without a translator. “To add a sixth one — it’s impossible almost,” she said, half-joking.\nFruitlessly, I had looked earlier in the day for that Cruyff turn on YouTube, but the consolation is that there is no shortage of clips of her doing other things that have amazed fans. One has 3.4 million views; another has 2.1 million. The one I settle on — titled “Lieke Martens is the Queen of Football” — is eight minutes of Martens in motion, ripping down the left wing, her runs full of the deceptions that are the hallmark of all the most magical players. It takes a few viewings to unscramble each clip to see the deft sleights of hand, the featherlight touches which leave tumbling defenders in her wake.\nMartens and I watch the clip. In those instances, what is she thinking?\n“I’m a player who does a lot on feelings,” she said. “You have your few tricks or movements you feel really comfortable with, that you can count on. I’m a player who waits for the defender to do something. If a defender just wants to go forward, I will react. And if I’m at dribbling at speed, then I’m the one deciding. It’s impossible for a defender to catch (you) if you’re moving at the right moment.”\nShe is right-footed but found a home on the left wing in her early days with the Dutch national team, having played as a No 9 and a 10 before. “I wasn’t a real winger in the beginning, I was coming more inside (to find) a shooting position. The last years, I have been working to drive with speed. I don’t do that many technical skills: my technique in general is just dribbling at speed. If I see that I want to go inside, I try and pull my defender inside. Then I want to go with the opposite side because then it’s really hard to change (direction) quickly.\nAdvertisement\n“Some people like to watch clips before the game if they are playing against a good full-back. I don’t like to analyse them that much. I only like to analyse how they will play when they have the ball because then I have to defend against them. I don’t want to think too much about how I’m going to play because if I have the ball, it’s me who is deciding, not the defender.”\nWiegman, under whom the Netherlands reached the 2019 World Cup final, turned out to be a good fit for her. “She always gave me a lot of freedom to play on my feelings,” Martens recalled. “She always said to enjoy and have fun, instead of saying: ‘Hey — if you get the ball over there, I want you to do this’. There’s some instructions but in many things she let me be free.”\nShe credits her touch to the work she put in as a youngster. Aged 10, she would reject kickabouts with the local kids in favour of more technical training. She would line cones across the football field directly behind her parents’ house in Bergen to practise her dribbling or slam the ball against the wall to work on her first touch and close control.\n“I did a lot on my own because when I was younger I only had practice twice a week with the boys,” she said. “I didn’t have that much time to get better. After school, often I didn’t even want to play with other kids. They couldn’t understand why I was often doing things by myself. It was so satisfying if you had a good touch when you kick the ball as high as possible in the air. Controlling the ball was a big achievement. From that I have this touch I can still count on.”\nAs a child, she tried to copy Ronaldinho, watching YouTube videos of his dribbling and skills. Her role for the Netherlands can be likened to Arjen Robben, the men’s international winger. She has analysed clips of him “doing little touches because I know if you do this quick enough no one can catch you.”\nDuring her five seasons with Barcelona beginning in 2017, her versatility was evident — the club played her more like a No 10 and a No 9. Sometimes she played between the lines and sometimes as a winger.\nMartens moved to PSG in 2022 and in her debut year she won the Division 1 Feminine goal of the season for her volley in their 3-1 win over Dijon.\nIn her debut year with PSG, Lieke Martens has won the D1 Arkema goal of the season!\npic.twitter.com/koHJvnIOLd— SHE scores bangers (@SHEscoresbanger) May 15, 2023\nThis goal is another great example of her instinctiveness. Martens says that she had glanced where she wanted to shoot before the ball came to her. “If you don’t know before your first touch, it’s impossible to shoot (accurately)” she explained. “With your first touch you turn your body to goal. I moved to the left, (adjusted my) body shape and scanned where the goal was.”\nAdvertisement\n“These situations don’t come that often. Seriously — I’m not practising volleys that much.” The volley, she conceded, is “one of the most amazing goals I’ve scored.”\nI pull up another example of brilliance from her spell at Barcelona — the Women’s Clasico in December 2021. Barcelona won 3-1: Martens scored twice and set up the other. We watch the build-up to Barcelona’s third. Striker Mariona Caldentey spins the ball between two defenders. Martens races onto it, her first touch controlling the ball and her second lifting it over the goalkeeper into the far corner.\nExplaining the build-up to the goal, Martens said: “(At) Barcelona, we worked a lot on the first movement and dragging your defender with you.\n“I’m not the fastest in football, but I’m giving myself two or three metres’ space. You have a quick look where the goalkeeper is. It doesn’t make any sense to go for the far corner if she stays on the line. I’d keep dribbling then. But now she’s out five metres, it’s easier to shoot than dribbling; if we come closer to her, it’s a difficult angle to score. The goalkeeper makes it easier because she moves forward.”\nThat goal required two touches. We move on to one that takes her four — from the Netherlands’ 2-0 win over Belarus in a World Cup qualifier in 2021. On the edge of the area, defender Merel van Dongen lays the ball onto Martens’ right foot. She pushes it onto her left, cuts past the defender with her right, then shoots.\nWhat is she thinking as the defender closes her down? “She is really close,” Martens said. “It was impossible to go outside her because the only thing I could do is play to my teammate on the left. But to be honest, I didn’t look for this. The first touch that sets me up to shoot is really important: it is a quick movement to make myself free in front of goal. There are maybe 10 people in front of me. It’s not easy to not hit anyone.”\nI told her that I spoke to one full-back for this series who said that time slowed down when she was on the ball. Is it the same for Martens? “We’re in a totally different position,” she said. “She has the whole game in front of her. I’m in smaller spaces, with a lot of people around. You have to make quick decisions, think in a split second.”\nMartens is always scanning for space, always orienting herself. “My teammates, especially from the national team, will make space for me to shoot on the go,” she said. “The ball you get is so important: the right speed and the right foot and you know you can turn. I’m just scanning before if I have space to turn. That’s really important to make a quick decision — if you can take your touch forward or not.”\nAdvertisement\nMartens was named in the Netherlands’ squad for the World Cup in Australia. Her Euros ended early last summer with a hamstring injury that began to plague her towards the end of her final season in Spain. But she’s fully fit again and remembers how it felt to set a tournament alight. This summer offers her another chance to do so.\nThe My Game In My Words series is part of a partnership with Google Pixel. The Athletic maintains full editorial independence. Partners have no control over or input into the reporting or editing process and do not review stories before publication.\n(Top Photo: DANIEL MIHAILESCU/AFP via Getty Images)",
  "word_count": 1906,
  "scraped_at": "2026-02-14T02:00:19.982722",
  "_text_extracted": true
}