{
  "article_id": "f1d96137e326",
  "url": "https://www.teamtalk.com/west-ham-united/set-approve-sale-25m-star-euro-giants-make-rapid-progress-january-transfer",
  "title": "West Ham : Nuno to approve sale of £25m star as Euro giants make  rapid progres in negotiations",
  "date": "20251230T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "West Ham United\nPremier League • England\nWest Ham set to approve sale of £25m star as Euro giants make ‘rapid progress’ for January transfer\nWest Ham United’s young Brazilian winger, Luis Guilherme, could be set for a January move to Portugal, with Sporting CP and Porto the most advanced clubs in the race for his signature, sources confirm.\nThe 19-year-old, who arrived at the London Stadium from Palmeiras in a £25million deal in 2024, has struggled for minutes under Nuno Espirito Santo.\nGuilherme has played just 80 minutes of Premier League football under Nuno, with other players well ahead of him in the pecking order.\nSources indicate that West Ham are open to his departure, prioritising a permanent transfer to recoup funds amid financial pressures.\nInitially, talks revolved around loan options with obligations to buy, but negotiations have shifted towards outright sales, potentially in the €18-20m (£15.7-£17.5m / $21.1-23.5m) range, including add-ons.\nSporting CP have emerged as frontrunners in recent days, with sources from Portugal suggesting rapid progress on a permanent deal.\nThe Primeira Liga champions view Guilherme as a priority to bolster their attack, especially with injuries and international commitments thinning their wide options. Rui Borges’ side see his versatility—capable of operating on both flanks or centrally – as a perfect fit.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nPortuguese giants battling for West Ham star\nNot far behind Sporting, Porto remain strongly interested in Guilherme, having monitored the player closely and previously made approaches.\nThe Dragons are keeping tabs on developments, ready to pounce if Sporting’s talks falter, with rivals aware of the need to strengthen for domestic and European challenges.\nImportantly, Guilherme is keen on the move, receptive to returning to a more familiar footballing culture in Portugal where he believes he can rediscover his form and secure regular playing time.\nThe teenager, once hailed for his dribbling, pace, and potential comparisons to Neymar, has found the physicality of the Premier League challenging but remains highly rated by scouts.\nA switch to one of Portugal’s giants could reignite his career, offering Champions League football and a platform to develop away from the intense scrutiny and struggles at West Ham.\nWith the January window imminent, expect swift developments as both Porto and Sporting push to land the talented attacker.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.\nREAD NEXT – Man City star REJECTS move to West Ham amid rival Premier League interest – multiple sources",
  "word_count": 443,
  "scraped_at": "2026-02-14T01:59:31.506557",
  "_text_extracted": true
}