{
  "article_id": "f1e685217ac6",
  "url": "https://metro.co.uk/2024/04/25/chelsea-issue-injury-update-enzo-fernandez-groin-surgery-20721166/",
  "title": "Chelsea issue injury update on Enzo Fernandez after groin surgery",
  "date": "20240425T233000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have officially confirmed that Enzo Fernandez will miss the remainder of the season after undergoing surgery on a groin injury.\nThankfully for Blues fans the club say the operation was successful and he’ll now start his rehabilitation at Cobham.\nIt was reported earlier on Thursday that the World Cup winning midfielder had been suffering with an inguinal hernia but still started Chelsea’s last two games.\nBut following the FA Cup semi-final defeat to Manchester City and the humiliating 5-0 loss at Arsenal on Tuesday, he had decided to go under the knife.\nOn Thursday night, the Blues released the following statement: ‘Enzo Fernandez has today undergone successful surgery on a groin issue and will now begin a period of rehabilitation, sidelining him for the remainder of Chelsea’s 2023/24 season.\n‘The 23-year-old midfielder will work with the club’s medical department on his rehabilitation at Cobham.’\nIt is not known exactly how long Fernandez will be out of action for, but he is hoping to recover in time to play for Argentina at this summer’s Copa America.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe tournament in the USA kicks-off on 20 June.\nA month after playing a pivotal role in Argentina’s triumph at the 2022 World Cup, Chelsea made Fernandez the then-most expensive player in British football history, paying Benfica £106.7million for his services.\nMore Trending\nThe 23-year-old is thought to be under contract until 2032 but the jury is out on whether he has been worth anything near to his transfer fee.\nWithout him, Chelsea will be aiming to salvage something from this season by qualifying for Europe, a tricky task that continues on Saturday when they travel to Champions League chasing Aston Villa.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Real Sociedad star Martin Zubimendi responds to Arsenal transfer link\nMORE: Arne Slot confirms Liverpool talks and speaks out on replacing Jurgen Klopp\nMORE: Dan Ashworth to take Newcastle to arbitration over protracted Manchester United move",
  "word_count": 390,
  "scraped_at": "2026-02-14T01:56:51.544323",
  "_text_extracted": true
}