{
  "article_id": "f1f1b7f61f15",
  "url": "https://www.the42.ie/euro-2024-diary-2-6416764-Jun2024/",
  "title": "Euro 2024 diary : Tournament highlights enduring differences between West and East Germany",
  "date": "20240624T153000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "IT’S THE MORNING after my gonzo reporting of Germany vs Hungary and I’m sitting on a train platform with a headache that is sawing off bits of my skull.\nI am waiting on the Deutsche-Bane of my life to get to Leipzig, ostensibly to cover France/Netherlands but really to see some of the only old East German host venue of the tournament. (Berlin’s Olympic Stadium is in the city’s old Western sector.)\nThe train conductor checks my ticket, which is discounted to a special Euro 2024 rate on account of my media accreditation. He then returns to ask me whether the England fans claiming to be allowed ride for free with their specific fan-pass tickets are to be believed. Yes, I tell him, without adding that he probably ought to know this without recourse to Some Guy on the Train, regardless of how confident and knowledgeable I doubtlessly appeared.\nAn immediate delay and one missed connection later, I get to Leipzig a respectable three hours behind schedule.\nThere are little emblems of Leipzig’s former political status: the little green man at pedestrian crossings, for instance, is a squatter, thicker-jawed figure than the svelte stickman the Western media so harmfully and unrealistically promotes.\nThe stadium is another. The Red Bull Arena has been built within the bowl of the old Soviet-era Zentralstadion, which could house 100,000 fans. The modern version has a capacity of less than half of it, and so bridges have been built from the edge of the old stadium site to reach the newer, slimmed-down arena.\nIt was built for the 2006 World Cup but none of the old East German sides were good enough to fill it, and so Red Bull saw an opportunity to pounce. They bought the licence of a third-division side, SSV Markranstadt, did an immediate rebrand, and then poured enough money to bring Champions League football to the city.\nThis strikes me as a small tale of German unity: less the clicking together of two separated parts than the overlying of one upon the other.\nThe tournament highlights the ongoing asymmetry between East and West. Leipzig is the only host venue among the former GDR, and Toni Kroos is the only member of the Germany squad born in the former East.\nAnd while the German football federation was originally founded in Leipzig in 1900, the city’s significance for the country’s history remains little more than a rumour. The national football museum, for instance, is in Dortmund.\nUnion Berlin, meanwhile, are the only team from the old East German Oberliga currently playing in the Bundesliga, as others languish in the lower tiers and some have sunk as low as regional leagues.\nThe central train station features a display of the stadiums of these old Oberliga clubs and while the ground to which tens of thousands are flocking is a fundamentally western phenomenon, these clubs are pure expressions of the old GDR.\nThese expressions, I learn, are very much in vogue around here at the moment. Being Germany, there is a specific word for this, Ostalgie, a portmanteau of ‘East’ and ‘Nostalgia.’\nInterested in the phenomenon, I find a specific Ostalgie museum a short walk from St Nicholas’ Church , the 12th-century church made famous as the site of spontaneous public demonstrations against communist rule which helped to bring down the wall.\nThe museum is the kind of rip-off of which Dublin would be proud. I pay €8.50 for a silent walk around what’s effectively a two-storey house filled with the everyday wares and detritus of a 1980s GDR household. There are toys and books and radios and one shelf of East German bleach. There are clothes and bikes and toothpastes and a couple of stray but glorious pieces of football memorabilia.\nBut more interesting than the experience is the basic fact the museum exists. I don’t know whether this museum is there to serve the kind of nostalgia we all indulge about our own childhoods, or whether it’s articulating a specific East German unhappiness with how the future has turned out.\nBecause that unhappiness does seem to exist: the far-right AfD polls highest in the old East, and mapping the results of the recent European elections shows that, while the Wall has fallen, an invisible border has been erected in its place.\nStill two countries: how Germany voted. (Black=Union; blue=AfD). pic.twitter.com/OUCM82ijcr\n— Tom Nuttall (@tom_nuttall) June 10, 2024\nMuch more interesting is the Contemporary History Forum. It begins from the moment of Hitler’s death but doesn’t have an endpoint, instead inviting visitors to pose their own questions about German integration, which are then displayed on a giant rotating disc at in the middle of the museum’s final room.\nThere’s regrettably little told about football, but I did learn that wind surfing shot to popularity in East Germany from the 1960s, to the point the ruling party decreed it could only be done on inland bodies of water, in case anyone used it as a means to escape.\nThe museum is evocative in explaining how the East came into being and I found it starkly . . . straightforward. Yes it would all be reinforced by the autocrat’s paranoid classics – secret police, expropriation of land, show trials, an indoctrinating education programme, and censorship – but at the beginning the Soviets simply arrived in Leipzig and handed out brochures telling the locals about the details of the war reconstruction projects along with a list of new street names, abruptly changed now to honour significant Communist figures. Statues of Marx and Lenin also popped up all over the East.\nBut when life gives you Lenins…\nThe museum also honours the people of the East, re-animating them with the individuality they possessed even beneath the boot of a collectivist regime. Blue jeans hang in one exhibit to show how the wearing of them became a kind of protest in themselves. (The regime gave them the utilitarian title “riveted trousers.”)\nElsewhere, the lagging housing construction programme was parodied by artist Jurgen Kieser, sculpting a giant snail with a hard-hat perched on its back.\nThis is all to say that a wry, subversive and utterly distinct culture existed among the people of East Germany in spite of the regime’s best efforts to suppress it.\nThat culture certainly hasn’t flourished in German football since unification, with Euro 2024 the latest evidence of that.\nLeipzig’s involvement as a host will end at the last-16 stage, so when the jamboree then gravitates west for the rest of its existence, the only thing left to do is to start feeling nostalgic.\nRalf Rangnick’s motivational techniques\nTo indulge in understatement: we are seeing things from Ralf Rangnick at Austria that we did not during his brief and bizarre secondment to Manchester United.\nAhead of their opening game with France, the Austrian fans urged their team to “go fishing for three points”, depicting Rangnick as a fisherman, or angelmeister.\nThough they were narrowly beaten by France in the opening game, Austria beat Poland in their second game to put them in a very good position to advance to the last-16 as one of the third-placed sides at worst.\nRangnick has encouraged togetherness by presenting every member of the squad and staff with their own lock, to symbolise the fact they are all an equal link in a longer chain. On the bus to the Poland game, meanwhile, he WhatsApped forward Christoph Baumgartner a photo of him celebrating a goal for RB Leipzig as a little motivational boost.\nBaumgartner then went and scored against Poland, sprinting over to embrace Rangnick, knocking off his glasses as he did so.\nThey are on a potential collision course with England in the last-16, which could be a nightmare tie for Gareth Southgate: Rangnick’s Austria are diligent, organised, and energetic. Everything England are not.\nStop the presser\nIt’s a general rule in football journalism: the bigger the event, the worse the press conference. The wider range of personnel means a wider range of questions, increasing the probability these questions will be head-scratchingly, teeth-grindingly bad. Some of the behaviour makes me feel an associated mortification.\nThis tournament hasn’t been as bad as Qatar 2022 for journalists bolting from their seat to ask managers and players for selfies – truly shameful carry-on that must be condemned in the strongest possible terms – but one German journalist used Harry Kane’s pre-Slovenia press conference for a publicity stunt.\nAsking Kane whether he would consider moving to a village in Thuringia – population 3,000 – and play for their seventh-tier side, the journalist then whipped out a mock contract to sign.\nIf at Euro 2028 you hear me ask Kylian Mbappe whether he would consider playing his football in Lanesboro, County Longford, please pay the ransom to my captors.",
  "word_count": 1464,
  "scraped_at": "2026-02-14T02:13:55.815901",
  "_text_extracted": true
}