{
  "article_id": "f1f70a9bb809",
  "url": "https://www.dailybreeze.com/2023/04/08/denis-bouangas-hat-trick-leads-lafc-past-austin-fc/",
  "title": "Denis Bouanga hat trick leads LAFC past Austin FC – Daily Breeze",
  "date": "20230409T064500Z",
  "domain": "dailybreeze.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LOS ANGELES — The Major League Soccer season is young, but Los Angeles Football Club supporters have already bestowed the most valuable player award to Denis “The Menace” Bouanga.\nThrough six league matches and a trio of CONCACAF Champions League contests it’s difficult to argue otherwise.\nOn Saturday, the 27-year-old French forward pushed his tally to 11 goals in nine games across all competitions this year, hitting a second consecutive game winner at BMO Stadium before adding two more during a resounding 3-0 victory over Austin FC.\n“MVP” chants bounced around the stadium following Bouanga’s opening goal in the 40th minute. They grew louder when he smashed home a volley just before the hour mark. And when his third impressive finish came 10 minutes later, the announced crowd of 22,199 said it all.\n“Everytime I want to do something I feel the fans,” Bouanga said. “It makes me want to do even better with scoring or passing a good ball.”\nSince scoring his debut goal with LAFC to clinch the Supporters’ Shield late last season, Bouanga has 13 finishes over his last 14 appearances. Accounting for assists, Bouanga played a part in 14 of LAFC’s 19 goals in 2023.\nDuring a four-day span in March, he produced five consecutive goals, including a first career hat-trick.\nThirty-one days later, the designated player signing from the top-flight of French soccer delivered a second three-goal performance.\n“I feel really good now and because of the team I can perform that way,” Bouanga said.\nLAFC’s win on their home field over Austin (2-3-1, 7 points) resembled last year’s dominant Western Conference final, which head coach Steve Cherundolo considers one of the team’s best performances en route to its first-ever MLS Cup championship.\n“As much as we want to play and control the game and possess the ball, look, there’s a quicker way to goal sometimes and we have the players for that and players understand how to do that and I thought we took advantage of that tonight,” Cherundolo said.\nHalf an hour into Saturday’s contest, he made a shift in the midfield positioning that settled the game and disrupted an opponent that prefers to stay compact and step up to press even if it leaves them vulnerable at the back.\n“I think the game turned completely after that point,” Cherundolo said. “We conceded a little in possession but I didn’t feel they were a threat. Certainly, conceding possession over 90 minutes like that is not an option and we had to make a change. After that the coast was clear.”\nPlaying prior to the second leg of their CONCACAF Champions League quarterfinal series with Vancouver on Tuesday and next weekend’s “El Trafico” against the rival L.A. Galaxy, Cherundolo went with a noticeably rotated lineup.\nCaptain Carlos Vela and midfield stalwart Ilie Sanchez began the match sitting with the reserves, as did goalkeeper John McCarthy.\nHonduran center back Denil Maldonado earned his first start with the club, as did goalie Eldin Jakupovic, who made four saves in his MLS debut to preserve the club’s sixth clean sheet this year.\nLAFC (4-0-2, 14 points) remains one of two unbeaten teams in MLS as it terrorizes the opposition with constant pressure on both ends of the pitch. This is the second time LAFC has not lost a league match after six attempts. It can tie the 2019 team with seven straight next weekend in Carson.\nCulminating in 26 shots against Austin, four of their six on-target attempts came courtesy of Bouanga, who was substituted off after 72 minutes.\nThe result is Cherundolo’s 25th league win, making the second-year MLS head coach the fastest to reach that number since the league stopped deciding games in shootouts following the 1999 season.\n“I love every minute of coaching them because they want to win,” the coach said. “They want to win every single silly game in training and obviously every competitive match we play. They will do their part. They will recover and we will field a fresh, competitive and hungry team Tuesday night.”",
  "word_count": 675,
  "scraped_at": "2026-02-14T02:24:37.523999",
  "_text_extracted": true
}