{
  "article_id": "f206f5d94018",
  "url": "https://www.caughtoffside.com/2023/08/20/chelsea-transfer-news-romano-on-wahi-and-vlahovic/",
  "title": "Chelsea transfer news : Romano on Wahi and Vlahovic",
  "date": "20230820T081500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fabrizio Romano has provided an exclusive Chelsea transfer news update regarding two strikers who’ve been linked with the Blues this summer.\nWriting in his CaughtOffside column on Substack, Romano has explained what’s going on with Elye Wahi and Dusan Vlahovic, both of whom have been talked up as potential solutions to Chelsea’s issues up front at various points this summer.\nChristopher Nkunku and Nicolas Jackson have both joined Chelsea this season, but it remains to be seen if Mauricio Pochettino could do with more options in that area of the pitch, especially with Nkunku now injured.\nStill, Wahi now looks to be heading for Lens as he wanted to play in the Champions League, while the Vlahovic deal seems to be off for now, with the deal also hinging on Romelu Lukaku moving to Juventus.\nRomano said: “Elye Wahi was close to joining Chelsea and then go on loan to Strasbourg. West Ham and Eintracht Frankfurt also had an interest in Wahi, but he’s decided to stay in Ligue 1 and join Lens – he wants to play Champions League football and gets the chance to replace Loic Openda at Lens. So it’s an important deal for the French club, he’s joining for €35m.\n“Dusan Vlahovic was also linked with Chelsea recently, but he could still stay at Juventus for sure. At the moment that deal is on total stand-by and nothing is happening.\n“Let’s see what happens with Chelsea, I don’t know the future but as of today, it’s on total stand-by.\n“And it’s also worth emphasising that Vlahovic-Chelsea was only a possibility discussed with Romelu Lukaku as part of the deal, not without Lukaku.”\nThe transfer news expert also added that Paris Saint-Germain look to be the favourites over Chelsea for the signing of Bradley Barcola, saying: “There has been some talk of Chelsea and Bradley Barcola, and it’s true that they appreciate the Lyon youngster as one of many players they are following.\n“Barcola is on of the best young talents in the world right now, so it’s true that Chelsea are monitoring him, as they always monitor these kinds of players.\n“Still, from what I’m told, PSG remain the club in the most advanced talks with Barcola on the player side. They remain the favourites as they started talks some time ago, but Chelsea remain informed on the situation, so let’s see how this will develop.”",
  "word_count": 400,
  "scraped_at": "2026-02-14T01:56:26.909898",
  "_text_extracted": true
}