{
  "article_id": "f236c3ae5a41",
  "url": "https://www.france24.com/en/live-news/20230421-napoli-look-for-boost-at-buoyed-juve-after-champions-league-exit",
  "title": "Napoli look for boost at buoyed Juve after Champions League exit",
  "date": "20230421T060000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Napoli look for boost at buoyed Juve after Champions League exit\nMilan (AFP) – Napoli will try to shrug off the disappointment of their Champions League exit on Sunday as Serie A's runaway leaders travel to Juventus hoping to take another step towards their first league title since 1990.\nIssued on:\nA quarter-final exit at the hands of AC Milan on Tuesday night leaves Napoli with eight games left in their season to secure a Scudetto which has long looked inevitable but whose arrival has been slowed by some jittery recent form.\nLuciano Spalletti's formerly free-scoring side have only netted three times in their five matches since the international break, four points from their last three league matches enough to see their imposing lead at the top of the table cut to 14 points.\nAs it stands Napoli need 11 more points to secure the title but Sunday's match is another tough test of the sort they have failed in recent weeks.\nSpalletti's teams are notorious for having bad dips in form during the Spring and April has been a poor month for his latest outfit, as injuries and fatigue of a long season begin to take their toll.\nThe Tuscan coach has Andre-Frank Zambo Anguissa and Kim Min-jae available after they were suspended for Tuesday's elimination, which however left forward Matteo Politano and full-back Mario Rui unavailable for the trip to Turin, with Amir Rrahmani also a doubt.\nAnd their trip north to the hostile territory of Turin comes with Juve in third place after their 15-point penalty for illicit transfer activity was revoked by Italy's highest sporting court pending a new ruling from the Italian Football Federation's (FIGC's) appeals court.\nThat decision completely changes the race for next season's Champions League, with both Milan clubs outside the top four just one day after a local derby between the pair in the semi-finals of Europe's top club competition was confirmed.\nAC Milan are fifth before their home fixture with Lecce on Sunday, three points behind Roma who sit just inside the top four.\nInter Milan, who have lost 11 times in the league this season, are now five points from the Champions League positions ahead of their trip to Empoli in Sunday's early match.\nWith Napoli taking on another tough fixture second-placed Lazio can cut the gap at the top on Saturday when they host Torino.\nHowever they will have to do it without Ciro Immobile who after returning from injury and scoring last weekend at Spezia is out again following a car accident in Rome in which he collided with a tram.\nThe Italy's forward suffered a broken rib after his car slammed into the side of the tram, which derailed on impact, while he was driving in the Italian capital with his two daughters.\nIn his absence Maurizio Sarri is set to pick Felipe Anderson to lead the line in a fluid front three, as Lazio try to take another step towards Champions League football next season.\nLazio are eight points ahead of Milan but now have Juve breathing down their necks, Massimiliano Allegri's side are two points back in third following the latest episode of an affair which is set to run until the end of a dramatic season.\nPlayer to watch: Victor Osimhen\nNigeria striker Osimhen scored in vain on his first start since the international break when he headed past Mike Maignan on Tuesday, and his clinical finishing will be key for a Napoli team far from its best form.\nOsimhen has netted 26 times in 31 appearances in all competitions and has been the difference throughout Napoli's remarkable title charge.\nKey stats\n14 - The points gap separating Napoli and Lazio\n59 - Juve's points tally after their transfer trickery punishment was revoked\n11 - The points Napoli need to ensure the title\nFixtures (times GMT)\nFriday\nVerona v Bologna (1845)\nSaturday\nSalernitana v Sassuolo (1300), Lazio v Torino (1600), Sampdoria v Spezia (1845)\nSunday\nEmpoli v Inter Milan (1030), Monza v Fiorentina, Udinese v Cremonese (1300), AC Milan v Lecce (1600), Juventus v Napoli (1845)\nMonday\nAtalanta v Roma (1845)\n© 2023 AFP",
  "word_count": 691,
  "scraped_at": "2026-02-14T01:50:29.477515",
  "_text_extracted": true
}