{
  "article_id": "f241ae96dd41",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/champions-league-scammer-made-50k-30777492",
  "title": "He made £40k selling fake Liverpool vs Real Madrid tickets",
  "date": "20250114T151500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "He made £40k selling fake Liverpool vs Real Madrid tickets\nLee Waldron sent his victims fake PDFs of tickets to the 2022 Champions League final in Paris\nA man made nearly £40,000 scamming fans with fake Champions League tickets. Lee Waldron received thousands of pounds from 20 victims who were sent counterfeit PDF tickets.\nThe 41-year-old's arrest came after detectives from the North West Regional Organised Crime Unit investigated reports made to Action Fraud by victims who had attempted to buy tickets to the May 2022 Champions League final in Paris between Liverpool FC and Real Madrid.\nThe football fans, who were eager to see the highly anticipated match, were left devastated when they discovered the tickets were fakes. At Liverpool Crown Court on Monday, January 13, Waldron of Norbury Road in Kirkby, was jailed for 21 months after being found guilty at trial for acquiring/ using/ possessing criminal property.\nWaldron's associate, David Windsor, pleaded guilty to fraud offences back in March 2024 and was also jailed for 21 months.\nDetective Chief Inspector Chris Maddocks from the NWROCU's Economic Crime Unit said: \"The impact on the victims in this case has been significant, and it highlights the importance of purchasing tickets from reputable sources. We will continue to pursue those who seek to exploit fans for their own financial gain, and we're committed to bringing offenders like Waldron to justice.\"\n\"We urge the public to be vigilant when buying tickets for major events by taking the following steps to protect themselves:\n- Research the sites you are buying from and read reviews from trusted sources\n- Be wary if someone offers to meet you outside the venue to sell tickets, as this is often a scam.\n- Check website URLs for subtle changes that could indicate they are fraudulent.\n- Use secure payment methods recommended by reputable online retailers and be cautious of requests to pay by bank transfer.\n- If possible, use a credit card for purchases over £100 and up to £30,000, as you receive protection under Section 75 of the Consumer Credit Act.\n- Book tickets through official sellers who are members of the self-regulatory body Society of Ticket Agents and Retailers (STAR), as anything else could be a scam.\n\"These steps can help protect you from falling victim to ticket fraud. Stay vigilant\"If you fall victim to ticket fraud, report it online at www.actionfraud.police.uk or call 0300 123 2040. If you have information about someone involved in ticket fraud, contact Crimestoppers anonymously at 0800 555 111.",
  "word_count": 420,
  "scraped_at": "2026-02-14T01:49:18.066383",
  "_text_extracted": true
}