{
  "article_id": "f244fde3fe12",
  "url": "https://www.fourfourtwo.com/features/tottenhams-best-homegrown-players",
  "title": "Tottenham best homegrown players",
  "date": "20240819T110000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham's best homegrown players\nFrom legends of the Lane from the 1950s and 1960s to more modern-day greats, a look at Tottenham's best-ever academy players...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nTottenham Hotspur were the first English club to win a league and cup double in the 20th Century.\nSpurs won the First Division title and the FA Cup under Bill Nicholson in the 1960/61 season and in 1963, the Lilywhites became the first English club to win a European trophy – the UEFA Cup Winners' Cup.\nThe 1970s, 1980s and 1990s brought additional silverware and, although recent times have been more difficult, Tottenham remain one of the nation's biggest and most successful sides.\nSpurs have been blessed with some special players over the years and here is a look at some of the finest footballers who came through the youth ranks at the north London club...\n33. Steven Caulker\nSteven Caulker joined Tottenham as a 15-year-old after impressing for local club Hounslow Borough and signed professional terms in July 2009.\nThe centre-back played 28 times for Spurs in the 2012/13 season and was also capped by England, scoring on his debut against Sweden. But he was sold to Cardiff City in the summer of 2013 and never played for England again, later going on to represent Sierra Leone.\n32. Phil Beal\nPhil Beal joined Tottenham's youth team from Surrey Boys in 1960 and made his first-team debut for Spurs three years later.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nA versatile player who could operate in central defence or in midfield, Beal went on to make over 400 appearances for the Lilywhites up until 1975, winning two League Cups and a UEFA Cup in that time.\n31. Ted Ditchburn\nThe son of a professional boxer, Ted Ditchburn joined Tottenham as a member of the groundstaff in 1937 and signed professional terms two years later.\nAfter a brief spell at Spurs' nursery side Northfleet United, the goalkeeper went on to make over 450 appearances for the north London club, winning the Second Division title in 1949/50 and the First Division the following season. He also earned six caps for England.\n30. Quinton Fortune\nQuinton Fortune began his professional career with Tottenham between 1991 and 1995, but the South African midfielder never made a first-team appearance for Spurs.\nAfter leaving Tottenham, Fortune had spells at Mallorca and Atletico Madrid, later returning to England where he spent seven seasons with Manchester United. A squad player at Old Trafford, Fortune did not play enough games to be awarded a Premier League winners' medal in 1999/2000 or 2002/03, but did receive one by special dispensation in the second of those campaigns after playing in nine of the required 10 games. He won 46 caps for South Africa.\n29. Paul Miller\nPaul Miller joined Tottenham as an apprentice at the age of 16 and went on to make over 250 appearances for the north London club.\nThe versatile defender was part of Spurs' FA Cup-winning teams in 1981 and 1982 and scored a vital away goal as the Lilywhites beat Anderlecht to claim the UEFA Cup in 1984.\n28. Tony Marchi\nBorn in Edmonton, Tony Marchi joined Tottenham as a 14-year-old and went on to play for Spurs across two long spells – either side of a period in Italy with Vicenza and Torino, on loan from Juventus.\nMarchi was often back-up to Danny Blanchflower and Dave Mackay at Tottenham, but was part of the team which won the UEFA Cup Winners' Cup in 1963 and made 260 appearances in total, scoring seven goals.\n27. Troy Parrott\nTroy Parrott joined Tottenham as a 15-year-old, but the Dublin-born striker was unable to make much of an impression, making just four first-team appearances at Spurs.\nA Republic of Ireland international since 2019, Parrott was loaned out to five different clubs and after a strong spell at Excelsior in the Netherlands, he signed permanently for fellow Dutch side AZ Alkmaar in 2024.\n26. Kyle Walker-Peters\nFor a period in the mid-2010s, Tottenham had one player named Kyle Walker and another called Kyle Walker-Peters – and both men were right-backs.\nBorn in north London, Walker-Peters joined Tottenham as a 16-year-old in 2013 and was part of the England team which won the Under-20 World Cup in 2017. After just 24 appearances for Spurs between 2017 and 2019, KWP joined Southampton on loan and made the move permanent in 2020. He was capped twice by England in 2022.\n25. Luke Young\nLuke Young came through the youth system at Tottenham and went on to make 76 appearances in all competitions for Spurs.\nSold to Charlton Athletic in 2001, the defender played over 200 times for the south London club and won seven caps for England in 2005. He was also on stand-by for the 2006 World Cup, but withdrew due to an injury. The centre-back later had spells at Middlesbrough, Aston Villa and QPR.\n24. Jake Livermore\nJake Livermore was part of Arsenal's academy as a youngster, but joined Tottenham as a 16-year-old in 2016 after leaving the Gunners.\nThe midfielder made over 50 appearances for Spurs between 2010 and 2013, before lengthy spells at Hull City and West Brom. He also won seven caps for England.\n23. Ryan Mason\nRyan Mason joined Tottenham's academy at the age of eight in 1999 and went on to make his first-team debut nine years later.\nThe midfielder was sent out on loan several times over the next few seasons and did not establish himself at Spurs until 2014/15. He made 70 appearances in total and was capped once by England before joining Hull City in 2016, but a fractured skull in January 2017 prematurely ended his career and he returned to Spurs as a coach in April 2018.\n22. Mark Falco\nAfter impressing at youth side Fields United in the mid-1970s, Mark Falco joined Tottenham as a junior and went on to score 89 goals in 236 games for Spurs.\nA UEFA Cup winner in 1984, Falco scored his penalty in the shootout success against Anderlecht. The striker left Tottenham to join Watford in 1986 and later had spells at Rangers, QPR and Millwall.\n21. Ian Walker\nIan Walker won the FA Youth Cup with Tottenham in 1990 and was back-up to Erik Thorstvedt in his early career at White Hart Lane.\nBut the Watford-born goalkeeper took his chance following an injury to the Norwegian and went on to make over 300 appearances for Spurs. A League Cup winner in 1999, Walker was capped four times by England. He was sold to Leicester in 2001 after losing his place to Neil Sullivan.\n20. David Howells\nDavid Howells joined Tottenham's academy at the age of 12 in 1980 and made his first-team debut for the club at 18 years old.\nThe midfielder racked up 335 appearances for Spurs and was part of the team which won the FA Cup in 1991. After 13 seasons at White Hart Lane, he left to join Southampton in 1998 but retired just two years later due to a persistent knee injury.\n19. Micky Hazard\nMicky Hazard grew up in Sunderland but signed for Tottenham after being spotted by a Spurs scout, joining as a 16-year-old after two years of training with the north London club during the week.\nOften back-up to Glenn Hoddle, the midfielder made 170 appearances for Tottenham across two spells, starting and finishing his career at White Hart Lane. Hazard was in the team for the 1982 FA Cup win and the 1984 UEFA Cup victory, setting up goals in both legs of the final against Anderlecht. He also played for Chelsea, Portsmouth and Swindon.\n18. Kerry Dixon\nKerry Dixon is best remembered for his time at Chelsea in the 1980s and early 1990s, when he scored almost 200 goals in over 400 games for the Blues.\nBut Dixon began as an apprentice at Tottenham. Released as a youngster, he worked his way up again with spells at Chesham United, Dunstable and Reading before signing for Chelsea in 1983. He won eight England caps, scoring four goals, and was part of the Three Lions' squad at the 1986 World Cup.\n17. Mel Hopkins\nSpotted playing for his local boys' club, Mel Hopkins joined Tottenham as an apprentice at the age of 15 and went on to make over 200 appearances for Spurs.\nA member of the double-winning side in 1960/61, Hopkins moved to Brighton in 1964. The left-back also won 34 caps for Wales and was part of the team which reached the last eight of the 1958 World Cup, losing narrowly to eventual champions Brazil.\n16. Stephen Carr\nStephen Carr was born in Dublin and signed for Tottenham as a 15-year-old following a trial from Irish side Stella Maris.\nThe right-back made over 250 appearances for Spurs between 1994 and 2004 and scored a couple of blockbuster goals in that time. He went on to play for Newcastle and Birmingham and won 44 caps for the Republic of Ireland.\n15. Andros Townsend\nAndros Townsend joined Tottenham's academy at the age of eight and went on to make 93 appearances for the north London club between 2009 and 2016.\nLoaned out nine times during his Spurs career, the winger eventually joined Newcastle in 2016 and later had a long spell at Crystal Palace. He won 13 caps for England, scoring three times.\n14. Harry Winks\nHarry Winks grew up a Tottenham fan and joined the north London club at the age of five after impressing at a summer camp run by a Spurs academy coach.\nThe midfielder made his debut in 2014 and went on to play over 200 games for Tottenham, impressing on the team's run to the Champions League final in 2019. After a spell on loan at Sampdoria, Winks left to join Leicester City in 2023. He was capped 10 times by England between 2017 and 2020.\n13. Jamie Redknapp\nJamie Redknapp joined Tottenham as a youth player but turned down a contract from the north London club, preferring to begin his professional career under his father Harry at Bournemouth.\nThe midfielder moved to Liverpool soon afterwards and spent 11 years at Anfield. He joined Spurs in 2002 but made just 49 appearances in two-and-a-half seasons at White Hart Lane. In a career interrupted by injury, he also played 17 times for England.\n12. Ron Henry\nRon Henry spent his entire career at Tottenham between 1952 and 1966, helping Spurs win the double in 1961, another FA Cup in 1962 and the UEFA Cup Winners' Cup the following year.\nEver-present in the double-winning season, Henry made over 280 appearances for Tottenham in all competitions and the left-back was capped once by England.\n11. Nick Barmby\nBorn in Hull, Nick Barmby joined Tottenham as a 16-year-old after leaving school in 1990 and became an important player for Spurs at the age of 18.\nBarmby made his debut for Tottenham in September 1992 under Terry Venables and later became one of Ossie Ardiles' \"famous five\" attackers in 1994/95. Missing his northern roots, he signed for Middlesbrough in the summer of 1995 and went on to play for Everton, Liverpool, Leeds and boyhood club Hull City. He won 23 caps for England, scoring four goals.\n10. Eddie Baily\nEddie Baily joined Tottenham as a 14-year-old in 1938 and went on to be a key player as Spurs won the Second Division title in 1949/50 and the First Division the following season.\nOne of the best inside-forwards of his era, Baily scored 69 goals in 325 games for Spurs before spells at Port Vale, Nottingham Forest and Leyton Orient. He also won nine caps for England, scoring five goals.\n9. Chris Hughton\nChris Hughton joined Tottenham at the age of 13 in 1971 and made his first-team debut in 1979, two years after signing professional terms.\nAfter starting out as a winger, Hughton became a dependable full-back and helped Spurs win two FA Cups and a UEFA Cup in the early 1980s. He made almost 400 appearances for the north London club before short spells with West Ham and Brentford. Born to an Irish mother and a Ghanaian father, he became the first mixed-race player to represent the Republic and went on to win 53 caps.\n8. Peter Crouch\nPeter Crouch joined Tottenham at the age of 14, but made minimal impact in his first spell at the north London club and was sold to QPR after a couple of stints out on loan.\nThe beanpole striker went on to play for Portsmouth, Aston Villa, Southampton, Liverpool and Portsmouth again before returning to White Hart Lane in 2009. He famously scored the goal which sealed Spurs' first-ever qualification for the Champions League in 2009/10 and helped the Lilywhites to the quarter-finals in the following season before a move to Stoke City in 2011. Crouch also impressed for England, scoring 22 goals in his 42 appearances for the Three Lions between 2005 and 2010.\n7. Bill Nicholson\nBill Nicholson dedicated much of his life to Tottenham, representing the north London club as a player, a manager and a scout.\nAfter joining the groundstaff as a teenager, Nicholson briefly represented Spurs' nursery team Northfleet Town, before spending his entire career with the Lilywhites. A key member of the famous Push and Run team which won the title in 1950/51, the wing-half was capped once by England and scored in his only appearance. Later, he managed Spurs for 16 years, winning the First Division, three FA Cups, two League Cups and two European trophies in the club's most glorious era. He passed away in 2004 at the age of 85.\n6. Sol Campbell\nTottenham fans adored Sol Campbell and were desperate for the defender to stay as his contract ran down in the 2000/2001 season. Instead, he did the unthinkable, moving to Spurs' fierce rivals Arsenal. For free.\nSince that act of betrayal, the former England centre-back has rarely been mentioned in a positive light again by Spurs supporters. That's football rivalry. But for more than eight years and over 300 appearances, Campbell was immense for Tottenham. A League Cup winner as captain in 1999, the defender went on to enjoy huge success at Arsenal and also earned 73 caps for England. Love him or hate him, he's one of the best players to come through the youth system at Spurs.\n5. Graeme Souness\nGraeme Souness is usually associated with Liverpool, having won three European Cups and five First Division titles in a glorious six-year spell with the Reds, but the former Scotland midfielder started out at Tottenham.\nSouness signed for Spurs as a 15-year-old in 1968 and helped the club win the FA Youth Cup in 1970, but he quickly grew frustrated at a lack of first-team opportunities in north London. After one substitute appearance, he joined Montreal Olympique on loan and later signed for MIddlesbrough in 1972. His move to Liverpool came in 1978, before spells at Sampdoria and Rangers. He won 54 caps for Scotland and is considered one of the nation's best-ever players.\n4. Steve Perryman\nSteve Perryman came through the youth ranks at Tottenham and went on to rack up a club record 866 appearances in all competitions between 1969 and 1986.\nA midfielder who later played in defence, Perryman memorably scored both goals in a 2-1 win over AC Milan in the UEFA Cup semi-finals in 1972. He won two UEFA Cups, two FA Cups and two League Cups during his Spurs career and later played for Oxford United and Brentford. He was capped once by England.\n3. Ledley King\nLedley King played for famous youth side Senrab FC and joined Tottenham as a trainee at the age of 15. He would never play anywhere else.\nA commanding centre-back who started out in midfield, King helped Spurs fans get over the loss of Sol Campbell to north London rivals Arsenal, going on to captain the club and turning in imperious displays week after week. Chronic knee problems restricted him hugely later in his career, but he continued to impress – even without training during the week. A one-club man, King skippered Spurs to League Cup success in 2008 and made 323 appearances in all before retiring in 2012. He was capped 21 times by England.\n2. Harry Kane\nHarry Kane had a short spell at Arsenal's academy at the age of eight, but was released by the Gunners and also snubbed by Tottenham.\nBut the striker signed for Spurs as an 11-year-old after impressing with Watford and eventually established himself – following several spells away on loan – with 31 goals in 51 games in the 2014/15 season. Kane went on to net 280 goals for Tottenham in 435 appearances and overtook the legendary Jimmy Greaves to become the club's all-time top scorer in his final season before leaving to join Bayern Munich in the summer of 2023. A Tottenham legend affectionately called \"One of our own\" by Spurs fans, his time at the north London club ended without a team trophy.\n1. Glenn Hoddle\nGlenn Hoddle came to the attention of Tottenham as a talented 11-year-old and went to train with the club on the advice of striker Martin Chivers.\nThe midfielder had signed by the age of 12 and made his debut as a 17-year-old in 1975. He went on to make 490 appearances in all competitions, scoring 110 goals, and winning two FA Cups and a UEFA Cup before moving to Monaco in 1987. Nicknamed \"The King of White Hart Lane\", the gifted midfielder was named Tottenham's best-ever player in a vote by players, managers and supporters in 2016. He won 53 caps for England.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 3150,
  "scraped_at": "2026-02-14T01:51:48.874051",
  "_text_extracted": true
}