{
  "article_id": "f24d73fbf7f5",
  "url": "https://www.ncr-iran.org/en/news/iran-news-in-brief-news/iran-news-in-brief-september-9-2024/",
  "title": "Iran News in Brief – September 9 , 2024",
  "date": "20240909T064500Z",
  "domain": "ncr-iran.org",
  "source_country": "Iran",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THIS PAGE WILL BE UPDATED WITH THE LATEST NEWS\nUPDATE: 4:00 PM CEST\nStanding With Truth and Integrity Against Disinformation\nIn a world where oppressive regimes constantly challenge human rights advocacy, the disinformation campaign against Professor Javaid Rehman, former United Nations Special Rapporteur on the situation of human rights in Iran, underscores the lengths to which authoritarian states like Iran will go to silence dissent. This campaign aims to discredit a dedicated human rights advocate.\nThroughout his tenure as the UN Special Rapporteur on the Situation of Human Rights in Iran, Professor Rehman pursued truth relentlessly despite being barred from Iran and facing continuous intimidation. His landmark report, detailing the atrocity crimes of the 1981-1982 executions and the 1988 massacre as crimes against humanity and genocide, reveals disturbing truths that Iran seeks to suppress.\nUPDATE: 9:30 AM CEST\nIran Sent Short-Range Missiles to Russia, Western Officials Say.\nIran has sent short-range ballistic missiles to Russia, according to U.S. and European officials, despite sharp warnings from Washington and its allies not to provide those armaments to Moscow to use against targets in Ukraine.\nThe new missiles are expected to help Russia further its efforts to destroy Ukraine’s civilian infrastructure, which President Volodymyr Zelensky of Ukraine said this week now involved 4,000 bombs a month across the country.\nThe U.S. and European officials, who spoke on the condition of anonymity to discuss sensitive matters, confirmed that after months of warnings about sanctions, Iran has shipped several hundred short-range ballistic missiles to Russia. The delivery was reported by The Wall Street Journal.\nUPDATE: 7:30 AM CEST\nIran’s Regime Taps into The National Development Fund in Fear of Imminent Uprisings\nOn August 31, the President of the Iranian regime announced in an interview with state television that he had reached an agreement with Supreme Leader Ali Khamenei to address the government’s budget deficit by withdrawing 3.5 quadrillion rials from the National Development Fund and oil sales and depositing it into the state treasury. The following day, regime-affiliated websites touted this economic “victory” by the President with headlines such as “Supreme Leader Approves President’s Proposal to Reduce National Development Fund’s Share.” They reported that “following Masoud Pezeshkian’s proposal to reduce the National Development Fund’s share by 20% this year… 3.5 quadrillion rials were added to the government’s development budget as a loan. This adjustment addressed the debt repayment issues for wheat farmers, truck drivers, and the procurement of other items.” (Entekhab, September 1, 2024)\nSharp Rise in Stationery Prices in Iran Highlights Educational Crisis\nThe Iranian regime’s state-run news agency, ISNA, has reported a significant surge in the price of stationery, with luxury items flooding the market. According to the report, school backpacks are now selling for prices ranging from 300,000 tomans to as high as seven million tomans, sparking concerns among families already struggling with the cost of education. In its detailed report, ISNA highlighted the millions of tomans that families now need to spend on basic stationery supplies for the school year. Compared to the previous year, the prices of all categories of stationery have risen dramatically. Among these, some items have entered the luxury category, being sold at prices far beyond what would be expected for everyday school essentials.\nFor instance, a pack of 12 black pencils is now being sold for up to 240,000 tomans, with higher-end models exceeding 1.4 million tomans. In the retail market, pencil prices range from 40,000 tomans to over two million tomans. Regular pens, which used to be affordable, now cost around 50,000 tomans each.\nInhumane Conditions for Female Inmates in Borujerd Prison\nBorujerd Prison, located in Borujerd City within the Lorestan Province of Iran, has been reported to subject its female inmates to severe neglect, especially regarding medical care.\nSamad Heydari Chagani, the prison’s warden, has been appointed through connections with Hamid Alqasi Mehr and Abdulhamid Keshvari (Director General of Lorestan Prisons) and Amin Alqasi Mehr (Deputy of Finance and Administration of Lorestan Prisons). Samad Heydari Chagani has been criticized for denying medical treatment to female prisoners.\nBorujerd Prison is situated in the Mokhaberat district, on Tharallah Boulevard, 18th Banafsha Street. The prison lacks basic medical facilities, exacerbating the suffering of inmates like Salemi. Reports describe the conditions as “hellish,” a reflection of the broader human rights abuses under Iran’s current regime.\nA Favorable Loan for Iranian Regime Parliament Members\nFollowing multiple revelations of unregulated loans being given to bank employees and multi-billion rial loans to members of the Stock Exchange Board with low interest rates and 10-year repayment periods, Iranian media now report on a favorable 5-billion-rial loan (approximately $8,334) being granted to members of Parliament for housing deposits, with an interest rate of only 4%.\nTejarat News, in a report on this subject, wrote that “legal favoritism has occurred from the Stock Exchange and banks to Baharestan (the Parliament building), while ordinary people are only given housing deposit loans up to a maximum of 200 million tomans (approximately $3,334) with an 18% interest rate.”\nBlue Girl’s Heartbreaking Story: The Struggle Against Iran’s Ban on Women in Stadiums\nSahar Khodayari, better known as the “Blue Girl” in Iran and around the world, was a 28-year-old woman with degrees in computer science and translation. Her dream was to watch a soccer match in a stadium in Iran, where women are barred from attending most sports events. Since the 1979 Revolution, Iran has prohibited women from entering soccer stadiums as part of broader religious laws enforcing gender segregation in public spaces such as schools, buses, and sports events\nOn September 9, 2019, news of her tragic death shocked not only Iranians but also football fans globally. The incident occurred months earlier on March 12, 2019, when Sahar attempted to attend a football match between Esteghlal FC and Al-Ain of the UAE as part of the AFC Champions League at Tehran’s 100,000-seat Azadi Stadium. Security officials were conducting routine checks to prevent contraband from entering and to ensure no women disguised as men slipped into the stadium.\nParis, September 7, 2024: Exhibition Supporting Iranian Revolution and Condemning Regime’s Crimes\nOn September 7, 2024, in Paris, France, supporters of the People’s Mojahedin Organization of Iran (PMOI/MEK) and freedom-loving Iranians organized a compelling photo and book exhibition. This event was held in solidarity with the ongoing Iranian Revolution and served as a protest against the alarming rise in executions by the Iranian regime.\nGothenburg, Sweden: MEK Supporters Celebrate PMOI Founding Anniversary—September 2024\nGothenburg, Sweden—September 2024: Freedom-loving Iranians and supporters of the People’s Mojahedin Organization of Iran (PMOI/MEK) gathered to commemorate the beginning of the 60th year since the MEK‘s establishment.\nThe Hague, Netherlands: MEK Supporters Celebrate PMOI Founding Anniversary—September 2024\nThe Hague, Netherlands—September 2024: Freedom-loving Iranians and supporters of the People’s Mojahedin Organization of Iran (PMOI/MEK) gathered to commemorate the beginning of the 60th year since the MEK‘s establishment.",
  "word_count": 1140,
  "scraped_at": "2026-02-14T01:49:08.095781",
  "_text_extracted": true
}