{
  "article_id": "f2567dfdad0e",
  "url": "https://www.in.gr/2025/04/03/english-edition/bukovis-great-team/",
  "title": "Bukovi Great Team",
  "date": "20250403T093000Z",
  "domain": "in.gr",
  "source_country": "Greece",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Most coaches don’t get to choose how they leave a team: some depart and are soon forgotten, but others remain in fans’ memories for decades. The case of Márton Bukovi is something completely different.\nHis resignation in late 1967 turned into a saga with political overtones that lasted two weeks and played out mostly in the corridors of the then general secretariat of sports. His resignation and the way it came about overshadowed the two and a half seasons he spent on the Olympiacos bench, and also filled the Club’s fans with frustrated expectations and wishful thinking. In their minds, Bukovi had been the one who would build a new red-and-white dynasty, lead Olympiacos to the Champion Clubs’ Cup (today’s Champions League) and bring then PAOK star Giorgos Koudas to the port city, along with many others.\nBukovi’s resignation has now become a part of Club’s lore and is ineradicably linked with his name even today, almost 60 years after he was photographed at Athens’ main train station waving – clearly emotional – from within a carriage to a few friends who had come to bid him farewell as he began a journey back to his native Hungary.\nBukovi essentially slipped away, leaving Greece without telling practically anyone, in order to avoid what happened in Piraeus just a few days earlier, when months-long speculation that he was considering leaving Olympiacos appeared to be a real prospect.\nA man of deep democratic beliefs, he could not compromise with the authoritarian regime. His presence, as a personality with international prestige and independent voice, was a challenge to the junta\nA father figure\nThere’s a telling description in Thanasis Skroumpelos’ book “The Night That Bukovi Left”, which recounts a procession and gathering by Olympiacos fans, who had assembled from every corner of Piraeus, outside the Castella Hotel on what was then Pavlou Avenue to beseech Bukovi to withdraw his verbal resignation and remain with the Club.\nOlympiacos had recently been defeated at the Georgios Karaiskakis Stadium by AEK Athens 1-4. After the game, Bukovi entered the dressing room and bid farewell to his players. The incident spread quickly by word of mouth from the Neo Faliro field to every corner of Piraeus and its outlying districts. However, it took the next day’s press reports to mobilize the fan base.\nThe circumstances surrounding his departure acted as a magnifying lens for his work over the previous 31 months when he was in charge of Olympiacos. Over the years, nostalgia blurred the lines between what could rightly be credited to Bukovi and what the fans and media wanted to attribute to him.\nIn December 1967, Olympiacos were the reigning champions, having won two consecutive titles (1966, 1967) after a seven-year dry spell when the legendary team of six consecutive championships had completed its cycle.\nBukovi’s contributions during his reign were immense, and that’s why he was adored like a “football messiah” by Olympiacos’ fans. He brought innovations that extended beyond the four corners of the pitch, placing an equal emphasis on on-field and off-field aspects. He promoted players who others considered “washed up”, worked with young players – many of whom would provide the foundations for the great teams of the Goulandris era – and took an interest in each of his players personally. The press in the country always emphasized his tactics, but he knew better than anyone else that no system works unless the players are convinced of its effectiveness and are properly trained to apply it.\nThe reasons for his departure\nMárton Bukovi’s tenure at Olympiacos coincided with one of the most turbulent periods in modern Greek history. In April 1967, a small clique of military officers seized power, ended democratic rule and subsequently attempted to control every aspect of public life. Football, the most popular sports in Greece, was no exception. The military junta tried to use sports as a propaganda tool to promote the image of a strong and united nation.\nBukovi, a man of deep democratic convictions, could not reconcile himself with an authoritarian regime. His presence, as a personality with international prestige and an independent voice, was a challenge to the junta.\nIn December 1967, the junta employed a tactic that would become familiar during its seven-year rule, replacing the Andrianopoulos administration that managed the Club at the time with military officers who owed allegiance to the regime. In fact, this happened just five days before Bukovi submitted his resignation, in writing, to the new Club management.\nThe pressure, however, had been mounting for months, with the junta attempting to interfere with the coach’s decisions and trying to influence player selection, which culminated with the blocking of Giorgos Koudas’ transfer to the Reds from PAOK; they even sought to manipulate the team’s progress. Bukovi’s independence and integrity would not allow him to succumb to such pressure, and the turmoil had led to a distinct slump in play by the end of 1967.\nNevertheless, such a slump would never have been a sufficient condition for dismissal, since Bukovi had the support of the players and the fans. At the same time, to complete the picture, it was well-known at the time that his ever-increasing popularity and imposing personality were causing friction within the team’s management. His letter of resignation didn’t provide details; the fact that it simply stated his desire to leave, without making allusions to persons or situations, would lead to speculation in the sports press for years to come.\nIn any case, Bukovi’s resignation in 1967 was an act of resistance and his departure from Olympiacos a loss for the team and for Greek football.\nBukovi’s contribution was immeasurable, and that’s why he was worshipped like a Messiah by the Olympiacos fans: he brought innovations that went beyond the four lines of the pitch, giving equal emphasis to the on-field and off-field part.\nBefore Olympiacos\nWhen he stepped foot in Greece, Bukovi was already regarded as a top football manager, among the best of his era. He had rapidly achieved fame beyond Hungary’s borders and become a leading figure in post-war European football.\nBukovi’s philosophy had a profound influence on Hungarian football and formed the basis of Hungary’s ‘Golden Team’–the ‘Mighty Magyars’ of the 1950s, who included legends like Ferenc Puskas, Sandor Kocsis and Nándor Hidegkuti. Although he was not on the national team bench himself, his influence was undeniable.\nFor most of the 1950s he worked for MTK, with whom he won three Hungarian championships and one Cup. His time at MTK was essential, because it was there that Bukovi tested the 4-2-4 formation with the players who formed the core of the national team. These concepts were immediately applied to the national team by coach Gusztáv Sebes, while another top Hungarian coach, Béla Guttmann, explained and applied the system in Europe and South America.\nBukovi’s presence with the Piraeus team in the latter half of the 1960s was decisive, perhaps not so much for the development of Greek football, but undoubtedly for how, through the fans’ love, he became a father figure for the Reds. His was a fairy-tale like personality, one that only Olympiacos fans could appreciate.",
  "word_count": 1193,
  "scraped_at": "2026-02-14T01:55:09.085275",
  "_text_extracted": true
}