{
  "article_id": "f290a294f2c3",
  "url": "https://metro.co.uk/2025/08/12/newcastle-west-ham-chase-aston-villa-star-clear-preference-23893020/",
  "title": "Newcastle and West Ham chase Aston Villa star who has clear preference",
  "date": "20250812T134500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle and West Ham are both interested in Aston Villa’s Jacob Ramsey, with the midfielder open to one move in particular.\nThe 24-year-old has two years left on his contract at Villa Park, but the Athletic report that the club have made numerous offers of a new deal that have been rebuffed.\nVilla are open to cashing in on Ramsey while they can and his transfer value is still high, especially with the club in a precarious situation when it comes to Profit and Sustainability Rules (PSR).\nA substantial sale was always likely and even necessary this summer as they work to remain on the right side of the regulations and Ramsey may well be it.\nNewcastle and West Ham are not the only interested parties, with Nottingham Forest also keen, but they appear to be leading the race and Ramsey is reportedly keen on the idea of a move to St James’ Park.\nThe Magpies tried to sign Ramsey in 2024 but were unsuccessful, so he is well aware of how keen Eddie Howe is on him.\nThe chance to work with the Newcastle boss and to play in the Champions League are thought to be attractive propositions for the midfielder.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRamsey was born in Birmingham and came through the youth ranks at Aston Villa, with his only other professional club being Doncaster Rovers on a brief loan spell in 2020.\nHe has made 167 appearances for his boyhood club in all competitions, scoring 17 goals.\nUnder Unai Emery he has been used regularly, but has not been a guaranteed starter, making 29 Premier League appearances last season, but just 19 of those coming in the starting XI.\nHow much Ramsey will cost is not yet clear, with valuations as low as £30m and as high as reported.\nSomewhere in between those figures seems likely for a player who only turned 24 in May and has a lot of Premier League experience, while he also made 10 appearances in the Champions League last season.\nMore Trending\nIt has been a quiet transfer window for Aston Villa so far, with just Evann Guessand arriving from Nice in a £26m as a major signing.\nTeenagers Yasin Ozcan and Zepiqueno Redmond have also been signed, as has veteran goalkeeper Marco Bizot.\nThere have not been any significant departures as yet, with Kaine Kesler-Hayden moving to Coventry City for £3.5m the biggest exit.\nVilla and Newcastle meet in their Premier League openers this weekend, clashing at Villa Park in the 12.30pm kick-off on Saturday.\nMORE: Rasmus Hojlund criticised for delaying Manchester United exit by AC Milan legend\nMORE: Fabian Hurzeler speaks out after Brighton respond to Man Utd transfer bid for Carlos Baleba\nMORE: Chelsea join Man Utd and Man City in transfer race for £26m PSG outcast",
  "word_count": 519,
  "scraped_at": "2026-02-14T01:52:36.778073",
  "_text_extracted": true
}