{
  "article_id": "f2a8012baf65",
  "url": "https://www.bunburymail.com.au/story/8218998/man-utd-desperate-to-stop-a-man-city-fa-cup-win/?cs=280",
  "title": "Man Utd desperate to stop a Man City FA Cup win",
  "date": "20230601T171500Z",
  "domain": "bunburymail.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "All roads from Manchester lead to Wembley Stadium on Saturday for the first ever FA Cup final between the city's arch-rivals - a fitting climax to the domestic season and a clash loaded with significance for both clubs.\nCreate a free account to read this article\nor signup to continue reading\nFor Pep Guardiola's Manchester City, a first FA Cup triumph since 2019 would put them one game away from repeating Manchester United's treble of 1999 - to date the only season in which a club won the English title, FA Cup and Champions League.\nFor United it represents the chance to add the FA Cup to the League Cup they won in February - a domestic cup double they have never achieved before. Having also finished third in the Premier League, would represent an impressive first season at the helm for Dutch coach Erik ten Hag.\nAnother trophy is motivation enough for United, but stopping City's march towards a treble that could be sealed a week later in Istanbul against Inter Milan will fuel their hunger.\n\"We will give everything and, when I say everything, it's everything... the fans can rely on that,\" ten Hag, who has blossomed after a tough start at Old Trafford, said in the wake of his side's semi-final win over Brighton and Hove Albion.\nCity have won a treble before under Guardiola - sweeping all the domestic honours in 2019 when they thrashed Watford 6-0 in the FA Cup final. But repeating United's 1999 feat would rubber-stamp City as the best football team in the world.\nIt would also make redundant a favourite anthem of United's fans, one they gleefully sing to remind City's faithful that they have never won the historic treble that Alex Ferguson's side completed 24 years ago.\nCity's domination of the English landscape is such that United's bragging rights are severely diminished these days, although in terms of FA Cup wins there is still a chasm between the clubs with United seeking a 13th and City a seventh.\nUnited have also won five of their last six FA Cup meetings with City but the last of those came in January 2012.\nCity, driven by the chance of sporting immortality, will start favourites on Saturday in the 142nd edition of the showpiece final, although Guardiola will be wary of a United side they lost to 2-1 in February, avenging a 6-3 mauling at the hands of their neighbours in October.\nAustralian Associated Press",
  "word_count": 412,
  "scraped_at": "2026-02-14T02:07:02.908944",
  "_text_extracted": true
}