{
  "article_id": "f2c4ec79e6de",
  "url": "https://dailynews.co.tz/yanga-kagera-sugar-battle-in-premier-league-opener/",
  "title": "Yanga , Kagera Sugar battle in Premier League opener",
  "date": "20240829T063000Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Yanga, Kagera Sugar battle in Premier League opener\nKAGERA: AS the new football season intensifies, Young Africans (Yanga) and Kagera Sugar are set to battle it out today at Kaitaba Stadium, with both sides eager to secure a crucial victory.\nDefending Champions Young Africans are optimistic about collecting three maximum points in their opening Premier league match, while Kagera Sugar will aim to stop them and secure three points at the home stadium.\nYanga’s Head Coach Argentinian Miguel Gamondi told reporters during a press conference that his team was well prepared for today’s showdown.\n“All our players are in top form.\nWe expect to collect three maximum points.\nHowever, we respect Kagera Sugar as a good team based on our last season’s encounter,” he said.\nYanga, fresh from a remarkable performance in the CAF Champions League, recently dominated Burundian side Vital’O FC with a resounding 10-0 aggregate win in the first preliminary round.\nComfortably registering a dominant 4-0 rout of the luckless Burundian side Vital’O in the first leg of their CAF Champions League’s round tie at Chamazi Complex a week ago, before surprisingly emerging as 6-0 winners in the return leg at Chamazi Complex Stadium.\nALSO READ: Yanga storms into CL 2nd round\nThe Jangwani-based team is now focused on their domestic campaign, aiming to maintain their high standards.\nDoubtlessly, the fabulous triumph has strengthened the hopes of Young Africans to perform well in the Mainland Premier League.\nGamondi also highlighted the team’s intent to defend their title and build on their previous successes.\n“It is a new season, and we are committed to improving on our performance from last year,” he added.\n“Our goal is to defend our title and aim for even greater achievements.”\nThe coach also addressed the difficulties faced during away matches, noting the less-than-ideal conditions of some pitches.\n“We are working on improving our performance in these challenging situations,” Gamondi explained.\nKagera Sugar Head Coach, Paul Nkata, on the other hand, said his players are determined to collect three maximum points in today’s match.\n“We started the league season on shaky foot after losing 1-0 against Singida Black Star in the opening game over the weekend.\nHowever, we have made necessary corrections to avoid a similar defeat.\nAll the players are in good condition except Obrey Chirwa who sustained an injury,” he said.\nHundreds of ardent fans yesterday turned in big numbers to welcome the team when it arrived safely at Bukoba Airport at around 12.30 p.m.\nKagera Regional TFF Secretary, Al-Amin Abdul said kick-off time will be 6:30 pm.\nwhile entrance tickets will be 15,000/- for VIP seats and 5,000/- for normal seats.\nCurrently sitting in 14th place, Kagera is in the relegation zone and desperate for points to turn their season around.\nIn another match today, Coastal Union will face Kinondoni Municipal Council (KMC) at the KMC Complex in Dar es Salaam.\nThe game promises to be an exciting encounter, with both teams making tactical adjustments.\nKMC Head Coach Abdi Hamid Moallin expressed confidence after a strong preseason, stating that his team is ready to make an impact in the 2024/25 Premier League.\n“We had a fantastic preseason and have prepared extensively,” Moallin said.\n“Against Coastal Union, we aim to show our fans what we’re capable of this season.”\nMoallin acknowledged Coastal Union’s reputation and stressed the importance of a solid performance.\n“Coastal Union is a formidable opponent, and we must be at our best to secure a victory,” he noted.\nCoastal Union’s Coach Ngawina Ngawina also recognized KMC’s strength, promising a competitive match.\n“We respect KMC as one of the top teams with experienced players,” Ngawina said.\n“However, we are well-prepared and determined to start the league with a win.”\nNgawina called on Coastal Union fans to support their team, recalling the positive impact of fan support in the previous season.\n“Our fans played a crucial role in our success last season, and we hope they continue to support us,” he added.\nThe clash between Coastal Union and KMC is expected to be a thrilling encounter, with both sides eager to kick off their season on a high note.",
  "word_count": 688,
  "scraped_at": "2026-02-14T02:25:54.607440",
  "_text_extracted": true
}