{
  "article_id": "f2c7182592d0",
  "url": "https://punchng.com/gittens-double-sends-dortmund-past-frankfurt-leipzig-win/",
  "title": "Gittens double sends Dortmund past Frankfurt , Leipzig win",
  "date": "20240824T203000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Two superb solo goals from English winger Jamie Gittens took Borussia Dortmund to a 2-0 home win over Eintracht Frankfurt in their Bundesliga opener on Saturday.\nWith the match surprisingly lifeless and heading towards a scoreless draw inside the final 20 minutes, Frankfurt’s Fares Chaibi shot over the bar with an empty goal beckoning.\nTwo minutes later, Gittens cut back in from the left flank and blasted a shot in off the crossbar.\nGittens, who changed his name from Bynoe-Gittens in the summer, had come off the bench just 14 minutes earlier.\nIn the third minute of added time and with Frankfurt pushing for an equaliser, Gittens collected the ball inside his own half and powered up the pitch, firing in his second to seal the match.\n“It’s a crazy feeling to score not one but two,” Gittens told Sky. “First game of the season, it’s very important. That was very good today.”\nThe result means new Dortmund coach Nuri Sahin, who replaced Edin Terzic in the summer despite the latter taking the club to last year’s Champions League final, can celebrate his Bundesliga debut with a victory.\nSahin came through the junior system at Dortmund before stints at Liverpool and Real Madrid.\nThe victory is Dortmund’s 10th straight opening round win.\n– Nusa scores on debut –\nEarlier on Saturday, Norwegian teenager Antonio Nusa scored on his Bundesliga debut to take RB Leipzig past Bochum 1-0 at home.\nNusa, 19, was brought in to replace Barcelona-bound Dani Olmo this summer, scored just four minutes after coming on, thumping a long-range effort through a crowded penalty box to give Leipzig the lead.\nLeipzig, German Cup winners in two of the past three seasons, were forced to sweat when captain Willi Orban saw red for a last-man foul on Myron Boadu with five minutes remaining, but held on.\n“For his young age, he’s very grown up,” Leipzig sporting director Rouven Schroeder told Sky.\n“He was really happy he scored but don’t worry, he’s not letting up.”\nStuttgart, fellow Champions League participants alongside Leipzig, Stuttgart lost 3-1 at a Lukas Kuebler-powered Freiburg.\nNew Stuttgart striker Ermedin Demirovic, brought in to replace the Dortmund-bound Serhou Guirassy, opened the scoring with an acrobatic effort two minutes in.\nKuebler levelled things up with a low, long-range strike in the first half and Freiburg took the lead early in the second when Ritsu Doan’s messy effort dribbled across the line.\nKuebler’s 61st-minute header put Freiburg in control in their first match since the departure of long-term manager Christian Streich, who left the club after 13 years in charge in the summer.\nTasked with filling Streich’s boots, new coach Julian Schuster praised “a great start for us, the lads played unbelievably well.”\nUnion Berlin snatched a point at Mainz, a 74th-minute rocket from Laszlo Benes cancelling out Nadiem Amiri’s first-half goal for a 1-1 draw, with former Mainz manager Bo Svensson now in the Berlin dugout.\nUnion played Champions League football last season but only avoided relegation in the final match.\nA hat-trick from forward Andrej Kramaric, including a penalty, a header and a close-range strike, took Hoffenheim to a 3-2 win over promoted Holstein Kiel.\nKiel, playing their first ever game in the top division, were reduced to 10 men on 82-minutes when Andu Kelati picked up a second yellow for a lazy challenge.\nAugsburg held Werder Bremen to a 2-2 draw at home, Elvis Rexhbecaj and Samuel Essende scoring for the hosts and Felix Agu and Justin Njinmah goaling for the visitors.\nAFP",
  "word_count": 588,
  "scraped_at": "2026-02-14T02:14:29.073581",
  "_text_extracted": true
}