{
  "article_id": "f2dea51ec175",
  "url": "https://www.myjoyonline.com/slovenian-vincic-to-referee-galatasaray-v-fenerbahce/",
  "title": "Slovenian Vincic to referee Galatasaray v Fenerbahce",
  "date": "20250224T163000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nSlovenian referee Slavko Vincic has been appointed for the Istanbul derby between Turkey's title rivals Galatasaray and Fenerbahce.\nThe 45-year-old has been drafted in by the Turkish Football Federation for Monday's top-of-the-table fixture after a request from both clubs, according to ESPN., external\nThe decision to use the official who took charge of last season's Champions League final follows several controversies in Turkish football over the past 18 months.\nAdana Demirspor walked off the pitch during their match with Galatasaray earlier this month in protest at a penalty awarded against them.\nThe league was suspended in December 2023 after a referee was punched on the pitch by MKE Ankaragucu president Faruk Koca after his team conceded a 97th-minute equaliser.\nFenerbahce trail league leaders Galatasaray in the Super Lig by six points before Monday's game (17:00 GMT).\nFenerbahce head coach Jose Mourinho has welcomed the decision after previously describing the environment in the country as \"toxic\".\n\"I think it's important for the credibility, for the image of the match,\" Mourinho said.\n\"If it is a top referee, and it's a top European referee, I am happy with that because I love to win like everybody else but I am a person that needs fair play.\"\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n6 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n31 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n33 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 431,
  "scraped_at": "2026-02-14T02:14:59.448486",
  "_text_extracted": true
}