{
  "article_id": "f2fc723d22ae",
  "url": "https://www.teamtalk.com/news/exclusive-man-city-beat-arsenal-liverpool-declan-rice-deal-monster-transfer-force-trio-including-42m-signing-out",
  "title": "Exclusive : Man City to beat Arsenal , Liverpool to Declan Rice deal , but monster transfer will force trio including £42m signing out",
  "date": "20230301T134500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Exclusive: Man City ready to beat Arsenal, Liverpool to Declan Rice deal, but monster transfer will force trio including £42m signing out\nThe battle to sign West Ham star Declan Rice is heating up with Graeme Bailey explaining to TEAMtalk why Manchester City now need to be considered favourites to sign the England midfielder.\nRice made his professional debut with the Hammers back in 2016/17 season and is now established as one of the Premier League’s best midfielders.\nCapped 39 times by England, he is also a regular in the Three Lions’ side under Gareth Southgate.\nHowever, his deal at West Ham is due to expire in summer 2024 and his future appears increasingly likely away from the London Stadium.\nTo that end, Rice himself admits he wants to test himself at a higher level. And with virtually all his Three Lions teammates playing regular Champions League football, Rice is seemingly pushing for a move away.\nIndeed, he has persistently rejected West Ham’s efforts to tie him down to a new and improved deal. And while the Irons are seemingly prepared to make him the highest-paid player in their history, a summer exit appears on the cards.\nDavid Moyes is well aware of the situation too. And he insists that any deal for Rice is likely to cost his suitors a British record transfer fee.\nThat currently stands at the £105.7m Chelsea paid for Enzo Fernandez.\nDespite the lofty sums involved, there are several sides seemingly queuing up to prise Rice away.\nREAD MORE: Arsenal take big strides towards Declan Rice deal as Arteta lulls Edu into crazy contract offer\nDeclan Rice a man in demand\nThat hunt has long been led by Chelsea, though it remains to be seen if they will make a fresh move following their £500m spree.\nFurthermore, new deals for N’Golo Kante and Mateo Kovacic, alongside the signing of Fernandez, may supress their desire to sign him.\nArsenal are also being strongly linked of late, though they might not quite match the level of fee West Ham will surely demand.\nThere is also interest from Manchester United and Liverpool, though the north-west rivals may instead focus on other targets instead.\nAs a result, Bailey has told TEAMtalk there is a new favourite in the race for his signature.\n“The race for Declan Rice is again intensifying,” Bailey said. “He is leaving West Ham United this summer – everyone knows it, but it is again unclear where he might end up.\n“For a long time most of the big six wanted him, but that interest narrowed as other targets came up, to the point that Chelsea were very much in pole position to secure his signature.\n“And Chelsea remain enticed with the idea of bringing Rice back to the club he began his career with, the club he supported as a child.\n“But there are now facing real competition for the England star.\n“Arsenal are keeping tabs on the situation as we know, but their interest will be dependent on the fee West Ham ask, which could be over £100m.”\nMan City new favourites for Rice\nHowever, one side that does not often get a mention for Rice is Manchester City.\nYet Bailey thinks a trio of summer departures at the Etihad, including potentially last summer’s £42m signing, Kalvin Phillips, could pave the way for Rice to sign.\n“One side that needs watching is Manchester City who are again seriously considering him as part of a possible midfield overhaul,” Bailey revealed.\n“With Ilkay Gundogan, Bernardo Silva and possibly Kalvin Phillips all possible departures, there will be more than enough room at City to take him and they have always appreciated him.\n“And I am told that their interest in Jude Bellingham would not mean one or the other, they could be taking both.\n“The same can’t be said of Liverpool as their main interest remains firmly in the pursuit of Jude Bellingham – who is yet to make a decision on his future. But they won’t be looking at both players.\n“Manchester United have always liked Rice too. But following the arrival of Casemiro last summer, it does not appear they have rekindled their interest at this point.”",
  "word_count": 702,
  "scraped_at": "2026-02-14T01:55:49.881346",
  "_text_extracted": true
}