{
  "article_id": "f30b0b92b3f9",
  "url": "https://metro.co.uk/2024/10/25/i-coached-cole-palmer-england-brilliant-one-weakness-21868210/",
  "title": "  I coached Cole Palmer with England – he brilliant but has one weaknes | Football",
  "date": "20241025T200000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ex-England coach Jimmy Floyd Hasselbaink has paid tribute to ‘exceptional talent’ Cole Palmer and says the Chelsea star only has ‘one weakness’.\nPalmer has enjoyed a stunning rise for club and country over the last few years, establishing himself as one of the best players in the Premier League and a regular for England.\nThe 22-year-old scored 25 goals during his first season at Stamford Bridge, his form in west London earning him a nomination for the Premier League Player of the Season award.\nPalmer’s form also saw him included in Gareth Southgate’s England squad for Euro 2024 and he impressed in his brief appearances for the Three Lions, scoring in the final against Spain.\nThe ex-Manchester City playmaker, who is contracted to Chelsea until the summer of 2033, has continued his brilliant run this season, scoring six goals in seven league games, including four in one record-breaking first-half against Brighton.\nFormer Chelsea striker Hasselbaink has been hugely impressed by Palmer, describing him as an ‘exceptional player’ who only has one weakness.\nHasselbaink worked with Palmer at several England camps as one of Gareth Southgate’s assistant coaches.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Cole Palmer is among the best players in the world when he’s in the zone, whatever he tries to do works,’ Hasselbaink told BoyleSports.\n‘He plays on feeling and it’s working. He’s an exceptional player. He’s an exceptional talent. He doesn’t need a lot of maintenance and he just wants to play football.\n‘He reminds me of a street footballer from back in the day, I was afraid that they were going out of the game but he has brought that back.\n‘The only weakness you can say he has is heading the ball, but he can pass, score, assist and take free-kicks. He is exceptional.’\nChelsea have enjoyed a surprisingly impressive start to the season, only losing two of their opening eight league games to emerge as early top-four contenders.\nHasselbaink believes his former club remain a ‘long way’ from Manchester City and Liverpool but insists Chelsea are ‘moving in the right direction’ under Enzo Maresca.\n‘As the manager has said, Chelsea are still a long, long way from Manchester City and Liverpool,’ he added.\n‘Having said that, they are moving in the right direction and it’s all about making the gap smaller and smaller as time goes on and that is exciting.\n‘Some things in football take time and other things happen very quickly, they need to let the manager work and get behind him.\n‘Football is about consistency and if they show that they could eventually compete for the title again.’\nChelsea, who lost 2-1 to Liverpool last weekend, return to Premier League action on Sunday against Newcastle United.\nSpeaking at his pre-match press conference, Blues boss Maresca said Palmer was ‘learning the difficulties and challenges’ of being heavily marked this season.\nMore Trending\n‘We use it as a weapon that opposition want to heavily mark him,’ said Maresca.\n‘But it also the next step for him for him getting used to that situation. He has to learn the difficulties and challenges of being marked man to man.\n‘It is about a matter of balance within the team. We used to play around Cole because he’s a more physical player and the Premier League requires you to be defensively strong.\n‘Now we have other alternatives to add to the attack.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: West Ham manager Julen Lopetegui defends Erik ten Hag from one criticism\nMORE: Sergio Aguero names his three ‘favourites’ to win the Champions League\nMORE: Gary Neville tells Arsenal fans to stop making ‘excuses’ and makes prediction for Liverpool clash",
  "word_count": 676,
  "scraped_at": "2026-02-14T02:25:58.966593",
  "_text_extracted": true
}