{
  "article_id": "f31ca1397c0d",
  "url": "https://www.teamtalk.com/news/alexander-arnold-next-the-last-10-players-real-madrid-convinced-to-leave-their-local-team",
  "title": "Alexander - Arnold next : Players Real Madrid convinced to leave their local teams",
  "date": "20250326T181500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Trent Alexander-Arnold done deal: The last 10 players Real Madrid convinced to leave their local team\nTrent Alexander-Arnold’s move to Real Madrid has left some Liverpool fans feeling betrayed by a local player leaving his boyhood side for free.\nAlexander-Arnold had ambitions of becoming Liverpool’s captain after rising through the ranks at Anfield, but his destiny is now taking him to Spain after the long-awaited news of his move to Real Madrid when his contract expires was finally confirmed on Monday.\nWith all he has achieved as a Liverpool player, in another world his farewell should have been one of gratitude – but that’s threatening to not be the case.\nAlexander-Arnold is facing criticism for turning his back on his local team, charmed away by the power and allure of Real Madrid.\nIn the past, other players have shown more loyalty to their hometown teams even when Real Madrid have come calling. Francesco Totti opted to stay at Roma in 2004 much to Florentino Perez’s bemusement, Marco Reus stuck with Borussia Dortmund in 2015, and a certain Steven Gerrard remained committed to Liverpool despite interest from Los Blancos throughout various stages of his career.\nBut a move to Madrid has proved too tempting for some others, so Alexander-Arnold won’t be the first player to leave his boyhood club to go on and wear the famous white shirt.\nHere, TEAMtalk takes a look at the last 10 players before Alexander-Arnold to ditch their hometown team for Real Madrid – and how they fared.\nKylian Mbappe\nMadrid’s big capture from the free-agent market last summer was long-term target Kylian Mbappe, who finally made the move to Spain after seven seasons with Paris Saint-Germain.\nWhile Mbappe actually began his career with Monaco – costing PSG €180million to sign in 2017 – he was born in Paris back in December 1998.\nBut it was Madrid that Mbappe always dreamed of playing for and he finally got his wish in 2024 after running his contract down.\nDespite being PSG’s record goalscorer, Mbappe was booed by supporters at the Parc des Princes ahead of his final game for the club in May 2024. It wasn’t the first time they’d not taken kindly to his visions of a future in Madrid.\nBut when that vision finally materialised, Mbappe began to make the impression he had always anticipated. While his first season in Spanish football hasn’t been entirely plain sailing, he does have 30 goals to his name already.\nAlvaro Odriozola\nAlexander-Arnold might not be welcome back at Liverpool given the circumstances in which he’ll be leaving for Madrid, but that wasn’t the case for the last right-back to make a similar move.\nBorn in San Sebastian, Alvaro Odriozola was a product of the Real Sociedad academy and made 50 La Liga appearances for the Basque side before Madrid bought him in 2018.\nThings never really got going for Odriozola in the capital. Either side of loan spells with Bayern Munich and Fiorentina, he only made 34 La Liga appearances for Los Blancos.\nIn September 2023, he was allowed to return to Real Sociedad, but injury problems have affected him again.\nDani Ceballos\nAfter being named the player of the tournament at the 2017 European Under-21 Championship, Dani Ceballos was coveted by a host of high-profile clubs.\nReal Madrid won the battle to buy him from Real Betis, the club based no more than a 40-minute drive from his birthplace in Utrera, Andalusia.\nCeballos surpassed a century of appearances for the Seville-based side before his move to Madrid, where he spent two seasons before a two-year loan to Arsenal.\nSince then, the midfielder has been back at the Bernabeu. He was linked with a return to Betis in 2023 before renewing his contract in Madrid, which led to him being booed by fans of his former club at their next meeting for leading them on.\nREAD MORE – The best free signings Real Madrid have ever made with Trent Alexander-Arnold next\nMarco Asensio\nBorn in Palma, the largest city on the Balearic Islands, Marco Asensio learned his trade with Mallorca.\nTennis legend and fellow native of Mallorca, Rafael Nadal, helped convince Asensio to move to Madrid towards the end of 2014, although the attacking midfielder stayed in the Segunda Division on loan for the rest of the 2014/15 season.\nAfter another loan spell – this time in La Liga with Espanyol – Asensio was integrated into the Madrid first team in 2016 by Zinedine Zidane. By the end of his debut season, he was a La Liga and Champions League winner.\nAsensio ultimately stayed in Madrid until 2023, scoring 61 goals from 286 appearances before a move to Paris Saint-Germain as a free agent.\nHe is currently on loan in the Premier League with Aston Villa.\nJesus Vallejo\nIn terms of time on the books, Jesus Vallejo is one of Real Madrid’s longest-serving players, but his appearance record wouldn’t show it.\nPart of the Zaragoza system since the age of 11, Vallejo emerged in the Segunda Division with his hometown team in the 2014/15 season, after which Madrid signed him.\nBut he wouldn’t make his debut for the club until the 2017/18 campaign, after a loan back at Zaragoza and then another in Germany with Eintracht Frankfurt.\nThe centre-back has also since had spells with Wolves and Granada, but has largely been a backup player whenever part of the Madrid squad.\nIn fact, even if we were to ignore his loan spell, Vallejo still has as many appearances for Zaragoza as he does for Madrid.\nAsier Illarramendi\nAsier Illarramendi was born in Mutriku, part of the Gipuzkoa province of the Basque Country – less than an hour away from where Real Sociedad are based.\nHe developed in La Real’s academy and worked his way up from the B team to the first team as they found their feet again in La Liga in the early 2010s.\nFor his efforts in the 2012/13 season, in which La Real qualified for the Champions League, Illarramendi earned the LFP Awards for the Breakthrough Player and the Best Midfielder.\nAnd not just that. A move to Madrid beckoned for the then-23-year-old, who became Los Blancos’ most expensive Spanish signing ever.\nIllarramendi only lasted two years in the capital, though, before being sold back to La Real for about half the fee Madrid had paid them.\nHe would spend another eight seasons in San Sebastian before an MLS move with FC Dallas.\nIsco\n“That’s the silliness over now, right?” Isco said to Illarramendi when the midfielder was busy greeting former teammates and directors on his first return to Real Sociedad as a new Madrid player.\nIsco himself knew all about what it took to leave your local team in search of bigger glory at Real Madrid, having left Malaga – based just along the Costa del Sol from his birthplace of Benalmadena – in 2013.\nLike Mbappe, Isco didn’t actually start his career with his local team, instead emerging at Valencia before returning closer to home.\nAfter two seasons, the second of which included Champions League involvement right the way up to the quarter-finals, Malaga sold Isco to Madrid for €30million. The paths of club and player were about to diverge significantly.\nThe playmaker became the first signing of the Carlo Ancelotti era at Madrid and went on to score 11 goals in his debut season.\nIsco ultimately spent nine years as a Madrid player – with 53 goals to show for it – before returning to Andalusia, initially with Sevilla for a short stint and then with Real Betis.\nBy the time he left Madrid in the summer of 2022, his former club Malaga had just finished one place above the relegation zone in the Segunda Division. They dropped to the third tier in 2023, before sealing an instant return.\nSergio Canales\nA native of Santander, Sergio Canales enjoyed a 15-year career in La Liga.\nIt began with hometown club Racing Santander, where Madrid bought him from in the summer of 2010.\nCanales only lasted one season under Jose Mourinho before moving on to Valencia. He never scored from 15 appearances.\nHowever, Canales carved out a respectable career for himself and earned 11 Spain caps between 2019 and 2023.\nSami Khedira\nBefore shooting to prominence at the 2010 World Cup, where Germany reached the semi-finals, Khedira had been developing with Stuttgart for 15 years.\nThe midfielder made 98 Bundesliga appearances before Madrid made their move for him as a 23-year-old.\n“It’s never great to lose a key player and someone who was close to the fans,” Stuttgart’s sporting director Fredi Bobic said. “But on the other hand we accept his wish to continue developing his career in Madrid.”\nKhedira enjoyed a total of five seasons in Madrid, the first three being much busier than the final two. During that time, he became a world champion with Germany as well.\nHe joined Juventus when his contract expired in 2015.\nKarim Benzema\nA genuine Real Madrid legend, Karim Benzema began his career with Lyon, the club from the city of his birth.\nHe netted 54 goals across his final two seasons with Lyon to convince Madrid to go for him; his arrival was confirmed in July 2009.\nOnly in the first of his 13 seasons at Madrid did Benzema fail to hit double figures of goals. He ended up with 354 goals to his name, second on their all-time list, as well as becoming the player with the most assists in club history.\nBenzema left on a free transfer for Saudi Pro League side Al-Ittihad in 2023 but has indicated an openness to returning to where it all began.\nIn 2021, he declared: “I’m currently what I am thanks to Lyon. With respect to coming back, not at the moment, I want to keep on making history at Real Madrid, which is the best team in the world. After that you never know. End my career at Lyon? Why not?”\nHe was linked with a Lyon comeback in January 2024, but it still hasn’t happened. Madrid will certainly be the club he’ll be most remembered for his service to.",
  "word_count": 1695,
  "scraped_at": "2026-02-14T02:02:35.597370",
  "_text_extracted": true
}