{
  "article_id": "f31e44d37410",
  "url": "https://toffeeweb.com/season/24-25/rumour-mill/46260.html",
  "title": "Everton closing in on Thierno Barry of Villarreal Rumour Mill",
  "date": "20250611T150000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Season › 2024-25 › News\nEverton closing in on Thierno Barry of Villarreal\nEverton are closing in on Villarreal’s 22-year-old striker Thierno Barry and are willing to pay his release clause, reports reliable transfer journalist Matteo Moretto.\nThe Blues have made Barry their number one choice for the striker position after failing to sign Liam Delap from Ipswich Town. The French forward has made 35 appearances in La Liga this season and scored 11 goals and registered four assists.\n“Everton is chasing Villarreal striker Thierno Barry,” Moretto wrote on the social media platform X (earlier known as Twitter).\n“The English club is reportedly willing to pay the €40 million buyout clause. Evaluations are ongoing and no final decision has yet been made.”\nBorn in Lyon, France, Barry was a prolific goal-scorer for FC Sochaux-Montbéliard B and SK Beveren in France and Belgium respectively. He spent a year in Switzerland with FC Basel, scoring 20 goals in 41 appearances before joining the Yellow Submarines in La Liga last season.\nWhile there’s certainly a talented player with plenty of potential in there, the amount being mentioned is too steep. The Blues would be better off trying to negotiate a fee a lot lower than the release clause, but with Villarreal qualifying for the Champions League next season, they might be unwilling to sell him for anything less.\nIt remains to be seen how the situation evolves but what can be taken for granted is that Everton’s interest in Thierno Barry is genuine, as confirmed by several reliable outlets over the last few days.\nReader Comments (120)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 07/06/2025 at 19:31:35\n2 Posted 07/06/2025 at 19:41:14\n3 Posted 07/06/2025 at 19:50:57\nWhat about Castellanos at Lazio?\n4 Posted 07/06/2025 at 20:08:17\n5 Posted 07/06/2025 at 20:16:19\n6 Posted 07/06/2025 at 20:18:32\nHe is the next big French striking sensation after Ekitike and he seems to score all sorts of goals. I would much prefer him than Delap as he looks to have a much higher ceiling to me.\nThe last Barry we signed didn't do too badly for us.\n7 Posted 07/06/2025 at 20:35:24\n8 Posted 07/06/2025 at 20:41:47\n9 Posted 07/06/2025 at 20:43:38\nConsidering these improvements, he is still young and has the potential to become one of La Liga's top strikers.\n10 Posted 07/06/2025 at 20:45:28\nSupposedly his hold up play and passing needs working on… where have I heard that before?\n11 Posted 07/06/2025 at 21:10:48\nIf so or not, if he is anywhere near as good (different position I know) we will do well. I would prefer the German lad though if it down to choice.\n12 Posted 07/06/2025 at 21:31:23\nWith Villareal having qualified for the Champions League, we'd be buying at a premium price too. He only cost €14.00m last summer, so €40.00m is good business for them.\nNot a massive fee for a striker - much the same as Brentford and Bournemouth paid for Thiago and Evanilson last summer - but obviously a big chunk of our transfer kitty.\nPaul # 7, there isn't really a player on the market who fits the description for us. The real quality strikers who might move this summer are:\nEkitike\nGyokeres\nSesko\nOsimhen\nNone of these players would consider joining Everton, although we could have bought them at different stages of their careers.\n13 Posted 07/06/2025 at 21:35:37\n14 Posted 07/06/2025 at 21:35:45\n15 Posted 07/06/2025 at 21:59:17\n16 Posted 07/06/2025 at 22:01:51\n17 Posted 07/06/2025 at 22:10:59\nIf we get Barry, that would mean:\nBarry - c. £37m\nAlcaraz - £13m (ish)\nRemainder - £50m\nThat £50m will have to stretch a long way to cover all the departures and improve the quality / depth. We can pick up some frees and loans - but it's still a big challenge.\n18 Posted 07/06/2025 at 22:21:13\nThis kid is the total opposite to Beto. He is a natural finisher and scores left foot, right foot, headers and poachers goals.\nHis movement in the box is excellent and he's a really sharp, elastic type of striker.\nIn terms of minutes played he's better than a 1 in 2 every where he's been and he's still only a kid. Beto is 27 and scored more than 13 goals once in his career.\nI couldn't think of 2 more dissimilar strikers\n19 Posted 07/06/2025 at 22:22:41\n20 Posted 07/06/2025 at 22:24:39\nUm, exactly!! Because??? He's Not good enough!!\n21 Posted 07/06/2025 at 22:26:36\n22 Posted 07/06/2025 at 22:49:27\nThe squad is thin, plus we have another load out of contract next summer if options aren't exercised.\n23 Posted 07/06/2025 at 22:58:27\nConor, yes, Beto. If we do sign him, hopefully he kicks on.\n24 Posted 07/06/2025 at 23:12:13\n25 Posted 07/06/2025 at 23:14:42\nThat didn’t work out too well last time though did it?\n(Appreciate it was under a different administration but once bitten….)\n26 Posted 08/06/2025 at 00:17:39\nIt's 'cos they take the chance, look at Wolves with Cunha, bought for the same sort of price, scores loads of goals and sold at a good profit.\n27 Posted 08/06/2025 at 00:38:39\n28 Posted 08/06/2025 at 01:18:04\nI wouldn't believe myself to be saying this 10 months ago but if we can't buy a top up and coming striker (like Delap) as we did when buying Lukaku, then we should be giving Beto a proper go, back him and get players around him to can play to his strengths. He managed to bag under Moyes, why not see if that continues.\nChiamiti needs to be given ago as back up also or we have spoknked our money yet again, plus he looked like he has something in the short minutes he's played.\nIf we are realistic we have 100m tops, we need half a squad, I'd have happily paid £30m for Delap as he looked to have resale value, but taking chances on players who just about hit double figures in la liga seems like more of the same...same as Sandro, same as Tosun, Niasse, and so on (although not from Spain league I'm aware, just talking about levels).\nOne thing worries me with Moyes, he's very good at spotting bargains, but hes always been average at best at picking strikers. Yakubu was his best buy in the strikers department, injury killed him, but even at West ham when they had the Rice money he could t get better than Antonio who he inherited.\n29 Posted 08/06/2025 at 02:58:19\nAs to being a natural finisher, Conor, I'd say not yet. I've seen him blast the ball into row Z from eight yards out. But he certainly scores more often than Beto did at the same age, and at a higher level, so the talent is there.\nI really didn't expect us to spend so much on a young striker when I see so many greater needs, but if Rob and Gavin are right about an installment plan, getting this kid might turn out to be a coup.\n30 Posted 08/06/2025 at 04:54:08\n31 Posted 08/06/2025 at 05:34:35\nMoyesy will probably play him as a winger for the first 6 months.\n32 Posted 08/06/2025 at 05:38:15\n33 Posted 08/06/2025 at 06:01:43\n34 Posted 08/06/2025 at 06:33:23\nI could understand your comment more if he had started 25/30 games and totally underachieved. But he hasn't.\nI would like to see him start more games before I write the lad off completely.\n35 Posted 08/06/2025 at 06:46:30\nAnnika, agreed. Chermiti hasn't failed. I hope he's healthy and gets a fair shot.\n36 Posted 08/06/2025 at 06:52:37\nHe was injured for a lot of the season. Hard to judge him just yet on the few appearances he was able to make.\nWhen he did play, he showed glimpses of his ability, and let's not forget that he's still only 21.\nJury's out, but let's see more of him before deciding how good he is or isn't.\n37 Posted 08/06/2025 at 07:15:12\nOh well, sign him up then!\n38 Posted 08/06/2025 at 07:34:49\nI'm not against signing Barry. I don't claim to be one of those people who make out they have seen every player we are linked with – they must stay awake 24/7 and never have time to watch Everton.\nLike Conor, I have only seen him once – never enough to make an informed judgement.\n£30M for Beto has been proven to be a mistake, no mater how we paid it up. Are those comparing the two players really advocating we make the same mistake?\n40 Posted 08/06/2025 at 08:07:16\nHe's played just over 4 match equivalent in 2 seasons, and is not going to progress unless he's playing regularly.\nHe's not had a sniff under Moyes, which would signal he's unlikely to be kept on in the first team for next season. Striking options look limited if he's out with Broja and Calvert-Lewin released.\n41 Posted 08/06/2025 at 08:20:29\nWe have always said jokingly that Messi would find it hard to score goals (he probably wouldn't) in our team. Why? — because there is no creativity in midfield.\nWe have seen how Beto thrives when a player of quality (Alcaraz) provides the service. For me, midfield is the most important area to improve.\n42 Posted 08/06/2025 at 08:46:35\nGet it wrong we have an expensive dud, get it right and we move forwards, make money on our investment and start looking like a serious business outfit for a change.\nI do like researching players but not to the depths of some better informed folk on here. I can't profess to know too much about this lad but from what I have seen, he seems to have something. Big, strong and a handful but then so is Beto as others have rightly said.\nPersonally i'd prefer Emegha but they have very similar profiles and I only say that because he is someone i've keep an eye on a bit more. Guessand another who is quite similar and as Sam (i think) mentioned in another thread, he could be blooded on the right wing in season one.\nThe silly season paradox, love the speculation - hate the uncertainty!\nAndrew @41, that's why I think we should offer big wages to Angel Gomes on a free contract. He would bring creativity to the middle of the park and knit the play nicely.\n43 Posted 08/06/2025 at 08:49:15\nBarry looks a good young player, as Robert says he's probably around Beto's level now but has the potential to outstrip him in time. Maybe Barry could play as a winger initially, his defensive work seems solid.\n44 Posted 08/06/2025 at 09:12:01\nI like him and think he could develop further, potential cult hero vibes about him.\n45 Posted 08/06/2025 at 09:18:05\nThis is less than Wolves paid for Cunha and Brighton paid for Rutter - and about the same as Bournemouth and Brentford paid for Thiago and Evanilson.\nIt is probably about the same as the €11m we paid for Andy Johnson all those years ago (but less than Beattie).\nA statement striker costs upwards of £65m these days - and even then can be hit and miss as we've seen with Solanke, Hojlund and Nunez.\nIf Barry was regarded highly enough to be a hit straight away it is likely he would be out of reach for us - because richer clubs would want him. As it is he's potential that needs time to develop.\n46 Posted 08/06/2025 at 09:21:25\nIf we buy an additional striker, surely we should buy a player with different skill sets?\nRobert, you suggested Santiago Castro from Bologna, who is smaller but can pass accurately, dribble, make assists and get 10 goals a season.\nHe looks impressive.\n47 Posted 08/06/2025 at 09:28:33\nPotential too at this stage but much more to his game.\n48 Posted 08/06/2025 at 09:30:24\nBeto has changed a few fans minds because he has had more minutes, scored some goals, and the lad gives 💯 every game.\nJake O'Brien is another one who, according to some must be shite cos Gobshite Dyche never game him a chance.\nRegarding our interest in Barry, for me, these are the type of players we should be targeting,\n49 Posted 08/06/2025 at 09:36:56\nSomeone like Castro or my favourite, Guessand, who can play right-wing, or Woltemade, who can play No 10 or second striker, would make more sense (unless the plan is to sell Beto).\n50 Posted 08/06/2025 at 09:38:35\nWhat we want are footballing midfielders who are comfortable on the ball.\n51 Posted 08/06/2025 at 09:46:08\nGet Agent Charly in to have a word, it would be amazing to have two talented, young Argentinians in the team.\n52 Posted 08/06/2025 at 09:56:59\nSam @ 43, Beto is not really an expensive striker.\n53 Posted 08/06/2025 at 09:57:19\nOther clubs tend to spread their risk by buying their potential cheaper and at higher volume.\nBut if Barry does develop his all-around game over a couple of seasons – and score goals at a decent rate – then it would have proved to be a good use of budget.\n54 Posted 08/06/2025 at 10:09:29\nHe was our second costliest transfer over the last 5 years – beaten only by Onana. Ideally such a relative expense doesn't sit on the bench.\n55 Posted 08/06/2025 at 10:11:53\nThat doesn't necessarily mean Barry is the perfect replacement.\n56 Posted 08/06/2025 at 10:41:13\nWe need a prolific scorer. German lad looks the business. And if we could get him at the price being quoted, which is £16M, I would definitely be looking at getting them both in.\n57 Posted 08/06/2025 at 10:53:57\n58 Posted 08/06/2025 at 11:20:15\nYes, it means we are perhaps seen as a selling club for a while… but progress might be made and might make us more financially stable.\nHowever, we as a fanbase might have to accept it, which I can't see; we'd also need to avoid the noise coming from that other local club, also difficult.\n59 Posted 08/06/2025 at 11:33:05\nWhat bit of Chermiti I've seen, there is a Premier League player in there unless my eyesight is failing. I suppose, though, Moyes should know better than me how good he is likely to be.\nThat's the trouble, managers are not keen to take chances on players that are knocking on the door. If one doesn't work out, the fear of relegation rears its ugly head.\n60 Posted 08/06/2025 at 11:39:38\nAlthough he is currently playing in a ‘better' side, he will earn much more at Everton. And Villarreal know they can replace him with someone like the very similar Yoan Bonny of Parma for a lower price.\n61 Posted 08/06/2025 at 11:44:20\nWhen we were linked with the latter for only £15M, there was much angst about his finishing, his rawness, his game time at PSG and his goal returns and who they were against.\nBarry is much further ahead in his development than Ekitike was. Beto, conversely, has always been regarded as a journeyman type of striker.\nMy guess is that Moyes will want to cash in on Beto as, when Dominic was fit, he started; when Broja came back, he also was preferred initially.\nThe fact Dominic is out of contract and still no deal done with anyone or murmurings to that effect, suggests to me that Moyes is confident of keeping him and Barry will be seen a different profile (explosive, can square defenders up, goalscorer).\n62 Posted 08/06/2025 at 11:51:01\nSome will be lucky and buy gems and some will make poor buys. We have done well recently in terms of buys and I prefer to trust the club to do a great job to the best of their ability.\n63 Posted 08/06/2025 at 11:51:37\nThis Football Manager thing is easy.\nShame Kevin-Prince Boateng has retired, could have been a decent front 3: Bonny Prince Charly…\nGot me coat.\n64 Posted 08/06/2025 at 12:01:16\nWe need a whole new right flank and upgrades across the pitch so it's important to marshal resources sensibly which is why I could see us selling Beto if we buy Barry; especially as Beto had a very decent second half of the season which may mean his resale value is higher now that it may be again.\nYou're right about needing a stronger bench but progress will be gradual and strategic hopefully.\n65 Posted 08/06/2025 at 12:10:34\nAlso, £30M odd for a decent centre-forward is a fair price these days. Get him in early for a full preseason and focus on the long list of others we need.\n66 Posted 08/06/2025 at 12:38:23\nFBref is a decent player analysis site which for every player lists 10 others in the same position with similar outputs. On Beto's pages, Barry is listed as one of the ten closest comparables — along with Calvert-Lewin and Moise Kean!\n67 Posted 08/06/2025 at 12:43:05\nHowever, I don't agree that Barry is as highly regarded as you are making out - or that he is ahead of Ekitike in his development.\nThey are both now 22 but have had very different career trajectories.\nEkitike had his breakout season for Reims in the French top flight 2021/22 - scoring 10 in 24 aged 19, earning comparisons to Thierry Henry for his style of play. He then went on loan to PSG (because of PSR) who then bought him for €28.50m in July 2023.\nThat same summer, Barry moved from Beveren to Basel for €3.00m. In terms of France credentials - Barry has only had 58 minutes of football across 3 games for the U21s.\nHe's also is up against it with a peer group of young French strikers - Wahi, Ekitike, Tel and Kroupi - who are all more technical players. As I mentioned above, he's more like Bonny of Parma (i.e. a big unit / physical specimen who runs the channels well) - and Bonny has had greater recognition in the France youth set up already too.\nThe only thing that Barry compares to Ekitike in is the goal return this season. Barry has 11 in 35 for the 5th placed team in La Liga. Ekitike has 15 in 33 for the 3rd placed team in the Bundesliga.\nThat is another important thing. In most matches Barry plays in, he's playing for the better side - a well put together Villareal side. For us next season, we're unlikely to have squad that compares so favourably to the opposition. There are glaring gaps on the right flank - and question marks over a large part of the squad. It is much harder for a striker to impress in that sort of set up.\nSo, he may well develop and kick on from where he is now, but it could take a bit of time. If I were to guess who would be more likely to score more goals for us next season - I would say Beto (on the basis he's had time to settle in and despite obvious weaknesses seems well suited to Moyes' tactics). Going forward, Barry could become a better player.\n68 Posted 08/06/2025 at 13:12:49\nIf Calvert-Lewin does sign another contract, we don't need Barry, especially at that sort of price.\n69 Posted 08/06/2025 at 13:17:24\n70 Posted 08/06/2025 at 13:22:53\n71 Posted 08/06/2025 at 13:29:29\nIt would be madness to go into next season with only an unproven new guy, Calvert-Lewin (if he re-signs) and the still unproven Chermiti as our strike force.\n72 Posted 08/06/2025 at 13:42:17\nIf Calvert-Lewin goes, which seems likely, we need a proven back-up and perhaps someone like Callum Wilson on the right salary makes sense.\nTo spend £30M on a striker, unless it is on the never-never, consumes a large portion of our assumed spend. Which, I would say, is better spent on creativity and a fullback(s).\n74 Posted 08/06/2025 at 13:46:40\n75 Posted 08/06/2025 at 13:56:39\nI tend to leave this stuff to those for whom it is an amateur hobby and who know far more than I…\nBut the ubiquitous personal YouTube reel shows a player who doesn't look an awful lot like Beto to me, more like the player I'd hope Chermiti could be (and might still be, if he ever got a game).\nLooks like he plays on the left, not through the centre, and would bring some much-needed pace on that side. But I wish we could land these guys for the £14M Villarreal paid rather than the £40M they now want.\n76 Posted 08/06/2025 at 14:01:20\nI think many on here will consider Barry to be absolute garbage and a waste of €40m if he fails to score 15 goals or more this season.\n77 Posted 08/06/2025 at 14:15:06\nAlso he didn’t really get a good run in the team until Moyes took over.\nCreative midfielders are what we want and a deadly winger. Beto will thrive for us then.\nGive him a chance.\n78 Posted 08/06/2025 at 14:30:57\nHis head isn’t in it.\nToo many injuries, chances missed.\nNeeds a fresh start.\nHasn’t been the same since ‘that’ photo.\nSee how Chermiti is next season and if he stays injury free.\nGet a good pre season under his belt.\nKeep Beto. Loves the club, fans (mostly) love him.\nGives his all. Capable of 15 goals next season.\nPlay Charly behind him. Watch them thrive next season with a better team, also.\nGet Barry signed and then it’s a toss up between him and Beto.\nIf he can play wide left as well, even better.\nAnother option out there.\nThen focus on other areas.\nNo duds or pensioners this time around.\nExciting summer ahead.\n79 Posted 08/06/2025 at 14:37:07\nAlso, as someone who's run various media businesses, I can totally sympathise with the need to try and drive engagement however possible in the off season.\nI also don't think this is anywhere near the same as the clickbaity shit that appears on the NewsNow aggregated sites typically, e.g. \"£20M Everton star sent this 3 word message on social media... scroll on 5 ad-packed paragraphs before you realise it's absolutely nothing of interest\"\n80 Posted 08/06/2025 at 15:24:53\nWe could get Evan Ferguson for less, a better choice in my opinion.\n81 Posted 08/06/2025 at 15:43:54\nRobert/Steve/Sam, when you bring up Castro, aren't you really talking about a different position, like a second striker? Or can you really imagine a guy well under 6 feet tall leading the line for a Moyes team?\n82 Posted 08/06/2025 at 15:54:19\nSay 80k wages is 4m a year\nSo 10m a year on the PSR.\nNot too bad\n83 Posted 08/06/2025 at 16:01:11\n84 Posted 08/06/2025 at 16:07:43\nBut, we are difficult to please, and I'll always go with the supporters, as that will always tell you. He mostly gets our backing. Yes, he can be frustrating, but he's got 10 - 15 goals in him if he plays a full season fully fit.\nI don't know anything about Barry or Bonny, as I've not seen them play.\nIf we keep Calvert-Lewin, don't sell Beto, and Chermiti stays fit, I don't think this is a priority for Everton. We have other areas to focus on.\nBut, this is football. None of us have a crystal ball. I'll believe any signing when it's formally announced.\n85 Posted 08/06/2025 at 16:11:02\n86 Posted 08/06/2025 at 16:26:46\n87 Posted 08/06/2025 at 16:36:52\nAndy Johnson, hight, 5.7. well under six feet.\n88 Posted 08/06/2025 at 16:39:13\nNdiaye and Alcaraz are quality and it’s great to have them, more players like them and we will be an attractive footballing team in the School of Science mould.\nWe have a great opportunity here to build a top notch team.\nTop of my list would be a warning.\nNo oldies, no crocks and no cast offs from the Sky darlings or 30+ years players from West Ham or Newcastle ( ask yourself why are they getting rid of them?)Only young hungry players allowed preferably from South America, Portugal and Spain plus maybe a couple of youngsters from the lower divisions.\n89 Posted 08/06/2025 at 16:52:44\nWith their incredible debts, a free signing would have made sense.\nBut they've just agreed a £62M deal for Cunha from Wolves and have Gyokeres (Sporting) and the Brentford lad, Mbeumo in their sights. I guess PSR only applies to most, not the few?\nIf he's on their radar, then I would think he's a back up and making up the numbers.\nLikewise at Newcastle, where there are continued links, if they keep Isak, which it looks likely they will,\nIt depends what Everton and the player decide.\nI personally think, that if he doesn't stay, Sunderland or Leeds would be a better option for him to resurrect his career.\n90 Posted 08/06/2025 at 16:54:23\nLove Beto, but one of my greatest sources of amusements is watching people distort and massage his stats in order to make them half way respectable. Yes he had a decent 5-6 games but he has struggled big time all his career to find the net.\nApparently he was a late starter (sigh) but if you take away the 21 goals he scored in the pub league he played in at the age of twenty He has only scored 50 goals in his entire career. The guy is 28 at the turn of the year.\nWe all love a trier, but this guy is not a footballer who will give you anything else.\n\"Rough Deal\" ? not many 3m per goal players enjoy as much goodwill as he does. I wish I could get as rough a deal as he gets\n91 Posted 08/06/2025 at 17:01:50\nTime will tell if its more Jelavic than Lukuku on the goals front.\n92 Posted 08/06/2025 at 17:05:17\nCan you put a £3M price on those goals Colin? They contributed to keeping us in the Premier League.\nCalvert-Lewin gets away with murder?\nHe got a lot of stick for his dress sense, which is totally irrelevant to him as a footballer. And the worst, being booed by a section of his own supporters for going off injured at Villa Park. He had suffered a fractured cheekbone.\nHardly getting away with murder.\nI hope both of them are at Everton next season. I know Moyes traditionally likes to play with one striker, as do most these days, but if he wanted to change it, I could see them playing off each other.\n93 Posted 08/06/2025 at 17:09:28\nHe's taller than Mbappe, Alvarez, Martinez, Jota, Wissa and Jesus.\nI remember when Eto'o briefly played for us - it was fascinating because he didn't need the brawn of Lukaku to hold up play etc. The fact he could control a ball instantly and use space meant he could do it even though his legs had gone.\nLet's please hope we can source other players who are genuinely good at football and don't just have to rely on physical characteristics.\n94 Posted 08/06/2025 at 17:10:27\nI'll widen that out. He gets away with murder compared to the rest of the team simply because he tries.\nIt was in answer to you at 84 claiming he gets a rough deal.\nBeto`s cost us £30M and has scored 11 goals – £3M a goal. As for keeping us up, you really are having a laugh. Ipswich, Southampton, and Leicester ensured we were never in danger.\nAs for somebody \"taking the shirt off him\", that will happen as soon as we have a fit alternative and Moyes applies a modicum of common sense.\n95 Posted 08/06/2025 at 17:23:17\nI struggle to see the team carrying two centre forwards. Teams infrequently play 4-4-2, we lack quick width, and think would be exposed in the middle with two players.\nAlcaraz and Ndiaye play better in that in-between area from midfield and centre forward, which is more effective than a 2nd striker in my opinion.\nLet's see if Calvert-Lewin signs, I have my doubts he will.\n96 Posted 08/06/2025 at 17:24:17\nI couldn't believe Les Ferdinand was only 5ft-11in, always terrorised our defence, remember watching him score a hat-trick at Goodison.\n97 Posted 08/06/2025 at 17:26:00\nNo mention of DCL getting stick? I've read and heard plenty of it.\nPersonally, I rarely dish out stick to Everton players. Yes, I will criticise for poor performances or someone I don't believe to be good enough. Just as you've done here, I've done it with Michael Keane over the years, but sometimes you have to recognise when someone has done well and Keane has done so in recent games.\nWho mentioned taking the shirt off him by the way?\nSometimes it's off the ball running that matters. I'll just use one example, but I could give a few. Last game of the season at St James' Park. Beto took 3 Newcastle defenders out of the game and their keeper was rooted to the spot, more concerned about Beto, than the in running Alcaraz to score a peach of a header relatively unchallenged.\nFor what it's worth, Dominic is the better player, when fit and when his head is on it. Like any player, they both bring something to the team.\nThe important thing in the system we've been playing in that the strikers get supported by runners and wide players.\nDominic unfortunately has been out a lot injured, but as many wiser Evertonians that me have said, he's spent the last few seasons isolated and chasing his own flick ons. Beto has benefited with having Ndiaye and Alcaraz playing forward in support.\n98 Posted 08/06/2025 at 17:27:47\n99 Posted 08/06/2025 at 17:29:48\nFreedom for Toxteth!\n100 Posted 08/06/2025 at 17:31:31\nIt is obvious that Ekitike is one of the 3 most highly coveted young strikers in world football NOW that was the point of my post. Our chances of signing a striker like Ekitike would be zero as he is destined to go right to the top, has all kinds of suitors and well out of our price range.\nAfter Ekitikes breakout season at Reims he had an initial impact at PSG triggering his loan move into a permanent one. Things quickly turned sour for him as he was given limited game time and at the time Newcastle, Frankfurt, Everton and Rangers were the clubs linked with him. He had yet to be fast tracked into the France U21 team despite how highly they rated him. He at that point was a player of enormous potential in much the same way as Tel is now.\nBarry has now had 2 consecutive seasons in top flight football establishing himself as a key player with both Basel and Villarreal. That was my point about being further in his development when both were being quoted as 15 million and 30 million respectively.\nIt was during these exploits with Basel the French association were intent on ensuring he didn't opt for Guinea instead of them as they made advances to him. You are right that they have had different trajectories (one a child star and the other a late bloomer) yet both made were called into the french U21 side at the same time. This is why I find these links so exciting\nFB ref suggest Barry is like Beto along with other comparable strikers such as Kean and Calvert Lewin. Comedy gold. I think they forgot about another comparable striker Danny Ings\n103 Posted 08/06/2025 at 17:40:03\nColin #90, no \"massaging\" necessary. Leave out the entire rest of Beto's career if you want. In an Everton shirt he has scored a goal every 182 minutes on the pitch. No pens. No free kicks. Is that not respectable? It's a more efficient rate than Mateta, Watkins, Raul or Delap -- all better players than Beto.\nNo, he doesn't bring much of anything else, but the man finds the net. And he makes defenders miserable.\n104 Posted 08/06/2025 at 17:48:45\n105 Posted 08/06/2025 at 17:55:14\nWhat he isn’t though, is technically good enough to hold play up relentlessly and wait for his team mates to catch him up. Win throw ins. Sacrifice his own opportunities for the good of the percentages.\nIn basic terms - he’ll never work for a system that looks to exist purely on absorbing pressure defensively and having a constant outlet to fire the ball to before starting a pattern of play. He’s not Michail Antonio.\nMoyes wants a Michail Antonio for this team. Make no mistake. That’s his zenith.\nIt’s not mine\n107 Posted 08/06/2025 at 18:00:07\nI eagerly await the day that we have such a depth of attacking talent on the pitch that we don't need a massive physical presence up top and a skill guy like Castro fills the position. But that won't be us for a while.\n108 Posted 08/06/2025 at 18:26:48\nConor # 100, I didn't get what you meant with the earlier post but I do now. I think your point is that Barry at age 22 is more developed a player than Ekitike was at 19. Possibly, yes, in terms of readiness for regular Premier League football. They're just very different players - Ekitike has always been exceptionally gifted whereas Barry is not - but he does have tremendous physical attributes. And as you say he's had two good consecutive seasons now at Basel and Villareal (how that compares with Ekitike is by the by but stands him in good stead). I still think he's got a lot of similarities to Beto and probably isn't the better of the two at the moment - but we can just agree to disagree on that I expect.\n109 Posted 08/06/2025 at 18:33:30\n110 Posted 08/06/2025 at 18:36:28\nPersonally, despite being a supporter of Dom over the years, I do think he needs a change of scenery.\nHis confidence in front of goal is low and his all round game is not as combative as it was.\nI wish him well but I am sick of watching him miss -I'd rather watch him miss for someone else.\n111 Posted 08/06/2025 at 19:18:41\nIt took a world class manager to make him the player he was. A manager that simply got the best out of everyone. Including DCL. We havent had a world class manager since and the evidence of that upon his game is there for all to see\n112 Posted 08/06/2025 at 19:48:07\nPlus Beto actually cost £26M by the majority of accounts and has scored 14 goals for Everton.\nLess than £2M a pop, and getting cheaper all the time!\n113 Posted 08/06/2025 at 19:50:06\nThere is no doubt Ancelotti played to Dominic's strengths and it is an indisputable fact that Calvert-Lewin had his best season under the Italian but to suggest that he was responsible for the players 'only' good season is wide of the mark.\nIn terms of goals per games, Dominic performed better both under Benitez and Ferguson in the short cameos they had with the player.\nMoreover, in the preceding season, 10 of the 15 goals were scored prior to the Italian's arrival, this despite him often not always starting, being hooked, and pretty much misused by Silva.\nWhen Dominic didn't have the likes of James feeding him, he actually was a lot more clinical pre-Ancelotti with the exact same squad. He scored 24 goals in 1.5 seasons with Italian, yet 10 in half a season prior to his arrival.\nI suspect that Moyes rates Dominic very highly and his performance against Spurs would suggest that Dominic is still a very capable striker. I think his woes can be put down to injury and encountering Dyche rather than the brilliance of the Italian.\n114 Posted 08/06/2025 at 20:01:10\nHe wasn't expensive and has proved decent value.\n115 Posted 08/06/2025 at 20:06:49\n116 Posted 08/06/2025 at 20:30:12\nBeto has managed 11 Premier League goals. The £3M per goal ratio only becomes irrelevant if he actually adds to that tally. If we do sign this guy Barry, his chances of building on that will likely be limited.\nCalvert-Lewin has scored 57 Premier League goals (a figure Beto will never get near) and cost us 20 times less.\nMike, when you want to forget the rest of Beto's career and focus on a handful of games when he did finally start scoring, I'm afraid you are already massaging his stats.\n117 Posted 09/06/2025 at 05:37:49\nIt's a moot discussion because people's opinions only alter when a striker starts scoring goals.\nWhatever happened in the past is that. I'm more interested in what they do next season for Everton, if one, or both are still here.\nLikewise for any new striker we may or may not seek to bring in, including the players mentioned on this thread.\n118 Posted 09/06/2025 at 07:59:36\n\"Let's see if Calvert-Lewin signs, I have my doubts he will.\"\nIt's going to depend on If he's had better offers. If he has, he'll be off… but, in the highly likely event he hasn't, I don't see him risking his chances of being a free agent.\nOf course, he could just have made enough money that he doesn't care.\n119 Posted 09/06/2025 at 08:59:56\nI reckon this lad could do it, Beto, can do it, Calvert-Lewin can do it, but it's a long time since we had a reliable striker hitting the net season after season (Rom).\nSo it's slow business so far, but hopefully this is a sign Everton are doing their homework, to get the right players who would fit into the squad but at the right price.\nA £100M transfer pot will need to be spent carefully, and as every one on TW knows, Everton the, new era, will take time and patience to develop from a work in progress to a reliable and competitive squad who can sustain a challenge into the top 6 of the Premier League.\n120 Posted 09/06/2025 at 09:14:08\nNone of Maupay, Dobbin, Gomes, Alli, Godfrey, Cannon, Simms, Onana, Holgate, Davies have exactly set the world alight.\n121 Posted 09/06/2025 at 16:46:00\n122 Posted 09/06/2025 at 17:57:34\nThe Yellow Submarines qualified for the Champions League, and there is a belief he wouldn’t want to trade that for a move to Goodison Park.\nLooks like we look elsewhere then.\n123 Posted 09/06/2025 at 19:05:41\n124 Posted 09/06/2025 at 19:15:55\nBut he's 33, injury-prone and has mental health issues, so we should be looking elsewhere.\n125 Posted 10/06/2025 at 11:17:29\nA 35-year-old available and Moyes a big fan…\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 6518,
  "scraped_at": "2026-02-14T01:52:26.333979",
  "_text_extracted": true
}