{
  "article_id": "f322f68fe6d5",
  "url": "https://www.aol.co.uk/michelle-agyemang-heading-big-time-070036601.html",
  "title": "Michelle Agyemang heading for the big time after Euro 2025 heroics – Ella Toone",
  "date": "20250726T083000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Michelle Agyemang heading for the big time after Euro 2025 heroics – Ella Toone\nMidfielder Ella Toone fully expects England team-mate Michelle Agyemang will get stopped for a few more selfies once they leave the Euro 2025 bubble.\nAgyemang is undeniably the breakout star of the defending champions’ European campaign where, from their luxury accommodations perched high above Zurich, it is relatively simple for the youngest Lioness on Sarina Wiegman’s squad to block out the escalating buzz around her.\nBut as soon as they leave Switzerland – be it with a trophy after Sunday’s final with Spain or not – the 19-year-old Arsenal forward, who twice saved the Lionesses from elimination in this tournament, has unequivocally arrived.\n“Michelle, it’s mad, like I would think she’s about 30 years old, she’s so mature,” said Toone of catalyst Agyemang, who netted equalisers in England’s stunning quarter- and semi-final comebacks.\n“She’s so humble, she’s coming to this tournament with freedom, you know, not a worry, not a care. She’s just gone out there and done what’s been asked of her.\n“She’s been amazing for us. She’s turned up in big moments when we’ve needed her. She’s got a lot of talent, and she can do a lot of things that not many players can do.\n“Even when she scored and kept us in games, she’s been the same Michelle that she was when she started this tournament. So, yeah, I’m absolutely buzzing for her. It’s nice for good people to get things that they deserve, and she’s definitely one of those people.”\nAgyemang and Arsenal team-mate Chloe Kelly have been compared to Alessia Russo and best friend Toone, England’s “super-subs” during their Euro 2022 triumph.\nThe the latter came off the bench twice to score at that home tournament, including the first of the Lionesses’ goals in their 2-1 extra-time victory over Germany in the Wembley final.\nAnd yet Agyemang’s anointing this summer is even more spectacular, considering her heroics in the knockouts came during just her third and fourth senior England appearances.\nShe burst onto the scene as a last-minute replacement for an injured Russo, then scored 41 seconds into her England debut in April, ultimately convincing Wiegman she deserved a place in her 23-woman squad.\nAgyemang has spent the last Women’s Super League season on loan at Brighton, and could still go out on loan again for the new campaign to ensure more regular playing time – and would no doubt receive plenty of offers.\nShe might also remain with the Champions League winners – where she will join new recruit Olivia Smith, women’s football’s first £1million player, at one of the most well-supported clubs in the world.\nEither scenario, it seems, comes with a much brighter spotlight on a wise-beyond-her-years forward who admires Kelly Smith, Russo and Lauren James but says she wants to be a “unique player” who offers “something different”.\nToone, who also scored in the 2023 World Cup semi-final, knows exactly what it is like to achieve notoriety in a major tournament – and some of the stranger consequences that come with it.\n“She might get papped eating a pasty like I did!” Toone exclaimed. “I’ll have to warn her about that.\n“I think she’s definitely in the bubble now but I think when she gets out she’ll be recognised a lot more than she was before the tournament, that’s for sure, and she definitely deserves that as well.”",
  "word_count": 572,
  "scraped_at": "2026-02-14T02:09:18.635771",
  "_text_extracted": true
}