{
  "article_id": "f323c90a730a",
  "url": "https://www.90min.com/features/power-rankings-the-best-teams-in-europe-week-5-2024-25",
  "title": "Power Rankings : The best teams in Europe",
  "date": "20240928T080000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Power Rankings: The best teams in Europe - Week 5\n- The 10 best teams in Europe right now\n- Bayern Munich and Barcelona impressed in domestic action\n- Arsenal and Man City played out a Premier League classic\nGameweek 5 of the 2024/25 European football season blessed us with plenty of heavyweight clashes across Europe.\nOver in England we had a fiery meeting between Arsenal and Man City, over in Italy we enjoyed a Milan derby, and in France we witnessed a frenetic clash between Lyon and Marseille.\nAnd after all of that fun, here's our picks for the top ten football teams in Europe right now - ranked, of course.\n10. Juventus (down 4)\nJuventus have been incredibly stout defensively in the opening weeks over the season; in fact, they're the only team in the top five leagues to not concede a single league goal yet.\nThat being said, their offensive play has left a bit to be desired.\nThree straight goalless Serie A draws screams 'room for improvement' to us.\n9. Atletico Madrid (down 1)\nJudging by the first seven weeks of the La Liga season, it's going to be pretty difficult to keep up with Barcelona and Real Madrid in the title race.\nThat being said, Atletico Madrid are giving it a right good go.\nDiego Simeone's side are still unbeaten in La Liga thanks to four wins and three draws, and will be hoping to retain that unbeaten record when they face Real Madrid on Sunday evening.\n8. Arsenal (re-entry)\nHad Arsenal been able to hold on to their slender 2-1 lead at the Etihad Stadium on Sunday, chances are they'd be at the very top of these rankings.\nIn the end, a 98th-minute goal from John Stones ensured that the Gunners would earn just a point for their efforts, but considering the circumstances - Leandro Trossard was sent off at the end of the first half - it should be seen as a point gained, rather than two lost.\n7. Paris Saint-Germain (down 3)\nDown three this week thanks to a rather tepid draw with Reims this past weekend, Paris Saint-Germain had to come from behind to even earn a point after Keito Nakamura scored an early opener.\nThey're still unbeaten in all competitions, but the draw last weekend showed that they may not be quite ready to compete for the UEFA Champions League without Kylian Mbappe this season.\n6. Bayer Leverkusen (up 1)\nWhen you're scoring four goals a game, chances are you're going to win most games of football you play.\nAnd that's exactly what Leverkusen have done by scoring four in each of their last three games in all competitions.\nFour was, in fact, just about enough to get them over the line against Wolfsburg in the Bundesliga last weekend, with the fourth goal coming from Victor Boniface in the 93rd minute to earn a dramatic 4-3 win.\n5. Real Madrid (up 5)\nAfter a shaky start - by their lofty standards - Real Madrid look to have found a bit of a groove in recent weeks.\nThat 'groove' has involved them winning five games on the spin.\nThat's a pretty damn good groove if you ask us.\n4. Sporting CP (down 1)\nThis is your weekly update on Victor Gyokeres' goalscoring exploits at Sporting CP.\nThis past Sunday, Gyokeres scored a brace in a 3-0 win over AVS Futebol SAD, taking his tally for the season to 11 already.\nYes, in September.\nYes, he's ridiculous.\n3. Barcelona (up 2)\nDespite basically their entire first team currently being injured - eight first-team players are sidelined at the moment - Barcelona just keep winning games.\nTheir victories over Villarreal and Getafe this week ensured that Barca made it seven wins from seven in La Liga this season.\nOne more win will match Gerardo Martino's record for most consecutive La Liga wins to start a season with Barca.\n2. Manchester City (-)\nIt was nervy, and they lost their best player to an ACL injury in the process, but Man City secured their most valuable point of the season so far on Sunday.\nThat point was secured with the last kick of the game against Arsenal thanks to John Stones, and it's a point that keeps City at the top of the league in the early stages of the 2024/25 campaign.\n1. Bayern Munich (-)\nBayern Munich have won their last three games in all competitions by an aggregate score of 20-3.\nThat is utterly absurd.\nThe Bavarians look hellbent on reclaiming their Bundesliga crown from Leverkusen this season.",
  "word_count": 766,
  "scraped_at": "2026-02-14T02:05:23.740040",
  "_text_extracted": true
}