{
  "article_id": "f341cf71d1cd",
  "url": "https://www.caughtoffside.com/2024/08/23/aston-villa-transfer-news-gabriel-agbonlahor-on-chelsea-raheem-sterling/",
  "title": "Gabriel Agbonlahor backs Aston Villa to sign  outstanding  Chelsea star",
  "date": "20240823T221500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa legend Gabriel Agbonlahor has given his seal of approval for his former club to pursue Chelsea forward Raheem Sterling.\nThe 82-time England international is searching for a move away from Stamford Bridge this summer following the recent arrivals of Joao Felix and Pedro Neto — with the latter taking Sterling’s No.7 shirt.\nSterling has been linked with a number of Premier League clubs over the course of the summer, with Newcastle and Aston Villa the most prominent names in the mix.\nItalian giants Juventus have also been credited with a serious interest.\nSterling hasn’t made the squad for either of Chelsea’s games so far this season, against Man City in the Premier League and Servette in the UEFA Conference League.\nAgbonlahor gives green light for Aston Villa’s Sterling pursuit\nWith the rumours linking Villa with a swoop for Sterling gathering pace, former striker Agbonlahor — who scored 87 goals in 391 appearances for the club between 2005 and 2018 — has sung the praises of the forward, who he would love to see play under Unai Emery.\n“I just think, ‘why not?'” he told talkSPORT. “You know, Raheem Sterling is 29. We’re not talking about someone in their mid-thirties. At the start of last season, we were all saying, how is he not being called up by Gareth Southgate?’\n“He was in such great form. Chelsea were a shambles last season. Players weren’t given the games to prove themselves. It was a poor season for the majority of Chelsea players.\n“So if it’s right and the club want to do it, why wouldn’t Aston Villa fans be on side? Because he’s an outstanding player when he’s being coached right by a top coach like Unai Emery – I’m sure he’ll get the best out of him.”\nAgbonlahor believes Sterling could be particularly valuable in Villa’s upcoming Champions League campaign, with the 29-year-old a veteran of 83 games at Europe’s top table in the past, notching 27 goals and 17 assists along the way.\n“I think it’s good to have competition,” he continued. “Last season Ollie Watkins was quite lucky to not get any bad injury. You know what football can do. Sometimes you can get a bad injury out of somewhere. You need to have options.\n“And with [Jhon] Duran, he’s a player that, yes, there’s been talk about how he can sometimes be a bit hard work to manage and coach, but his talent’s there to show.\n“And he’s a player that you’re going to need playing in the Champions League now as well, it’ll be hard for players to play Tuesday or Wednesday and Saturday, week in, week out.\n“You need that competition for places. And also [Morgan] Rogers is one that I really like. He could play as a number nine as well, if needed, not just off the left.\n“There’s competition for places all across the field now, but I just think Aston Villa missing out on [Joao] Felix – the player that Unai Emery wanted – means there’s funds available. [Alex] Moreno has left to go to Nottingham Forest.\n“There’s funds available for Aston Villa to do some business in the last week of the window, so I wouldn’t be surprised if the Sterling thing might happen or someone else comes in.”",
  "word_count": 549,
  "scraped_at": "2026-02-14T02:01:23.779261",
  "_text_extracted": true
}