{
  "article_id": "f362325899fc",
  "url": "https://www.uefa.com/womenschampionsleague/news/0278-15e37b2b75b6-6a59f255d6fa-1000--player-of-the-year-nominee-carmona/",
  "title": "UEFA Women Player of the Year nominee : The case for Olga Carmona | UEFA Women Champions League",
  "date": "20230825T103000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA Women's Player of the Year nominee: The case for Olga Carmona\nThursday, August 24, 2023\nArticle summary\nThe Spain and Real Madrid defender is one of three nominees for the 2022/23 UEFA Women's Player of the Year award.\nArticle top media content\nArticle body\nOlga Carmona is one of three top nominees for the 2022/23 UEFA Women's Player of the Year award. UEFA.com analyses why she is in the running alongside Aitana Bonmatí and Sam Kerr.\nWhy she was nominated\nCarmona, a 2018 Women's U19 EURO winner, has only really become a Spain regular at senior level over the past 12 months. At just 23 years of age, however, she is already assured of a place in her nation's football history.\nThe left-back was an unused substitute in Spain's last 16 victory over Switzerland at the 2023 FIFA Women's World Cup but was brought on for extra time in the quarter-final against the Netherlands, helping her country outlast the 2019 runners-up. Carmona was recalled to the starting XI against Sweden in the last four, wearing the captain's armband and securing her side's first senior major final appearance with a stunning, looping 89th-minute effort from the edge of the box.\nShe went one better in the final as she led Spain out in Sydney and sealed victory with the game's only goal – not bad for a player who had only scored once at senior international level before the World Cup. Carmona, who was named Player of the Match, ensured England had little joy down the right despite the presence of Lucy Bronze in the first half and Lauren James in the second. There was an outpouring of sympathy when it emerged that Carmona had been informed of her father's death not long after the final whistle.\nCarmona enjoyed a solid season at club level for Real Madrid, who competed in the UEFA Women's Champions League (particularly impressing in the 1-1 group stage draw with Chelsea), finished second behind Barcelona in the Liga and reached the Copa de la Reina final.\n2022/23 in numbers\nAchievements\nFIFA Women's World Cup winner\nUEFA Women's Champions League (including rounds 1 and 2)\nAppearances: 8\nGoals: 1\nAssists: 0\nPlayer of the Match awards: 1\nFIFA Women's World Cup\nAppearances: 6\nGoals: 2\nAssists: 0\nPlayer of the Match awards: 1\nFIFA Women's World Cup qualifying\nAppearances: 2\nGoals: 0\nAssists: 0\nDomestic league\nAppearances: 26\nGoals: 3\nAssists: 1\nKey performance\nSpain 1-0 England\nNo previous Women's World Cup final had finished 1-0 but Carmona now holds a unique place in the history of the competition after scoring 29 minutes into the Sydney decider, running on to Mariona Caldentey's pass and sending a perfect shot beyond the reach of Mary Earps and inside the post.\nCarmona also showed her defensive ability in keeping out an England side so dangerous down their right flank\nWho was last year's winner?\nAlexia Putellas was the 2021/22 UEFA Women's Player of the Year after the most prolific season of her club career with 34 goals as Barcelona won a clean sweep of Spanish trophies and reached another UEFA Women's Champions League final. The goals also flowed for Spain, getting eight in 12 games as she became the first women to win 100 caps for her nation. She became the first player to claim the award two years running and joined Pernille Harder as a multiple winner.",
  "word_count": 569,
  "scraped_at": "2026-02-14T01:50:52.142402",
  "_text_extracted": true
}