{
  "article_id": "f3635b32ebd1",
  "url": "https://www.uefa.com/womenschampionsleague/news/0284-18ade363b7e2-1c20da83bdc6-1000--how-brilliant-is-spain-and-barcelona-s-uefa-and-ballon-d-or-/",
  "title": "How brilliant is Spain and Barcelona UEFA and Ballon dOr winner Aitana Bonmatí ? | UEFA Women Champions League",
  "date": "20231031T043000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How brilliant is Barcelona and Spain's triple Ballon d'Or winner Aitana Bonmatí?\nTuesday, December 2, 2025\nArticle summary\nWe salute Aitana Bonmatí, who joined Barcelona aged 14 and has reached the global pinnacle for both her club and Spain.\nArticle top media content\nArticle body\nAitana Bonmatí has been a key part of Barcelona and Spain's rise to international dominance.\nWe profile the versatile and talented midfielder, who is short in stature but a mighty footballing presence, her incredible 2022/23 with UEFA Women's Champions League and FIFA Women's World Cup honours culminating in being named UEFA Women's Player of the Year and winning the Ballon d'Or as well as FIFA's Best Women's Player award.\nIt has continued in 2023/24, inspiring Spain to UEFA Women's Nations League glory and Barcelona to a clean sweep of titles including another Champions League. A new four-year club contract signed in September 2024, in the words of Barcelona: \"Leaves plenty of time for her to collect more silverware.\"\nA month later, Bonmatí claimed another Ballon d'Or and made it three in a row in 2024/25 having already been named UEFA Women's EURO 2025 Player of the Tournament as Spain made the final. However, her year ended with a broken leg in training between the two games against Germany in the Nations League final.\nWhat they say\n\"She is an intense player, very competitive, and dominates with both feet.\"\nJordi Ventura, her Barcelona academy coach\n\"I think the best legacy we can leave to future generations are values that in our day we formed at La Masia. To see that Aitana has inherited this football DNA and Barça values, it makes me feel very proud.\"\nXavi Hernández, in the foreword to Bonmatí's autobiography\n\"Aitana Bonmatí is a football player who has me completely in love with her for the way she plays. I would say she is like the women's [Andrés] Iniesta playing for Barcelona.\"\nJosep Guardiola in 2023\n\"She’s a role model of a player. How she trains, her attitude, the way she approaches things every day, she just sets a great example. I’ve been lucky enough to know her for many years – we met when she was starting out her career; I’ve watched her grow up, go through the whole process. I’m pleased to have seen everything that’s happened [to her], and she deserves it all.\"\nJonatan Giráldez, her Barcelona coach until 2024\nClaims to fame\nBarcelona\n• Raised in Catalonia, Bonmatí joined Barcelona aged 13, taking public transport with her father on journeys of nearly two hours to get to training.\n• Tasting consistent success at youth and B level, Bonmatí was promoted to the senior team aged 16 late in the 2015/16 season. She made her debut in the Copa de la Reina, then an end-of-season tournament in June, reaching the final.\n• Although not a regular in 2016/17, she did make her UEFA Women's Champions League debut and scored in the 4-1 Copa de la Reina final win against Atlético.\n• It was a similar story the following year, which included another Copa win, but in 2018/19 Bonmatí became a regular and helped Barcelona to their first UEFA Women's Champions League final, impressing with her determined attitude despite the 4-1 loss to Lyon in Budapest.\n• Now key to the team and named Catalan women's player of the year, she signed a long-term Barcelona contract and won her first league title in the truncated 2019/20 season.\n• Her star continued to grow in 2020/21 as she was named MVP in the postponed 2020 Copa de la Reina final against Logroño and helped Barcelona dominate La Liga, finishing 25 points clear of Real Madrid.\n• But the highlight of the season was winning Barcelona's first UEFA Women's Champions League title. Bonmatí scored in the 4-0 final defeat of Chelsea in Gothenburg, was named Player of the Match and featured in the Squad of the Season.\n• The 2021/22 campaign was another stellar one for Bonmatí, who scored a career-high 18 goals, including four in Europe. The Champions League proved Barcelona's only stumbling block as they lost the Turin final to Lyon, though Bonmatí made the now 11-strong Team of the Season.\n• Injury to Alexia Putellas meant that Bonmatí often filled a more attacking role in 2022/23, but she responded with aplomb. Barcelona strolled to another Liga title and won back the UEFA Women's Champions League.\n• In Europe, she had a competition-high 13 goal contributions (scoring five and getting eight assists), and played a key role as Barcelona overturned a two-goal half-time deficit to beat Wolfsburg 3-2 in the Eindhoven final.\n• Bonmatí was named 2022/23 UEFA Women's Champions League Player of the Season and made the Team of the Season for the third year running.\n• Having also won the World Cup with Spain, Bonmatí won the 2022/23 UEFA Women's Player of the Year award, the 2023 Ballon d'Or and the 2023 FIFA Best Women's Player award.\n• Inspired Barcelona to a more domestic trophies and another Champions League final in 2023/24 with a superb semi-final second-leg display at Chelsea to earn a 2-0 win, 2-1 on aggregate.\n• Was brilliant in the Bilbao final, opening the scoring in the 2-0 defeat of Lyon that wrapped up a quadruple for Barcelona. Bonmatí was named Player of the Match for the final and overall Women's Champions League Player of the Season again, as well as being named in the Team of the Tournament for the fourth year in a row.\n• Also became the first footballer to win the Laureus World Sports Award for Sportswoman of the Year.\n• Began 2024/25 by committing herself to a new four-year Barcelona contract.\n• Won her second consecutive Ballon d'Or in October 2024 (another FIFA award was to follow in December).\n• That November she passed 100 competitive goals for Barcelona, in her 282nd game.\n• Helped Barcelona to their sixth straight Liga F title, tenth overall.\n• At her brilliant best in the 4-1 win at Chelsea that took Barcelona to another Champions League final. Barcelona lost to Arsenal in Lisbon but for the third year running Bonmatí was the competition's Player of the Season and in the Team of the Season a fifth time in a row.\n• In September, she earned her third consecutive Women’s Ballon d’Or.\n• After a solid start to 2025/26, suffered a broken leg on international duty on 30 November, ruling her out for several months.\nSpain\n• Aged 15, Bonmatí was part of Spain's Women's U17 EURO squad in England in late 2013, scoring twice in a 4-0 group stage defeat of Germany.\n• She started the final as Spain lost to Germany on penalties, but Bonmatí was named in the Team of the Tournament (alongside the likes of Patri Guijarro, Keira Walsh, Leah Williamson and Erin Cuthbert).\n• Spain's performance earned them a place at the FIFA U-17 Women's World Cup in early 2014 and Bonmatí was part of the side that reached the final, where they lost to Japan.\n• She then helped Spain claim the WU17 EURO title in Iceland in summer 2015, again taking her place in the Team of the Tournament.\n• Stepping up to U19 level, Bonmatí reached another EURO final in 2016, losing to France in Slovakia.\n• A year later, Spain turned the tables in Northern Ireland, Bonmatí captaining the side to a 3-2 final victory over France.\n• Bonmatí's senior international debut came in November 2017 in a 4-0 FIFA Women's World Cup qualifying defeat of Austria, and she helped them win the Cyprus Women's Cup the following March.\n• Bonmatí captained Spain at the 2018 FIFA U-20 Women's World Cup in France, but was sent off in the semi-final defeat of the hosts and missed the loss to Japan in the decider.\n• Back with the seniors, Bonmatí got her first goal in an April 2019 friendly with England and was named in the World Cup squad, making two substitute appearances in France.\n• She was a regular in UEFA Women's EURO 2022 qualifying, though, scoring six goals to help Spain secure a trip to England.\n• At the finals, Bonmatí scored in a 4-1 group stage win against Finland but Spain fell in the last eight.\n• Bonmatí had, by the time of those delayed finals, already played a key role in Spain's 2023 World Cup qualifying campaign, but in September 2022 she opted out of the national team.\n• She was named in the World Cup squad after choosing to return in June 2023. In the opening game against Costa Rica, she scored and starred in a 3-0 win as Spain got through the group stage, Bonmatí reaching 50 caps in the process.\n• Bonmatí got two goals as Spain defeated Switzerland 5-1 in the round of 16, their first senior knockout win, on their way to a maiden major final.\n• She continued to star as Spain won their first major trophy at senior level by edging England 1-0 in the showpiece, after which she was named Player of the Tournament.\n• Aided Spain to the first UEFA Women's Nations League finals in February 2024 as they topped their group in the months after winning the World Cup.\n• Scored in the semis and the final as Spain claimed that crowd in Seville. Bonmatí was named Player of the match in the final as well as overall Player of the Finals.\n• That performance earned Spain an Olympic women's football debut, where they finished fourth. Bonmatí got Spain's first-ever goal in the tournament, equalising in the opening 2-1 defeat of Japan.\n• After being hospitalised with viral meningitis on the eve of Women's EURO 2025 in Switzerland, by Matchday 3 Bonmatí was starting and she set up the opener in the quarter-final defeat of the hosts before getting the extra-tine winner against Germany in the semis. Despite the final loss was named Player of the Tournament.\n• In September claimed the Ballon d'Or for the third year in a row.\n• Played in the first leg of Spain's 2025 UEFA Women's Nations League final with Germany but suffered a broken leg in training ahead of the home return as her side retained the title.\nWhat you might not know\n• Her autobiography, Totes unides fem força, had 14 chapters in honour of Johan Cruyff's shirt number (and indeed her own).\n• Xavi, who wrote the foreword for that book, was always Bonmatí's footballing role model (and contacted her after she was sent off in that U-20 World Cup semi-final in 2018). She said: \"He has always been my idol, not only because of how he played but because of how he was.\"\n• When England duo Keira Walsh and Lucy Bronze joined Barcelona in 2022, Bonmatí offered to act as their translator (partly to improve her own English).\n• Among her roles outside football, Bonmatí is an ambassador of the United Nations Refugee Agency.\nWhat she says\n\"I was the only girl who played football. I had a lot of boy friends who played with me and I always had scuffles or a bit of a fight.\"\n\"When I hear the word Barça, I have a very deep feeling. It does come from the inside, because it has been like this for my whole life. I play for Barça and I have always been a supporter. I'm very proud to support and play for this club. It's very rewarding for me, since this is something I dreamed of as a child.\"\n\"If you look back, not many years ago, I still remember playing at [Barcelona's] Miniestadi and there was hardly anyone there. And half of them were our parents and our friends, or people who knew us. In a short space of time, things have changed a lot. We are still surprised because if you think about it objectively, you think, 'Look how far we've come!' And you're very happy because you would have never imagined this, attendance record after attendance record.\"\n\"I'm now getting recognised on the street and this is generally a source of pride for me. Being a reference point for young girls and boys is really special. Behind this, however, are years of hard work, but I love how people buy a shirt with my name and ask for photos. I always try to return the love that people give me.\"\n[On winning the 2022/23 UEFA award] \"I couldn’t have won any more because I have everything; it’s been an incredible year winning the Champions League and then the World Cup – it’s amazing. I can’t believe it right now. But, I think, when I’m going to be older, I’m going to look back and say, 'Oh my God, what a year!'.\"\n[On winning the 2023 Ballon d'Or] \"As role models we have a responsibility on and off the pitch. We should be more than athletes and keep leading by example and fighting together for a better, peaceful and equal world.\"\n[On winning the 2024 Ballon d'Or] \"I always say this is not something that you can do alone, I'm so lucky to be surrounded by wonderful players who help me to keep growing into a better player.\"\nWhat she might achieve yet\n• Barcelona have racked up the trophies in Bonmatí's time at the club, but OL's feats in the 2010s give them a real target to aim for as they look to establish European dominance.\n• Spain finally added senior titles to their youth crowns, but Bonmatí and Co will hope that more is to come.\n• Bonmatí may well have more individual honours to come too, despite already having a full collection.",
  "word_count": 2287,
  "scraped_at": "2026-02-14T01:51:09.208315",
  "_text_extracted": true
}