{
  "article_id": "f369ae554c83",
  "url": "https://community.scoop.co.nz/2024/02/vaivase-tai-fc-qualify-for-the-final-spot-at-the-ofc-mens-champions-league/",
  "title": "Community Scoop » Vaivase - Tai FC Qualify For The Final Spot At The OFC Men Champions League",
  "date": "20240223T110000Z",
  "domain": "community.scoop.co.nz",
  "source_country": "New Zealand",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vaivase-Tai FC Qualify For The Final Spot At The OFC Men’s Champions League\nPress Release – Oceania Football Confederation\nVaivase-Tai FC are heading to their first ever OFC Mens Champions League after victory over Vaiala Tonga SC, edging out hosts Veitongo FC on the final match day in Nukualofa. The equation was simple for the Samoan side win big and hope …\nVaivase-Tai FC are heading to their first ever OFC Men’s Champions League after victory over Vaiala Tonga SC, edging out hosts Veitongo FC on the final match day in Nuku’alofa.\nThe equation was simple for the Samoan side – win big and hope that later the same day Veitongo FC would at least be held to a smaller victory in their match against Tupapa Maraerenga FC.\nDilo Tumua of Vaivase-Tai, wearing the number 11 jersey, quickly put the team ahead inside the opening two minutes but despite all their defensive struggles, Vaiala Tonga SC showed great resilience to halt the Vaivase-Tai attack for the opening quarter of an hour.\nFielding a defensive line-up and a high line, the American Samoa side were susceptible to the through ball and Falaniko Nanumea was able to capitalise on two pinpoint passes to successfully score consecutive goals in the 13th and 14th minute.\nAt the 18-minute mark, Vaivase-Tai were given a penalty kick, which Tumua promptly converted into the team’s fourth goal. A fifth duly followed as they slowly increased their goal difference advantage.\nVaivase dominated possession and shots on goal, but Vaiala’s robust defense managed to thwart several of Vaivase’s attempts on goal, including successfully defending a free kick in the 39th minute.\nApproaching half-time however, the flood gates opened. Vaivase-Tai capitalising on some fatigue and sloppy defence, scoring four goals in six minutes, three of those coming in additional time – stretching the lead to 8-0 at the break.\nWhen play resumed, Vaivase quickly reasserted their dominance, camping inside the opponents half for majority of the second period. That pressure showed swiftly, scoring two goals inside three minutes of the restart.\nDespite Vaiala deploying a comprehensive defensive strategy, an unfortunate own goal contributed to an 11th concession, quickly followed by a fourth goal for Dilo Tumua, who drilled the ball into the net to make it 12.\nEager to clinch their place in the OFC Champions League later in the year, Vaicase-Tai continued to pour forward, conscious of the opportunity to increase their goal difference to give themselves the best possible chance.\nDilo Tumua netted his team’s 13th goal and his fifth of the day, before captain Xavier Tanielu rounded off the scoring with practically the final kick of the match, sealing a 14-0 victory.\nVaivase-Tai FC: 14 (Jerrymiah MAIAVA 2, Falaniko NANUMEA 13, 14, 48, Dilo TUMUA 18 (P), 46, 66, 80, Vaa TAUALAI 26, Alman KWAN 44, 45’+3, Alton LEIATAUA 45’+5, OWN GOAL 62, Xavier TANIELU 90’+5)|\nVaiala Tonga SC: 0\nHT: 8-0\nTupapa Maraerenga FC pulled off a hard-fought 3-2 victory at the OFC Men’s Champions League – Qualifying to deny Veitongo FC a qualification spot.\nThe opening exchanges of the match were played at a frantic pace with both sides looking to play expansive football and Veitongo especially keen to make a fast start in their bid to rack up the goals.\nThe seventh minute delivered the first chance. Tupapa Maraerenga Captain Grover Harmon took aim from a long way out and his shot had Veitongo goalkeeper Semisi Otukolo scrambling, just managing to get his fingertips to the ball.\nTupapa were forced into an early substitution after a key figure in the midfield, Paavo Mustonen, picked up an injury in the 16th minute.\nChances had been few and far between with neither team able to create clear cut opportunities. In the 24th minute Veitongo secured the crucial breakthrough. A loose ball bounced out to in-form forward Elias Kendler on the top of the box, whose shot took a deflection off a Tupapa player and went into the back of the net.\nThe crowd erupted and finally Veitongo had some wind in their sails. Up one-nil they went chasing for more goals and it seemed only a matter of time before they found another, with the team full of energy.\nThe host side may have dominated most of the first-half, but Tupapa Maraerenga kept fighting and were rewarded with a penalty kick after Ngametua Tuakana was brought down in the area after a clumsy challenge.\nIrishman Dylan Connelly stepped up to expertly dispatch the ball into the bottom corner of the net, leaving the match one-all heading into the final minutes of the first period.\nMinutes later the action turned towards the other goal. Kendler drilled a low shot from outside the box only for the ball to hit the post and deny Veitongo a second heading into the break.\nTension was high heading into the second-half for Veitongo who needed six goals to reach the OFC Men’s Champions League. While they dominated possession, they couldn’t turn it into goals, which would prove to be their undoing.\nIn the 57th minute, Tupapa turned a rare chance in Veitongo’s half into a goal. After Grover Harmon’s header hit the crossbar, Dylan Connelly cleaned up the scraps, poking it home to give the Cook Island men a 2-1 advantage.\nTupapa then quickly doubled their lead six minutes later with a glorious strike from about 35 yards out by Akiona Tairi – stretching the lead to two goals and effectively killing off any hope Veitongo had of booking a place in Tahiti in May.\nWith only pride left to play for, Veitongo FC refused to give in. Tuia Falepapalangi put the ball on a plate for Elias Kendler to score his second and ensure a tight finish to the final match of the tournament.\nThe final blot on Veitongo’s copy book was a late red card for Opesi Tuifangaloka, picking up a second yellow in the dying seconds.\nWith the final whistle came confirmation for Samoa’s Vaivase-Tai FC that they will be playing Champions League football in Tahiti in May. Reward for their efforts in Nuku’alofa is a spot in Group B, alongside the respective National Playoff winners from Tahiti, Vanuatu and New Caledonia.\nTupapa Maraerenga FC: 3 (Dylan CONNOLLY (P) 43, 57, Akiona TAIRI 63)\nVeitongo FC: 2 (Elias KENDLER 24, 70)\nHT: 1-1\nContent Sourced from scoop.co.nz\nOriginal url",
  "word_count": 1061,
  "scraped_at": "2026-02-14T01:51:19.051814",
  "_text_extracted": true
}