{
  "article_id": "f37077cdcd2e",
  "url": "https://www.teamtalk.com/manchester-united/red-devils-turn-their-back-benzema-transfer-after-taking-hard-lines-stance-over-big-signing-issue",
  "title": "Man Utd turn their back on Karim Benzema transfer after taking hard - line stance on big signing issue",
  "date": "20240125T190000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd turn their back on Karim Benzema transfer after taking hard-line stance on big signing issue\nManchester United transfer chiefs have reportedly declined the chance to sign one of Europe’s elite strikers of the past decade in Karim Benzema.\nThe Al-Ittihad frontman has emerged as a potential option for the Red Devils in January as Erik ten Hag looked to take the heat off summer signing Rasmus Hojlund after his domestic struggles this season.\nThe Dane has only scored two Premier League goals, which is in stark contrast to the five he netted in the Champions League group stage.\nAdd in the fact that backup frontman Anthony Martial has been sidelined for 10 weeks with a groin problem and United look a little light on forward options.\nGoals have also been an issue for United this season, having only scored 24 in 21 Premier League games so far, as they try and make a charge for the top four in the second half of the campaign.\nTen Hag’s men are currently 11 points behind fourth-placed Aston Villa and are more likely to have to settle for a Europa League or Europa Conference League spot instead.\nBut given their attacking woes, a potential move for Benzema has been strongly mooted from several quarters.\nHowever, it’s now been claimed that United do not want to sign the 36-year-old, who is paid a whopping £86million a year, over wage demands and fears of breaching FFP rules.\nBenzema only moved to Saudi side Al-Ittihad in the summer on a free transfer from Real Madrid. And, despite scoring 12 goals in 20 appearances, his side currently sit seventh in the table after a poor run of form.\nBenzema in trouble with Al-Ittihad\nEarlier this week, it was revealed that Benzema was exiled from the Al-Ittihad squad after returning from holiday 17 days late.\nThe 2022 Ballon d’or winner is said to have incensed his current employers, who were expecting to him to report back on January 2 ahead of the side’s mid-season training camp.\nAnd now, according to Marca, Benzema has been omitted from the trip to Dubai by manager Marcelo Gallardo and continues to train on his own ahead of the league resumption on February 7.\nIn terms of Martial, he may have played his last game for the club after United decided not to extend his £250,000-a-week contract.\nThat means the former France international can walk away as a free agent this summer, nine years after signing from Monaco.\nMartial’s exit is expected to be a small part of a bigger squad revamp under Sir Jim Ratcliffe as the new United part-owner takes up his role in charge of football operations.\nIndeed, Ratcliffe is being tipped to make a massive splash in the summer market for Real Madrid winger Vinicius Junior.\nUnited are back in action on Sunday afternoon when they head to League Two Newport County in the FA Cup fourth round.\nREAD MORE: Man Utd flop with zero goals vows to ‘come back different’ despite Ratcliffe’s brutal sale demand",
  "word_count": 515,
  "scraped_at": "2026-02-14T02:10:42.033913",
  "_text_extracted": true
}