{
  "article_id": "f3799527e0b5",
  "url": "https://www.fourfourtwo.com/person/player/the-top-players-and-palmer-looked-ready-to-start-showing-he-was-one-dont-just-want-the-medal-or-the-experience-they-want-to-play-a-key-role-david-james-on-cole-palmers-winning-attitude",
  "title": "  The top players – and Palmer looked ready to start showing he was one – dont just want the medal or the experience , they want to play a key role  David James on Cole Palmer winning attitude",
  "date": "20251025T090000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘The top players – and Palmer looked ready to start showing he was one – don’t just want the medal or the experience, they want to play a key role’ David James on Cole Palmer’s winning attitude\nThe former England stopper has been impressed by the young Chelsea star’s desire to succeed\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nCole Palmer’s emergence as one of Europe’s best young players is the result of desire, drive and confidence, according to former Manchester City and England goalkeeper David James.\nPalmer’s first taste of senior football came as an 18-year-old when he played in a fourth-round League Cup clash in September 2020, as he looked to make the transition from promising youngster at the Etihad to a regular first-teamer in one of the planet’s most star-packed sides.\nBy the time of club’s 2022/23 treble-winning campaign, Palmer was beginning to contribute regularly to Pep Guardiola’s first team, but he still had a queue of established world-class talents ahead of him.\nDavid James on Cole Palmer’s desire for first-team football\n“There’s always been that system there under Pep, where young players are slowly blooded,” James tells FourFourTwo. “The same thing had happened with Foden a few years earlier – there was this clamour among fans to see him starting.\n“Everyone could see Palmer had the talent, but Guardiola doesn’t want to lose games, lose points. You can understand that, because he’s a winner. But you could also understand the frustration from Palmer’s side.”\nAfter his initial breakthrough, Palmer’s minutes dried up in both the Premier League and Champions League as the 2022/23 season went on, with the youngster not featuring at all during the knockout stages in Europe.\n“Some players are OK with that – especially youngsters, who feel lucky just to be there,” James continues. “They get that experience and a winner’s medal.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“But the top players – and Palmer looked ready to start showing he was one – are never happy with that. They don’t just want the medal or the experience, they want to play a key role.”\nPalmer would end up making 25 appearances in total that campaign, at an average of 34 minutes each and James insists that Palmer made a key contribution to the club’s greatest-ever campaign.\n“Cole played an important role that season, plus his good performances in training would have pushed those ahead of him to even higher levels,” James adds.\n“It takes a whole squad to be successful. Pep would have valued that. But you can imagine Cole sitting there during that Champions League final thinking, ‘I want to be out there and I have the ability to be’.\n“He said soon after joining Chelsea that he wanted to be playing regularly and even win the Ballon d’Or some day,” reflects James. “To have that kind of drive and confidence is wonderful.”\nDavid James was speaking in association with Esports Bets\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.\n- Ed McCambridgeStaff Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 738,
  "scraped_at": "2026-02-14T02:15:53.537416",
  "_text_extracted": true
}