{
  "article_id": "f386951edc35",
  "url": "https://torrentfreak.com/uefa-targets-pirate-euro-2024-live-streams-before-they-start-240613/",
  "title": "UEFA Targets Pirate EURO 2024 Live Streams Before They Start * TorrentFreak",
  "date": "20240613T154500Z",
  "domain": "torrentfreak.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA is the international body that governs football throughout Europe.\nAs part of FIFA, the organization holds the rights to several major competitions and tournaments, including the Champions League and the European Championships.\nThese events are good for billions of euros in broadcasting rights and with these types of figures at stake, UEFA is understandably keeping a close eye on piracy. The job has become increasingly complex, now that unauthorized live-streaming is booming.\nEURO 2024 Pirates\nWith the EURO 2024 tournament starting in Germany tomorrow, the organization and its anti-piracy partners are on high alert. Systems are in place to detect and shut down pirate streams within minutes, and social media will be heavily monitored as well.\nUEFA is not the only organization preparing for the major tournament; pirates are planning ahead as well. In recent weeks, several sites have put up placeholders for the upcoming EURO 2024 matches.\nThese placeholders are picked up and indexed by search engines. As a result, the pirate sites are easily findable when match day comes. That is, if these pages are still in search engines by then.\nAccording to a notice, published in the Lumen database, UEFA anti-piracy partner ‘Friend MTS’ asked the search engine to remove thousands of ‘pirate’ live-streaming links over the past week. This includes links to EURO 2024 games that are not even ‘live’ yet.\nPreemptive Takedowns\nThe Chinese site below, for example, prepared a dedicated page for upcoming Euro 2024 live streams. After Friend MTS listed the URL in a takedown notice, Google promptly removed it. The same is true for other “EURO 2024” pirate streaming placeholders.\nGoogle has removed most of these links from its search index. Although there is technically no copyright infringement yet, Google presumably finds it reasonable to assume that links to pirated streams will appear there eventually, as advertised.\nIn some cases, UEFA’s requests are rather broad. For example, one of the EURO 2024 takedowns lists a page from Leisu.com that doesn’t mention live streams. Instead, it looks more like a live score page.\nAccording to its own website, Leisu Sports is the official ‘copyright data supplier‘ of the Chinese Football Association.\nWe don’t know whether Google looked into the matter in detail, but the company removed the leisu.com URL from its search results. That said, Google doesn’t simply take down every link that’s submitted.\nHomepage Removals\nAfter looking into more UEFA takedown requests from this month, including friendly matches that were played over the past days, we see many ‘homepages’ of pirate streaming sites listed. Google appears to be more reserved when it comes to such broad requests.\nFor example, 123koora.com, amzfutbol.com, rojadirectenvivo.me, and others are still indexed by Google, despite being listed in takedown requests.\nIt’s clear that UEFA will be pulling out all the stops to ensure that licensed broadcasts are properly protected. In the past, it also sent advance warnings to pirate site owners directly, but we haven’t heard similar reports this time around.\nEUIPO Support\nWhile Europe is gearing up for the Championship of the continent’s most popular sport, UEFA received some indirect support from the European Union’s Intellectual Property Office.\nYesterday, EUIPO put a spotlight on the alarming sports streaming piracy rates in the EU. The press release mostly regurgitates previously published reports, but that didn’t prevent mainstream media from picking it up.\n“According to EUIPO data, millions of EU citizens access or stream sports content from illegal online sources while fake sports equipment cost manufacturers €850 million per year,” EUIPO wrote.\nOne can wonder whether a reminder of the immense popularly of pirate live streams actually works as an advertisement to the general public, instead of a deterrent. After all, research has shown that these popularity ‘warnings’ can backfire.\nEUIPO’s intentions are clear; however. It wants fans to ‘play fair’ and use legitimate viewing options, as pirate ‘cheers’ don’t pay off.",
  "word_count": 645,
  "scraped_at": "2026-02-14T01:48:52.512842",
  "_text_extracted": true
}