{
  "article_id": "f3ab79d80a08",
  "url": "https://www.thenews.com.pk/latest/1115925-real-madrid-edge-napoli-3-2-with-bellingham-brilliance-in-champions-league-clash",
  "title": "Real Madrid edge Napoli 3 - 2 with Bellingham brilliance in Champions League clash",
  "date": "20231004T010000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid edge Napoli 3-2 with Bellingham brilliance in Champions League clash\nJude Bellingham's ability to score in various ways has made him a standout player for Real Madrid since his arrival\nReal Madrid secured a hard-fought 3-2 victory against Napoli in an enthralling Champions League showdown at the Stadio Diego Armando Maradona, with Jude Bellingham's stellar performance stealing the spotlight.\nThe match began with both teams showing determination and resilience, taking advantage of the hostile atmosphere in Naples, which had recently been rattled by a series of earthquakes.\nNapoli got the early lead when Leo Ostigard headed home after a Kepa Arrizabalaga blunder in the 19th minute. However, Real Madrid responded swiftly as Vinicius Jr. capitalised on Bellingham's assist to level the score.\nIn the second half, Napoli clawed back into the game as Piotr Zielinski converted a penalty awarded after a VAR review for a handball by Nacho Fernandez. Napoli's high-intensity pressing made it a challenging contest for the Spanish giants.\nThe pivotal moment arrived late in the match when Federico Valverde unleashed a powerful shot that ricocheted off the crossbar and into the net via goalkeeper Alex Meret's arm.\nThe unfortunate own goal gave Real Madrid a crucial victory, pushing them to the top of Group C with six points from two matches.\nReal Madrid coach Carlo Ancelotti praised Bellingham's exceptional display, saying, \"What's so amazing about Bellingham is that he's only 20. He has great quality, a strong personality, and character.\"\nDespite Napoli's spirited performance, their unbeaten home run in the Champions League came to an end. They currently sit in second place in Group C, ahead of Braga on head-to-head records.\nBoth teams exhibited the potential to make a deep run in the competition, showcasing their quality on the European stage. Napoli's early intensity tested Real Madrid, but the visitors fought back to claim victory.\nJude Bellingham's breathtaking solo effort will be remembered as a highlight of the match, solidifying his reputation as one of the world's top talents. His ability to score in various ways has made him a standout player for Real Madrid since his arrival.\nThe clash at the Stadio Maradona lived up to its billing as a thrilling encounter, leaving fans eager for more high-stakes European football in the coming weeks.\n-\nBreezy Johnson engaged at Olympics after emotional finish line proposal\n-\nOlympics men hockey game: McDavid, Crosby power Canada past Czechia\n-\nEx-Arsenal footballer Thomas Partey charged with additional rape counts\n-\nChloe Kim set for historic halfpipe gold showdown at Milano Cortina\n-\nVladyslav Heraskevych disqualified from Winter Olympics 2026 over helmet controversy\n-\nThomas Tuchel set for England contract extension through Euro 2028\n-\nMilano-Cortina 2026: Assessing Italy’s Winter Olympics economic growth\n-\nVictor Wembanyama’s historic first half tops Tim Duncan, sparks massive NBA reactions",
  "word_count": 468,
  "scraped_at": "2026-02-14T02:10:28.717279",
  "_text_extracted": true
}