{
  "article_id": "f3b1934d9547",
  "url": "https://www.vol.at/oefb-chief-proell-for-measures-due-to-flood-of-foreign-players/9652010",
  "title": "ÖFB Chief Pröll for Measures Due to Flood of Foreign Players",
  "date": "20250906T103000Z",
  "domain": "vol.at",
  "source_country": "Austria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ÖFB Chief Pröll for Measures Due to Flood of Foreign Players\nThe ÖFB leadership wants to support coach Rangnick in deploying more local players in Austrian top clubs again. ÖFB chief Pröll expressed doubts about the current effectiveness of the Austrian pot, which was introduced in the Bundesliga in 2004/05.\nThe use of players eligible for the ÖFB national team is financially rewarded. To participate, at least twelve Austrians must be on the match report, and even 13 if there are more than seven substitutes. There are no age restrictions, which could be a possible starting point. “I would definitely not resort to a single measure for the evolution of the Austrian pot. I believe it is a package of measures, and one must learn from all areas,” said ÖFB chief Josef Pröll.\nSeveral Bundesliga Clubs Forego Austrian Pot\nThe pot was recently endowed with around six million euros annually. How it will continue after the lower revenue from the sale of media rights until 2030 is to be decided this year, according to Bundesliga CEO Christian Ebenbauer. Sturm Graz, Red Bull Salzburg, Rapid, and LASK recently opted out of participation. The clubs rely on more foreign players, but neither champion Sturm nor Salzburg made it to the Champions League this season.\nOn the night of the first leg of Graz’s qualifier at Bodö/Glimt (0:5 on August 20), Rangnick contacted Pröll. “The line-ups were such a trigger point,” revealed the association chief. Especially since Bodö had nine Norwegians in the starting formation, while Sturm had only two Austrians, who also want to play for other associations (Leon Grgic and Emir Karic).\n“It’s not about assigning blame, but about a common goal of how football in Austria can be developed and also be successful internationally and at the national team level,” said Pröll about the foreign player issue. The former Vice Chancellor and Finance Minister welcomed Rangnick’s active involvement in such matters. “I have a lot of respect for leaders who think about measures that need to be taken today and will have an impact in a few years.”\nÖFB Chief Pröll: Improve Continuity from Academies\nIn his first three months at the ÖFB, Pröll initiated a strategy process estimated to last one year, in which the future of the academies should also be a central component. For many clubs, it seemed more lucrative in recent years to further develop foreign talents for a few years and then sell them again, rather than promoting players from their own youth.\n“The ideal vision in an ideal world would be that the system with the great academies we have in Austria, which bring up Austrian players, refine them, and accompany them through their respective top teams to abroad, works seamlessly,” said Pröll. When these players are mature enough to succeed abroad, the clubs could really make money with them and their academies. “That would be a very big wish that one should tend to approach.”\n(APA/Red)\nThis article has been automatically translated, read the original article here.",
  "word_count": 504,
  "scraped_at": "2026-02-14T01:49:53.055418",
  "_text_extracted": true
}