{
  "article_id": "f3b23017f610",
  "url": "https://www.teamtalk.com/liverpool/next-liverpool-manager-arne-slot-sack-talk-klopp-glasner-enrique-nagelsmann-de-zerbi-gerrard",
  "title": "Next Liverpool manager : Ranking replacements for Arne Slot as sack talk explodes and nine huge names are linked",
  "date": "20260121T071500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nRanking Liverpool replacements for Arne Slot as sack talk explodes and nine huge names are linked\nDespite winning the Premier League title in his first season at Liverpool, Arne Slot now faces an uncertain future at Anfield.\nLiverpool spent £440million (€505m, $600m) on new players in the summer transfer window, but they have had a difficult campaign and are winless in their last four Premier League matches.\nWhile the Liverpool owners are still backing Slot, contract talks over an extension have been shelved, and a managerial change may happen if the results don’t improve.\nTo that end, a trusted journalist on Tuesday claimed a change now appears certain this summer after what was described as a ‘pronounced decline’.\nWe’ve ranked the candidates that have been heavily linked with the Liverpool job in recent weeks.\n9. Steven Gerrard\nHaving made 710 appearances for Liverpool in his playing career, Gerrard has declared himself available to his boyhood club in any job they would require him in.\n“I’ll be brutally, brutally honest with you. I’d help Liverpool in any department at any minute of every day, I’d help them with anything,” he admitted.\n“I don’t want Arne Slot to lose his job. I want him to fix this and turn it around and make Liverpool great. I was bouncing all over the city four or five months ago when Liverpool won the league.\n“I’m a Liverpool fan. I want the best for Liverpool. But if Liverpool need me in any department at any time, I’ll be there for them.”\nThe 45-year-old last worked for Liverpool in the role of Under-18s coach and then won a lot of plaudits after leading Rangers to the 2020/21 Scottish Premiership title.\nBut his managerial stock plummeted after winning just 12 of his 38 Premier League games at Aston Villa, and he also had an underwhelming spell at Saudi Pro League club Al-Ettifaq.\nAppointing Gerrard would pull at the heartstrings of Liverpool fans, but they should be looking to hire a manager with a top-class coaching pedigree.\n8. Francesco Farioli\nAfter a disappointing spell at Ajax in the 2024/25 season, Farioli joined Porto in the summer and has now rebuilt his reputation.\nThe 36-year-old has led Porto back to the summit of the Primeira Liga with 17 wins in 18 league games, and sources revealed he has caught Liverpool’s attention with his innovative tactics.\nBut he might not be ready for the Liverpool job as the Premier League is a big step up from the Primeira Liga, as shown by Ruben Amorim’s disastrous 14-month stint at Manchester United.\n7. Oliver Glasner\nGlasner has announced his decision to leave Crystal Palace at the end of the season and is among the early front-runners to replace Amorim at United, but he has also been linked with a move to Liverpool.\nThe 51-year-old delivered Palace’s first-ever major trophy with a 1-0 win over Manchester City in the 2024/25 FA Cup final, and he also won the Community Shield by beating Liverpool on penalties.\nBut his Palace side have averaged the second-least possession in the Premier League this season, and it remains to be seen if his methods can translate into success at a top-level side that are expected to dominate possession.\n6. Andoni Iraola\nSince taking over at Bournemouth in the summer of 2023, Iraola has made the Cherries one of the most dynamic and exciting teams in the Premier League.\nHe has also delivered results, guiding them to a club-record points tally in the Premier League in 2023/24 before breaking his own record in the 2024/25 campaign.\nThe 43-year-old has admirers at Anfield but like Glasner, he also has no experience at any elite-level clubs and is yet to manage a squad of world-class stars and big personalities.\n“I know that Liverpool are wary of taking a route whereby they recruit a manager from a smaller club and give them a chance on the biggest stage in a high-pressure moment,” TEAMtalk insider Dean Jones said.\n“There are lots of examples where it does not work to headhunt a boss from a smaller club. Making that leap and meeting expectations is extremely difficult because you get so little time to make your mark in comparison.”\n5. Roberto De Zerbi\nDe Zerbi spent two years in the Premier League with Brighton & Hove Albion and forged a reputation as one of European football’s most innovative managers.\n“He’s a crazy guy but I love him. I think he is the best manager I’ve ever had,” Liverpool midfielder Alexis Mac Allister said.\n“It’s the passion he gives for football. That’s special. Then it’s his ideas, the tactical side is amazing. He makes you feel good in the team. Since the first day I met him, he was amazing with me, that’s why I said he was the best coach.”\nThe 46-year-old is now in charge of Marseille and could put Slot under more pressure when they play Liverpool in the Champions League on Wednesday night.\nLiverpool sporting director Richard Hughes is reportedly a big admirer of the Italian, who has the self-belief and personality to take on the job at Anfield.\n4. Julian Nagelsmann\nFollowing his impressive work at TSG Hoffenheim and RB Leipzig, Nagelsmann became the world’s most expensive manager when Bayern Munich acquired his services for £21.7million in 2021.\nHe picked up a Bundesliga title and two DFL Supercups before being sacked by the club, but has since done a brilliant job with the Germany national team.\nWhile the 38-year-old is unlikely to leave his current role before the 2026 World Cup, he could look to return to club management in the summer.\n3. Jurgen Klopp\nKlopp enjoyed a trophy-laden nine-year tenure at Liverpool, winning a Premier League title, the Champions League, the FA Cup, two League Cups, a UEFA Super Cup and the FIFA Club World Cup.\nThe 58-year-old left at the end of the 2023/24 season due to burnout and is now the head of global soccer at Red Bull, but he has left the door slightly ajar to a return to Anfield.\n“I said I will never coach a different team in England. So that means if [he returns to England] it’s Liverpool,” he said. “So yeah, theoretically it’s possible.\n“I love what I do right now, I don’t miss coaching. I don’t. I mean I do coach, just different, not players. And I don’t miss it. I don’t miss standing in the rain two-and-a-half, three hours. I don’t miss going to press conference three times a week, having 10-12 interviews a week. I don’t miss that.”\nLiverpool fans would undoubtedly welcome him back with open arms, although he should only return when he regains his love for day-to-day club management.\n2. Xabi Alonso\nThe second former Liverpool midfielder on this list, Alonso made a sensational start to his managerial career by winning an unbeaten league and cup double with Bayer Leverkusen in the 2023/24 campaign.\nLiverpool identified him as their top target when Klopp announced his intention to step aside in 2024, but he elected to remain at Leverkusen for one more season.\nThe Spaniard then replaced Carlo Ancelotti at Real Madrid last summer, but still admitted that he is open to the prospect of managing in the Premier League.\n“For sure, with English clubs and my former club,” he said. “But for the moment this is my place, this is where I want to be. In the future, you never know what will happen.”\nHe won 24 of 34 games in charge of Madrid, but reportedly had a disagreement with Florentino Perez and has since left the club by mutual consent.\nLiverpool remain keen admirers of the 44-year-old and appointing him could also help get the best out of Florian Wirtz and Jeremie Frimpong, who played under Alonso at Leverkusen.\n1. Luis Enrique\nA treble winner with both Barcelona and Paris Saint-Germain, Enrique is widely regarded as one of the best managers in the world.\nHe also has a good track record against Premier League sides, knocking out Liverpool, Arsenal and Aston Villa en route to PSG’s Champions League success last season.\nThey then beat Tottenham on penalties in the UEFA Super Cup and also recorded a 5-3 win against them in the Champions League earlier this season.\nHe has now entered the final 18 months of his contract at the Parc des Princes, and he has previously admitted he’d like to manage in the Premier League.\n“I have a special attraction – I would like to go to England to work,” Enrique said back in 2023. “I follow English football a lot, more than Spanish football. In the Spanish league, I do follow the biggest teams and little else.\n“If I see myself working in the Premier [League] in June? No, the truth is that I don’t – do you know why? Because it is very difficult for it to happen. I’m not going to deceive you – I’m not going to go to any team in the Premier [League]. I would like to go to one that has clear options to do important things.”\nWhile PSG are determined to keep him, the Liverpool job could appeal to the 55-year-old and they should make him their top target if they decide to replace Slot.\nREAD MORE: The key contract details of every Liverpool first-team player: Expiry dates, weekly wages, agents…",
  "word_count": 1569,
  "scraped_at": "2026-02-14T01:55:32.913138",
  "_text_extracted": true
}