{
  "article_id": "f3fe125b5ef6",
  "url": "https://www.thisdaylive.com:443/index.php/2024/04/20/man-city-chelsea-go-for-broke-in-crunchy-fa-cup-semi",
  "title": "Man City , Chelsea Go for Broke in Crunchy FA Cup Semi",
  "date": "20240420T053000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nMan City, Chelsea Go for Broke in Crunchy FA Cup Semi\nWith hope of a double treble now in ruins after Manchester City were beaten on penalties by Real Madrid to fall at the quarter-final hurdle and Pep Guardiola’s side will have to brush off Champions League heartache when they travel to Wembley to play Chelsea for a place in the FA Cup final. Chelsea meanwhile, return to Wembley for the first time since their Carabao Cup final defeat to Liverpool in February. The Blues remain inconsistent but have gone unbeaten against City this season\nAlmost two months on from their EFL Cup final defeat, Chelsea return to Wembley Stadium for an FA Cup semi-final showdown with holders Manchester City this evening.\nThe victors of this all-Premier League clash will face the winners of the second semi-final tie between Championship outfit Coventry City and Manchester United.\nMan City’s dreams of retaining their Champions League crown and celebrating an unprecedented double-treble are over, after they were dethroned as Europe’s finest by a team described by Guardiola as the ‘kings of the competition’ in 14-time winners Real Madrid.\nA week on from their enthralling 3-3 first-leg draw in Spain, the Citizens were left frustrated as they were forced to play out a 1-1 draw in the reverse fixture at the Etihad Stadium on Wednesday; Kevin De Bruyne cancelled out an early Rodrygo opener, but a resilient Los Blancos outfit sent the tie to penalties.\nAlthough Luka Modric missed Real’s first spot kick, both Bernardo Silva and Mateo Kovacic failed to convert from 12 yards, before Antonio Rudiger netted the decisive penalty to send City – who lacked a cutting edge in the final third despite boasting 33 shots, 68 per cent possession and 18 corners prior to the shootout – packing at the quarter-final stage.\nGuardiola rued his side’s missed opportunities in the tie, but the second-leg draw in 90 minutes means that City have now equalled both their longest ever unbeaten run across all competitions (28 matches) and their longest ever unbeaten home run in all competitions (42 games).\nThe Citizens have little time to rest and regroup as they endeavour to end the season on a high by retaining two domestic trophies in the Premier League and FA Cup, starting with their record sixth successive appearance at the semi-final stage of the latter competition this weekend.\nCity, who have already beaten Huddersfield Town, Tottenham Hotspur, Luton Town and Newcastle United in this season’s FA Cup, have interestingly lost three of their previous five matches at the semi-final stage, including one loss at the hands of Chelsea (1-0) in 2021. Guardiola and co have since put together an eight-game unbeaten run against the Blues, though, including six straight wins before back-to-back league draws earlier this season.\nWhile Man City are tasked with dusting themselves down from a heartbreaking European exit, Chelsea enter Saturday’s contest in buoyant mood after thrashing Everton 6-0 at Stamford Bridge in the Premier League on Monday – their biggest win to date since the arrival of head coach Mauricio Pochettino.\nFormer Citizens youngster, Cole Palmer has drawn level with Erling Haaland on 20 goals at the top of the Premier League scoring charts after netting four times, including a 29-minute hat-trick, while Nicolas Jackson and Alfie Gilchrist were also on target against the Toffees to help the West Londoners strengthen their hopes of securing European football for next season.\nChelsea, who have not lost any of their last eight top-flight matches, capitalised on each of Wolverhampton Wanderers, Brighton & Hove Albion, West Ham United and Manchester United dropping points last weekend and have subsequently climbed up to ninth in the table, just three points behind sixth-placed Newcastle who have played a game more.\nA challenging and potentially defining run of fixtures over the next few weeks awaits the Blues, who follow up today’s FA Cup clash against Man City with a trio of Premier League London derbies against Arsenal, Tottenham and West Ham – Chelsea have won just two of their last 15 games against these four teams combined since the start of last season.\nChelsea, who have battled past Preston North End, Aston Villa, Leeds United and Leicester City in this season’s FA Cup, are now gearing up for their 27th FA Cup semi-final – only Man United (32) and Arsenal (30) have competed at this stage on more occasions in the competition’s history – but the Blues have been eliminated from five of their last seven FA Cup ties against Man City, including a humbling 4-0 loss in the third round last season.",
  "word_count": 770,
  "scraped_at": "2026-02-14T02:07:51.325041",
  "_text_extracted": true
}