{
  "article_id": "f40148ab4648",
  "url": "https://metro.co.uk/2026/02/11/tim-sherwood-responds-calls-replace-thomas-frank-tottenham-interim-manager-26833392/",
  "title": "Tim Sherwood responds to calls to replace Thomas Frank as Tottenham interim manager | Football",
  "date": "20260211T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tim Sherwood has refused to rule out the possibility of returning to Tottenham to take charge as interim manager following Thomas Frank’s dismissal.\nSpurs announced that Frank had been relieved of his duties this morning in the wake of the side’s 2-1 defeat at home to Newcastle in the Premier League.\nIt was just the latest in a desperately poor run of domestic results, with the club languishing down in 16th place – and just five points above the relegation zone.\nThere had been a growing feeling of discontent amongst Spurs’ fanbase and Frank’s position was ultimately deemed to be untenable after chants of ‘You’re getting sacked in the morning’ reverberated around the Tottenham Hotspur Stadium on Tuesday night.\nThe 52-year-old Dane leaves his post after just eight months at the helm having previously managed Brentford for seven years.\nIt’s understood the north London outfit will replace Frank with an interim head coach until the end of the season.\nThe likes of Roberto De Zerbi, Robbie Keane and Mauricio Pochettino are among the bookmakers’ favourites to take over the reins on a permanent basis in the summer.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nOne of the many names linked as a possible short-term solution for Spurs is Sherwood, who has been out of a job in football since leaving his role as director of football at Swindon Town in 2017.\nSherwood of course managed from 2013 to 2014, steering the club to the final of the Carabao Cup and a sixth-place finish in the Premier League.\nAsked if he would consider an offer to return as an interim manager, Sherwood told Sky Sports News: ‘I think there’s going to be a shortlist of people they could turn to.\n‘I genuinely believe they’re going to give it to John Heitinga. He’s the man there already, he’s got experience as a manager.\n‘It didn’t work out great for him, obviously, at Ajax but Tottenham in the Premier League is a great opportunity for someone who is not in a job.\n‘It’s a club I love, I know a lot about it and I’ve spent many years there in different capacities and it needs someone to give them a lift at the moment.\n‘Whether that’s me or whoever they decide to bring in, they’ve got a tough job on their hands.’\nSherwood is confident there would be ‘no future’ for whoever Tottenham call upon to replace Frank for the short-term given the ‘clamour’ for Mauricio Pochettino to take charge in the summer.\n‘Let’s face it, in the summer it’s going to be Pochettino,’ he added.\n‘It will be impossible or almost impossible for Tottenham to look beyond Mauricio Pochettino with the clamour from the Tottenham support to bring the man back to the club.\n‘Whoever is going in there is going in for 12 games plus that Champions League run, there’s no future at the club for that person.\n‘So there will be very few who want to put their hands up and put themselves on offer for 12 games.’\nNext permanent Tottenham manager odds\nRoberto De Zerbi 1/2\nMauricio Pochettino 7/4\nXavi Hernandez 8/1\nRobbie Keane 8/1\nRuben Amorim 12/1\nXabi Alonso 16/1\nOliver Glasner 16/1\nEnzo Maresca 20/1\nMichael Carrick 25/1\nOdds courtesy of BetVictor\nSherwood ‘feels sorry’ for Frank but is not surprised to see the Dane lose his job when considering Tottenham’s recent results and performances.\n‘You play however you want if you’re winning football matches. If you don’t win football matches then, especially at Tottenham, they start looking at the style, are they being entertained? And the answer was absolutely not,’ he said.\n‘But I think if you’ve seen Thomas Frank’s style of play down the years you would have known that it was very unlikely he was going to change his style. It was successful for him at Brentford.\n‘I think the nature of the job at Tottenham, comparing it to Brentford, it’s a completely different animal. The expectation at Tottenham, you can’t just win a game, lose one, draw a couple… it’s not acceptable, especially when you’re at home.\n‘The fans want to be entertained and they want to be successful and he didn’t give any of that.\n‘I feel sorry for him, you always feel sorry for any manager who loses his job, but I just felt it was inevitable in the end.\n‘They now find themselves in a really tricky position, this balancing act between now and the summer when there is going to a whole host of managers who would like to take the Tottenham job.’\nAccording to Sherwood, Frank allowed a serious indiscipline problem to creep in under his management – and it needs to be ‘stamped out’ by whoever comes in to take charge.\nThe ex-Spurs and Aston Villa boss explained: ‘I think there’s been a lack of discipline there, not just with Cristian Romero but also with Micky van de Ven and Djed Spence when they failed to walk around and clap the fans and Thomas was demanding they do so.\n‘There was a lack of respect there for the manager and I think that needs to be stamped out as well.\n‘You’re in it together, it’s not an individual sport. You’re in it, they’ve got to show everything for that shirt and that club.\n‘The man who is going to be in charge has to understand what those fans demand.\n‘It’s going to be a tough job in the short-term and the long-term moving forward.’\nWith just five points separating Spurs from the drop zone, Sherwood is under no illusions that the club find themselves in a genuine fight for survival.\n‘Let’s face it, they’re in a relegation battle,’ he continued.\nMore Trending\n‘They’re playing the north London derby next and, last night, West Ham were nearly three points away from Tottenham in the league and they look like they’ve got real fight in that group.\n‘Nottingham Forest play tonight and now Tottenham fans are looking down rather than up which is not a very positive sign.\n‘They are 100 per cent in a relegation battle and it’s not necessarily for the interim manager to go in, and it will be an interim manager I would suggest, to worry about performances too much.\n‘He’s just got to concentrate on results, it’s all about the results now and just digging them out.’\nWould Sherwood be a good short-term option for Spurs?\n-\nYes\n-\nNo\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Keith Andrews fires warning to Arsenal ahead of clash with in-form Brentford\nMORE: Mikel Arteta responds to Tottenham sacking Thomas Frank before Arsenal clash\nMORE: Roberto De Zerbi stance on Tottenham job revealed after Thomas Frank sacking",
  "word_count": 1182,
  "scraped_at": "2026-02-14T01:59:36.832306",
  "_text_extracted": true
}