{
  "article_id": "f41855e3380b",
  "url": "https://sports.yahoo.com/vibrant-fan-culture-euro-2024-152749195.html",
  "title": "Vibrant fan culture at Euro 2024 comes at security cost of beer cup showers and field invaders",
  "date": "20240628T161500Z",
  "domain": "sports.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vibrant fan culture at Euro 2024 comes at security cost of beer cup showers and field invaders\nFRANKFURT, Germany (AP) — The flip side of the European Championship having a vibrant fan culture is the added security risk inside stadiums.\nA tournament staged in Germany that is affordable and accessible in the center of Europe has revealed some of those challenges.\nToo many fans have got on the field and close to players, most often seeking a selfie with Cristiano Ronaldo. The Portugal superstar also was nearly hit on Wednesday while entering the players’ tunnel by a leaping fan landing next to him.\nA brawl in a stadium was fought by fans of Georgia and Turkey ahead of their opening game on June 18 in Dortmund.\nThis tournament has been almost free of hooliganism that once dogged the Euros, often involving England fans. But a brief incident in Gelsenkirchen ahead of England's opening game there was mostly blamed on Serbia fans.\nAt the most beer-friendly of recent soccer tournaments, plastic cups have rained down on the playing area and television commentators have broadcast about getting in-game beer showers.\nEngland coach Gareth Southgate was the target of the most hostile cup-throwers, in the cheapest seats behind one goal, after a drab 0-0 draw with Slovenia. The families of England players sitting in a more expensive section of the Cologne stadium also were aimed at.\n“My brother was hit, a few others,” England defender Ezri Konsa said. He added the cups were “coming from all angles. There’s kids in the stands with family so we always have to check on them, reassure them and ask if they’re all right.”\nAll of the above incidents are offenses under the disciplinary code of UEFA, resulting in fines of a few thousand euros (dollars).\nThose are paid by national soccer federations, which each receive at least 9.2 million euros ($9.9 million) in prize money from UEFA and are liable for fan behavior at stadiums. UEFA imposed fines for “throwing of objects” on the federations of Scotland, Albania and Serbia in the first week of the month-long tournament.\nUEFA and Germany organizers were themselves liable for an embarrassing incident at the opening ceremony in Munich two weeks ago, before Germany played Scotland. A German YouTuber dressed in a bear costume got to the field as a fake mascot after entering without a valid credential.\nEuro 2024 is run as a joint venture between UEFA’s events operations unit and the German soccer federation. Neither has held a news conference since teams and fans arrived in Germany.\nUEFA did not respond on Friday to questions about stadium security operations.\nAfter multiple fans seeking selfies approached Ronaldo on the field, during Portugal’s 3-0 win over Turkey last Saturday, UEFA said in a brief statement that security around teams and stadiums “are the ultimate priority” and would be increased.\nUEFA needs cooperation with German public authorities to make the tournament safe, though issues at Euro 2024 have been seen at other showpiece European games it organized in the past three years.\nUEFA’s reputation for duty of care toward fans was hit by chaotic and dangerous scenes at the last Euros final, at Wembley Stadium in London in July 2021, and the Champions League final in Paris in May 2022.\nAt the Champions League final in London four weeks ago, play was stopped one minute into the game when multiple people eluded field-side security staff to run across the turf. A YouTuber’s cash offer to tempt field invaders was responsible.\nBut the times Euro 2024 games have been held up have seemed to be with no malicious intent.\n“It is a concern,” Portugal coach Roberto Martinez said, “because today we were lucky that the intentions of the fans were good.”\nA Serbia fan filmed running across the field in Munich on Tuesday seemed to be carrying a nationalist flag that he dropped while eluding a single security steward.\nEuro 2024 has so far been free of political statements on the field — except by one Albania player — though fans have stated strong views in the stadiums.\nField invaders at recent World Cups included the rainbow flag-carrying fan in 2022 in Qatar and Pussy Riot's appearance at the 2018 final in Moscow. Then, Russian President Vladimir Putin had to watch four activists from the protest group run across the field. One of them high-fived France star Kylian Mbappé.\nThe fireworks and flares that are part of European fan culture have not yet been thrown on the field at Euro 2024. Play was suspended for a few minutes at a Euro 2016 game, when Croatia fans threw flares and firecrackers on the field in Saint-Etienne, France.\nIn 2016, alcohol was barely a factor as French law allowed only low strength beer to be sold at stadiums. Laws in Poland, which co-hosted Euro 2012 with Ukraine, also stopped sales of beer with alcohol at games.\n“It’s not specific to this Euro,” Football Supporters Europe executive director Ronan Evain told the Associated Press of issues at this tournament, “but it is the first Euro with real beer.”\nFans in the 10 stadiums are paying at least 7 euros ($7.50) for beer, cider or wine sold at concessions stands. Those drinks can be taken by fans to their seats, unlike at stadiums in England.\nEvery cup branded with the tournament beer, Bitburger, that is thrown at a coach, player or field invader comes at a cost: The loss of a three euros ($3.20) deposit just to get the cup.\n___\nAP Euro 2024: https://apnews.com/hub/euro-2024",
  "word_count": 929,
  "scraped_at": "2026-02-14T01:51:32.420580",
  "_text_extracted": true
}