{
  "article_id": "f4191f3c8eb2",
  "url": "https://thechronicle.com.gh/weekend-european-leagues-fixtures-previews-9/",
  "title": "Weekend European Leagues Fixtures & Previews - The Chronicle News Online",
  "date": "20240223T100000Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal resume Premier League duty against Newcastle\nArsenal side reeling from an excruciating injury-time goal host a Newcastle United team who rejoiced in a last-minute intervention in Saturday’s Premier League clash at the Emirates.\nThe Gunners fell to a 1-0 loss in the first leg of their last-16 Champions League affair with Porto on Wednesday evening, while Eddie Howe‘s men left it late to snatch a point in a 2-2 draw with Bournemouth last weekend. Record-breaking goalscoring feats in Premier League away games did not translate into an evening of continental dominance for Arsenal on Wednesday.\nThe unusually shot-shy Gunners – who last failed to have a shot on target in a Champions League game in 2011 – still have 90 minutes in North London to right their European wrongs, though, and Arteta’s men resume Premier League duty on a historic five-game winning sequence in the top flight.\nNow on the hunt for a third straight Premier League home success following triumphs over Crystal Palace and Liverpool – notching eight goals along the way – Arsenal still boast the division’s meanest defence with just 22 goals shipped, but Newcastle and Porto have something in common when it comes to keeping the Gunners out.\nThree of Arsenal’s last four Premier League games versus Newcastle have seen the Gunners fail to breach the Magpies’ backline, and jellied legs on the hosts’ end will do their prospects of rectifying Wednesday’s meek attacking performance against Porto.\nCredit: sportsmole.co.uk\nReal Sociedad host Villarreal at the Reale Arena today\nReal Sociedad will be bidding to make it successive victories in Spain’s top flight when they welcome Villarreal to the Reale Arena on Friday evening.\nThe home side will enter the contest off the back of a 2-1 win at Mallorca, while Villarreal drew 1-1 with Getafe in their last match at this level of football. There is no getting away from the fact that Real Sociedad’s league form has suffered due to their involvement in the Champions League and Copa del Rey, with the Basque outfit currently in sixth position in the La Liga table.\nVillarreal, meanwhile, will enter this match off the back of a 1-1 draw with Getafe last Friday, which proved to be their third straight draw in a row in Spain’s top flight.\nThe Yellow Submarine have shared the points in four of their last five matches at this level, but the run also includes a standout 5-3 victory over Barcelona. Marcelino‘s side are also active in Europe this season, and they will definitely need to win the Europa League to be active in the Champions League during the 2024-25 campaign\nReal Sociedad recorded a 3-0 win over Villarreal in the reverse match earlier this season; we are not expecting it to be so one-sided in this game, especially considering the home side’s injury problems. However, Real Sociedad should still have enough quality to navigate their way to an important three points.\nCredit: sportsmole.co.uk\nLaLiga’s top scorers square off as Barca welcome Getafe\nTwo of LaLiga’s top scorers square off when Robert Lewandowski‘s FC Barcelona hosts Borja Mayoral‘s Getafe CF on Saturday. Lewandowski is sixth with 12 goals, and Mayoral has 15 to rank second. This match will be played at the Estadi Olímpic Lluís Companys on Saturday.\nBarcelona took on RC Celta de Vigo away from home in its last game and picked up a victory by a final score of 2-1. Lewandowski scored for each of two of his side’s goals in the match against Celta de Vigo.\nGetafe finished with a 1-1 road draw against Villarreal CF in its most recent game on February 16. Nemanja Maksimovic scored the lone goal for Getafe.\nBarcelona will look to climb temporarily to 2nd in La Liga, although Getafe have been a tricky opponent for them in recent times. Ahead of this round, the hosts are 3rd with 54 points, while the visitors are 10th with 34 points. The Catalans are two points behind Girona, who play later in the weekend, which gives them a golden chance to climb up the ladder.\nThey are coming off a 1-1 draw against Napoli in the Champions League. In fact, they have conceded in four games in a row, and their backline is looking as vulnerable as ever. Even at this venue, Barcelona have conceded 14 goals across their last five league games, posing questions over their ability to keep a clean sheet.\nCredit: sportytrader.com\nBologna, Hellas Verona faceoff Friday night\nHellas Verona are currently in 18th place in the Serie A standings and have not been at their best so far this season. The away side held Juventus to an admirable 2-2 draw last week and will look to take it up a notch in this match.\nBologna, on the other hand, are in fifth place in the league table at the moment and have been in impressive form so far this season. The hosts stunned Lazio with a 2-1 victory in their previous game and will look to achieve a similar result this week.\nBologna have consistently punched above their weight so far this season and will be intent on making the most of their purple patch. The hosts have a good squad at their disposal and can pack a punch on their day.\nHellas Verona are in the midst of a relegation battle at the moment and cannot afford to slip up in this match.\nBologna have a good recent record against Hellas Verona and have won 13 out of the last 27 matches played between the two teams, as opposed to Hellas Verona’s six victories.\nCredit: sportsmole.co.uk",
  "word_count": 936,
  "scraped_at": "2026-02-14T02:13:34.146682",
  "_text_extracted": true
}