{
  "article_id": "f438147406c1",
  "url": "https://news.yahoo.com/champions-league-draw-live-man-105742738.html",
  "title": "Champions League draw LIVE : Man City and Chelsea discover quarter - final fate",
  "date": "20230317T114500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League draw LIVE: Man City and Chelsea discover quarter-final fate\nFollow live updates from the Champions League draw as the quarter-final and semi-finals ties are set. Holders Real Madrid and Manchester City are the clear favourites, with Napoli and Bayern Munich also looking strong, which sets up an intriguing draw with the contenders all hoping to avoid each other.\nConversely, the likes of Chelsea, AC Milan, Inter Milan and Benfica could be handed an opportunity to progress to the last four. Chelsea have twice won the Champions League after sacking their manager mid-season. Could Graham Potter’s side repeat the trick this campaign?\nMadrid and City both produced statement performances in the last 16, with the holders thrashing Liverpool at Anfield and Erling Haaland scoring five goals in the destruction of RB Leipzig. Will they be able to avoid each other as the path to Istanbul is made?\nFollow live updates from the Champions League draw, below:\nChampions League draw\nThe draw takes place at 11am GMT at the Uefa headquarters in Nyon, Switzerland.\nManchester City and Chelsea are the only English clubs left in the competition\nReal Madrid and Bayern Munich among favourites to win competition\nThree Serie A clubs make up the last-eight\nHow Real Madrid’s midfield maestros taught Liverpool a painful lesson\n10:53 , Michael Jones\nDifferent manner, same result, and enough to at least leave Jurgen Klopp wondering what is going on here. Real Madrid have ended Liverpool’s chances of winning the Champions League for the third successive season. On this occasion, though, the wonder wasn’t how you beat them but how you even score against them. Liverpool couldn’t get anywhere close to a comeback because they so struggled to get forward, leaving Karim Benzema to pick them off for a 1-0 that made it 6-2 on aggregate.\nA large part of that was admittedly down to an injury crisis in midfield, which made it a bad – or perhaps inevitable – night for Madrid to show how imperious they are in that area. Far from this being a team that could be ageing, in transition or just vulnerable, the European champions look a more complete team than last season. A lot of that might have to do with the fact they can call themselves European champions. It is as if it has given young stars like Vinicius Junior and Eduardo Camavinga the conviction to go to another level, while Luka Modric and Benzema stay at the standard of last season.\nThat makes them an immensely formidable side, and one that can’t quite be considered upstart revelations in all those twists of history en route to Paris. They might even be the best left in the competition, if that doesn’t sound odd for a team that hold the trophy.\nHow Real Madrid’s midfield maestros taught Liverpool a painful lesson\nWhere is the Champions League final being held?\n10:49 , Michael Jones\nThe 2022/23 Champions League final will take place on 10th June 2023 at Istanbul’s Atatürk Olympic Stadium which was the venue for Liverpool’s famous comeback victory over AC Milan in the 2005 showpiece.\nAre the Champions League semi-finals drawn at the same time?\n10:45 , Michael Jones\nYes. For the semi-final draw, four balls containing slips of paper marked ‘Winners of quarter-final 1’ to ‘Winners of quarter-final 4’ are placed in a large central bowl and shuffled.\nThe first and second balls drawn determine the first semi-final pairing, the first ball drawn representing the home team for the first leg. The procedure is repeated with the remaining balls in the bowl to complete the semi-final pairings.\nThere will then be a third draw to determine the ‘home’ side in the final for administrative reasons.\nHow does the Champions League quarter-final draw work?\n10:41 , Michael Jones\nEight balls containing the names of the quarter-finalists are placed in a large central bowl and shuffled. The first team drawn plays its first match at home, against the second team drawn.\nThe procedure is repeated with the remaining balls in the bowl to complete the quarter-final pairings.\nIt is an open draw. There are no seedings and no country protection, so clubs can face opposition from the same national association and teams they previously came up against in the group stage.\nGraham Potter says Chelsea spirit growing as Blues claim third successive win\n10:37 , Michael Jones\nChelsea boss Graham Potter warned that his side are finally finding their form after a 3-1 win at Leicester.\nBen Chilwell, Kai Havertz and Mateo Kovacic scored to clinch a third straight win and breathe fresh life into a season which looked in terminal decline just a week ago.\nPatson Daka did level for Leicester but they slipped to sit just a point above the relegation zone and had Wout Faes sent off late on.\nIt was just the second time Chelsea had netted three in the Premier League this season as they followed up wins over Leeds and Borussia Dortmund in clinical style.\nGraham Potter says Chelsea spirit growing as Blues claim third successive win\nProfessional predator Erling Haaland heading for 50-goal season\n10:33 , Michael Jones\nSome records last forever. Some last a mere 94 years. Since Tommy Johnson scored 38 times in 1928-29, no one in a Manchester City shirt had matched him. Until, with up to 19 games and perhaps almost three months of his season remaining, Erling Haaland surged past him in an extraordinary display of goalscoring. The Champions League is supposed to be the hardest competition in the sport but Haaland had five goals inside an hour of a knockout tie against the club who were semi-finalists two seasons ago.\nRecords are tumbling, and not merely City’s club best that was set before the Wall Street Crash and which lasted for half a century after Johnson’s death. The most by a City player in a Champions League campaign was Riyad Mahrez’s seven last year. Haaland cruised past that to become the top scorer in this season’s competition. He became the quickest player to 30 Champions League goals in just 25 games and now has a total of 33 goals.\nAfter four hat-tricks already in his brief City career, he scored his fifth on Tuesday night. Only Luiz Adriano and Lionel Messi had previously done that in a Champions League game and, had Pep Guardiola not removed him for the final half-hour, the competition’s maiden double hat-trick seemed on the cards.\nProfessional predator Erling Haaland heading for 50-goal season\nThe same faces, the same places: Repetitive Champions League is past the point of saving\n10:29 , Michael Jones\nAs Karim Benzema turned in the sort of finish he always does, even the Champions League ran out of great twists. Liverpool inevitably went out to Real Madrid for the third consecutive season, and it was all feeling a bit repetitive. Manchester City again destroyed German opposition in the last 16. Bayern Munich and Chelsea again prevailed.\nIt isn’t completely like that across the competition, since Napoli have been the season’s revelations. Their explosion has come as part of a wider resurgence for Serie A, with the two Milan clubs ensuring the league has three quarter-finalists for the first time since 2005-06. It also makes Italy, somewhat surprisingly, the best-represented country in the last eight.\nThis has widely and rightly been hailed as a welcome development and a strong Serie A is obviously good for football, but it’s also worth reflecting on what is happening here.\nThe Champions League is past the point of saving\nAre Potter’s Chelsea starting to gel?\n10:25 , Michael Jones\nGraham Potter has built on the foundations of Thomas Tuchel’s Chelsea. Typically playing with a robust back three and the double pairing in front with wingbacks providing attacking threat and defensive stability.\nRecently Chelsea have added fluidity and interchangeability of positions making them hard to work out and given the quality in the squad, the Blues are a dangerous prospect.\nThe question remains whether they can get their attacking talent to score goals, especially with so many new signings in January.\nCan Chelsea go all the way?\n10:22 , Michael Jones\nGraham Potter has had a difficult times of things since taking over as head coach of Chelsea. The Blues have spent heavily in two transfer markets and left Potter with a massive squad to choose from and train.\nThey’ve massively underperformed in the Premier League but have contrastingly played their best football in the Champions League.\nTwice Chelsea have sacked their manager in the middle of the season and have gone on to win Europe’s top competition, could history repeat itself a third time?\nThe Blues’ second-leg comeback against Borussia Dortmund signalled a turnaround in form and their ï»¿resolve on the European stage is unmatched. No team can better their record of overturning five first-leg deficits in this competition.\nFun, free-flowing Chelsea signal the start of something better under Graham Potter\n10:19 , Michael Jones\nA goalscorer turned up and Chelsea finally got goals. They were the side who struggled to score, the assortment of wingers and midfielders and No 10s who could not find the finishing touch. And when a striker appeared – and a World Cup Golden Boot winner, no less – than they started finding the net again, in rare quantity and with considerable quality.\nAdmittedly, Gary Lineker is a 62-year-old Leicester fan who suddenly found himself free on a Saturday, rather than Todd Boehly’s latest signing. But after two goals in Chelsea’s previous six league games, they scored three in a match for the first time since October.\nIn all competitions they have six in the best week of Graham Potter’s troubled time in charge and three straight wins. Finally, talk of progress is being accompanied by evidence of it. They were free-flowing, fun and full of flair. If beating Borussia Dortmund represented Potter’s finest result at Stamford Bridge, winning at Leicester ended Chelsea’s worst run on the road for 21 years. After 10 winless trips, they had an away day to savour.\nFun, free-flowing Chelsea signal the start of something better under Graham Potter\nIs this the year Man City finally win the Champions League?\n10:15 , Michael Jones\nWhat else do City have in their favour?\nPep Guardiola had a fully fit squad heading into Tuesday’s game, which is a fine position to be in at this stage of the season.\nPhil Foden has also returned to form after a difficult spell, allowing Riyad Mahrez – an impressive performer through the winter months – something of a rest. City will hope they can return after the upcoming international break ready to hit the ground running.\nThey do not yet know their opponents for the last eight but, after Tuesday’s win and with their experience of going deep in the competition, there is no reason not to feel confident. Other clubs will certainly hope to avoid them in the draw.\nIs this the year Man City finally win the Champions League?\n10:12 , Michael Jones\nWhy did Pep Guardiola recently call for more from Kevin De Bruyne?\nIt does seem that City manager Guardiola has not been fully satisfied with the performances of De Bruyne lately, benching him for a number of games.\nThe Belgium midfielder’s stats are still good, but, given the high standards he has set in recent recent years, he is perhaps judged by a greater standard than most other players.\nIt could be that the World Cup has had an effect on his game. Guardiola, who has been critical of a few players this season, maybe hopes his words can rouse him ahead of a crucial few months. He performed well against Leipzig on Tuesday, capping City’s win with a fine goal in stoppage time.\nIs this the year Man City finally win the Champions League?\n10:09 , Michael Jones\nAre other factors affecting Man City?\nYes, it is not just down to Haaland’s arrival. City had more players at the World Cup than any other club with 16 and that could be taking its toll while the defence has not had a settled look all season.\nThere were injuries at the start of the campaign, while the inexperienced Sergio Gomez has not been an effective replacement for the departed Oleksandr Zinchenko.\nThe emergence of Rico Lewis has been a positive but the issues that led to Joao Cancelo’s loan move in January caused further disruption and, having the likes of Nathan Ake, John Stones or even Bernardo Silva filling full-back positions, as they have at times, was not the plan at the start of the season.\nThey have kept four clean sheets in succession but there is a feeling they could still be vulnerable.\nIs this the year Man City finally win the Champions League?\n10:06 , Michael Jones\nWhile Haaland is clearly doing what he was brought to the club to do, his presence has required an adjustment to the team that has not yet fully bedded in.\nIn previous seasons City have operated with a ‘false nine’ or had their centre-forwards moving into other attacking positions. Asking Haaland to do this too much would negate his considerable strengths.\nCity have therefore moderated their structure and, with players still getting used to this, it has looked clunky at times. With City not finding their usual levels of consistency this term, this has been highlighted whenever they have suffered a frustrating result.\nIs this the year Man City finally win the Champions League?\n10:03 , Michael Jones\nWill the goals of Erling Haaland make the difference?\nAfter City’s near-misses of recent years – the 2021 final and the semi-finals last year – it seemed to many that a fit and firing specialist centre-forward was all they were lacking.\nIn Erling Haaland they have clearly filled that gap.\nAfter his stunning five-goal haul against RB Leipzig on Tuesday, the prolific Norway international has now scored a staggering 39 goals in 36 appearances for the club.\nThe 22-year-old is a ruthless goalscoring machine and City now seem to have all the pieces they need. They would certainly seem to have few excuses for another failure, but it is not so simple.\nCan Man City finally win the Champions League?\n10:00 , Michael Jones\nPep Guardiola’s Manchester City are right up there alongside Bayern and Real Madrid as potential favourites to win this tournament.\nAfter finishing top of a group consisting of Borussia Dortmund, Sevilla and FC Copenhagen, City faced RB Leipzig in the round of 16.\nA controversial 1-1 draw in the first leg meant City had worked to do in the return fixture at the Etihad and they stepped up in style.\nErling Haaland bagged five goals on Tuesday and, along with goals from Ilkay Gundogan and Kevin De Bruyne, the Premier League champions progressed 8-1 on aggregate.\nAre they a team to be feared?\nReal Madrid to win consecutive titles?\n09:56 , Michael Jones\nThe 14x Champions League winners have picked up where they left off from last year’s competition.\nGroup F was more competitive than they would have thought but Los Blancos breezed through with some impressive displays including a ruthless 3-0 victory at Celtic after Karim Benzema had gone off injured.\nIn the round of 16, Real slipped two goals down to Liverpool at Anfield before a blistering display of attacking quality saw them score five times in 46 minutes.\nKarim Benzema prodded another one past Alisson in the return leg and Carlo Ancelotti’s men marched on 6-2 winners on aggregate.\nBayern Munich among the favourites?\n09:52 , Michael Jones\nIt’s been a near faultless campaign for Bayern Munich so far.\nSix wins from six in the group stage, followed by two victories over a star-studded Paris Saint-Germain in the round of 16. The Bavarians have only had one breach to their defence and there are echoes of the 2019/20 season when they won this competition.\nThibaut Courtois accepts Premier League power but says Spanish clubs can reign\n09:48 , Michael Jones\nReal Madrid goalkeeper Thibaut Courtois believes the club’s continued success in Europe can offset the power of the Premier League.\nFor the fifth time in six seasons England’s top flight will have at least two representatives in the quarter-finals of the competition the Spanish giants have won a record 14 times.\nSix Premier League teams have featured in the last five finals – two were all top-flight occasions – and Liverpool and Chelsea have won one apiece, which is the same number Real have won over the same period after three in four years from 2014-17.\nSo while English clubs may have the financial might, the LaLiga giants have shown they are still the side to be reckoned with at Europe’s elite level and a 6-2 aggregate victory over Liverpool put them into the last eight again.\nThibaut Courtois accepts Premier League power but says Spanish clubs can reign\nEuropa League draw\n09:46 , Michael Jones\nFollowing the Champions League draw, the draw for the Europa League’s final rounds will take place too.\nManchester United are the only English team left in the competition after sweeping Real Betis aside 5-1 on aggregate.\nArsenal suffered a heartbreaking exit last night. They drew 3-3 on aggregate with Sporting CP but lost 5-3 in a penalty shootout at the Emirates Stadium.\nSporting went through and joined heavy hitters Juventus, Roma and Sevilla in the quarter-finals. Bayer Leverkusen, Union Saint-Gilloise and Feyenoord complete the line-up.\nSerie A resurgence\n09:43 , Michael Jones\nAfter a few years of being seen as the weakest of the big five European leagues, Serie A has come back with a bang this season. The Italian top flight has the most clubs in the Champions League last-eight with both Milan sides and Napoli making it through.\nInter Milan defeated Porto in the round of 16 while AC Milan edged past Tottenham 1-0 on aggregate.\nNapoli, meanwhile, are lighting up both their domestic league and the European top flight. They have an 18-point lead over Inter in Serie A and have scored the most goals in the Champions League this year with 25.\nWhen are the Champions League quarter-finals and semi-finals?\n09:40 , Michael Jones\nThe two-legged Champions League lquarter-final ties will be held on 11/12 April and 18/19 April.\nThe semi-finals will take place on 9 and 10 May (first legs) and 16 and 17 May (second legs).\nWho is left in the draw?\n09:36 , Michael Jones\nAC Milan\nBayern Munich\nBenfica\nChelsea\nInter Milan\nManchester City\nNapoli\nReal Madrid\nHow to watch the Champions League draw\n09:32 , Michael Jones\nThe Champions League quarter-final draw will take place at 11am GMT on Friday 17 March. It will be held at the Uefa headquarters in Nyon, Switzerland.\nViewers in the United Kingdom will be able to watch the draw live on BT Sport, the television home of Champions League football in the country.\nSubscribers can stream the proceedings via the BT Sport app or website, while Uefa will also show the draw live online via YouTube and the organising body’s website.\nChampions League draw\n09:27 , Michael Jones\nGood morning and welcome to The Independent’s coverage of the Champions League quarter-final draw.\nManchester City and Chelsea are one step closer to the Champions League final after progressing through the round of 16. Today they will find out who their opponents in the quarter-final stage will be as the draw is held to determine the next round of fixtures.\nReal Madrid, Bayern Munich and AC Milan are all viable opponents and there is the possibility that the two Premier League sides could face each other. There is no seeding for teams at this stage meaning clubs from the same country and group could meet again in the competition.\nThe semi-final draw will immediately follow the deciding of the last eight ties, along with determining which side will be the home team for the final, meaning all remaining teams will be aware of their potential route through to the Ataturk Olympic Stadium in Istanbul.\nElsewhere, Manchester United are the only English team to make it into the last-eight of the Europa League and they will discover their potential route to the final as well.",
  "word_count": 3375,
  "scraped_at": "2026-02-14T02:16:40.064758",
  "_text_extracted": true
}