{
  "article_id": "f443074bfa9a",
  "url": "https://www.queanbeyanage.com.au/story/8980537/future-matildas-stars-emerge-in-argentina-victory-at-marvel-stadium/",
  "title": "Future Matildas stars emerge in Argentina victory at Marvel Stadium | The Queanbeyan Age",
  "date": "20250530T151500Z",
  "domain": "queanbeyanage.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Friday night made it clear why Tom Sermanni was brought in to lead the Matildas for a third time, with a fairytale debut giving hope that the team can overcome the biggest challenge of their next chapter.\nSubscribe now for unlimited access.\nor signup to continue reading\nHis special skill of bringing in new talent and ensuring they prosper when they make the jump was on full display at Marvel Stadium in Australia's 2-0 victory over Argentina.\nSince Sermanni took back over in September 2024, nine players have made their debut for the Tillies.\nThe latest was Kahli Johnson, who earned her debut in Melbourne and a starting XI spot in her first national team camp.\nThe 21-year-old's impact was immediate, giving hope of what to expect from the next generation in the green and gold.\n\"It feels great when you see a young player coming into the team and you can get them on the field, and particularly then get them on the field and start them,\" Sermanni said.\n\"It makes it even better when you see how well Kahli played. She fulfilled what I saw of her as a player prior to coming in, but also what she did in training, and she just really took that out onto the field.\"\nBelow are the five things we learned about the team heading into game two in Canberra, including the return of a key trio.\n5. Fairytale debut\nJohnson, who plys her trade in Canada's new league for Calgary, became Matilda no. 237 in front of more than 43,000 fans.\nShe lined up on the left wing, and it only took the newest member 38 minutes to etch her name into history as an Australian goalscorer.\nCharlotte Grant swung the ball into the area and found Johnson's head at the backpost. The Argentinians threw their hands up, but their offside calls fell on deaf ears.\n\"I mean, if it doesn't get called, is it offside?\" Johnson asked tongue-in-cheek post-match.\n\"It was surreal. I just wanted to go out there and kind of show what I could do. Playing in a team like this, with these types of players, it gives you that confidence.\"\n4. Arsenal trio's return\nSermanni was adamant the Matildas' Champions League-winning trio would feature in game two.\nThe Tillies' head coach confirmed Arsenal stars Steph Catley, Caitlin Foord and Kyra Cooney-Cross \"should be fit and ready to go\" in the Bush Capital on Monday.\n\"I anticipate them starting on Monday. They've had the holiday, they've had a week,\" Sermanni said with a smile.\n\"We were fortunate ... the game went how we hoped it would go, and that allowed us to utilise other players and give game time to players that haven't had as much.\n\"But Monday, we've got three key Arsenal players, and they'll be - barring any accident or injury - in the starting lineup.\"\nThe trio was rested in game one after their entry into camp was delayed by their European victory over Barcelona.\n3. 'The kids are alright'\nThere was a glaring void in the next chapter of the Matildas' story after the historic Women's World Cup in 2023.\nThe future-proofing of the squad's success was at risk of falling by the wayside due to the aging stars and the dependence on key personnel.\nAlarm bells began ringing, and a solution was not found under former coach Tony Gustavsson by Paris 2024. Cue Sermanni.\nMore than a decade ago, he was identifying players like Catley, Alanna Kennedy, Emily van Egmond, and Sam Kerr.\nOn Friday, his eagle-eyed skill of spotting the stars of tomorrow was on display again.\n\"It shows what your players can do when they get an opportunity,\" Sermanni said.\n\"It's one of the challenges in the national team, and I've said this probably numerous times, is to play for the present, but plan for the future, and it's getting that balance right.\n\"It's becoming more and more difficult to do that, because you're limited with the amount of time you get your team together, as opposed to what it was in the past. So it's always a challenge to do that.\n\"But if there's anything that I've noticed over the last nine or 10 months, it's that some of those fringe players have started to become more comfortable in the environment, and that's given them more confidence.\n\"And I think that their ability to mix in and not be overawed by bigger players is now more evident, and that helps them perform like we saw tonight with Kahli.\"\n2. What does Sermanni's future look like?\nFootball Australia has not confirmed if Sermanni will remain on beyond this international window, but it is understood a permanent coaching solution is edging closer.\nIt seems likely the two-game series against Argentina will be his last, with Friday's win marking his 150th game in charge across his three stints in the role.\n\"It's been a real privilege for me to be able to come back and do what I have this spell with the Matildas,\" the interim Tillies coach said.\n\"I've been extraordinarily lucky. I've had three spells with the team, and if you could pick three spells to have, I would have picked the three that I had.\n\"When the program started, basically from scratch, then the second time when we went into Asia from Oceania, and then this third time, when the team has just gone to a different level of support and recognition. So for me to come in now is just, it's kind of a wee bit extraordinary.\"\nSermanni was given the task of future-proofing the squad ahead of next year's Asian Cup and beyond, and the 2-0 result made evident he has achieved that.\nThe big question is, who will replace him?\nFA has remained tight-lipped about its options for the head coaching role, but the leading candidate remains Lyon's coach, Joe Montemurro.\n1. Australia's attacking game refreshed\nJohnson's inclusion in the starting XI helped to unlock the Tillies' front third through her connection with fellow forwards Kaitlyn Torpey and Holly McNamara.\nThe side's movement off the ball and creativity in attack breathed new life into a squad that had struggled to create goalscoring opportunities without their big-name stars.\nTottenham fullback Charlotte Grant's partnership with Johnson, Torpey and McNamara proved fruitful in the first half and showed what fans could come to expect from the next generation.\nTorpey eventually added the Matildas' second in the 69th minute, with a cross-turned-shot effort from out wide catching the Argentinian shotstopper Abigail Chaves by surprise.\n\"If you look particularly at our second-half performance, I think we dominated the game and there were a lot of good passages of play,\" Sermanni said.\n\"We maybe could have created a couple more better chances, which we didn't do. But generally, I thought, overall, our tempo in the second half was very good.\n\"And when you consider the changes we've made, and when you consider the players that we started and put into the game, that was a very pleasing aspect of the performance.\"",
  "word_count": 1179,
  "scraped_at": "2026-02-14T02:02:47.538699",
  "_text_extracted": true
}