{
  "article_id": "f44eef66573f",
  "url": "https://www.empireofthekop.com/2024/08/29/sturridge-shocked-chiesa-liverpool-transfer-fee/",
  "title": "Sturridge cant believe Liverpool transfer news he heard about  top - tier  gem",
  "date": "20240829T071500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Daniel Sturridge has voiced his delight at Liverpool all but securing the signing of Federico Chiesa.\nAs per The Athletic, the Reds have agreed a deal for the Juventus forward worth an initial £10m (with £2.5m in add-ons), a remarkably low price for a 26-year-old with a proven track record in Serie A and Europe.\nTaking to X on Wednesday night, the former LFC striker couldn’t believe the price of the impending transfer, giving credit to the club’s previous sporting directors Michael Edwards and Julian Ward, both of whom now have senior roles within FSG’s overall portfolio.\nFollow Empire of the Kop on Instagram (@empireofthekop) HERE\nSturridge posted: “Chiesa to Liverpool is a top tier signing. Really good 1v1, pace, tenacious and can finish. Genuinely shocked at the price tag. Mike and Jools strike again lol…”\nChiesa to Liverpool is a top tier signing. Really good 1v1 , pace , tenacious and can finish. Genuinely shocked at the price tag,. Mike and Jools strike again lol… pic.twitter.com/cRXmx7F0xn\n— Daniel Sturridge (@DanielSturridge) August 28, 2024\nThe only thing more surprising than the haste with which Liverpool have all but wrapped up the signing of Chiesa is the cost of the impending transfer.\nLiverpool reaped just over £50m from the sales of Fabio Carvalho and Sepp van den Berg to Brentford, both of whom are talented players but made little first-team impact at Anfield, whereas the Italy forward has scored 47 goals in Serie A and six in the Champions League, along with winning Euro 2020 with his country.\nDuring his time as the Reds’ sporting director, Edwards forged a reputation for snapping up tremendous signings on the cheap (e.g. Andy Robertson for £10m) and yielding substantial fees for fringe players (e.g. Rhian Brewster to Sheffield United for £23.5m).\nWhile it’s now Richard Hughes who’s tasked with handling such affairs, the effect of FSG’S CEO of Football still resonates, and LFC’s renown for extremely shrewd transfer dealings has struck again with the imminent move for Chiesa.\nThe 26-year-old will still need to show that he can make the desired impact at Liverpool, but if he keeps himself fit and proves to be as prolific in the Premier League as he was in Italy, the £12.5m deal will go down as yet another Liverpool masterstroke.\nEOTK Close-up with John Welsh: ‘a local lad who lived his dream’ and Slot’s LFC predictions",
  "word_count": 398,
  "scraped_at": "2026-02-14T01:57:35.662299",
  "_text_extracted": true
}