{
  "article_id": "f4606dc7baa2",
  "url": "https://www.hampshirechronicle.co.uk/news/national/24629021.bbc-denies-speculation-future-match-day-host-gary-lineker/",
  "title": "BBC denies speculation over future of Match Of The Day host Gary Lineker",
  "date": "20241003T210000Z",
  "domain": "hampshirechronicle.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The BBC said it has not yet agreed a contract renewal with Gary Lineker, amid speculation over his future at Match Of The Day.\nThe corporation denied an announcement was pending regarding its highest-paid star, who it said is under contract until the end of the football season.\nMailOnline reported that it had seen an email purportedly from BBC bosses preparing to announce the 63-year-old’s departure from the broadcaster after 25 years.\nThe website said it had been unable to verify the authenticity of the email.\n“We have nothing to announce, and we have not agreed next steps with regard to his contract,” a spokesperson for the BBC said.\n“He is under contract until the end of the season.”\nThe football season will end after the Champions League final at the end of May next year.\nMatch Of The Day is one of the BBC’s longest-running shows, having been on air since 1964.\nFormer England footballer Lineker took over the flagship football highlights show in 1999 after predecessor Des Lynam joined ITV.\nLineker has been the BBC’s highest paid on-air talent for seven consecutive years and the only star to earn more than £1 million in the year 2023/24 according to the corporation’s annual report published in July.\nHe was taken off air by the BBC last year having compared the language used to launch a government asylum seeker policy to 1930s Germany.\nThe incident sparked a backlash and resulted in a number of his fellow pundits, including Ian Wright and Alan Shearer, boycotting Match Of The Day over his absence from the show.\nLineker later returned to the programme but new BBC social media rules have since banned flagship presenters from making attacks on political parties.\nA representative for Lineker has been contacted for comment.",
  "word_count": 296,
  "scraped_at": "2026-02-14T01:49:08.090939",
  "_text_extracted": true
}