{
  "article_id": "f46d0905d75f",
  "url": "https://thepeoplesperson.com/2023/12/30/alan-shearer-expresses-rasmus-hojlund-concern-after-man-united-star-broke-his-duck-in-the-premier-league-273599/",
  "title": "Alan Shearer expresses Rasmus Hojlund concern after Man United star broke his duck in the Premier League - Man United News And Transfer News",
  "date": "20231230T093000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Newcastle man Alan Shearer has suggested that the pressure is still very much on Rasmus Hojlund’s shoulders, even after the Manchester United star scored his first Premier League goal.\nAfter waiting for 14 games, Hojlund finally opened his goalscoring account in England’s top flight during United’s clash against Aston Villa on Tuesday.\nUnited overcame a two-goal deficit to score three goals in the second half and run out winners in front of the Old Trafford crowd.\nA brace from Alejandro Garnacho and the all-important winner from Hojlund sealed the win for the Red Devils.\nHojlund celebrated passionately and his relief was clearly evident.\nDespite being prolific in the Champions League before United’s exit from the competition, there was some criticism aimed at the young Dane for failing to break his duck in the Premier League.\nShearer previously slammed Hojlund’s teammate, Antony for failing to provide him with enough service to find the back of the net.\nSpeaking on the Rest is Football podcast, Shearer indicated that Hojlund’s price tag and United’s struggles this term almost certainly mean that he will be relied upon heavily to regularly come up with the goods.\nThe 53-year-old said, “Hojlund, who got his first Premier League goal, you could see the relief on his face.”\n“I thought he was going to burst when he was doing his celebrations and rightly so because you can imagine the pressure, unfairly at times because we’ve said it, he should be in and out.”\n“He should be learning. He should have a rest one day and back in again.”\nShearer further stated, “But because of the transfer fee and the situation at Old Trafford he has to play more than he should have been and that’s been tough on him. But the relief that he will have will be huge.”\nA confident Hojlund will get the chance to add to his tally when United face off against Nottingham Forest at the City Ground on Saturday.",
  "word_count": 327,
  "scraped_at": "2026-02-14T01:56:38.135227",
  "_text_extracted": true
}