{
  "article_id": "f47984149b0f",
  "url": "https://thepeoplesperson.com/2024/12/12/three-storylines-to-get-the-blood-racing-as-manchester-united-travel-to-take-on-viktoria-plzen-288548/",
  "title": "Three storylines to get the blood racing as Manchester United travel to take on Viktoria Plzeň - Man United News And Transfer News",
  "date": "20241212T113000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United will face Viktoria Plzeň in Czechia this evening, aiming to grab a valuable away win in the Europa League.\nThe encounter will be the first match between the two sides in history and both will aim for a crucial win as they both sit on nine points in the table, looking to land in the top eight positions, which ensure automatic qualification to the last 16 phase.\nAfter two successive defeats on the bounce for Ruben Amorim, he will be aiming to get back to winning ways this evening.\nWith United’s poor league form and tough draws away to Tottenham Hotspur and Arsenal waiting in the domestic cups, most fans will look at the Europa League as the most realistic route to silverware this season.\nHere are three storylines fans are discussing before the match.\nRasmus Hojlund looking to enter record books\nAccording to the BBC, “twenty-one-year-old Rasmus Hojlund has scored eight major European goals for Manchester United – the only players to score more aged 21 or younger for the club are Marcus Rashford and Wayne Rooney (nine each).”\nThe Dane has not always been at his most free-flowing in domestic football, but he has always scored in Europe.\nHe found the net five times in the Champions League group stage last season and already has three goals to his name in the Europa League this season.\nHe was electric versus FK Bodø/Glimt last time out in the competition and will hope he can grab at least another two goals in the remaining three group games to break Rooney and Rashford’s impressive goalscoring feat.\nThe Dane certainly has his work cut out to catch either player’s total as Rashford has 26 European goals and Rooney 39.\nUnited aiming for first win in Czechia\nUnited don’t have the longest history when it comes to facing Czech sides.\n“Manchester United have never won away against Czech opposition before, drawing two and losing one, with this their first such visit since a 0-0 draw at Sparta Prague in October 2004.”\nUnited have also only played two sides from Czechia competitively before – Dukla Prague and Sparta Prague.\nWhilst United are yet to win away, they have won every match at Old Trafford, with Ruud van Nistelrooy scoring all four goals in a 4-1 win versus Sparta Prague in 2004.\nUnited aiming to end European away day woes\nIt is not only away to sides from Czechia United seem to have trouble with as they are searching for their first win away in Europe in far too long.\nThey have drawn both away games to Fenerbahce and Porto this season and failed to win any last year. In fact, their last away win was at Real Betis in March 2023, 21 months ago.\nCuriously United have been in fine goalscoring form away from home, having scored three goals against Bayern Munich, FC Copenhagen, Galatasaray and FC Porto but failing to win any of the matches.\nWhilst it is normal to have a stronger home record, especially in Europe, United will need to put this statistic right soon if they are to become serious contenders to win the competition.\nFeatured image Julian Finney via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 539,
  "scraped_at": "2026-02-14T02:11:20.839958",
  "_text_extracted": true
}