{
  "article_id": "f47f72e58b71",
  "url": "https://www.barcablaugranes.com/2024/6/17/24179622/culers-talking-ferran-carreras-advice-hansi-flick-hope-future-why-laporta-is-donald-trump-barca",
  "title": "Culers Talking : Meet Ferran Carreras , a fan with advice for Hansi Flick , hope for the future , and who explains why  Laporta is the Donald Trump of Barca  ",
  "date": "20240617T194500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This is the second in a new series of interviews with fans. You can read the first part here.\nCulers Talking: Meet Ferran Carreras, a fan with advice for Hansi Flick, hope for the future, and who explains why ‘Laporta is the Donald Trump of Barca’\nBarca fans sound off on their love for the club and their hopes for the future\nFerran Carreras: 72 years old, lifelong fan and amateur Barcelona historian\nTo understand the present state of FC Barcelona, it can be helpful, even necessary, to look to the past.\nTimes change, but history also has a way of repeating itself.\nThat’s one of the main takeaways I got from speaking with Ferran Carreras, 72, a culer since birth, who inherited his love of the club from his father, and has since passed down the passion, or a “feeling” as he describes it, to his own children.\nTo be a culer of this generation is to have truly lived through the modern life of the club as we know it today.\nLike Fortià Viñas, the first interviewee of this “Culers Talking” series, Ferran remembers the inauguration of the Camp Nou in 1957 as a pivotal moment in his coming of age as a fan.\nHe emphasizes the importance of understanding the impact of the Alfredo di Stefano saga. How in many ways, the Barcelona and Real Madrid rivalry, was formed in these years.\nReal Madrid was not a big club before the arrival of Santiago Bernabeu, who made it his mission to spare no expense to turn it into the biggest football club in the world.\nHence the development of a colossal stadium, and ultimately the precedent of finding and buying the best players in the world. The Galacticos model, although the name would come much later, was born.\nBarcelona, as Ferran explains it, becomes your identity.\nAnd much of the Barca ethos that we assume has been around ad infinitum, can in fact be traced to the 1950s and 1960s, as they struggled to keep pace with the growing power of Real Madrid, and up until the arrival of the great Johan Cruyff, who, as Ferran puts up, created a sense of “ilusión” for the club, and the game itself, that has defined, ever since, what it means to be “of Barcelona.”\nIt’s a funny word, “ilusión.” But you hear it repeatedly when talking to culers.\nHope, perhaps. A sense of excitement and expectation.\nFor Barcelona fans, it’s the thrill of seeing the game in its purest form.\nBut where does it come from? Barcelona history, after all, is full of both suffering and euphoria in equal parts.\nMaybe it comes from a history of adversity in relation to their great rival. Who from the days of Bernabeu have been, publicly and apologetically, about winning above all else.\nFor Barcelona, the second team of Spain, but the first team of Catalonia, which is what matters most for those who have been followers of the club before the transition to democracy after Franco’s death in 1975, they may not ever have the resources, or desire, to compete with Real Madrid in the rat race for endless trophies.\nBut they will always be the protectors of what makes football transcendent. A reflection of the tragedy and beauty of life itself.\nFootball is more than a game. Barcelona is more than a club.\nWhen asked what Barcelona means to him, Ferran answered.\n“It forms a part of my life. It’s a feeling. These feelings, these sensations, you can’t explain them.\n“We say it’s more than a club. That means, win or lose, it doesn’t matter, I will always be a member of the club until I die.”\nBut in many ways, Barcelona exists in relation to Real Madrid. The two superpowers give each other strength, eternally motivating each other from year to year.\nBut Ferran pushes back on the sentiment that Barca fans are too concerned with their famous enemy.\n“For some people, it’s true, they feel ok so long as Real Madrid doesn’t win. For me, it’s good when Madrid loses, but what’s important is that Barca wins. That Barca functions well as a club. And now it doesn’t.”\nFerran is a true historian of the club. And he’ll remind you that for all the financial hardship Barcelona has experienced in recent years, this is something they’ve risen above before. And they can do it again.\nHe points to the leadership of club president Josep Lluis Núñez as a model to refer back to to right the ship going forward.\n“Es clarisimo. He ran the club like a business. Núñez did with Cruyff what Florentino did with Cristiano. Cruyff started making demands about his contract renewal, wanting a lot more money. It was similar to the situation with Sergio Ramos and Ronaldo at Real Madrid. And Nunez told him, then ok, it’s time to go, we won’t renew you, your time has passed. And that’s what happened, he let him go. Same with Perez. He threw out Ronaldo. He threw out Ramos.”\nMany culers see the club as losing its way by trying to be big spenders. Imprudently giving out massive contracts that, frankly, even the best players didn’t deserve. And creating a bubble in the market with inflated transfer fees that finally burst during the pandemic, exposing how badly managed Barcelona had been for years.\nSo what’s the path forward now according to Ferran?\nThe theme he kept coming back to was strong management, from both the coaching staff and the business end, as well as respect for the socios, the heart and soul of Barcelona that made the club what it is, and that will continue keeping it alive and kicking through thick and thin.\nOn the topic of bringing in a new coach.\n“Hansi Flick, I have all the confidence in. In all these months since the beginning of the year when we thought he would come, he had my vote of confidence. But it’s not just that he needs to understand football, all Barca managers have understood football, but what’s important is that he is a good manager. It’s difficult to be a manager like Xavi, friend of the players. You have to be able to say yes is yes, and no is no.”\n“The other thing is to know how to build a team. You have players like Marcos Alonso, Robert Lewandowski, and Inigo Martinez, all over 30 years old. And one of the things, for example, that hurts me the most, is that since Dani Alves left, Barca hasn’t had a right fullback. In all these years since he left, you aren’t capable of finding a replacement? That’s a failure. That’s a failure.”\nYes, one thing everyone seems to agree on, is the importance of utilizing La Masia, and the incredible talent that continues emerging from within the ranks of the club. Just look at what Lamine Yamal did over the weekend against Croatia as a case in point.\nBut that’s just part of the equation. Ultimately, Barcelona needs to find that “ilusión” again in order to believe that the future is bright and healthy.\nWhere will that come from? Bringing back the joy of total football like they did in the days of Cruyff? Not according to Ferran.\n“Today, look today, what’s important is to win. Tomorrow, we can talk about other things. Today what Barcelona needs to do is win. And that may depend on the type of players that are available. It’s not just down to Hansi Flick. There are only so many things he can influence. What’s important now is that Flick is a good manager. I don’t doubt that he knows a lot about football. But now, he just has to win. Even if it has to be 1-0. If he can do it by playing total football, then good.\n“The way for el Barcelonismo to get back its hope and belief is to have a coach with personality who is about winning. Who has the character to say, look guys, we may have played poorly today, but what’s important is we found a way to get the result. Even if we had to play on the counter attack.\n“Even if some culers don’t like that style of play. Because remember, that’s just some of Barca fans. There are many Barca fans who say look, that style of play is out of fashion, to focus on having so much of the ball. At the end of the game to have 70% possession, but just a few good shots on the goal. If you don’t shoot on the goal, the ball will never enter.” He said this last line with a laugh.\n“Remember Xavi’s first season. What’s important is he won La Liga. And maybe it was because Real Madrid was bad. But he won it. And he did it winning games 1-0.”\nWhen asked if Joan Laporta was the man to lead the club into the future, and ultimately, if he would vote for him again in the next election, Ferran was direct.\n“Laporta, what can I say, I don’t like him. Never. I would never vote for him in the next elections. But I really think he doesn’t want to run again for president of Barca. I would vote for the other guy, not because I like the other guy, but because he isn’t Laporta. Laporta is the Donald Trump of Barca.”\nThis feeling seems to come down to the way Laporta treated club legends like Xavi and Messi. It’s not so much that Laporta has done a bad job as president, but rather that he makes the job a show about himself. And that he doesn’t respect the people that made Barcelona what it is.\nFor Ferran, that includes a fear of potentially selling off the club, and disregarding the socios.\nIn his parting words in the interview, he wanted to make a few points very clear.\n“Visca el Barca. I hope that Flick finds a way to win. Winning is the most important thing. And I hope that Laporta doesn’t sell the club from us. That’s also the most important thing right now.”",
  "word_count": 1698,
  "scraped_at": "2026-02-14T01:57:18.894741",
  "_text_extracted": true
}