{
  "article_id": "f4a2014a6997",
  "url": "http://thepeninsulaqatar.com/article/01/10/2024/emery-keen-to-show-villa-can-compete-in-special-bayern-clash",
  "title": "Emery keen to show Villa can compete in  special  Bayern clash",
  "date": "20241001T203000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nAston Villa's Spanish head coach Unai Emery reacts during a press conference on the eve of their UEFA Champions League 1st round day 2 football match against Bayern Munich, at Bodymoor Heath Training Ground in Warwickshire, central England, on October 1, 2024. (Photo by Oli SCARFF / AFP)\nBirmingham, United Kingdom: Unai Emery is hoping Aston Villa can summon the spirit of the club's 1982 European Cup final win over Bayern Munich when the German giants visit Birmingham in the Champions League on Wednesday.\nVilla's return to the top level of European football after a 41-year wait began successfully with a 3-0 win at Swiss side Young Boys two weeks ago.\nBut Villa Park's first taste of the competition since it was re-branded as the Champions League brings back memories of the club's greatest-ever night.\nVilla upset the odds to beat a mighty Bayern side, featuring club legends Paul Breitner and Karl-Heinz Rummenigge, 1-0 in Rotterdam.\n\"It is a special, special match for everyone,\" said Emery at his pre-match press conference on Tuesday.\n\"We are motivated and so excited to play tomorrow with our supporters in Villa Park. Remembering as well the final that Villa played against them 42 years ago.\"\nEmery, who has won the Europa League four times in his managerial career, has inspired a phenomenal turnaround in Villa's fortunes since taking charge less than two years ago.\nThey were battling relegation from the Premier League when the Spaniard replaced Steven Gerrard, but rose to finish seventh in Emery's first season to qualify for the Europa Conference League.\nVilla reached the semi-finals in their first experience of European football for 13 years and secured a top-four finish in the Premier League, above Chelsea, Manchester United and Tottenham, to qualify for the Champions League.\nIn-form Bayern\nBayern, six-time European champions, are unbeaten in seven matches since Vincent Kompany took charge and Emery believes they are among the favourites to win the Champions League.\nBut he is hoping his side can compete as they have done with the Premier League's elite sides in recent seasons.\n\"I want to play matches like this and I want to play consistently matches like this,\" added Emery.\n\"In the Premier League we are facing teams like them -- Manchester City, Liverpool, Arsenal -- that can win this competition this year. They are favourites with other teams like Bayern Munich.\n\"Playing in Europe, we are very, very happy to face Bayern at home and hopefully we can enjoy tomorrow. Hopefully we can compete and show our best against them.\"\nKompany was a surprise choice by Bayern to succeed Thomas Tuchel after he oversaw Burnley's relegation from the Premier League last season.\nHowever, Emery is not surprised at the fast start the former Manchester City captain has made to life in Germany.\n\"I think he's a coach that has a very good future and he started being successful with Burnley when he got promoted.\n\"Last year was difficult with Burnley at the beginning, favourites to get relegated. He didn't achieve to keep them in the Premier League, but I always respect him a lot as a coach because the two matches we played were very difficult.\n\"With Bayern Munich and the players they have, I think it's easier to get the level they will want to have in their league and in the Champions League. They have started winning matches with very good results, playing very well.\"\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 639,
  "scraped_at": "2026-02-14T02:08:12.418198",
  "_text_extracted": true
}