{
  "article_id": "f4bb44511f3d",
  "url": "https://www.nytimes.com/athletic/5825107/2024/10/10/managers-premier-league-replacements-sack/",
  "title": "Six possible replacements if Premier League clubs want to make a change in the break",
  "date": "20241010T043000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Premier League is a ruthless business for managers.\nWe are not yet at the quarter-mark of the league season, but the prospect of managerial sackings is already in the air. Should clubs sit tight through the international break and see if their coach can turn it around? Or should they make a change now?\nAdvertisement\nThe international window is often seen by club executives as a good time to make a change with a pause in matches allowing time to find a replacement.\nHere, The Athletic assesses the prime contenders for any forthcoming Premier League jobs.\nGraham Potter\nAs Sky Sports’ Monday Night Football studio guest for Bournemouth’s 3-1 win over Southampton on September 31, Graham Potter remarked on the number of jobs he has been linked to since being sacked by Chelsea in April 2023: “I am the only coach in world football to be linked with Stoke City and Napoli in the same week.”\nPotter being mentioned regarding Championship and aspiring Champions League clubs reflects the general uncertainty regarding his standing in football.\nSince working minor miracles at Ostersunds, taking them from the fourth tier of Swedish football to beating Arsenal 2-1 at the Emirates Stadium in the Europa League in 2018, his stock grew. Potter impressed at Swansea City before cementing his reputation as one of England’s most talented head coaches at Brighton and Hove Albion. He took the South Coast side to ninth in the Premier League, their highest top-flight finish.\nAs well as establishing Brighton in the Premier League, he helped set the foundations and playing style for his successors, Roberto De Zerbi and Fabian Hurzeler, to build from. It has won him plaudits and respect within the game.\nHowever, a challenging period at Chelsea amid the disorder and confusion of Boehly-Clearlake’s first year in charge of the west London club resulted in his reputation taking a hit for the first time. So given his struggles at Chelsea, his next job may have to be a similar project to Brighton, where he can rebuild his reputation.\nGO DEEPER\n'There were so many players, some had to change in corridor' - Potter's surreal Chelsea reign\nThere is also the England job, though, where Lee Carsley is only at the helm on an interim basis. Potter remains one of the strongest candidates to lead the Euro 2024 finalists. “As an Englishman, it’s a fantastic job,” Potter said on Monday Night Football. “But I’m supportive of whatever the FA decide to do and whoever the coach is.”\nPotential jobs: England, Everton, Southampton, West Ham, Wolves\nGareth Southgate\nFor some, he is a successful figure who led England through their most prosperous period since they won the World Cup in 1966. For others, he’s the primary reason why they did not get over the line in successive European Championship finals.\nAdvertisement\nBut Southgate’s record as England boss speaks for itself. In his first tournament as manager, he took the Three Lions to the semi-final of the 2018 World Cup — the first time they had reached that stage since 1990. Three years later, at the delayed Euro 2020, England lost on penalties to Italy in the final, and they reached the final again this summer.\nArguably, the only underperformance of his era was at the 2022 World Cup — but England were largely impressive in Qatar before losing narrowly to eventual runners-up France in the quarter-final. While detractors suggest the quality of Southgate’s talent pool was the primary reason why they were successful in recent tournaments, England have had strong squads in previous tournaments only to crash out early in disappointing fashion.\nAs England boss, Southgate developed a reputation as a pragmatic head coach. He often relied on the individual quality of his attacking players to provide moments of magic to win matches; whether he has the tactical acumen to guide a club side in the Premier League is up for debate.\nCritics point to England’s display after scoring in the Euro 2020 final and the difficulties they faced at this summer’s tournament against inferior opposition as reasons why he could find the adjustment to club football difficult, though he was linked with the Manchester United job in the summer.\nIt would not be his first crack at the Premier League. He guided Middlesbrough to two comfortable finishes in the 2006-07 (12th) and 2007-08 (13th) seasons — coming straight from the pitch as a player to manager in the dugout — before relegation in 2008-09 led to his eventual sacking.\nAfter spending a long time working with England’s FA, perhaps it’s time for another crack at club football.\nPotential jobs: Manchester United, Newcastle United, West Ham\nAdvertisement\nThomas Tuchel\nWherever Tuchel goes, he generally finds success — before departing shortly after under a cloud of controversy.\nGO DEEPER\nThomas Tuchel's Chelsea sacking - told from both sides\nThe German coach has an impressive resume, with his last job being at Bayern Munich. Earlier in his career, he brought a DFB-Pokal to Borussia Dortmund (2016-17), his first job at a Champions League club after developing his reputation in Germany with Mainz. He managed Kylian Mbappe and Neymar at Paris Saint-Germain and won every available trophy except the Champions League, losing the final in 2020 to Bayern.\nHis crowning achievement would arrive a year later, when he took over from Frank Lampard in January at Chelsea and took them to the final of the Champions League, beating Manchester City 1-0 for the trophy. For his accomplishments in Europe, he won FIFA and UEFA’s separate Coach of the Year awards. But just over a year later, as has proven typical in Tuchel’s career, he was dismissed, amid strained relations with the club’s board.\nWhen it comes to a track record of success, Tuchel is arguably the strongest candidate available for top clubs searching for a new manager. Manchester United held talks with the 51-year-old in the summer, but he was not interested at the time as he wanted to take a break from management after a difficult final season in Munich, where he lost the Bundesliga title to Bayer Leverkusen.\nWith Erik ten Hag under increased pressure at Old Trafford, Tuchel’s name is almost certainly being brought up again at boardroom level. His coaching pedigree is undeniable, but whether he is the man to guide United through the recent changes upstairs is another question.\nPotential jobs: Manchester United, Newcastle United\nDavid Moyes\nIt’s easy to forget that Moyes was considered among the best managers in the Premier League only a decade ago and was Alex Ferguson’s choice to succeed him at Old Trafford.\nAdvertisement\nSince that period with Manchester United, where he was sacked after only 10 months in charge, Moyes has had an indifferent year in Spain with Real Sociedad and suffered relegation from the top flight with Sunderland.\nHe also won the UEFA Conference League with West Ham and took the east Londoners to the Europa League in his second spell with the club.\nThe 10-time Premier League Manager of the Month is an appealing candidate for clubs searching for a steady hand, and an interim job at a struggling top-flight side appears the most likely landing spot for the 61-year-old.\nHe has been out of management since his contract expired at the end of last season, when he was replaced by Julen Lopetegui at the London Stadium. Lopetegui has struggled in his opening weeks at West Ham, but his side beat Ipswich Town 4-1 on the weekend, easing immediate fears that he could be the first managerial casualty of the season.\nIf Lopetegui cannot build on that result, West Ham’s boardroom could be tempted to make a decision. Surely, they won’t return to Moyes to navigate the club through until the end of the season?\nThey’ve done it before.\nPotential jobs: West Ham, Everton, Southampton, Leicester City\nOle Gunnar Solskjaer\nIf we’re talking about candidates to replace a struggling head coach until the end of the season for when the boardroom is ready to appoint a long-term candidate, it’s remiss not to mention Solskjaer.\nLike Moyes, he’s done this before. When Solskjaer, 51, was appointed United’s interim boss in 2018, replacing Jose Mourinho, he was not seen as the club’s long-term answer. However, after an encouraging first season, the Norwegian was given the role permanently and stayed in post until 2021.\nSolskjaer guided the club to back-to-back top-four finishes for the first time since Ferguson departed and finished second in the 2020-21 season. He was dismissed after poor results, including a 5-0 defeat to Liverpool, and an expensive transfer window in which United signed Jadon Sancho, Raphael Varane, and Cristiano Ronaldo with ambitions of competing for the league title.\nHe has yet to return to management since but said in September he would be open to returning to Old Trafford if they came calling.\nAdvertisement\n“If your family (United) asks you, you say yes every day of the week,” Solskjaer said at the Oslo Business Forum in Lillestrom via VG. “It feels wrong to talk about jobs other people have. But I say yes.”\nAt the same event, he also threw his hat in for contention for the Norway job, with incumbent Stale Solbakken set to retire after the 2026 World Cup.\nPotential jobs: Manchester United, Norway, West Ham, Leicester City\nGO DEEPER\nOle Gunnar Solskjaer exclusive: His first in-depth interview since leaving Man United\nSergio Conceicao\nArsenal fans who toiled through their penalty shootout victory over Porto in the round of 16 of the Champions League last season will attest to Conceicao’s skill in setting up a defence.\nThe 49-year-old former winger left his position as Porto head coach in June, just over a week after winning the Portuguese Cup. Conceicao spent seven seasons as the club’s head coach, with last month’s Portuguese Cup final victory (2-1) over Sporting Lisbon his 11th trophy in charge.\nHe oversaw a challenging season as Porto finished third in the Portuguese top-flight, 18 points behind league champions Sporting, but earned plaudits from British viewers as he stifled Mikel Arteta’s Arsenal attack in the second leg of the Champions League tie after winning 1-0 at home.\nConceicao speaks English, French and his native Portuguese, and he was heavily linked to the Marseille job in the summer before De Zerbi’s appointment. He has never spent time in England as a manager or player, so he represents more of an unknown for Premier League clubs than Moyes or Solskjaer.\nStill, given his coaching pedigree, it is a risk clubs could be tempted to take.\nPotential jobs: West Ham, Wolves, Crystal Palace\n(Top photos via Getty Images)",
  "word_count": 1772,
  "scraped_at": "2026-02-14T01:57:46.250370",
  "_text_extracted": true
}