{
  "article_id": "f4e99046aa9c",
  "url": "https://www.bbc.com/sport/football/articles/c8699yqxzxlo",
  "title": "Champions League : Aston Villa , Arsenal , Liverpool , Real Madrid , Man City , Celtic , Barcelona , Bayern Munich - who will win ? ",
  "date": "20240916T164500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'No other outcome' - who will win Champions League? Pundits' predictions\n- Published\nThe Champions League is back - and bigger than ever.\nThirty six clubs will now be taking part in a new-look competition - four more than previously - as Real Madrid bid to retain their crown.\nManchester City, Arsenal, Liverpool, Aston Villa and Celtic are Britain's entrants, with the action kicking off on Tuesday night.\nWe have asked some of BBC Sport's experts who they think will be lifting the trophy in Munich next year, as well as who will their surprise package be and which player excites them the most.\nDon't forget the BBC will show highlights of the Champions League this season.\nFrom 22:00 on the Wednesday of Champions League matchweeks, there will be match-by-match highlights available on BBC iPlayer and the BBC Sport website and app, plus a special Champions League Match of the Day on BBC One at 22:40.\nThere will be also be a highlights show on Thursday on BBC Two at 23:05.\nPlayers to watch in Champions League - from stars to wonderkids\n- Published16 September 2024\nHow to follow the Champions League on the BBC\n- Published12 September 2024\nWho will win the Champions League?\nBBC Sport's chief football writer Phil McNulty: The addition of Kylian Mbappe to Real Madrid’s ranks makes it hard to see beyond a 16th triumph in the tournament for them and a sixth for coach Carlo Ancelotti.\nMan City will be their closest challengers but Real just have that incredible habit of getting this particular job done even when nowhere near their best and they have been over this course and distance successfully so many times.\nBBC Sport's French football expert Julien Laurens:\nIt is getting a bit boring now because Real Madrid win the Champions League every year - and I see no other outcome again this season.\nThe Spanish champions have the experience, the savoir faire, the heritage, the money time mentality and the talent.\nImagine keeping the same manager and pretty much the squad (although Toni Kroos is a obviously massive loss) and adding the best player in the world in Kylian Mbappe!\nBBC Sport's Spanish football expert Guillem Balague: You imagine the likes of Real Madrid and Manchester City in the semi-finals and, once there, there are many things that affect a result (a referee decision, an injury, a mistake) that is not very clever to predict.\nBut I feel City have got what it takes to win both the domestic long-term competition and the cup competition that is the Champions League.\nThey are very strong in both boxes and have the maturity to understand what is required in every part of the pitch and every minute of the game\nBBC Sport's German football expert Constantin Eckner: Real Madrid won the trophy in May and have since added Mbappe to their attack.\nThe Spanish powerhouse is once again the team to beat, and they may very well win it for the 16th time.\nI wouldn't pay too much attention to their performances until January, because Carlo Ancelotti's side excels in the knockout stages whereas other teams struggle to perform on point in the later months of the season.\nAs far as challengers to Madrid's throne go, Man City and Bayern Munich have the quality to win the competition.\nBBC Sport's Italian football expert Mina Rzouki: I am always loath to bet against Real Madrid, especially considering they are now home to the best player in the world, Kylian Mbappe, but I believe this year belongs to Manchester City. With Erling Haaland one of the few players to have benefited from a genuine rest in the summer and a team that remains full of creativity and experience, surely they are the team to beat this year.\nMost of the other behemoths have reasons to bet against them. Bayern Munich and Barcelona have a new manager and need time, Arsenal could or should be focusing on the league whereas Manchester City continue to grow and have learned to win in a variety of ways. When even your goalkeeper can deliver assists, I can’t see past Pep Guardiola’s men this season.\nWho will be the Champions League's surprise package?\nPhil McNulty: Liverpool.\nJurgen Klopp or not, there is something about the Champions League and Anfield that gets the juices flowing in this competition, as proved by their record. If they make the knockout stages they will be a handful for anyone.\nThey will relish their return to what they believe is their rightful stage after a year away and there is still so much class at Arne Slot’s disposal.\nThe Dutch coach will also enjoy the tactical challenges presented by Europe’s elite tournament.\nJulien Laurens: Bayer Leverkusen.\nThis new mini-league format will make for a more interesting campaign where teams outside of the big ones will have a chance to impress and defy the odds.\nI think Leverkusen could be the dark horse of the season.\nXabi Alonso and his players achieved something special last season with an unbeaten domestic season and now the German champions will show all their talents in the biggest competition of all.\nGuillem Balague: Inter Milan.\nSince they ended Juventus's dominance in 2021, they just won the league again, and have been in Europa league and Champions League finals.\nThey are another team with a lot of layers and with Lautaro Martinez they have one of the best players around. They did not sell a big name and have added to a strong squad.\nConstantin Eckner: My dark horse also hails from the Spanish capital.\nAtletico Madrid have made a number of intriguing moves on the transfer market during the summer, adding the likes of Julián Alvarez and Conor Gallagher.\nThe club have reached the final twice under the tutelage of Diego Simeone. The only concern I have is that Simeone has yet to figure out how his team can be a bit more dominant in possession and thus defend leads better.\nMina Rzouki: Inter Milan\nDespite a disappointing performance over the weekend, Inter Milan, like Manchester City and Real Madrid, boast consistency. Their coach Simone Inzaghi, vastly underrated, has constructed a side that play beautiful and fluid football while the mentality they showed last season secured the Scudetto they so richly deserved.\nWhile last year they appear to have concentrated on securing their 20th overall league title, this year they must try to go far in Europe and they have the squad to cause real problems and the tactical balance that is essential in this competition.\nWith another striker added to the mix in Mehdi Taremi and a coach renowned for excelling in cup competitions, one must be aware of the Italian giants.\nWhich player are you most looking forward to watching?\nPhil McNulty: Having had the appetite whetted at Euro 2024, I’m going for Barcelona’s 17-year-old genius Lamine Yamal. He is made for this stage, as he proved when Spain won in Germany.\nIf I could pick one more I’d go for another teenager, Real Madrid’s 18-year-old Brazilian Endrick…if he gets regular game time.\nJulien Laurens: Lamine Yamal.\nThere are loads of contenders obviously but the best and most exciting player right now in Europe is the Barcelona winger.\nHe is still only 17 but his maturity and decision making is out of this world, on top of his pace and technical ability. He is a delight to watch.\nHe was a star at the Euros with Spain in the summer and will be a star in this Champions League campaign too.\nGuillem Balague: Lamine Yamal.\nIt was only few months back that we were praising moments of magic from him but now he already has three goals and four assists in five games, so his contribution is regular and essential for this Barcelona team that has started so strongly under Hansi Flick.\nThey recover the ball early in a show of collective effort, they score lots, they create lots too. Fun to watch but Lamine is the player that takes them to another level\nConstantin Eckner: I'm interested in seeing Viktor Gyokeres and Sporting's entire attacking line playing in the Champions League.\nWhile most football fans know about Gyokeres, I feel like Sporting are criminally underrated due to the fact that Portugal's Primeira Liga does not attract that much attention internationally.\nMina Rzouki: Fabian Ruiz.\nHonestly, we all want to see how Julian Alvarez fares at Atletico Madrid, especially after scoring his first goal over the weekend, but I’m more interested to see what happens with Fabian Ruiz and PSG this season.\nGlorious performances for Spain in Euro 2024 had several questioning why Ruiz’s displays for country were so far superior to what he has shown with the French giants. According to El Chiringuito, much of that might have to do with the player’s less than ideal relationship with coach Luis Enrique.\nPSG have always preoccupied themselves with scouting attacking brilliance while the midfield has often lacked the balance and brilliance of some of their competitors, such as Manchester City and Real Madrid. Ruiz, if allowed to play with greater consistency, might just be the answer. Against Brest this weekend he reminded us of the technique and magic he can bring to any game, scoring a beauty to help PSG win.\nWill we see the Spaniard take control of PSG’s midfield to help navigate the side against a tricky run of European fixtures?",
  "word_count": 1577,
  "scraped_at": "2026-02-14T02:01:51.736396",
  "_text_extracted": true
}