{
  "article_id": "f4f6c1625809",
  "url": "https://metro.co.uk/2025/09/01/expensive-premier-league-signings-time-liverpool-confirm-alexander-isak-transfer-24050095/",
  "title": "Most expensive Premier League signings of all time as Alexander Isak joins Liverpool | Football",
  "date": "20250901T213000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have broken the British transfer record for the second time this window with the signing of Newcastle United striker Alexander Isak.\nThe Reds have made Isak their top target throughout the summer window, and have now got a deal over the line for a fee of £125million.\nArne Slot’s side had already broken the record earlier in the summer when they brought in Florian Wirtz from Bayer Leverkusen for £116m.\nPrior to this window, the £100m mark had only been breached on four occasions by Premier League clubs.\nSo how does Isak’s record fee compare to some of the other record-breaking transfer figures in the Premier League?\nLet’s take a look at the other most expensive deals in the league’s history and see…\nFlorian Wirtz – Bayer Leverkusen to Liverpool, £116m\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWirtz is set to lose his record transfer title after a matter of weeks following Isak’s arrival.\nThe German joined Liverpool earlier in the window in a big-money move from Leverkusen, where he impressed greatly under Xabi Alonso’s tutelage.\nMoises Caicedo – Brighton to Chelsea, £115m\nPrior to this summer, Moises Caicedo was the record British transfer after the midfielder spurned a move to Liverpool in favour of a move to Chelsea in August 2023\nAnd despite a slow start to his life at Stamford Bridge, the Ecuadorian international more than proved his £115m price tag in his second season at the club as he won Chelsea’s Player of the Year award.\nEnzo Fernandez – Benfica to Chelsea, £106.5m\nEnzo Fernandez was signed by Chelsea from Benfica in 2023 after his impressive performances for Benfica and the Argentina national team.\nFernandez was the final signing of a wild transfer window for the Blues, which also saw them buy David Datro Fofana, Benoit Badiashile, Andrey Santos, Joao Felix (on loan), Mykhailo Mudryk, Noni Madueke and Malo Gusto – but the team still struggled to finish in the top ten last season.\nThe Argentine has proved a key part of Chelsea’s side in recent seasons, and helped the Blues win the Conference League last season.\nDeclan Rice – West Ham to Arsenal, £105m\nDeclan Rice’s move to Arsenal for £105m in July 2023 still represents the highest-ever transfer fee for a British footballer in the Premier League.\nAnd since joining the Gunners, Rice has gone on to become a vital cog in Mikel Arteta’s side, who have finished runners-up in the league in the last three seasons.\nJack Grealish – Aston Villa to Manchester City, £100m\nGrealish left boyhood club Aston Villa – who he had been with since the age of six – to link up with the Premier League champions in August 2021.\nThe England international had a slow start to life in Manchester, but ultimately helped Pep Guardiola’s side win three league titles, as well as the Champions League and FA Cup.\nGrealish left the Etihad Stadium this summer, joining Everton on loan in pursuit of more regular minutes.\nRomelu Lukaku – Inter Milan to Chelsea, £97.5m\nLukaku returned to Chelsea seven years after leaving west London, with the Blues paying just shy of £100m in August 2021 following his goalscoring exploits in Italian football in previous years.\nHowever, the Belgian striker’s second stint at Chelsea quickly turned sour, with injury struggles and a dip in form seeing him lose his spot in the starting XI.\nAnd after criticising then-manager Thomas Tuchel in an interview midway through the season in which he also said he wished he stayed at Inter, Lukaku duly returned to San Siro on loan after just one season with Chelsea.\nPaul Pogba – Juventus to Manchester United, £93.25m\nUnited completed the blockbuster signing of Pogba from Juventus in August 2016, with the Frenchman returning to the club he first joined as an academy player in 2009.\nHowever, Pogba failed to live up the lofty expectations of his price tag, struggling for consistency as the club became unsettled on and off the pitch.\nHis six year spell at Old Trafford came to an end in 2022, sealing a return back to Juventus on a free transfer.\nMykhailo Mudryk – Shakhtar Donetsk to Chelsea, £88.5m\nThe Ukrainian international was at the centre of a dramatic transfer saga involving Chelsea and Arsenal in the January 2023 window.\nArsenal had been in pole position to sign him all month, but were pipped to the deal at the eleventh hour when Chelsea transfer chiefs flew to Poland to sensationally hijack the deal.\nMore Trending\nMudryk, though, struggled to adapt to life at Stamford Bridge and now faces an uncertain future after being charged with doping offences in June.\nAntony – Ajax to Manchester United, £85m\nUnited completed a deal to bring the Brazilian winger to Manchester in September 2022.\nAntony was reunited with manager Erik ten Hag, who coached the 22 year-old during his time in charge of Dutch giants Ajax.\nThe move ultimately proved a nightmare for Antony, though, who struggled greatly in a United shirt and now looks poised to leave the club permanently for Spanish side Real Betis.\nFollow Metro across our social channels, on Facebook, Twitter and Instagram\nShare your views in the comments below\nMORE: Jadon Sancho blocked Man Utd from signing £25m star on transfer deadline day\nMORE: Two Chelsea players stranded after transfer deadline and £22m deal falls through\nMORE: Gary Neville reveals Manchester United’s plan for new £18m signing Senne Lammens",
  "word_count": 955,
  "scraped_at": "2026-02-14T01:52:36.763522",
  "_text_extracted": true
}