{
  "article_id": "f5028725bd26",
  "url": "https://www.goal.com/en/news/virgil-van-dijk-liverpool-need-champions-league-miracle-real-madrid-drubbing-but-nothing-wrong-with-display/blt85f2eb14bb67cd7d",
  "title": "Virgil van Dijk : Liverpool need Champions League  miracle  after Real Madrid drubbing but there was  nothing wrong  with first leg display",
  "date": "20230222T110000Z",
  "domain": "goal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Liverpool thrashed 5-2 by Real Madrid\n- Van Dijk seeks a miracle in the second leg\n- Claimed there was 'nothing wrong' at Anfield\nWHAT HAPPENED? Jurgen Klopp's side started on a bright note in the Champions League round of 16 tie against Real Madrid as they raced to a 2-0 lead, with Darwin Nunez and Mohamed Salah scoring in the first 14 minutes. However, their joy was short-lived with Vinicius Jr. scoring twice before the break to level the scores and swing the momentum in Real's favour. Eder Militao then put the visitors ahead early in the second period before Karim Benzema scored a brace to leave Liverpool needing a four-goal swing in the return leg in order to progress. Van Dijk failed to organise his backline throughout the 90 minutes but felt the Reds produced a strong performance overall that wasn't reflected accurately by the final scoreline.\nWHAT THEY SAID: \"We are 5-2 down and have an almost impossible task to turn it around in Madrid,\" he told CBS Sports after the match. \"But football is full of miracles and let's hope we can pull off a miracle.\n\"We should have been more composed and calm in possession but, yeah, there was nothing wrong (with the performance) in my opinion. We didn't give many chances away but in the end with the quality they have, they punish you, properly.\"\nTHE BIGGER PICTURE: The Champions League is Liverpool's last hope of a trophy this season, with Jurgen Klopp's side already out of FA Cup and Carabao Cup competition. They are also way off the pace in the race for a top-four Premier League finish, and questions are now being asked over Klopp's position in the Anfield hot seat.\nIN THREE PHOTOS:\nGetty ImagesGetty ImagesWHAT NEXT FOR LIVERPOOL? The Reds will now shift their focus back to the Premier League, where they are set to face Crystal Palace on Saturday. The return leg against Madrid is due to take place at the Bernabeu on March 15.",
  "word_count": 337,
  "scraped_at": "2026-02-14T02:06:47.840967",
  "_text_extracted": true
}