{
  "article_id": "f508fd62a6bc",
  "url": "https://www.nytimes.com/athletic/6510711/2025/07/23/nwaneri-arsenal-singapore-dowman/",
  "title": "Arsenal 1 - 0 Milan : Nwaneri shines in central role , Gabriel deputy , and two 15 - year - olds feature",
  "date": "20250723T171500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New season, same vintage scoreline.\nMore than 22,000 fans gathered at the Singapore National Stadium to watch their side beat Milan 1-0, with second-half substitute Jakub Kiwior curling in a cross to the back post for Bukayo Saka to sidefoot home.\nMikel Arteta named a strong starting XI, including William Saliba, Declan Rice and Kai Havertz, with Saka wearing the captain’s armband.\nAdvertisement\nThe side arguably got stronger at the start of the second half when Martin Odegaard, Martin Zubimendi, Myles Lewis-Skelly and more came on. Arsenal pushed for a second goal but Lorenzo Torriani, Milan’s 20-year-old goalkeeper, kept the game tight with a string of saves.\nArsenal then lost an exhibition penalty shootout 6-5, despite debutant goalkeeper Kepa Arrizabalaga saving three of Milan’s nine penalties.\nMikel Arteta’s side play Newcastle United in a friendly at the same stadium on Sunday, before flying to Hong Kong on Tuesday for the second part of their pre-season tour.\nThe Athletic’s James McNicholas was there to analyse the game and highlight any eye-catching performances…\nNwaneri shines in central role\nEighteen-year-old Ethan Nwaneri lit up the first half with two moments of audacious skill.\nDespite impressing on the right wing when Saka was injured last season, Arsenal plan to use Nwaneri in a more central role this season. The signing of Noni Madueke, who plays most of his football off the right flank, suggests Nwaneri’s future is in the centre of the pitch.\nPlaying in the right-sided No 8 (central midfield) role usually reserved for Odegaard, he looked sharp against Milan: first a stepover and spin left Strahinja Pavlovic bamboozled close to the right touchline. Then a flick and volley forced Pietro Terracciano, Milan’s goalkeeper in the first half, into a scramble across the line to make a save.\nArteta will have been just as pleased by Nwaneri’s defensive work rate. At one point, he raced back to regain possession, showing another side of his game.\nAfter the game, the manager said of Nwaneri’s performance: “Really good. After a few holidays, those kids come back from the summer and they look different. Already they look more mature, they have a better presence. Ethan certainly has been training really hard. He only had a couple of training sessions with us so for him to be able to play 45 minutes in that heat is a really positive things.”\nAdvertisement\nArsenal are in the process of finalising a new contract for Nwaneri. A year ago, pre-season provided a glimpse that this precocious talent might be ready for first-team football. On the evidence of this performance, the teenager is about to go up another gear next season.\nWho is Gabriel’s immediate deputy?\nGabriel was not in the matchday squad as he completes his rehabilitation from the hamstring injury he suffered in April, with Riccardo Calafiori replacing the Brazilian centre-back in the starting XI.\nCalafiori was signed last summer to play at left-back, but injuries and the emergence of 18-year-old Myles Lewis-Skelly restricted his opportunities. Centre-back, however, is where Calafiori came to prominence with former club Bologna, and most of his appearances for Italy have come on the left of a three-man defence. His adventurous style and willingness to carry the ball could give Arsenal an interesting new dynamic from centre-back, particularly in games where they are likely to dominate possession.\nIt’s an important season for Calafiori. Signed for a fee that could ultimately total £42million ($57m), he finds himself behind Lewis-Skelly at left-back and Gabriel at left-sided centre-half. As the 23-year-old looks for a route back to regular football, Calafiori has a versatility could be crucial.\nThere’s also Kiwior to consider. The Poland international stepped in for Gabriel during last season and impressed, looking comfortable in both legs of the Champions League tie against Real Madrid. Kiwior came off the bench against Milan to pick out Saka for Arsenal’s opening goal.\nIf Kiwior remains at Arsenal this summer — and Calafiori can stay fit — the battle between them could be an intriguing sub-plot in the season.\nArsenal field two 15-year-olds\nArsenal brought on three untested academy products during the second half, including two 15-year-olds: attacking midfielder Max Dowman and centre-half Marli Salmon.\nAdvertisement\nDowman made an eye-catching cameo, cutting inside from the right on to his preferred left foot. He was too young to play competitively for either the first-team or the U-21s last season, but is eligible for both in 2025-26.\nSalmon is a highly rated defender who combines athleticism with a good technical level. Josh Nichols, 18, also came on to play at right-back.\nOf their performance, Arteta said afterwards: “Very happy with all the kids. I think they are able to play at that level at 15 years old in my opinion because of the environment and culture that is within the team. When somebody makes you feel so comfortable and so confident straightaway you can go and do it.”\nIn Lewis-Skelly and Nwaneri, these academy players have the ideal role models. That precocious pair have demonstrated that if you are sufficiently talented, there is a route to first-team football at Arsenal.\nThe Hale End production line continues.\n(Top photo: Roslan Rahman/AFP via Getty Images)",
  "word_count": 862,
  "scraped_at": "2026-02-14T02:02:51.948169",
  "_text_extracted": true
}