{
  "article_id": "f5113aa7dc7e",
  "url": "https://www.nytimes.com/athletic/5618972/2024/07/05/cristiano-ronaldo-spain-germany-euro-2024-france-portugal/",
  "title": "Euro 2024 day 22 : Goodbye to Ronaldo and Kroos as Spain and France set up semi - final",
  "date": "20240705T233000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro 2024 has its first pair of semi-finalists.\nSpain made it through to the last four with a 2-1 victory over hosts Germany that went through extra time all the way to Mikel Merino’s late, late winner. It was a truly classic encounter, another brilliant match to watch at a tournament that’s been full of them.\nThen there was Portugal vs France, which was rather less captivating.\nAdvertisement\nBut this is knockout international football. Even if there’s little drama over 120 minutes, there’s always penalties — and the French went through as Portugal’s Joao Felix missed a decisive spot kick. Cristiano Ronaldo converted but still suffered disappointment in what is expected to be his final appearance at a European Championship.\nLet our writers take you through the key moments.\nAuf Wiedersehen to Germany and Toni Kroos\nFrom the euphoria of Florian Wirtz’s 89th-minute equaliser to the gut-punch of that Spanish winner from Merino in the 119th-minute, with penalties in front of a boisterous home crowd beckoning.\nGermany will be stung by this defeat, but they will not be too disheartened. Many considered Spain a superior and better-developed side and pre-game expectations were measured accordingly.\nInstead, we should think of this as a graceful exit for Germany, not a damaging one like those of the recent past. Before beating Denmark in the last 16 they had not won a knockout game at a major tournament since Euro 2016, crashing out at the group stage of back-to-back World Cups and losing to England in the round of 16 at the last Euros.\nBut it was still cruel, and there will be great disappointment that their Euro 2024 journey has come to an end — the fun, the fan parks and the sense of national unity that this tournament seemed to have awakened. That’s what will hurt most in the morning.\nAnd for one German player in particular, Friday’s loss was especially poignant.\nEver since he announced his decision to retire back in May, one question has followed Toni Kroos: why step down now?\nGO DEEPER\nToni Kroos was at the top of his game at Euro 2024 - so why is he retiring?\nThe fact he won the Champions League with Real Madrid just a month ago and was one of Germany’s most impressive players in their run to the quarter-finals makes that a valid question, too. Kroos has always been keen to ensure that Euro 2024 was solely about the team and not his farewell tour, but unfortunately now it really is goodbye to one of the game’s modern greats.\nSebastian Stafford-Bloor and Dermot Corrigan\nAdvertisement\nSpain’s tough side and Merino’s leap\nLuis de la Fuente’s side do look really strong— having now proven they can also dig deep and strike back when the chips are down.\nSpain had already played the most coherent attacking football in the tournament so far. In the group stage they put three goals past Croatia and totally outclassed Italy before their reserve side beat Albania. In the last 16, they scored four against Georgia.\nAgainst Germany they showed their game can adapt; withstanding physical pressure, holding their nerve after being pegged back to 1-1 and then claiming a late winner in the most dramatic of circumstances.\nGO DEEPER\nThe Briefing: Spain 2-1 Germany - Mikel Merino's late, late winner dumps out Euro 2024 hosts\nSPAIN IN THE 119TH MINUTE 😱🇪🇸 pic.twitter.com/2hp5EyAGWl\n— FOX Soccer (@FOXSoccer) July 5, 2024\nMerino’s goal was remarkable for a number of reasons. First, there was the amount of time he seemed to hang in the air, and how he contorted his body mid-flight to meet the ball with his head.\nThen there was his celebration. Merino’s father was a footballer too, and he scored in Stuttgart for La Liga side Osasuna in the old UEFA Cup back in November 1991.\nFather 🤝 Son – sharing celebrations in the same stadium ❤️\n(h/t: @AlexandraJonson) pic.twitter.com/EDelzlzg81\n— FOX Soccer (@FOXSoccer) July 5, 2024\nHere’s another compelling fact. Spain had never previously beaten a host nation in a knockout tie at either a World Cup or European Championship.\nFor this youthful team to do so feels like a vital step.\nJames McNicholas and Pol Ballus\nFrance hold their nerve, but can they click?\nGermany’s players weren’t the only ones left rueing the cruelty of this game. Spare a thought for Joao Felix, whose penalty for Portugal in their shootout with France struck the post and ended his nation’s dreams of adding another Euros title to their 2016 success (when they beat France 1-0 in Paris).\nAfter his remarkable heroics in the previous round against Slovenia, saving all three penalties he faced, the stage was set for keeper Diogo Costa to take Portugal through again. France had also lost their previous three penalty shootouts in major tournaments, not winning one since the 1998 World Cup.\nAdvertisement\nBut this time they prevailed, and manager Didier Deschamps celebrated richly with Kylian Mbappe. Ronaldo, 39, and Pepe, 41, were more downcast. Ronaldo has already said this will be his last Euros.\nTheo Hernandez was the player who stepped up with the chance to win it for France, as Mbappe stood on his haunches, pleading him to score. And he did, sending Costa the wrong way to keep France’s Euro 2024 dream alive.\nBut they might not much fancy meeting Spain.\nAlthough the French have good memories of beating Spain in the Nations League final in 2021, they will not arrive for their semi-final in the most expressive spirits and they are much changed since that success. The 2021 spine included Raphael Varane, Paul Pogba and Karim Benzema — and it is crystal clear that there is little rhythm in the Blues at this tournament.\nWill they click? Can they click? Spain are sure to be favourites and it is up to Deschamps to find the formula to press on.\nTim Spiers and Amy Lawrence\nMbappe v Ronaldo was… quiet\nPortugal v France meant Mbappe versus Ronaldo, but in truth both players had quiet games, although there was a worrying moment when a header was planted against the side of Mbappe’s head and he lay dazed on the turf having taken off the mask he wears to protect his broken nose.\nIn the first half Mbappe was barely involved in the action, reflecting France’s staid attacking performance. At one point he uncharacteristically played a wayward pass straight into the Portugal midfield, on another he played a through ball down the left but no one chased it. He just wasn’t himself, and Deschamps took him off in extra time.\nGiven Ronaldo had yet to score at Euro 2024 going into the game there was a lively debate about what he actually brought to this Portugal side if not goals. Well, there was a resounding answer to that question during what was an anonymous performance from the Al-Nassr striker.\nAdvertisement\nThe longer it went on, the more bizarre it was that Martinez persisted with him on the field. In Portugal’s four meaningful matches at this tournament (i.e. every one bar their final group game) Ronaldo played every second. Was a pair of successful penalties in Portugal’s two shootouts really worth it?\nTim Spiers\nWhat’s next?\nThere are two more quarter-finals to come tomorrow:\n- England vs Switzerland, in Dusseldorf (5pm BST/12pm ET)\n- Netherlands vs Turkey, in Berlin (8pm BST/3pm ET)\n(Top photo: Alex Pantling – UEFA via Getty Images)",
  "word_count": 1240,
  "scraped_at": "2026-02-14T02:08:01.883800",
  "_text_extracted": true
}