{
  "article_id": "f53d5d08bc96",
  "url": "https://www.dailymail.co.uk/news/article-13591357/John-Terry-BBC-penalty-Cristiano-Ronaldo.html",
  "title": "The penalty miss that haunted John Terry : How ex - England star broke down in tears after missing crucial spot kick in CL final - as he blasts BBC for mocking Cristiano Ronaldo",
  "date": "20240702T110000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The penalty miss that haunted John Terry: How ex-England star broke down in tears after missing crucial spot kick in CL final - as he blasts BBC for mocking Cristiano Ronaldo\nFormer England captain John Terry was one of the first to leap to Cristano Ronaldo's defence after the BBC mocked the Portugal captain for missing a penalty during last night's clash against Slovenia.\nRonaldo had endured a frustrating evening in front of goal but was handed a lifeline when Portugal were awarded a penalty with the scores still level in extra-time.\nThe 39-year-old took a deep breath and firmly fired his spot kick towards the bottom right corner, but it was heroically saved by Slovenia goalkeeper Jan Oblak. An emotional Ronaldo then broke down in tears and had to be consoled by team-mates.\nThe striker - whose mother was also in tears after the miss - redeemed himself by scoring when the game went to a penalty shootout, where Portuguese goalkeeper Diogo Costa made three saves to send his team to the quarter-finals of the Euros.\nAlthough Portugal ended up going through, the BBC sparked fury after it mockingly captioned a replay of the penalty miss 'Misstiano Penaldo' during its analysis.\nTerry, still likely haunted by his own penalty miss in the 2008 Champions League final, led the fury, sharing the caption to Instagram with the words: 'BBC this is a disgrace!'\nThe former Chelsea and England defender had the chance to win the Champions League in Moscow 16 years ago - after Ronaldo, then a Manchester United player, had his penalty saved by Petr Cech.\nTerry similarly broke down in tears after he slipped in the pouring Moscow rain and could only watch his penalty crash against the post, giving Manchester United a lifeline.\nJohn Terry breaks down in tears after missing a penalty in the Champions League final against Manchester United in 2008\nFormer Chelsea defender Terry had the chance to win the Champions League but slipped over and hit the post\nCristiano Ronaldo of Portugal in tears is comforted by teammate Diogo Dalot after his penalty miss\nJohn Terry hit out at the BBC over the word play that he felt mocked the Portugal star\nAs United went on to lift the trophy, a tearful Terry had to be consoled by his team-mates and then manager Avram Grant.\nTerry has previously admitted how the penalty has haunted him ever since.\nJust two months ago, he revealed on the Up Front Podcast that it was 'probably the worst moment in my footballing career'.\nHe added: 'I'm still not over it today. I don't think I ever will be. It's interesting because as a player you have so many highs, but it's the lows that stay with you longer.\n'That night we lost we went back to the hotel and the manager was asking us all to go down for a drink, but I stayed in my room because I couldn't face the lads. Eventually I went down and had a beer with the rest of the group.\n'I just remember standing in my hotel room on the 25th floor, looking over Moscow and asking myself, 'why then, why did it start raining then, why did I slip?\n'The hardest thing for me was that three days later we had a friendly for England against USA at Wembley and we drew 1-1 I scored a header from outside of the box. If I could swap any two goals in my career it'd be those two.'\nHe also previously told Sky in the months after the miss: 'Every morning I wake up, that's the first thing I think about. I am still so desperately disappointed about it.\n'But I am a big man with a big character and it is now down to me to deal with that.'\nJohn Terry had the chance to win the Champions League for Chelsea but slipped over in Moscow\nHe could only watch his strike hit the post and he was left completely distraught on the floor\nCristiano Ronaldo scored against John Terry's Chelsea in the Champions League final in 2008\nBut he also missed a spot kick when the game went to penalties in the pouring Moscow rain. This miss had given Terry the chance to win it\nTerry is still haunted by the miss today. He is pictured walking back to the halfway line after missing\nSpeaking ahead of the 2008/09 season, he added: 'I'm certainly looking forward to the new season so I can wipe away that bitter disappointment for the club, and especially for me.'\nTerry was also joined by furious football fans in condemning the BBC for mocking Ronaldo.\nOne wrote on social media: 'People preach about men's mental health then laugh at Cristiano Ronaldo for showing emotion in a big moment under immense pressure then the BBC mock him as Misstiano Penaldo.\n'He deserves huge credit for stepping forward during the shootout and scoring.'\nAnother said: 'BBC Sport this absolutely shameful. You ought to be ashamed of such unprofessional behaviour'.\nWhile a third added: 'Misstiano Penaldo! You can't convice me that this isn't Twitter account trolling - not the BBC.\n'The TikTokzation of football punditry is not something I ever wanted to see what happened to the game I love.'\nRonaldo's mum Maria Dolores dos Santos Aveiro was also tearful at the bad penalty failure\nOthers joined John Terry in condemning the BBC for their 'pathetic behaviour'\nCristiano Ronaldo of Portugal reacts after missing a penalty kick during the UEFA EURO 2024 round of 16 match between Portugal and Slovenia\nA Portugal fan holds a mask of Portugal's Cristiano Ronaldo at a riverside cafe terrace in Lisbon while watching the match between Portugal and Slovenia\nCristiano Ronaldo of Portugal looks on during the UEFA EURO 2024 round of 16 match\nContent creator and journalist Faysal wrote on 'X': 'In my 17 years of journalism and reporting, I've never seen such pathetic piece of broadcasting.\n'Where was this when Kane missed against France? Where was this when Messi missed against Chile?\n'The constant hate and narratives towards needs to stop, I expect an apology statement and compensation for the discrimination of character @BBCSport.'\nPhotographer Myles Whittingham wrote: 'You should be embarrassed @BBCSport. Misstiano Penaldo on your replay title. Pathetic behaviour from you guys.'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- New video shows man with backpack similar to Guthrie kidnapper\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Moment driver veers to target e-bike riders before killing teen\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl",
  "word_count": 1184,
  "scraped_at": "2026-02-14T01:51:32.416968",
  "_text_extracted": true
}