{
  "article_id": "f54190abe156",
  "url": "https://www.france24.com/en/live-news/20230603-psg-lose-on-messi-farewell-auxerre-relegated-from-ligue-1",
  "title": "PSG lose on Messi farewell , Auxerre relegated from Ligue 1",
  "date": "20230604T020000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSG lose on Messi farewell, Auxerre relegated from Ligue 1\nParis (AFP) – Lionel Messi's final game for Paris Saint-Germain ended in defeat on Saturday, while Monaco missed out on European qualification and Auxerre were relegated on the last night of the Ligue 1 season.\nIssued on:\nMessi's expected departure from the French giants after two seasons was officially confirmed by PSG in a statement shortly before Saturday's match against Clermont.\n\"His contribution to Paris Saint-Germain and Ligue 1 cannot be underestimated and we wish Leo and his family all the best for the future,\" said PSG president Nasser al-Khelaifi.\nYet Messi, who ends his PSG career with 32 goals in 75 appearances, was jeered by some fans during the match, which the champions lost 3-2.\nThere was little riding on the game itself after PSG wrapped up a record 11th French title last weekend, and Christophe Galtier's side contrived to throw away a two-goal lead.\nSergio Ramos, whose own departure from PSG was confirmed on Friday, marked his final appearance by heading in a Vitinha cross for the opener in the 16th minute.\nRico tribute\nMbappe, looking to end a fifth consecutive campaign as Ligue 1's top scorer, then scored a penalty to make it 2-0 with his 29th league goal this season, which he marked by holding up Sergio Rico's number 16 jersey.\nSpaniard Rico, PSG's back-up goalkeeper, is in a serious condition in hospital in Seville after being injured in a horse-riding accident last weekend.\nJohan Gastien pounced on a Marco Verratti mistake to pull a goal back for Clermont, who then saw Grejohn Kyei miss a penalty.\nThe visitors equalised in first-half stoppage time through Mehdi Zeffane, and Kyei secured a famous win in the second half as they end the season in eighth place.\n\"The most important thing was the tribute to Sergio,\" Mbappe told broadcaster Canal Plus after PSG suffered a seventh league defeat in 2023.\n\"There are more important things than football, and on the pitch we were already champions. We could have lost 22-0 and that would not have changed anything for us.\n\"We had to pay tribute to Sergio. I think we have all been affected by what is an extremely serious situation. We have been worried about that all week and so we tried to pay tribute in the best possible way.\"\nMbappe's goals tally left him two ahead of Lyon's Alexandre Lacazette in the final standings.\nAsked about his own future in Paris, France star Mbappe said: \"I am just here to play. I am still under contract. The club is doing what it can and I will be happy with whatever the club does.\"\nRennes go into Europa League\nPSG end the season a point clear of runners-up Lens, who completed a fine campaign with a 3-1 win away at Auxerre in which Alexis Claude-Maurice scored twice and Lois Openda got his 21st goal in Ligue 1.\nThat result allowed Nantes to climb out of the relegation zone and above Auxerre with a 1-0 win over Angers, as Auxerre return to the second tier after just one season back in the elite.\nAngers, Troyes and Ajaccio had already been condemned to the drop with four teams going down and only two coming up as France's top flight is reduced from 20 clubs to 18 for next season.\nMarseille, who were already guaranteed third and a place in the Champions League qualifying rounds, lost 1-0 at Ajaccio in their first game after coach Igor Tudor announced his departure.\nIn the battle for the remaining European places, Lille began the day in fourth, a point above Rennes and Monaco.\nHowever, Lille were held to a 1-1 draw at Troyes, allowing Rennes to climb above them thanks to a 2-1 victory at Brest in which Benjamin Bourigeaud scored both their goals.\nRennes therefore go into next season's Europa League group stage, while Lille will enter the Europa Conference League in the play-off round.\nMonaco, beaten 2-1 at home by Toulouse, finish sixth and miss out on European qualification altogether.\nElsewhere on Saturday, Nice beat Lyon 3-1, while Lorient were 2-1 winners against Strasbourg and Folarin Balogun scored his 21st goal this season as Reims lost 3-1 to Montpellier.\n© 2023 AFP",
  "word_count": 710,
  "scraped_at": "2026-02-14T02:09:58.137427",
  "_text_extracted": true
}