{
  "article_id": "f558ba6a2d74",
  "url": "https://metro.co.uk/2025/05/01/alessia-russo-were-ready-push-really-challenge-chelsea-next-season-23011791/",
  "title": "Alessia Russo :  Were ready to push on and really challenge Chelsea next season  ",
  "date": "20250501T230000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alessia Russo is confident that a resurgent Arsenal have what it takes to end Chelsea’s dominance in the Women’s Super League next season.\nRusso has enjoyed another consistent season for the north London side, notching up 12 goals in 19 league appearances so far this season.\nThe Lionesses forward has also scored eight times in this season’s Women’s Champions League, perhaps most crucially in Sunday’s semi-final second leg against Lyon to help Arsenal reach their first European final since 2007.\nBut a surprise 5-2 defeat to Aston Villa on Wednesday – combined with Chelsea’s 1-0 over Manchester United – meant Arsenal fell short again in the league as Sonia Bompastor’s side claimed their sixth-straight WSL title.\nArsenal ultimately paid the price for a slow start to the season under former manager Jonas Eidevall, but Russo is confident that her side can come again and launch a more sustained title challenge next campaign.\n‘It’s tough. This league is full of so many top teams and the quality is only getting better, but I have full faith in what we’re building at Arsenal and I have no doubt that we’ll have a successful,’ Russo told Metro at Thursday’s 2025 Women’s Football Awards which saw the 26-year-old land the Player of the Year award alongside Chelsea’s Lauren James.\n‘We want it really badly. I know Chelsea have done well for so many years now but we’re ready to push on now and get the better of them next year.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nReflecting on Wednesday’s defeat to Villa, she added: ‘It was such a high out in Lyon, getting to a final that we not only wanted so badly but that we also deserved to get to.\n‘There were so many emotions that came with that, but when we came back to England, we needed to switch our focus quickly, and we didn’t do that well enough. We know that as a team, but we’ll reflect on that and learn from that.’\nBeing awarded the Women’s Football Awards’ top prize for a second time in three years gives Russo plenty to celebrate on a personal note, though, and the striker is pleased to see her work behind the scenes rewarded, having initially not thought she deserved to win the award back in 2023.\n‘To be honest, I didn’t feel like I deserved the award the first time around back then,’ she said.\n‘The league is full of so many talented players, so that kind of motivated me to keep pushing and progressing my game. I still feel like there is so much to learn and so many places to go, but it’s nice to be recognised again.\n‘We’re on a really exciting path as a team and obviously, you don’t win awards like this without being surrounded by brilliant players, and I’ve got that at Arsenal and with England.’\nMore Trending\nRusso and Arsenal will now turn their full focus to their huge Champions League final against Barcelona at the end of next month.\nAnd it could get better yet for the north London club, with the men’s side seeking to overturn a one-goal deficit in their semi-final second leg against Paris Saint-Germain next week to book their spot in the final.\n‘They don’t need our words of advice – they know exactly what they’re doing,’ Russo said when what words of wisdom she could pass on to Mikel Arteta’s squad.\n‘They’ve got a top side and they know how to win in games like that. We saw that against Real Madrid and hopefully they can do it again. I’ve got full faith and I’ll be watching as a fan. Hopefully, we can both end up in the finals.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: PSG star in ‘race against time’ to be fit for Arsenal return leg after missing training\nMORE: Arsenal open talks to sign £25m Roma star ahead of Newcastle and PSG",
  "word_count": 719,
  "scraped_at": "2026-02-14T01:52:20.881305",
  "_text_extracted": true
}