{
  "article_id": "f56214ede89a",
  "url": "https://theprideoflondon.com/2023/04/22/chelsea-squad-clearout-ffp-deadline-set/",
  "title": "Chelsea squad clear out could raise £200million+ as FFP deadline set",
  "date": "20230422T154500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea’s exorbitant spending in the last two transfer windows is finally catching up to them as the Blues will need to make sales to balance the books or they risk violating the Financial Fair Play policies. Chelsea are well aware that they need to sell players and now a deadline has been set to authorize player sales and in turn balance their books.\nChelsea have spent upwards of £600 million since Todd Boehly bought the club in May 2022. CFC have broken the bank to sign Enzo Fernandez and also sanctioned the big money transfers of Mykhailo Mudryk, Wesley Fofana, Raheem Sterling and Marc Cucurella. Sadly, the quality infused in the squad has not translated to results on the pitch as CFC are out of the Champions League, eliminated from cup competitions and nowhere close to finishing in the top four in the Premier League.\nOn the pitch, Chelsea’s aim should now be to attain a respectable finish as they sit 11th in the league table. Off the pitch, the Chelsea chiefs are working to appoint a new manager after Graham Potter was sacked in April. Simultaneously, the club chiefs will be planning for the summer transfer window as the squad overhaul is expected to continue but before splashing the cash again, Chelsea will have to balance the books.\nChelsea could raise £200million through player sales as FFP deadline set\nA massive squad clear out is expected this summer with as many as 10 players considering their futures at Stamford Bridge, as per Evening Standard. With Chelsea not in a position to play Champions League football next season, some players might face a pay cut of more than 30%.\nChelsea want to reduce the squad size and in turn reduce the wage bill before the pre-season as a new manager is expected to take over the reins in the summer. Out of 10 players considering their futures, Chelsea are trying to convince N’Golo Kante and Kai Havertz to sign a new deal at the club.\nChelsea would like to sell the rest of the eight players. Mason Mount is expected to leave in the summer if he doesn’t sign a new deal and CFC have put a price tag of £70 million on the Englishman. Midfielder Ruben Loftus-Cheek could be shown the exit door at Chelsea and is valued at £22.3 million.\nCFC expect Conor Gallagher’s sale to bring in a big cheque to Stamford Bridge. As per journalist Dean Jones, CFC will be looking to get around £50 million through Gallagher’s sale. The estranged case of Pierre-Emerick Aubameyang is proceeding towards its culmination. The Gabonese is valued at £6.2 million but Chelsea could part ways with the striker for free or a modest fee.\nKalidou Koulibaly was signed just last summer and he has not completely settled in London yet. His shaky performances at the start saw him lose his place in the lineup. Although, there have been improvements in Koulibaly’s displays recently, CFC seem to be looking at a future without him.\nHakim Ziyech came incredibly close to leaving in January but a move failed at the last moment. The Moroccan is no longer counted as an important part of the squad and is available for around £20 million. With the arrivals of Mudryk and Noni Madueke, the Blues are willing to sell Christian Pulisic for around £30 million – £35 million. Chelsea are also looking to make a change between the sticks, signing an undisputed No.1 which would mean that Edouard Mendy is up for sale. The 31 year old is valued at £16 million.\nChelsea need to sell players before 30th June if player sales are to be included in the account books for 2022-23 season. If CFC manage to sell all the aforementioned eight players, CFC could raise £200 million plus through summer sales.\nWill CFC manage to clear the squad in the summer?",
  "word_count": 649,
  "scraped_at": "2026-02-14T01:55:54.941978",
  "_text_extracted": true
}