{
  "article_id": "f574a14ff5a7",
  "url": "https://thepeoplesperson.com/2023/01/22/are-the-failures-of-alexis-sanchez-still-haunting-man-uniteds-new-boys-258639/",
  "title": "Are the failures of Alexis Sanchez still haunting Man United new boys ? ",
  "date": "20230122T194500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United face Arsenal this afternoon in what might turn out to be a pivotal clash in this season’s title race.\nThe two sides are in incredible form, and have not been in such good shape at this point in a season since their days of being the dominant forces in English football under Fergie and Wenger.\nIt is fitting that the date of this highly anticipated fixture, the 22nd of January, marks the fifth anniversary of one of the most controversial transfer dealings between the two sides in the recent past, the swap deal that would see Henrikh Mkhitaryan and Alexis Sanchez exchange places with one another.\nBoth players would fail to light up Old Trafford despite showing glimpses of what they were capable of.\nMkhitaryan was instrumental in United’s romp to the Europa league under Jose Mourinho, scoring six goals in 11 games, including a clever finish against Ajax in the final to secure a 2-0 win for the Red Devils. The Armenian would quickly fall out of favour with the Portuguese manager the following season, which sealed his exit.\nSanchez never showcased the same level of ability or commitment he had shown in an Arsenal shirt at United.\nSigned on an eye watering £350,000-per-week contract which made him the highest earning player in the Premier League, the Chilean is often considered one of the worst signings in the illustrious history of the club, despite the occasional flash of individual brilliance, like the two assists he grabbed in a magnificent 3-2 comeback win against Manchester City or the injury-time winner in another thrilling 3-2 comeback against Newcastle United.\nUnited have been underwhelming in the transfer market since the latter days of Sir Alex’s reign as the Glazers did their best to hold on to the profits, rather than compete with the unending riches of an Oligarch-driven Chelsea or an Oil state-sponsored City.\nThe Red Devils would often miss out on their targets, with the likes of David Silva snapped up by their noisy neighbours while the talents of Eden Hazard would find a new home in Stamford Bridge.\nBoth players would become the focal point of multiple title winning teams, whereas the great Scottish Elder would have to settle for the likes of Zoran Tosic, Bebe and a crude teenage Wilfried Zaha.\nHis successors would not fare much better. David Moyes would only last long enough to sign one attacker, Juan Mata, who served the club well enough.\n‘The Wizard’ would go on to make 285 appearances in all competitions for the Red Devils, scoring 51 goals, but the 2010 World Cup winner was often played out of position, thus never really generating the same levels of output as he had during his first couple of seasons at Chelsea.\nLouis Van Gaal’s tenure was marred by terrible signings on the wing like Angel di Maria and Memphis Depay, a double act that spectacularly failed to light up Old Trafford.\nDi Maria would be sold at a considerable loss just a year later to PSG. The Argentine winger is still actively disliked by United supporters after trying his best to rile them up, deliriously celebrating a goal for the Parisians in a Champions League tie, only to be humbled by Ole Gunnar Solskjaer’s magnificent Reds a couple weeks later on their own turf.\nMemphis Depay was touted as the next big thing in Europe, having flourished with PSV in Holland, but the Dutchman would score just 2 league goals in 33 outings for the Reds.\nHe was subsequently frozen out of the first team by Jose Mourinho and sold to Lyon in the January of 2017, with United taking yet another hit on an investment.\nThe Portuguese would also sign the aforementioned duo of Sanchez and Mkhitaryan.\nFormer United favourite Ole Gunnar Solskjaer then took over from Jose, and the Norwegian tried to address the wing weaknesses by signing Daniel James and Jadon Sancho in the wide positions.\nJames would be a bit-part player for his entire tenure at the Theatre of Dreams, but his tendency to put a shift in, often made him an invaluable asset against top sides.\nThe Welshman was sold for a significant profit to Leeds, making him one of the few players post-Fergie who generated a net positive for United in the transfer market.\nSolskjaer would often find himself scraping the barrel for transfers, signing teenage duo of Facundo Pellistri and Amad Diallo, when United famously missed out on Sancho during the 20/21 season.\nThe pair have considerable talent, are highly thought of and remain in current manager Erik ten Hag’s plans for the future but it is yet to be seen whether they will break the wing jinx that has existed since the days of Giggs, Beckham and Ronaldo.\nSancho, meanwhile, has been underwhelming, despite clearly possessing the requisite skill set to shine. The Englishman trained away from the first team last month, and has only recently rejoined his fellow Reds at Carrington.\nThe former Borussia Dortmund man has struggled to recapture his dazzling form in Germany which saw him heralded as a generational talent, but the 22 year old still has time on his side.\nAntony, Ten Hag’s only signing for the wing, had a cracking start to life at Old Trafford with 3 goals in his first 3 starts for United, including strikes against Arsenal and City, but the former Ajax man has been singled out by fans for a lack of output and slowing down the tempo of the side in recent weeks.\nThe Brazilian International, who also faced heavy criticism from the press for showboating last year, is just a month older than Sancho and still has plenty of room to grow.\nThe diminutive pair of wingers are players who thrive in possession based sides, and as United continue to keep the ball better under their new Dutch gaffer, players of that ilk ought to come alive.\nDespite United’s obvious failings in the transfer market under the Glazers, especially in the wingers category, Antony and Sancho are still too young to be completely written off, despite what the British media would have us believe.\nThe duo were both massive signings for the Red Devils, meant to revolutionise wing play at Old Trafford for an entire decade, and hopefully in time, they can resurrect their respective careers for United, in a way Henrikh and Alexis failed to do so.\nWhilst today’s showdown at the Emirates may have come too early for Sancho’s revival, all eyes will be on Antony and one player who has undoubtedly brought the left wing to life again this season, Marcus Rashford, to see if they can bring back the glory days and the scintillating wing play that is the hallmark of Manchester United’s football.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 1223,
  "scraped_at": "2026-02-14T01:53:21.839407",
  "_text_extracted": true
}