{
  "article_id": "f5e9b91a5282",
  "url": "https://www.bbc.com/sport/football/articles/c9q0329d3xeo",
  "title": "Spain 5 - 4 France : Lamine Yamal and all - time classic - are these World Cup favourites ? ",
  "date": "20250605T233000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Genius' Yamal & all-time classic - why Spain are World Cup favourites\n- Published\nSpain and France played out a Nations League semi-final game for the ages with a scoreline that looks like it belongs in a penalty shootout.\nThe 5-4 win for Spain has everyone wondering if anyone can stop these attackers - although the less said about the defenders, the better.\nSpain, who play Portugal in Sunday's final, are looking for a third Uefa tournament success in a row having won the last Nations League and Euro 2024.\nAnd they are favourites for the World Cup coming up next summer, with France second on the list.\nSpain showed why they will be tough to stop after one of the most exciting international games in memory.\nA total of 40 shots, 17 on target, nine goals. Spain led 4-0 and 5-1 - and threatened to blow France away - before their rivals rallied.\nIf only every match was like this.\n\"It was a crazy game,\" said Spain goalscorer Mikel Merino. \"Not the best game for the coaches - nobody wants to concede so many goals - but an amazing game for the fans.\"\nHis boss Luis de la Fuente seemed to actually disagree with him.\n\"I'm happy. I enjoy suffering! I don't understand sport without suffering,\" he said.\n\"When two great teams face off like today, it's normal every team makes the most of their moments.\"\nLamine Yamal, who turns 18 later this summer, scored twice for Spain to cement his credentials as a Ballon d'Or contender.\nHe is up to six goals for his country now, to add to 25 for club side Barcelona.\nYamal impressed more than France's Paris St-Germain stars - Ousmane Dembele and Desire Doue - who were hyped up pre-game after phenomenal club seasons.\nLes Bleus debutant Rayan Cherki helped spark France's fightback after coming off the bench to show why he is being linked with Liverpool and Manchester City.\nSo what happened?\nIt would almost take too long to address everything that happened in the game. But here goes.\nMikel Oyarzabal picked out Nico Williams to net Spain's opener, before also setting up Merino four minutes later.\nIt was almost 3-0 but Dean Huijsen had a goal disallowed for offside after a sensational free-kick routine.\n\"That belongs in a musuem,\" said Prime Video summariser Karen Bardsley.\nAfter the break Yamal was fouled and scored the resulting penalty, with Williams finding Pedri shortly after for their fourth.\nKylian Mbappe's penalty pulled one back, but Yamal bagged his second with a fine first touch and finish.\n\"It's hard to argue with the genius that you see before you,\" said Bardsley on seeing Yamal poke home his second.\nThat was 5-1 but then France came back.\nDembele hit the post, before debutant Cherki volleyed in from the edge of the box.\nDani Vivian turned a cross into his own net and then Randal Kolo Muani nodded in from Cherki's good ball.\nBut they could not create another chance in the remaining two minutes of stoppage time to force the extra-time period every neutral wanted.\n'A typical Spain performance'\nAfter 75 minutes it looked as if the story was going to be about Spain blowing France away to cement their place as favourites to win everything going.\nThey were the best side by some way at Euro 2024 and show no signs of slowing down.\nWingers Yamal, who seems to improve with every game - which is actually to be expected at the age of 17 - and Williams were electric.\nMidfielders Merino and Pedri were on the scoresheet. Oyarzabal had two assists to his name.\nTheir oldest player was 28, and the team had an average age of 24.\nBut there will be question marks about a defence that let in four goals - and a team who almost blew a 5-1 lead.\nYamal said: \"When two great teams like this play, you sometimes see a lot of goals. They will make you suffer until the end but we went to the final despite the mistakes we made.\"\nUnai Simon made six saves, so this was far from a story of an opponent who scored with every shot.\n\"That was a typical Spain performance,\" said Spanish journalist Guillem Balague.\n\"These players come out on the pitch with the feeling they can beat anyone.\n\"The interesting thing is they are doing it, winning and creating magic within a structure.\n\"Spain have been playing in a way that represents the predominant model of our times. Not only are these players intelligent, creative but they are committed as well. They work so hard to get the ball back.\n\"Even though at the end Spain relaxed, when you do that you believe you belong to the right path.\n\"You have special players all over the park and of course the feeling is more people are watching Spain because its really enjoyable and winning seems to be a habit.\"\n'It's not all negative' for France\nFrance's attackers were pretty decent.\nEven when they were getting whacked by Spain before the hour-mark, they were still having plenty of chances.\nThey had more shots than Spain did in both halves - and more efforts on target in total.\nMbappe, speaking to RTVE, said: \"We had some bursts of play we haven't had for a long time. But in just 10 minutes of the first half, we conceded two goals - and the same thing happened in the second half.\n\"We weren't consistent throughout the 90 minutes, but we did improve. It's not all negative.\"\nPSG's two-goal Champions League final scorer Doue went close, team-mate and Ballon d'Or contender Dembele hit the post - and Mbappe had chances before scoring his penalty.\nBut 21-year-old Lyon attacker Cherki had a big role after coming on. His sweet volley from the edge of the box was probably the best goal of the game - and his cross for Kolo Muani to make it 5-4 was inch-perfect.\nAgain though, like Spain, it was the defending which was the issue. Juventus full-back Pierre Kalulu, making his debut on his 25th birthday, struggled. Clement Lenglet, winning his first cap since 2021, also faced problems too.\n\"I'm not here to point fingers but I have a backline who are used to working together,\" said boss Didier Deschamps.\n\"[This was] about finding another line who aren't used to playing together. I'm not going to give up on this defence. There were mitigating circumstances. But Spain have this capability to be very efficient. We were able to score goals too.\"\nWhat did BBC Sport readers think about it?\nSulaimon Adelekan: This Spain side is so good and young, they could rule world football for the next six years with Yamal, Pedri, Gavi and Nico Williams still yet to peak. They are dismantling and destroying France.\nVictor: With the way it's going, this Spanish team will easily win the next World Cup. There is simply no need traveling to USA.\nRobbie: Spain are the best team in the world at moment and it's not even close.\nNick: Spain probably are currently the best team in the world, but a full-strength Germany (they were missing Rudiger, Musiala and Havertz yesterday) are close - they were the only team that can really claim they should have beaten Spain at the Euros with the chances they created - and Argentina are strong, too. I feel like France will be incredible at the next World Cup - they just need to work out what their best XI is, because they've arguably got too many good players!",
  "word_count": 1269,
  "scraped_at": "2026-02-14T01:52:26.344943",
  "_text_extracted": true
}