{
  "article_id": "f5eafce9ccaa",
  "url": "https://punchng.com/i-am-at-milan-to-win-trophies-chukwueze/",
  "title": "I am at Milan to win trophies – Chukwueze",
  "date": "20230810T030000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AC Milan new signing, Samuel Chukwueze, is keen to write his name in the club’s history, insisting he is in Italy to win trophies with the club, PUNCH Sports Extra reports.\nThe Nigeria international joined the Serie A giants from Villarreal following protracted talks between both clubs.\nThe negotiation process took a long time as Villarreal wanted €35m, but they eventually accepted €20m plus another €8m in add-ons from the Italian giants.\nChukwueze had his presentation press conference as a Milan player on Wednesday, having made his debut in the final minutes of last night’s 1-1 Trofeo Berlusconi draw with Monza, which the Rossoneri won on penalties.\nIn his speech, the 24-year-old, who scored 13 goals last season for the Yellow Submarines, said he was in Milan to make history.\n“A player grows with each passing year. I want to make history with Milan. I did well in Spain, it is a great opportunity to showcase my talent. I’ve already set my goal, so don’t worry,” he said.\n“I can’t wait to get started. I think we have the team to beat anyone in Serie A, so meeting Inter, Juventus, for sure we can beat them.\n“I didn’t come to watch or earn money; I’m here to win trophies. My work is to play football and write my name in the history of Milan, so that people will remember me in future.\n“I want to make a name for myself and for Milan. I can’t come here and not win. My first priority is to win something, Scudetto, Champions League, Coppa Italia.”\nChukwueze admitted that the phone conversation he had with manager Stefano Pioli was vital in his decision to join Milan.\n“He is a fantastic man. He explained the tactical plan, what he wants from me, why they want to sign me. If the coach called me and didn’t have a project, I don’t think I would be here. He’s a fantastic man, a great coach and motivated me. There are many new players and we need time to adapt, but with time, I’m sure we’ll win Serie A.”\nOn his new teammates and fans, he added, “The fans have been fantastic since I arrived, the best fans I’ve seen so far in my career. When I was with my national team, they contacted me on Instagram and were asking all the time when I was coming, I told my agent to make it happen.\n“My teammates have been very welcoming, made me feel at home right away. I can’t wait to start working with them. I’ve already bonded a lot with Yacine Adli, he’s very funny, always looking for trouble, but also very supportive and always there. He’s a lovely guy.\n“Noah Okafor and Rafael Leao are close to me and help me feel comfortable to showcase my talent. I can’t wait to work with them.”\nThe Nigerian stated he would love to hear the fans chants at San Siro.\n“I remember Kaka’s goal against Manchester United in the Champions League. When I close my eyes, I see Kaka, an amazing player.\n“They already told me about the significance of playing at San Siro, teammates spoke to me about the atmosphere. I want to hear the fans chant and that will motivate me to do more.\n“Milan is a big club compared to Villarreal. As soon as I arrived at the airport, I saw so many fans and understood that I had arrived at one of the biggest clubs in the whole world.”",
  "word_count": 585,
  "scraped_at": "2026-02-14T02:24:50.281111",
  "_text_extracted": true
}