{
  "article_id": "f6223a5203a9",
  "url": "https://www.billboard.com/pro/co-op-live-arena-manchester-uk-biggest-arena-harry-styles/",
  "title": "Co - op Live in Manchester : Inside united kingdom Biggest , Most Sustainable Arena",
  "date": "20240412T121500Z",
  "domain": "billboard.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inside the Harry Styles-Backed Venue Set to Be the U.K.’s Biggest and Most Sustainable Arena\nCo-op Live, located in Manchester opens later this month.\nTrending on Billboard\nLONDON — From New Order to The Smiths, Oasis to The 1975, Buzzcocks to Take That, the list of famous music acts that have come out of Manchester, England, is long and illustrious. This month, another significant chapter in the northern U.K. city’s celebrated music scene begins with the opening of the 23,500-capacity Co-op Live — the United Kingdom’s biggest and most sustainable entertainment arena.\n“We want this venue to be recognized as the next generation in arena facilities that sets the benchmark moving forward. The noise about this building, once it has opened, I think will reverberate a long way,” says GM Gary Roden as he sits in a temporary temporary office trailer next to the venue, shortly after taking Billboard on a behind-the-scenes tour.\nDue to open its doors April 23 with the first of two consecutive shows by British comedian Peter Kay, Co-op Live is the first major project outside the United States from Oak View Group (OVG), the Denver-headquartered global management and development giant co-founded in 2015 by Tim Leiweke and Irving Azoff, which operates more than 400 buildings globally.\nIn the last 16 months, OVG has built and opened seven new arenas, including the Climate Change Arena in Seattle, UBS Arena in New York and Acrisure Arena in Palm Springs, Calif. Arenas are also under development in Brazil, Nigeria, Canada and Wales. OVG COO Francesca Bodie (who is Leiweke’s daughter) says that starting the company’s international expansion in the United Kingdom was a “natural and deliberate step” to take due to the country’s status as “one of the greatest cultural destinations in the world.”\nBodie tells Billboard that Manchester was picked because of its “phenomenal musical heritage and community,” as well as OVG finding the “perfect” location to build a new facility in the city’s Eastlands district, next to Etihad Stadium — the 53,400-capacity home ground of Premier League and UEFA Champions League holder Manchester City football club. “We have built a great foundation in the U.S. and are now focused on projects further afield where we can deliver state-of-the-art venues in places that are in desperate need of something new,” she says.\nManchester City’s parent company, the City Football Group (which is majority-owned by Abu Dhabi, United Arab Emirates), is an equal joint-venture partner and investor with OVG in Co-op Live, which cost £365 million ($462 million) to build and was designed by Populous, the global design firm behind the Madison Square Garden-owned Las Vegas’ Sphere. Construction was handled by local firm BAM Construction, while the naming rights were awarded to Manchester-based Co-op Group in a 15-year sponsorship deal reported to be worth just under £100 million ($127 million).\nAlso listed among Co-op Live’s investors is multi-Grammy-winning pop star Harry Styles, who grew up in the small Cheshire village of Holmes Chapel, around 30 miles outside of Manchester, and advised on aspects of the venue’s design.\n“To have an artist of that scale investing in our building and be advising us along the way is a very fortunate position to be in,” says Roden. “Tim Leiweke and his team spoke to him at the start of the process about what does an artist need from a building. ‘What matters to you?’ And quite rightly, what artists care about most is their fans and the fan experience.”\nTo that end, every aspect of Co-op Live has been designed with the audience and performer in mind, says OVG. That means a complete advertising blackout inside its “immersive bowl” interior during shows, comfortable tiered seating that OVG says brings fans 23 meters (75 feet) closer to the stage than arenas of a similar size (complete with beverage holders on every seat), first-class acoustic and audio-visual technology and the largest floor space of any U.K. indoor venue (30,677 square feet in standard-end stage mode and 35,520 square feet when center stage is in the round), capable of holding up to 9,200 people.\nThe venue also boasts 32 bars and restaurants, including multiple luxury VIP lounges and premium dining options, as well as its own private nightclub. The first thing that general admission ticket holders will see upon entering Co-op Live is “The Street” — a huge indoor food and drinks market with a bar that is 22 meters long (72 feet) that has been designed as the “heartbeat” of the building.\n“Everything has been built around this idea of: ‘How do we give the fan the best experience they’ve ever had coming to an indoor arena?’ ” says Roden. He confidently states that the legacy issues for many music fans visiting arena-size venues “where you find your seat, have a terrible warm beer, eat a burger that tastes like cardboard and queue for 30 minutes for the toilet” won’t apply at Co-op Live.\nSustainability is another key consideration in the building’s design, with Co-op Live set to be the United Kingdom’s first and only 100% electric arena, powered by a combination of renewably sourced electricity and a football pitch-size field of on-site solar panels. Meanwhile, the venue’s rectangular flat roof will harvest Manchester’s famous abundance of rainfall, which will then be used to water its plants and flush its toilets.\nAir-source heat pumps, reuseable cups, food sourced from nearby vendors and a pledge of zero waste to landfill are among the other environmental initiatives OVG hopes will make Co-op Live the most sustainable arena in Europe. That commitment extends beyond the building’s walls with a neighboring mile-long pedestrian path upgraded with lighting installations and busking spots for musicians to encourage local visitors to walk to the venue rather than drive. Surrounding Co-op Live, a “biodiversity ring” of lush greenery has been planted to provide a natural habitat for wildlife and attract bees.\nOVG says Co-op Live will bring in between 750,000 and 1 million new ticket sales each year, creating more than 1,000 jobs and contributing £1.5 billion ($1.9 billion) to the local economy over the next 20 years. But not everyone is happy about its arrival.\nDuring the planning process, ASM Global, owners of Manchester’s existing AO Arena — a busy venue located in the heart of the city, which opened in 1995 and regularly features in Billboard‘s year-end Top 10 Venues list, grossing $76.1 million in 2023 from 102 shows, according to Billboard Boxscore — strongly opposed OVG’s plans to build the rival facility. It argued that Greater Manchester, which has a 2.8 million population across the city and its surrounding towns and boroughs, is not big enough to support two separate 20,000-plus-size arenas.\nIn the past year, AO Arena has undergone a major £50 million ($63 million) upgrade, increasing its overall capacity from 21,000 to 23,000, expanding its standing floor space by 100% and opening new VIP bars and restaurants, ahead of Co-op Live’s opening. (The United Kingdom’s leading venue is London’s 20,000-capacity The O2, which took in $219.5 million last year, making it the world’s second-highest-grossing arena behind Madison Square Garden, according to Billboard Boxscore figures).\n“We wouldn’t have put a spade in the ground if we didn’t believe the Manchester market could take two arenas,” says Roden. “The goal is not for us to bring in the same number of shows that were already coming to Manchester. Our goal is to bring in more shows to the city and have international artists stay here longer.”\nBookings indicate the strategy is working with multiple show residencies at Co-op Live scheduled for the Eagles (five nights), Take That (seven nights), Liam Gallagher (four nights), Olivia Rodrigo (two nights) and Nicki Minaj (two nights) in 2024. Other upcoming shows include Kid Cudi, Slipknot, The Black Keys, Eric Clapton, Pet Shop Boys, Jonas Brothers, Pearl Jam, Justin Timberlake, Noah Kahan and Megan Thee Stallion. In November, MTV’s Europe Music Awards (EMAs) will be held at the venue, marking the first time the event has been held in Manchester.\n“The moment when we hear that first chord come out from an amp and we hear the fans reacting to that is going to be something to behold and I can’t wait for people to experience it,” says Roden, looking ahead to opening week. “We feel we’ve created a world class facility that showcases Manchester not only to the U.K. and European market but globally as well.”\n“In many ways, Co-op Live embodies what OVG is all about,” adds Bodie. “Creating venues that set new industry standards and develop amazing experiences for fans and artists alike.”",
  "word_count": 1434,
  "scraped_at": "2026-02-14T02:10:47.905871",
  "_text_extracted": true
}