{
  "article_id": "f62e7d35bfb9",
  "url": "https://www.caughtoffside.com/2023/12/17/fabrizio-romano-on-man-united-sacking-erik-ten-hag-if-they-lose-to-liverpool/",
  "title": "Fabrizio Romano on Man United sacking Erik Ten Hag if they suffer Liverpool defeat",
  "date": "20231217T114500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are not giving any indication they will sack Erik Ten Hag.\nThat’s according to leading football journalist and CaughtOffside columnist Fabrizio Romano, who does not believe even defeat against arch-rivals Liverpool on Sunday afternoon would be enough for United to send the Dutchman packing.\nA fourth-round Carabao Cup defeat against Newcastle and group-stage elimination from the Champions League have already seen Ten Hag’s men crash out of two competitions.\nAnd with Liverpool next up for the 20-time league winners, things don’t appear to be getting any easier for the former Ajax boss.\nSpeculation another damaging defeat would be the final straw for the Dutchman has begun to mount but Romano does not believe this to be the case.\n“I know a lot of fans want to know if Erik Ten Hag will be sacked like previous managers if the Red Devils suffer a damaging defeat but I don’t have any information at all about this,” he wrote in his exclusive SubStack column.\n“No signals are coming from United that this could happen — none at all, actually. It is a normal situation, and like Ten Hag has said — no changes at all.”\nGoing on to give his own thoughts on what is happening at Old Trafford ahead of Sir Jim Ratcliffe’s impending arrival, Romano said: “The problem is not Ten Hag, there are many things to sort out at Manchester United.”\nSunday’s featured game between Liverpool and Manchester United, which will be played at Anfield, is scheduled to kick off at 4.30 p.m. (UK time) and will be broadcast live on Sky Sports.",
  "word_count": 266,
  "scraped_at": "2026-02-14T02:10:33.600094",
  "_text_extracted": true
}