{
  "article_id": "f633a2895c33",
  "url": "https://punchng.com/osimhen-scores-again-as-lookman-suffers-first-atletico-defeat/",
  "title": "Nigerian Footballers Abroad : Osimhen Scores , Lookman Debuts",
  "date": "20260209T063000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Nigerian stars continued to chase club glories abroad, the goals kept flowing for a few usual suspects, but Ademola Lookman was shut out on his LaLiga debut. ABIODUN ADEWALE reports.\nTURKEY\nVictor Osimhen (Galatasaray)\nOsimhen scored his ninth goal of the season and his 52nd for Galatasaray on Sunday in their 3-0 win over Rizespor. The striker rounded off the scoring in the comprehensive victory by rounding the goalkeeper before tucking the ball home from a tight angle.\nAs the win powered Galatasaray to a temporary six-point lead over Fenerbahce at the top of the Super Lig table, Osimhen also moved up a place among foreign goal scorers for the Turkish giants.\nWith 52 goals, he is now the fourth-highest foreign scorer for Galatasaray, moving ahead of former Swansea striker Bafetimbi Gomis (51). The players ahead of Osimhen are Milan Baros (61), Gheorge Hagi (72) and Mauro Icardi (73).\nIn May 2025, he scored twice and also broke Turkish football’s single-season record for most goals by a foreign player and helped the Istanbul giants lift the Turkish Cup with a 3-0 win over Trabzonspor.\nThe Nigerian forward entered the final at the Gaziantep Stadium with 33 goals in all competitions, just one shy of Mario Jardel’s long-standing record of 34 goals in a single season by a foreign player, set in the 2000/01 campaign. Osimhen equalled and then surpassed the record with strikes in the 46th and 63rd minutes, bringing his tally to 35 goals in 38 appearances during a landmark debut season in Turkey.\nDespite being slowed down by injury at the start of the season, Osimhen has been delivering for Gala this season but still remains far off in the top scorers’ battle, which is led by his compatriot, Paul Onuachu with 15 goals.\nIbrahim Olawoyin (Rizespor)\nFormer NPFL star Olawoyin played his 99th league game for Rizespor on Sunday in their 3-0 defeat against Galatasaray, but the best he could mark it with was a yellow card. The 28-year-old was on for 64 minutes in the encounter.\nSince arriving at Rizespor in January 2023, he has played 83 topflight games while 16 others have come in the lower league. This season, he has one goal in 15 games, while he has 14 goals in the topflight in the last three seasons plus three others in the lower division.\nWilfred Ndidi (Besiktas)\nAfter putting transfer talks behind him and with the death of his father still fresh in memory, Ndidi has continued to show up for Besiktas this season, registering another 90 minutes in their 2-2 draw against Alanyaspor on Sunday. He has played 16 games this season, scoring one goal.\nNdidi joined the club in the summer and was named vice-captain. After just about six months at the club, he was linked with a potential return to the Premier League with Manchester United, but it seems he looks settled to keep running his contract at the Tupras Stadium.\nSPAIN\nAdemola Lookman (Atletico Madrid)\nAfter a brilliant debut for Atletico Madrid in the Copa del Rey last midweek, Lookman retained his place in the starting line-up for Diego Simeone’s men as they filed out against the same opponents, Real Betis.\nThey had romped to a 5-0 win in Seville last week, but the scoreline was different this time around, as Betis took revenge with a 1-0 win at the Wanda Metropolitano, denting Atletico’s hopes of closing the gap on the top two.\nLookman, who scored a goal and assisted another last week, had the ball at the back of the net before halftime, but it was ruled out for offside after Antony had given the visitors the lead.\nThe Nigerian was later booked in the 54th minute before he was replaced by Obed Vargas in the 70th minute. The defeat leaves them third with 45 points, while Villarreal are breathing down their neck with 42 points in fourth place and have also played two games less.\nAdams, Ejuke (Sevilla)\nSuper Eagles duo Akor Adams and Chidera Ejuke were both involved for Sevilla on Sunday but could not help them get the win in a 1-1 draw at home to Girona.\nA brilliant late goal from Kike Salas rescued a point for Sevilla, who were denied the chance to record a fourth successive victory at the Ramón Sánchez-Pizjuán. Girona got off to the perfect start, taking the lead with only three minutes on the clock through Thomas Lemar.\nThey were denied the win in the second minute of added time when Salas’ left-footed strike from just outside the area flew past Gazzaniga and into the net via the left post.\nAdams, who has three goals in his last four games, was taken off in the 74th minute, while Ejuke came on as a halftime substitute.\nUmar Sadiq (Valencia)\nAfter sealing a transfer to Valencia in January, Sadiq is yet to get his first start in LaLiga for the club, as he started from the bench for Real Madrid’s visit to the Mestalla Stadium on Sunday evening. Before Sunday, he had played four league games.\nKareem Tunde (Levante)\nAnother Nigerian player has surfaced in the Spanish LaLiga, with Barcelona-born Tunde featuring for Levante. The 20-year-old was on for 90 minutes in their 4-2 defeat at Athletic Bilbao, marking his sixth LaLiga appearance with another tough exposure.\nBorn in Barcelona, Catalonia, to a Nigerian father and a Spanish mother, Tunde joined FC Barcelona’s La Masia in June 2017 from RCD Espanyol. He left the club in 2020 and spent two years at CF Damm before moving to the youth categories of Levante UD.\nTunde made his senior debut with the reserves on January 7, 2024, playing the last 13 minutes of a 1–1 Tercera Federación home draw against CD Soneja. On May 28, he renewed his contract with the Granotes until 2026, with an option for a further three years.\nAfter establishing himself as a regular starter for the B-team, Tunde made his first-team – and LaLiga – debut on December 20, 2025, coming on as a second-half substitute for Jeremy Toljan in a 1–1 home draw against Real Sociedad.\nFRANCE\nMoses Simon (Paris FC)\nSimon is still looking for his first league goal since November, firing blanks again on Sunday in Paris FC’s 0-0 draw at Auxerre. The winger was on for 63 minutes in what was his second league game since returning from the 2025 AFCON, where he helped Nigeria win a bronze medal.\nHe joined Paris FC in the summer after a lengthy spell at Nantes. He is gradually establishing himself in the capital with three goals and two assists so far in Ligue 1 for Paris FC.\nITALY\nFisayo Dele-Bashiru (Lazio)\nThere was no room in the starting line-up for Dele-Bashiru against Juventus on Sunday, but the Nigerian midfielder came on in the 43rd minute in what seemed like an injury-forced substitution. The midfielder had played 10 games before Sunday and had not started a match since returning from the 2025 AFCON in Morocco.\nBELGIUM\nRaphael Onyedika (Club Brugge)\nMidfielder Onyedika seems to have resettled in Belgium after a transfer-speculation-filled January.\nHe was instrumental again for the club, playing 90 minutes and helping them to a 3-0 win over Standard Liege as they keep up the pace for a championship spot. Onyedika has played 17 games this season, scoring one goal, while they also remain in the UEFA Champions League, where they will face Atletico Madrid in the knockout playoffs.\nCYPRUS\nFrancis Uzoho (Omonia)\nUzoho marked his return from the 2025 AFCON in Morocco by featuring for 120 minutes in a Cup defeat last week, but he was dropped to the bench on Sunday in their 4-2 win over Pafos in the league.\nENGLAND\nChiamaka Nnadozie (Brighton)\nSuper Falcons keeper Nnadozie made four saves from seven shots faced, but it was not enough to keep Brighton from losing 3-2 at West Ham United.\nIt marked a second consecutive league defeat for Brighton Women, also leaving them with just one win in their last five games. The keeper has four clean sheets in 13 games since arriving in England in the summer.",
  "word_count": 1355,
  "scraped_at": "2026-02-14T01:53:15.563500",
  "_text_extracted": true
}