{
  "article_id": "f6350186679d",
  "url": "https://www.nytimes.com/athletic/6898463/2025/12/18/pep-guardiola-manchester-city-legacy/",
  "title": "If this is Pep Guardiola goodbye to English football , his legacy is unique",
  "date": "20251218T151500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola was only six months into life as Manchester City coach when he declared, on the second day of 2017, that “the process of my goodbye has already started”.\nMembers of the club’s hierarchy spoke in similar terms in those days. They didn’t imagine he was there for the long haul. They were just determined to enjoy it for the length of his initial three-year contract. Anything beyond that would be a bonus.\nAdvertisement\nAs much to his own surprise as anyone else’s, Guardiola has stayed for almost a decade. He has led City to six Premier League titles and has won the FA Cup twice and the League Cup four times, as well as adding the Champions League, the European Super Cup and the Club World Cup in that glorious year of 2023.\nBut now, as revealed by The Athletic today, there is a growing belief among well-placed sources that this will be his last season in Manchester.\nCity’s supporters will hope he can be persuaded to stay, recalling that his departure was widely predicted before he extended his contract in November 2020, November 2022, and November 2024, but the mood music sounds different this time. A final decision will not be made until closer to the end of the campaign, but City are advancing contingency plans to prepare for that scenario.\nWhenever the curtain falls, the legacy Guardiola leaves behind will be enormous. It is not just about the trophies he has won with City. It is also his influence as the leading proponent of a possession-based playing style that was felt by many to be incompatible with English football values when he arrived in 2016. It is now so deeply ingrained in modern coaching circles that it can be traced all the way from the Premier League to the National League to the sodden pitches of Sunday League.\nNobody, in today’s football, does it better. He has had a huge transfer budget at his disposal, along with players of the quality of Kevin De Bruyne, David Silva, Sergio Aguero, and now Rodri, Phil Foden and Erling Haaland, but this has not just been an exercise in chequebook management. Guardiola has built brilliant teams and made them even greater than the sum of their expensive parts, while Chelsea and Manchester United, with comparable transfer budgets, have done nothing of the sort.\nAdvertisement\nTo win six Premier League titles in seven seasons, between 2017-18 and 2023-24, is a level of domination without precedent in English football. So, too, is the number of games they have won and goals they have scored in those title-winning seasons. Just as he did in Spain during his four years in charge at Barcelona, he has redefined expectations about what excellence looks like in the Premier League, both when looking at the record books and when analysing the brilliance of his team’s play.\nThe past 18 months have brought an interruption to the domination, with City finishing third in the Premier League last season following an alarming slump this time last year, and the new campaign has not been without its hiccups. But having moved on experienced players such as Ederson, Kyle Walker, Ilkay Gundogan and De Bruyne in the summer, Guardiola has moved towards a new crop of younger players and appears to be managing the transition well.\nWhy would he decide to leave now? It is unclear. But perhaps, as with Jurgen Klopp in his final years at Liverpool, he briefly felt invigorated enough to sign a new contract (in Guardiola’s case, a new two-and-a-half-year deal this time last year), only to find himself drawn back towards his initial instinct. In both cases, there was a loyalty element, too, a desire to press ahead with the start of a rebuild. Committing to seeing that cycle through to some kind of conclusion is a different matter entirely.\nIt is a mark of Guardiola’s unexpected longevity in Manchester that at one time, early in his tenure, the club’s former midfielder Patrick Vieira, who was coaching City Football Group’s Major League Soccer franchise New York City, was regarded internally as a prime candidate to succeed him. So was Mikel Arteta, who was his assistant in Manchester before leaving to take the Arsenal job in December 2019. Former City captain Vincent Kompany, now in charge of Bayern Munich, was felt to be emerging as a potential Guardiola successor as he led Burnley to promotion to the Premier League in impressive style in 2023.\nRight now, there are strong indications that the City hierarchy will place Chelsea coach Enzo Maresca high among their list of candidates should Guardiola step aside. That is an intriguing prospect, not least because Maresca has spent most of his 18 months in charge of Chelsea battling to convince the outside world that he merits the faith the club has shown in him.\nAdvertisement\nThere is no doubt he is a talented, intelligent coach, but those flourishes of real promise at Chelsea have been interspersed by periods of crisis or at least self-doubt for a relatively inexperienced coach and an inexperienced group of players. He has looked more authoritative in his second season at Stamford Bridge than in his first, emboldened by winning the Conference League and the Club World Cup, but there are still frequent questions about the way he sets up his team, whether he is capable of delivering collective improvement on the scale Chelsea need, and whether he has the composure to ease the tensions that can blow up around a team rather than inflame them, as has been the case with his public comments over the past week.\nMaresca is instantly identifiable as a follower of the Guardiola doctrine (even if Guardiola himself would prefer to suggest that his inspiration comes from Marcelo Bielsa, now in charge of the Uruguay national team). Maresca has frequently described Guardiola as a “genius”, having worked under him first when coaching City’s under-21 team and then as an assistant at first-team level; Guardiola, for his part, recently described Maresca as “one of the best managers in the world” in a press conference.\nSo many of today’s leading coaches have been influenced by Guardiola — in many cases directly. The coaches of Chelsea (Maresca) and Arsenal (Arteta) worked alongside him at City, as did Paris Saint-Germain coach Luis Enrique at Barcelona. The coaches of Bayern Munich (Kompany) and Real Madrid (Xabi Alonso) played under him and learned from him at City and Bayern Munich. Cesc Fabregas, whose reputation as a coach is growing at Italian club Como, played under Guardiola at Barcelona. So did Barcelona assistant coach Thiago Alcantara. Liverpool coach Arne Slot is another devotee, having told Dutch magazine Voetbal International in 2023 that Guardiola’s approach “gives me the ultimate pleasure in football”.\nThis level of influence at the very highest level of the game is not normal. Coaches as successful as Carlo Ancelotti and Jose Mourinho inspire great respect and admiration among their peers, as did Sir Alex Ferguson and others in the past, but Guardiola’s influence — both direct and indirect — is unparalleled in the modern game.\nThe positive aspect of that, for City, is that identifying coaches who follow a similar football philosophy should not be as difficult as it once would have been. The trouble is that any coach modelling himself on Guardiola runs the risk of being seen as Guardiola Lite.\nPerhaps the most underrated aspect of Guardiola’s management is the insatiable appetite he has fostered in his teams. Just as Ferguson was underestimated as a tactician, so are Guardiola’s powers of man-management too easily glossed over. But the intensity with which he works — day after day, week after week, season after season — is obvious, as are the demands he puts on his players to ensure that the team’s standards do not slip. Winning six league titles in seven seasons, when competing with teams of the quality of Klopp’s Liverpool and, more recently, Arteta’s Arsenal, speaks volumes.\nThere is a large elephant in the room: this glorious Manchester City era has unfolded against a backdrop of serious allegations about the club’s financial conduct. With a resolution to the Premier League’s investigation into alleged breaches of final regulations expected soon — though we have been saying that for 12 months — there will be an assumption in some quarters that any decision on Guardiola’s future might be pinned to the outcome. But The Athletic has been given no indication that this is the case.\nAdvertisement\nIt is nonetheless astonishing that we are still waiting for the Premier League’s independent commission to announce the findings of an investigation into allegations that were first published by German newspaper Der Spiegel in late 2018. City deny any wrongdoing, but, depending on the outcome, the club’s outstanding achievements over the past 15 seasons might come to be seen in a very different light.\nBut these are — and have always been — questions for City’s owners and executive team, not for Guardiola or for the many players who have been drawn to the club over the past decade and more. City’s huge commercial growth in the years under investigation enabled them to attract Guardiola and all those top-class players in the first place, but his record in Barcelona, Munich and Manchester leaves the impression that if he had not joined City, he would have had comparable success elsewhere.\nIt is obvious to say he will leave a void at City when he departs. It is equally obvious to say his departure could create an opportunity for rival clubs to exploit. City have won six of the past eight Premier League titles and, after an uncertain start to the campaign, have now moved within two points of Arsenal at the top. There must have been times in recent seasons when Arteta (and Klopp previously) has found himself counting down the days on Guardiola’s contract at City, only for him to sign a new one.\nBut that last two-year contract extension, which Guardiola signed late last year, always had the look of a “steadying the ship” gesture — designed to help City through a difficult period both on and off the pitch, coinciding with a bleak run of results, the transition from one sporting director (Txiki Begiristain) to another (Hugo Viana) — rather than a resounding statement of long-term intent. Even at the time, the theory was proposed that this season might be his last.\nGuardiola looked exhausted this time last year, showing signs of the pressure that was taking a toll in what proved to be his most arduous season in Manchester. He has looked much more relaxed so far this season, but again, perhaps there is a parallel with Klopp two years ago. There are dark, lonely times in management, so when someone can see light at the end of the tunnel at last, that can sometimes have a liberating effect.\nCity’s supporters will hope he can be persuaded to give it one more year. They will dust down that banner in his native Catalan telling him “volem que et quedis” (we want you to stay) and they will wonder whether, if the second half of the season is to turn into a farewell tour, it will encompass victory in the Carabao Cup final at Wembley in March, the FA Cup final in May 16, another Premier League title win (with Aston Villa their opponents at the Etihad Stadium on the final day, just like in 2022), or indeed the Champions League final in Budapest on May 30.\nBut now, after nine and a half years, the process of Guardiola’s goodbye seems to be starting, so the task of finding his successor must be confronted with added urgency. Whoever is chosen, whoever accepts the challenge, Guardiola will be the ultimate hard act to follow.",
  "word_count": 1975,
  "scraped_at": "2026-02-14T01:59:31.521123",
  "_text_extracted": true
}