{
  "article_id": "f659862df122",
  "url": "https://www.teamtalk.com/manchester-united/rio-ferdinand-backs-united-smash-rivals-chase-for-huge-centre-back-talent-after-ten-hag-stay",
  "title": "Man Utd transfers : Rio Ferdinand backs old side to smash rivals in chase for  huge  centre - back talent after Ten Hag stay",
  "date": "20240614T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nRio Ferdinand backs Man Utd to smash rivals in chase for ‘huge’ centre-back talent after Ten Hag stay\nRio Ferdinand has backed Manchester United to beat Real Madrid and other rivals to the signing of a transformative centre-back this summer. while also commenting on the club’s decision to stick with Erik ten Hag.\nThe Dutchman will remain at Old Trafford for the upcoming while there have also been discussions over a contract extension after he won his second trophy in two years, despite a disastrous Premier League campaign.\nAnd now the focus switches to who Ten Hag can bring in to improve a United that largely underachieved for much of the season, although an excessive number of injuries no doubt played a part in that.\nThe Red Devils were hit hardest at the back, although that’s an area Ten Hag wants to move on from certain players anyway.\nDIVE DEEPER: Man Utd midfield targets: EVERY option linked for the summer 2024 transfer window\nRaphael Varane has already gone, while Harry Maguire and Aaron Wan-Bissaka are almost certain to be moved on. That all leads to Ten Hag likely bringing in two new centre-backs, and Ferdinand knows exactly who he wants at Old Trafford.\nThe United legend is a massive fan of Lille teenager Leny Yoro, who only turned 18 back in November but is already valued at around £50million after a breakout season in Ligue 1.\nYoro played in all but two of Lille’s 34 Ligue 1 games last season, helping Bruno Genesio’s side finish fourth and make the Champions League qualifiers.\nAnd Ferdinand believes the highly-rated teenager has ‘huge potential’ and urged Sir Jim Ratcliffe and co. to secure his signature ahead of Real.\n“This is a huge, huge summer for Manchester United,” Ferdinand said on his YouTube channel. “It’s a huge transfer window.\n“They need to recruit well, they need to recruit better. That’s been one of the poorest elements at the club in recent years.\n“They’ve got to get a fit Luke Shaw and Lisandro Martinez back and playing more regularly next season. Get them two fit and then you need to buy another centre-back, definitely.\n“Do we go for experience or a young one? Leny Yoro is the young lad from France, Lille. I think he’s top, he has huge potential and could be anything.\n“I don’t think Real Madrid are going to be in the market for a centre-back so I think he’s there ready to be taken and I would take him now. You would get a good five or ten years out of him.”\nRio left surprised at Ten Hag call\nAny transfers United do make this summer under their new football operations department will still need some form of approval from Ten Hag, who Ferdinand admits he was surprised to see stay.\nThe Red Devils suffered their worst-ever Premier League finish this past season, with Ten Hag saving his job with the FA Cup win over Manchester City and the fact that Thomas Tuchel and Mauricio Pochettino reportedly both turned down the role.\nAnd speaking about the decision, Ferdinand added: “The manager is staying and there’s been so much debate and conversation about whether he would stay or go.\n“The owners took their time to think about the FA Cup final and the fallout from the whole season. I actually thought they would go the other way but maybe they’ve spoken to a few managers and thought they’re not for us.\n“Ten Hag has won two trophies in two years and the amount of injuries last season was mad, the most of any team in the league. So given that I can totally understand why the manager is staying.”",
  "word_count": 623,
  "scraped_at": "2026-02-14T01:57:18.898843",
  "_text_extracted": true
}