{
  "article_id": "f65c41802129",
  "url": "https://metro.co.uk/2025/11/09/micah-richards-names-two-goalkeepers-better-than-arsenal-star-david-raya-24658292/",
  "title": "Micah Richards names two goalkeepers  better than  Arsenal star David Raya",
  "date": "20251109T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Micah Richards believes Arsenal star David Raya is ‘on his way’ to becoming the best goalkeeper in the world but currently sits below two rivals.\nRaya has been a revelation at the Emirates Stadium since his £30m move from Brentford in 2023.\nSome pundits questioned Arsenal’s move for Raya given England international Aaron Ramsdale was already a key part of Mikel Arteta’s squad.\nBut Raya quickly displaced Ramsdale as Arsenal’s No. 1 and has established himself as one of the best goalkeepers in the world.\nRaya, 30, has conceded just five goals this season – two of which came in Saturday’s dramatic 2-2 draw with Sunderland.\nEx-England defender Richards is a huge admirer of Raya but says two other goalkeepers – Alisson Becker and Thibaut Courtois – sit above the Arsenal player.\nThe currently injured Alisson has won two Premier League titles and the Champions League since joining Liverpool in 2018.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nCourtois, meanwhile, has lifted two Champions League trophies and three La Liga titles at Real Madrid in his near-decade long spell at the Bernabeu.\n‘Who’s the best goalkeeper in the world at the moment? I quite like these conversations,’ England legend Gary Lineker asked on The Rest is Football podcast.\n‘You’ve got Thibaut Courtois at Real Madrid and Raya at Arsenal who has barely conceded a goal this season.\n‘Alisson is injured at the moment but has been at the top for years, you’ve got Donnarumma as well. There’s some great goalkeepers around right now isn’t there?\n‘Oblak is worth a mention as well, he’s been great for Atletico. The art of goalkeeping has definitely got better, they’re bigger generally for a start.’\nResponding to Lineker’s question, Richards said: ‘Thibaut Courtois has been the best goalkeeper in the world for a while.\n‘I would say in the Premier League it’s Alisson. Raya is on his way to being the best, certainly, but you need to look at what is in front of Raya.\n‘Look at what Alisson has done at Liverpool. His one-v-one shot-stopping is ridiculous. The goalkeepers now are definitely more athletic than they were back in the day.’\nArsenal kept a club-record equalling eighth successive clean sheet before they were denied a record-breaking ninth by Sunderland.\nMore Trending\nDan Ballard’s first-half goal finally broke Arsenal’s resistance but the Gunners still looked on course for an 11th straight win thanks to second-half goals from Bukayo Saka and Leandro Trossard.\nArteta’s side were minutes away from going eight points clear at the top of the Premier League when Brian Brobbey scored a dramatic equaliser deep into injury-time.\nArsenal return to Premier League action after the international break with an intriguing north London derby against Tottenham.\nThe Gunners have not won a league title since 2004, finishing as runners-up for the past three seasons.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man City 3-0 Liverpool: Jeremy Doku shines as Pep Guardiola’s side go second\nMORE: John Terry singles out Chelsea star for praise after Wolves win: ‘Absolutely petrifying’\nMORE: Shaka Hislop rules one team out of Premier League title race after Arsenal drop points",
  "word_count": 583,
  "scraped_at": "2026-02-14T02:03:26.534417",
  "_text_extracted": true
}