{
  "article_id": "f65d29027b96",
  "url": "https://www.themag.co.uk/2025/05/win-lose-or-draw-on-sunday-this-is-how-newcastle-united-would-qualify-for-champions-league/",
  "title": "Win , lose or draw on Sunday - This is how Newcastle United would qualify for Champions League",
  "date": "20250520T110000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Win, lose or draw on Sunday – This is how Newcastle United would qualify for Champions League\nNewcastle United will find out their Champions League fate on Sunday.\nFive clubs still in contention for the final three places.\nThe fans of Nottingham Forest, Chelsea, Manchester City and Aston Villa also having hopes of celebrations come 6pm on Sunday.\nNever has the competition for Champions League been so tight with less than a week to go.\nCurrently five clubs separated by one point.\nDown below I will set out the various ways that Newcastle United can qualify for the Champions League, the different sets of circumstances if NUFC win, draw or lose.\nFirst of all though, how the Premier League table looks on Tuesday 20 May 2025 and the five remaining key fixtures:\nThe remaining matches for the Champions League chasing clubs:\nTuesday 20 May\nMan City v Bournemouth (8pm)\nSunday 25 May\nFulham v Man City (4pm)\nMan U v Villa (4pm)\nNewcastle v Everton (4pm)\nForest v Chelsea (4pm)\nNewcastle United win, draw or lose against Everton – What is needed in each case to ensure Champions League football:\nNewcastle beat Everton\nThe easy one first, if Newcastle United win on Sunday they are guaranteed a top five finish and Champions League football. No matter what happens in the other matches.\nNewcastle draw against Everton\nIf Villa fail to win at Man U (NUFC would be on 67 points and possible for only one of Forest and Chelsea to overtake Eddie Howe’s side).\nIf Man City get less than two points from their last two games (again, NUFC on 67 points and only one of Forest and Chelsea could overtake).\nNewcastle lose to Everton\nIf Villa lose and Forest fail to beat Chelsea.\nIf Villa lose and Forest win (unless a crazy NUFC Goal Difference change compared to Chelsea, including Newcastle losing by something like a three or four goal margin to Everton).\nIf Villa lose and Man City lose both their matches.\nIf Villa lose and Man City get a draw AND lose their other match by two goals more than Newcastle lose to Everton.\nIf Forest don’t win and Man City get a draw AND lose their other match by two goals more than Newcastle lose to Everton.\nIf Chelsea lose and Man City get a draw AND lose their other match by two goals more than Newcastle lose to Everton (and Newcastle don’t lose by three or more goals than Chelsea lose to Forest!)\nDon’t have nightmares\nI am now going for a lie down, my head hurts!\nI don’t think I have left out any other scenarios whereby Newcastle United would end up qualifying for the Champions League (Though some of the scenarios above, do of course depend on Villa not turning around a 13 goals disadvantage compared to Newcastle on goal difference, same with Forest who are nine goals worse off compared to NUFC.)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 504,
  "scraped_at": "2026-02-14T02:21:20.324846",
  "_text_extracted": true
}