{
  "article_id": "f665a382e117",
  "url": "https://www.kuwaittimes.com/tottenham-sack-interim-coach-stellini-after-newcastle-thrashing/",
  "title": "Tottenham sack interim coach Stellini after Newcastle thrashing",
  "date": "20230424T223000Z",
  "domain": "kuwaittimes.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LONDON: Tottenham sacked interim manager Cristian Stellini on Monday after chairman Daniel Levy branded Sunday's 6-1 defeat at Newcastle \"wholly unacceptable\". Stellini, who was only put in charge last month after his former boss Antonio Conte left the club, will be replaced by Ryan Mason with immediate effect.\nA difficult season hit a new low at St James' Park as Spurs were 5-0 down after just 21 minutes. \"Sunday’s performance against Newcastle was wholly unacceptable,\" said Levy in a club statement. \"Cristian will leave his current role along with his coaching staff. Cristian stepped in at a difficult point in our season and I want to thank him for the professional manner in which he and his coaching staff have conducted themselves during such a challenging time.\"\nHowever, the decision to replace Conte with a member of his backroom staff in the first place has opened Levy up to more criticism from fans. \"We can look at many reasons why it happened and whilst myself, the board, the coaches and players must all take collective responsibility, ultimately the responsibility is mine,\" Levy added. \"I met with the player committee today - the squad is determined to pull together to ensure the strongest possible finish to the season. We are all clear we need to deliver performances which earn your amazing support.\"\nMason, who also took charge towards the end of the 2020/21 season, will be in the dugout for Thursday's clash at home to Manchester United. After finishing fourth under Conte last season, hopes were high that Tottenham could go even better this campaign as the former Chelsea boss was armed with over £100 million ($124 million) of new signings.\nBut after just one defeat in their opening 10 league games, Spurs have lost 10 of their last 22. An astonishing rant by Conte, pointing the finger at his players' inability to perform under pressure, ended the Italian's time in charge. But things did not improve under Stellini as Spurs blew a goal and a man advantage at relegation-threatened Everton to draw 1-1 and lost 3-2 at home to Bournemouth before their collapse at Newcastle.\nTottenham's malaise has raised questions over the future of star striker Harry Kane. The England captain has just one year left on his contract and is attracting interest from Bayern Munich and Manchester United. The club's managing director of football Fabio Paratici also resigned last week after losing his appeal against a 30-month global ban from performing his role. Paratici was handed the suspension by the Italian football federation (FIGC) in January after his former club Juventus were found guilty of false accounting.",
  "word_count": 438,
  "scraped_at": "2026-02-14T01:50:29.472084",
  "_text_extracted": true
}