{
  "article_id": "f676708562a8",
  "url": "https://www.aol.com/liverpool-forward-diogo-jota-rose-150447317.html",
  "title": "Liverpool forward Diogo Jota rose to the heights of soccer stardom before his tragic death at 28",
  "date": "20250703T171500Z",
  "domain": "aol.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool forward Diogo Jota rose to the heights of soccer stardom before his tragic death at 28\nAs a child, Diogo Jota idolized Cristiano Ronaldo. In a career that took him to the heights of soccer stardom, he would go on to call the Portugal great a teammate and win some of the sport's biggest trophies.\nJota, the Liverpool forward who in May celebrated winning the Premier League title, has died. He was 28.\nPolice said Jota died along with his brother Andre Silva, also a soccer player, in a car accident near the northwestern city of Zamora, Spain.\nHe had just completed the most successful season of his career — helping Liverpool to a record-equaling 20th English league title and then winning the UEFA Nations League with Portugal alongside Ronaldo.\n“Doesn’t make any sense. Just now we were together in the National Team,” Ronaldo posted on social media.\nDiogo Jose Teixeira Da Silva was born Dec. 4, 1996 in Porto, Portugal.\nA clinical goal-scorer, his talent took him from humble beginnings with his local team Gondomar to soccer’s biggest stages with Liverpool and Portugal.\nAs a child he dreamed of becoming a professional soccer player. But his route to the top was not straightforward — having to prove himself at lower levels and facing setbacks before securing a move to Liverpool in 2020. He went on to win English soccer's three major trophies during his time at Anfield.\n“I was still paying to play football when I was 16 years old,” Jota said in a discussion at Web Summit in 2020.\nHis passion for soccer was developed at an early age. As a boy he would cry while pleading with his father to let him play rather than attend swimming classes that clashed with practice sessions.\nFrom Gondomar he joined unheralded Portuguese team Paços de Ferreira before a move to Spanish giant Atletico Madrid looked like being his big break.\nIn a way it was, but the transfer did not work out as expected.\nJota never played a competitive match for Atletico but was sent on loan to Porto and then Wolverhampton Wanderers, where he would make his mark in England and eventually earn the attention of Liverpool.\nWolves was a second-tier team when Jota arrived on a season-long loan in 2017 and reunited with Nuno Espirito Santo, who coached him during his stint at Porto the previous season.\nJota had clearly made an impression on Nuno — scoring nine goals at Porto — and he repaid the coach's faith by doubling that figure as Wolves topped the Championship and won promotion to the Premier League in his first year.\nThe goals kept coming. Ten after making the step up to England's top flight — the most popular league in the world — and 16 the season after.\nSoon Liverpool, which had just won the title, came calling.\nJota said it was “impossible to say no” to the move worth 41 million pounds ($56 million).\n“All of my path since I was a kid and now, to join a club like Liverpool — the world champions — is just unbelievable,\" he said.\nManager Jurgen Klopp accepted the then-23-year-old Jota was “far away from being kind of a finished article” but had “so much potential.”\nWith an established forward line of Mohamed Salah, Sadio Mane and Roberto Firmino in front of him, Jota had his work cut out just to get playing time in the 2020-21 season.\nBut Klopp told him what was expected now that he was on the big stage at Anfield.\n“He was clear. I was there to challenge the front three not to be happy with being a substitute player who comes on,” Jota said in an interview with Sky Sports. ”Playing with the best makes you better so I knew that I would increase my level as well and that would help me get into the team.\"\nHe certainly did that.\nHe made an almost immediate impression — scoring eight minutes after coming on for his Premier League debut for Liverpool in a 3-1 win over Arsenal. There was a hat trick at Atalanta in the Champions League and further goals against other big rivals like Manchester United.\nA total of 13 goals in his first season was a solid return — even if Liverpool surrendered its title.\nHe bettered that with 21 the following year as Liverpool won the FA Cup and English League Cup and finished runner-up in the Premier League and Champions League.\nThe Premier League title eventually came last season and Jota's winning goal against Everton in April — his last for the club — was a crucial one in pushing Liverpool toward the trophy.\nIn all, Jota scored 65 goals in 182 games for Liverpool.\nHe followed the Premier League title with triumph in the Nations League with Ronaldo in June — the second time he won the trophy, having previously lifted it in 2019. He was capped 49 times by his country and scored 14 goals.\nAfter the Nations League final, he posed for photos on the field, beaming proudly as he held the trophy.\n“Just three weeks ago, I had the honor of presenting Diogo Jota with a medal after the UEFA Nations League final — a moment of joy, pride, and celebration that will now forever be burned in memory with sorrow,\" UEFA president Aleksander Ceferin said. “His passion, energy and spirit on the field inspired everyone around him. It is devastating to think that a life so full of joy and potential has been taken far too soon.”\nTo add to a momentous few weeks, Jota also recently got married to his long-term partner and mother of their three children, Rute Cardoso in a ceremony on June 22.\n“Yes to forever,” his wife wrote in a social media post along with pictures from their wedding day.\nKlopp said he was “heartbroken.\"\n“There must be a bigger purpose! But I can’t see it!,” he posted on social media. \"Diogo was not only a fantastic player, but also a great friend, a loving and caring husband and father!\n“We will miss you so much!”\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 1036,
  "scraped_at": "2026-02-14T01:52:26.326162",
  "_text_extracted": true
}