{
  "article_id": "f6956f8c3335",
  "url": "https://thepeoplesperson.com/2024/09/14/manchester-united-pull-out-of-deal-to-sign-free-agent-adrien-rabiot-285466/",
  "title": "Manchester United pull out of deal to sign free agent Adrien Rabiot - Man United News And Transfer News",
  "date": "20240914T231500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United overcame a jittery start to end up returning to winning ways with a 3-0 victory over Southampton at St Mary’s Stadium on Saturday.\nThe visitors had Andre Onana to thank for keeping the scores level after he saved a penalty which the hosts had won after a period of intense early pressure.\nThe Red Devils scored twice in a six-minute spell through Matthijs de Ligt and Marcus Rashford before Alejandro Garnacho netted a late third.\nErik ten Hag decided to bring in Christian Eriksen for his first start of the season in place of the struggling Casemiro while Manuel Ugarte came on to make his debut in the second half.\nMidfielder needed\nWith the Brazilian set for an exit as early as January and the Dane’s ageing legs, the 20-time English league champions look short on numbers and are an injury away from crisis.\nThat is exactly why there has been a lot of talk about a move for free agent Adrien Rabiot who has already rejected lucrative moves to Saudi Arabia and Turkiye in a bid to earn a move to the English top-flight.\nHowever, his massive wage demands were proving to be a major obstacle for the Old Trafford side to overcome and now Football Insider have claimed that the three-time Champions League winners are unlikely to sign the Frenchman.\nThe report further adds that the player’s camp has been demanding a humongous signing-on fee which was unlikely to be accepted by any English side.\nRabiot unlikely\n“Man United are unlikely to make a move to sign Adrien Rabiot despite his availability on a free, sources have told Football Insider.\n“Question marks have risen over the wage demands and additional pay packet the midfielder is requesting as part of any deal. Clubs have been put off a move for his signature due to the request for a large sign-on fee, which has played a large part in why nobody has snapped him up as of yet.”\nThe former Juventus star’s versatility and winning mentality would have been a huge boost for Ten Hag but his current fitness levels are quite poor and any suitor would have to wait quite a while for the midfielder to get match-fit.\nUnited were close to signing the former Paris Saint-Germain star but for wage demands to stall the deal. And two years on, another move seems to be fizzling out.",
  "word_count": 400,
  "scraped_at": "2026-02-14T01:49:08.094828",
  "_text_extracted": true
}