{
  "article_id": "f6aa4fb9fa7c",
  "url": "https://www.france24.com/en/live-news/20230526-dortmund-bayern-on-knife-edge-as-german-title-race-goes-to-wire",
  "title": "Dortmund , Bayern on knife - edge as German title race goes to wire",
  "date": "20230526T050000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dortmund and Bayern on knife-edge as German title race goes to wire\nBerlin (AFP) – Borussia Dortmund are on the brink of breaking Bayern Munich's decade-long stranglehold on the German championship, with their title-deciding match against Mainz on a nerve-shredding final day of the Bundesliga on Saturday.\nIssued on: Modified:\nStar-studded Bayern have had the title in their bag well before the end of previous seasons, but this time, their slip-ups and Dortmund's persistence are keeping the suspense going to the final whistle.\nEuropean spots are also up for grabs alongside one of the tightest relegation battles in recent memory.\nAt the top of the table, Dortmund know a win over mid-table Mainz will secure their first Bundesliga title since 2012, while Bayern can claim their 11th straight Bundesliga title with a win at Cologne -- but only if the leaders slip up.\nDortmund coach Edin Terzic called on his side not to lose focus, with one game to play.\n\"We're not done yet, but we're ready to take the final step,\" Terzic said, \"As a team, as a club, as a city.\"\nTerzic was called \"the best Dortmund coach since Jurgen Klopp\" on Thursday by Germany's Sueddeutsche Zeitung newspaper, putting the 40-year-old ahead of Bayern boss Thomas Tuchel, perhaps a sign of how far the former Chelsea mentor's stock has fallen since taking the job.\nBayern have closed ranks ahead of a week which could see them go trophyless for the first time since 2011-12, but veteran Thomas Mueller called on fans to \"stick together for one more week\".\nWriting on Instagram, Mueller -- who has been a key part of the Bayern team that has won the last ten Bundesliga titles -- told his 12.8 million Instagram followers \"everything is still possible\".\nFurther down the pecking order, one of Union Berlin or Freiburg will join RB Leipzig in the Champions League for the first time.\nLevel on points, Union hold a slight advantage on goal difference and can all but secure a top four spot by beating Werder Bremen at home, where they have not lost a league match this season.\nUnion manager Urs Fischer said \"there's a lot at stake in this game\" but urged his side to \"stay relaxed, otherwise we'll cramp up.\"\nGuaranteed at least fifth and a spot in the Europa League, Freiburg face a slightly tougher task if they want to overtake Union and claim a first Champions League appearance, travelling to Eintracht Frankfurt.\nDespite lifting the Europa League trophy almost exactly 12 months ago, Frankfurt have only a slight mathematical chance of a return to European football, needing a big win while hoping both Wolfsburg and Bayer Leverkusen lose.\nAt the other end of the table, while last-placed Hertha Berlin's return to the second division after a decade was sealed last week, any one of four clubs -- Schalke, Bochum, Stuttgart and Augsburg -- could join them.\nSchalke likely have the toughest challenge, travelling to face Leipzig, while Bochum host Leverkusen and Augsburg visit Borussia Moenchengladbach.\nThe third-last side escapes the automatic trapdoor to the second division but must play a two-legged relegation playoff against the third-best side in the second division.\nOne to watch: Jude Bellingham (Borussia Dortmund)\nBorussia Dortmund midfielder Jude Bellingham is in a race against time to be fit for Saturday's title-defining match against Mainz, in what may be his last game for the club.\nBellingham missed Dortmund's 3-0 win away at Augsburg on Sunday with a knee issue, only the second game the English teenager has missed in the past two seasons due to injury.\nDespite a contract which runs until 2025 at Dortmund, he is being courted by Real Madrid and Manchester City.\n\"I feel good\" Bellingham said on Wednesday, but sporting director Sebastian Kehl revealed the midfielder was sticking to an \"incredibly ambitious\" regime to return to the pitch.\nManager Edin Terzic said on Thursday Bellingham would \"definitely be in the squad\" but was still working hard to make the starting XI.\n\"We hope that the diligence he has shown will be rewarded.\"\nKey stats\n4 - After just one goal in his previous 14 games, Bayern's Serge Gnabry has hit form, having scored in each of his last four games.\n23-4 - Dortmund have scored 23 and conceded four in their past five home games (all wins).\n16 - Bremen striker Niclas Fuellkrug has the league's most goals this season with 16 -- the lowest total since the Bundesliga was founded in 1963.\nFixtures (all times Saturday 1330 GMT)\nBorussia Dortmund v Mainz, Cologne v Bayern Munich, Bochum v Bayer Leverkusen, Union Berlin v Werder, Wolfsburg v Hertha Berlin, RB Leipzig v Schalke, Eintracht Frankfurt v Freiburg, Borussia Moenchengladbach v Augsburg, Stuttgart v Hoffenheim\n© 2023 AFP",
  "word_count": 793,
  "scraped_at": "2026-02-14T02:00:19.993065",
  "_text_extracted": true
}