{
  "article_id": "f6abfe8f7ebc",
  "url": "https://bleacherreport.com/articles/10111980-top-winners-and-losers-after-wednesdays-champions-league-round-of-16-leg-2-results",
  "title": "Top Winners and Losers After Wednesday Champions League Round of 16 Leg 2 Results",
  "date": "20240306T231500Z",
  "domain": "bleacherreport.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Featured Video\nHarper's Rising Stars Game-Winner 🔥\nTop Winners and Losers After Wednesday's Champions League Round of 16 Leg 2 Results\nManchester City and Real Madrid joined Bayern Munich and PSG in the quarterfinals on Wednesday, with the former drawing 1-1 with Leipzig to advance 2-1 on aggregate, and the latter stomping Copenhagen 3-1 to advance 6-2 on aggregate.\nBelow, we'll break down the day's top winners and losers.\nWinner: Real Madrid's Young Stars\nJude Bellingham (20) and Vinícius Júnior (23) are two of the top young stars in the world and catalysts for Real Madrid's success, so it was no surprise that the pair combined for the goal that ultimately moved Real Madrid past RB Leipzig.\nThis is still a club with a lot of talented veterans, but Bellingham and Vini move the needle more often than not for Real Madrid these days. They proved it again on Wednesday on a night when Los Blancos didn't play up to their usual standard.\nLoser: RB Leipzig's Major Trophy Aspirations\nIt's been a rough season for RB Leipzig.\nSince winning the DFL-Supercup over Bayern Munich, Leipzig was eliminated in the second round of the DFB-Pokal—a competition they won twice in a row before this season—have stumbled to fifth on the Bundesliga table and now are out of the Champions League after the Round of 16.\nFinishing was not Leipzig's friend on Wednesday:\nThere will be no major trophies for the club this season, with Leverkusen holding a 20-point advantage over them in the Bundesliga and running away with that title. Leipzig are now in a fight just to return to the Champions League next season. All in all, a disappointing year for the club.\nWinner: The Premier League\nThe Premier League is often cited as the deepest and most competitive league in world football, so it was something of a surprise when only Manchester City and Arsenal advanced to the knockout phase. Failing to advance any teams past the Round of 16 would have been an abject embarrassment in England.\nCity—bolstered by an incredibly favorable draw—ensured that wouldn't happen by smacking around overmatched Copenhagen, and if Arsenal are able to overcome a 1-0 deficit to Porto on aggregate, the EPL will have a more respectable 25 percent of the field in the quarters.\nThe defending champions are certainly a threat to win a second consecutive title, and with an incredibly close title race forming a the top of the Premier League, the success of City's season may hinge on its UCL campaign.\nLoser: UCL Underdogs\nThus far, the UCL knockout phase has been all chalk, with Bayern Munich, PSG, Manchester City and Real Madrid advancing. If you love a good underdog, this has not been your week.\nGranted, clubs like PSV and Porto could balance those scales somewhat next week. But it's also possible that heavy hitters like Arsenal, Borussia Dortmund, either Barcelona or Napoli and either Inter Milan or Atlético Madrid will be joining the quarters.\nFor neutral fans, that has the makings of an epic clash of titans for the rest of the tournament. But hey, who doesn't love a good Cinderella story here or there?",
  "word_count": 527,
  "scraped_at": "2026-02-14T02:17:27.961288",
  "_text_extracted": true
}