{
  "article_id": "f6cbbc8f531e",
  "url": "https://www.teamtalk.com/news/man-utd-legend-nemanja-vidic-names-his-top-five-current-premier-league-centre-backs",
  "title": "Man Utd legend Nemanja Vidic names his top five current Premier League centre - backs",
  "date": "20241022T224500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd legend Nemanja Vidic names his TOP FIVE current Premier League centre-backs\nLegendary Manchester United defender Nemanja Vidic has named who he believes are the current best top five centre-backs playing in the Premier League.\nVidic is widely regarded as one of the best central defenders to have played in the Premier League era, having won five titles and a Champions League during his time playing under Sir Alex Ferguson at Old Trafford.\nSpeaking in an interview with CGTN Sports Scene, the 43-year-old picked out his top five current defensive standouts and, unsurprisingly, there wasn’t a Man Utd name to be found.\nVidic named Arsenal pair William Saliba and Gabriel Magalhaes as his first two options, while also picking Liverpool’s Virgil van Dijk, Manchester City skipper Ruben Dias and Tottenham’s Mickey van de Ven to round off the list.\nThere can certainly be no arguing over Van Dijk’s place in that list, with the Anfield star establishing himself as arguably the best centre-back of the current English top-flight era, winning six trophies in that time. Dias, meanwhile, has played a big part in City claiming nine trophies over the last four campaigns – including four Premier League titles in a row.\nSaliba and Gabriel are the best pairing in the league on their day, having guided Arsenal to back-to-back runners-up spots in the Premier League behind City. They are also major weapons from set-pieces, particularly Gabriel.\nDutchman Van de Ven, meanwhile, set the record for the fastest player in Premier League history in January as he clocked a speed of 37.38 km/h during Tottenham’s clash with Brentford. His rise continues to be a rapid one, in more ways than one.\nA strong list for sure and one which will almost certainly include City left-back Josko Gvardiol when the incredible Croatian talent eventually transitions to that position in the not-so-distant future.\nREAD MORE ➡️ Premier League Signings of the Season Power Ranking: Arsenal star 6th, Tottenham striker 7th…\nVidic opens up on early Man Utd struggles\nMeanwhile, Vidic has revealed how he needed to adapt to the difficulties of facing different Premier League strikers following his £7million switch from Spartak Moscow to United back in January 2006.\n“You have to adapt and change, if you go to Italy it’s not the same football,” Vidic said in an interview with his former United centre-back teammate Rio Ferdinand.\n“If you expect always that players will adapt just to your game, like Berba [Dimitar Berbatov], because Berba believes people should adapt to his game because he understands the way he’s playing is the best way to play.\n“That was the issue for him, the players didn’t like that he always wanted the ball to feet and he would pass for people to run behind, but sometimes players would tell him to run. Sometimes you have to do both, to be accepted to the group you have to do both things.\n“When I came obviously I had an issue with not playing in Europe on a big stage, I played in Russia so people didn’t know about my game.\n“I didn’t start well, so I had to adapt, to train hard, to find my way, to pick up my confidence, first pass, header, slowly you win.\n“I was watching the games of the teams I would play in the next match to prepare because I didn’t know many players I was playing against. One game I would have Berba, who I know who would never run behind, then you have Peter Crouch, then you have fast players like Craig Bellamy, it was every game I would have a different player.\n“If you play in Italy more or less you have similar players, you have a No.9 who is going to come to the ball or run in behind, more tricky players, so I had to learn all players and try to understand the way they’re playing.”\nLatest Man Utd transfer news: United have eyes on Araujo deal talks / shock Zirkzee exit\nManchester United and Chelsea are still reportedly monitoring the contract talks of an outstanding Barcelona centre-back as they weigh up moves in 2025.\nUruguay international Ronald Araujo is the player in question, with the Premier League pair keen on Araujo and ready to make significant moves if there is no progress over contract talks over the next few months.\nMeanwhile, unhappy United summer signing Joshua Zirkzee is already reportedly plotting to leave the club in the January transfer window, with Italian giants Juventus weighing up a move for the player.",
  "word_count": 758,
  "scraped_at": "2026-02-14T01:57:46.243879",
  "_text_extracted": true
}