{
  "article_id": "f6d56b338f77",
  "url": "https://www.liverpoolfc.com/news/final-interview-jurgen-klopp-nine-incredible-years-anfield-connections-future-and-more",
  "title": "The final interview : Jürgen Klopp on nine incredible years , Anfield , connections , the future and more",
  "date": "20240519T103000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Q&AThe final interview: Jürgen Klopp on nine incredible years, Anfield, connections, the future and more\nIn a special final interview, Jürgen Klopp detailed why he will depart Liverpool with incredible fulfilment and a forever-lasting bond with the club, its supporters and the city.\nThe boss welcomed Kelly Cates into his office at the AXA Training Centre for a comprehensive review of his memory-filled journey in charge of the Reds since arriving in the autumn of 2015.\nWatch their wide-ranging chat in the video below, or you can read on for a summary…\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeHow do you feel about the connection you have created with the club and the people here?\nIt's super-special. We all felt at home, we all felt welcomed. That's what we all felt from the start, that's the special thing about the people in this area, Scousers, it's really special. We felt supported, we felt loved, we felt everything. And yes, we delivered as well in moments and we always fought. That again is what the people expect. It was the biggest win-win situation I ever saw and experienced in my lifetime because nothing would have happened without the people here, and maybe not exactly the same would have happened if somebody else would have been in charge.\nIt fitted like a glove from the first day until today, and that's why it's so tricky and emotional to say goodbye, even knowing it's 100 per cent the right thing to do. Probably meanwhile a lot more people see it the same way than in January when I announced it. And I'm really happy that we put this team on the rails and now somebody else will come in and help them to make the decisive yards.\nWhat is it like to experience that rocking atmosphere at Anfield from the dugout, especially when there's a big game or European night?\nOutstanding, it's just the best you can get. When you dream as a kid of playing on the highest level, or then when you're an adult player and want to dream of coaching on the highest level, you dream of big occasions. But you cannot dream of something like that because it's unreal. Then you arrive here and people make it real, that's absolutely special.\nIt's really difficult to describe. I'm not even sure the problem is that I'm not native, it's just difficult to describe. You have to experience it. We all had it and we all know the influence and impact it has. We all know what the Kop can do to a game, we all know what Anfield can do to an opponent. But it has to be equal to the performance; Anfield without a good team is not exactly the same like Anfield with a really good football team.\nFor a long period we were maybe one of the best teams in Europe, between 2018 and 2020, maybe we were the best team in Europe. That felt exceptional. And only the last part was obviously without supporters, before that it was with supporters and there we really showed what togetherness can do to yourself. That was absolutely outstanding. I will never forget that, nobody will ever forget it.\nIt's like, you walk out and they sing You'll Never Walk Alone and it's never the same, never ever is the same. I don't know how many home games I had, 200-something, and it was not one time the same. It's always special, and that's only because of the people.\nYour ability to respect history while at the same time writing your own pages in it – did you find that a difficult balance or was it something you set out to do?\nNot at all. I don't know exactly why nobody said it before, to be honest, but for me it's completely common sense. I love football history, I'm a football romantic. I love players from that time but we cannot do what they did, for plenty of reasons. It's just not possible. History is wonderful to think about and if history can push you, use it. If history holds you back, keep it aside. That's what I said on the first day: we cannot carry it in a backpack with us. The people cannot constantly compare this Liverpool team with better teams from the past, because how will [this] one make the next step? Again what I said on the first day: nobody likes the team, not even the team likes the team! That's a really crazy situation.\nI came in and I was the only guy in the room who loved the football team we had. It was one of the reasons why I signed for Liverpool, because I really liked a lot of players. I didn't know all of them perfectly but I knew enough to say, 'That's a start.' That might have been the start for absolutely everything and I enjoyed all the steps we had to make. We learned so much. How patient the people are in a really not-very-patient world when they see a development in the right direction, then they don't ask for step three and four immediately, then they are ready to make all the necessary steps. And that's what we learned and what I hope the people will keep, because the future is bright but there's still work to do obviously.\nYour 'doubters to believers' comment seemed to frame so much of those early days…\nI had a few interviews in my life and this is the most difficult moment: 'What kind of message do you have to the public?' And it came up in that moment, 'We have to change from doubters to believers.' Next day was the press conference, I said it again there, and it was obviously the start for something special. I would love to say I planned it but I didn't, it just came out.\nBut it was that framing that led to moments like the game against Dortmund with a late winner. There were so many incredible moments over your time…\nWe had to grow together again, that's clear. Maybe [I] mixed up the games a little bit, it could have been the Crystal Palace game, stuff like this, not a great game, I think we drew it. But when I turned around, people left the stadium like 15 minutes before the end of the game and I thought, 'Eh, that's strange.' So, the press conference after the game and obviously I'm not shy of saying what I think – that was always like that. I don't want to offend anybody but if something is not right... in 15 minutes or even in five minutes you can score three or four goals, it's possible. But if we give the sign from the outside that we don't believe in that anymore, how could the players – they are young people, they have 80 minutes in their legs, they breathe like old horses, it's really intense – and then all of a sudden the people tell me, 'I don't think he will do that.' How will that work?\nA few weeks later, or maybe two weeks later or one week later, West Brom, late equaliser, as far I saw it, the people were still there and we said thank you. That was one of the biggest misunderstandings in public because I think Tony Pulis at that time said, 'Well if Liverpool celebrates a draw against West Brom like that, what's going wrong in the football world with the money they spend?' We only wanted to say thank you, not celebrating that we drew against West Brom. We wanted to say thank you. And again, that was another important step. It was not the purpose in the sense of, 'Come on, we have to do this and that to bring the people.' It was just the honest thing to do, what we felt – thank you for supporting us until the last whistle, thank you. Then step by step, we arrived there.\nOf course, we all need these special moments like the Dortmund game where we turned it around late, incredible atmosphere and all these kind of things. In the early stages when we were 1-0 up, the people were with each pass we didn't play forward, they were like, 'We will concede.' So, we had to go through all the things. Then we had the year when we were always leading or winning and then we conceded equalisers because we couldn't control the game well enough. So we started controlling the game, that cost us a little bit exciting, attacking football – but we came back to that.\nSo, we made all the necessary steps. But usually – and that's the special thing in football – you don't get the time for that. I don't know exactly what the people thought at that time but I know what our owners thought, they were completely calm and didn't get nervous. That gave us the time to create a really special football team – and, in my opinion, we did that again. How I said, steps to go, but again we have a pretty special squad here and they deserve a manager on the top of his own game and that's what they will get.\nDo you think that the emotional side of the game sometimes overshadows the technical improvements and the brilliance of what's going on the pitch?\nI have actually no clue how the outside world sees us. It's not overshadowed for me and I learned now how that might be in the outside world. It's a mix of everything. We don't have to make football bigger than it is. This moment, I'm going, I'm leaving and it feels like it's the most important subject in the world. But the world is still a pretty crazy place and me leaving Liverpool should not be in the eight o'clock news, let me say it like that. But I understand 100 per cent we have to do it properly and we do that. But if football would not be emotional, we don't have the right to exist really. If you want to watch something different then you have to watch something different, you cannot watch football then. But you should not play football if you are not ready to throw absolutely everything in.\nOn the level we play, [for] so many people in the world it means the world to them during these 90 minutes, so we have to give our all. And to give your all without emotions, it's absolutely not possible. You cannot be always controlled and pass the ball here and pass the ball there and chip it over him – that doesn't work like that and that's what I love the most about the game. It's the mix of all these pieces, like tactical things, like physical things, like emotions and all these kind of things. That makes football so super-special. And the people here see football as kind of a mirror of their life. So, we don't have the best circumstances, we don't have the best upcoming, we have struggles here, difficulties here, but when we are together we can conquer the whole world, and that's what we want to do and what we want to see.\nWith what we achieved in the last nine years, if you talk about Liverpool in the outside world, they know Liverpool for the right reasons again. Maybe 10 years ago people would have said in America, 'Where are you from? Liverpool? Oh, you used to have a good football team.' So, now maybe they said for the last nine years, 'Wow, you have a really good football team.' It's cool, it's cool to do that for the people. So wherever you go, 'Oh, LFC, really good football.' These kind of things, that's the job we have to do. We are kind of the ambassadors for these kind of things to the outside world because it's such a massive club. So, we have to do well and we did as well as we could, I would say.\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeThere's the trophies to back it up. A first league title in 30 years. When you look back and you think about your time here at Liverpool, nine years and it's gone so quickly – but 30 years before there was another title. You and the players managed to deliver that in the most incredible circumstances...\nWe did, we did. Super-special. I can see it like that – this is super-special. And I'm fine with one Premier League title. I look back already, I don't regret these kind of things but it could or maybe should have been more. That's the truth as well. I understand that for you as well that people say, 'But here you should have done better.' The thing is just we gave our all, so where can you start changing? I know we gave absolutely everything and it led us to one point behind the other team. There was nothing to criticise.\nIt's like you run a marathon and you don't win it and you think, 'It killed me at the 12th, I had one mis-step and it cost me the race.' It didn't. You could have caught up 12 times after that, it depends how you deal with it. And we dealt with all the setbacks really well and some of them were not in our hands, we had nothing to do with that. We played three Champions League finals, which is absolutely insane. Before that, we didn't qualify for a while. So, I know all that. But then arriving at the final and not getting silver medals in football – you get a silver medal actually but it's not great.\nDo you even know where your runners-up medals are?\nOne of them is actually with a friend of mine. If I'm honest, I gave it to him and I thought he will not take it but [he did]. I have another one from Dortmund. I have a collection of silver medals!\nAnd you have a winner's medal...\nExactly. That makes all the difference. The difference between losing a final and winning a final, my English is really not good enough to describe that. It's worth all the effort. But we were not the favourites to go wherever we went in the end. Nobody said before the Champions League, 'Liverpool will definitely be in the final.' We qualified [for the] first time through the qualification play-offs and went to the final and lost it in the most strange circumstances, I would say. I don't think a lot of people said, 'Oh, they have another chance next year.' We thought, 'We go again.'\nThe special thing about the story is we don't become [Premier League] champion pretty much a day before the semi-final in the Champions League. A goal from Vincent Kompany and you deal with that. And again, it's the Liverpool way – another knock, we are used to that, get up and go again. And we went again and played one of the most extraordinary football games of all time against Barcelona. So not becoming champions finally at the weekend and then in three weeks' time we win the Champions League final, it's absolutely crazy. All these things are so special and some will see it as exceptionally successful and some will see it [as] we didn't win enough. What I can say, both might be right but we cannot change it anymore. Take it or don't take it, I cannot help you there.\nYou talk about the 'Liverpool Way' and the city itself and the people. Do you understand why the comparisons have been made between yourself and Bill Shankly?\nNo, that's too big... there's no chance to really get the phrase where my name is used in the same phrase as Bill, Bob [Paisley] [or] Kenny [Dalglish]. It just doesn't get down. It's different levels. I understand, I wasn't there obviously... Bill, I'm 100 per cent sure he was a great guy, fantastic, but 100 per cent you look back and he gets glorified. A perfect human being, everything right, socialist, great with people... and that's what's happened with me now. I am who I am. A few things are better and other things are worse but because I was here when people were really not happy. We, all together, re-energised the club; 100 per cent. It was not a great place. How I said, people didn't like the team, the team didn't like the team. We create incredible atmospheres. We are where we belong 100 per cent again. And I was the manager of the team when that happened, so I understand that people bring that together with me.\nBut now when we had the farewell with the players they tried to really prepare. Wonderful, all the trophies we won were there and the little stage and I said goodbye to the whole coaching staff. On the stage was only Jürgen Klopp and I said as we do that today absolutely describes you as a team the best. The character and all these kind of things. Why is it Jürgen Klopp? Seven, eight people [also] leave. And I just want to make sure I know what they did. You know what they did, so don't make it about me. But that's the world we are living in. I understand.\nMy big strength is [to] bring people together who are really good at what they are doing. I'm not too bad as well, I know that, but that's my biggest strength. We had the perfect coaches, the perfect staff and all these kind of things. That's what we create over nine years and that's why the boys could deliver on the pitch like they delivered. I know exactly my impact and stuff like that and I'm happy with that, that we brought the club back to where it belongs. But obviously being in the same phrase with the three other fellas, it's really tricky. I cannot get that really.\nTell me about the team that won the Champions League and the Premier League after decades of waiting for Liverpool fans...\nThe good fun about it was that we had a good team when I arrived. They got to a Europa League final and people go back; he wasn't good enough, he wasn't good – they qualified for a Europa League final! We played incredible games. Would we have been champion years later with this team? No chance. But for that time, it was the team. A good team. But we had to change it step by step and we did. Players coming in, and I always talk about this, rightly so, Ali [Alisson Becker], Virg [van Dijk], Mo [Salah], before that Sadio [Mane], incredible player, Gini Wijnaldum, incredible player. Andy Robertson, incredible. Fabinho, incredible player. Joel Matip, incredible player.\nSo many things that we had to put together, in the end we created a specific way of football. Did we invent the false nine? I don't know. Probably Bobby Firmino invented it! But did we invent being a striker with Sadio and Mo? I'm not sure. But we used it in a very special way. We created the most offensive full-backs. We played an incredible high line. Rightly so, which leads then always to if you concede a goal then the line is too high from your colleagues [pundits]. Love that! You create that and it leads to the midfield doesn't score often enough and you just think, 'Oh my God.' Yeah, they were right, midfield doesn't score often enough. Absolutely right.\nBut step by step, piece by piece we put a team together who became a machine. My idea always was [that] I want to be the coach who can beat the best. In moments I like to be the best team but actually that's a moment. I want to always be ready to beat the best. That's the team I want. I want to be the coach of a team who nobody wants to play against. For the reason that we go for them... in a real fair way. I don't want to kill them. I don't want to jump into them... I want to be all over them for winning the ball and not for giving free-kicks away and we were that team for a pretty long time.\nIn that period while we were building that team we were, I'm pretty sure, five times in a row the fairest team in England. Four times the fairest in Europe. There was not a headline or nothing. For me, [that's] super-important, for the outside world rather maybe if you'd have been a bit more dirty, you'd have won more. But we did it in a proper way. The proper way for me is the Liverpool way. We don't have everything, but we can still fight for everything. That's how it is.\nThat's what we always tried and, how I said, I don't know how many games we won and these kind of points we had. The points tally is crazy. That was a real machine nobody wanted to play against and whenever you would've woken them up they would've gone for you and for each other and stuff like this. Through the fire! That was absolutely outstanding and then you have to rebuild them and do it again and that's what we did. Then players get older and get used to things and don't defend as much anymore. They are still the same players, but you cannot keep everything up for four, five, six years. So, you have to make changes. Sometimes you make them too late. Yeah, somebody scores 20 goals a season and you turn around after the season and sell him because next year he will only score 10. That would be a great situation. It's tricky to stay successful. But we were always around and again I wouldn't be at peace with it if I could've done more. I couldn't have done more. Could I have done better? Yeah, of course, but only knowing today at the time. No, but that's all I knew at the time.\nYou've been able to choose when to leave your role three times in your career at Mainz, Borussia Dortmund and now Liverpool. Surely that speaks a lot to what you've managed to achieve at those clubs… but what is the point for you where it changes and you want to leave?\nThey're all different reasons. You cannot compare them. Mainz was obviously the first time in the not-so-great history of a wonderful club we got promoted. [We] stayed three years in the Bundesliga and got relegated. I could've gone everywhere in the Bundesliga to each [of the] other clubs but decided, 'No, I want to stay.' I wanted to get promoted again, we didn't, we came fourth and it was clear that we are all ready for a new start. The club needs a new start and I need a new start. That was the reason there. [I was] not tired or not strained or whatever, [I was] just ready for a new challenge and came up to Dortmund and [you] do what you do.\nI would say we squeezed out pretty much everything. [We] lost every year players and important players, which is really hard. You become champion and people expect you to become champion again, but they buy the best players. Tell me one team in the world where you become champion and they buy the best players off you, the other competitor in the league. City becomes champion and United buys four players off City and then City has to become champion again? That is really intense. It's really intense because you have your own expectations.\nFirst you have the disappointment that you cannot keep the players and the ambition to go again and then realise it's not immediately possible. So, you become second, which is fine, but with 15, 16, 17 points behind the other team. It was hard. At one point I felt, that's the similar part I felt, if there's now two opportunities, well it's not similar, but maybe not the right one anymore, or we have to change the team a lot. You couldn't do that for financial reasons or whatever. You cannot just put seven players out and say buy six and there's no market for the other seven and stuff like this. It was a clear decision for the club in saying, 'OK, this is a fantastic team.' Just with the combination with me it would be necessary to change something. It's not possible, so I leave. Fine.\nI was ready for a new challenge. I had a little break and came here... I fell in love with the club and the city pretty quickly. My responsibility grew every day, feeling the responsibility. The actual responsibility grew as well but the responsibility I felt for the people I work with and for the people I don't even know, I just know they're here in the city, [it] grew every day.\nThere was a day, a week, two weeks, three weeks, when I realised I can't do it anymore. A football season... you play the season while you play the season, but you plan the next season. It's not that you talk about it but it's constant. I used to watch players we signed two years later two years before, watching them, you follow them, have a look... you speak to them and that's how it goes. I didn't have the power to do it anymore. That's not possible. You cannot do it like that. I can't do that for a week and say, 'Come on. You can do it next week.' But it was not that we had no time. I just couldn't get up for it anymore. For me it was immediately clear, 'OK, here I have to stop.' I always said, in the moment I realise I am not the right manager for the club anymore I will tell [them] and that's what I did. Since then, I didn't have one doubt. There was not one second where I thought [about staying].\nI know some people might say that was too early. Since then, this and that happened. The alternative is I don't tell, or I get the sack. So, I don't tell, and we play Sunday the game [against Wolverhampton Wanderers] and after the game I have the speech and say that's it. That would've been for the club an absolute catastrophe. In this manager market right now, have a look, how many are available? We would say he's a good choice, or he, or he… but it's just too late. Again, coming back to responsibility. The responsibility is that I had to decide early, and the club needed to know early, and we need to announce early because in a world where you are living everyone is waiting for news like that and can we get it out. It would've been impossible to keep it under the carpet for that long and that's why we announced it and now we have to live with the consequence.\nSo what's the last thing you will officially do as Liverpool manager? Will it be when you walk out of Anfield on Sunday?\nNo, we have a party. People tell me I have a speech in the stadium. Then we have an event after the game – people tell me I have a speech there. I had a speech now, I had a speech yesterday, I had a lot of interviews. So after is the party and the speech and then a week after the last matchday there is a ceremony, I think – I will be there but I'm not sure you will call that an official whatever, and that's then probably the last time. But again, I don't see it like that.\nI will not be the manager anymore but in my mind – and it's really important and that's why I mention it so often – I stay the ambassador for the [LFC] Foundation, so I have to keep the key of the city and I don't want to take that lightly. I'm pretty sure the club doesn't need my help in the future but I might be able to help the city a little bit with a few things – with showing up, putting some attention on different things – and I would love to do that, to be honest. Not as a threat, but I'll be back!\nWhat about the future for the club? I think back to the League Cup final and those young players coming on and managing to lift the trophy. Does that make you optimistic for the future of the club?\nYeah, yeah. I told the boys it's an incredible squad. So we didn't make it but nobody has to be overly critical about that. It's a young team, we were unlucky with injuries and how players came back, a couple of things. There's nothing about the quality of the squad. The age group is fantastic, super-experienced players, world-class players, super-talented boys, positions twice everywhere. Yes, space for improvement if the club or the new manager wants to do that, for sure space for improvement here and there. But the quality what is there is absolutely outstanding, [the] character is really, really good.\nAgain, and I told the boys, everything is sad and emotional but it's good for them to hear a new voice, to get new sessions, different meetings – that's all good and opens up the mind and you can go with fresh legs again. I had players in my office in the last few days saying goodbye on a personal level, tears in the eyes, it's so wonderful. But I'm not in doubt about our relationship, not at all – it's fantastic, was fantastic all the time. But we cannot stay together just because we are used to each other. We must all constantly be pushing for the next step, and that's an important part of my job. I can give energy to other people but for that I need to have it myself, and that's not exactly like it was before. Maybe that will be different in a year or two or three, I don't know, and then we will see what happens. We will see what happens.\nDo you know what's next?\nHoliday. [The] Champions League final with Dortmund, I got invited, so we will watch that.\nBut is there anywhere you can go on holiday to completely switch off, to get away from all of this where nobody says, 'Jürgen, what about Liverpool?'?\nIt's not that I tried a lot, so I didn't have time. I had time but a summer holiday for me at least at the end of the season was like falling on the first available sunbed and having a phone here and talking to agents, sporting directors, stuff like that. Having no training sessions, yes, but the rest was pretty much still going on. So that means I didn't see one per cent of the world for nothing. Now we will do nothing, we will watch the Euros here and there, really looking forward to that and then holiday doing nothing and then the plan is start to travel and we will see how that goes.\nAnd being a husband, a father and a grandfather....\nOne hundred per cent. I can't wait to be that. It's all good. How I said, I can't wait for life, for the life after the career and now let's see what that means to me. People ask me, 'What are you [going to do?]' I just don't know. I never had it, so let's give it a try and then I tell you.\nThank you, Jürgen. I know you don't like the Shankly comparison, but you made the people happy...\nThat's good. That was the plan.",
  "word_count": 5386,
  "scraped_at": "2026-02-14T02:25:33.986103",
  "_text_extracted": true
}