{
  "article_id": "f7208e796a5b",
  "url": "https://www.firstpost.com/explainers/kash-patel-liverpool-fc-tie-fan-us-senate-hearing-13934481.html",
  "title": "What was Kash Patel trying to say with Liverpool FC tie at Senate hearing ? ",
  "date": "20250917T091500Z",
  "domain": "firstpost.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FBI Director Kash Patel wore a Liverpool Football Club tie during his appearance before the US Senate Judiciary Committee on Tuesday.\nThe unexpected wardrobe choice quickly drew widespread attention online, with many questioning why the head of America’s top federal law enforcement agency would choose to wear a tie bearing the logo of an English Premier League club during a high-profile congressional hearing.\nThe tie that caught our attention\nPatel’s choice of neckwear was immediately noticeable. The tie, which prominently featured Liverpool FC’s crest, was not a typical accessory for such a serious occasion.\nHigh-ranking government officials in the United States rarely wear ties displaying logos, whether from private companies, sports teams, or other organisations.\nAs soon as images from the hearing began circulating, users on X and other platforms seized on the unusual detail.\nSome online commentators responded with humour or sarcasm. “Kash Patel wearing a Liverpool FC tie to his senate hearing….very professional,” one user quipped.\nOthers were more direct in their criticism, with one person writing, “For his first-ever congressional hearing as the FBI Director, Kash Patel chose to wear a Liverpool FC tie. Is that patriotic for supposedly the top cop of America?”\nThe bewilderment was not limited to neutral observers. Even fans of Liverpool expressed discomfort with the choice, with one supporter joking that seeing Patel wear the tie made them “want to rip my eyes out.”\nRival football fans also joined in, with a Chelsea supporter mocking, “To everyone that thought something about @FBIDirectorKash Patel is off or wrong, we now have a definitive answer: he’s a Liverpool (@LFC) fan. @ChelseaFC forever #GoBlues.”\nThe tie itself is currently sold on Liverpool’s official online store and is known as the club’s “heritage tie.” It retails for approximately £15 in the United Kingdom.\nOn Tuesday, Patel wore a version with thinner diagonal stripes and a larger, more prominent club logo at the bottom.\nThis differs from an earlier Liverpool tie he has been seen wearing, which featured thicker stripes and a smaller logo.\nPatel’s history of wearing Liverpool ties suggests that his choice was not coincidental. He was first photographed wearing the thick-striped version on December 12, 2024, while visiting lawmakers on Capitol Hill shortly after Donald Trump’s re-election victory.\nAt that point, Patel was widely rumoured to be under consideration for a significant role in the incoming administration.\nHe wore the same tie again on April 9, 2025, during a press briefing highlighting a major federal operation that resulted in a large-scale narcotics seizure. By that time, Patel had already been appointed as FBI director.\nLater that month, on April 28, 2025, Patel himself posted an image on X wearing the tie, captioning it, “#YNWA… Liverpool PL Champs.. Our good luck tie.”\n#YNWA… Liverpool PL Champs ⚽️\n— Kash Patel (@Kash_Patel) April 27, 2025\nOur good luck tie pic.twitter.com/JbobqTpTnf\nThe post attracted significant engagement, garnering over 1.5 million views and more than 19,000 likes.\nThe phrase “YNWA” is shorthand for “You’ll Never Walk Alone,” Liverpool FC’s famous anthem and slogan.\nPatel’s public acknowledgment of the tie confirmed that his association with Liverpool is not accidental.\nThe timing of Patel’s choice to wear the Liverpool tie may have been intentional. The hearing took place just one day before Liverpool’s opening match of the 2025-26 UEFA Champions League season.\nThe club is set to host Atlético Madrid at Anfield on Wednesday.\nThe fact that Patel now appears to own multiple Liverpool ties suggests a deliberate display of support for the club rather than a one-off wardrobe decision.\nWhy Kash Patel supporting Liverpool FC might not be welcomed in Liverpool itself\nLiverpool FC is one of the most historically significant football clubs in England, with deep roots in the working-class culture of the city of Liverpool.\nThe club has long been associated with progressive values. Legendary manager Bill Shankly famously articulated Liverpool’s philosophy, stating, “I believe the only way to live and to be truly successful is by collective effort, with everyone working for each other, everyone helping each other, and everyone having a share of the rewards at the end of the day. That might be asking a lot, but it’s the way I see football and the way I see life.”\nLiverpool’s history also includes a tense relationship with law enforcement, particularly stemming from the Hillsborough disaster of April 15, 1989.\nDuring that tragedy, 97 Liverpool fans were killed in a stadium crush. In the immediate aftermath, police and authorities wrongly blamed the supporters, accusing them of hooliganism and drunken behaviour.\nSubsequent investigations revealed that the disaster was caused by severe negligence on the part of law enforcement and stadium officials. The findings also exposed a deliberate cover-up by authorities who sought to deflect responsibility by misleading the public.\nThis legacy has left a lasting sense of mistrust between Liverpool supporters and police institutions.\nFor Patel, who leads the FBI in an administration known for aggressive law enforcement tactics — including large-scale immigration raids and deploying federal agents to certain US cities — the visual contrast was stark.\nWhile Liverpool represents a tradition of scepticism toward state power, Patel symbolises the authority of the federal government.\nHow Kash Patel was grilled during the Senate hearing\nIt was Patel’s first official oversight hearing since becoming director of the FBI and came at a time of heightened scrutiny over his leadership of the bureau.\nThe hearing took place against a backdrop concerns about domestic violence motivated by the assassination of conservative political commentator Charlie Kirk, which occurred at a college campus in Utah just days before.\nThe FBI moved quickly in response to the killing, and Patel highlighted the agency’s rapid work in his opening statements. According to Patel, federal agents apprehended a suspect within 33 hours of the incident.\nThe suspect, 22-year-old Tyler Robinson, has since been charged with aggravated murder by Utah authorities.\nLaw enforcement officials have described Robinson as holding a “leftist ideology,” and Patel confirmed that investigators are “running out every lead related to any allegation of broader violence.”\nHowever, Patel’s handling of communications related to the case drew sharp criticism. Shortly after the assassination, Patel posted on social media that “the subject” was in custody.\nThat statement turned out to be premature, as the individual initially detained was later released when investigators determined he had no involvement.\nPatel defended his actions before the Senate, arguing that his intention was to keep the public informed.\n“I don’t see it as a mistake, I see it as something – working with the public to identify that there was a subject in custody,” he told the committee.\nPressed further, Patel admitted that his phrasing could have been clearer. “Could I have been more careful in my verbiage and included ‘a’ subject instead of subject? Sure,” he said.\nThe hearing quickly became combative, with tensions boiling over during exchanges between Patel and Democratic senators who accused him of politicising the FBI. The most dramatic moment came during a heated back-and-forth with US Senator Adam Schiff of California.\n“You are the biggest fraud to ever sit in the United States Senate, you are a disgrace to this institution and you are an utter coward,” Patel shouted at Schiff during one particularly intense confrontation.\nSchiff responded sharply, saying, “You can make an internet troll the FBI director, but he will always be an internet troll,” as the two men repeatedly spoke over each other.\nDemocrats pressed Patel on a range of issues, including whether he had retaliated against FBI employees perceived to be opponents of Donald Trump.\nUS Senator Sheldon Whitehouse of Rhode Island raised concerns about what he described as an “enemies list,” referring to individuals named in Patel’s 2023 book, Government Gangsters: The Deep State, the Truth and the Battle for Our Democracy.\nWhitehouse estimated that Patel had already taken some form of adverse action against 20 of the approximately 60 people mentioned in the book.\nAmong those reportedly facing scrutiny were former FBI Director James Comey and former CIA Director John Brennan, both of whom were central figures in the investigation into potential links between Trump’s 2016 campaign and Russia.\nPatel categorically denied the allegation, stating, “That is an entirely inaccurate presupposition. I do not have an enemies list.”\nPatel also dismissed accusations that he had directed the firing of FBI staff based on their involvement in previous investigations into Trump or the January 6, 2021, attack on the US Capitol.\n“The only way, generally speaking, an individual is terminated at the FBI is if they have violated their oath of office, violated the law, or failed to uphold the standards that we need them to have at the FBI,” he explained.\nRepublicans on the committee, meanwhile, offered Patel strong support. Senate Judiciary Committee Chairman Chuck Grassley praised Patel’s approach, contrasting it with what he described as the politically compromised leadership of Patel’s predecessor.\n“It’s well understood that your predecessor left you an FBI infected with politics,” Grassley said.\nAlso Watch:\nWith inputs from agencies",
  "word_count": 1499,
  "scraped_at": "2026-02-14T01:55:21.391204",
  "_text_extracted": true
}