{
  "article_id": "f744ce4ff263",
  "url": "https://www.teamtalk.com/manchester-city/ornstein-drops-huge-guardiola-resignation-update-major-man-city-rebuild-approved",
  "title": "Ornstein drops huge Guardiola resignation update , as Man City approve total rebuild",
  "date": "20241226T123000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nOrnstein drops huge Guardiola resignation update, as Man City approve total rebuild\nDavid Ornstein has provided an emphatic update on the future of Pep Guardiola at Manchester City after the club greenlit a mammoth squad rebuild.\nGuardiola is unquestionably one of the greatest managers in the game right now and perhaps of all time. He and his Man City side have been the dominant force in England since his arrival, winning six of eight Premier League titles including the last four in a row.\nHowever, Man City now find themselves in the unfamiliar position of seventh. With Ballon d’Or winner Rodri out for the season and an ageing squad looking well past its best, City are facing a scrap to qualify for the Champions League, never mind retain their title.\nGuardiola has looked powerless to prevent his side’s slide, with City winning just one of their last 12 games, nine of which ended in defeat.\nSpeculation over the legendary Spaniard’s future at the Etihad has begun to surface. The once-unthinkable notion of Man City sacking Guardiola has been floated, while talk of Guardiola stepping away just one month after signing a two-year contract extension has swirled\nBut according to trusted reporter David Ornstein, Guardiola remains as committed to Man City as ever and both a sacking or resignation are out of the question.\nWhat’s more, Ornstein revealed the club are primed to embark on a mammoth squad rebuild that Guardiola will oversee.\nWriting for The Athletic, Ornstein stated: ‘Despite City’s recent slump, manager Pep Guardiola is not going to be sacked and there is no suggestion he might walk away.\n‘He has recently signed a two-year contract and will have known a rebuild was required before committing to that deal.’\nWhich positions Man City will address in major rebuild\nOrnstein added: ‘Manchester City are expected to be active in the January market. Between the winter and summer windows, they intend to strengthen in defence, at No 6/No 8 and up front.\n‘It is premature to say who will be signed and in what order, but work is being done behind the scenes and conversations are now taking place with clubs and player representatives.\n‘Director of football Txiki Begiristain may be leaving City next summer, but he continues to lead the process, in conjunction with manager Pep Guardiola and other relevant personnel.\n‘City are in rude financial health and did not spend heavily last summer, so money is not an issue. That said, they will not want to spend for the sake of it and recruits of the level City would be seeking to bolster their first team are not easy to obtain mid-season.\n‘That means loans should not be discounted, although in an ideal world, they would likely favour younger players for the longer term ahead of older – potentially high-cost – stop-gap solutions.’\nAthletic contributor, Anantaajith Raghuraman, also added his take on where City will invest their vast resources.\nRaghuraman wrote: ‘City’s injury-riddled defence has been exposed when their midfield is bypassed. Their fit defenders, including Kyle Walker and Josko Gvardiol, have struggled.\n‘Similar to the 2017 summer window when Walker arrived, City need new left- and right-backs. A central defender who can lift the team like Ruben Dias did upon arriving in 2020 might be required, too.\n‘City also look blunt in attack. The defeat to Aston Villa, where they repeatedly launched passes to Jack Grealish with no return, underlined their struggles. Erling Haaland, despite scoring 13 goals, has had limited opportunities and virtually no support.\n‘City’s 2.7 big chances created per game is only the ninth-best figure in the league, due to Kevin De Bruyne’s fitness issues and Phil Foden’s drop-off, so their shopping list should perhaps include a creative midfielder and backup striker.\n‘The most alarming aspect of this is that it cannot all be resolved in one transfer window, so Guardiola will need to find in-house solutions along with any mooted signings.’",
  "word_count": 663,
  "scraped_at": "2026-02-14T01:58:00.742883",
  "_text_extracted": true
}