{
  "article_id": "f74a6e236a97",
  "url": "https://www.teamtalk.com/news/robert-lewandowski-barcelona-future-revealed-mls-saudi-links",
  "title": "Robert Lewandowski Barcelona future revealed amid MLS links",
  "date": "20240430T000000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Robert Lewandowski Barcelona future revealed amid MLS, Saudi links\nRobert Lewandowski reportedly has no intention of leaving Barcelona for the time being – despite being linked with a move to Saudi Arabia or the MLS.\nThe Poland international swapped Bayern Munich for Barca in the summer of 2022 in a £42.5million deal; ending a remarkable spell with the German giants where he scored 344 goals in 375 appearances, won eight Bundesliga trophies and the 2019/20 Champions League title.\nThe veteran striker has not been quite as prolific since moving to the Blaugrana but he has still found the net 53 times in 89 matches.\nWhile the 35-year-old’s contract has just over two years left to run on it, that has not stopped speculation that Lewandowski could be making a transfer exit this summer.\nDON’T MISS: Barcelona ready to swat Man Utd aside by handing centre-back sensation new deal with £420m exit clause\nIndeed, the former Borussia Dortmund star once admitted he would consider moving to the MLS one day. However, that, and a move to the Saudi Pro League, seem unlikely going by what he said earlier this season.\nWhen asked about a possible move to Saudi Arabia, he told Spanish news outlet AS last September: “I don’t even think about it. I’m super happy in Barcelona, in the team, in the city, with my family. As a person, I am happy.\n“Before the coronavirus pandemic, the idea of MLS was firmly in my head, but somehow I changed my mind afterward. After the Barcelona chapter, it’s hard to imagine going there.”\nFast forward to the present and according to Spanish publication SPORT, Lewandowski wants to spend at least one more season in Spain.\nLewandowski is going nowhere\nThe report adds he wants to mentor rising talents such as Lamine Yamal and Gavi at Barca and he is intent on winning more silverware at the Spanish giants in the next couple of years – albeit they will finish trophyless this term.\nREAD MORE: FIVE superstar Barcelona signings to aid huge Xavi U-turn: Isak, Silva…\nDue to Barcelona’s much publicised financial problems, getting the Pole’s huge salary off the wage bill may help their balance sheet but it seems they would have to sell another player to help towards that goal.\nIncidentally, Lewandowski reportedly turned down a huge Saudi Pro League deal that would have seen him earn around £85m a year.\nWhen his contract at Barca expires, it seems the forward still believes he can be an asset at the top of the game. Part of that may be down to the fact he is somewhat anxious about what to do with himself after football.\n‘Still play for three or four years’\nIn December, he said: “I don’t think about what I’ve already won or what I’ve already done. I still have that feeling and that passion inside me. I think I can still play football for three or four years, because physically I feel very good.”\nThe striker added: “It will be difficult to live without being a football player after my career. But to be a coach… I know it is a very difficult job. I am not sure that I will be prepared, because you have to be 100% focused in football.\n“Now I’m telling you this, but in five or seven years I’m going to miss the locker room, the smell and this whole atmosphere, and I’ll say, okay, maybe I can try it. But for now I don’t see myself as coach.”",
  "word_count": 587,
  "scraped_at": "2026-02-14T01:51:24.785001",
  "_text_extracted": true
}