{
  "article_id": "f78008a3eaba",
  "url": "https://www.caughtoffside.com/2025/02/25/report-chelsea-transfer-hinges-on-champions-league-qualification/",
  "title": "Chelsea transfers : Carney Chukwuemeka purchase option revealed",
  "date": "20250225T230000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Borussia Dortmund will only be able to sign Chelsea loanee Carney Chukwuemeka permanently if they secure a Champions League spot, according to reports from Germany.\nThe Bundesliga club brought Chukwuemeka in during the January transfer window, rescuing the young midfielder from a frustrating spell at Stamford Bridge.\nDespite showing promise, the England youth international struggled to cement a place in Chelsea’s squad under Enzo Maresca as well as previous Blues managers.\nInjuries, constant managerial changes, and Chelsea’s revolving door of new signings didn’t help his development. A move away in the summer seemed likely, but Chelsea’s high asking price kept him stuck in limbo until Dortmund swooped in this winter.\nAfter two years of limited game time, Chukwuemeka is still working his way into Dortmund’s team. So far, he’s only managed 24 minutes across two substitute appearances, but there has been some glimpses of potential.\nCarney Chukwuemeka’s deal to Borussia Dortmund could be just temporary\nDortmund negotiated a purchase option for Chukwuemeka, but reports on the exact figure have varied. Initially, Fabrizio Romano suggested the club might have to pay more than his €48 million release clause, but that was always unlikely given Dortmund’s usual transfer limits.\nBILD claims the actual buyout clause is set at €35 million but that Dortmund will only trigger the deal if they qualify for next season’s Champions League.\nThe club already paid Chelsea €1m for the loan and are covering €6m in wages for the remainder of the season. Without the extra revenue from European football, a hefty €35m permanent transfer could be out of reach for BVB.\nDortmund’s poor form this season makes their Champions League hopes uncertain. They’re currently 10th in the Bundesliga, sitting seven points behind fourth-placed Freiburg.\nIf they do pull it off, he would join Ousmane Dembele as one of Dortmund’s most expensive signings ever. But first, they need to turn their season around.",
  "word_count": 315,
  "scraped_at": "2026-02-14T01:58:05.337158",
  "_text_extracted": true
}