{
  "article_id": "f781be0af768",
  "url": "https://www.anglocelt.ie/2024/11/21/five-of-pep-guardiolas-most-memorable-man-city-matches/",
  "title": "Five of Pep Guardiola most memorable Man City matches",
  "date": "20241122T030000Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Five of Pep Guardiola’s most memorable Man City matches\nBy Andy Hampson, PA\nPep Guardiola has signed a new two-year contract with Manchester City.\nHere, we look at some of the most memorable matches of his time in charge.\nAfter a trophyless first season at City, Guardiola stamped his authority on the English game in 2017-18 as his side powered to the Premier League title with five games to spare. With the job done, they switched their focus to breaking records, setting new marks for most wins (32), most goals (106) and largest winning margin (19 points) among others. The crowning moment came in the last game of the season as Gabriel Jesus scored a late winner at St Mary’s to take City to 100 points.\nGuardiola’s side thrashed the Hornets at Wembley to become the first side in English football history to win the domestic treble. The showpiece clash was hardly a contest as Jesus and Raheem Sterling each struck twice with Kevin De Bruyne also on target after David Silva had opened the scoring. It was the biggest win in an FA Cup final since 1903 and capped a memorable season.\nThe Merseysiders interrupted Guardiola’s reign of dominance by claiming the Premier League crown in 2020 but City roared back the following year. Their campaign initially got off to a slow start, and they sat ninth after 13 games, but they then won their next 13 to take control of the title race. The highlight was a symbolic and emphatic win at Anfield, the club’s first since 2003. Ilkay Gundogan missed a first-half penalty but replied with two goals after the break, either side of a Mohamed Salah spot-kick. Sterling and Phil Foden capped a fine display.\nIt took City a long time to crack Europe under Guardiola but it looked like they had finally come of age when they came from behind to beat PSG in the first leg of their semi-final at the Parc des Princes. Marquinhos headed the French side in front but City dominated the second half and claimed a deserved win with De Bruyne and Riyad Mahrez strikes. PSG, who also had Idrissa Gana Gueye sent off, then lost the return at the Etihad Stadium 2-0 as City went through to the final.\nAfter the heartbreak of losing the 2021 final to Chelsea, City returned to European club football’s most glamorous fixture by swatting aside Real Madrid in the semi-finals two years later. The clinical nature of their 4-0 defeat of the Spaniards at the Etihad left few in any doubt the club had become the continent’s dominant force. Yet they still needed the trophy to prove it and they finally got their hands on it as they completed a glorious treble in Istanbul with a second-half winner from Rodri.",
  "word_count": 467,
  "scraped_at": "2026-02-14T02:08:26.317392",
  "_text_extracted": true
}