{
  "article_id": "f7842b9a6fa1",
  "url": "https://ghanaiantimes.com.gh/champions-league-quarters-barcelona-plot-dortmund-fall/",
  "title": "Champions League quarters : Barcelona plot Dortmund fall",
  "date": "20250409T121500Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League quarters: Barcelona plot Dortmund fall\nChampions League favourites Barcelona welcome last year’s finalists Borussia Dortmund to Montjuic in the first leg of their quarter-final tie today.\nHansi Flick’s side have been steamrolling their way through this competition so far, playing undoubtedly the most eye-catching attacking football, justifying their position at the top of the markets.\nBarcelona will still want to exercise the demons of their semi-final defeat to Inter in 2010, while Dortmund could make up for years of torture at the hands of Bayern as they seek to reach back-to-back finals.\nThe task for the German side looks huge though, given the scintillating form Barcelona are currently in, having gone unbeaten in 22 games, winning 18, but they were held to a 1-1 draw at home to Real Betis over the weekend, with Natan cancelling out Gavi’s early opener.\nA quadruple remains in sight though for Barcelona, who have already won the Spanish Super Cup, and advanced to the Copa del Rey final courtesy of their 5-4 aggregate win over Atletico Madrid last midweek.\nFerran Torres got the only goal in the second leg at the Metropolitano, after an extraordinary 4-4 draw in the first meeting, but before an El Clasico final in that competition, Barca have both legs of this Champions League quarter-final to play, as well as three winnable La Liga fixtures against Leganes, Celta Vigo and Real Mallorca.\nThe fact that a Clasico final could occur in two separate competitions, while the two are still battling for the title, suggests this could be one of the finest seasons of all time in Spanish football, but the race for the La Liga crown took a huge turn at the weekend with Los Blancos losing to Valencia at home.\nBarca have never lost in five\nprevious meetings with Dortmund, and manager Flick has a perfect 100% record against them, with six wins from six across his time with Bayern, and including the league phase success.\nBarca will know they cannot take Dortmund lightly though, because despite a very poor domestic campaign, the Yellow-Blacks have been a force in Europe recently.\nDortmund’s only knockout-stage defeat in their last eight was in last year’s final at Wembley to Real Madrid, and they have won three in a row on the road in such matches.\nIt is a good job their form in Europe remains good, because winning this competition will surely be the only route back into the competition for Niko Kovac’s men next season.\nA weak Bundesliga means, somehow, Dortmund’s top-four hopes are still alive, after back-to-back wins against Mainz and Freiburg, but currently lying in eighth, five points off fourth, those chances remain slim.\nRaphinha was kept in reserve at the weekend with this game in mind, and should rejoin Lamine Yamal and former Dortmund man Robert Lewandowski in a clinical, three-pronged Barcelona attack.\nAlong with Yan Couto, Nico Schlotterbeck was set to return from suspension for this, along with Niklas Sule after a knock, but the German international has been ruled out for the rest of the season with a meniscus tear in his left knee.\nManager Kovac is still spoilt for choice all over the pitch though with an almost fully-fit squad, but it is likely Guirassy in particular will be in the starting XI, after he was rested on Saturday.-SportsMole",
  "word_count": 557,
  "scraped_at": "2026-02-14T02:20:59.031853",
  "_text_extracted": true
}