{
  "article_id": "f7a4cb0f4167",
  "url": "https://www.macleayargus.com.au/story/9054899/newcastle-abuzz-as-jets-eye-australia-cup-glory/",
  "title": "Newcastle abuzz as Jets eye Australia Cup glory | The Macleay Argus",
  "date": "20250902T083000Z",
  "domain": "macleayargus.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JETS management is keeping a close eye on the situation at embattled A-League club Western United and hasn't ruled out targeting players if the club falls over.\nSubscribe now for unlimited access.\nor signup to continue reading\nAn appeal against a wind-up order of Western United by the Australian Tax Office over a $15 million debt will be ruled on by the Federal Court on Friday.\nA separate appeal by Western United against Football Australia's decision to strip the club of its A-League licence will be determined next Tuesday.\nIt seems, unless a white knight - or several white knights - emerge, the club will be axed from the A-League men's and women's competition.\nPotentially 23 men's players, headed by former Jets midfielder Angus Thurgate, and a similar number of women could enter the market.\n\"I'm feeling right now for Western United. It is an incredibly difficult position for them,\" Jets CEO Tain Drinkwater said.\n\"They obviously have a strong playing roster. I will be guided by [Jets coach] Mark [Milligan]. If there are players he thinks we could accommodate in our roster. That is something the club and our ownership group would look at.\"\nThe Newcastle Herald understands that the players' union has discussed with the Australian Professional League the possibility of increasing the $3 million salary cap and other concessions in the event Western United collapses.\nMilligan, like Drinkwater, hopes Western United is not shut down.\n\"It is very disappointing if that is the final result. It very much looks that way at the moment,\" he said.\n\"It's not ideal for the players. I think it will be a discussion for a lot of clubs.\n\"At the end of the day, there are some very good players there. They are very good players who don't deserve to be without a home.\n\"We will wait and see where that lands and what happens. I'm sure there will be discussion around that.\"\nAs it stands, the Jets only have a couple of places available on the roster, which had been earmarked for young players.\nOther clubs have up to six spots available.\nThe Jets lack depth at fullback and the base of midfield.\nUncertainty over Western United's future has also delayed the release of the draws for the upcoming men's and women's A-League seasons.\nThe men's competition starts on October 17. A draw featuring 13 teams, including Western, has been drawn up. The APL is also compiling a fixture list for 12 teams.\n\"I expect by the end of the week, we will have some clarity around the next steps and the timeline,\" Drinkwater said. \"The APL has given us a commitment that they are working on it as a priority.\n\"Once a determination [on Western's future] is made, they will quickly be in a position to inform the clubs.\"\nJets boss pushes hard for Newcastle to host Australia Cup\nJETS boss Tain Drinkwater is pushing hard for the Australia Cup final to be played at McDonald Jones Stadium and believes a new attendance record could be set if the showpiece game is in Newcastle.\nThe Jets accounted for Avondale 4-2 on Sunday to book a place in the decider against Victorian giant-killers Heidelberg United, which will be held on Saturday, October 4.\nIt is the first time either club has made it to the last two of the national knockout.\nFootball Australia (FA), which operates the competition, stages the final and is expected to decide on a venue by Friday.\n\"This is a big deal for our city,\" Drinkwater said. \"It's the first time the Jets have made the final of the Australia Cup.\n\"I have spoken with Football Australia and expressed how important it was to host the game at a venue fit for purpose. McDonald Jones is the stadium. That is the number of people we want there.\n\"There is no commercial upside for the club. We want it here because we want our fans and members to be able to watch a chance at club history.\n\"I'm happy to jump on the phone with Heidelberg and Football Australia to come up with solutions.\"\nSince the Cup's inception in 2014, the biggest attendance for a final was in 2016 when 18,751 watched Melbourne City beat Sydney FC 1-0 at AAMI Park in Melbourne.\nThe next best was in 2022, when 16,461 witnessed Macarthur beat NSW NPL club Sydney United at CommBank Stadium.\nA crowd of 13,289 was on hand for Macarthur's1-0 triumph over Melbourne Victory at AAMI Park last year.\nThe Melbourne Park venue is hosting a Monster Truck Show on October 4 and is unavailable.\nThe match will be broadcast live free to air by by channel 10 and FA has ruled out Heidelberg hosting the game at their suburban base, Olympic Village.\nMcDonald Jones Stadium and CommBank Stadium in Sydney, which has the benefit of being a neutral venue, are under consideration.\n\"CommBank Stadium is not the place for us,\" Drinkwater said. \"Heidelberg won't want to travel there either.\n\"If the final is in Newcastle, we would get 15,000 fans without a drama. Add Heidelberg fans on top of that.\n\"I acknowledge that they might not see McDonald Jones Stadium as a neutral venue. AAMI Park would not have been either.\n\"There are direct flights from Newcastle to Melbourne. There are a heap of accommodation options across the Hunter region. It is the long weekend; it could be a destination weekend.\"\nNew coach Mark Milligan, as well as steering the club on a record cup run, has introduced an entertaining, up-tempo game.\nAnd, significantly, he has given opportunities to a host of home-grown young players.\nA crowd of 4,256 packed No.2 Sportsground for the Jets' 5-0 win over Cooks Hill, and more than 2000 flocked to Maitland Sportsground for each of the two Cup games.\n\"We have a new coach, a new look playing squad ... there is great sentiment around the club,\" Drinkwaters said.\n\"We are pushing to get to 10,000 members this year. We are already more than halfway there.\n\"The players have been in the community. The squad went up to Lismore. We are super conscious of the impact we are having in the community. If we can bring the final here, it is a direct economic benefit to the region.\"\nApart from entering the history books, the winner of the Australian Cup secures a place in the Asian Champions League Two next year.\nTeams receive $462,000 for making the group stage, which covers the cost of travel. Prize money increases with each knockout stage. The winner pockets $3.5 million.\n\"For our commercial partners who have seen where we are going with the club and are investing money, it is global exposure for them,\" Drinkwater said.\nTown buzzing as Jets in line to host Australia Cup final\nCOACH Mark Milligan has sensed a buzz about the Jets building in Newcastle.\nThat excitement, he knows, will explode if Newcastle hosts the Australia Cup final on October 4.\nThe Jets accounted for Avondale 4-2 on Sunday to book a place in the decider against Victorian giant-killers Heidelberg United.\nFootball Australia will determine the venue for the showpiece by Friday.\nMcDonald Jones Stadium appears to be the most likely option.\nTraditionally, the final attracts a crowd of 15,000 to 20,000 fans.\nHeidelberg are only the second NPL club to qualify for the final of the national knockout.\nTheir home base, Olympic Village, does not have the capacity or the broadcast facilities required.\nAAMI Park in Melbourne, which has been the venue for four finals, including the 1-0 win by Macarthur over Melbourne Victory last year, is booked for a Monster Truck show.\nThe Newcastle Herald understands that Marvel Stadium, which is a circular ground and has a capacity of 53,000, is not an option.\nIn 14 years, the showpiece game has been held at four venues - AAMI Mark (Melbourne), Coopers Stadium (Adelaide), Allianz Stadium (Sydney) and CommBank Stadium (Parramatta).\nIt's questionable whether the game would generate enough interest to be held at a neutral venue in Sydney or Gosford.\nNewcastle, of course, hosted the 2018 A-League grand final between the Jets and Melbourne Victory, which drew a full-house crowd of 28,410.\n\"It would be absolutely fantastic to play the final in Newcastle,\" Milligan said.\n\"I have felt, and the players have felt, a buzz around town in the past few weeks.\n\"I went to the Craig Johnston (\"You'll Never Walk Alone - Untold Stories) show the other week.\n\"Talking to people there, they are excited about the Jets. They see the direction we are trying to head in.\"\nBefore this season, the furthest the Jets have progressed in the Cup was the quarter-final in 2019, where they went down 1-0 to Adelaide.\nVictory over Heidelberg would not only deliver the club's first piece of silverware since the A-League Championship in 2008, but it would also secure the Jets a berth in the Asian Champions League Two and a guaranteed $462,000 prizemoney.\n\"We have spoken a lot about how we want this group to leave its mark, leave the badge in a better place than we found it,\" Milligan said.\n\"Last week was a chance to do that. Now we have another opportunity for this group to cement itself in the history of the Jets.\"\nHeidelberg are also out to create history as the first NPL side to win the Cup.\n\"Heidelberg have done fantastically and have a big couple of weeks ahead of them with [Victorian NPL] finals as well,\" Milligan said.\n\"It will be another big test for us. We keep saying it, but we are very much focused on our growth. We know if we continue down this path, we are a good chance in the final.\"\nThe final will pull at the heartstrings of Jets part-owner and director of Maverick Sports Partners Maurice Bisetto, whose son, Max, plays for Heidelberg.\n\"I'm sure he is extremely proud on both fronts,\" Milligan said.\n\"The Cup is so good for Australian football. I am a product of the NPL system. I was a player and that is where I got my first coaching gig. That is where our young boys get their development. We are developing them as a club, but they are playing in the NPL.\n\"It is good for Australian Football that NPL teams are doing well. For me, that is why the Cup was introduced. To give these opportunities to show players. We don't have promotion-relegation, we don't have a big ecosystem of professional footballers. It's a fantastic competition.\"\nThe win over Avondale signalled the end of the Jets' second preseason training block.\nThey reassemble on Thursday. As well as a hit out against the NNSWF All-Stars, Milligan has pencilled in friendlies against Sydney FC and Melbourne City before the Cup final.",
  "word_count": 1801,
  "scraped_at": "2026-02-14T02:11:49.081188",
  "_text_extracted": true
}