{
  "article_id": "f7abd358348c",
  "url": "https://arsenalnews.co.uk/2025/05/22/alan-shearer-picks-declan-rice-ahead-of-ryan-gravenberch-in-premier-league-team-of-the-season/",
  "title": "Alan Shearer picks Declan Rice ahead of Ryan Gravenberch in Premier League Team of the Season",
  "date": "20250522T163000Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United legend Alan Shearer has picked Arsenal star Declan Rice ahead of Liverpool midfielder Ryan Gravenberch in his Premier League Team of the Season.\nArsenal have had a difficult campaign. The season started with high expectations of winning the league title, but they have fallen short of the target due to injuries, inconsistent form and dubious refereeing decisions.\nDespite this, there are some positives to carry forward. The Gunners progressed until the last four of the Champions League. They produced a statement 5-1 aggregate win over Real Madrid in the quarter-final stage.\nShearer has now picked his Premier League Team of the Season with two Arsenal stars. The former Magpies striker chose William Saliba ahead of Nottingham Forest’s Nikola Milenkovic and said he has been rock in the heart of Arsenal’s defence.\nDeclan Rice was the second pick. Shearer said he has been technically superb and incredibly strong in his duels. His standout displays in the Premier League and Champions League have got him the nod over Liverpool’s Ryan Gravenberch, as per the 54-year-old.\nHe said: “Technically superb and incredibly strong in his duels, Rice has enjoyed another standout season in the Premier League, while his inspired displays took Arsenal to the semi-finals of the UEFA Champions League. He keeps out Liverpool’s Ryan Gravenberch.”\nRice started the campaign in a slow fashion. He struggled to find consistency and made just one goal contribution in the league until the start of November.\nHowever, his form picked up ahead of the turn of the year. The midfielder has had another 10 goal involvements in the league – 19 overall in all competitions.\nHis two world-class free-kicks against Los Blancos have undoubtedly been the highlight of his campaign. Rice may want to step up to another level at Arsenal next season.\nThe 26-year-old has got into terrific goalscoring positions. If he can increase his scoring frequency, he can easily become one of the best box-to-box midfielders in world football.\nArsenal have a huge summer ahead, and there could be plenty of high-profile signings. A marquee striker should be the top priority and Viktor Gyokeres seems the prime target.\nA versatile winger should also be prioritised. In our view, Arsenal may explore a deal for Real Madrid’s Rodrygo, with Los Blancos weighing up an approach for Athletic Bilbao’s Nico Williams.\nMartin Zubimendi is poised to join the club to reinforce the midfield department. Alongside him, a back-up goalkeeper could be pursued with Neto likely to return to Bournemouth after his loan stint.\nEspanyol’s Joan Garcia remains the top target. Arsenal face a considerable hurdle in landing his services this summer, with his excellent form catching the eye of many European clubs.\nArsenal have recruited Andrea Berta as their sporting director to negate stumbling blocks. The former Atletico Madrid chief has some big transfer decisions to make this summer.\nStats from Transfermarkt.com",
  "word_count": 478,
  "scraped_at": "2026-02-14T02:09:11.451496",
  "_text_extracted": true
}