{
  "article_id": "f7b032cdd5f9",
  "url": "https://www.heraldscotland.com/news/23577258.brendan-rodgers-celtic-redemption-trail-fans-thaw-ex-boss/",
  "title": "Brendan Rodgers on Celtic redemption trail as fans  thaw  on ex boss",
  "date": "20230609T061500Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "That intermittent ‘drip’ you can hear might just be a tentative thawing of relations between Celtic fans and Brendan Rodgers.\nA quite unthinkable scenario in the days, weeks, months and even a few years following his sudden departure to Leicester City, given the enormous swell of ill-feeling towards a man who was greeted as a messiah when he first walked through the doors of Celtic Park.\nBut time, as they say, is a great healer. That, and the pressing need for another top-tier manager.\nReplacing Ange Postecoglou is no easy assignment, albeit there is a very credible case for the Celtic job having never been more attractive. The new manager will inherit Champions League football, a young, talented squad and plenty transfer cash waiting patiently in the bank.\nAnd yet whoever who takes the baton, or the jumper, from big Ange will risk the perils that come with being ‘the next guy’. Postecoglou’s legacy is not only his haul of five domestic trophies from six, but a connection with Celtic’s fanbase that made a farewell for Tottenham Hotspur all the more difficult to swallow.\nREAD MORE: The Moravcik factor that makes Knutsen the ‘right coach’ for Celtic\nRodgers was idolised for a time, but not even he reached the levels of affection afforded the Greek-Australian. The circumstances of his exit – in the blink of an eye to Leicester City as Celtic chased a third consecutive treble – made the prospect of reparations feel rather remote for a long time.\nFor some, that resentment will never fade. For others? Mark Wilson suspects there could be a way back.\nNow that he’s not patrolling the Celtic Park touchline at full-back, the former defender spends much of his time with an ear to what supporters are thinking on Clyde One’s Superscoreboard. Football fandom can be a fickle one – and there’s nothing wrong with that, especially in a world managers can deliver a treble on Saturday and be booking up for London on Sunday.\nSocial media is not always the most reliable barometer of opinion, but even the initial linking of Rodgers’ name to the current vacancy has given rise to some softened sentiment. For Wilson, that’s an indication that, if Celtic go down the reunion route, there is considerable scope for trust between Rodgers and his formerly adoring public to be rebuilt.\n“Football fans hold things dear, especially at Celtic,” said Wilson. “If the manager says the right thing, the fans believe it 100 per cent. They struggle to let it go. If Brendan Rodgers were to come in and get results right away, the brand of football was good again, and a couple of good signings came in the door, all would be forgiven.\n“It's the only thing that stands in the way for me - that a few supporters don't forgive the way he left. But it's going to be the same whoever's appointed next. They're going to either leave at the end of the season or they're going to get the opportunity to go down south to a Premier League club, and that's something we have to get used to in Scotland.\n“There is [some thawing] because some couldn't mention his name. Now they're mentioning his name and saying he did great things, even if they still don't forgive him. If he was appointed that would go further, it would thaw gradually over time.\n“It's all about the product on the pitch and Rodgers, in his time here, was extraordinary, he was a great spokesman for the club but backed it up with performance. The only thing that really failed him was European football, like Postecoglou. He was wide open attacking and took a couple of thumpings. But apart from that you couldn't argue with his record.”\nIf it were left up to Wilson, he would be recruiting Rodgers for round two.\nEnzo Maresca, Kjetil Knutsen, Graham Potter, Pascal Jansen and Franciso Farioli are just a few of the names in the mix, but it is Rodgers who has the track record and the know-how in bringing success to Parkhead. In the end, that is the only requirement of any Celtic manager – winning.\nAnd Rodgers did plenty of that during a trophy-laden tenure. Two consecutive trebles, an unprecedented feat, were his and the third was largely of his making, too. He left Glasgow having won every domestic competition he entered.\nWhere the Northern Irishman did fall short was in Europe, overseeing two largely painful Champions League campaigns and a fairly meek Europa League exit to Zenit St Petersburg after the relative success of guiding Celtic out of the group stage. However, Wilson remains confident he is the best man for the job – if he’s up for it.\n“If it was me and I had the choice of anybody and Brendan Rodgers was available, I would take him back in a heartbeat,” he said. “There’s obviously levels to management and all these names get bandied about, people look at into their past and what they’ve done and that’s attractive.\n“But when you have a manager like Rodgers, who came here with 15,000 people outside Celtic Park to welcome him, he backed it up with real success and a style of play that Celtic fans loved at the start.\n“OK, it faded a bit at the end. That possession-based football was great at the beginning and Celtic fans loved it.\nREAD MORE: Enzo Maresca in Celtic parallel to Ange as insider lifts lid on what happened at Parma\n“But he’s still a top, top manager. People can say ‘look what happened when he went to Leicester’ – he finished 5th and won the FA Cup with a team that was never going to reach the heights of what they’d achieved before.\n“Everybody gets sacked at one stage, he’s a real top manager. I suppose Celtic are fortunate that he’s out there and not in a job.\n“If he wants it, I think he’d be a great fit. The other is Enzo Maresca, I think he’s an interesting one; part of the City Group under Pep Guardiola and it’s a link Celtic have utilised well over the years.\n“The style of play would maybe be closest to what Postecoglou brought. When you’ve got full-backs who have been reinvented like Greg Taylor and adapted like Alistair Johnston and Anthony Ralston – a different player now – you’d want to use that again if it’s been so successful.\n“To bring in manager who scraps it and goes to a rigid four at the back, it may yield different outcomes. They need to be careful with who they pick.”\nMark Wilson was promoting the Glasgow European Capital of Sport 2023 Refugee Football Tournament on Sunday July 2 at Toryglen Regional Football Centre. The event celebrates the diversity of communities in Glasgow through football while standing up for the rights of refugees.",
  "word_count": 1149,
  "scraped_at": "2026-02-14T02:09:58.130568",
  "_text_extracted": true
}