{
  "article_id": "f7d52fc653ab",
  "url": "https://toffeeweb.com/season/25-26/comment/general/46596.html",
  "title": "Carabao Cup – Round 2",
  "date": "20251015T180000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Carabao Cup – Round 2\nA slew of matches on Tuesday and Wednesday nights, all available on Sky Sports+ with these Main Events:\nTuesday 26 August 2025\n20:00 Sheffield Wednesday v Leeds Utd — Sky Sports Main Event\nWednesday 27 August 2025\n20:00 Grimsby Town v Manchester Utd — ITV 1 and Sky Sports Main Event\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\nPosted\n26/08/2025 at\n21:33:44\nWhat a great effort by the players of Sheff Wed.\nPosted\n26/08/2025 at\n22:01:03\nWhat a great continuing effort by the players of Sheff Wed. Pen shoot out.\nPosted\n26/08/2025 at\n22:03:00\nTatty bye dcl. Leeds out\nPosted\n26/08/2025 at\n22:03:01\nHahahahahah!\nDominic Calvert-Lewin's penalty!\nFucking hilarious.\nPosted\n26/08/2025 at\n22:03:04\nCalvert-Lewin proving why no one other than Leeds wanted him.\nPosted\n26/08/2025 at\n22:04:07\nDCL misses in pen shoot out. Sheff Wed 3 up and now they are through as Leeds 3rd pen saved.\nPosted\n26/08/2025 at\n22:05:47\nDom missed great chances in regular time too. Everton's decision was a wise one.\nPosted\n26/08/2025 at\n22:06:18\nSuch a pity, due to a rightful demonstration by the Wed fans to stay away, only 3000 saw it.\nPosted\n26/08/2025 at\n22:07:04\nDCL missed a sitter in the last few minutes to win the game as well. Centre of the goal, about six yards out and put the ball wide of the post.\nHis penalty is still rising, heading over the Pennines towards BMD!\nPosted\n26/08/2025 at\n22:08:06\nHuddersfield KO Sunderland.\nCeltic humbled in Kazakstan and out of Champs Lge.\nPosted\n26/08/2025 at\n22:08:13\nOne on one was never DCL's strongest point\nPosted\n26/08/2025 at\n22:08:53\nThe fella who thought he was better than us and worthy of Champion League footy. That good he couldn't even get a shot on target from 6 and 12 yards out.\nPriceless.\nPosted\n26/08/2025 at\n22:09:34\nGot to hope our reserve XI win tomorrow. Will Tyler get a cameo appearance. For those who go, I hope so.\nPosted\n26/08/2025 at\n22:10:11\nNo doubt it is the ill treatment at the hands of various Everton managers, lack of service, supporters booing him etc. to blame for his penalty miss.\nLet's see how long Leeds put up with him for.\nPosted\n26/08/2025 at\n22:10:11\nA bit over the top to say the least, always wore the jersey with pride here, doesn’t deserve the bitterness.\nPosted\n26/08/2025 at\n22:10:49\nI'm glad we've moved on from DCL. He really wasn't very good apart from one half season.\nHe just got more and more stale and injury prone. Got no particular animosity towards him, he was just very average.\nPosted\n26/08/2025 at\n22:11:27\nThat was a truly incredible shootout. You don't see them over after 3 kicks very often. And Leeds fans were leaving mid-shootout, which is truly baffling.\nAs for Dom, well, he had 3 good chances in normal time...\nPosted\n26/08/2025 at\n22:12:02\nI don't wish DCL any ill will whatsoever. A parting of ways is all it was with both involved looking to move on to something more positive.\nI guess the people taking joy in his performance this evening are the same types that abused him when an Everton player.\nPosted\n26/08/2025 at\n22:13:47\nJust seen DCL miss a pen and a sitter for Leeds tonight — he really is a poor player nowadays.\nHow the fuck did Leeds beat us last week?\nPosted\n26/08/2025 at\n22:15:49\nA lot to thank Dom for; his goals against Palace and the shite were brilliant and well worth whatever we paid him.\nIt was a good time to part ways for both parties and I wish him well but not against us.\nPosted\n26/08/2025 at\n22:25:35\nIf DCL thinks Everton fans turned on him, wait until he feels the vitriol Leeds supporters send his way. Possibly the nastiest, most hatred filled fan base towards their own players out there.\nPosted\n26/08/2025 at\n22:32:19\nHey, whether you liked him or not -- and I did -- it's okay to laugh.\nEspecially at that.\nAnd what a brave effort by Wednesday's players as their club collapses around them. 9 starters under age 21 because they have nobody else left on salary, and they beat a Premier League club nobody predicted them to beat.\nPosted\n26/08/2025 at\n22:32:55\nSchadenfreude alive and well on ToffeeWeb tonight.\nPosted\n26/08/2025 at\n22:34:20\nHave you not seen the video circulating with the Leeds fans already having a song for Dominic, Liam?\nHe shops in Zara (I can't imagine his partner being happy with this!)\nHe wears mascara, his frocks fucking massive.\nNot the best welcoming song I've ever heard, but it was quite funny watching grown men singing it.\nPosted\n26/08/2025 at\n22:34:39\nWe paid him about £30M.\nHe's done alright out of Everton.\nPosted\n26/08/2025 at\n22:38:45\nIan, a bargain when weighed against the cost of relegation.\nMike, agreed.\nTony, I saw that too.\nPosted\n26/08/2025 at\n22:40:39\nNot seen the video, Tony – will look it up.\nI work in Leeds and already had 5 messages since 10 pm about how 'fucking useless' DCL is.\nPosted\n26/08/2025 at\n22:42:23\nLiam, sounds like TW live forum.\nPosted\n26/08/2025 at\n22:50:14\nSeems those who hated DCL are never going to forego the joy they got from it.\nPetty pathetic, gloating.\nPosted\n26/08/2025 at\n22:54:22\nI feel sorry for DCL, I hope he comes through this.\nSome cope with pressure and others don't.\nPosted\n26/08/2025 at\n22:56:52\nNot sure it's wise to laugh at this just yet – there is a long season ahead and we have to play Leeds at the BMD.\nJosh King, anyone?\nPosted\n26/08/2025 at\n23:00:36\nWe’ll absolutely batter Leeds at BMD.\nPosted\n26/08/2025 at\n23:01:55\nI don't wish anything bad for DCL but equally I won't feel sorry for him. He chased the money, which he is 100% entitled to do.\nHe's barely played in months, so no surprise if he showed some rust. Think he'll do well for Leeds if fit. Definitely an upgrade on Piroe.\nPosted\n26/08/2025 at\n23:05:50\nNeil, that made me laugh so loud the dog jumped.\nPosted\n26/08/2025 at\n23:10:09\nMike 😁\nPosted\n26/08/2025 at\n23:14:54\nChampionship at best.\nCow's arse with a cello...\nPosted\n26/08/2025 at\n23:28:00\nI feel I can only now really start to enjoy watching DCL.\nLeeds must feel we really pulled their pants down with that free transfer.\nThe feeling of Everton not paying that guy £100k a week for the first time in five years is indescribable.\nPosted\n26/08/2025 at\n23:29:27\nHe turned down Newcastle last season, turned Everton down wanting £150k a week expecting big clubs to come in for him due to a freebie, even Man Utd stayed clear of him.\nEnds up at Leeds for the money, plays against a team of youngsters with hardly any home fans in, due to protest.\nMisses 2 sitters and skies his penalty. I'm with Mike, I was laughing my nuts off – we can do a lot better than Calvert-Lewin if we want to bring quality players in. And move forward.\nPosted\n26/08/2025 at\n23:43:58\nI can't understand how a striker missing a penalty for Leeds in the Carabao cup would register laughter with Evertonians. We live in strange 'banter filled' times.\n\"He went there for the money\". For fuck's sake, it's literally his job.\nPosted\n27/08/2025 at\n00:43:01\nI'm delighted for Sheffield Wednesday. A mate of mine is a passionate lifelong fan (still bitter about 1966!!) and they deserve this, not just for his sake, but for all the players and staff (but not the prat owner).\nA very big shout out for Barry Bannon who is an absolute legend (and still at pushing 40, a very handy player in this league).\nAs for DCL, he has made the mistake of over-estimating himself or allowing his agent (now sacked) to do so. Had he accepted quickly what The Barcodes were offering in January, he might be on the cusp of Champions League football given the Isak situation.\nInstead, he's going to spend a season or two scuffing around at Leeds as second or third striker, and likely getting abuse from their fans for the limited, injury-prone player he is.\nPosted\n27/08/2025 at\n01:03:46\nMark, does your mate expect the club to survive?\nSome of us Yanks have a soft spot for the club because of John Harkes and his Goal of the Season against Shilton.\nPosted\n27/08/2025 at\n01:23:28\nSheffield Wednesday is special because of Benito Carbone, one of the Premier League's most exciting early stars.\nHe had some fight in him.\nPosted\n27/08/2025 at\n01:37:33\nAnd I remember that any former Everton player appearing at Goodison always getting a good hand from the crowd.\nJust the one-handed two-finger clap these days?\nPosted\n27/08/2025 at\n01:59:20\nI have a soft spot for Sheffield Wednesday too.\nIdentikit stadium to Everton, blue and white, historic power, plus a Wednesday fan named Sandra I had a dalliance with in the south of France when I was a teen.\nPosted\n27/08/2025 at\n05:16:58\nBit harsh on DCL?\nHe gave us 9 years of his career, and wanted an ambitious move after 4 years of battling relegation. Hardly a hanging offence.\nWhatever his limitations, he always worked his arse off for the club and he played while injured. Which is more than can be said the likes of Schneiderlin, Williams, Maupay or the Nameless One.\nPosted\n27/08/2025 at\n05:53:14\nWhy is it just about every player who leaves of his own accord is vilified, ridiculed or abused?\nDCL gave us good service, as did Tom Davies, Jack Harrison, Ashley Young… blimey the list is enormous!\nWithout doubt some deserved the ridicule but not all... depends on your perspective and memory, I guess!\nPosted\n27/08/2025 at\n06:33:45\nI'm a big DCL fan and make no bones about it. He played under some terrible managers and alongside some even worse players and never once complained or downed tools.\nHe was played out of position. Injured and, most of the time isolated, surrounded by two giant defenders. He was a model teammate who was well liked by players and staff alike.\nI simply don't understand the antagonism shown towards this lad. It got to the point where he came off the field obviously injured and still got booed and jeered at by some so-called fans.\nWas his fashion sense so despicable and hateful to deserve this kind of treatment?\nPosted\n27/08/2025 at\n07:24:02\nKieran #44, is 'a dalliance with in the south of France' euphemistically used?\nPosted\n27/08/2025 at\n07:33:05\nConsidering the terrible state that SWFC are in, that game fell into the category of “must not win” for Leeds. Nothing said but everyone knows. These sorts of games are an unfortunate occasional necessity in the game.\nI remember many years ago when Everton played a struggling Southport away in the FA Cup. Everyone wanted a draw and replay but Joe Royle scored a late winner. The lad got very few congratulations from the team and the management were said to be furious with him after the game.\nPosted\n27/08/2025 at\n07:36:03\nSome strange comments on here about Dominic, but I can't say I'm surprised.\nI've never known a player cost so little, who scored so many goals for us and played a massive part in helping us avoid League One football, receive so much abuse.\nHe didn't want to be injured, he certainly didn't want to be isolated playing Dyche-ball, and you can't possibly blame him for getting the best possible salary.\nFor £1.5M, he was a great buy for us, seems like a nice lad, and played through injury more than once. He deserves at least some respect.\n(By the way, I said League One football because, if we'd gone down in 2022, then I have no doubt we would have gone the same way as Leeds and Sunderland.)\nPosted\n27/08/2025 at\n07:48:07\nGlad to see Dominic getting plenty of praise on here, he certainly deserved it, apart from last season when I thought he held something back, he always gave his all in different parts of the field.\nIf Beto or Barry (I'll give him time) could hold the ball up as good as Dominic, they would be much better players.\nGood luck and good health, Dominic, with the rest of your career.\nPosted\n27/08/2025 at\n08:05:10\nI am absolutely with the posters who have shown support to Dominic Calvert-Lewin. He was a nightmare for defenders to play against (when fit).\nYes, he should have scored more goals, but I do believe that, with the players that we have brought in this window – Grealish, Dibling, etc – he might have hugely contributed to goals as well as keeping the opposing centre-backs occupied for others to exploit.\nI wish him all the very best for his future. Yesterday was hopefully a temporary blip in his career with Leeds. Just don't score against us at Hill Dickinson Stadium!\nPosted\n27/08/2025 at\n08:30:54\nNo axe to grind with players who contributed so much to keeping us in the Premier League and solvent in some very dark times. DCL, Doucoure, Harrison, Townsend, Gray, Young etc etc. All in the past now though.\nThis cup is a big opportunity for us. Let's beat Mansfield and take the competition very seriously.\nPosted\n27/08/2025 at\n08:31:38\nDCL was likeable (I'm sure we all would be on the same money), and he did put the effort in.\nCould be superb with his heading, but unfortunately his shooting, particularly on 1:1s, let his game down.\nThe Carlo season, he was in and around the 6-yard box only.\nPosted\n27/08/2025 at\n08:48:07\nI will never tire of re watching the goals that DCL scored for us that meant so much to us, Crystal Palace and the sublime 2nd goal against Liverpool that's well captured from every angle, both sending all in Goodison into uncontrollable hysterical joy.\nHis relentless and often unrewarded work rate and skillfull hold-up play was a credit to him and his desire to help the team during difficult times.\nYes, that's what he got paid for, but his was the first name I looked for on the team sheet every game. I for one wish him well in his time at Leeds and wherever he plays. I don't have heroes then dump them, I just gratefully remember them for being my heroes in their time in Blue.\nPosted\n27/08/2025 at\n08:55:43\nFor fuck's sake, I'm sick of this bullshit about DCL.\nHe didn't keep us up with his goal against Palace — every player who stepped on the pitch also played their part.\nHe is supposed to work hard, you don't get extra kudos for working hard — it should be a given.\nHe scored against Liverpool, so what, he also missed plenty.\nI'm never one to really slag players off but boy am I glad that waste of space is no longer wearing an Everton shirt.\nPosted\n27/08/2025 at\n09:01:48\nMick 56,\nSome courage to openly say that on here. I am with you.\nPosted\n27/08/2025 at\n09:07:02\nDCL is another symptom of what it's like to be an Evertonian in 2025. Not fit to lace the boots of many of our genuine club legends but remembered by some for being way more than he ever was because we have been so starved of anything better for decades.\nAnd you could duplicate all of the above for Duncan Ferguson too.\nPosted\n27/08/2025 at\n09:17:24\nIf ToffeeWeb ever decide to do merchandise, Number 1 on their list should be voodoo dolls with pins.\nMaybe a two-for-one deal: Moyes and DCL. Clearly a big market for them on here.\nPosted\n27/08/2025 at\n09:27:19\nThat new third kit is an absolute shocker 🤣\nEven DCL wouldnt wear that 🫣\nPosted\n27/08/2025 at\n09:30:00\nThe boos at Aston Villa when he went off injured were embarrassing.\nThey were also, almost exclusively, delivered by pissed up coke heads in the minority. A small selection of our away support is absolutely horrible.\nPosted\n27/08/2025 at\n09:30:36\nI am in the \"don't slate former players\" camp — none of us have any idea what goes on behind the scenes and the things that make certain players tick and others not so much.\nThere are some exceptions to this rule for me – Maupay, for example -– but that is due to the disrespect that they show the club. DCL does not deserve to be vilified.\nWould I have him back? No, but he should be given due respect, or at the very least, ignored, as he is no longer wearing Blue!\nPosted\n27/08/2025 at\n09:57:26\nMick #56, I have to disagree completely with your post.\nDCL is our 3rd highest goalscorer in the 30+ seasons of the Calvert-Lewin and could possibly have scored many more if given the right service.\nDo you remember him staying on the pitch after the Palace game and after he gave his shirt to a fan and celebrated with our fans?\nHe may have missed plenty of chances but he wouldn't be alone in that category would he.\nPosted\n27/08/2025 at\n10:01:39\nMark,\nLet's be honest, we have a large number of crap supporters, who have driven out good managers and some players from our great club.\nBut I suppose most clubs have them, attitudes have changed over the years and not always for the better.\nPosted\n27/08/2025 at\n10:09:32\nTreat others like you want to be treated yourself.\nSlagging off is kids behavior, why delight in others misfortune?\nUnless they are a bastard, I don't really get it.\nPosted\n27/08/2025 at\n10:15:12\nJust bear with it, Liam, so the globalists can slowly erase mankind as we have always known it.\nMost people will be prepared to give up their privacy for efficiency, said that clever little deceitful war criminal, Tony Blair, but to get real efficiency, there will definitely be a lot of headaches along the way!\nNowhere near as many as there will be once the experiment has been done effectively.\nPosted\n27/08/2025 at\n11:42:01\nThanks for explaining that, Micky Norman @49.\nMy bad: I should have known Calvert-Lewin deliberately missed his penalty and that he should be warmly congratulated for this wonderous act of selfless altruism in the interests of massive local rival club Sheffield Wednesday, who will — thanks to this marvellous personage, now proceed to the next highly lucrative stage of this huge competition.\nNah, sorry… and it's still funny as fuck — like all his other hopeless misses last night — but I didn't want to trigger you hypersensitive DCL lovers by mentioning them.\nPosted\n27/08/2025 at\n12:16:33\nIt has to be said Michael, you get an A-star in sarcasm!\nI'm with those who thank him for his tireless service and wish him the best for the rest of his career. His only disservice to our club was his ability to miss one-on-ones but hey, he was not alone and was probably down to sheer surprise he ever got such opportunities given he served during that horrendous Dyche period.\nPosted\n27/08/2025 at\n12:27:35\nNot quite sure that there was any real need to have such a snarky sarcastic go at (at least) half the posters on this thread. I think the hypersensitivity may lie elsewhere with comments like that, Michael.\nI tell you what was fucking funny, though - your pathetic reaction when you first heard that Moyes was back. That was priceless!\nPosted\n27/08/2025 at\n12:54:43\n“Tireless service”, Ian.\nHad to laugh at that.\nPosted\n27/08/2025 at\n13:03:57\nDCL proving form is temporary, ass is permanent.\nPosted\n27/08/2025 at\n13:07:31\nMichael 67 - It's not about loving him. That would be a pretty strange emotion to attach to a fairly decent ex-player who left in a pretty uneventful way.\nBut what is it you feel for him that it makes you laugh hysterically when he misses a penalty? Is it hate?\nI genuinely don't get what makes it funny.\nPosted\n27/08/2025 at\n13:08:42\nHi Les - I was of course referring to tireless service when he was able to play!\nPosted\n27/08/2025 at\n13:35:38\nI see chief pretender to Pickford's English crown, Matt Trafford, is being sold/loaned to Besiktas in Turkey.\nThat didn't last long, did it?\nPosted\n27/08/2025 at\n13:40:38\nJames Trafford\nPosted\n27/08/2025 at\n13:42:28\nColin, astonishing news, but surely it can only be a loan, as I don't think a player can make two permanent transfers in the same season, unless that rule has changed.\nPS……it's James Trafford by the way! 😂😂😂😂\nPosted\n27/08/2025 at\n13:45:33\nAt least it’s not Jeremy Bowen from WHU. That was last weeks old age blooper.🙄\nPosted\n27/08/2025 at\n14:14:18\nDCL is a bang average Premier League striker about whom every excuse under the Sun has been made for his inadequate goal return, regardless of him missing chance after chance for years now.\nIn fact, it is often the people making excuses for him that deflect any criticism of his footballing ability, on a football supporters forum, by insisting that criticism could only possibly be based on personal dislike.\nIt's the same with Moyes, who's name has predictably appeared above.\nRather than being funny, usual service being resumed in Leeds was inevitable. The self-righteous advocacy on his behalf, with formulaic prevarication, is quite amusing though.\nPosted\n27/08/2025 at\n14:33:47\nErnie (72), come on, mate — no need to be so po-faced.\nI also found it funny as fuck and will enjoy every weekend where he doesn't score. He's a knobhead and is stealing a living. The kid can't hit the side of a dinosaur.\nPosted\n27/08/2025 at\n14:33:56\nBut Josh, there's a world of difference between criticising the poor finishing of a 'bang average' striker and the dog's abuse DCL got. Those relishing in his failure are not doing so because his conversion stats were poor. Can't see anything self-righteous about questioning folk for being unpleasant.\nI must admit to having a wry smile when he missed his first sitter. But I felt a bit sorry for him after the penalty. I certainly hold no grudge. That bang average striker was the best of a mediocre bunch over a long period.\nI wish him well, hard though that is given he plays for Leeds.\nPosted\n27/08/2025 at\n14:43:23\nMy guess is that Michael is just happy that he doesn't have to watch Dominic in a blue shirt anymore.\nIf he actually did find himself in hysterics, it would probably be more to do with this than the actual penalty miss?\nPosted\n27/08/2025 at\n14:49:07\nCouldn't agree with you more, Stuart. Life's too short to be so miserable as to relish others misfortunes. He's gone, he ain't coming back and we have other things that we can (collectively) worry about and enjoy in equal measure, such as a win tonight and a few more signings, starting with an RB!\nPosted\n27/08/2025 at\n14:56:35\nRob 76,\nThat transfer just highlights how out of control spending is in the league.\nWhilst the rest of the league have to be creative at best just to stay afloat the top teams are allowed to run riot.\nHow can the powers that be turn a blind eye, it's ruining the sport.\nIn the meantime our lovable neighbours poach a 15 year old from 200 miles away. How is that morally right? It's not just them all prem clubs are probably at it.\nAnyhow rant over.\nDcl has had bad representation and could have seen out his career with us but chose not to. Left on a free knowing the club is on its arse similar to Doucoure, Silva, mina, Bernard and Moyes but Keane signs a new 1 year deal and it's bad business for the team we are a strange bunch us football fans.\nPosted\n27/08/2025 at\n14:59:47\nWhat is self righteous Stuart is conflating any criticism of him as a player with personal abuse, and that is usual on here. The same people who do this regularly follow it up with what a great lad he is, as if that is any more relevant to his poor finishing.\nThe club supported him through injury after injury and one barren run after another, he wouldn't sign a contract that probably fairly reflected that and, as I understand it, he refused to move to another club to Everton's detriment.\n\"He doesn't owe us anything\" is true but it cuts both ways.\nI don't like how he left the club and I do understand why some Everton fans might take some delight in seeing him fail, and being proved right that he isn't very good without it any longer being at Everton's cost. I wouldn't call them haters, childish, or crap supporters.\nPosted\n27/08/2025 at\n15:23:31\nI am guilty of criticism of DLC, mind you, I will criticize any one, any time just for the sake of it. I once criticised myself for criticising myself for criticising a drawing I had done which I myself had given critical acclaim to.\nBut I would have loved DLC to have scored a couple last night.\nPosted\n27/08/2025 at\n15:25:40\nI think it works like this, Ernie, but correct me if I'm wrong.\nIf you're half-watching something, and suddenly, something happens that strikes you as really funny, you laugh your arse off at it.\nBut someone else could watch the same thing and not be amused at all by it. It's part of being human. We have different reactions to the same stimulus.\nAnd then there's a third category, that takes it all very seriously, and espouses some nonsensical judgmental rubbish about agendas and biases and god knows what else they feel triggered by.\nThat also is unfortunately an aspect of modern humanity that we have to live more and more with. But thankfully, we don't actually have to do what they say, or think how they want us to think.\nPosted\n27/08/2025 at\n15:28:46\nI'm surprised so many people stick up for him. a totally mediocre striker, injured half the time, was paid a king's ransom, but not satisfied with that, turned down a fantastic move to Newcastle last year, depriving us of a significant fee at a time when the club was facing bankruptcy cos he thought 'I know, why don't I take that fee too, along with the thirty million I've picked up for doing not very much'.\nPosted\n27/08/2025 at\n15:39:06\nHe didn’t turn down a move to Newcastle. He was desperate to go there.\nPosted\n27/08/2025 at\n15:47:58\nI read at the time his wage demands scuppered the deal Jake.\nPosted\n27/08/2025 at\n15:54:39\nPersonally I think it's a sad day when you see a former player, who we bought for 1.5m, who gave his all for Everton, playing with a broken toe, running after every ball kicked into the opposition half, running after your own knock on's, turn around and see that you're totally isolated on your own, with no support, that was Calvert-Lewin's game for the last few years, and you wonder why he wouldn't sign a new contract under Dyche, and think it's funny when he misses a penalty for his new club, pathetic. I will say this, he hasn't played for months, and was still making chances, should have scored, but he will score goals for Leeds, and definitely better than Piroe.\nPosted\n27/08/2025 at\n15:57:02\nThey couldn’t find a buyer for Callum Wilson so Eddie Howe called it off. Minteh all ready and packaged up to come join us.\nPosted\n27/08/2025 at\n16:01:31\nKevin 89. Apparently DLC would have cost Newcastle £40 million in total, they told him that was too much and ended the talks. We will have to wait and see if he's made the right move. He can't be on more money at Leeds than with us surely.\nPosted\n27/08/2025 at\n16:05:22\nACL tried hard, for that he can be commended but he IS limited as a footballer and not a top player.\nHe played for us when we are mostly shite which wasn't his fault. But no matter which way you spin it, he's a bang average finisher and a dreadful footballer in many respects.\nI wish the bloke well but we won't miss him.\nPosted\n27/08/2025 at\n16:19:33\nEverton battling West Ham for Barcelona’s right-back Hector Fort 19-year-old defende, a La Masia graduate.\nSpanish outlet SPORT report that there is interest from the Premier League, as Everton and West Ham are willing to formalize a loan for the full-back, who has looked very impressive, which is no surprise coming from Barca’s academy.\nHéctor Fort will officially leave Barcelona after the match against Mallorca. The player has received several offers and has agreed with the club to make a final decision on his next destination no later than next week.\nPosted\n27/08/2025 at\n16:22:29\nMichael - and there is also a fourth category who feel the need to share their enjoyment of someone else's misfortune and then have unnecessarily aggressive and sarcastic digs at people who happen to disagree with them or who don't react as expected. As you rightly say, fortunately we don't have to think or act like they do, either!\nPosted\n27/08/2025 at\n16:29:39\nI agree with you James, but he was put in a very difficult situation what with Eddie Howe seeing something in him that nobody else did. I don’t blame him for a second for getting excited at the prospect of getting out of Dychesville and playing for a Champions League club at his age. To those giving him grief for not signing a new contract for us - you would’ve been happier if he stayed, would you?\nWe’ve upgraded the whole forward line and moved on. And rightly so.\nPosted\n27/08/2025 at\n16:34:43\nPickford\nColeman\nKeane\nO'brien\nAznou/McNeil\nArmstrong\nGarner\nAlcaraz\nNdiaye\nDibling\nBarry\nPosted\n27/08/2025 at\n16:40:41\nLiam, I reckon we'll see Iroebugnam in for Dibling and Alcaraz on the right to start. Armstrong playing the role Dewsbury-Hall played on Sunday.\nPosted\n27/08/2025 at\n16:45:06\nIs TW sponsored by Sky sports now? Just think,we could have been the SKY SPORTS stadium, instead of the HILL DICKINSON stadium. I actually prefer the BRAMLEY MOORE stadium. Or the EVERTON stadium. Funny if the lettering was hill dickinson STADIUM. Yes, I am criticising the lettering on our new, STADIUM!\nPosted\n27/08/2025 at\n22:20:10\nOh my COD !!!!! Grimsby win Pen Shootout 12 - 11. Manu out.\nPosted\n28/08/2025 at\n20:54:36\nA Man Utd fan walks into a travel agents to book a UK holiday.\n\"Where's the best place to go this time of year?\" asked the Manc.\n\"You can't beat Grimsby\" the travel agent replied.\nHow to get rid of these ads and support TW\n© ToffeeWeb",
  "word_count": 5145,
  "scraped_at": "2026-02-14T01:49:53.046972",
  "_text_extracted": true
}