{
  "article_id": "f7d7b7163e03",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=324268",
  "title": "Jennifer Echegini joins Paris Saint - Germain",
  "date": "20240711T183000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jennifer Echegini joins Paris Saint-Germain\nParis Saint-Germain are delighted to announce the arrival of Jennifer Onyi Echegini to their womens team. The Nigerian international striker has signed a contract with the Parisian club until June 2027.\nBorn in Nijmegen in the Netherlands, Jennifer Onyi Echegini, also known as Joe, began her football career in England, where she grew up playing for Millwall Lionesses FC and then Arsenal. In 2019, the striker flew to the United States, joining the University of Mississippi before moving to Florida State in 2022.\nIn her final season in the American university league, the 23-year-old led her team to the title of NCAA Champions 2023. Her individual performances earned her numerous awards: best forward and best player in the ACC (Atlantic Coast Conference) and winner of the Hermann Trophy, the most prestigious award in American university football.\nJennifer Onyi Echegini kicked off 2024 by signing for Juventus. In just six months, the Nigerian scored 10 goals and provided one assist in 16 games across all competitions, helping the Turin club qualify for the UEFA Womens Champions League. Half a season was enough for her to be named in the leagues Team of the Year and voted best newcomer of the season.\nWith the Super Falcons, the striker has 10 caps and 1 goal to her name. She played in the 2023 Womens World Cup in Australia, losing out to England on penalties in the Round of 16.\n[i\"Today is a great moment in my career. Signing for Paris Saint-Germain is an immense source of pride. Im very proud to be joining a club recognised around the world for its ambition and excellence. I cant wait to get started and I cant wait to give my all to try and win as many trophies as possible, with my team-mates and for the fans.[/i]\nJoe Echegini, Paris Saint-Germain player\nJENNIFER ONYI ECHEGINI\nProfile\nPosition: Forward\nBorn 22nd March 2001, Nijmegen (Netherlands)\nNationality: Nigerian\nCareer\n=1rem2016-2018 Millwall Lionesses FC (England)\n2018-2019 Arsenal FC U21 (England)\n2019-2022 Mississippi State Athletics (USA)\n2022-2023 Florida State Seminoles (USA)\n2024-2024 Juventus (Italy)\nSince 2024 Paris Saint-Germain\nHonours\nClub\nNCAA league title (2023)\nWith Nigerian national team\n10 appearances 1 goal\nAbout Paris Saint-Germain Women\nFounded in 1970, Paris Saint-Germain is the most successful club and sports franchise in France and one of the top clubs on the European stage. Owned by Qatar Sports Investment (QSI) since 2011, the club has achieved spectacular results on and off the pitch. In addition to its mens football team, Paris Saint-Germain is a multi-sport, forward-thinking club with esports, judo, womens football and handball. The Club has a large and growing community of over 200 million followers on social networks, making it one of the largest in world sport. Our womens team is a benchmark in France and on the European stage, boasting a mix of world-class players and talented youngsters trained at the club. Since 2001, the Parisians have reached the last four of the Champions League seven times and have won six national titles: a French league title (2021), four Coupes de France (2010, 2018, 2022, 2024) and a Division 2 championship (2001). Over the seasons, the womens section has seen the emergence of some of the worlds greatest players, including Formiga, Cristiane, Laura Georges, Sakina Karchaoui, Grace Geyoro and Marie-Antoinette Katoto, all graduates of the academy. Since January 2024, the players have been based at Campus PSG, the Clubs ultra-modern training centre in Poissy, where they work alongside the mens team, the academy and pre-academy centres on a daily basis. Beyond the sporting aspect, Paris Saint-Germain is committed to creating a positive social impact through PSG For Communities, with the intention of allocating funds and proposing initiatives dedicated to empowering disadvantaged young people.\n( Press Release Image: https://photos.webwire.com/prmedia/8/324268/324268-1.jpg )\nWebWireID324268\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 658,
  "scraped_at": "2026-02-14T02:25:54.615439",
  "_text_extracted": true
}