{
  "article_id": "f7dbbb8a6d1f",
  "url": "https://www.derbytelegraph.co.uk/news/local-news/david-beckhams-world-cup-qualifier-8903339",
  "title": "David Beckham World Cup qualifier football boots up for auction in Derbyshire today",
  "date": "20231114T050000Z",
  "domain": "derbytelegraph.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Beckham’s World Cup qualifier football boots up for auction in Derbyshire today\nA pair of match-worn boots and a Manchester United home shirt from the 1999-2000 season will be sold in Etwall\nA pair of football boots worn by England and Manchester United legend David Beckham are to be auctioned off in Derbyshire today. The boots, worn by Golden Balls in a World Cup qualifier 25 years ago, could sell for thousands at auction in Etwall.\nThe star used the footwear, with ‘Beck’s’ stitched on the tongues, for a World Cup 1998 qualifying match between Italy and England on October 11, 1997. The match finished in a 0-0 draw.\nThe black, white and red Adidas Predator football boots plus Beckham’s autograph will go under the hammer in Hansons Auctioneers’ November 14 Sporting Auction. It is estimated the boots will attract bids of around £2,000-£3,000.\nPOLL: What's the best thing to do in Derbyshire on a rainy day?\nCharles Hanson, owner of Hansons, said: “David Beckham has long been one of England’s biggest superstars but right now his profile is higher than ever due to the success of the Netflix documentary Beckham. Millions of viewers are fascinated by his life story and some are discovering how special he is for the first time.\n\"His showbiz lifestyle and success post-football keep him in the public eye but it all began thanks to his ability to kick a ball. I wouldn’t be at all surprised to see his football boots surpass the estimate. They’re a rare memento of a brilliant player.”\nIf the boots are out of reach a more affordable option in the same sale is a 1999 Manchester United short-sleeved home shirt with Beckham 7 on the back. The large, Umbro shirt, new with tags, has Premiership Champions, F.A. Cup Winners, and Champions League Winners 1998-99 stitched around the badge.\nREAD MORE: Sir Bobby Charlton’s 1966 World Cup semi-final shirt up for auction in Derbyshire today\nIt is expected the shirt will be sold for around £80-£100. Beckham is regarded as one of the greatest midfielders and set-piece specialists of his generation.\nHis club career began with Manchester United. He made his first-team debut in 1992 aged only 17. He gained 115 England caps between 1999-2009. He is regarded as one of the greatest Manchester United and England players in the history of the game.\nIn the same auction, a shirt worn by one of England's most iconic players in the successful 1966 World Cup campaign will be sold. The top worn by Sir Bobby Charlton in England's semi-final match against Portugal is set to go under the hammer.\nEngland won 2-1 and Charlton scored both goals, taking the team through to face West Germany in the final four days later. The shirt, described as a hugely important piece of football memorabilia, will be offered by Etwall's Hansons Auctioneers with a guide price of £50,000-£80,000.\nWe send out the biggest stories in an email every day. Sign up for the main Derbyshire Live newsletter here.",
  "word_count": 505,
  "scraped_at": "2026-02-14T02:07:27.065650",
  "_text_extracted": true
}