{
  "article_id": "f7f19369cc96",
  "url": "https://www.bbc.co.uk/sport/football/65042578",
  "title": "Malaga : From Champions League to inescapable nightmare in 10 years",
  "date": "20230328T061500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ten years ago Malaga looked poised to become European football's latest rags-to-riches success story, joining a growing band of unfashionable clubs whose fortunes had been transformed by the arrival of a wealthy new owner.\nNow, though, the Andalusian club are on the brink of relegation to the Spanish third division, with their dream long ago turning into a seemingly inescapable nightmare.\nThis is their story, which should serve as another cautionary example that, when it comes to sudden injections of cash from afar, fans should be careful what they wish for.\nMalaga's European adventure\nOn 9 April 2013, Malaga were a few seconds - and a non-raised linesman's flag - away from the Champions League semi-final.\nAn entertaining team managed by Manuel Pellegrini, and featuring former and future Real Madrid stars Julio Baptista and Isco, were leading 2-1 on aggregate at Borussia Dortmund as their quarter-final second leg headed into injury time.\nBut then Jurgen Klopp's team scored twice in two minutes, with Felipe Santana's scrambled winner netted from a clearly offside position, to seal one of the most remarkable comebacks in Champions League history.\nDespite that heartbreaking loss, the future still looked bright for Malaga, a previously anonymous provincial club that had never won a major trophy.\nThe arrival of Qatari businessman Sheikh Abdullah Al-Thani as new owner in 2010 heralded a dramatic transformation, with new coach Pellegrini given a hefty budget in the transfer market and spending it wisely - including heavy investments in Ruud van Nistelrooy and Santi Cazorla - to secure fourth and sixth-placed finishes in La Liga.\nAlthough Pellegrini left for Manchester City in the summer of 2013, and rising star Isco was snapped up by Real Madrid, initially there was confidence that Al-Thani's backing would keep the team fighting for a prominent place in European football.\nBut then everything started to unravel, and it has been going downhill fast ever since.\nDreams turn into nightmare\nFirstly, the club was banned from the Europa League by new Financial Fair Play Rules, giving Al-Thani - who was already frustrated by Barcelona and Real Madrid's financially dominant position in Spanish football - a clear realisation that rules would obstruct his attempts to create a money-means-nothing superpower.\nBut even more significant developments came far from the world of football.\nIn 2011 Al-Thani had announced plans to substantially redevelop the marina in the tourist hotspot resort of Marbella, 40 miles west of Malaga.\nMarbella's mayor hailed the project - partially owned by the city hall alongside Al-Thani's company - as \"an emblematic work that will lay the foundations for a new city model and act as an engine of economic development for the entire coast\".\nThe idea of investing 400 million euros to create \"the most important marina anywhere on the Mediterranean coast\" - to be named, of course, the Al-Thani Marina - offered the promise of regenerating the local area, leading to thousands of new jobs and vast profits for its owner.\nBut the plans soon ran into problems, with Al-Thani seemingly unable to meet his financial commitments.\nAt the same time, his relationship also soured with another business partner, BlueBay Hotels, with whom he had struck a deal to jointly own and manage the football club. Those sagas eventually ended up in court, with both rulings going against the increasingly absent Al-Thani.\nThe marina remains unbuilt.\nThe fortunes of the football club mirrored those of its owner, and Malaga were inevitably relegated in 2018 amid unmanageable debts. Two years later, in February 2020, a regional court ordered Al-Thani's removal as club president because of alleged misappropriation of funds, with an audit concluding that Al-Thani and his family owed the club more than 7m euros.\nControl of club affairs was handed to a court-appointed administrator, Jose Maria Munoz, who has stayed in charge ever since and largely succeeded in steadying the club's financial position.\nThe football side of the business, however, has not improved.\nAnother relegation is 'nailed on'\nFreelance journalist Alex Fitzpatrick, who runs a Twitter feed and podcast dedicated to the Spanish second division, explained to BBC Sport: \"Former Malaga player Manolo Gaspar was made the club's sporting director, and he was not up to the job.\n\"He oversaw all signings and many of them were disastrous. The squad planning was very poor, and his managerial appointments were scattergun.\"\nScattergun is perhaps too kind a description, with Malaga racing through 10 managers in the past five years, including three this season alone.\nThe most recent incumbent, Sergio Pellicer, returned for his second spell in January, shortly before Gaspar himself departed to add further chaos behind the scenes.\nHamstrung by a litany of poor signings, no managerial stability and an absent owner who continues to protest his innocence, it is no surprise that the team has suffered.\nResults and performances this season have been consistently poor, and Malaga are deep in relegation trouble - eight points adrift of safety with nine games remaining.\n\"It looks nailed on that they will be relegated,\" says Fitzpatrick. \"But beyond this season, there is some hope they can bounce back because the club has a good youth system and is now commercially well-run.\n\"The most important decision is appointing a new sporting director to replace Gaspar. The rumour is they are looking at Chema Aragon from Mirandes, who looks like he'd be perfect. The future depends hugely on that appointment.\"\nAt some point, the future of the club's ownership will also be settled, with another court hearing in the 'Al-Thani case' scheduled for 21 April.\nAl-Thani will surely eventually have to give up or sell his controlling stake in the club, and Qatar Sports Investments chief Nasser Al-Khelaifi - owner of Paris St-Germain - has admitted his group is interested in buying Malaga.\nOn the field, with 27 points still available, it is too early to completely give up on avoiding relegation. However, the ongoing demise currently shows no sign of abating, and Malaga's glory days of Champions League knockout stages will surely soon be replaced by semi-professional opponents in the regionalised third division.\nWhat's in store for Manchester United? A brand-new podcast follows the sale of one of the biggest clubs in the world\nThe Sugababes' magical live performance: Get lost in old favourites and enjoy an unexpected cover",
  "word_count": 1049,
  "scraped_at": "2026-02-14T01:59:46.871362",
  "_text_extracted": true
}