{
  "article_id": "f7f87a422e06",
  "url": "https://www.caughtoffside.com/2024/02/24/aston-villa-linked-with-denzel-dumfries-and-oscar-gloukh/",
  "title": "Aston Villa linked with Denzel Dumfries and Oscar Gloukh",
  "date": "20240224T230000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa are aiming to make “a few elite additions” to Unai Emery’s squad during the summer transfer window, according to transfer insider Dean Jones.\nJones has informed GIVEMESPORT that a potential move for Red Bull Salzburg youngster Oscar Gloukh cannot be dismissed either, as Villa are also seeking emerging talent.\nMonchi, appointed as the Villans’ president of football operations in June, will spearhead the recruitment efforts for the 2024/25 campaign. He has already overseen the arrivals of Pau Torres, Clement Lenglet, and Nicolo Zaniolo to the Midlands during his tenure.\nIn July, Moussa Diaby made history as Villa’s most expensive signing, completing a £51.9 million transfer from Bayer Leverkusen.\nWith ambitions to challenge for a Champions League qualification spot, the club are laying out plans to demonstrate significant ambition in the upcoming months.\nAston Villa have initiated discussions with Denzel Dumfries’ representatives to gauge his interest in joining the club in the summer, as reported by Italian media outlet FC Inter News. The club’s pursuit has received a boost as it appears increasingly likely that Dumfries will seek a new challenge at the end of the season.\nThe report indicates that Inter are leaning towards selling the Netherlands international, who has entered the final 18 months of a contract valued close to £53,000-per-week as of the turn of the year. Bayern Munich and Manchester United are also reportedly interested, but Dumfries has refused to agree to new terms at the San Siro due to the club hierarchy’s reluctance to meet his demands.\nAston Villa’s transfer plans for the summer\nProminent journalist Jones, in a recent statement to GIVEMESPORT, highlighted that the inclusion of Dumfries would represent a significant enhancement and underlines the progress made by Villa under Emery’s leadership. However, Jones cautioned that persuading Dumfries to reject alternative opportunities as he prepares to depart Inter might pose a challenge.\nIn addition, the respected journalist indicated that RB Salzburg’s 19-year-old sensation Oscar Gloukh is on the list at Villa Park.\n“The links to Oscar Gloukh are interesting. Obviously, we’re going to see two types of signings coming up for Aston Villa.\n“There will be a few elite additions that look to take them on immediately and try to keep them in that conversation of knocking on the door of the top four.”",
  "word_count": 382,
  "scraped_at": "2026-02-14T01:56:44.619546",
  "_text_extracted": true
}