{
  "article_id": "f8349a91ab15",
  "url": "https://metro.co.uk/2026/01/17/chelsea-plan-transfer-move-jeremy-jacquet-want-sign-cover-cole-palmer-26344675/",
  "title": "Chelsea set to submit £43million bid for France defender",
  "date": "20260117T104500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are lining up a move for France Under-21 international Jeremy Jacquet and are lining up a bid to sign the defender in the January transfer window.\nThe Blues have missed their defensive linchpin Levi Colwill this season after the England international sustained a serious knee injury before a ball of the new campaign had been kicked in anger.\nChelsea spurned the opportunity to sign experienced cover and have suffered the consequences with the likes of Tosin Adarabioyo, Benoit Badiashile and Wesley Fofana all struggling to step up.\nAccording to Fabrizio Romano, Chelsea have drawn up a three-man shortlist as they aim to equip new manager Liam Rosenior with the tools that would aid his cause to secure Champions League qualification.\nRennes star Jacquet appears to be the priority target and the Blues have held direct talks with the Ligue 1 club in the last 24 hours and are prepared to submit a £43million offer.\nEven before Colwill’s injury, Chelsea had been in the market for a new defender in the summer but failed in their attempts to persuade Dean Huijsen to snub a move to Real Madrid from Bournemouth.\nWhile Chelsea appear to be in pole position to secure the services of the 20-year-old who has made 16 Ligue 1 appearances this season, they could yet face competition from Bayern Munich who missed out the signing of Marc Guehi toManchester City on Friday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nChelsea are also, meanwhile, giving consideration to make an attacking signing in what remains of the window given the ongoing concerns over Cole Palmer’s fitness.\nThe Blues’ talisman was missing again on Wednesday night as Rosenior slipped to his first defeat at the helm, a 3-2 reversal against Arsenal in the first leg of the Carabao Cup semi-final.\nPalmer and Reece James have not played yet under Rosenior but both trained on Thursday and could feature against Brentford.\nTyrique George, who has largely been frozen out after a promising breakthrough campaign last season, is another player who has been linked with a departure.\nA move to Fulham for the 19-year-old academy graduate collapsed on transfer deadline day and when asked about his future, Rosenior said: ‘The honest answer is I don’t know.\n‘A lot of things have to come together for a player to leave. You need the right offer, it needs to be right for the player. I’ve heard nothing in terms of Tyrique.’\nRosenior has also refused to confirm Robert Sanchez is his number one goalkeeper following two costly mistakes against Arsenal.\nPoor positioning at a corner in the first half then later a cross that slithered through his hands embarrassed Sanchez and left his team facing an uphill struggle to reach the Carabao Cup final after losing the semi-final first leg.\nBack-up goalkeeper Filip Jorgensen is wanted by West Ham but Chelsea are currently reluctant to allow him to leave mid-season as it would leave Rosenior without significant competition for Sanchez.\nThere is however an acknowledgment within the club that the situation could change later in the transfer window.\nMore Trending\nFormer boss Enzo Maresca repeatedly insisted the Spaniard was his first choice, even when leaving him out for a number of matches last season following a spate of errors.\nRosenior though, despite defending his goalkeeper after the Arsenal defeat, was not willing to make the same claim.\n‘It’s the same for every position,’ he said. ‘I’m here to assess every position. I don’t have number ones and number twos, it’s not how I work.\n‘At every club there has to be competition. You have to earn your spot in this team. That’s the message to all of the players. I don’t have guaranteed number ones or guaranteed number nines.’\nMORE: Nottingham Forest vs Arsenal: Predicted lineup today and confirmed team news\nMORE: Chelsea vs Brentford: Predicted lineup today and confirmed team news\nMORE: Man Utd vs Man City: Predicted lineups today and confirmed team news",
  "word_count": 707,
  "scraped_at": "2026-02-14T02:09:43.004791",
  "_text_extracted": true
}