{
  "article_id": "f871a5bef013",
  "url": "https://thepeoplesperson.com/2024/12/06/matthijs-de-ligt-opens-up-on-quite-difficult-start-to-life-in-the-premier-league-and-man-united-288397/",
  "title": "Matthijs de Ligt opens up on  quite difficult  start to life in the Premier League and Man United - Man United News And Transfer News",
  "date": "20241207T001500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United defender Matthijs de Ligt has opened up on his difficult start to life in the Premier League, indicating that he is now settled and almost fully acclimated to the demands of English football.\nDe Ligt joined United in the summer from Bundesliga giants Bayern Munich.\nSince his arrival, the Netherlands international has been a mainstay in the team. He was a key player under both former manager Erik ten Hag and interim boss Ruud van Nistelrooy. New head coach Ruben Amorim has also demonstrated a clear preference for De Ligt as part of his three-man defence.\nDe Ligt has so far made 19 appearances across all competitions. He has scored one goal in that period. He almost grabbed a second during United’s last game, a 2-0 loss at the hands of Arsenal, but his header was saved by David Raya.\nThe defender spoke to club media and said, “I feel well settled in now. We are now three months later. I remember my old agent, who, unfortunately, passed away, Mino Raiola, always told me that, normally after six months, you start to feel a little bit better and, after one year, you can say that you are completely settled.”\n“Yeah, I think, after three months, I’m quite settled and I already feel good. I feel good with the team, with my team-mates, with the stadium, with the fans. So, hopefully, we can continue like that and me personally also.”\n“I expected it [the Premier League] to be like this. Obviously, in the beginning, it’s quite difficult because, first of all, you come from a different league.”\n“Second of all, I didn’t have one normal pre-season in the last couple of years. So it was because of injuries and because of the Euros last summer.”\n“So it’s quite normal at the beginning that you have some trouble adapting to the pace of the game and to the pace of the players. I feel that game by game, I’m getting better. I’m getting more used to the opponents, about the league, and, yeah, then it becomes a lot easier.”\nWhen asked about his aerial threat, De Ligt remarked, “That’s something that is always important, especially now in modern football. The differences are so, so small. So a set-piece can make a big difference. So, obviously, we train on that a lot. I know that I have good qualities in this area. I think I’m quite strong in the air, jumping. My timing is quite good. So, yeah, hopefully more goals can come.”\nThe 25-year-old highlighted his ability to play across all three positions of the back-three as one of his greatest strengths.\n“I’ve played in the middle but I think I can also play on the left and on the right. I played, also in Bayern Munich, a lot on the left and in the Champions League and competitions like that. So, yeah, I’m quite excited to see where the future is and what will be my best position.”\nUnited are back in action on Saturday when they host Nottingham Forest at Old Trafford.\nFeatured image Gareth Copley via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 526,
  "scraped_at": "2026-02-14T01:52:10.165840",
  "_text_extracted": true
}