{
  "article_id": "f8963bafed31",
  "url": "https://mwnation.com/bullets-hit-by-injuries/",
  "title": "Bullets hit by injuries - The Nation Online",
  "date": "20230815T100000Z",
  "domain": "mwnation.com",
  "source_country": "Malawi",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bullets hit by injuries\nFCB Nyasa Bullets will be without four key players as they begin their Confederation of African Football (CAF) Champions League campaign this Sunday with an away preliminary round fixture against Equatorial Guinea’s FC Dragons due to injuries.\nBullets coach Kallisto Pasuwa confirmed that striker Hassan Kajoke, midfielder Mike Mkwate, attacker Stanley Billiat and defender Alick Lungu will not be included in the squad that is scheduled to leave this Thursday.\nHe has since described the situation as unfortunate, but he is confident the other players will stand up to be counted.\n“My biggest worry is the injuries, but if we can sit down and talk to the players, I believe we can salvage the situation. We can do with what we have; we just need to play with a good structure,” he said.\nThe coach said the enormity of the injury situation made it difficult for potential replacements to adjust to a certain play in domestic action, but he is still hopeful they will up their game.\nFootball analyst Parry Chinyama yesterday said the injury situation at Bullets necessitates an extraordinary effort for the team to perform well.\nHe said the People’s Team gambled by not beefing up their squad with quality players.\n“When they were planning to compete in the Champions League at the beginning of the season, they were supposed to sign at least three top quality players for each position,” said Chinyama.\n“For example, on the left back, Bullets will struggle in Lungu’s absence because Precious Sambani is the only other player that naturally fits in that position. We have sometimes seen Gomezgani Chirwa being improvised, but that is a risk for a team competing in such a big tournament.”\nHe said Bullets took a huge gamble by letting go enterprising midfielder Chimwemwe Idana without an immediate replacement of his calibre.\nChinyama said the departure of Nigerian striker Babatunde Adepoju was another major blow.\n“If the team struggled against local teams such as rookies Extreme FC, it would require a miracle to do wonders on the continental stage,” he said.\nKajoke is expected to be out for two weeks after sustaining a leg injury while Billiat is scheduled to recover from a knee ligament injury in the next four weeks.\nMkwate is in Plaster of Paris and might miss the better part of the season whereas Lungu also suffered a fractured leg and has been given six weeks to recover.\nSome players such as midfielders Yamikani Fodya and Ernest Petro are back after recuperating from injuries but Pasuwa believes sometimes it takes a bit of time to be fully fit.\nThe development comes at a time when the People’s Team failed to beef up the squad during the player transfer window that closed yesterday.\nBullets were booted out of the CAF Champions League in the preliminary stages in their last four attempts.\nLast year, they were eliminated on a 4-0 aggregate by Simba SC of Tanzania after 2-0 defeats in two-legged ties. Before that, they suffered a 3-2 aggregate defeat to AmaZulu FC of South Africa, having won the first leg 1-0 away before losing the reverse fixture.",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:00:36.670041",
  "_text_extracted": true
}