{
  "article_id": "f8b23c00c41e",
  "url": "https://menafn.com/1108596242/Sergi-Roberto-Transfer-Ex-Barcelona-Captain-Joins-Serie-A-Side-Como",
  "title": "Sergi Roberto Transfer : Ex - Barcelona Captain Joins Serie A Side Como",
  "date": "20240824T111500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sergi Roberto Transfer: Ex-Barcelona Captain Joins Serie A Side Como\nAlso read:\nInside world's largest football stadium: 115,000-capacity venue in Morocco aims to host 2030 WC final\nRoberto joined Barcelona's famous La Masia academy in 2006, and went on to make 373 appearances for the senior team, scoring 19 goals. The versatile midfielder's most iconic moment with the club came back in 2017, when he scored the winner against Paris Saint Germain in the 6-5 aggregate win in the UEFA Champions League last-16 tie. Moreover, he has won 20 titles with Blaugrana, including seven La Liga trophies.\n\"Como is excited to announce the signing of midfielder Sergi Roberto on a two-year contract,\" the statement from the club read. \"The former Barcelona captain, who joined the club as a 14-year-old went on to win seven La Liga championships and two Champions Leagues, joins the club as a free agent.\"\nRoberto is a versatile footballer, who will offer multiple options to the manager. Apart from playing in the midfield, the 32-year-old is more than capable of occupying the right-back position. He is a team-man, who is willing to contribute to the side's success in whatever way possible.\nComo earned automatic qualification to the top flight of Italian football after securing second-place finish in the 2023-24 Serie B standings. Cesc Fabregas, who was the club's assistant coach last term, was appointed as the head coach this July.\nThe Blue and Whites have left no stone unturned on their return to the Serie A, brining in the likes of Rafael Varane, 2018 FIFA World Cup winner, from Manchester United, along with veteran Pepe Reina, Andrea Belotti and Andrea Dossena.\nComo started their 2024-25 Serie A campaign with a 3-0 defeat away to Juventus at the weekend. Their next game is against Cagliari at Sardegna Arena on Monday (August 26).\nAlso read:\nIlkay Gundogan completes sensational Man City return from Barcelona; says feels nice to be home (WATCH\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 379,
  "scraped_at": "2026-02-14T01:57:35.672982",
  "_text_extracted": true
}