{
  "article_id": "f90268417f00",
  "url": "https://www.bbc.com/sport/football/articles/ckg81nppwyko",
  "title": "Pep Guardiola : Manchester City boss hits back at Fabio Capello  arrogant  jibe",
  "date": "20250315T113000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Guardiola hits back at Capello's 'arrogant' jibe\n- Published\nPep Guardiola has hit back at Fabio Capello's latest criticism of his management style - and the Manchester City boss insists he has \"raised the bar\" in the Premier League.\nThe pair have had a frosty relationship since the Italian managed Guardiola for a short time at Roma in 2002, and the 78-year-old felt the Spaniard spoke out of turn.\nCapello reignited their feud in the middle of City's woeful run of one win in 13 games earlier this season.\nSpeaking on Sky Italia, the former Juventus, AC Milan and England coach said Guardiola was \"way too arrogant and presumptuous\" because he wanted to prove City were winning matches through his tactics.\nWhile they have stabilised their campaign, City are still struggling for consistency and are fifth in the Premier League and face an FA Cup quarter-final at Bournemouth on 30 March for their only chance of a major trophy this season, having won the Community Shield in August.\nAfter their 1-0 defeat at third-placed Nottingham Forest last weekend, Capello gave an interview to Spanish newspaper El Mundo in which, while praising Guardiola's tactics, he said the City manager was \"arrogant\" and had \"caused enormous damage\" to Italian football because coaches tried to imitate his tactics.\nGuardiola was clearly aware of the comments, given the manner in which he acknowledged them when a question was asked before Saturday's league game against Brighton.\n\"I listen to everything that people say about me, so be careful,\" he said.\n\"It's not the first time Mr Fabio Capello has said that. I'm not good enough to ruin Italian football. A big hug to Fabio. A big hug.\"\nThe response continued a long-established policy of Guardiola referring to individuals he has a problem with as \"Mr\", which includes former player Joao Cancelo, ex-midfielder Yaya Toure's agent Dimitri Seluk and Kevin Parker, general secretary of the Manchester City supporters' club, who got embroiled in a spat over attendances.\nThe sarcasm extended to a second answer as he assessed the ability of middle-ranking Premier League teams to win the title in the future.\n\"I don't want to pretend to be, and naming again one of the big managers, one of the exceptional managers in Fabio Capello, and look arrogant, but we helped raise the bar in the Premier League,\" added Guardiola, who made five appearances in his one-year playing spell at Roma.\n\"Teams had to go to the markets and that helps people. People want to do good, people are well organised, have good structures, good decisions, good players everywhere.\n\"I've been here when I went to Bournemouth in the beginning, and now it's different. And when I went in the beginning in Brighton, and now it's different. And when I went in Fulham in the beginning, and now it's different.\"\nBournemouth, Brighton and Fulham have played in the Championship during Guardiola's nine-year City tenure and are now challenging for Champions League qualification places this season.\n\"I'm an old guy, I'm the oldest manager here, nine years. So I know the evolution of the Premier League has been massive,\" he added.\nRelated topics\n- Published26 July 2022",
  "word_count": 529,
  "scraped_at": "2026-02-14T01:55:09.086620",
  "_text_extracted": true
}