{
  "article_id": "f9060a063965",
  "url": "https://theathletic.com/4385689/2023/04/06/champions-league-uefa-real-madrid/",
  "title": "The Business of Football : Real Madrid net £116m from Champions League win",
  "date": "20230406T071500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Stop me if you have heard this one before but UEFA’s 47th annual congress in Lisbon on Wednesday had a lot in common with FIFA’s 73rd annual congress in Kigali last month.\nThere were lots of speeches, obviously, but there was also the spectacle of a president getting elected for a third term that has recently been “clarified” as a second term (because the first term was not quite full) by standing ovation. It was FIFA supremo Gianni Infantino, head of football’s world governing body, in Rwanda’s capital and his European counterpart Aleksander Ceferin feeling the love in Portugal.\nAdvertisement\nIf you are wondering why nobody else fancies these jobs — Ceferin’s UEFA salary is just under £2.4million ($3m), with another £240,000 a year from FIFA for being one of its vice-presidents — it is because incumbents rarely lose sporting elections.\nWhy would they when the money flowing from the centre keeps rising?\nBut Ceferin, to be fair, has also done a good job of being all things to all people since getting the gig in 2016.\nThe Slovenian lawyer was expected to champion the little guys when he arrived and he has managed to do just enough of that — by making sure the amount of cash dished out to smaller clubs and football associations has gone up, giving small- and medium-sized countries more competitive fixtures via the Nations League, and by reintroducing a third club competition (the Europa Conference League) — all without spooking the big boys.\nBut as was seen during the European Super League crisis in 2021, it is a difficult balancing act. Like a man learning how to walk on stilts, Ceferin often finds himself in some painful positions.\nFor example, during his speech to congress, he waxed lyrical about the perils of globalisation, the centrality of merit to the European sports model, the importance of “the middle classes” and “exploding the myth that the privatisation of football is unstoppable”. He even praised the Premier League for its “highly egalitarian distribution of wealth”.\nGood stuff, comrade, but how does this square with your recent comments about turning a blind eye to the creation of multi-club conglomerates because that is “what investors want”?\n“I agree that (the rise of multi-club groups) is an issue,” Ceferin told reporters. “But it’s too fast to say anything.\n“I agree the (club) owner can be anyone, well, almost anyone, within certain rules. And the rules should be strict. But what we must have in mind is sustainability.”\nAdvertisement\nIf that sounds a bit “all animals are equal but some animals are more equal than others”, stop being so cynical, enjoy the football and remember that UEFA’s annual revenues for next season are projected to be over £6billion, an annual increase of 17 per cent.\nReal Madrid earn £116.4m from Champions League win but Premier League TV cash pays off\nSpeaking of big numbers, UEFA also distributed its 2021-22 financial report to the delegates. The Athletic knows this because they all left them behind and we picked one up.\nInside its glossy cover, it confirmed for the first time exactly how UEFA split the €3.5billion (£3.06bn; $3.81bn) cake created by its club competitions last season.\nThe formula is well established. The Champions League clubs share €2billion, with 25 per cent distributed evenly between the teams that make the group stage, 30 per cent dished out according to their 10-year records in Europe (which some might say is a loose interpretation of merit), 15 per cent based on the size of their domestic TV markets (another not particularly meritocratic metric) and the final 30 per cent linked to their actual progress through the tournament. Simple, then.\nReal Madrid came out on top with a total payment of €133.7million. Liverpool, the team they beat in the final in Paris, were the second biggest earners, taking home a cheque for €120million. Of the beaten semi-finalists, Bayern Munich pipped Manchester City, €109.6million to €108.7million. Paris Saint-Germain were the best of the rest, earning €92.2million, a FIFA vice-president’s wage more than Chelsea’s haul of €91.9million.\nThe skewing effect of the “market pool” element of the prize fund can be seen better if we look at who earned what from the Europa League.\nWinners Eintracht Frankfurt led the way with a payment of €38million but beaten semi-finalists West Ham were the second biggest earners on €32.1million, thanks to a whopping market pool payment of €17.4million — six times the amount beaten finalists Rangers got from Scotland’s contribution to the TV pot. Their total payment was €20.7million, which was also beaten by Bayer Leverkusen, who went out in the last 16.\nAdvertisement\nRoma’s victory in the Europa Conference League was worth €19.2million — not bad for a few Thursday nights’ work and 14 times more than Women’s Champions League winners Lyon earned for their efforts.\nPolice escorts to matches a sticking point in British and Irish Euro 2028 bid\nThere is a moment in every sports federation’s annual meeting when those with serious caffeine or nicotine addictions, or weak bladders, leave the room for the first time: it is when the finance director stands up.\nBut those who stuck around for Josef Koller’s presentation will have heard UEFA’s chief beancounter admit that its cash reserves have sunk below the plimsoll line of half a billion euros (£437million) for the first time in a decade.\nThose sneaking back into the room after Koller’s confession then heard UEFA treasurer David Gill, the former Manchester United chief executive, say the plan is to replenish those reserves with a couple of lucrative men’s European Championships.\nBecause while it is the Champions League that brings in the big bucks, the last item illustrates the fact that nearly all of that goes straight back to the clubs. The money that UEFA distributes to its member associations for training coaches, recruiting referees and building grassroots facilities comes from the Euros.\nAnd that is why many have assumed that UEFA will build on the likely bonanza from Germany 2024 with a 2028 tournament hosted by England, Ireland, Northern Ireland, Scotland and Wales, as opposed to the slightly more risky and less lucrative proposal from Turkey.\nThat was certainly the consensus when the Football Association pulled the plug on its plan to lead a British and Irish bid for the 2030 World Cup. Surely the 2028 Euros were in the bag as a consolation prize/reward for not splitting the European vote for the big one two years later?\nAdvertisement\nMaybe, maybe not. There are certainly no Easter chicks being counted by the FA, understandably so when you remember its record in bidding races.\nBut there is also a potential traffic jam to circumvent for the British and Irish bid, which must get its final bid dossier in on April 12.\n“We are going to submit a very strong bid — I don’t think there are any big gaps on anything,” said FA chief executive Mark Bellingham, before admitting that there was still a gap on one thing.\n“There’s still an ongoing dialogue on the police escorts. We believe we’ve got a solution. We’ll have to work through that with UEFA and check that they’re comfortable with how far we’re able to go.”\nThe issue is that British police forces simply do not escort team buses to matches. They take the view that taxpayers should not have to subsidise professional athletes so they can get to work on time and maybe those buses should just leave a bit earlier.\nNow, because this view is shared by other countries, police escorts are not one of the “guarantees” a host nation’s government must give. But they are something UEFA would really, really like. Turkey will certainly lay on a fleet of cops on motorbikes.\nFor what it’s worth, Portugal provided a police escort for the buses from the delegates’ hotel to the conference centre that hosted the congress — and The Athletic’s taxi driver was told off for overtaking one of the buses. We gave him a good tip for trying, though.\nNorway’s Klaveness will be back after missing out on UEFA ExCo seat\nThough Ceferin’s re-election was hardly a nail-biter, there was plenty of jeopardy in some of the other races for UEFA ExCo seats and FIFA Council invites.\nFor the former, there were 11 candidates for seven seats. Four were incumbents and we all know what tends to happen with them.\nAdvertisement\nSo it came to pass, with Albania’s Armand Duka, Jesper Moller Christensen of Denmark, Spanish FA chief Luis Rubiales and Ukraine’s Andrii Pavelko all returned for four more years.\nThe latter’s victory was a little controversial as he is fighting corruption charges related to the misuse of funds meant for artificial pitches. He denies doing anything wrong so he stayed on the ballot.\nJoining this quartet at UEFA’s top table are Philippe Diallo, the acting president and deputy vice-president of the French FA, Petr Fousek of the Czech Republic and Georgia’s Levan Kobiashvili.\nThis meant Liechtenstein hopeful Hugo Quaderer and Malta’s Bjorn Vassallo came up just short, while Norway’s Lise Klaveness and Scottish FA president Rod Petrie were some way off the pace.\nFor Petrie, it was probably a case of him being the odd Brit out, as there are already two of his UK compatriots on the ExCo, with one, Laura McAllister of Wales, being added on Wednesday via “a big round of applause” because she was unopposed for the place reserved for female candidates.\nFor Klaveness, it was more a case of football’s conservatism. The Norwegian FA president is almost overqualified for the role, as she is a former footballer and successful lawyer. She, however, was not going for a female-only role, which was, as Sir Humphrey Appleby used to put it in British political comedy Yes, Minister, a bold move.\nBut Klaveness has also gained a reputation for speaking out on issues which should not be contentious — migrant workers’ rights in Qatar, for instance — but often are in the delicate world of football politics.\nShe did not sound too downhearted afterwards, though, and the consensus in the room was she will be back and the work she has put in over the last few months making friends will not be wasted.\nAdvertisement\nEngland’s Hewitt becomes first woman to beat a man in a UEFA vote\nThat is certainly the lesson from Debbie Hewitt’s successful campaign to unseat incumbent David Martin in the two-horse race for the FIFA vice-presidency reserved for the British Home Nations.\nDo not ask us why this anachronism has been allowed to last this long — there has been a British vice-president at FIFA since 1946 — but it has and nobody seemed overly upset about it in Lisbon. This is partly because UEFA sees it as another way to guarantee a senior European at FIFA and partly because Hewitt waged an excellent campaign.\nA successful businesswoman, she is the FA’s first female chair and now FIFA’s first female VP and the first woman to beat a man in a UEFA vote. Born in Nottingham, she is a Liverpool fan with a soft spot for Notts County.\nBut in the interest of fairness, this reporter asked her the same question he asked the last English FIFA VP, Greg Clarke, when he had just finished trying on his new blazer: are you going to accept the $250,000 salary and $250 daily expenses while on FIFA duty?\n“I’m 20 minutes into the job and my (new FIFA) suit doesn’t fit, so I’m going to get that fixed first,” said Hewitt. “But I think it’s fair to say that my predecessors have all taken the salary.\n“It’s a big job and you can bet that I’ll give it my heart and my soul. And whatever the compensation is, I’ll talk to FIFA when I understand what the whole package is.”\nSounds like a yes, then, but she is also very unlikely to just attend these meetings and say or contribute nothing. Like Klaveness, Hewitt has things to say and do.\nFor what it’s worth, Clarke’s answer at the 2019 congress in Rome was along the lines of “you bet I will”, although he was forced to stand down a year later after putting his foot in his mouth one time too many.\nAdvertisement\nLast UEFA meeting for Russia?\nAway from the elections and the vote to award the 2025 Women’s Euros to Switzerland, there were not that many decisions made in Lisbon, although one that was made in the pre-congress ExCo meeting on Tuesday nearly sneaked under the radar.\nAsked about the calls to extend the competition ban that Russia’s various teams are under at present to Belarus, its closest ally in the war against Ukraine, Ceferin said that would be a matter for the next ExCo meeting. But he did reveal that it had already been decided to strip Belarus of the right to host the 2025 Under-19 Women’s European Championship.\nWhether this draconian sanction will drive Belarus into the arms of the Asian Football Confederation, as has been mooted by Russia and its friends east of the Caucasus, remains to be seen.\nThe Russian Football Union did attend Wednesday’s gathering of European nations and its delegates voted. Might this be the last time?\nCeferin did not want to get drawn into that but he did say his “personal view” is that it is hard to see anyone in Europe wanting to play Russia, or Russian clubs, in competitive games while the war in Ukraine is still on.\nFor Ukraine, there is still the prospect of World Cup games in 2030 to look forward to, as Portuguese prime minister Antonio Costa opened the congress by clarifying that the east European country remained a part of his nation’s bid with Morocco and Spain.\nIt had been reported recently that he had said Morocco had effectively replaced Ukraine in the bid but he could not have been clearer that they were still in the picture on Wednesday and Ceferin later dismissed the “Ukraine out” story as bad translation.\nPSG boss Al-Khelaifi’s padel marathons\nWatching all of the day’s drama from the end of the top table was Nasser Al-Khelaifi, UEFA ExCo member, European Club Association president and chairman of beIN Media Group.\nAdvertisement\nHe is also the chairman of Qatar Sports Investments, which makes him the boss of Paris Saint-Germain and a significant shareholder in Portuguese club Braga, too. Perhaps he is one of those investors Ceferin was talking about who want to control more than one club in the same competition.\nHe is certainly very good at juggling different jobs, because he is also the boss of Premier Padel, the new professional tour for the sport that is fast replacing golf as every footballer’s favourite pastime.\nA former tennis pro, Al-Khelaifi is addicted to the tennis/squash hybrid and plays it whenever and wherever he can.\nLast week, during the ECA’s general assembly in Budapest, the Qatari played from 10pm to 1am for four nights with Patrick Kluivert, Robbie Keane, John Terry and Andriy Shevchenko. It had to be that late as it is Ramadan and Al-Khelaifi needed some dinner before schooling these former footballers on the finer points of padel.\nAnd on the eve of the UEFA Congress, he found a club in Lisbon actually called Premier Padel. There, he and fellow ExCo member (and Poland, Juventus and Roma great) Zbigniew Boniek played a pair of locals until the small hours of the morning.\nMaybe he should introduce mandatory padel sessions at PSG as a means to finding lucky bounces, the right combinations and a more positive spin on things.\n(Top photos: Getty Images; design: Sam Richardson)",
  "word_count": 2616,
  "scraped_at": "2026-02-14T02:09:52.180957",
  "_text_extracted": true
}