{
  "article_id": "f907f0cfe580",
  "url": "https://www.90min.com/premier-league-manager-responds-links-bayern-munich",
  "title": "Premier League manager responds to links with Bayern Munich job",
  "date": "20240423T003000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League manager responds to links with Bayern Munich job\n- Aston Villa boss Unai Emery has denied interest in a move to Bayern Munich\n- Thomas Tuchel due to leave German giants in the summer\n- Villa edging closer to Champions League qualification after 3-1 win over Bournemouth\nAston Villa boss Unai Emery has dismissed rumours linking him with a move to Bayern Munich this summer.\nVilla recorded their 20th league victory of the season and moved six points clear of Tottenham in the race for Champions League qualification when they defeated Bournemouth 3-1 on Sunday thanks to goals from Morgan Rogers, Moussa Diaby and Leon Bailey.\nEmery has been the driving force behind the club's improvement since replacing Steven Gerrard at Villa Park in 2022 and was handed the club's longest ever managerial contract of four and a half years.\nHis success has attracted the eyes of other clubs, with links now suggesting Emery could replace Thomas Tuchel at Bayern.\nA departure from the Premier League may not come anytime soon, however. The Villa manager has since responded to the German giants' reported interest, simply stating: \"I am focused here, 100 per cent.\"\nEmery's reaction will come as sour news to some in German football who seemed excited about the prospect of the former Arsenal boss joining the Bundesliga. Bayern and Germany legend Lothar Matthaus was quick to share his thoughts on Emery when asked who should fill the vacant role.\nHe told Sky Germany: \"I would get Emery from Villa. He's doing a great job there.\n\"He has a lot of experience - including internationally - and he has titles to his name with Sevilla, for example. He speaks perfect English.\n\"He can then learn German, but the players can all speak English anyway, so I don't see any language barrier. Emery would also be someone who would bring in a new wind, he would be a new face in the Bundesliga and that would fit well with Bayern Munich.\"",
  "word_count": 333,
  "scraped_at": "2026-02-14T01:56:51.547924",
  "_text_extracted": true
}