{
  "article_id": "f90f112dc102",
  "url": "https://www.cityam.com/premier-league-clubs-spend-more-than-european-rivals-combined/",
  "title": "Premier League clubs spend more than European rivals combined",
  "date": "20250902T151500Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League clubs spend more than European rivals combined\nPremier League clubs highlighted the growing financial gap between English football and its rivals during the summer transfer window, spending more than the other members of the so-called Big Five combined.\nTeams collectively spent £3bn gross, a record sum for the division and 51 per cent of the aggregate total invested by the Big Five, which also includes Italy’s Serie A, Spain’s LaLiga, Germany’s Bundesliga and Ligue 1 in France.\nThat was up five percentage points on the average for the previous five summer transfer windows, according to analysis by Deloitte’s Sports Business Group.\nIn an even starker illustration of the Premier League’s financial superiority, its clubs spent £1.2bn net compared to an average of £78m in receipts recorded by the other four major leagues on the continent.\nThe new figures will add to concerns about competitive balance in European football, especially given that England’s spending power looks set to be further enhanced by having an unprecedented six clubs in this season’s Champions League.\n“A third record-breaking summer of Premier League spending in four years sends a strong signal that, despite subdued spending across the rest of the continent, clubs have no plans to slow down their investment in the on-pitch product,” said Tim Bridge, lead partner in the Deloitte Sports Business Group.\n“With more English teams than ever competing in European competitions – more than any other league across Europe – Premier League clubs are looking to attract the best talent and further cement the league as the most competitive in world football.”\nPremier League net spend dwarfs Euro rivals\nPremier League gross spending was led by champions Liverpool, who broke the British transfer record twice, on £116m Florian Wirtz and £125m Alexander Isak – the latter in a deal completed just before Monday’s deadline.\nThe English top flight’s net spend of £1.2bn was more than £1bn higher than its closest rival from the Big Five, Serie A, where clubs collectively spent £78m net.\nLaLiga was the only other competition with a net outlay, of £35m, while the Bundesliga and Ligue 1 recorded net receipts of £156m and £265m respectively.\nEngland’s second tier, the Championship, generated net receipts of £115m despite gross spending growing to £240m.\n“There continues to be a complex regulatory landscape from both domestic and European governing bodies, however there is clearly still strong appetite for recruitment, acknowledging the need to maintain investment to remain at the top,” added Deloitte’s Bridge.",
  "word_count": 414,
  "scraped_at": "2026-02-14T01:58:57.496563",
  "_text_extracted": true
}