{
  "article_id": "f93b0e3c6ec6",
  "url": "https://www.jamaicaobserver.com/2025/01/21/haaland-confident-outcome-man-city-charges-signing-new-deal/",
  "title": "Haaland  confident  over outcome of Man City charges after signing new deal",
  "date": "20250121T214500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Haaland ‘confident’ over outcome of Man City charges after signing new deal\nPARIS, France (AFP)— Erling Haaland said Tuesday he needed no reassurances from Manchester City over the outcome of a major disciplinary case hanging over the club before signing a new record deal to stay at the Etihad Stadium until 2034.\n“No I haven’t thought of that or anything. I am confident that the club know what they are doing and I really don’t think I should speak too much about this,” Haaland said at a press conference in Paris ahead of Wednesday’s vital Champions League clash between City and Paris Saint-Germain.\nThe Premier League champions are awaiting the verdict following a hearing related to 115 alleged breaches of financial rules.\nCity strongly deny any wrongdoing, but face severe sanctions if found guilty, including potentially being relegated from the top flight of English football.\nThey stand accused of 80 breaches of financial rules between 2009 and 2018, plus a further 35 of failing to cooperate with a Premier League investigation.\nThe Norwegian striker joined City in 2022 and has so far scored 112 goals in 127 appearances for Pep Guardiola’s side.\n“I think it is a really good sign. Of course it is a bit unusual, it is not normal and that is also something I like. It felt good for both parties and in the end it was an easy choice,” Haaland said of the new deal, which will take him up to the age of 34.\n“I am super happy with my choice and I am looking forward to spending many years in Manchester and that is really it,” he added.\nPSG and City are both in danger of being eliminated from the Champions League coming into Wednesday’s game at the Parc des Princes, which is the penultimate match of the league phase for both sides.",
  "word_count": 309,
  "scraped_at": "2026-02-14T02:26:28.929439",
  "_text_extracted": true
}