{
  "article_id": "f9421bc6fe9d",
  "url": "https://www.lolwot.com/david-beckham-net-worth/",
  "title": "David Beckham Net Worth",
  "date": "20230326T031500Z",
  "domain": "lolwot.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Beckham Net Worth\nDavid Beckham Net Worth\nDid you ever see the movie, ” Bend it Like Beckham”? The movie paid homage to one of the most popular, talented and good-looking soccer players in recent memory: David Beckham. The bend it refers to is Beckham’s uncanny ability to curl a soccer ball around defenders and into the goal, from seemingly impossible angles and distances. It’s one of the reasons he’s considered one of the best soccer players ever.\nDavid Beckham’s stunning net worth of $450 million did not come easy. In fact, Beckham’s net worth is the result of two decades of hard work, dedication and talent. He has played for some of the most popular soccer teams in the world, including Manchester United, Real Madrid, and the Los Angeles Galaxy.\nHe has also been an integral part of the English national team, helping them reach the World Cup in 2002.\nWho Is David Beckham?\nBeckham was born on May 2, 1975, in London, England. His parents are Alan and Sarah Georgina Beckham. He has two older sisters, Joanne and Lynne. Beckham’s father was a kitchen fitter, and his mother worked as a hairdresser. As a child, he attended Chase Lane Primary School.\nHis family was not wealthy, and Beckham often had to wear hand-me-down clothes. His parents were supportive of his love for soccer, and he began playing for a local youth team at the age of eight. He even attended one of Bobby Charlton’s Football Schools.\nBy the time Beckham was a teenager, he had attracted the attention of Manchester United, one of the most successful soccer teams in England. Beckham was signed by the team at the age of 16, and he made his professional debut in 1992.\nDavid Career\nHe quickly became one of the most popular players on the team, thanks to his exceptional skills and good looks. Beckham helped Manchester United win the Premier League title six times, as well as the Champions League in 1999.\nIn 2003, Beckham was signed by Real Madrid for a then-record fee of $41 million. He spent four seasons with the team, winning the Spanish league title once.\n2007 was significant for David Beckham’s net worth as it grew significantly when he joined the Major League Soccer side of his profession. Beckham signed a five-year, $250 million contract with the Los Angeles Galaxy. He helped the team win the Major League Soccer Cup in 2011 and 2012.\nHe also played for Preston North End, A.C. Milan, Paris Saint-Germain, and the MLS All-Stars during his career.\nPost Soccer Life\nBeckham retired from soccer in 2013, but he remains one of the most popular and marketable athletes in the world. He has endorsement deals with major brands such as Adidas, H&M, and Sainsbury’s. He also has his own line of clothing, fragrances, and underwear.\nDavid Beckham’s net worth continues to grow now, mostly due to his numerous business ventures and investments. He is a minority owner of the MLS team, Inter Miami CF. Beckham also has a stake in Soho House, a members-only club with locations around the world.\nHis Famous Family\nDavid Beckham is not the only rich and famous person in his household. His wife, Victoria Beckham, is a former member of the pop group Spice Girls. She has her own clothing line, which is sold in major retailers such as Nordstrom and Target.\nThe Beckhams have four children together: Brooklyn, Romeo, Cruz, and Harper. The Beckham children have begun to follow in their parents’ footsteps in the fashion world. His son, Brooklyn Beckham, has made a name for himself as a model and style icon.\nCareer Highlights\n- He won the FA Youth Cup in 1992\n- He won the UEFA Champions League in 1999\n- He was given an OBE (Officer of the Order of the British Empire) in 2003\n- He was named one of Time magazine’s 100 most influential people in the world in 2004\n- He was the runner up for FIFA World Player of the Year in 1999\n- He was named England Player of the Year in 2003\n- He was inducted into the English Football Hall of Fame in 2008\n- He was one of the world’s highest-paid athletes from 2001 to 2013\nFun Facts\n- Did you know that Beckham has his own line of underwear? It’s true! His bodywear line for H&M is extremely popular.\n- He briefly opened a soccer school, called the David Beckham Academy, but it shut down years ago.\n- As mentioned earlier, he was the namesake of a popular movie, “Bend it Like Beckham”, which focused on a girl who loved to play soccer but was not allowed to by her traditionalist Indian parents.\n- He is married to former Spice Girl, Victoria Beckham. The couple has four children together.\n- In addition to winning championships, Beckham has won five Teen Choice Awards and three ESPYs.\n- His nickname is Becks.\nWhat’s Next For David Beckham?\nDavid Beckham’s net worth will continue to grow as he expands his business empire. He shows no signs of slowing down and continues to be one of the most popular athletes in the world. We can expect great things from David Beckham in the years to come!\nDavid Beckham FAQs\nWhat is David Beckham Net Worth?\nDavid Beckham net worth is currently $450 million USD.\nHow much money does David Beckham earn?\nDavid Beckham earns $4 million per year from various sources.\nHow tall is David Beckham?\nDavid Beckham is 6 ft\nHow old is David Beckham?\nDavid Beckham is currently 50 years old.\nWhen is David Beckham birthday?\nDavid Beckham birthday is on 2nd May.",
  "word_count": 950,
  "scraped_at": "2026-02-14T02:29:12.767413",
  "_text_extracted": true
}