{
  "article_id": "f949b1a3109e",
  "url": "https://apnews.com/article/haaland-man-city-young-boys-champions-league-0a62584465b5cfa8a0e374e142746d73",
  "title": "Haaland ends barren streak in Champions League with 2 goals in Man City 3 - 1 win over Young Boys",
  "date": "20231025T234500Z",
  "domain": "apnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Haaland ends barren streak in Champions League with 2 goals in Man City’s 3-1 win over Young Boys\nHaaland ends barren streak in Champions League with 2 goals in Man City’s 3-1 win over Young Boys\nBERN, Switzerland (AP) — Erling Haaland’s barren streak in the Champions League is over.\nTwo second-half goals by the scoring phenom led Manchester City to a 3-1 win at Young Boys and the brink of the knockout stage already in its title defense.\nHaaland hadn’t scored in his previous five matches in the competition, stretching back to last season’s semifinals in May, but he ended that improbable run by blasting a spot kick down the middle in the 67th to put City 2-1 ahead.\nThe Norway striker wrapped up the victory by curling a shot into the top corner with his weaker right foot in the 86th minute.\n“People expect him to score four goals every time,” City manager Pep Guardiola said. “They want him to fail.\n“I’m sorry, this guy’s going to score goals all the time ... He is going to score until the last day he plays football.”\nIt’s now 37 goals in 33 Champions League games for Haaland, who is into double figures (11) for the season in all competitions as he looks to follow up a debut campaign for City when he netted 52 times.\n“People get onto him because of the season he had last year,” City defender Rico Lewis said. “It is a credit to him.”\nA third straight win by City to open Group G extended its unbeaten streak in European competition to 17 games, which is tied for the longest by an English team.\nCity is making the most of being handed a benign group in its title defense, having already beaten Red Star Belgrade and Leipzig. Another win at home against Young Boys in two weeks and Guardiola’s team will have qualified with two matches to spare, allowing City to focus on a tough-looking upcoming Premier League schedule.\nThat begins with Sunday’s Manchester derby at Old Trafford.\nBefore his penalty, it had been a frustrating evening for Haaland and indeed for City, which was restricted to half-chances in a first half that ended goalless on the artificial pitch at Wankdorf Stadium.\nA tap-in by center back Manuel Akanji eventually gave City the lead in the 48th after Ruben Dias’ header has been tipped onto the crossbar.\nThe titleholders conceded against the run of play four minutes later when Meschack Elia timed his run perfectly to get in behind City’s defense and scoop a classy finish over the stranded Ederson.\nRodri was tripped in the box to give Haaland a chance to regain the lead for City. He didn’t squander it, and his finish for his second goal was a sign of his growing confidence.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 474,
  "scraped_at": "2026-02-14T02:10:28.700774",
  "_text_extracted": true
}