{
  "article_id": "f94b5e15736f",
  "url": "https://theathletic.com/4713401/2023/07/24/onana-manchester-united-signing/",
  "title": "How Manchester United signed Andre Onana : Talks before CL final , Amsterdam meet , hard bargaining",
  "date": "20230724T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Andre Onana first heard Manchester United might want to sign him, the widespread belief inside and outside Old Trafford was that David de Gea would stay.\nTalks on a new contract for De Gea, lasting several months, had finally reached an agreement. The 32-year-old went off for his holidays telling friends he would return to Carrington once back in England.\nAdvertisement\nErik ten Hag ideally wanted a goalkeeper suited to his style, but given the need for a new striker and midfielder he had accepted during the spring that United’s summer budget, limited to around £100million net, would be channelled elsewhere.\nAt that stage, De Gea had shown some improvement in passing out from the back and was on course to win the Premier League Golden Glove for most clean sheets. Ten Hag accepted he could do “one last dance” with De Gea, as an insider put it.\nBut after the FA Cup final, where De Gea conceded from two long-range Ilkay Gundogan shots and had to kick deep to avoid Manchester City’s press, Ten Hag decided he could wait no longer to sign a No 1 fitting his strategy. The doubt that had nagged in the 3-0 defeat at Sevilla and again after the 1-0 loss at West Ham — occasions when De Gea mistakes cost his side — became impossible to ignore.\nAnd so, in the days before the Champions League final between City and Inter Milan, Ten Hag started asking people about the availability of the goalkeeper he had worked with at Ajax.\nElsewhere on The Athletic…\n- Anger, loyalty, laughing at team-mates: What happens when a transfer dies\n- Man Utd vs Arsenal: Fighting, Martinez aggro, Glazer protests… this was no friendly\nYalcin Sarica, a senior agent at Wasserman Media Group, had originally been talking to Ten Hag about his client Denzel Dumfries. But then, during the phone call, Sarica brought up Onana, a player he had known since 2019 and was in the process of representing. Ten Hag was interested. The fuse was lit.\nTen Hag and Onana shared four and a half years together in the Netherlands, winning three Eredivisie titles and reaching the Champions League semi-final in 2019. At the end of their time together he called Onana a “masterful goalkeeper”.\nTen Hag was therefore not surprised by Onana’s display against City in Istanbul, a performance that reinforced the United manager’s decision to pursue a reunion with the 27-year-old.\nGO DEEPER\nWhy Andre Onana would be perfect for Manchester United and Ten Hag\nAfterwards, Pep Guardiola explained Onana’s effect on City’s attempts to press high. “When you have a goalkeeper like Onana who can read perfectly where everyone is to pass to,” he said, “it is very, very difficult.”\nAdvertisement\nUnited scouts also rated AC Milan’s Mike Maignan highly, and a pursuit was floated. Executives from both clubs met in Milan around the Champions League semi-final in May to talk about Maignan. But the France international was ultimately seen as too expensive. After Milan sold Sandro Tonali to Newcastle for a fee in the region of €70million, Maignan’s price rose to €100m.\nIn contrast, Inter’s accounts meant they needed to sell to buy even after their run to the Champions League final banked them £100million. They were open to doing business on Onana. A fee mooted initially at €70m soon dropped to €60m, with United aware negotiations could see the cost fall further. In any case, Onana was Ten Hag’s No 1 choice.\nThis was the backdrop to United changing their contract offer to De Gea. Before the FA Cup final, De Gea gave several people the impression he had gone as far as signing his part of the document. Whether this was his interpretation or that of others, the clear sentiment spread that De Gea staying was a done deal.\nUnited insist no documents were signed by either party and that a formal proposal was never made.\nNevertheless, what is certain is that after the FA Cup final United withdrew an outline proposal that had De Gea’s blessing and resubmitted one for less money and shorter length. United had, with Ten Hag’s influence, made the call that De Gea should only be compensated as a No 2. He could either stay in that new role or leave.\nOn the morning of July 8, a week after getting married, De Gea let United know that he was going to announce his exit. United were then able to prepare their own farewell messages for social media.\nSeveral sources report De Gea feeling badly treated by the club over the handling of his departure. Bruno Fernandes gave a hint of the sentiment among team-mates when he posted on Instagram: “You deserved to say goodbye at the stadium with all the fans cheering you.”\nAdvertisement\nOthers connected to the club, however, point out that De Gea could have accepted the initial terms presented in March, when his status was solid. De Gea rejected the offer and negotiations continued.\nThat left De Gea vulnerable when his form slid and, without being anchored to him as No 1, United began properly looking at a new goalkeeper. But it was not a straightforward process.\nOnana knew of United’s interest before the Champions League final on June 10 and then on June 22, the day after United had their second bid for Mason Mount rejected, Albert Botines, the agent who had arranged Onana’s free transfer to Inter last summer, flew to Manchester for talks with Steve Brown, United’s head of recruitment. Brown took the meeting at the request of Botines.\nTalks stalled, however, and real momentum only started when Sarica and John Morris, another senior agent at Wasserman, gained control of the process.\nSarica had worked with Onana previously while a partner at SEG, the agency which looks after Ten Hag, before leaving for Wasserman in December. Morris has extensive knowledge of United and English football, having handled the appointments of Graham Potter at Chelsea and Brendan Rodgers and Enzo Maresca at Leicester.\nTo make sure both manager and player were totally on board with the move, Ten Hag met Onana, with Sarica, at Wasserman’s Amsterdam offices, and they held positive discussions.\nCAA Base agency were also involved, used by United and Inter in the club-to-club talks. Frank Trimboli, co-founder of Base, assisted initial talks between United’s football director John Murtough and Inter sporting director Piero Ausilio and the two executives had a meeting in Milan. As the days went on there were broad discussions over the phone between the two executives about fees, including the proposal of United players who might interest Inter to offset the cost.\nAdvertisement\nIt was at this point that various steps to the deal were telegraphed in the Italian media. Within Carrington there was bemusement and no little irritation at reporting which characterised Onana’s arrival as imminent, sensing the noise was a tactic to hurry United to a price of Inter’s satisfaction. There was, in truth, a significant gap in valuations. This hasty framing of the move continued throughout.\nConcurrent conversations were taking place over Atalanta’s Rasmus Hojlund, and centre-forward was expected to be the next position sorted after Mount’s arrival. But Atalanta pricing Hojlund at €100million, combined with Inter’s openness to negotiate, meant United pressed ahead with Onana.\nThe first offer, worth €40million plus €5m in add-ons, was made on the evening of July 5. It was communicated verbally and this would be a theme of the dance between the two clubs. Inter interpreted that a bid had been submitted, United insisted nothing formal had taken place.\nFor the next fortnight all aspects of the transfer were a daily grind for those involved. United let it be known that financial fair play rules significantly limited their spending capacity. Some wondered whether that was merely a negotiating tool. There were also suspicions that United, with co-owner Joel Glazer at the top, simply wanted to be able to say they had squeezed Inter as hard as possible, an approach which anyone involved in the takeover will recognise.\nTen Hag wanted Onana on the flight to New York for United’s pre-season tour, and he exhibited frustrations at the delays. He pressed for progress.\nBut inside Old Trafford each incremental shifting of the dial — another £1million here, an extra £2m there — was passed through the finance department, with oversight by chief executive Richard Arnold, to see if United could make the numbers work.\nThe €300,000 fine by UEFA issued last Friday for breaches in the 2021-22 season may have annoyed United given its “technical” nature, but it also served as a timely reminder of the club’s precarious financial position with the regulators.\nGO DEEPER\nManchester United's FFP fine: How they broke the rules and future risk\nThe fine-tooth comb even extended to Onana’s personal terms, which were overseen by Matt Hargreaves, United’s new head of negotiations. For Hargreaves, who started work in June, this was his first transfer contract to sort. He was appointed from a position at Adidas, where he developed good relationships with Jude Bellingham and Declan Rice during commercial campaigns.\nAdvertisement\nOn Onana, Hargreaves drove a hard bargain, with United aiming to shift away from awarding big basic contracts which can lead to years of paying high salaries for players regardless of performance levels. Instead, United want to incentivise deals and include more bonuses.\nMorris, handling talks for Onana, pushed back on the initial proposals, given the Cameroon international will completely shift how United are able to play. Chelsea were invited to join the bidding process but they declined, meaning United had leverage on salary. But Morris and Sarica proposed an inventive structure to get Onana to a figure commensurate with his talent.\nStill, the talks ebbed and flowed, there were times when it seemed a deal may be off, each side holding firm.\nAfter a few days of relative silence, as United digested their options, talks began again on Thursday July 13, and then came a breakthrough that Saturday to make all parties happy. Onana’s contract, for five years plus an optional extra, was fully agreed on Sunday. He will double his Inter money, earning close to £200,000 per week.\nLast weekend is when club-to-club talks reignited, with Murtough speaking direct to Ausilio once more, but the final fee took a bit longer to agree.\nUnited knew Inter needed to sell to buy, so decided to wait for the pressure to rise and the price to drop. There was a gap of around €8million on Friday. Payment terms were also discussed.\nUnited were factoring in Dean Henderson’s proposed sale to Nottingham Forest, banking on a certain fee incoming, and this was playing a part in the calculations. Forest were showing reluctance to commit to a big fee up front, proposing an initial loan, due to Henderson’s period of six months out through a thigh injury.\nBy Sunday night, a resolution on Onana was in sight, but it took another 24 hours for the deal to finally be sealed, with Joel Glazer, operating on US time, needed for sign-off.\nAdvertisement\nThat Monday, there was exasperation at Inter over the delay, and it was not until midnight approached in Europe that confirmation came United would pay €51million plus €4m in add-ons.\nOnana was excitedly tracking developments, asking for regular updates. In the closing stages he got a call from Ten Hag to reassure him the move would happen.\nThat kind of eagerness matches what United are after from new signings, while Onana also fits the bill for personality. He is determined to be the best goalkeeper in the world, which he showed he can be in the Champions League final. Those who know him say vengeance on City for that loss is on his mind.\nHe finally met his new team-mates on Thursday night in New Jersey after flying into New York, having missed the team flight from Edinburgh on Wednesday due to delays in processing his visa. United tried to get him on that private jet but were met by unforeseen circumstances.\nOn Tuesday, having travelled from Milan to Turin, the plane scheduled to transport him to Birmingham, which was the only available route, was cancelled because the pilot had flown his allotted hours already in the day and was fatigued. Onana would have been driven from Birmingham to Manchester. Amid the postponement, there was a suggestion Onana could have his medical in Paris instead.\nThe next day his flight momentarily appeared in jeopardy because of an issue with his visa at the Cameroon end, but Italian officers eventually allowed his passage.\nAt Carrington there was an army of people present. Murtough and Hargreaves for United, Morris and Sarica for Onana, as well as several lawyers. They worked into the early hours. Botines, as the player’s documented agent, was there to sign off the deal.\nOnana put pen to paper on his contract on Wednesday, then set off for New York on Thursday.\nThere was an ironic end to the transfer, with United waiting on Inter. The Italians, having pushed United for days, only signed their part of the deal on Thursday afternoon, a few hours before the official announcement. Still, it meant United secured two major signings in time for the pre-season tour, faster progress than last year, a key intention by Murtough.\nAdvertisement\nOnana arrived at United’s team hotel in New Jersey at about 7pm and was greeted by Ten Hag. He did his announcement media then as there had not been time at Carrington.\nUnited will pay €55million for Onana if he meets appearance criteria and the team win certain trophies. They could have had him for nothing last summer after his departure from Ajax, but at that stage the club were focused on other positions. Ten Hag told people he wanted a 1.5 in the building, essentially a goalkeeper to challenge De Gea, but such a signing never materialised.\nNow he has a bona fide No 1 who will change the way Ten Hag’s team can play. After an often tortuous process, those at United expect the results to be exciting.\nAdditional reporting: James Horncastle and Mario Cortegana\n(Top photo: Matthew Peters/Manchester United via Getty Images)",
  "word_count": 2369,
  "scraped_at": "2026-02-14T02:07:08.857717",
  "_text_extracted": true
}