{
  "article_id": "f957ea39d8f2",
  "url": "https://metro.co.uk/2026/02/08/gary-neville-makes-man-utd-claim-liverpools-defeat-man-city-26783147/",
  "title": "Gary Neville makes Man Utd claim after Liverpool defeat to Man City",
  "date": "20260208T234500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Neville believes Manchester United will now be ‘more confident’ than Liverpool, Chelsea and Aston Villa about qualifying for the Champions League.\nUnited’s incredible turnaround under caretaker manager Michael Carrick continued on Saturday as the Red Devils beat ten-man Tottenham 2-0 at Old Trafford.\nSpurs captain Cristian Romero was sent off after just half an hour of Saturday’s game and the hosts took full advantage of their numerical advantage, taking the lead shortly after through Bryan Mbeumo.\nManchester United captain Bruno Fernandes put the game to bed late on, sealing the club’s fourth successive win under caretaker boss Carrick.\nThe brilliant run since Ruben Amorim’s sacking leaves United fourth in the Premier League with 13 games remaining, one point above Chelsea and four above defending champions Liverpool.\nChelsea continued their encouraging form under new manager Liam Rosenior with a 3-1 win over Wolves on Saturday but fellow top-four rival Liverpool lost 2-1 to Manchester City.\nArne Slot’s side led with ten minutes to go through Dominik Szoboszlai’s brilliant free-kick but late goals from Bernardo Silva and Erling Haaland completed an impressive Man City comeback.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nNeville says it would have been ‘unthinkable’ to imagine Manchester United qualifying for the Champions League just a few weeks ago but insists they now have a ‘massive chance’ to do just that.\n‘The team that is most confident about finishing in the top-four out of Aston Villa, Manchester United, Chelsea and Liverpool right now is probably United,’ Neville said on his Sky Sports podcast.\n‘But things can turn around quite quickly. No one in that top-five or six will be thinking they’re okay. Even City might have come back a bit if they had lost today.\nPremier League top-half\n- Arsenal, 56\n- Manchester City, 50\n- Aston Villa, 47\n- Manchester United, 44\n- Chelsea, 43\n- Liverpool, 39\n- Brentford, 39\n- Everton, 37\n- Sunderland, 36\n- Fulham, 34\n‘No one will feel safe because it’s a bizarre season, teams are beating each other and strange things are happening.\n‘Everything at Man United is looking really, really good and they do look like they’ve got an incredible chance of qualifying for the Champions League.\n‘They don’t have the confusion and the chaos of the fixture list that the others do so they have a massive chance now to get back into the Champions League.\n‘That would have been unthinkable only four or five weeks ago, unthinkable. I can’t believe where Manchester United are.\nMore Trending\n‘It was terrible under Ruben Amorim, it was shocking. But now the results are excellent and the performances are fantastic.’\nThe Premier League is again on course to gain an extra Champions League spot this season with the top-five set to qualify instead of the traditional top-four.\nSpeaking before United’s win over Spurs, Paul Merson insisted the Red Devils had a ‘huge advantage’ over Chelsea and Liverpool in the top-five race.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Pep Guardiola sends warning to Mikel Arteta and Arsenal after Man City beat Liverpool\nMORE: Dominik Szoboszlai blasted for ‘stupid, daft’ red card by Liverpool legend\nMORE: ‘It’s crazy’ – Jamie Carragher slams Liverpool star after Manchester City defeat",
  "word_count": 599,
  "scraped_at": "2026-02-14T01:59:36.838521",
  "_text_extracted": true
}