{
  "article_id": "f9c6511350b6",
  "url": "https://www.the42.ie/eddie-howe-salutes-newcastles-youngest-ever-premier-league-goalscorer-6252137-Dec2023/",
  "title": "Praise for Newcastle youngest ever Premier League goalscorer",
  "date": "20231217T170000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "HEAD COACH Eddie Howe saluted teenager Lewis Miley after he set Newcastle on the way to a 3-0 victory over 10-man Fulham by becoming the club’s youngest Premier League goalscorer.\nThe 17-year-old midfielder, who had been introduced as a first-half replacement for the injured Joelinton, ended the visitors’ stubborn resistance with a 57th-minute opener at the age of 17 years and 229 days and paved the way for Miguel Almiron and Dan Burn to wrap up the win.\nHowe said: “I’m delighted for him. Today was his moment, put in by Bruno’s [Guimaraes] brilliant run and did he have the composure in front of the Gallowgate to score a massive goal in our season? He did and I’m delighted for him.\n“We tried to manage his minutes today and give him a little rest but it didn’t turn out that way.”\nMiley’s maiden goal could hardly have been better timed with Newcastle labouring in their attempts to break down a Fulham outfit who had circled the wagons in the wake of Raul Jimenez’s 22nd-minute dismissal for a wild challenge on Sean Longstaff.\nAlmiron doubled the dose within seven minutes before Burn added a third as time ran down to clinch a seventh successive league win at St James’ Park and salve some of the disappointment of Wednesday night’s Champions League exit.\nHowe, who also saw defender Fabian Schar limp off before half-time, said: “It was always going to be, even with 11 v 10.\n“Today was never going to be free-flowing, buccaneering, entertaining football because of so many different reasons, the injuries we’ve got, what happened in midweek, the emotion we expended there.\n“The big challenge for us was were we able to recover mentally and lift ourselves to win a really tricky game and I can’t credit the players enough for how they’ve handled today.\n“Added to that fact, we lost two massive players as well during the first half so even more reason really to celebrate the players that were on the pitch today and how well they did.”\nThe Magpies will now start preparations for Tuesday night’s Carabao Cup quarter-final trip to Chelsea with doubts over Schar and Joelinton, who are nursing muscle injuries.\nFulham boss Marco Silva left Tyneside unimpressed with referee Sam Barrott, who issued a red card to Jimenez following a VAR review minutes after he had himself been caught by Jamaal Lascelles’ arm.\nSilva said: “It is a clear foul on Raul but in the opinion of the referee it was not a foul. After the elbow, Raul has to be much more calm, do not go to challenge in that way.\n“The ball was not there to challenge – although the way he jumped in at the player, it was not a serious challenge for me.\n“Two minutes before, the same VAR didn’t even check the elbow. Everything was strange in terms of the decisions.\n“Newcastle are a very good side but before the match I really thought this was a good moment to come and match them and fight them.\n“But at the same time, you have to come with a referee with the right experience and ability to be able to handle the pressure. In my opinion, this afternoon, that was not the situation.”",
  "word_count": 544,
  "scraped_at": "2026-02-14T01:51:13.776804",
  "_text_extracted": true
}