{
  "article_id": "f9f572ea9f0d",
  "url": "https://toffeeweb.com/season/24-25/comment/general/46073.html",
  "title": "Champions League Quarter - Finals ; 2nd Leg",
  "date": "20250420T010000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League — Quarter-Finals; 2nd Leg\nThe final battles for the last 8 in the Champions League — 2nd Leg ties…\nTuesday 15 April 2025\n20:00 Aston Villa v PSG — Amazon Prime Video\n20:00 Borussia Dortmund v Barcelona — TNT Sports 1\nWednesday 16 April 2025\n20:00 Inter Milan v Bayern Munich — TNT Sports 2\n20:00 Real Madrid v Arsenal — TNT Sports 1\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\nPosted\n15/04/2025 at\n21:34:46\nQuite the comeback for Villa — surely dead and buried at 1-5 on aggregate after 30 minutes.\nNow 4-5 on aggregate and another goal needed with 15 minutes left.\nPosted\n15/04/2025 at\n21:37:17\nI didn't see it happening, Michael.\nI still reckon they'll fall short.\nPosted\n15/04/2025 at\n21:40:45\nI'm torn here. I should want Villa to do it and would be made up for them.\nBut the footballing purist in me likes this PSG team.\nPosted\n15/04/2025 at\n21:42:58\nAmazing how far Villa have come, Danny.\nWhat did they do that we didn't or couldn't?\nPosted\n15/04/2025 at\n21:47:02\nMagnificent effort by Villa - brilliant game.\nPosted\n15/04/2025 at\n21:52:03\nI've no idea Julian. Similar sized club, similar history. Similar support base.\nGot relegated twice in my lifetime, but came back.\nAn example that anything is possible no matter how bad it gets.\nUnlucky Villa. Gave it a real go. I'll go and console the inlaws.\nPosted\n15/04/2025 at\n22:03:57\nSo now I hope Arsenal win the Champions League.\nPosted\n15/04/2025 at\n22:19:36\nFurther contemplating that, win, lose or draw, all any supporter wants is for their team to compete and give it a go, even when the odds are stacked against.\nVilla have done that over both legs against arguably the best team in Europe at the moment. No sitting back and hoping for the best. They went for it.\nI still think it will be a PSG v Barcelona final, the dream final if you like. But then quite often, those type of matches fail to live up to the hype and expectation.\nPosted\n15/04/2025 at\n22:46:35\nFootball at its finest and although I would also describe myself as a purist Danny, I don’t see anything wrong with the way Aston Villa, currently play the beautiful game.\nI remember being on holiday not long before covid, and Villa, who had just been promoted, turned Everton over two nil, by playing with the type of honest endeavour,that you expect from a newly promoted team.\nThey played with that same honest endeavour tonight but they have now added a lot of genuine quality and were actually very unlucky against arguably the most fluent team in the competition tonight.\nI hope they win the FA Cup, and it actually wouldn’t surprise me to see them fighting for the premier league next season, if they can become a more consistent outfit.\nPosted\n15/04/2025 at\n22:49:45\nVilla relegated 4 times in my lifetime, Danny!\nThe tricksy quiz question element is that not all those relegations were from top flight to second flight.\nPosted\n16/04/2025 at\n03:19:00\nOn the CBS Sports Champions League postgame, Miles the Everton fan was sparring with Carragher about the rumor of Paul McCartney singing at Goodison on the last day.\nIs there really any reporting on that? Anybody?\nPosted\n16/04/2025 at\n06:12:41\nDonnaruma, what a display.\nPosted\n16/04/2025 at\n06:19:36\nI think John McGinn, a player I've always liked, epitomises what you say about Villa Tony.\nMike, I've heard the rumours about McCartney, but they are just that. Whatever the club has planned, they will need to confirm and announce soon.\nI'm not so sure about McCartney or his Everton credentials. I did once read his dad used to go regularly and sit in the Upper Bullens.\nI think Sir Paul and the rest of the Beatles were not really into football. He says he is Everton because of his family and that if it came down to it in a derby, he would have to side with Everton. Mmmm!!\nWe have options if the performer(s) have to be from Liverpool and have Evertonian connections. Atomic Kitten?!!!!! Or maybe 90s indie band the La's they have a least one in their ranks.\nHere's an article from the Echo earlier this year. There are some surprises in there. John Travolta??\nLink\nPosted\n16/04/2025 at\n06:41:53\nDanny, Atomic Kitten, please. No chance of the La's, no chance. You're talking about Lee Mavers mate, diehard blue, ST. There's more chance of getting me, Sean Kearns, Paul Kossof, and Barry Rathbone in a room than the La's.\nTwo more possibilities mate. The lead singer of Yank band Future Islands is a massive blue but well clock the dancing and he sings like Dyche - minute 2.23 is magical. Pure 100 per cent Dyche-sing.\nhttps://www.youtube.com/watch?v=upPl9mZW_zw\nAnd, then, the name of the bassist in this Buggles wannabe group in beard and shades is Tony Hibbert. Best to go full screen for volume control. The keyboard player is the biggest twat in the history of TOTP\nhttps://www.facebook.com/watch/?v=322584591975464\nPosted\n16/04/2025 at\n07:13:40\nAtomic Kitten was tongue in cheek Paul when I saw them on the Echo's list. I do remember her being pictured in an Everton top.\nThat Future Islands track sounded good. Thanks for the introduction. That lead singer must be a blue. He is proper getting down with his bad self as if he's in the Winslow after watching Everton win!!\nIs that bassist. Is his name Tony Hibbert or is it Tony Hibbert wearing a cunning disguise?!! He could cause a riot!!\nPosted\n16/04/2025 at\n07:30:44\nLiz is a massive blue Danny from a massive blue family. She's often said family and Everton are the greatest loves of her life mate. Like you, in fact, plus your brothers in arms.\nPosted\n16/04/2025 at\n09:53:04\nMcGinn, doesn’t mind leaving it in Danny, just like a lot of players don’t mind feigning injury. I sometimes wonder what is worse, although I know what most people will say.\nIf McCartney is playing the last game then I can see the price of tickets going enormously through the roof, and although I’ve never heard a worse live performer, I’m certain Dylan, has got to be an Evertonian!\nAtomic Kitten might not be a bad shout if they can make us whole again🤦♂️\nPosted\n16/04/2025 at\n10:13:25\nTony, even without Paul McCartney, or whoever else is in the pipeline to perform at Goodison, it seems like ticket prices are already going through the roof. Click on this link then click on seatpick for tickets against Southampton on 18th May. The prices will blow you away…………..\nhttps://seatpick.com/everton-vs-southampton-tickets/event/305756?quantity=2\nPosted\n16/04/2025 at\n11:09:19\nI couldn't open that link Rob, but I've seen tickets going for £900 on some sites.\nLatest rumour doing the rounds is that Sir (cough) Kier Starmer will get 2 tickets for the Southampton match.\nI seriously hope that is click bait and I can't find anything credible to support it other than the Rt Honourable Steve Brown OBE putting it up on X. That's if that account is really him.\nPosted\n16/04/2025 at\n15:29:02\nLinkin Park announced for the pregame concert at the CL final next month.\nLinkin Park? Really?\nPosted\n16/04/2025 at\n16:36:10\nLooking forward to tonights matches. Both should be intriguing. Inter v Bayern hanging in the balance. Don't put it past Real to do the unthinkable.\nLinkin Park? Maybe Green Day would be a better option Mike. Just don't sing American Idiot or Donald might have them deported to El Salvador.\nPosted\n16/04/2025 at\n17:09:58\nDanny, I'd bet half the players on that pitch will be too young to have ever heard of Linkin Park. They haven't toured since Obama was president.\nPosted\n16/04/2025 at\n19:32:46\nDanny the highest ticket price for one seat (non-VIP) on Rob's link is £2678 (top balcony, I think), the highest price for a Lower Bullens ticket is £2651\nPosted\n16/04/2025 at\n19:36:35\nI can see real scoring in the first 10 minutes, and Arsenal going out. Hope I'm wrong.\nPosted\n16/04/2025 at\n19:43:58\nPH, if Arsenal bollix this up, Arteta's reputation will never recover.\nPosted\n16/04/2025 at\n19:45:08\nFfs Paul you must empty a lot of rooms at parties!\nPosted\n16/04/2025 at\n19:46:43\nSome stadium now us the Bernadau\nPosted\n16/04/2025 at\n19:51:20\nDanny, just Google Everton v Southampton tickets and it will take you straight there. Just look for pickseat.\nPosted\n16/04/2025 at\n19:56:21\nOk, I'm going 4-0 Real.\nPosted\n16/04/2025 at\n19:57:34\nPaul Hewitt\n7 Posted 15/04/2025 at 22:03:57\nFlag this comment So now I hope Arsenal win the Champions League.\nMake your mind up!\nPosted\n16/04/2025 at\n19:58:48\nI do hope they win it. But can't see it\nPosted\n16/04/2025 at\n20:00:17\nPH. You shoulda stopped at \"going.\"\nPosted\n16/04/2025 at\n20:02:42\nsome good tunes there BW, get rocking, get modern\nPosted\n16/04/2025 at\n20:03:49\nIf Arsenal score they will go through.\nPosted\n16/04/2025 at\n20:04:53\nMy forecast. 2-1 Madrid Arsenal go through.\nPosted\n16/04/2025 at\n20:12:35\nBit off-topic, but just seen Eze take one of the worst penalties I've ever seen v the Barcodes. Switched over to the Arsenal match now.\nPosted\n16/04/2025 at\n20:13:11\nGunners started well here\nPosted\n16/04/2025 at\n20:14:04\nNever a pen\nPosted\n16/04/2025 at\n20:16:35\nWhat a bloody idiot\nPosted\n16/04/2025 at\n20:17:47\nDefinitely a penalty but you're right about Saka being an idiot.\nWhen what's at stake is at stake you don't fuck about like that and try'n make it about the style of the penalty you just fucking smack it.\nPosted\n16/04/2025 at\n20:19:03\nPenalty all day long, Paul. Once the ball is in play and a defender drags an attacker down in the penalty area it’s a nailed on penalty.\nPosted\n16/04/2025 at\n20:19:21\nAwful pen from Saka but Eze's was exponentially worse!\nPosted\n16/04/2025 at\n20:20:12\nJeez, the skunks are hammering Palace. 3-0 before half time\nPosted\n16/04/2025 at\n20:20:48\nHave to say though, VAR in use as it should be.\nPosted\n16/04/2025 at\n20:21:29\nDidn't realise that we'd only lost 1 game more than Newcastle. To many draws this season has done us.\nPosted\n16/04/2025 at\n20:22:19\nThing is, if they gave a pen for grabbing and pulling every time, 90% of corners would result in a pen\nPosted\n16/04/2025 at\n20:22:27\nFecking triple captained Isak Big Rob - 7 skunks goals and he hasn't scored one of them.\nPosted\n16/04/2025 at\n20:25:43\nMake that 8\nPosted\n16/04/2025 at\n20:27:17\nNever a pen\nPosted\n16/04/2025 at\n20:27:52\nNOW you're right. Had to happen some time. 🤣\nPosted\n16/04/2025 at\n20:28:18\nCome on FFS that's a dive\nPosted\n16/04/2025 at\n20:29:48\nWho's checking this. Stevie wonder\nPosted\n16/04/2025 at\n20:29:55\nCan't help but think back to Ashley Young v Manure \"did the contact cause him to go down in the way that he did\"?\nPosted\n16/04/2025 at\n20:32:08\nThere's gonna be a lot of time added on here\nPosted\n16/04/2025 at\n20:33:21\nI have to say this ref has been outstanding so far. Let some early challenges go, didn't give in to Madrid's theatrics and has the courage to make the right call.\nPosted\n16/04/2025 at\n20:35:07\nWas thinking exactly the same myself Brian.\nPosted\n16/04/2025 at\n20:37:27\nReal have lost there heads here.\nPosted\n16/04/2025 at\n20:46:48\nBrilliant mind-games from Arsenal/'teta.\nThe name of the Arsenal 'team dog' that hangs around the dressing room is \"Win\".\nAnyone know what ours is called?\nPosted\n16/04/2025 at\n20:47:34\nOurs is called \"Weevad.\"\nSee if you get that PF. 😉\nPosted\n16/04/2025 at\n20:50:27\n\"We every every match value a draw\" Brian?\nPosted\n16/04/2025 at\n20:51:46\nhang on that don't work 'We Everton ecstatically value a draw'?\nPosted\n16/04/2025 at\n20:51:48\n\"Weevad some good times.\"\nAs spoken by our ex chairman. 😱\nPosted\n16/04/2025 at\n20:53:55\nOk, arsenal ain't going out to tonight. Real not been good so far\nPosted\n16/04/2025 at\n20:54:06\nnice one -\nPosted\n16/04/2025 at\n20:55:09\nI thought it was going to be 4-0 PH and that Saka's pen was not a pen?\nPosted\n16/04/2025 at\n20:56:11\nIsak, at fecking long last\nPosted\n16/04/2025 at\n20:57:55\nLooking good for Arsenal.\nMeanwhile back in the Premier League, Newcastle 5-0 against Palace.\nWe could feasibly catch the Eagles if they have their flip flops and beach towels ready.\nPosted\n16/04/2025 at\n21:00:29\nEddie Howe gaining me some points as assistant manager. 👍👍\nPosted\n16/04/2025 at\n21:08:01\nMuch ridicule for Saka amongst the CBS crew.\nPosted\n16/04/2025 at\n21:11:42\nWatching both games at my cricket club.\nMay be sacrilege on here but I’m an admirer of Newcastles football.\nTheir fans are knobs but they play good football.\nMeanwhile, two pens tonight - Palace and Arsenal - should signal the end of this stuttering run up shite!\nWhy didn’t Declan Rice just step up and thump Arsenals pen?\nPosted\n16/04/2025 at\n21:18:21\nYou could hit the top twenty Rob!\nI hate that stuttering run up shite Mark. There are some gems on Youtube\nThis is going to be some finish if Real get through as PH predicted\nPosted\n16/04/2025 at\n21:18:27\nJust drive it into the corner. Not that hard.\nPosted\n16/04/2025 at\n21:23:46\nBoth pens were awful!\nPosted\n16/04/2025 at\n21:26:07\nDidn't rate rice at west ham. But he's got better at Arsenal.\nPosted\n16/04/2025 at\n21:29:58\nBellingham with a Hibbert-quality cross there.\nAnd.... that'll do it. Bye Real.\nPosted\n16/04/2025 at\n21:32:19\nfantastic run by Saka, brilliantly timed\nPosted\n16/04/2025 at\n21:33:35\nWhat was Raya doing.\nPosted\n16/04/2025 at\n21:35:03\nLove seeing Thomas on the back of an Arsenal shirt, what sweet memories\nPosted\n16/04/2025 at\n21:36:01\nErm, what the fuck was Saliba doing?\nPosted\n16/04/2025 at\n21:36:57\nBayern still breathing, Dier scores a header from an impossible angle to get them back within a goal\nPosted\n16/04/2025 at\n21:37:29\nTrue PF, but why did Raya put him in that position.\nPosted\n16/04/2025 at\n21:39:28\nFair PH\nPosted\n16/04/2025 at\n21:41:23\nSaliba’s fault all day long. He shouldn’t have turned back towards goal, or laid it straight back to Raya without controlling the ball first.\nPosted\n16/04/2025 at\n21:45:50\nCould be Carlos last CL game if the rumours he's going to be the Brazil manager after this season.\nPosted\n16/04/2025 at\n21:50:44\nKane just missed a solid gold chance to square things.\nPosted\n16/04/2025 at\n21:56:45\nMerino is a wool!\nPosted\n16/04/2025 at\n21:56:55\nNot often you see Bayern and Real go out on the same evening.\nPosted\n16/04/2025 at\n21:57:38\nLove to see an Inter v Arsenal final\nPosted\n16/04/2025 at\n21:59:57\nwhat a performance by Arsenal/'teta\nPosted\n16/04/2025 at\n22:02:46\nFull credit to Mikie and his guys. They whupped 'em home and away.\nPosted\n16/04/2025 at\n22:03:02\nNever doubted Arsenal\nPosted\n16/04/2025 at\n22:07:44\nSTFU PH. 🤣🤣🤣🤣\nPosted\n16/04/2025 at\n22:14:32\nWell played Arsenal. Totally professional performance and outplayed Real over two legs in very different ways. Deserved and never looked threatened in surrendering the lead they took into tonight.\nI still fancy PSG, but who can really predict football?\nWhat a beuatiful chipped / dinked finish by Saka.\nPosted\n16/04/2025 at\n22:17:24\nHe’s been a great manager Carlo, and it must have been a pleasure to play for a manager that seems to give his players a lot more Carte-Blanche, than most top level managers, but sometimes a team need a few more ideas, than Madrid produced tonight.\nSometimes I think the total opposite with regards Arteta, when I watch Arsenal, and feel that they could be a lot more productive if he would just loosen the reins a little bit, but not tonight because they were exceptional with regards their defensive shape and discipline, and this gave the platform for a richly deserved victory👏👏\nPosted\n16/04/2025 at\n22:20:39\nHad to ask the lad what that ment Brian. I do wish people would right proper.\nPosted\n16/04/2025 at\n22:28:25\nI wish people could spell proper!😂😂😂\nPosted\n16/04/2025 at\n22:40:15\nI was gutted when that fat fucking theatre parasite William “one lying bastard” Kenwright sold Arteta to Arsenal. The c**t\nMadrid were so despicably average tonight it’s almost like they were playing the shite. Hopefully for Arsenal - a team I’ve always respected - that’s a positive sign.\nPosted\n17/04/2025 at\n06:12:13\nThat was an observation of Rice when we recently played Arsenal. He was playing in a very reserved position, whereas he offers a lot when given freedom to drive forward.\nI admit to having my doubts about Arteta when he took the plunge to take up the Arsenal job as his first step into management. But he served a good apprenticeship under Guardiola and I'm sure he learned a lot from Wenger.\nMuch talk of PSG, Barcelona and Arsenal. Inter leading Serie A with Napoli the closest to them (3 points). I haven't seen them play, but Italians are usually made for competitions like this and the World Cup, characterised by defensive masterclasses.\nPosted\n17/04/2025 at\n07:38:23\nWell done Arsenal, I never liked them much (well they aren't Everton are they?) but since Mikel went there who is my all time favourite player, I always look out for them. I am actually drinking coffee from my Arteta Everton mug right now as I type this, bit faded now.\nThey are perennial chokers in the PL but they have surprised me in the Champions League this season. That 2nd half against Real in the first leg was one of the finest 45mins of footie I have seen in many years, superb. Rice is an absolute baller.\nThey are reportedly looking at Williams of Bilbao in the summer along with Gyokeres or Jonathan David. If they can pull off both of those signings they might actually win the PL next season.\nPosted\n17/04/2025 at\n07:41:40\nSteve, if you don't mind, you must be in your thirties if Arteta is your favourite player ever.\nLucky you. My thirties was my favourite decade.\nPosted\n17/04/2025 at\n08:21:02\nI don't mind Arsenal. They have always been a very well run club and handle themselves with class.\nMine would be my teens Paul, for obvious reasons.\nMore European football this evening. Tottenham and Manchester United's Europa League ties hanging in the balance. There are two managers who may well not be in their respective driving seats come next season.\nChelsea look nailed on to progress to the Europa Conference semi-final.\nPosted\n17/04/2025 at\n19:42:23\nAgree about Arsenal Danny. It was the 1971 final when they earned mucho respect and gratitude from me.\nAnd they are also not Spurs.\nNext season Danny? I think one of them in particular might not be there next week mate.\nPosted\n17/04/2025 at\n19:56:06\nCome on rangers, united and Spurs.🤞\nPosted\n17/04/2025 at\n20:01:47\nCome on Lyon, Frankfurt, and especially Athletic.\nWhy do these Salford knobs sing that country home song?\nPosted\n17/04/2025 at\n20:07:59\nDifficult to know which game to watch\nPosted\n17/04/2025 at\n20:11:35\nLyon, Frankfurt and Rangers!\nPosted\n17/04/2025 at\n20:14:57\nChavs 0-1\nPosted\n17/04/2025 at\n20:39:43\nThat should be a Spurs penalty\nPosted\n17/04/2025 at\n20:45:38\nGiven after a VAR check, and scored by Solanke.\nPosted\n17/04/2025 at\n22:22:20\nMan Utd 3-2 (5-4 overall) down vs 10 men Lyon after being 2-0 up after 70 minutes. Good times.\nPosted\n17/04/2025 at\n22:27:38\nMake that 4-2 for Lyon!! 4 unanswered goals, last 2 with 10 men. This is great 🤣\nPosted\n17/04/2025 at\n22:31:25\nno way is that a pen\nPosted\n17/04/2025 at\n22:36:56\nFuck. Was celebrating too early here\nPosted\n17/04/2025 at\n22:37:48\nfecking hell\nPosted\n17/04/2025 at\n22:38:52\nUnfuckingbelievable\nPosted\n17/04/2025 at\n22:39:06\nthats fucking witchcraft\nPosted\n17/04/2025 at\n22:42:00\nI'd look at signing Maguire as a forward. Old-fashioned tactics!\nPosted\n17/04/2025 at\n22:46:08\nGet in united.\nPosted\n17/04/2025 at\n22:48:57\nOne of the best games of football I've ever seen.\nPosted\n17/04/2025 at\n22:55:21\nLike it Ian. Maguire, Keane, Chermiti. Better than Beto, Broja, Chermiti\nPosted\n17/04/2025 at\n23:02:00\nPen on Casimiro was a joke, should have got a yellow for simulation, instead got a pen, a goal, and momentum.\nBent.\nPosted\n17/04/2025 at\n23:02:11\nBodø Glimt is through against Lazio on penalties. The Vikings is up against Spurs in the Semi\nPosted\n17/04/2025 at\n23:04:06\nSo that’s Spurs in the final then.\nPosted\n17/04/2025 at\n23:10:25\nWTF is Bodø Glimt ?\nPosted\n17/04/2025 at\n23:10:39\nChelsea into the semi of the conference league after getting beat at home, this is success? After spending 500 million in 2 years?\nI suppose we’d take it in a couple of years, but Chelsea? After what they have spent?its a bit embarrassing tbh\nPosted\n17/04/2025 at\n23:12:01\nSpurs are terrible at the moment so I wouldent be surprised if they loose against B/G\nPosted\n17/04/2025 at\n23:14:09\nPF it’s a team that have done very well in the Europa league this season, something we should aspire to, apparently not that difficult as Utd have just qualified for the semi’s.\nPosted\n17/04/2025 at\n23:21:15\nThey won 6-1 against Roma in Conference League a few years ago so its not going to be a walk in the park for Spurs\nPosted\n17/04/2025 at\n23:42:24\nSRJ I really hope they dump Spuds out in the next round 🙏🙏🙏\nPosted\n18/04/2025 at\n09:58:14\nThat would be great Jeff👍🙏\nHow to get rid of these ads and support TW\n© ToffeeWeb",
  "word_count": 3574,
  "scraped_at": "2026-02-14T01:52:20.894146",
  "_text_extracted": true
}