{
  "article_id": "fa0def1eda20",
  "url": "https://metro.co.uk/2024/07/12/mark-clattenburg-issues-warning-surprising-choice-euro-2024-final-referee-21214689/",
  "title": "Mark Clattenburg issues warning over  surprising  choice for Euro 2024 final ref",
  "date": "20240712T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mark Clattenburg has revealed UEFA’s decision to hand the Euro 2024 final between England and Spain to referee Francois Letexier has come as a huge surprise.\nThe Frenchman only turned 35 in April, but has already risen to the elite level of refereeing, having made his debut in Ligue 1 back in 2016.\nSince then he has taken charge of finals of the Coupe de France and refereed the UEFA Super Cup between Manchester City and Sevilla last year.\nHe has been involved in a Champions League final as fourth official and Europa League final as VAR, appointed for the Real Madrid vs Borussia Dortmund clash this year and Manchester United vs Villarreal in 2021 respectively.\nFollow Metro.co.uk’s live blog for coverage of England vs Spain in the Euro 2024 final\nLetexier has been in charge of three matches during Euro 2024 so far, handling Croatia 2-2 Albania and Denmark 0-0 Serbia during the group stage and Spain 4-1 Georgia in the last 16.\nOn the face of it, Letexier appears to be a sound appointment and one that appeared unlikely to cause the sort of controversy that accompanied Felix Zwayer’s presence in the semi-final between England and Netherlands.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nClattenburg, a former referee who took charge of several domestic and European showpiece occasions, believes there were better options available.\nHe told Mail Sport: ‘UEFA’s choice of Francois Letexier for Sunday’s final will come as a big surprise to a fair few in the refereeing world, including in France, where he is not even seen as their top official.\n‘That is Clement Turpin who, unlike Letexier, has the finals of the Europa League and Champions League listed on his C.V.\n‘My hunch is Turpin was overlooked for this one because of the mistakes he made in the Euro 2024 opener between Scotland and Germany.\nEuro 2024 final\n‘You cannot give it to an Englishman or a Spaniard for obvious reasons. Daniele Orsato of Italy is retiring after these Euros, so it would have been an emotional match for him to try to focus on refereeing fairly.\nMore Trending\n‘Szymon Marciniak of Poland is being linked with a switch to Saudi Arabia next season, which can be frowned upon in some football circles, and he is still not entirely forgiven in Germany after his handling of Bayern Munich’s Champions League semi-final exit to Real Madrid.\n‘It was after analysing the list of candidates that UEFA chose Letexier, the 35-year-old from France appearing at his first international tournament.\n‘He’s officiated well at these Euros, keeping controversy to a minimum, but the most important match he has refereed up to now was the 2023 Super Cup between Manchester City and Sevilla. This will be a massive step up so the pressure is on.’\nMORE: England fan who got ‘Euro 2024 winners’ tattoo says he does not regret it\nMORE: Sir Jim Ratcliffe hints at Luke Shaw concern ahead of Euro 2024 final\nMORE: Spanish media taunts England and Harry Kane ahead of Euro 2024 final",
  "word_count": 555,
  "scraped_at": "2026-02-14T02:08:01.879679",
  "_text_extracted": true
}