{
  "article_id": "fa2091259056",
  "url": "https://www.barcablaugranes.com/barcelona-uefa-champions-league/101487/pedri-frenkie-de-jong-the-metronome-that-keeps-barcelona-ticking",
  "title": "Pedri & Frenkie de Jong - The metronome that keeps Barçelona ticking",
  "date": "20250920T181500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On Thursday night, the Blaugrana faced Newcastle United at St James’ Park for their first match of the 2025-2026 Champions League campaign, walking away with a 2-1 win and three valuable points, thanks to a second-half brace from Marcus Rashford.\nPedri & Frenkie de Jong - The metronome that keeps Barcelona ticking\nThe two midfielders ran the show against Newcastle\nA key to Barcelona’s performance was yet another brilliant showing from their midfield duo, Pedri and Frenkie de Jong.\nThe pair delivered a high-volume performance, breaking up Newcastle attacks, dismantling Eddie Howe’s press one time after another, and ensuring control of the football for their side.\nWeathering the Storm\nFueled by a boiling St James’ Park atmosphere, cheering every tackle as if it were a goal, the Magpies’ intentions were made clear from the opening: press high and hard.\nEddie Howe’s team was the first to generate danger. Anthony Elanga’s speed down the right flank caused problems for the Blaugrana, first with a dangerous cutback that Anthony Gordon failed to take advantage of, and after with a pinpoint cross to Harvey Barnes at the far post, heroically saved by Joan Garcia.\nHowever, as the game progressed, Barcelona’s response to the Newcastle pressure became clear: getting Pedri and De Jong on the ball. The more the Blaugrana’s double pivot touched the ball, the more the Blaugrana were able to move up the pitch as a unit and set up camp in Newcastle’s half.\nThe midfield pair pulled the strings for the remainder of the game, neutralizing the home team’s pressure with their movements and continuously finding spaces behind the Newcastle lines. Per Opta, they combined for a total of 170 passes - 35 of which were line-breaking, created three chances, and perhaps most importantly, ensured the tempo of the match was favorable to Barça’s strengths.\nPerhaps the sequence that best encapsulates their performance as a unit happened in the 78th minute.\nAs the buildup initiates from a throw to Gerard Martin, notice Pedri’s position: he’s not in the central position you’d expect him to be. Instead, he’s drifted all the way to the left touchline.\nAs Pedri receives, he holds the football just enough to draw in two Newcastle midfielders before releasing it to De Jong, who has naturally followed the action.\nThe Dutchman is a powerful carrier, and the space generated by Pedri’s extra touch is enough for him to attack the center of the pitch.\nAs Woltemade makes the effort to track back, De Jong doesn’t settle for the first option: a pass to Kounde here is easy to execute, but would put his teammate at a disadvantage.\nInstead, he turns, and, with the help of Pedri- whose turn it was to follow the action, now has time to scan for spaces in Newcastle’s shape.\nThe pair pass it back and forth a couple of times, seeing if any opportunities to progress up the pitch arise.\nAs they fail to see a gap and Newcastle launch a new wave of pressure, no one forces the issue. Instead, De Jong simply resets to Joan Garcia.\nAs the ball is played into the right side, this time. Notice the space that is left behind Gordon as he pressures the ball carrier, a direct result of Newcastle’s renewed pressing efforts just seconds earlier. Pedri immediately identifies it and offers a passing option to Koundé.\nAt this stage, the Newcastle structure is compromised. Pedri and Kounde are in a 2 v 2 situation vs Guimaraes and Livramento, with no nearby support for the Newcastle duo. The right-back initiates a decoy run down the byline, as if expecting a ball into the space from Pedri.\nAs Koundé stops, he has time and space to combine with Pedri. The latter plays the pass and immediately moves to occupy the space he had previously identified.\nPedri can then receive the ball and carry it unchallenged, facing the play the entire time as the Blaugrana enter Newcastle’s half.\nThis 40-second sequence highlights not only De Jong and Pedri’s prowess at evading opponent pressure, but also the freedom Hansi Flick is affording them.\nThe Blaugrana have the luxury of having two elite problem solvers at the base of their midfield, and the German manager has entrusted them with the freedom to lead the team’s buildup how they see fit.\nThe sequence we just analyzed is not the result of a pre-set pattern, practiced and repeated hundreds of times on the training ground, but rather that of two players constantly taking in information from their surroundings and adapting on the fly, a dynamism that impressed Newcastle’s Anthony Gordon.\n“I think the way they keep the ball was a learning experience. We don’t play against that kind of style in England[...] Some of the play in midfield was really top,” he told TNT Sports after the game. “We’ve played against some top teams like City, Liverpool, Chelsea, Arsenal, but the way they passed the ball, the midfielders, the way they were fluid in their movement and combining made it really hard for us to press.”\nA Physical Presence in Midfield\nPedri and Frenkie de Jong’s brilliance on Thursday night was not just highlighted by how they retained and progressed the ball. Their performance out of possession was also key to Barcelona’s win.\nThe midfield partnership was effective at winning the ball back. Per Sofascore, the midfield duo recorded two interceptions each, with De Jong and Pedri adding three and four successful tackles, respectively. The pair also combined for 13 duels won- Pedri winning an outstanding 9/12, while De Jong won 4/8.\nThe pair’s dueling and ball-winning performance is particularly impressive considering their direct matchups for the night. The midfield trio of Sandro Tonali, Joelinton, and Bruno Guimaraes is widely considered one of the most physical in the Premier League.\nWhile the Blaugrana midfield is not typically touted for its physical attributes, it is worth noting that this is because the general perception of physicality in footballing discourse is quite narrow, accounting for little more than raw strength.\nPedri & De Jong remain special athletes in their own right, as evidenced by Thursday’s performance. Their agility, balance, change of pace, and endurance are all remarkable attributes, which allow them to redefine what “physicality” in the midfield can look like.\nA Show of Maturity to Cap It Off\nA final takeaway from the Blaugrana’s Champions League opener was the team’s game management after Newcastle’s 90th-minute goal to make it 2-1.\nIn the minutes that followed Anthony Gordon’s goal, Barcelona made a concrete effort to retain as much possession as possible. At the heart of that effort were, again, Pedri & De Jong.\nPer Opta, from the 90th minute to the referee’s final whistle, the midfield duo completed a total of 19 passes, more than double Newcastle’s team tally during the same period (8), essentially ensuring Barça would walk out of St James’ Park with the full three points.\nThis game management facet is something the Blaugrana have lacked sometimes in the past, most notably against Inter in the Champions League semi-finals last season. It is a development that could pay dividends later in the season.",
  "word_count": 1193,
  "scraped_at": "2026-02-14T02:09:24.921913",
  "_text_extracted": true
}