{
  "article_id": "fa2401838e91",
  "url": "https://www.meathchronicle.ie/2025/03/01/saturdays-briefing-dinner-on-garnacho-and-rodri-on-road-to-recovery/",
  "title": "Saturday briefing : Dinner on Garnacho and Rodri on road to recovery",
  "date": "20250301T134500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday’s briefing: Dinner on Garnacho and Rodri on road to recovery\nBy PA Sport staff\nManchester United boss Ruben Amorim revealed Alejandro Garnacho was to take his team-mates out for dinner as an apology for how he reacted to being substituted against Ipswich.\nRodri took a notable step forward as the Ballon d’Or-winning Manchester City midfielder continued his recovery from his anterior cruciate ligament injury.\nAston Villa moved into the last eight of the FA Cup, while Fenerbahce announced boss Jose Mourinho was suing Galatasaray after they accused him of making “racist statements”.\nDinner on Garnacho\nUnited’s 3-2 home win over Ipswich on Wednesday saw Patrick Dorgu’s sending off late in the first half prompt a reshuffle in which Garnacho was taken off.\nThe 20-year-old Argentina winger’s response was to head straight down the tunnel, and Amorim, whose side host Fulham in the FA Cup on Sunday, told a press conference: “It was funny because in the next day he came to me, to my office.\n“I did some investigations, and he went to the dressing room, he changed his clothes because he was wet. He watched the game in the different (place), not on the bench. In the end of the game he was there, then he went home, so there’s not an issue there.\n“But I told them that in Manchester United everything is important, and the perception in a big club is really important, so he’s going to pay a dinner to all the team, and that’s it.”\nRodri’s training return\nHaving been sidelined since sustaining the ACL injury in September, Rodri was seen taking part in an individual session at City’s training ground in a video released by the club on Friday evening.\nThe Spain international’s absence has been cited as a key factor in Pep Guardiola’s Premier League champions having fallen 20 points behind Liverpool in this season’s title race, and also exiting the Champions League.\nGuardiola has been reluctant to put a timetable on when the 28-year-old might play again – speaking at the start of February, the City boss said: “The most important thing for him is to recover well, he is not a teenager but he still has years to play and it’s going to happen if he recovers well.”\nVilla advance\nMarco Asensio starred again as Aston Villa booked a first FA Cup quarter-final appearance in 10 years with a 2-0 home win over Championship strugglers Cardiff.\nHaving netted twice when Unai Emery’s men beat Chelsea 2-1 in their last game at Villa Park, on-loan Paris St Germain midfielder Asensio produced another second-half double, scoring in the 68th and 80th minutes.\nAs with both of the goals against Chelsea, the first on Friday was set up by Asensio’s fellow deadline-day loan signing Marcus Rashford.\nMourinho launches action against Galatasaray\nAs the fallout from Monday’s 0-0 draw between the sides continued, Fenerbahce released a statement saying Mourinho had through their lawyers sued Galatasaray for 1,907,000 Turkish Lira (around £41,500) “for non-pecuniary damages due to the attack on (his) personal rights”.\nThe Portuguese was accused by Galatasaray of making “racist statements” in his post-match comments, in which he said their bench were “jumping like monkeys”, and that Slovenian referee Slavko Vincic did a better job than Turkish officials would have done.\nMourinho has been handed a four-match ban and a fine equivalent to £35,000 by the Turkish Football Federation for his post-match comments.\nWhat’s on today?\nThe FA Cup fifth round continues with ties including Manchester City hosting Plymouth, who pulled off a famous upset in round four with their 1-0 victory over Liverpool.\nCrystal Palace host Argyle’s fellow Championship side Millwall and there is an all-second tier derby between Preston and Burnley at Deepdale, while Bournemouth entertain Wolves.",
  "word_count": 626,
  "scraped_at": "2026-02-14T02:14:59.445082",
  "_text_extracted": true
}