{
  "article_id": "fa46b73002d8",
  "url": "https://www.bbc.co.uk/sport/football/67546819",
  "title": "Paris St - Germain : Why French side dont need to win Champions League to be successful",
  "date": "20231128T093000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris St-Germain: 'Why French side don't need to win Champions League to be successful'\n- Published\nParis St-Germain could reach the Champions League last 16 for the 12th season running if they beat Newcastle on Tuesday - yet their record in the competition is still mocked by many outside the French capital.\nThey have reached just one final, when they were beaten by Bayern Munich in 2020, and a solitary semi-final, which they lost to Manchester City the following season.\nOf course, PSG have spent lots of money and boasted some of the biggest names in the game, including Neymar, Lionel Messi, Thiago Silva, Angel di Maria, Edinson Cavani, Zlatan Ibrahimovic and, still, Kylian Mbappe\nBut chief revenue officer Marc Armstrong rejects completely the assertion PSG's status is diminished by their failure to lift the biggest trophy in the European club game.\n\"You don't have to win the Champions League to be a successful football club,\" he said.\n\"Would we love to win it? Yes. In the past four seasons, we have been in a final and a semi-final. We are one of only three teams to be in the knockout stage every season since 2012-13, along with Real Madrid and Bayern Munich. We are number four in the Uefa coefficient.\n\"But the chairman was quite forthright this summer with the new sporting strategy - that [Champions League] is not an obsession.\"\nMoving away from galacticos era\nSpeaking in the club's plush central London office and then on a visit to the PSG store on Oxford Street which opened in September, Armstrong was eager to stress that on the pitch the club is heading in a different direction than the one it had been in before.\nMbappe, Neymar and Messi were part of the 'galacticos' approach. It brought PSG nine league titles and six French Cups since the club was taken over by Qatar Sports Investments (QSI) in 2011.\nFor most of the summer, it seemed all three players would leave - only for the contract stand-off with Mbappe, which at one point had him exiled from the first-team squad amid a belief he was ready to quit for Real Madrid at the end of the season, to reach a point where both parties felt they could move forward together.\nArmstrong was not keen to talk about Mbappe's future, although there have been reports the 24-year-old is now considering staying with PSG rather than realising what many assume to be a boyhood dream of joining Real.\n\"He is a great player, clearly, and important from a sporting point of view,\" he said.\n\"But, commercially, we are bigger than any one player. It is about the brand and what we are building. We know we will always have a strong competitive squad on the pitch. There will always be investment on and off the pitch to continue to grow.\"\nDefending their ownership - and stadium issues\nAs is the case with Newcastle and Manchester City, and was around Sheikh Jassim's efforts to buy Manchester United, PSG have had to answer questions about the source of their funding.\nQatar is a small Gulf state that has become vastly wealthy from its reserves of natural gas. It has also been pivotal in negotiating a pause in fighting in the war between Israel and Hamas in Gaza under a deal that has also seen some hostages held by Hamas released. But Hamas' political office being based in Doha has brought questions about the relationship between Qatar and the organisation which the UK government has characterised as a 'terrorist group'.\nPSG are privately calm about their position and dismiss the notion most of their impressive commercial revenue figures come from deals agreed with Qatari sponsors.\n\"Six of our 35 sponsors are from Qatar,\" said Armstrong. \"It is less than 20% of our global revenue.\n\"Clearly some Qatari brands want to associate with a Qatari club. Qatar Airways is the sponsor of many properties. They have been on the Barcelona jersey, and Roma. Having them on our jersey is a normal thing and you can see why they would want to do that.\"\nThere is no doubt the club's hierarchy are in powerful positions, with chairman Nasser Al-Khelaifi installed as one of the most important people in the European game after becoming European Clubs' Association chairman in the wake of the Super League controversy, which is due to reach some kind of conclusion next month when the European Court of Justice delivers its verdict.\nBeyond dispute also is that they are looking long term. Their current issue is trying to get an agreement to increase the capacity of the Parc des Princes way beyond its current 48,583.\nThe threat of a move away from PSG's spiritual home lingers, potentially to the Stade de France, which is currently the subject of bids for a 25-year lease and an outright purchase.\n\"Our clear preference is to redevelop the Parc des Princes,\" said Armstrong. \"It is our historic home. It is where we want to be, where the fans want us to be and is within the city limits.\n\"But the money it would take to turn it into the stadium it needs to be is huge. We are prepared to spend that and we want to, but the city needs to sell us the building.\n\"We have been very clear and we have been looking for the last year, seriously, at other options.\"\nReshaping PSG\nPSG are spending a lot of time redeveloping their academy structure.\nThe wider Paris area, they argue, is the greatest developer of talent in the world, more productive than Sao Paolo in Brazil.\nPSG's reasoning is that rather than allowing the likes of Paris-born Mbappe to develop at Monaco and then buy him for an eye-watering £165m, better to get those players to the club at a much younger age.\nThis is part of the reshaping Armstrong talks of as PSG move into the next phase of the ownership, with 33 trophies won and the brand constructed.\nPost Qatar World Cup, QSI have been looking at buying part of a Premier League club.\nTalks with Tottenham chairman Daniel Levy got nowhere because the price was too high and speculation around interest in the near 10% stake in West Ham co-owner Vanessa Gold is willing to sell has been quashed.\nThey are looking though, just as they are committed to selling a small part of PSG.\n\"There is no interest in selling the club,\" said Armstrong. \"It is just about bringing the business to the next level and opening up key markets.\"\nWin or lose against Newcastle, with the Eiffel Tower on their badge, a single major club in one of the most popular cities on the planet, PSG's momentum is unquestionably forward.",
  "word_count": 1129,
  "scraped_at": "2026-02-14T02:07:27.057097",
  "_text_extracted": true
}