{
  "article_id": "fa5163b652b2",
  "url": "https://www.nytimes.com/athletic/7038847/2026/02/12/thomas-frank-tottenham-pr-disaster/",
  "title": "Thomas Frank never knew how to talk to Tottenham fans – he was a PR disaster",
  "date": "20260212T063000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thomas Frank’s eight-month tenure at Tottenham Hotspur was not just a disaster on the pitch, but a calamity in public-relations terms.\nAnge Postecoglou, Frank’s predecessor, was bold in his predictions and ambitions over his two years in the job, occasionally to his detriment. The Australian’s assertion that his sides always win trophies in his second season became almost as iconic as Tottenham’s eventual Europa League final triumph itself; a prophecy that elevated his status and aura within the fanbase.\nAdvertisement\nFrank, on the other hand, went out of his way to try to manage expectations. Where Postecoglou stopped a reporter short to assert that “fourth is not the prize”, indicating greater goals for the north London club, Frank’s first press conference as Spurs head coach last July sticks in the mind for different reasons.\n“I promise you one thing,” the former Brentford manager said. “One thing is 100 per cent sure. We will lose football matches. I haven’t seen a team that are not losing any football matches. There is Arsenal — that we cannot mention — in the Premier League. So I made my first rookie mistake there.”\nWhat Frank said is true: not even neighbours and arch-rivals Arsenal’s ‘Invincibles’ side of 2003-04 went through that season unbeaten in all competitions. And yes, Spurs were always facing a transitional campaign, given the departure of club captain Son Heung-min as well as Postecoglou in the summer and long-term injuries to star players in Dejan Kulusevski and James Maddison.\nBut that doesn’t mean he had to say it out loud into a microphone. The sense that Frank was reluctant to aim for the stars on the back of Tottenham winning their first trophy in 17 years jarred with sections of the fanbase from the outset.\nAn early mishap in communication is forgivable, but that would not prove a one-off communications blunder.\nFrank’s repeated focus on issues out of his control, including those injuries to Kulusevski and Maddison, as well as comparisons with Arsenal, contributed to the simmering discontent, which spiralled out of control in the 2-1 home defeat against Fulham in late November and just got worse before his sacking on Wednesday.\n“Sacked in the morning!” chants were as frequent as turgid performances and disappointing defeats in his final weeks, coming to a head in what proved his last match in charge, Tuesday’s miserable 2-1 loss to visitors Newcastle United, where fans chanted for former Tottenham manager Mauricio Pochettino, under whom they finished third, second and third in successive Premier League seasons from 2015 and got to the 2019 Champions League final, but who was fired in the November of that year and is now in charge of the United States’ men’s national team.\nAdvertisement\nPochettino’s own PR record has not been unblemished in recent months. His effort to ensure USMNT and Marseille forward Timothy Weah did not involve himself in discussions regarding high World Cup ticket prices at the tournament largely being hosted by the U.S. this summer — saying “players need to talk on the pitch, playing football, not outside” — was criticised by some Spurs supporters on social media.\nBut the Argentinian has a habit of knowing exactly what to say about his old employers.\n“Tottenham now is a club that should be trying to win the Premier League and the Champions League because of the facilities that they have,” Pochettino said on the High Performance podcast this week. “In the past, we didn’t have that. Winning the Europa League is not enough for a club like Tottenham. It is a club that should be fighting for the Champions League and Premier League.”\nIt seems unlikely Tottenham will have any success in tempting Pochettino out of his position four months away from what is effectively a home World Cup for the States. Still, it’s because of his messaging and belief in the club that so many fans are pining for his return.\nPochettino — and Postecoglou for that matter — spent the large majority of their tenures trying to increase belief and elevate the club’s standing, while Frank’s communication too often bordered on self-pity.\nWhat is true, however, is that misguided comments or unfortunately-branded coffee cups can be easily forgotten if results and performances are good.\nLike Frank, Postecoglou’s prickly manner and continual references to the previous season’s fifth-place league finish in his final year were under the microscope as Tottenham slid down the table to end up a pitiful 17th. His “second season” prophecy would have looked ridiculous had Spurs lost to Manchester United in that final — a performance that was gutsy but lacked any of the essential ‘Angeball’ tenets that built his reputation.\nAdvertisement\nBut there was a palpable lack of big-club energy in the way Frank and Tottenham have operated this term.\nIt’s one thing talking up the quality of Paris Saint-Germain in the UEFA Super Cup or Manchester City in the Premier League before facing those sides in August, and then going toe-to-toe with superior opposition in those matches and finding a way to hurt them on the pitch. That is the coach many Tottenham supporters were excited about when his appointment was confirmed in June.\nBut it’s another thing entirely to speak admiringly about the players and on- and off-field structure at Arsenal, and suffer a humiliating 4-1 derby defeat, including a hat-trick by Eberechi Eze, a player who was on the verge of joining Tottenham from Crystal Palace last summer before deciding to return to his boyhood club instead. Just days before that game in November, Frank was asked a question about Eze, to which he replied, “Who?” — a comment he surely reflects on with regret.\nThere was no lesson learned regarding Antoine Semenyo, whom Frank admitted the club pursued in January, with the Ghana international forward opting instead to leave Bournemouth and sign for City. While the plan was to demonstrate the ambition of the Lewis family, the club’s majority owners, Tottenham followers did not need reminding that their club sit lower in the food chain than the rest of the Big Six, particularly as the market drew to a close last week and their need for attacking reinforcements increased due to further injuries.\nBy the end, Frank’s position was untenable.\nThe fans were disenchanted, with a reported attendance at the Tottenham Hotspur Stadium of 59,773 for his final game, around 3,000 below capacity (though the television images of the game and the naked eye inside the ground indicated the crowd was much smaller than that). Supporters were tired of watching a disorganised and seemingly dispirited team lose often while the coach claimed that performances had improved.\nOver his seven seasons managing Brentford, Frank was the beloved face of the club, with wide-ranging respect across the Premier League for his skill and intelligence in speaking about complex issues.\nUnfortunately, having taken the Tottenham job, he missed the mark from the start and never recovered.",
  "word_count": 1155,
  "scraped_at": "2026-02-14T02:27:10.750584",
  "_text_extracted": true
}