{
  "article_id": "fa51e80f8294",
  "url": "https://www.bbc.com/sport/football/articles/c981203e61qo",
  "title": "Legal complaint filed against Fifa  abuse of dominance  ",
  "date": "20241014T161500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Legal complaint filed against Fifa's 'abuse of dominance'\n- Published\nThe top European leagues and players' union Fifpro have filed a legal complaint against Fifa with the European Commission over what they claim is an \"abuse of dominance\" by world football's governing body.\nThe European Leagues, which represents 39 leagues - including the Premier League - and 1,130 clubs across 33 countries, claim, along with the European branch of Fifpro, that Fifa has abused its role under European competition law when it comes to the international fixture calendar.\nThe Spanish La Liga is not a member of the European Leagues but is joining the action.\nAlexander Bielefeld, director of policy at Fifpro, said the different parties \"had submitted a legal complaint to the European Commission\" and called it \"unprecedented\".\nBBC Sport looks at the case from both sides and the arguments being made.\nHow did we get to this?\nThere has been an ongoing row about the number of games players face during a season and this is the latest legal action that has been filed on the issue.\nThe Professional Footballers' Association joined a legal action against Fifa in June about the \"overloaded and unworkable\" football calendar.\nThe PFA and the French players' union filed a claim at the Brussels court of commerce \"challenging the legality of Fifa's decisions to unilaterally set the international match calendar and, in particular, the decision to create and schedule the Fifa Club World Cup 2025\".\nThere are scheduled to be 12 European representatives at the expanded Club World Cup, to be held in the United States from 15 June-13 July.\nThe tournament was confirmed by the Fifa Council in December 2022 and the PFA argues it is a \"tipping point for the football calendar and the ability of players to be able to take meaningful breaks between seasons\".\nFifpro has also claimed, external \"Fifa's decisions over the last years have repeatedly favoured its own competitions and commercial interests, neglected its responsibilities as a governing body, and harmed the economic interests of national leagues and the welfare of players\".\nGuardiola wants delayed start for Man City next season\n- Published4 October 2024\nPFA joins legal case against Fifa over match calendar\n- Published13 June 2024\nWhat does the football calendar look like?\nThis season, all three European club competitions have been expanded to 36 teams. The Champions League and Europa League have eight first-phase games, compared to six in the 2023-24 campaign.\nThe PFA highlighted that for some of its members \"the 2024-25 season is set to roll almost seamlessly into the 2025-26 season\".\nThe Premier League campaign finishes on 25 May, before the Champions League final on 31 May.\nThere will then be a window of international games from 2-10 June before the start of the extended Club World Cup.\nManchester City wanted a delay to their matches at the start of the 2025-26 season because of their involvement in the Club World Cup, but do not think the Premier League will agree to such a request.\nThe next World Cup then takes place in the summer of 2026, with Canada, Mexico and the United States being the co-hosts.\nWhat do the players say?\nSpain and Manchester City midfielder Rodri recently said players are close to going on strike in protest at an increase in games.\nThe 28-year-old featured 63 times for club and country last season as he won the Premier League and European Championship.\nAccording to a recent Fifpro report on player workload, Rodri was included in 72 matchday squads for club and country, including pre-season friendlies, between July 2023 and July 2024 - totalling 6,107 minutes on the pitch.\nRodri played more than 550 minutes for Spain at Euro 2024, featuring in each of the seven games until coming off injured at half-time in the final on 14 July.\nHe returned to action on 8 September for his country in a Nations League game against Switzerland before suffering a season-ending knee injury playing for City against Arsenal on 22 September.\nSwitzerland and Manchester City defender Manuel Akanji has joked he may have to retire at 30 because of relentless fixture schedules, while Liverpool keeper Alisson has also complained over a perceived lack of consultation about the football calendar.\n\"Sometimes nobody asks the players what they think about adding more games,\" said Alisson, who is currently sidelined with a hamstring injury.\n\"Maybe our opinion doesn't matter, but everybody knows what we think about having more games. Everybody's tired of that.\"\nPlayers 'close' to striking over schedule - Rodri\n- Published17 September 2024\nNobody asks players about adding games - Alisson\n- Published16 September 2024\nWhat do Fifa and Uefa say?\nOne of the claims levelled at Fifa is that it did not have a proper consultation process before expanding the football calendar.\nWorld football's governing body has insisted Fifpro and the World League Association were consulted about changes to the overall 2025-30 international match calendar, including the 2025 Club World Cup.\nFifa says, external it has no intention of altering next year's Club World Cup, saying it is \"fully within our rights to set the parameters of our competitions whilst respecting the regulatory framework in place\".\nFifa has also accused some leagues of \"hypocrisy\" and acting \"without consideration to everyone else in the world\".\n\"Those leagues apparently prefer a calendar filled with friendlies and summer tours, often involving extensive global travel,\" said Fifa.\n\"By contrast, Fifa must protect the overall interests of world football, including the protection of players, everywhere and at all levels of the game.\"\nFollowing the end of the last Premier League campaign on 19 May, Newcastle United and Tottenham flew to Australia for an end-of-season friendly at the Melbourne Cricket Ground.\nPremier League clubs also took part in pre-season games across the US and in Tokyo last summer.\nA recent study by the CIES Football Observatory,, external - a research group at the International Centre for Sports Studies - on schedules and player workload suggested that clubs are not playing more matches per season.\nIts report found that between 2012 and 2024, the average number of fixtures per club and season sat at just over 40, with about 5% of clubs playing 60 or more games per season.\nNo significant change was observed in the proportion of clubs playing 60 or more matches.\nUefa president Aleksander Ceferin has conceded \"the match calendar has reached full capacity\" but also believes complaints over the issue are from a minority of players.\n\"The impact is very different among clubs and players. Some are over-burdened. The others have spare capacity,\" he said.\n\"In fairness to those who are stretched, I stand by what I said two months ago, there is no room for additional matches. But I have to add this, who is complaining? The ones who have the highest salaries and the ones [clubs] with 25 top players.\n\"The ones with lower salaries and hardly 11 players are not complaining. They love to play.\"\nWhat happens next?\nFifpro expects the European Commission to open a preliminary investigation, in which it will speak to Fifa, Fifpro and the European Leagues.\nThere is no fixed timeframe but the preliminary investigation could take 12 months and the expectation is that there would then be a decision on whether to open a formal investigation.\nDavid Terrier, president of Fifpro Europe, said it was the organisation's job to represent the players but that Fifa had not \"opened its doors\" to them and that \"in a bid to expand its competitions and increase its revenue... Fifa has failed in its regulatory mandate\".\nAsked how likely a player's strike was, Terrier told BBC Sport: \"The players are clear, they will go to strike.\n\"I think we just need to manage the players for the strategy of the strike. But the strike, if they press on the button, the player will go. Now it's clear.\"\n\"This is unfortunate but the message we have together is very simple - enough is enough, we can't take it any more,\" said Mathieu Moreuil, the director of international football relations and EU affairs at the Premier League.\n\"We now have an international match calendar beyond saturation, which creates a lot of issues for domestic leagues in terms of scheduling and other domestic competitions, and an international match calendar that creates risk for players and their health.\n\"We've tried to engage with Fifa on that for years now without any positive response.\"\nLorin Parys, chief executive of the Belgian Pro League, added that just when the threat of a European Super League had been averted \"here comes Fifa through our backdoor whistling, yelling 'surprise',\" in \"the seeds of what could become a Super League in the future\".\n\"Fifa should really be fronting as a friend but it acts more like a foe. That's something we want to change.\"\nRelated topics\n- Published16 August 2025",
  "word_count": 1481,
  "scraped_at": "2026-02-14T01:49:08.087577",
  "_text_extracted": true
}