{
  "article_id": "fa8bc8ffcd42",
  "url": "https://www.arsenal.com/news/mikel-merino-signs-arsenal-long-term-deal",
  "title": "Mikel Merino signs for Arsenal on long - term deal",
  "date": "20240827T161500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spain international Mikel Merino has joined us from La Liga side Real Sociedad on a long-term contract.\nThe 28-year-old midfielder has been a vital member of Sociedad’s team since joining the Basque side in 2018. In the heart of their midfield, he made 242 appearances, scoring 27 goals and assisting 30 times.\nBorn in Pamplona, Spain, Mikel started his career with Osasuna. He progressed through their youth ranks into the first team, where he made 67 appearances and scored eight goals. In July 2016, he joined Borussia Dortmund and helped them win the German Cup the following May.\nGet your Merino 23 shirt now from Arsenal Direct\nThat summer, Mikel joined Newcastle United on a season-long loan and, after making a strong early impression, he was signed on a permanent deal just a couple of months later, going on to make 24 Premier League appearances in his debut season.\nIn 2018, Sociedad signed Mikel and he has played his football there ever since. He played an integral role as they won the 2020 Copa del Rey, and qualified for the Champions League last season, when he won more duels for possession than any other player in Europe's top leagues, with 326 recoveries.\nMikel is an experienced international with 28 appearances for Spain. At youth level, he won the European Under-19 Championship in 2015 and the European Under-21 Championship in 2019. He also has an Olympic silver medal, playing a key role in Spain’s second-place finish at the 2020 Games in Japan.\nHe was part of the squad that won the 2023 UEFA Nations League, beating Croatia 5-4 on penalties in the Rotterdam final. More recently, the midfielder helped his nation win the European Championships, with Spain beating England 2-1 in the final. Mikel notably made his mark on La Roja's road to the final, scoring a 119th-minute winner in their quarter-final against Germany.\nSporting Director Edu said: “We are so happy to have completed the transfer of Mikel Merino. This has been another great team effort from many people at the club to finalise the transfer of a player who attracted interest from a number of clubs over the summer.\n“Mikel was a key target for us this summer, and we identified him as a player who can fit perfectly into our squad and profile to improve us, as we aim to build on our strong performances of last season. With Mikel’s arrival, he brings us an added high quality of experience, physicality and athleticism as we look forward to this season ahead.\n“We welcome Mikel and his family to the club, and look forward to seeing him play in the Arsenal shirt.”\nWatch Mikel Merino's first interview as Gunner now\nMikel Arteta added: “Mikel is a player who will bring us huge quality with his experience and versatility. He has played at the top of the game at both club and international level for a number of seasons now. Mikel will make our squad significantly stronger, with his technical ability, together with his strong and positive character and personality.\n“As we all saw in the summer, Mikel is also a winner, with his strong performances throughout the Euros helping Spain win the tournament. We are delighted to welcome Mikel and his family to the club and can’t wait to start working with him.”\nMikel will wear the number 23 shirt and will immediately join up with his new teammates at Sobha Realty Training Centre.\nEveryone at Arsenal welcomes Mikel Merino to the club.\nThe transfer is subject to the completion of regulatory processes.\nFind out everything you need to know about Mikel, including these 15 facts, and analysis of his playing style and key stats\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 643,
  "scraped_at": "2026-02-14T01:57:35.665188",
  "_text_extracted": true
}