{
  "article_id": "fabc089d4082",
  "url": "https://www.nytimes.com/athletic/6124765/2025/02/10/liverpool-slot-plymouth-var/",
  "title": "The Briefing : Arne Slot first slip , Plymouth magic , missing VAR and the great nearly - goals",
  "date": "20250210T091500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to The Briefing, where every Monday during this season, The Athletic will discuss three of the biggest questions to arise from the weekend’s football.\nThis was the FA Cup weekend when Manchester City survived a scare, Tottenham Hotspur slumped out of a second competition in four days, Southampton lost to Burnley, and the biggest shock was saved for Sunday.\nAdvertisement\nHere, we will ask how much of a mistake Liverpool’s Arne Slot made, what a weekend of no video assistant referees tells us about the VAR system, and whether goals should be given to players for emotional and aesthetic reasons.\nWas this Arne Slot’s first misstep? And does it matter?\nEven the most puritanical viewer would have forgiven Plymouth Argyle’s Nikola Katic for using some rather adult language, live on TV, in celebration of their magnificent victory against Liverpool on Sunday.\nKatic lost a tooth to the cause and in some ways, the surprise was that only one got knocked out given the number of headers the Bosnian defender won. He, his central defensive partner Maksym Talovierov, goalkeeper Conor Hazard and… well, most of the Plymouth team, really, were magnificent and thoroughly deserved the win. For much of the second half, they looked more likely to add to Ryan Hardie’s penalty than Liverpool were to find an equaliser.\nIt’s been a deeply weird season for Plymouth: they sacked Wayne Rooney as manager on New Year’s Eve, not a huge surprise given they were and still are stone bottom of the Championship, having conceded more goals than anyone else in the top four divisions of English football. But in the past few weeks, they’ve beaten Brentford and Liverpool and are now in the fifth round of the FA Cup.\nFor Liverpool, this was obviously a significant embarrassment.\nArne Slot was correct to field a weakened side given Liverpool’s other priorities and he should have been able to trust a starting XI that featured several players he would happily play against Arsenal or Real Madrid to beat Plymouth.\nWhere he erred was also selecting an inexperienced bench. The sensible choice in these circumstances is to rotate the starting XI but keep a few big guns on the bench as a sort of ‘break glass in case of emergency’ option. He only had Darwin Nunez as a senior alternative when things didn’t go to plan, which he probably thought would be enough/wouldn’t even be required, but it clearly backfired.\nAdvertisement\nYou could argue that the benefits of giving the likes of Mohamed Salah, Virgil van Dijk and Dominik Szoboszlai a complete rest outweighed the risk of losing a game in Liverpool’s fourth most important competition. The Premier League and Champions League will always be greater priorities and being in the final of the Carabao Cup elevates that above the FA Cup.\nCould it have any broader impact, momentum/morale-wise for the rest of the season? You’d like to think not, but this was arguably Slot’s first tangibly costly mistake as Liverpool manager.\nWhat does a VAR-less weekend tell us about VAR?\nSuch is the ubiquity of the VAR system and the hold it has over our collective football conscience, it’s one of the most notable talking points even on a weekend when it’s not being used.\nThe beleaguered review system will only be used from the fifth round of the FA Cup this season, meaning those among us who would rather VARs were not part of the game could enjoy the fourth round games in peace.\nNot everyone was delighted though and, in fairness, with good reason.\nThe main incident came on Friday evening when Harry Maguire scored a late winner to add a little misleading polish to another stodgy Manchester United performance, leaving Leicester City most unhappy as Maguire was pretty obviously offside.\nThere are a couple of things to consider here. First, that a VAR would quickly have chalked this goal off given Maguire was one of a few United players who were offside. But second, and perhaps more interestingly, it raises the question of why it wasn’t given as offside: Maguire looked offside at first viewing, so this isn’t revisionism about how easy the decision was.\nSo clear was the decision that you wonder if the same thing has happened to assistant referees as has happened to many of us in our cars: we’re so reliant on technology now that we use satnavs even for simple drives or ones we have done before, which is convenient for those of us with awful senses of direction, but it does also mean we have essentially lost the ability to rely on our wits. Could it be that a similar thing has happened to assistant referees — in this case, Marc Perry, who has largely done his work in the past few seasons with the safety net of a VAR?\nAdvertisement\nElsewhere, Enzo Maresca argued that Brighton & Hove Albion’s winner against Chelsea should have been disallowed on Saturday due to a possible handball, the sort of incident that a VAR could well have overturned. Joe Willock’s first goal for Newcastle United against Birmingham City, which didn’t appear to completely cross the line, was slightly different because that controversy was caused by a lack of goal-line technology, which is in place for FA Cup games at Premier League and Championship (but not Birmingham’s League One) stadiums.\nTo varying extents, three teams were stiffed by decisions that technology may have overturned, which is clearly irritating for them and they will rightfully complain. It’s not fair, but to quote grumpy parents everywhere when faced with a complaining child: life isn’t fair, football isn’t fair and the VAR system hasn’t been fair a lot of the time either. And that’s OK.\nThis is the world we should be living in all of the time, one where sometimes officials make mistakes, as we all do from time to time, and we should be able to deal with that. Alas, as a collective, we haven’t, which is how we have reached the situation we’re in with VAR, a tedious drain on the game.\nWhere does Jamie Donley’s rank in the great ‘nearly-goal’ stakes?\nSometimes you wish goals could be awarded to a player on aesthetic or emotional grounds rather than because of the actual events that occurred, which are sometimes much drearier than the alternative, more romantic reality.\nDoes it really matter that according to the pen pushers and those who only care for ‘facts’, Jamie Donley will not be credited with scoring Leyton Orient’s goal against Manchester City because of the piffling detail that he, well, didn’t?\nIt was Donley who had the vision to spot Stefan Ortega off his line, Donley who had the chutzpah to even attempt to lob the Premier League champions’ goalkeeper from 40 yards, Donley who had the ability to ping the ball over the German’s head.\nAnd it will be Donley who will be asked about it in years to come, hopefully having achieved many more acts of skill and derring-do, possibly when he returns to his parent club, Tottenham Hotspur, when his loan is done at the end of the season.\nAdvertisement\nMorally, it’s his goal, but alas, it hit the bar, then hit Ortega and went in: own goal, so instead Donley will join some very prestigious names in the annals of the ‘great nearly-goal’.\nThe closest comparison to his is probably Jorginho, who, a couple of seasons ago, hit an arrow of a shot towards the Aston Villa goal, only for it to hit the frame and bounce in off Villa goalkeeper Emiliano Martinez. And it’s the exact inverse of Wayne Rooney’s strike against Switzerland at Euro 2004, which hit the post and then crossed the line via goalkeeper Jorg Stiel’s head, but bizarrely the goal has always been credited to Rooney.\nOther examples of nearly-goals tend to fit a more literal interpretation: ones that weren’t actually goals at all. Pele provides two of the most famous examples from the 1970 World Cup, a shot from halfway that sailed just wide and an outrageous dummy that sold the goalkeeper, only for O Rei to drag his shot past the post, both much more famous than many of his actual goals.\nA couple of years before he pulled England’s pants down with one of the greatest goals of all time at the 1986 World Cup, Diego Maradona very nearly scored a similar one in a friendly at Wembley.\nThen there are the goals that were scored but didn’t count, such as Pedro Mendes’ long-range lob that Roy Carroll spilt over his line, not spotted by the officials, or the one that Cristiano Ronaldo thought he’d scored with some outrageous skill and a flamboyant chip, only for Nani to head home from about half a yard out… while offside. Ronaldo was most vexed, but he can probably dry his eyes on his 135 international goals that did count.\nGO DEEPER\nThe officiating blunder your club's fans are still going on about\nFine company then, for Jamie Donley. Maybe it doesn’t matter that technically he didn’t score this one. We all know he was responsible for it.\nComing up…\n- Still absolutely ravenous for potential FA Cup upsets? Well, you could be in luck, with a couple of Premier League sides facing some potentially ticklish ties: on Monday, Crystal Palace face League Two promotion-chasers Doncaster Rovers, while on Tuesday, Nottingham Forest travel to play League One strugglers Exeter City.\n- And on Tuesday, the big-boy stuff begins: the Champions League playoffs. The biggest of boys are Manchester City and Real Madrid, both in something of a tizz at the moment but who face each other in Manchester for their first leg on Tuesday. That night it’s also Brest vs Paris Saint-Germain, Juventus vs PSV, and Sporting CP vs Borussia Dortmund.\n- And on Wednesday, some more big boys: Celtic vs Bayern Munich is probably the highest-profile game, but keep ’em peeled for Club Brugge vs Atalanta, Feyenoord vs Milan and Monaco vs Benfica, too.\n- That’s not all on Wednesday: it’s the final ever Merseyside derby at Goodison Park as Everton face Liverpool in a game that isn’t anything like the gimme it looked like back when it was originally supposed to have been played, in December.\n- Then, on Thursday, we have some Europa League and Conference League fun to enjoy. The standout play-off for the former is the Jose Mourinho derby between Porto and Roma, while the actual Jose Mourinho’s Fenerbahce play Anderlecht.\n- Finally, on Friday, the Premier League barges through the door a day early and it’s a repeat of Saturday’s FA Cup tie as Chelsea travel to Brighton.\n(Top photos: Getty Images)",
  "word_count": 1786,
  "scraped_at": "2026-02-14T01:52:15.342960",
  "_text_extracted": true
}