{
  "article_id": "fb4fe802bce2",
  "url": "https://theathletic.com/5017415/2023/11/01/manchester-united-fixtures-november/",
  "title": "Manchester United should be trouble - free in November . But what if they arent ? ",
  "date": "20231101T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s six November games won’t make this season, but they could certainly break it.\nThe matches, across three competitions, are against opponents Erik ten Hag’s team should overpower — in contrast to what happened in the derby on Sunday, which only illustrated the gap between United and the league champions.\nAdvertisement\nUnited did extra preparation in training for the derby, knowing how versatile Pep Guardiola’s Manchester City side are, and the feeling within the club was that Sunday’s first half was almost as good as could be expected with a depleted side. United kept City’s chances to a minimum and aggressively regained the ball, but the counter-attacks didn’t materialise as hoped and Rasmus Hojlund and Scott McTominay didn’t take their opportunities.\nTen Hag is an optimist and reminded his players how City had been beaten at Old Trafford at the start of 2023, yet United haven’t recently come close to replicating either that performance or the one shortly after in which they proved too strong for Barcelona.\nIn normal circumstances, United would be expected to fare well against Newcastle United at home, Fulham away, Copenhagen away, Luton Town at home, Everton away and Galatasaray away, but there’s little normal about United this season.\nThe team have lost seven of 14 games in all competitions and sit eighth in the Premier League table with a goal difference of minus-five. United haven’t beaten a team in the top nine all season and only played well in both halves once in 14 matches this term — against a much-changed Crystal Palace side in the Carabao Cup.\nFans keep expecting improvement or a corner to be turned, but it has yet to happen. So maybe it’s better to judge this team against less-than-spectacular opponents than against the very best.\nInjuries are a major factor. Ten Hag hasn’t been able to field a settled side that’s close to his best XI. The back line against City featured players who would not have been in the manager’s best defence last season — even if Jonny Evans and Harry Maguire have been impressive in recent weeks. They are not the reason United have been so dire.\nBehind them, Andre Onana has made a poor start to his United career, both with and without the ball, though he saved his team from further embarrassment in the derby.\nGO DEEPER\nAndre Onana's Man Utd mistakes and technique analysed - and what he can do to improve\nNew signing Mason Mount, whom Ten Hag pushed for, can’t get into his side. Marcus Rashford is playing badly and not scoring. Like the captain Bruno Fernandes, he’s a shadow of the player that wreaked havoc last season. At least Fernandes accepted the captaincy — two players turned down the chance under Ole Gunnar Solskjaer.\nAntony, his season disrupted by domestic abuse allegations, which he denies, has done little to justify the £84million ($102m) fee paid for him last summer. Jadon Sancho, of whom so much was expected, is now an outcast. Antony Martial can’t be relied upon.\nAdvertisement\nThe result is that United suffer from a lack of goals and chances. All seven teams above them in the league have scored between 22 and 26 goals. United have 11.\nMcTominay is playing because he’s powerful, drives forward and brings a goal threat that others haven’t been able to. On Sunday, he played centrally while Fernandes, once a goalscoring and creative force, went wide.\nHojlund is considered the best centre-forward at the club, but he’s 20, new to all this, and his minutes are being managed by Ten Hag. Hojlund’s attitude is refreshing; he’s fearless, up for the challenge and hasn’t been ground down by the pressure that comes with playing for one of the biggest clubs in the world.\nConfidence is low behind the scenes and while the problems are obvious, the answers are less so. Raphael Varane, considered one of the best defenders in the world and central to some of United’s impressive performances last season, has played 330 of the 900 minutes in the Premier League this campaign.\nCasemiro, one of United’s best players last season, hasn’t looked the same and Ten Hag’s midfield has been imbalanced because of it. Fans hope Casemiro’s drop-off is down to a slight injury or a wobble in form, and that the Brazilian will be back. Ten Hag’s comments that he wanted “more football” to justify taking him off at half-time against Brentford didn’t help the Brazilian, even if the manager was correct as Casemiro was playing poorly. Both he and Varane are senior players and must prove they can help United get out of this mess.\nOutside factors, such as uncertainty over who owns the club, don’t help and the players have concerns over this issue. But it’s not unreasonable to expect more from the existing personnel.\nAs it stands, there’s a lack of consistency on the pitch and in selection, courtesy of injuries and poor performances. United don’t have a spine like last season, nor a recognised XI or style this term. United are flaky, haven’t beaten a team in the league by more than a single goal and are unrecognisable from the team described by Xavi in February as “a top team in Europe… a team coming back (to their best)”.\nAdvertisement\nForget the competition: Newcastle at Old Trafford tonight is a big game where there will be a big away following. It’s a repeat of last year’s League Cup final.\nBoth sides will make changes, but Newcastle made 10 in the last round and still beat City. They’re confident, but United simply cannot lose to Newcastle’s B team.\nThen it’s Fulham and Luton in the league. If United have managed anything this season, it’s to scrape wins against the teams below them. In between those fixtures, there’s Copenhagen away, a must-win if United are to make it out of their Champions League group — and make up for the home defeat to Galatasaray. Copenhagen’s home form is exceptional in the Champions League, with only one defeat in their last eight. The Parken Stadium will have a louder atmosphere than any United have played in this term.\nAfter Luton at home, there’s a two-week international break. United’s arrangement of fixtures has been weird. From Crystal Palace in the Carabao Cup on September 26 to Newcastle in the same competition this evening, United have played seven home games in 36 days. After the break, they’re away in their next three matches.\nThe second of those fixtures is the small matter of Galatasaray away. It will be a failure if United don’t get out of this Champions League group, but this team look more like Europa League level and, having only won two Champions League knockout ties in a decade since 2011, maybe that’s the best place for them.\nNovember has been vital for United in the past. In 1992-93, the team was struggling to win and score. Then a guy called Eric Cantona signed and United won the title for the first time in 26 years.\nGO DEEPER\nCantona the singer: Commanding, idiosyncratic and unmistakably Eric\nTwo years later, November’s away hammerings by Barcelona (0-4) and IFK Gothenburg (1-3) were a European reality check, but that was nothing compared to 2005-06, when Sir Alex Ferguson endured his biggest wobble this century courtesy of a defeat to Lille, against a backdrop of anti-Glazer protests and Roy Keane leaving the club.\nAdvertisement\nFerguson steadied things that year with eight wins in 10 league games — something Jose Mourinho was unable to do in 2018, when a run of one win in six league games was the catalyst for his sacking. Solskjaer suffered a similar fate in 2021.\nGO DEEPER\nOle Gunnar Solskjaer's interview - the best bits analysed\nThere’s little appetite for United making yet another managerial change right now, with all the upheaval that would entail. Ten Hag’s stock remains high, but it has taken a hit among fans who are alarmed at how poor this season has been.\nThe Dutchman is trying to reset the whole atmosphere and culture at the club — as all the coaches before him attempted. Will he prevail or is this to be expected rinse-and-repeat cycle of life at United under every post-Ferguson manager?\nThe short answer is nobody knows. But what’s beyond dispute is Manchester United must improve, and quickly.\nGO DEEPER\nDevil logo stitching, Onana shirt - Man Utd kit issues explained\n(Top photo: Michael Regan/Getty Images",
  "word_count": 1413,
  "scraped_at": "2026-02-14T01:51:09.205556",
  "_text_extracted": true
}