{
  "article_id": "fb511ca72a76",
  "url": "https://theathletic.com/4529884/2023/05/19/sterling-chelsea-goals-city/",
  "title": "Chelsea are still to see the best of Raheem Sterling – he is determined to put that right",
  "date": "20230519T151500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The timing of Raheem Sterling’s first return to Manchester City for a Premier League game could not be any worse.\nThe 28-year-old England international forward, who joined Chelsea from champions City for £47.5million ($59m) last summer, will arrive at the Etihad Stadium on Sunday in the final throes of the most disappointing season of his professional career.\nAdvertisement\nIn contrast, the club he left behind have just booked their place in the Champions League final with an impressive 4-0 victory over the holders, Real Madrid, and will lift the Premier League trophy after Sunday’s game should they beat Chelsea. They will be confirmed as champions even sooner if closest challengers Arsenal lose at Nottingham Forest tomorrow (Saturday).\nTalk about awkward.\nTo make matters more delicate still, should Pep Guardiola’s side go on to win the FA Cup and Champions League by beating Manchester United and Inter Milan respectively on the first two Saturdays of next month, they will claim a historic treble — a feat they did not manage during Sterling’s seven years at the Etihad (even if he was part of the side that won a domestic treble of Premier League, FA Cup and League Cup in 2018-19).\nJust to highlight the scale of City’s potential achievement, Sir Alex Ferguson’s Manchester United are the only English team to have lifted the Premier League, FA Cup and European Cup in the same season (1998-99).\nMeanwhile, Chelsea are set to finish in their lowest position in the Premier League this century.\nThey languish 11th with three games left, eight points behind Fulham immediately above them, knowing they will not be playing in any UEFA competition next season — just the second time that has happened since 1996-97. Chelsea were knocked out of both domestic cup competitions by City this term and beaten comfortably 4-0 on aggregate by Real Madrid in the quarter-finals of the Champions League — the same side City dismantled with ease, 5-1 on aggregate, in the next round of the tournament.\nAll this points to a simple conclusion: Sterling has made a big mistake.\nThose Chelsea fans who booed him when he came on as a substitute against Bournemouth earlier this month clearly feel their club made one too in buying the 82-cap England stalwart in the first place. But Sterling’s situation is not as clear-cut as that, and it would be unfair to make a sweeping judgment on his transfer just one season into a five-year contract at Stamford Bridge.\nAdvertisement\nFew in the Chelsea dressing room can be proud of their performances in 2022-23. However, as the club’s highest-paid player and the marquee signing of the new owners’ first transfer window, everyone will have expected a lot more from Sterling.\nThat includes the man himself.\nTo help put Sterling’s form at Chelsea into proper perspective, a glance at what he has produced in the past provides a useful gauge.\nHe currently boasts nine goals in all competitions this season. Should he not add to that tally in Chelsea’s final three Premier League games, it will be his lowest return since 2012-13, when he scored twice as a teenager breaking into the Liverpool senior team.\nYet such numbers only tell part of the story.\nFor example, look at the number of minutes Sterling has enjoyed on the pitch this season compared to in the previous seven at City. The figures are well down, which partly explains his relative lack of success at finding the net — if you are on the pitch a lot less, it naturally reduces your time to make a difference in attack.\nHe has started only nine games in all competitions since suffering a hamstring injury, against City, in January.\nThe 2-2 home draw with Nottingham Forest on Saturday, where he scored twice to move to 22nd on the all-time Premier League goal-scoring charts with 115 — above former Arsenal and Crystal Palace forward Ian Wright and only five behind his old Liverpool captain Steven Gerrard — was the first time he had completed 90 minutes in any match this calendar year. Recovering fully from that hamstring problem and regaining match fitness and full confidence in his body have taken a lot longer than expected.\nBut playing whole games has been an issue regardless of his physical condition.\nChelsea’s high turnover of head coaches this season has been well-documented. Sterling has made appearances under four different leaders — Thomas Tuchel, Graham Potter, Bruno Saltor and Frank Lampard. It goes without saying all that turmoil has contributed to his underwhelming form, as well as that of the team.\nAdvertisement\nPotter was in charge the longest of the quartet at seven months, and yet Sterling completed 90 minutes just twice under the Englishman. Even when the attacker was free from injury and in the starting line-up, Potter substituted him on a regular basis. That does not help build rhythm or understanding with new team-mates. Conversely, Potter might well argue Sterling’s displays did not warrant the player remaining on the pitch longer than he did.\nAnother contributory factor is the reality Sterling has not had a consistent role in the team. He has been deployed in several positions, perhaps most bizarrely as a left wing-back when Potter first took over in September.\nSterling admits he prefers to play as a winger, particularly on the right. This chart demonstrates where his Premier League minutes have come this season and shows the extent to which they have been spread all over the pitch — he has operated as a winger only 41 per cent of the time, with nearly a third of his minutes played as a striker.\nNow for a closer look at his attacking output.\nAs already highlighted, his goalscoring figures are down. It is surely no coincidence the number of touches Sterling has had in the opposition penalty area is also lower than in previous years. But the illustration below suggests he is trying to dribble past opponents at a similar rate and his creativity — expected assists (xA), which gives the xG value of the shot being assisted — is not down either.\nFinally, The Athletic has examined whether there is anything notably different about the standard of his finishing at Chelsea (expected goals — xG) compared to what he was doing at City. Once again, there is no major discrepancy here either.\nUnsurprisingly, it is the overall quality of his chances per 90 minutes which has fallen — again, that explains his disappointing statistics and points directly to the calibre of the attack in which he is playing now compared to the one from which he benefited under Guardiola.\nSterling should not suddenly be regarded as a bad player. His record deserves more respect than that. It is only three years since he rattled up a personal best of 31 goals in all competitions. Last season, when he was frustrated at starting only 23 Premier League games for City — a lack of involvement which provoked him to seek a move — he still registered a respectable 17 goals and nine assists in 47 appearances across all competitions.\nAdvertisement\nClearly everyone, from Sterling to the coaching staff and owners, will hope this year’s toils are a one-off. But if there have been mitigating circumstances this season, there will be no excuses next time. He has to come good. Chelsea need him to.\nNobody will be more determined than Sterling to put this right. He will be desperate to demonstrate to Chelsea fans why he was bought in the first place.\nThere is no desire to seek a move elsewhere, although cynics will suggest that is an easy decision to make given his salary is over £300,000 a week, a figure unlikely to be matched by any other club.\nSterling insisted in an interview recently that he “has no regrets”about joining Chelsea. This was not just a soundbite. He genuinely means it.\nAs one of the most experienced players in the dressing room, there is still excitement about the challenge of helping Chelsea return as a major force under prospective new head coach, Mauricio Pochettino. One suspects Pochettino will squeeze a lot more out of Sterling’s talents and those of his team-mates.\nHe is looking forward to working under Pochettino. Not only does he know the Argentinian’s abilities as a coach having played against his Southampton and Tottenham teams, but Sterling speaks to team-mates at England camps who have played under Pochettino and has lapped up their glowing reports.\nSources speaking anonymously to The Athletic to protect relationships insist Sterling has not complained or moaned about the supporters booing him recently. He understands both he and Chelsea have underperformed this season, and that a fanbase accustomed to winning on an annual basis is going to voice disapproval about what has happened during it. He acknowledges those supporters have a right to do so.\nOne of the accusations aimed from the crowd at Sterling is that he does not care and is happy picking up his huge salary regardless. And yet, despite being given time off during the most recent international break in March, when he was left out of the England squad due to ongoing issues with his hamstring, he was seen at the Cobham training ground on a daily basis, working on his condition, trying to get in tip-top shape.\nAdvertisement\nSome will argue that is the least he should do, but it is hardly the behaviour of someone who is apathetic about the situation.\nSterling will surely use the events of this season as another source of motivation for 2023-24. He likes to prove people wrong. His place in the England team had come under scrutiny in the build-up to Euro 2020 (played in 2021 due to the COVID-19 pandemic), but he ended up one of their best and most important players on their run to the final, scoring three times.\nSpeaking last week, Chelsea caretaker manager Lampard believes Sterling has earned the right to be shown more patience.\n“Raheem has had an incredible career,” Lampard said of his former England team-mate. “I’ve spent the last three years speaking to all the younger wingers that I have worked with and shown them Raheem Sterling arriving at the back post or, defensively, the work he does. You cannot take away from him any of what he has done for Manchester City and England.\n“When you move club, and even when everyone outside says that moving from City to Chelsea cannot be hard work or a terrible situation, it does bring about changes in your life. The performance of the team this season has not been great, so there can always be a lot of contributing factors to individual form. One thing I feel about Raheem when speaking to him is he is very honest in terms of himself.\n“He has got credit in the bank, so he only needs to keep working and things around will maybe fall more into place. He will show what he has shown in his career.”\nIt should not be underestimated how things on and off the pitch have not gone smoothly. Tuchel was the head coach who lobbied hard to get him to Chelsea in the first place. And yet Tuchel was sacked just a month into his debut year (Sterling played for him just seven times, scoring three goals and providing one assist).\nNeither did the timing of the World Cup mid-season in November and December help.\nAdvertisement\nMore significant was the emotional turmoil of his house being robbed while he was away on England duty in Qatar. He and his family had only moved in a week before departing for the tournament. With so much to organise, Sterling only set up basic security not at the same high level as at his previous home in Manchester. The player’s girlfriend and children were not at home when the break-in took place but, from Qatar, he was still left unnerved by the incident. Security has been ramped up immeasurably since then.\nSterling was given permission to fly back to London to sort things out and check in on his family. He then returned to the World Cup for the quarter-final against France, which England lost 2-1. After that flurry of long-haul flights, he was quickly back in training with Chelsea ahead of their season restarting just after Christmas.\nPerhaps it should not come as a surprise that his hamstring gave way just three games into the post-World Cup schedule. Those close to him suspect what transpired a few weeks earlier was a contributory factor.\nBy the time he returned, he found himself part of a bloated squad of over 30 first-team players — six of the signings brought in during January were still settling in — and in an environment far from conducive to producing your best football. As results continued to decline, no one at Chelsea played with any confidence, let alone Sterling.\n“Sometimes you have lows,” Sterling told The Sun recently. “I haven’t been in this situation in my career so far. Performances haven’t been at the level they should, mine included. I haven’t been anywhere near my usual level.\n“Initially, coming here was a dream come true. That hasn’t transpired but, again, it’s still an energy. Something inside me is still raring to go, knowing that there will be a turn for the better. The more things are put into place the better it will get, so I haven’t given up on the vision that the owners gave me at the start. I know it will turn. It will taste even sweeter to win silverware coming from a moment like this than if you were winning every single week.”\nNo one expects Chelsea to spoil City’s title party this weekend. Judging by the humiliation inflicted upon Real Madrid when they came to the Etihad in midweek, it could end up another chastening afternoon for Sterling and his team.\nBut do not be surprised if he is part of a much more competitive Chelsea side when these two clubs meet next season.\n(Top photo: Alex Pantling/Getty Images)",
  "word_count": 2352,
  "scraped_at": "2026-02-14T02:00:19.995620",
  "_text_extracted": true
}