{
  "article_id": "fb721cd024c9",
  "url": "https://www.teamtalk.com/liverpool/jorg-schmadtke-best-worst-transfer-deals-ahead-of-liverpool-move-modeste-weghorst-osimhen",
  "title": "Jorg Schmadtke best and worst transfer deals ahead of Liverpool move : Modeste , Weghorst , Osimhen ... ",
  "date": "20230526T210000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nJorg Schmadtke’s best and worst transfer deals ahead of Liverpool move: Modeste, Weghorst, Osimhen…\nJorg Schmadtke is set to become Liverpool’s new sporting director ahead of a crucial transfer window for the Reds.\nSchmadtke will take over from Julian Ward, who was only promoted into the role last summer when he replaced Michael Edwards.\nHe will reportedly sign a three-month contract at Anfield and wants to target the Bundesliga for new recruits this summer.\nThe 59-year-old has previously held similar positions in his native Germany, working at Aachen, Hannover, Cologne and most recently Wolfsburg.\nWe’ve taken a look at some of the best – and worst – pieces of transfer business he has overseen at those clubs.\nBest deals\nRon-Robert Zieler\nZieler came through the ranks at Manchester United but was released in 2010, having never made a first-team appearance for the club.\nHe joined Hannover on a free transfer and made 221 appearances over the following six seasons, helping them to four top-10 finishes and a run to the Europa League quarter-finals in 2012.\nThe goalkeeper, who was part of Germany’s World Cup winning squad in 2014, joined Leicester City in a €3.5million deal in 2016 and had a brief spell at Stuttgart before returning to Hannover in 2019.\nLars Stindl\nSchmadtke really exploited the free-agent market in 2010 and signed Stindl on a bosman following his departure from Karlsruher SC.\nThe all-action midfielder quickly became indispensable to Hannover, registering 26 goals and 28 assists in 161 appearances for the club.\nHis performances reportedly attracted interest from Liverpool but a deal never materialised and he ultimately joined Borussia Monchengladbach in 2015.\nMame Biram Diouf\nAfter their success with Zieler, Hannover returned to Manchester United and signed Diouf in a £1.5m deal in January 2012.\nThe striker hit the ground running in Germany and netted 10 goals in the second half of 2011/12, including two goals in the club’s Europa League quarter-final loss to Atletico Madrid.\nHe finished at Hannover with 51 direct goal contributions in 71 appearances in all competitions and then left for Stoke City in the summer of 2014.\n#OnThisDay in 2013 Mame Diouf scores this goal for Hannover ☄️\n— Mozo Football (@MozoFootball) January 18, 2019\nAnthony Modeste\nFans in England will best remember Modeste for a terrible loan spell at Blackburn Rovers, where he failed to score a single goal in nine appearances as the club were relegated from the Premier League.\nBut Schmadtke, who moved to Cologne in 2013, spotted his raw talent and bought the striker from Hoffenheim in a £4.1m deal in the summer of 2015.\nHe rebuilt his reputation by scoring 45 goals over the following two seasons, including 25 league strikes during the 2016/17 campaign as Cologne clinched their best Bundesliga finish since 1991/92.\nSchmadtke then decided to cash in on Modeste, selling him to Chinese side Tianjin Quanjian for €35.7m, which is still a club-record sale for Cologne.\nWout Weghorst\nWhile Weghorst has struggled to make an impact in the Premier League, he was a revelation for Wolfsburg after Schmadtke brought him in from AZ Alkmaar.\nThe Netherlands international, who is currently on loan at Manchester United, was signed for just €10.5m in 2018 and that turned out to be a bargain.\nHe netted 59 Bundesliga goals during his three-and-a-half years in Germany and only Robert Lewandowski scored more in that period.\nHis impressive performances in 2020/21 helped Wolfsburg secure Champions League qualification for just the third time in their history, and he was then sold to Burnley for £12m in January 2022.\nChip it like Wout Weghorst 😍\n🎥 @Bundesliga_EN pic.twitter.com/738heKs5zS\n— 433 (@433) January 22, 2021\nMaxence Lacroix\nLacroix was a relatively unknown quantity operating in the French second division before Schmadtke brought him to Wolfsburg in a €5m deal in 2020.\nHe’s since established himself as one of the most promising centre-backs in the Bundesliga and his ability on the ball has led to comparisons with former Manchester United defender Rio Ferdinand.\nThe 23-year-old was the subject of a €20m offer from RB Leipzig in the summer of 2021 but Wolfsburg refused to sell him to their Bundesliga rivals.\nHis meteoric rise has also caught the attention of numerous Premier League clubs as he’s been linked with Liverpool, Arsenal, Chelsea, Tottenham, Leicester City and Southampton.\nOther honourable mentions: Simon Rolfes, Didier Ya Konan, Emanuel Pogatetz, Leonardo Bittencourt, Jerome Roussillon, Kevin Mbabu, Ridle Baku, Micky Van de Ven.\nWorst deals\nJhon Cordoba\nCordoba is Schmadtke’s most expensive signing of all time as he joined Wolfsburg from Mainz in a €15m deal in the summer of 2017.\nThe striker was signed to fill the void left by Modeste’s departure but he endured a disastrous debut season, failing to score in 18 Bundesliga appearances as Cologne were relegated to the second division.\nAdmittedly, he did score 20 league goals in 2018/19 as Cologne won the 2. Bundesliga title but that doesn’t justify his huge price tag.\nDaniel Ginczek\nGinczek joined Wolfsburg alongside Wout Weghorst in 2018 but the two strikers had contrasting fortunes at the Volkswagen Arena.\nThe 32-year-old, who cost €14m, struggled with injury problems and scored just 11 goals in 66 appearances in all competitions before joining second-division side Fortuna Dusseldorf on a free transfer in January 2022.\nLuca Waldschmidt\nWaldschmidt shot to prominence in 2019, scoring seven goals at the Under-21 European Championships and winning the Golden Boot.\nHe moved to Benfica in 2020 but Schmadtke continued to follow his progress and brought the striker to Wolfsburg in a €12m deal in 2021.\nThe Germany international has failed to live up to expectations, scoring just six goals in all competitions during his first two seasons at the club.\nVictor Osimhen\nDuring his time at Wolfsburg, Schmadtke made a huge mistake by sanctioning Osimhen’s €3.5m move to Belgian side Charleroi in 2019.\nThe Nigeria international has since developed into one of the best strikers in the world and recently spearheaded Napoli to their first Serie A title since 1990.\n“It wasn’t a good move, in hindsight,” Schmadtke would later tell Kicker magazine. “When I came, he was limping and running in circles. I was told that the strikers we had weren’t good enough. The most important lesson is that you have to be patient with some transfers.”",
  "word_count": 1055,
  "scraped_at": "2026-02-14T02:00:19.991849",
  "_text_extracted": true
}