{
  "article_id": "fb8543873abf",
  "url": "https://www.the42.ie/writers-review-premier-league-season-2-6080146-May2023/",
  "title": "Best moment ? Worst signing ? Our writers review the Premier League season",
  "date": "20230529T021500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Sneyd\nWhat will be your defining memory from this season?\nOn the pitch, the first thing that came to mind was Martin Odegaard’s brilliant first-time pass to set up Gabriel Martinelli away to Brighton.\nOff it, the manner in which the Glazers have conducted the sale of Manchester United is simply another stain on a family who make the fictional Roys (of Succession) seem decent.\nWho was your Player of the Season?\nErling Haaland.\nName the best and worst signing of the season.\nHaaland was, without doubt, the best, so good even Pep Guardiola changed for him.\nOne of the Todd Bohely pick n’ mix. Couldn’t actually tell you any of their names, except they all no doubt have amazing YouTube highlight reels set to techno music by accounts called CFCVirtualLoyal.\nBest individual performance you witnessed this season?\nKevin De Bruyne at home to Arsenal. If it wasn’t for Haaland he would be player of the year.\nWhich Irish player has impressed you most?\nEvan Ferguson — his goal away to Bournemouth just sublime, the kind of goal not seen by an Irish player since Robbie Keane. All going well, it may just make his highlight reel in another 15 years.\nWhich team did you most enjoy watching (aside from the club you support)?\nLiverpool. Did this season mean more too?\nName your favourite moment from this season.\nSky Sports beaming in images of Sam Allardyce (in full training kit) getting to work on the Leeds training ground.\nDescribe the season in one sentence\nManchester City, who were charged by the Premier League with 115 counts of financial rule breaches in February, claimed their fifth title in six years.\nGavin Cooney\nWhat will be your defining memory from this season?\nThe Premier League statement announcing 115 charges against Manchester City, that opened the prospect of relitigating past seasons while shrouding this season with uncertainty. City fans’ subsequent banner in support of the lawyer fighting their club’s case was a neat vision of the warped world the Premier League now inhabits.\nWho was your Player of the Season?\nErling Haaland. With an honourable mention for Martin Odegaard.\nName the best and worst signing of the season.\nIt has to be Erling Haaland, as boring as that is. But Sven Botman, Oleksander Zinchenko, Casemiro, Joao Palhinha, and Morgan Gibbs-White were crucial for all of their respective new teams.\nIt is OTT to call him the worst signing, but Darwin Nunez has not yet worked out at Liverpool, and Cody Gakpo’s arrival means he ends the season as fifth choice of Liverpool’s five forwards. He will improve over time, but Liverpool needed Nunez to work out straight away, and he didn’t.\nBest individual performance you witnessed this season?\nKevin De Bruyne against Arsenal in the decisive 4-1 win at the Etihad in April.\nWhich Irish player has impressed you most?\nNo prizes for guessing: Evan Ferguson. Six goals and two assists in 18 Premier League games is an excellent return, but his all-round game was hugely impressive. He has landed at the right club, and we can all be grateful he’s learning from Roberto de Zerbi.\nWhich team did you most enjoy watching (aside from the club you support)?\nBrighton.\nName your favourite moment from this season.\nI am going to shock you in saying it came in this season, but the truly hilarious handshake between Thomas Tuchel and Antonio Conte in Stamford Bridge endures.\nDescribe the season in one sentence.\nA season interrupted by one competition between countries that ended with proof that this is increasingly becoming another competition between countries. Two of the top four are in the hands of nation states, and will a third yet follow?\nPaul Fennessy\nWhat will be your defining memory from this season?\nThe sheer weirdness of it all, but then a year interrupted by a mid-season World Cup was always going to have a slightly freakish element. Perhaps the strangest moments revolved around managers. Antonio Conte throwing his entire Spurs team under the boss before Tottenham subsequently proceeded to sack his assistant, who they had weeks earlier appointed as caretaker. Chelsea dismissing Thomas Tuchel and later hiring Frank Lampard, for a second time, allegedly on James Corden’s advice. Leeds and Crystal Palace making desperate end-of-season decisions to bring veteran former England managers out of retirement, with one of these calls paying off handsomely and the other not so much. It would probably be quicker to mention to the select few managers who had the good fortune to keep their jobs. It’s been a deeply strange ride.\nName the best and worst signing of the season.\nBest signing: Sven Botman (I’m reserving my Haaland praise for later) — few players deserve more credit for Newcastle securing Champions League football.\nWorst signing: Richarlison — one of several Spurs summer recruits to disappoint, he may yet come good and has been a little unlucky with injuries, but for £60 million, you would be expecting more than one Premier League goal from the Brazil international.\nWho was your Player of the Season?\nErling Haaland. He feels like the final part of the jigsaw puzzle in Pep Guardiola’s state-backed masterpiece. City will likely win the treble and finally end their Champions League trophy drought. With 58 goals in 57 games in all competitions this season, Haaland’s sheer ruthlessness has provided the Etihad outfit with the cutting edge they lacked at crucial moments in previous seasons.\nBest individual performance you witnessed this season?\nA toss-up between Phil Foden and Erling Haaland in City’s 6-3 win over Man United, the game in which both these incredible prodigies registered hat-tricks. Keep in mind, City hadn’t really caught fire yet at this point, while the Red Devils were full of confidence having beaten Liverpool and Arsenal amid a four-game winning streak. And yet, Guardiola’s side absolutely destroyed them with the aforementioned duo instrumental. The scoreline actually flattered Erik ten Hag’s men, with two late Anthony Martial goals making it look a closer contest than it actually was. The fact that City’s best period of the season came subsequently with Foden largely held in reserve says it all about their astonishing depth of talent.\nWhich Irish player has impressed you most?\nIs there any answer other than Evan Ferguson? It’s otherwise been a very lean and record-breaking (in a bad way) season for Irish stars in England, with 13 players featuring but only four really having genuinely significant contributions. The 18-year-old Meath native is clearly an incredible talent and has the potential to become the best Irish striker since Robbie Keane. It wasn’t his debut season, having appeared once in the top-flight last year, nonetheless, 10 goals in all competitions represents a fine return, particularly when you consider he had to wait until December to make his first Premier League appearance. Honourable mention too for Seamus Coleman, who at 34 continues to defy age and the doubters, with the Toffees skipper’s consistently solid and committed performances a rare positive amid a turbulent season for the club.\nWhich team did you most enjoy watching (aside from the club you support)?\nI suspect I won’t be the only one to single out Brighton. Roberto De Zerbi is an obvious candidate for manager of the season, given what he achieved in a short space of time, guiding the Seagulls to sixth place and the Europa League. Yet the style with which they played, thanks in part to the Italian manager’s innovative tactics, made it a particularly appealing success story, with their remarkable dismantling of title-chasing Arsenal at the Emirates earlier this month a clear highlight.\nName your favourite moment from this season.\nWatching Evan Ferguson coming off the bench to score against Arsenal. Irish football hasn’t exactly been filled with positive stories in recent years, but watching the former Bohs youngster’s swift rise has been a joy to behold after a number of really fallow years for Irish attackers plying their trade in England’s top flight.\nDescribe the season in one sentence.\nMan City’s nation-state-backed triumph poses more questions than answers, given the financial charges against them.",
  "word_count": 1351,
  "scraped_at": "2026-02-14T01:53:41.893521",
  "_text_extracted": true
}