{
  "article_id": "fb9228e3d5e8",
  "url": "https://mufclatest.com/united-show-advanced-interest-to-sign-34-million-joshua-zirkzee-from-bologna-but-have-competition/",
  "title": "United show  advanced interest  to sign £34 million Joshua Zirkzee from Bologna but have competition – MUFCLatest . com",
  "date": "20240619T151500Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are gathering pace to sign Bologna striker Joshua Zirkzee this summer, according to reports. The 23-year-old is available for £34 million, which would be something United would be silly to not get involved in. The player wants to leave Bologna this summer.\nThe 23-year-old scored 12 goals and seven assists for the Italian side during the 2023/24 season – from 37 appearances – which shows that he could be a worthwhile signing for United. The main question would be whether he would want to play second fiddle to Rasmus Hojlund?\nThe 23-year-old is a good up and coming striker and offers a bit more experience to that of Hojlund, who was United’s top scorer last season. It would step up the competition in the forward roles with both strikers seeking to be the one that starts matches – however, the formation could change too.\nIt is stated in the report that United at at an advanced stage regarding their interest in the striker, which bodes well considering the club are moving to make signings earlier in the summer so they can participate in the pre-season campaign with five matches already arranged.\nArsenal are said to be interested in the Dutchman with AC Milan also interested but United have a great opportunity to sign the player this summer. Obviously Arsenal have UEFA Champions League football to persuade the 23-year-old to sign – United will play in the UEFA Europa League.\nThat said, United have not bottled everything like Arsenal have in the past few seasons, so there is also that to look upon for him to make a decision, if it indeed comes to that. His contract at Bologna runs until the summer of 2026 and they would like to keep the player this summer.\nDavid Ornstein of The Athletic believes that United are in dialogue with Zirkzee’s entourage and are considering an approach for the 23-year-old. The player earned a late call-up to the Netherlands squad for Euro 2024, which shows he has the ability to do well and has the required attributes.\nUnited may have some competition for the Dutchman and will need to get something sorted. But a move will not take place until the international transfer window opens on the 1 July with the final of Euro 2024 taking place on the 14 July. This one could be interesting to watch unfold.\nWritten by Paul\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 417,
  "scraped_at": "2026-02-14T01:57:18.891677",
  "_text_extracted": true
}