{
  "article_id": "fb92ffbc60b8",
  "url": "https://www.caughtoffside.com/2024/06/26/david-transfer-chelsea-consider-lille-ace/",
  "title": "David transfer : Chelsea consider Lille ace alongside Guiu",
  "date": "20240626T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are reportedly also weighing up a transfer move for Lille striker Jonathan David this summer despite advancing in talks to land Marc Guiu from Barcelona.\nGuiu is a talented young player who looks ever closer to joining the Blues on the cheap, but it seems the club also have the more proven and experienced David in their sights, according to the Evening Standard.\nChelsea fans will no doubt hope to see more experienced players coming in as the club have perhaps gone a little overboard with their youth policy in recent times, which may well end up being smart in the long term, but which is costing the team a place in the Champions League and a realistic shot at winning major trophies in the more immediate future.\nIt’s been a difficult few years at Stamford Bridge, and while Guiu may surprise a few people, he doesn’t currently look like someone who’s likely to come in straight away and make a place in Enzo Maresca’s starting line up his own.\nSomeone like David could therefore be ideal, though the Evening Standard claim he’s also attracting interest from other Premier League clubs.\nJonathan David transfer: What are other sources saying?\nSimon Phillips has recently reported on Chelsea holding talks with David’s agent, but with things seemingly not that advanced yet.\nSources have informed CaughtOffside that Manchester United are also considering the Canada international as among their numerous targets this summer, though there’s also a focus on midfield as a priority for the time being.\nSimilarly, iNews also link David with Man Utd, as well as other Premier League sides like Tottenham and West Ham, so it seems clear the 24-year-old won’t be short of offers if he does leave Lille in this summer’s transfer window.\nDavid has been prolific during his time in French football, but he’s not always been thought of as the most consistent and reliable performer, so it would be interesting to see how easy he finds it to adapt to life in the Premier League.",
  "word_count": 339,
  "scraped_at": "2026-02-14T01:51:32.422258",
  "_text_extracted": true
}