{
  "article_id": "fbc5e158e0e1",
  "url": "https://www.liverpoolfc.com/news/jurgen-klopp-press-conference-newcastle-defensive-record-entering-2024-and-more",
  "title": "Jürgen Klopp press conference : Newcastle , defensive record , entering 2024 and more",
  "date": "20231229T123000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Q&AJürgen Klopp press conference: Newcastle, defensive record, entering 2024 and more\nJürgen Klopp has been pleased with Liverpool's development in the first half of 2023-24 but is fully aware how there remains 'work to do'.\nThe Reds sit two points clear at the top of the table at the halfway point of the Premier League campaign and also carry the best defensive record, having conceded just 16 goals from their 19 league fixtures.\nAhead of the Anfield meeting with Newcastle United on New Year's Day, Klopp discussed his side's progress and more at his pre-match press conference.\nRead on for a summary of what he had to say on Friday morning…\nOn having the best defensive record in the Premier League and what has made the difference this season...\nGeneral defending obviously, that's how it is. Yeah, that's it pretty much. So everybody buys into how we have to work. It's not that the team last year didn't do that, it's just after all the years... it's always a problem if you lose too many balls in moments where you don't expect it. How many goals did we concede – 16? Probably eight or nine of them were after we lose the ball and are a bit exposed, so that's how it is, and that was obviously last year even more a problem. Because it's really difficult to prepare for these situations. You try to dominate a game and in the moment you lose it, you are in different positions and so that's why sometimes you can get caught.\nWe do better now. Recently we stepped up counter-pressing-wise, which helps as well. That means everybody reacts better – front line, midfield line and in the last line obviously as well. If you feel that the midfield and front three or how many are really involved in counter-pressing, you can have a higher line because then you are in challenges and they cannot skip balls just behind you and all these kind of things. So there are plenty of things. We worked obviously a lot on it but we did that last year as well. It's just the effort that everybody puts in.\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeOn what he's expecting from Newcastle...\nFirst and foremost, it's a privilege of you and probably all supporters in the world to just have expectations before other teams are playing. I don't have that. I just watch the game if I have time and I don't think they will win, they will lose, stuff like this. It's football. I am too long in the business to not know that everything can happen and you can lose a game with 30 shots or with 34 or whatever – you can draw these kind of games as well. So that's all possible. These games, last night or whenever they happened, they have nothing to do with our game against Newcastle.\nLook, Newcastle did incredibly well and, OK, it's unlucky you have that amount of injuries but then on top of that, you play international football, which they didn't play now 50 times in a row. So the whole system has to get used to that – I mean the system of the players. It's completely different – if you have a normal training week or if you have pretty much only recovery and then have to go again for a big, big, big game. Premier League games are all big, Champions League games are all big. So that's us a little bit. It was, for sure, a little bit of a problem but they still do really well and in all the games they lost they had really good spells.\nThe games I saw – and the analysis only starts now really – they had really good spells, they have a really good idea. But at one point Eddie [Howe] had to play too often the same line-up, definitely, that's clear with all these games. And the boys did incredibly well – I think he's said that as well. You have to really give credit to the players for the effort they have put in. But it was pretty much the same line-up for a long, long time and then the guys who play all the time get tired and the guys who come back have no rhythm. We had that situation plenty of times.\nBut now they have five, six days – like we have – between the games and that will help both teams, definitely. We played five games in 13 days – it's absolutely insane as well. We somehow came through that but now it's about using that extra recovery time because we are still in all cup competitions. That means we have a busy January as well, other teams probably have a lesser-busy January, which is then helpful, and we all have to get through that as well. From February on, we all have the same schedule again and then we will see.\nOn how much happier he is this year…\n[I am] six times happier! I can't even remember [the first game of 2023], who did we play? Brentford, oh we lost that, so we were sixth for a few minutes and then probably seventh or eighth after that game! Yeah, horrible time last year. It feels better, no doubt about that. How I said, I like a lot of things that we did, but it is not like we really think too much about it. When I say I am not happy, I am OK. I'm not sure that sounds positive enough, but it's really positive. It's just so early, that's all.\nWe had a lot of good spells in games where we didn't win or we had lesser-good spells in games we won and these kind of things, so it's a process. This team is in the middle of something and we just try to make the best of it, to deal with different situations. We spoke a lot about injuries other teams have, we had a lot of injuries. We had some players who were not once involved in the whole of the season, key players for us. We are now without key players. Both left-backs are not in, which is really not good, so all these kind of things.\nBut so far we found a way to get into the next game and found a way to compete in that game. It started with the defensive record – it's important but it's not what we have in our mind – but agreeing again [that] it all starts with defending. We are not desperate – we were a bit against United, to be 100 per cent honest, it developed in that game where we got chances and then we got desperate, that makes no sense but it can happen. In general, we are not desperate because we don't think we [will] concede all the time and then we have to score immediately. Even though we conceded quite a lot of times the first goal, but even in these moments we didn't get desperate. That's really important.\nThat's what we said in the beginning, we have to develop as a team but some of the things that happened to us were not cool in the moment, but they helped us to grow together and that's what happened. So far, it's OK, I cannot say more. Obviously it's better to be first than sixth, but both gives you a lot of work to do for the rest of the season.\nOn Liverpool's plan for being without Mohamed Salah in January…\nEach long-term plan I could have had depends massively on who is available, so why should I think in October who I can use when Mo is away when I have no clue who is then available? We would have solutions today and I hope we have that after the Newcastle game as well. It's not the first time, it's a really at least very average situation that you lose your goalscorer but we had it even worse in the past when Sadio and Mo left, and we came somehow through it. And traditionally one of them always went pretty far in the tournament, which makes it then even worse. We have to get through this. So we knew that the African Cup of Nations from time to time appears and then Mo has to go – that was always clear. And now we have with Endo a participant of the Asian Cup as well, so it is like it is. We knew it and now we have to deal with it and we will.",
  "word_count": 1457,
  "scraped_at": "2026-02-14T02:20:16.275741",
  "_text_extracted": true
}