{
  "article_id": "fbc9ae4657c1",
  "url": "https://www.teamtalk.com/news/barcelona-striker-targets-2026-analysed-erling-haaland-julian-alvarez-dusan-vlahovic",
  "title": "Barcelona : World - class star , free option among six deadly striker targets",
  "date": "20251020T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "World-class target, free option: Analysing the six deadly strikers Barcelona want\nBarcelona have been linked with plenty of top strikers amid their search for Robert Lewandowski’s successor, and TEAMtalk has examined the six options being strongly considered in Catalonia.\nLewandowski continued to defy his age last season, hitting 42 goals in 52 matches last season as Barcelona pulled off a remarkable domestic treble and reached the semi-finals of the Champions League. Barca blew Real Madrid away, beating them four times across the campaign, with two of those wins coming in the finals of the Copa del Rey and Supercopa de Espana.\nSo far this term, Lewandowski has managed four goals in nine outings. However, the Polish ace has already picked up his second injury of the season, as a hamstring issue is expected to rule him out of El Clasico this weekend.\nLewandowski is now 37 years old, and there is concern at Barca that his age may finally be catching up with him.\nLewandowski’s contract expires in June. Sporting director Deco insists no firm decision has been made yet on whether to offer him an extension or bring in a new centre-forward.\nBut the fact Barca have been so heavily linked with a variety of strikers across Europe suggests this could be Lewandowski’s final year at the club.\nFerran Torres would love to become the main man, though Barca will likely see what their options are in the transfer market before deciding to rely solely on the Spaniard.\nBarca are not expected to spend big in January – you can read our explainer on the 1:1 rule and how it affects them here – but they could splash the cash next summer.\nHansi Flick’s side have been tentatively linked with a sensational move for Alexander Isak amid his struggles at Liverpool, but TEAMtalk has decided to look at six more realistic targets.\nNo 1 – Julian Alvarez\nVarious reports in Spain have named Atletico Madrid hitman Alvarez as Barca’s dream target to succeed from Lewandowski.\nAlvarez has taken his game to the next level since joining Atleti from Manchester City, and has netted seven times in 10 appearances already this season.\nThe Argentina star can do it all, from scoring incredible long-range goals to setting his team-mates up with brilliant assists.\nSport revealed on September 30 that Alvarez has even overtaken City’s Erling Haaland on the wish list of Barca president Joan Laporta, which shows just how well he is performing.\nBarca think Alvarez would be open to joining them from Atleti, despite the controversy surrounding that potential move, as he wants to emulate legendary compatriot Lionel Messi.\nTEAMtalk transfer insider Dean Jones stated on October 2 that while the 25-year-old is ‘settled’ at Atleti, his move away from City shows that he can have his ‘head turned’ when major clubs come calling.\nThe issue for Barca would be cost. Atleti spent €95million (then £82m) when signing Alvarez, and his value has skyrocketed since then.\nIt would not be a surprise if Atleti demanded an eye-watering €200m (£174m) to sell their talisman, particularly to a fierce rival such as Barca.\nAnd that leads us onto Barca’s other ‘dream’ option…\nNo 2 – Erling Haaland\nCity goal machine Haaland is the other truly world-class striker Laporta thinks can take Barca back to the summit of European football.\nReports in the Spanish press have suggested Haaland would pick Barca over Real Madrid if he opted to leave City, with Los Blancos having already made Kylian Mbappe their primary striker.\nCity boss Pep Guardiola has confirmed that his former club Barca are among a host of teams interested in Haaland. However, Guardiola did add that the Norway star ‘isn’t stupid enough’ to leave City when his contract runs until summer 2034.\nThat colossal contract puts City in an extremely strong negotiating position and means Haaland’s price tag could be even higher than Alvarez’s.\nPlus, sources indicate that Haaland is currently very happy at City and is not agitating for a move.\nHe would like to play in Spain one day, but that has been postponed until the latter stages of his career after City managed to tie him down for so long.\nHaaland is in unbelievable form right now, having scored 11 of City’s 17 goals in the league this term.\nNo 3 – Dusan Vlahovic\nMadrid are exceptional at playing the transfer market and landing top stars for free, such as Mbappe, Antonio Rudiger and Trent Alexander-Arnold, but Barca could attempt a similar signing.\nVlahovic is not on Mbappe’s level, but he has scored over 130 goals in his career and has won trophies in both Italy and Serbia.\nVlahovic’s Juventus contract expires at the end of the season and he is not expected to renew, which means Barca could land him for no transfer fee.\nSuch a move would see Deco future-proof the No 9 position while also saving money to be spent on other areas of the squad.\nVlahovic has not quite lived up to expectations since his £66.6m switch to Juve, but he is still viewed as a top European striker who could thrive in the right environment. And moving on a free transfer would lessen the weight on his shoulders.\nBarca’s interest in the Serbia ace was revealed by Italian newspaper Tuttosport last week.\nVlahovic has big salary demands, though Lewandowski’s departure would give Barca more than enough space on the wage bill to meet them.\nBarca would need to fend off Premier League clubs to snare Vlahovic. The 25-year-old is understood to be on the radars of both Chelsea and Tottenham Hotspur.\nREAD NEXT 👉 Xabi Alonso tells Real Madrid to target shock Barcelona ‘weak link’ in El Clasico – report\nNo 4 – Samu Aghehowa\nDeco has reportedly sent scouts to watch Samu in action for Porto as he weighs up a concrete move for the Spain international.\nSamu was previously on Atleti’s books but never made a competitive appearance for the club before joining Porto in a €15m deal in August last year.\nSamu has got off to an electric start in Portugal, having found the back of the net eight times in nine games.\nThe 21-year-old is a physically imposing and fast striker who excels at making intelligent runs in behind opposition defenders. He has previously been compared to the likes of Didier Drogba and Victor Osimhen.\nIt emerged on October 8 that Barca are planning to rival Spurs for Samu’s capture, information TEAMtalk has been able to confirm.\nWe revealed last month that Spurs have been scouting the player as part of their long-term plans to strengthen their attack.\nHe has a huge €100m (£87m) release clause in his contract, though speculation suggests Barca will try to get him for a lower fee of around €60m (£52m).\nSamu would love the chance to return to Spain and represent one of the very biggest clubs in the world after his previous spells at Granada, Atleti and Alaves.\nNo 5 – Serhou Guirassy\nNext up is Guinea star Guirassy, who only swapped Stuttgart for Borussia Dortmund in July 2024.\nGuirassy has a hugely impressive scoring record. 13 of his 38 goals last season came in the Champions League, while he has followed that up with six goals from nine matches in all competitions this term.\nAt 29 years of age, Guirassy is the oldest player Barca are considering as a replacement for Lewandowski, though his insane numbers suggest he could be a brilliant capture.\nMundo Deportivo credited Barca with interest in Guirassy in September. Sky Germany have reported that his €75m (£65m) exit clause is set to drop significantly next year, giving Barca an opportunity.\nThe former Lille and FC Koln player would jump at the chance to join Barca, viewing them as a perfect next step for his career.\nNo 6 – Karl Etta Eyong\nThe sixth and final option on this list, Etta Eyong, is a bit of a wildcard. He is only 22 years old and is enjoying a breakout season in LaLiga.\nOnly Mbappe and Alvarez have managed more than Etta Eyong’s five league goals for Levante so far this campaign.\nSport claim Etta Eyong would pick Barca over Manchester United if both clubs came calling.\nMadrid have also been named as potential suitors, but Barca are thought to be leading the chase for the Cameroonian.\nHis Levante deal includes a €30m (£26m) release clause. Barca, however, are hopeful they can get him for a reduced fee of around €15m (£13m).\nEtta Eyong has very high potential, but he is still a raw talent who has some developing to do.\nAs things stand, Vlahovic looks like the most realistic option for Barca, while Samu could also emerge as a strong contender to replace Lewandowski.\nBarca news: Defensive target; City raid?\nCentre-forward is not the only position Barca hope to improve next summer, with centre-back another target area.\nThe French press claim Barca are aiming to sign a Bayern Munich defender on a brilliant free transfer.\nSeparate reports suggest Guardiola wants to raid Barca for a talented full-back, however.",
  "word_count": 1518,
  "scraped_at": "2026-02-14T01:52:49.021692",
  "_text_extracted": true
}