{
  "article_id": "fc0e226da24f",
  "url": "https://www.themag.co.uk/2023/05/ruben-selles-admits-where-it-all-went-wrong-at-st-james-park-newcastle-3-southampton-1-newcastle-united/",
  "title": "Ruben Selles admits where it all went wrong at St Jame Park ... ",
  "date": "20230501T121500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Selles admits where it all went wrong at St James’ Park…\nRuben Selles watched on as his team competed well at St James’ Park, a pretty even first half seeing the Saints actually take a shock lead just before the break.\nCould this be a very surprising lifeline for Southampton, who went into Sunday’s match six points adrift of safety with only five left to play?\nThe answer ultimately was a big fat NO!\nNewcastle United rampant in that second half, absolutely battering Southampton into submission and the goals eventually, deservedly, arriving.\nRuben Selles admitting when reflecting on the match, exactly where it had gone wrong in his opinion from a Southampton perspective.\nSouthampton manager Ruben Selles reflects on Newcastle United coming back to win 3-1 at St James’ Park:\n“In the first half we were very competitive.\n“We knew what to do in every moment but in the second half we were too passive in terms of defensive work.\n“When you become too passive against a team like Newcastle, you are going to suffer.\n“We had a strategy for the second half to control the jumps and try to play a little bit quick, create situations two against two in their half, but we didn’t connect.\n“I think we can do it better.\n“I think they are a good team, but we showed against Arsenal, against Manchester City, that we can compete against anybody.\n“We need to be more robust.\n“We came here, we showed what we are, but we need to put the performance together for 90 to 95, 96 minutes, and that’s why we didn’t make it today.\n“We just need to continue, try to put those performances in for longer in the game, and if one incident or one goal is against us, to still stand there and try to get the very best out of the game.\n“I think in the second half we didn’t start exactly as we needed and then after the first incident we were a little bit low.\n“The goals didn’t come until late in the game but we didn’t show what we can do in the second half.”\nStats from BBC Sport:\nNewcastle 3 Southampton 1 – Sunday 30 April 2pm\nGoals:\nNewcastle United:\nWilson 54, 81, Walcott OG 79,\nSouthampton:\nArmstrong 41\n(In brackets the half-time stats)\nPossession was Southampton 35% (37%) Newcastle 65% (63%)\nTotal shots were Southampton 4 (4) Newcastle 22 (5)\nShots on target were Southampton 3 (3) Newcastle 5 (0)\nCorners were Southampton 2 (1) Newcastle 11 (3)\nReferee: Anthony Taylor\nNewcastle United:\nPope, Trippier, Schar, Botman, Burn, Bruno, Joelinton, Gordon (Wilson 45), Murphy (Almiron 69), Willock (Anderson 90+2), Isak (Ritchie 90+2)\nUnused Subs:\nDubravka, Dummett, Lewis, Targett, Manquillo\n(Match Report – Our man at St James’ Park – I don’t think I want this season to end… Read HERE)\n(Alan Shearer : What he said about Newcastle United 54 days ago and what he’s saying now – Astonishing turn around – Read HERE)\n(Newcastle 3 Southampton 1 – The instant NUFC fan / writer reaction – Read HERE)\n(Bruno Guimaraes gets emotional after final whistle – Newcastle United make it 8 wins from 9 – Go HERE)\n(Newcastle 3 Southampton 1 – Superb comeback win takes United to brink of Champions League football – Read HERE)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 567,
  "scraped_at": "2026-02-14T01:39:28.520844",
  "_text_extracted": true
}