{
  "article_id": "fc1909bd5331",
  "url": "https://www.dutchnews.nl/2025/03/az-win-1-0-ajax-lose-1-2-in-europa-league-round-of-16/",
  "title": "AZ win 1 - 0 , Ajax lose 1 - 2 in Europa League round of 16",
  "date": "20250307T083000Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AZ win 1-0, Ajax lose 1-2 in Europa League round of 16\nAjax have their work cut out to progress further in the Europa League after losing 1-2 at home to Germany’s Eintracht Frankfurt in the first leg of their round of 16 tie.\nBrian Brobbey opened the scoring after eight minutes, but keeper Remko Pasveer went off injured after 21 minutes and was replaced by third-choice Jay Gorter.\nHe was unable to stop Hugo Larsson’s deflected equaliser or Ellyes Skhiri’s winner in the 70th minute.\nThe Amsterdammers now have a difficult task ahead in the return leg in Frankfurt next week. Watch the highlights\nIt was a different story for AZ Alkmaar, who secured a narrow 1-0 home win over Tottenham Hotspur through an 18th-minute own goal by Lucas Bergvall. Watch the highlights\n“It’s very rewarding to see how my team has grown in just a few months since we last faced Tottenham,” coach Maarten Martens told the UEFA website after the match.\n“You want to deliver performances that excite people, and that’s why we do it – to give the fans a great evening at the stadium. But, at the same time, we realise, ‘hey, we’re now halfway there.'”\nDespite a disappointing week for Dutch football, with both PSV and Feyenoord losing in the Champions League, the Netherlands is set to hold onto its sixth place in Uefa’s European rankings, ensuring two direct tickets for next year’s top-tier competition.\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 297,
  "scraped_at": "2026-02-14T01:49:31.517264",
  "_text_extracted": true
}