{
  "article_id": "fc3ade63df08",
  "url": "https://www.justarsenal.com/arsenal-makes-a-decision-on-the-future-of-gabriel-jesus-as-he-recovers-from-injury/397501",
  "title": "Arsenal makes a decision on the future of Gabriel Jesus as he recovers from injury",
  "date": "20250804T211500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have reportedly decided on the future of Gabriel Jesus as the forward continues his recovery from injury. The Brazilian has been sidelined since the start of the year due to a serious issue, and his absence was felt throughout the second half of the campaign. Many believe that missing a player of his calibre may have contributed to Arsenal’s inability to secure either the Premier League or Champions League title last season.\nJesus has been an important figure at the Emirates since his arrival from Manchester City. While his goal tally has not always met expectations, his overall contribution to the team has remained valued by manager Mikel Arteta, who has consistently seen him as one of the key members of the squad.\nChanging Dynamics in Arsenal’s Attack\nDuring Jesus’s time on the sidelines, Arsenal have undergone several changes in attack. Most notably, the club recently completed the signing of Viktor Gyökeres, who is expected to lead the line as the first-choice striker. Behind him, Kai Havertz is also set to feature prominently in the forward line. As a result, Jesus is now regarded as third or possibly even fourth in the attacking hierarchy.\nThis shift raises questions about the Brazilian’s future role at the club. With increased competition for places and a need for consistent performance, opportunities for Jesus could become limited once he returns to full fitness. In this context, his long-term position in the team appears uncertain.\nTransfer Possibility on the Table\nAccording to Football Insider, Arsenal are now open to selling Jesus and would allow him to return to Brazil if a significant offer is presented. While the forward remains under contract, the club are prepared to sanction a move should suitable terms be agreed. His recent injury complicates the prospect of a sale, but he is now considered available for transfer.\nWith limited chances of regular playing time upon his return, Jesus may need to consider a move this summer. A transfer could offer him the chance to restart his career and regain momentum elsewhere, particularly if he hopes to secure a place in Brazil’s national setup moving forward.\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 430,
  "scraped_at": "2026-02-14T02:02:51.939788",
  "_text_extracted": true
}