{
  "article_id": "fc4e9e4d7a12",
  "url": "https://www.newkerala.com/news/o/champions-league-messi-best-dont-compare-myself-anyone-says-489",
  "title": "Yamal Defends Messi Legacy in Barcelona Champions League Quest",
  "date": "20250429T140000Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona, April 29\nFC Barcelona forward Lamine Yamal, who has been compared to former right-winger Lionel Messi ever since his breakthrough to the first-team squad, acknowledged that the Argentinian is the best in the club's history, but does not compare himself to the all-time great.\nYamal made his Barcelona debut in 2023 and has been an integral part of their comeback to the top of European football this year. Fresh off A European Championship winning campaign, Yamal entered this season on red-hot form and has been key in the side's success this season which has seen them win the Supercopa de Espana and the Copa del Rey.\n\"I don't compare myself with anyone, same with Messi. I admire Leo, he's the best in history. I just focus on improving; comparing myself with other players doesn't make any sense,\" said Yamal in a press conference on the eve of his side's UEFA Champions League semifinal clash against Inter Milan.\nThe Spaniard once again showed no signs of pressure when Barcelona defeated Real Madrid in the final of the domestic tournament on Saturday. After the game, Yamal grabbed headlines when he stated that Madrid can't beat Barcelona.\nWhen asked about the comments, Yamal replied, \"They can't say anything to me. When they beat me, then yes!\".\nBarcelona are the top scorers in the competition. Flick's men have racked up a staggering 37 goals in 12 matches, a jaw-dropping average of 3.08 goals per game. But that doesn't mean Hansi Flick's side should expect a walkover. Inter boast the tightest defence in the Champions League. In their 12 matches, they've conceded just five goals -- a number that highlights discipline, organisation, and rock-solid back-line resilience.\nYamal acknowledged that Barcelona has not won the UCL since 2015 and the strong Italian defense that Milan possesses, but believes that if his side play like they have been, the Catalonians will progress to the finals in Munich.\n\"As kids, we watched Barça win the Champions League in 2015. We play because we feel strongly about the shirt, because we want Barça to win and be on top. Signing from abroad isn't the same as playing in a derby or a Clásico while playing at La Masia.\n\"We know they're very strong defensively, and that defense is their greatest weapon. They're also very quick on the counterattack and have a good team. We have to play like we always do to advance,\" he said.\n- IANS",
  "word_count": 409,
  "scraped_at": "2026-02-14T02:26:33.602950",
  "_text_extracted": true
}