{
  "article_id": "fc8dce5c7d65",
  "url": "https://www.tvtechnology.com/news/no-laughing-matter-comedy-is-the-most-pirated-genre",
  "title": "No Laughing Matter : Comedy Is the Most Pirated Genre",
  "date": "20230203T230000Z",
  "domain": "tvtechnology.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "No Laughing Matter: Comedy Is the Most Pirated Genre\nValue of entertainment piracy is 300% greater than sports, according to Synamedia and Ampere Analysis\nThe professional video industry's #1 source for news, trends and product and tech information. Sign up below.\nYou are now subscribed\nYour newsletter sign-up was successful\nLONDON—Video software provider Synamedia has unveiled research on piracy covering seven countries that found comedy is the most pirated entertainment genre.\nPiracy was driven by such titles as “Ghostbusters: Afterlife”, and “Ted Lasso”, with half of all pirate viewers streaming comedy illegally. This is followed by the action and adventure genre, and the crime and thriller category respectively, the researchers reported.\nThe study, conducted by Ampere Analysis, finds the value of entertainment piracy is three times bigger than sports piracy and that the fragmentation of rights across more services is now affecting piracy in the entertainment market as it has for sports.\nIf piracy was stopped, sports would create $9.8 billion in potential revenue in the seven surveyed markets, however this figure is dwarfed by the possibility of unlocking an additional $21.8 billion in revenue by converting movie and TV pirates to legal services, the researchers reported.\nThe study covers the impact of sports and entertainment piracy across seven countries and the potential revenues that would result from converting pirate viewers to legal subscribers.\n“Unless the industry takes action, the fragmentation of premium content compounded by the current economic climate will continue to drive viewers to both paid and free piracy services,” explained Avigail Gutman, vice president of intelligence and security operations at Synamedia. “This represents a real risk to rights holders, broadcasters and streaming providers. As well as using tools and techniques to protect content and services, operators can counter the rise in piracy by ensuring content is easy to find and meeting consumers’ demands for mobile-first services, as well as more aggregated services and billing.”\nThe data shows that stopping piracy of a single Hollywood major movie release can trigger revenues of between $130m and $280m in the U.S. alone, with super-hero blockbusters offering the biggest opportunities. For a popular title like “Spider Man: No Way Home”, stopping piracy would lead to potential revenue for a studio streaming service of over $400m, based on the true annual lifetime value of streaming subscribers.\nThe professional video industry's #1 source for news, trends and product and tech information. Sign up below.\nOf the seven countries surveyed, Synamedia’s report finds that the market with the most to gain is the US, with the potential of $13.7 billion in new revenue annually by stopping movie and TV piracy and an additional $5 billion related to sports. This would generate $5.9 billion in annual income for US streaming providers, with the 28 most heavily pirated movies and TV titles alone contributing up to $1.8 billion in new revenues.\nAccording to the research, Germany, Italy and the UK have the lowest levels of piracy. But, by stopping piracy and converting pirate viewers to legal subscribers in the UK for example, video providers and content owners have the potential to unlock a whopping $1.36 billion for entertainment and $1.17 billion for sports annually, the companies said.\nFootball is the star sports piracy attraction and, despite being available on free-to-air TV, FIFA World Cup it is the most pirated league according to the findings. This reflects its popularity globally but indicates that even free content can suffer from piracy if fans are already using illegal sites to access other sports content.\nUEFA Champions League and the English Premier League are second and third respectively. The only non-football league in the top 10 is the NBA. After football, the most popular sports to watch on pirate services in the seven countries surveyed are cricket and kabaddi, driven by piracy in the Indian sub-continent, and badminton, driven by piracy in Asia, the researchers said.\nThe study also found that pirate viewers using both free and paid for services are more likely to be male with paying pirates more likely to be to be men under 35 with young children. The research finds that 44% of affluent consumers pay to pirate live sports, despite most pirates falling into lower income groups, indicating a desire to cut costs and watch all the leagues in one place.\nAs fragmentation of content rights continues, the research finds that pirate viewers tend to be those who are most engaged with content. As consumers increase the number of legal subscriptions they have, they also become increasingly likely to watch pirate content with 91% of respondents who have access to five or more legal video subscription services have also watched illegal content.\n“There is a persistent myth that the pirate consumer won’t pay and will never pay,” noted Guy Bisson, executive director and co-founder of Ampere Analysis: This research overturns this received wisdom, with more than half of all pirate viewers paying for pirate TV services and 54% also paying for legal services. We already knew sports piracy was a big-money issue, but what surprised us most about this study was the true scale of impact on the US major studios and Hollywood as a whole.”\nBuilding on Synamedia’s research report into sports piracy in 2021, this survey involved 16,000 consumers in Brazil, Italy, India, Germany, Thailand, UK, and US.\nSynamedia and Ampere Research will host a fireside chat, ‘No laughing matter: pirates enjoy comedy’ to discuss the findings in more depth on Tuesday 28th February 2023 at 4pm UK / 5pm CET / 11 am ET / 8 am PT. More information is available here.\nGeorge Winslow is the senior content producer for TV Tech. He has written about the television, media and technology industries for nearly 30 years for such publications as Broadcasting & Cable, Multichannel News and TV Tech. Over the years, he has edited a number of magazines, including Multichannel News International and World Screen, and moderated panels at such major industry events as NAB and MIP TV. He has published two books and dozens of encyclopedia articles on such subjects as the media, New York City history and economics.",
  "word_count": 1019,
  "scraped_at": "2026-02-14T02:03:35.864471",
  "_text_extracted": true
}