{
  "article_id": "fca2def26f1c",
  "url": "https://theathletic.com/5260363/2024/02/09/jordan-asian-cup-final/",
  "title": "How Jordan defied the odds , infighting and regional instability to reach the Asian Cup final",
  "date": "20240209T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s not just that Jordan did not expect to reach the final of the Asian Cup. Plenty of people didn’t expect them to get past the group stage.\nHopes were not high before the start of the tournament in Qatar. They had already got off to a dire start in their World Cup qualification group, losing at home to Saudi Arabia and only managing a draw against Tajikistan in November.\nAdvertisement\nThey played three pre-tournament friendlies, beating Qatar — which at the time absolutely nobody thought would be a dress rehearsal for Saturday’s final — but lost to Lebanon and were absolutely steamrollered by Japan, 6-1. Not that anyone could actually see whether these games offered any hint of what was to come: coach Hussein Ammouta had decreed none of them would be televised, so people back home could rely only on the results.\nAmmouta, the Moroccan who was appointed by Jordan last summer, was facing calls to be sacked before the tournament began. As preparations go, theirs could be filed under ‘not ideal’.\nBut confidence started to grow once the Asian Cup began. They beat group minnows Malaysia 4-0, but it was the 2-2 draw with South Korea that was arguably the turning point. Jordan outplayed their illustrious opponents, who had to rely on a 91st-minute own goal to claim a point. “That changed everything,” says Jordanian journalist and broadcaster Waheed Al-Masri. “That’s when we started to believe.”\nJordan only actually went through as one of the third-placed teams, after resting key players and losing their final game against Bahrain, but confidence grew still further after an extraordinary win over Iraq in the round of 16.\nIraq’s Aymen Hussein gave his side a 2-1 lead in the closing stages, but was immediately sent off for a second yellow card, issued after he had over-celebrated by mocking Jordan’s goal celebration. Jordan’s players had started celebrating by pretending to sit down and eat a mansaf, a traditional Jordanian meal typically eaten at weddings and funerals. Before the game some Iraqi fans had taunted their opponents by chanting they would ‘eat the mansaf boys’. Hussein’s own version of that did not go down well.\nIraq looked to have held on but, in an extraordinary finale, Jordan scored in the 95th and 97th minutes and won 3-2. Even more drama came in the form of a very public touchline argument between Ammouta and Jordan’s record goalscorer Hamza Al-Dardour, who was on the bench and had to be restrained by team-mates. He was subsequently sent home for ‘violating the team’s instructions’.\nAdvertisement\nA narrow 1-0 win over Tajikistan in the quarter-finals followed, before not just beating but outclassing the Koreans in the semi, winning 2-0 in a game in which Jurgen Klinsmann’s side’s luck finally ran out. “What you saw today was the fruit of several years of work,” said Ammouta afterwards. “The players delivered a heroic performance. The X factor was we didn’t need to give South Korea more respect than needed.”\nTo put Jordan’s run to the final into some sort of context, before this tournament they were ranked 84 in the world by FIFA, making them officially the 12th best team in Qatar. They have never qualified for the World Cup, the closest they’ve come being the intercontinental play-offs against Uruguay for the 2010 edition in South Africa, when their hopes were brutally punctured by a 5-0 home defeat in the home leg.\nTheir previous greatest achievements were a pair of gold medals at the Arab Games in 1997 and 1999, but reaching this final has already eclipsed that.\nThey have not only never reached the final of the Asian Cup but, before this tournament, they had never even won a knockout game in it before. They have reached the quarter-finals on two previous occasions — in 2004 and 2011 — but those were the days of a 16-team tournament, meaning the quarters were also the first knockout round. They lost on penalties to Japan and 2-1 to Uzbekistan, respectively.\nThey had high hopes in the last edition, in 2019, beating Australia and topping their group, before again falling on penalties in the first knockout round, this time to Vietnam.\nThe significance of the 2019 side was that it featured many of the key players that have taken them to the final this time. Captain Ihsan Haddad and star attacker Musa Al-Taamari were two of the eight players to feature at both tournaments, all of them now a little older and wiser and more experienced, and the man who coached them five years ago has been watching from afar, bursting with pride.\nAdvertisement\n“In 2019 I worked with these guys,” says Vital Borkelmans, the Belgian coach who was in charge of Jordan between 2018 and 2021 and sits among Harry Redknapp and Ray Wilkins on the list of their former managers. “Now they’re ready. They are the revelation of the tournament. They’re very physical, strong in defence, very quick. I was not surprised they have got this far.\n“Nobody in Europe believed in these players. Only one signed for a European club. But I was telling everyone in Belgium: ‘Look, these players are very good.’\n“I’m so happy that what I said I would do with them is now happening.”\nThe team’s run to the final has also had a wider impact, because the past few months have been pretty tough back home. Jordan is somewhat hemmed in by countries that have not always been particularly stable: Syria to the north, Iraq to the east, Saudi Arabia to the south.\nAnd to the west, Israel. Jordan shares a land border with Israel and the West Bank, so inevitably the conflict in Gaza has started to have an impact in the capital Amman and beyond. After decades of animus, Jordan and Israel signed a peace treaty in 1994 and, since then, relations have been on the fragile side of friendly, something the past few months have jeopardised.\nJordan withdrew its ambassador from Tel Aviv in November and was the first country to offer aid to the people of Gaza. Many Jordanians have familial Palestinian links, not least Queen Rania, the wife of King Abdullah, whose family is from the West Bank town of Nablus. King Abdullah accused Israel of perpetuating an “unprecedented humanitarian catastrophe” in the early days of their attacks.\nOn a more prosaic but practical and still damaging level, the tourism industry in Jordan has fallen through the floor, simply because of its physical proximity to the violence, which added to an already precarious economic situation in the country.\nAdvertisement\nThere hasn’t been a huge amount of good news in Jordan recently, so Ammouta’s team’s extraordinary run to Saturday’s final has, to say the least, lifted spirits. “People were searching for a reason to celebrate,” says Al-Masri. “A light at the end of a dark tunnel.”\nMembers of the royal family have been attending games. The king’s successor, Crown Prince Hussein, was at the quarter-final against Tajikistan. His brother Prince Hashem was at the semi-final. Some of the royals even joined the celebrations in the streets of Amman after the semi-final.\nAmmouta is now a national hero, win or lose on Saturday.\nHe is from Khemisset, a town in the north of Morocco, about 50 miles from the capital Rabat. He attended a military high school, which explains a few things: his earnest demeanour, the discipline he instils in his teams, even his close-cropped haircut. He had a decent enough playing career as a midfielder, starting at his hometown club Ittihad Khemisset and going on to play in Qatar and Saudi Arabia, winning five international caps, including a place in the Morocco team at the 1992 Olympics.\nHis managerial career began in earnest back at Khemisset, before moving to Al-Sadd in Qatar, where he won the league title with a team featuring Real Madrid legend Raul. Arguably his greatest success to this point came back at home, when he became the first Moroccan coach to win the African Champions League, with Wydad in 2017.\nHe then took over as coach of Morocco A, a team comprised only of domestic players. With them, he won the African Nations Championship (a version of the Africa Cup of Nations only open to home-based players) in 2020, but fell from grace a little after losing in the first knockout round of the 2021 Arab Cup. After that, he briefly returned to Wydad, but took the Jordan job in June 2023.\nJordan’s progression has not just been big news in Amman, but in Rabat too: after Morocco slumped out of the Africa Cup of Nations in the round of 16, attention has turned to their native son doing incredible things in Qatar. He’s lifting spirits and making people dream in two countries.\nOn the pitch, the star man has been Al-Taamari. The only member of their squad currently playing in Europe, he moved to Montpellier in France’s Ligue 1 last summer having previously played for APOEL in Cyprus and Leuven in Belgium. Al-Taamari is a lithe, left-footed right winger, rapid and direct, prone to cutting inside, Arjen Robben style.\nAdvertisement\n“He plays football for his family,” says Borkelmans, the coach under whom Al-Taamari thrived for the national team.\n“He’s fast, he’s technical, he’s physical. He loves the ball. He runs with the ball brilliantly. You know what he can do: when he cuts in from the right on his left foot, he’s so dangerous. When he does that, you know he will score.\n“When he was in Belgium, he went from training once a day to three times a day. When you believe in yourself, you go higher. He’s now with Montpellier, but this is not the end for him: he could play in the Premier League.”\nAl-Masri adds: “He’s our ambassador in Europe.”\nThey will be underdogs once again in the final, where they will face hosts and defending champions Qatar in the Lusail Stadium, where a little over a year ago Argentina beat France in perhaps the greatest World Cup final of all time.\nBut they won’t be concerned with not being favourites. They’ve done everything the hard way until this point, so why not one more time?\n“You’ll call me back when they win the cup,” says Borkelmans. “Nobody can stop this team. Nobody.”\n(Top photo: Karim Jaafar/AFP via Getty Images)",
  "word_count": 1729,
  "scraped_at": "2026-02-14T02:07:39.555205",
  "_text_extracted": true
}