{
  "article_id": "fcb1387d444c",
  "url": "https://metro.co.uk/2025/10/02/thierry-henry-gives-honest-verdict-arsenals-champions-league-hopes-olympiakos-win-24319647/",
  "title": "Thierry Henry gives honest verdict on Arsenal Champions League hopes after Olympiakos win | Football",
  "date": "20251002T100000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thierry Henry says Arsenal’s greater strength in depth gives the club ‘big chances’ to win major titles this season.\nArsenal moved to with two points of Premier League leaders Liverpool with a dramatic victory away to Newcastle at the weekend, with Gabriel Magalhaes’ towering header silencing St James’ Park deep into stoppage time.\nTurning their attention to Champions League matters on Wednesday night, the Gunners picked up where they left off, edging out Olympiakos with a 2-0 victory in north London.\nThere were some nervous moments after Gabriel Martinelli’s 12th-minute effort, but second-half substitute Bukayo Saka struck at the death to put the tie to bed.\nThe result ensured Arsenal preserved their 100 per cent record at this early stage of the competition following an impressive 2-0 win at Athletic Bilbao in their opening contest last month.\nA 1-0 defeat at the hands of Liverpool in the English top flight remains the club’s only loss this term and Mikel Arteta’s men will look to reapply the pressure on the champions when they welcome West Ham to the Emirates on Saturday afternoon.\nProviding analysis for CBS Sports on a busy night of Champions League action, legendary ex-Arsenal striker Henry underlined the importance of having high-quality options that are ready to make a difference off the bench.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘That’s what the team is about. I do believe when you go through a season that you need your bench to bail you out,’ Henry said after Goncalo Ramos came on and led PSG to victory over Barcelona.\n‘If I say bail you out, it’s not so much bail you out, that’s why he signed for Paris Saint-Germain, big money, you come on the field and try to change the game when you’re called upon.\n‘This is why I think Arsenal, this year, have big chances to win stuff because the bench will change the game for you.’\nHenry, Arsenal’s all-time top scorer, added: ‘Every single time someone comes off the bench and scores… if you you want to win, go far and deep in competitions, you need to have depth in your squad and guys that can do it when they come on.\n‘Don’t see it as, “I’m on the bench, I’m not starting”, and start to cry about it.\n‘The group has to win, that’s the most important thing.’\nHenry felt Arsenal ‘battled a bit too much’ and should have killed the game ‘way earlier’, but were saved by the likes of Declan Rice, Eberechi Eze and Saka providing something extra off the bench.\n‘Arsenal should have buried it way earlier. They missed a lot of chances, they ended up battling for it at one point,’ the iconic Frenchman continued.\n‘Martinelli scored and it was a weird game from that point. Arsenal could have made it two a couple of times and then, suddenly, there was a goal disallowed for Olympiakos.\n‘They battled a bit too much for my liking but, once again, we had players coming off the bench and trying to change it.’\nFacing the media shortly after Arsenal’s win, Arteta said he was pleased to see more players being able to ‘bring another dimension’ off the bench this season.\nAsked if his squad were thriving as a result of greater strength in depth, the Spaniard told reporters: ‘They are. They know that they have a chance to play, to maybe make six changes and I want everybody to be a big part of that.\nMore Trending\n‘The players came in as well to help the team when we were still lacking a bit of rhythm and needed to re-energise. Declan comes in, Ebz [Eze], Bukayo, [Cristhian] Mosquera, Jurrien [Timber]… anybody that comes in and brings another dimension to the team. It’s great to see.’\nThe Arsenal head coach added: ‘I’m very happy obviously with the win and the clean sheet, because we predicted a really tough opponent.\n‘I think we started the game very, very good. Scored the goal, had some big chances but in the Champions League you have to put them away. After we began to a suffer a bit, the game became a little bit open.\n‘We needed a big save from David in one action to keep the clean sheet. But overall, after playing just three days ago, and the way we had to play at Newcastle, credit to the boys for the way we performed.’\nMORE: Kobbie Mainoo makes decision on Man Utd future ahead of January transfer window\nMORE: Rasmus Hojlund denies Manchester United dig during Napoli celebration in Champions League\nMORE: Gabriel Magalhaes injury update as Mikel Arteta speaks out on latest Arsenal scare",
  "word_count": 825,
  "scraped_at": "2026-02-14T02:12:04.359438",
  "_text_extracted": true
}