{
  "article_id": "fcc956eb3598",
  "url": "https://www.opinionnigeria.com/update-al-nassr-leave-it-late-to-snatch-asian-champions-league-spot/",
  "title": "UPDATE : Al Nassr leave it late to snatch Asian Champions League spot – Opinion Nigeria",
  "date": "20230822T221500Z",
  "domain": "opinionnigeria.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Breaking News\nUPDATE: Al Nassr leave it late to snatch Asian Champions League spot\nElsewhere in the west zone, UAE side Sharjah qualified for the tournament proper with a 3-1 victory away to Iran’s Tractor FC, while Uzbekistan’s Navbahor Namangan defeated Al Wakrah of Qatar 1-0 after extra time.\nCristiano Ronaldo’s Al Nassr qualified for the Asian Champions League group stage after they secured an injury-time victory against Shabab Al Ahli in Riyadh on Tuesday.\nThe Saudi Pro League side came from behind to triumph 4-2 in the play-off at Mrsool Park, with Brazilian Anderson Talisca scoring twice and Croatia international Marcelo Brozovic rounding off the win. Nassr had been two minutes from exiting the tournament.\nThe result means Nassr, runners-up domestically last season, move into the group phase, which begins next month. Ronaldo, a five-time UEFA Champions League winner, was making his debut in Asian football’s top club competition after signing for the Riyadh club last December.\nNassr opened the scoring on 11 minutes, when Taslica headed home a Brozovic corner. However, Yahya Al Ghassani levelled for UAE champions Shabab Al Ahli seven minutes later, the winger slotting the ball into the Nassr net after the Dubai side countered.\nRonaldo, 38, left the pitch at half-time clearly frustrated and could been seen arguing with the referee. The Portuguese star, the Nassr captain, believed he should have had two penalties in the first half.\nThen, one minute after half-time, Al Ghassani raced clear of the Nassr defence to flick the ball over Nawaf Al Aqidi and put Shabab Al Ahli in front.\nHowever, Nassr equalised with two minutes of normal time remaining, when full-back Sultan Al Ghannam’s header was diverted into his own goal by Walid Abbas.\nNassr’s comeback was complete five minutes into the allotted seven minutes of injury time, with Talisca nodding home from close range. Moments later, as Shabab Al Ahli chased the equaliser, Ronaldo teed up Brozovic to drill his shot into the net and make safe the game.\nElsewhere in the west zone, UAE side Sharjah qualified for the tournament proper with a 3-1 victory away to Iran’s Tractor FC, while Uzbekistan’s Navbahor Namangan defeated Al Wakrah of Qatar 1-0 after extra time.\nIn Tuesday’s other play-off, Uzbek side AGMK Olmaliq defeated Qatar’s Al Arabi 1-0.",
  "word_count": 381,
  "scraped_at": "2026-02-14T02:10:09.481206",
  "_text_extracted": true
}