{
  "article_id": "fcd4ad2b10cf",
  "url": "https://www.the42.ie/hugo-keenan-toulouse-6052955-Apr2023/",
  "title": "  Toulouse are the ones with 5 stars , that the way were looking at it  ",
  "date": "20230426T063000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "GIVEN LEINSTER HAD the luxury of being able to keep their frontliners at home for the recent two-game URC trip to South Africa, the province’s big hitters will be itching to get back out on the pitch by the time Saturday’s Heineken Champions Cup semi-final date with Toulouse rolls around.\nHugo Keenan, like most of the club’s Ireland internationals, hasn’t had a run-out since the quarter-final win over Leicester Tigers on 7 April, leaving him with a three-week wait between fights.\nHe’s spent much of that time training away at Leinster’s UCD base ahead of this weekend’s heavyweight clash at Aviva Stadium, but there’s been a welcome opportunity to unwind, too.\nTwo weeks ago, Keenan, along with a couple of Leinster teammates, was in Madrid to watch Chelsea lose 2-0 at the Bernabeu in the Champions League.\nChelsea might not be the model of elite performance at the moment but Leinster have looked to the club in the past – an old clip from Frank Lampard’s playing days has long been a favourite of senior coach Stuart Lancaster’s.\n“The only thing that we’ve really looked at with football and the correlation to rugby is maybe a bit on scanning,” Keenan explains.\n“There’s always that clip of Frank Lampard constantly looking over his shoulder – like he did it 20 or 30 times before setting up a pass and ultimately setting up a goal.\n“Stu loves it. He’s shown it a few times now.\nWe talk about it a lot, about seeing pictures and seeing what people are doing off the ball, what resources you have as well as what they have, in both attack and defence. So, yeah, it’s something we bring up a good bit.”\nLeinster’s vision and awareness will be put to the test this weekend as Toulouse come to town for a blockbuster Heineken Champions Cup semi-final. The French side have plenty of power in their ranks but it’s their ability to create something out of nothing which really sets them apart.\nAntoine Dupont remains Toulouse’s star attraction but out-half Romain Ntamack and in-form fullback Thomas Ramos are just as capable of providing game-changing moments.\n“They’ve talent all across their team, and international talent, and they’re up there with the best club in the world at the moment, aren’t they?” Keenan continues.\n“They’re playing such good rugby, top of the Top 14. So, yeah, these are the weeks you want to be involved in and the games you want to be involved in.”\nOf course, the two sides met at the same stage last year but it was a case of wrong team, wrong team for Toulouse. Just one week on from an exhausting quarter-final win over Munster which went all the way to penalties in Dublin, the French side looked a shadow of themselves as Leinster stormed to a 23-point win.\nThis time around, it feels as if both teams are coming into the game at the peak of their powers.\n“They’re in a rich vein of form so they’ll be fancying their chances and they’ll be motivated after last year. But I suppose they’re the ones with five stars (Champions Cup titles), they got there before us. That’s the way we’re looking at it, so we’re not going to be shy of motivation either.”\nAs the man protecting Leinster’s backfield, Keenan will need to be alert against a team who boast so many attacking threats and a strong kicking game. The challenge won’t faze the 26-year-old, who is arguably the form fullback in the world. The Grand Slam winner has plenty of experience playing against Toulouse’s all-action French stars, and explains what it’s like to take on their gifted scrum-half, Dupont.\n“Yeah, he keeps you on your toes alright, and you just can’t switch off I suppose. You might be a bit deeper when they’re deeper, if he’s looking to set up kicks or what not, but once he’s running you have to expect a line break, you have to be starting to connect to the front line, helping them as much as possible.\nBut it’s probably not about going after these lads individually is it? You have to go in twos, threes, fours. That’s the only way to take down those talents in their team.”\nThe fact that Ireland’s Six Nations meeting with France proved such an electric contest has only added to the sense of anticipation around this one. Of course, an Ireland team heavily loaded with Leinster players came out on top at Aviva Stadium.\nThat it itself can provide Leo Cullen’s side with another physcological boost ahead of this weekend’s do-or-die meeting in Dublin 4.\n“Yeah, absolutely. Like, we (Ireland) would have reviewed individuals throughout the week building up to France, getting to know what they are like.\n“There is a big correlation and crossover between the two teams and they don’t play too dissimilarly as well.\n“So I think it is an advantage, but at the same time they are probably saying the same about us with Leinster.”\nThe42 is on Instagram! Tap the button below on your phone to follow us!",
  "word_count": 852,
  "scraped_at": "2026-02-14T02:06:54.997149",
  "_text_extracted": true
}