{
  "article_id": "fcd99164b473",
  "url": "https://www.caughtoffside.com/2025/04/24/cole-palmer-transfer-liverpool/",
  "title": "Cole Palmer transfer : Liverpool sniffing about for Chelsea star",
  "date": "20250424T160000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool are reportedly looking into a surprise potential transfer move for Chelsea attacking midfielder Cole Palmer, according to Simon Phillips.\nThe England international has been a world class performer since arriving at Stamford Bridge last season, scoring a total of 34 goals in 89 games for the Blues.\nPalmer had previously not played much first-team football at former club Manchester City, but he was highly regarded there, and Chelsea did well by taking a gamble on him.\nAccording to Phillips, there’s now interest from Palmer’s old club Man City, who have enquired about him, while Liverpool seem to be in the mix as well.\nPhillips, however, is not particularly convinced Chelsea are going to let Palmer go.\nCole Palmer transfer bombshell as Liverpool linked\nDiscussing a host of Chelsea stories in his latest Substack post, Phillips explained what he’d heard about Palmer’s situation ahead of the summer.\n“Meanwhile, and I’m not saying we do sell him by the way, both Manchester City and Liverpool have been sniffing around Cole Palmer for the summer, with City making an enquiry recently,” he said.\nPalmer, previously described as “incredible” by Chelsea legend John Terry in an interview with the Sun, could undoubtedly be an exciting signing for Liverpool, who might feel they could do with someone like him as an upgrade on slightly inconsistent performers like Luis Diaz, Cody Gakpo and the injury-prone Diogo Jota.\nCity, meanwhile, must regret letting Palmer go, so it makes sense that they’re perhaps looking at him again, especially after Phil Foden’s major dip in form this season.\nChelsea will surely do all they can to avoid selling the 22-year-old, but one of their former players has suggested this ownership would cash in on him if the opportunity came along.\nSpeaking to the Metro, former CFC defender Frank Leboeuf said: “Sure, they give big, long contracts for young players but if they can make a profit, then they will sell them. That’s the goal. Cole Palmer, who was bought for £40m, could be sold for 120 or 130 million in the summer if they got an offer. I think they will take the money and buy two younger players.\n“The goal is not to be champions of England, the goal is not to be in the Champions League, it’s to make money out of the players that they’ve bought.”",
  "word_count": 391,
  "scraped_at": "2026-02-14T01:58:31.706174",
  "_text_extracted": true
}