{
  "article_id": "fcee80ea9731",
  "url": "https://www.teamtalk.com/chelsea/maresca-demands-sign-elite-striker-this-week-80m-rated-prem-star-top-of-shortlist",
  "title": "Chelsea transfers : Maresca demands Blues sign elite striker THIS WEEK , £80m - rated Prem star top of shortlist",
  "date": "20250128T194500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nMaresca demands Chelsea sign elite striker THIS WEEK, £80m-rated Prem star top of shortlist\nEnzo Maresca has made clear to the Chelsea board that he wants to sign a new striker this month and Aston Villa’s Jhon Duran is firmly on the club’s radar, TEAMtalk understands.\nThe Blues are in a poor run of form and that has put a dent in their excellent start to the campaign and Maresca believes the signing of a new front man could reignite their season.\nSources close to Chelsea take that Maresca has made it clear to the club’s top recruiters that he wants a new striker before the window closes.\nThe Blues’ current first-choice forward Nicolas Jackson is admired by those within the club, but there is an admittance that he’s not yet an elite striker and they need to bring in a more prolific goal scorer.\nChelsea have been looking at multiple options and TEAMtalk can confirm they are still big admirers of Villa star Duran, who will be allowed to leave this month for £80m.\nA door has been opened for Chelsea as Villa are very interested in Joao Felix and are very keen to sign him before the window closes.\nThis could see the clubs do two ‘separate’ deals that benefit both parties and Duran is very, very interested to move to a club consistently competing at the highest level. The 21-year-old also believes he would be the first choice striker at Stamford Bridge, as opposed to sitting on the bench at Villa Park where Ollie Watkins is preferred by Unai Emery.\nREAD MORE: Double Chelsea exit to Aston Villa on cards, with third star wanted in Portugal\nChelsea could face competition for Duran – sources\nChelsea face competition for Duran from London rivals Arsenal, who are also keen to bring in a new striker before the transfer window slams shut.\nChelsea are understood to be well-placed in the race to sign Duran due to Villa’s interest in Felix though, and the fact Villa are also pushing to sign Axel Disasi on loan from the Blues.\nAnother target on Chelsea’s shortlist is RB Leipzig striker Benjamin Sesko – another Arsenal target. The 21-year-old’s agents have been at Stamford bridge recently and he is keen on a move to the Premier League.\nThe difficulty with Sesko is getting him this month, with a summer transfer deemed far more likely by sources.\nIt’s the same story for Ipswich Town striker Liam Delap, who has impressed Chelsea hugely with his performances for the Tractor Boys this season.\nHowever, Kieran McKenna’s side are not keen to let Delap go this month as he is viewed as vital to their efforts to try and avoid relegation.\nDON’T MISS: Garnacho to Chelsea: Three reasons for Man Utd to keep, three to sell as controversial transfer assessed\nChelsea transfer quiz: Higher or lower?",
  "word_count": 482,
  "scraped_at": "2026-02-14T02:11:27.597821",
  "_text_extracted": true
}