{
  "article_id": "fd0e648d33ae",
  "url": "https://www.espn.com/soccer/blog-soccer-transfers/story/4867267/how-man-united-used-emergency-protocol-to-sign-sabitzer-in-12-hours-on-deadline-day",
  "title": "How Man United used  emergency protocol  to sign Sabitzer",
  "date": "20230202T141500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag is fond of saying Manchester United are going \"in the right direction\" on the pitch since his arrival as manager in the summer, and the last 24 hours of the January transfer window were evidence that progress has been made off it as well.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nDeadline day on Tuesday began with news that midfielder Christian Eriksen, a player used more than any other by Ten Hag during the first half of the season, would be ruled out for at least three months with an ankle injury but it ended on a better note, with a club announcement that Marcel Sabitzer has been signed on loan from Bayern Munich to compensate for the loss.\nIt's a stark contrast to January 2022 when interim manager Ralf Rangnick wanted a striker, but didn't get one.\n\"I spoke to the board and told them: 'Shouldn't we at least speak and analyse and find if we can at least get a player, on loan or a permanent deal?' In the end the answer was no,\" Rangnick said in May, shortly before his spell in charge came to an end. \"Maybe they didn't want to do any winter [business]. I believe that we should have tried in those 48 hours. Forty-eight hours is 48 hours. It might have been at least worth to try and internally discuss it. We didn't.\n\"The answer was no and that was it. We were still in three competitions: the FA Cup, the Champions League, and at the time were fourth in the league.\"\nRangnick wasn't happy and still believes that the lack of options up front contributed to a disastrous second half of the season under his management.\nLike Rangnick, Ten Hag expressed concern in the January window that the squad -- following Cristiano Ronaldo's departure and injuries to Eriksen and Donny van de Beek -- would not be able to cope with the demands of four competitions. This time, though, the club listened and -- crucially -- acted.\nStriker Wout Weghorst was signed on loan to replace Ronaldo while a deal for Sabitzer was put together inside 12 hours on deadline day after scans revealed the extent of Eriksen's injury. United insist the Sabitzer deal, and the speed with which it was done, shows the club's recruitment department -- heavily criticised in the past -- is now working as it should.\nAs soon as it became clear Eriksen would be sidelined for months rather than weeks, the team led by football director John Murtough, deputy football director Andy O'Boyle, director of data science Dominic Jordan and head of recruitment operations Steve Brown activated an \"emergency protocol\" designed to quickly identify realistic targets in problem positions. On Monday, Ten Hag was presented with a list of 10 names -- considered to be potentially available and deemed to be of sufficient quality -- but when he sat down for his scheduled news conference at 12 p.m. GMT on Tuesday, he still had no idea whether he would get someone on board.\n\"As a manager, I think you always try to find ways to make your team better,\" he said when asked about the prospect of a late signing. \"I wouldn't be a good manager if I didn't. If there are opportunities, it's my job to tell the club there are opportunities to strengthen our team.\"\nBehind the scenes on Monday and Tuesday morning, Ten Hag was pushing hard to get someone in while chief executive Richard Arnold was stressing that any addition to the squad had to fall within tight financial constraints following a larger-than-expected spend on transfers last summer. United already had reams of data on Sabitzer -- they considered a move when he was at RB Leipzig -- and were convinced he was the right player when he told Ten Hag over the phone on Tuesday that he was desperate to move to Old Trafford.\nNegotiations with Bayern -- which only began hours before the 11 p.m. GMT cut-off -- were straightforward because of an existing strong relationship between the clubs, something Murtough has looked to cultivate with all of Europe's top sides since taking on the role as football director in March 2021. Sources have told ESPN that following initial talks with Sabitzer and Bayern, the deal -- a loan until June -- was like \"pushing at an open door.\"\nUnited feel they have benefitted from moving the entire recruitment operation to Carrington rather than having it split between offices in London and Manchester, and with so little time to finalise the agreement, having everyone in the same room for meetings with Ten Hag and his staff was key.\n\"We're really happy with the transfer because we need it,\" Ten Hag said on Wednesday. \"To bring a quality player in on deadline day, that is difficult, but we got this opportunity.\"\nSources have told ESPN that United decided to back Ten Hag in January because the hectic schedule between now and the end of the season is a consequence of the success he has already had in the job. After booking their place in the Carabao Cup final with Wednesday's semifinal win over Nottingham Forest (stream a replay on ESPN+ in the U.S.) while still competing in the FA Cup and Europa League and battling for a top-four finish in the Premier League, United could have another 32 games to contest before the end of May and eventually end up playing 65 matches this season, 16 more than last term.\nDuring conversations on deadline day with Murtough and the recruitment team, Ten Hag asked that the potential success of his first season shouldn't be undermined by a lack of options in the squad. United have delivered the players, in the hope he will deliver on the pitch.",
  "word_count": 969,
  "scraped_at": "2026-02-14T01:59:41.725015",
  "_text_extracted": true
}