{
  "article_id": "fd1924d91e97",
  "url": "https://www.thenationalnews.com/news/us/2025/06/05/trump-travel-ban-afghanistan-iran/",
  "title": "Trump signs proclamation banning travel from 12 countries , including Afghanistan , Iran and Yemen",
  "date": "20250605T020000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "President Donald Trump has signed a proclamation banning people from 12 countries from entering the US, drawing criticism from humanitarian groups and his political opponents.\nThe decision follows the attack in Boulder, Colorado, on a march in support of Israeli hostages.\nThe travel ban covers Afghanistan, Chad, the Democratic Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Myanmar, Somalia, Sudan and Yemen. The measure also partially limits entry of people from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela.\nThe alleged attacker, Mohamed Soliman, is from Egypt, which is not on the list.\n“We cannot have open migration from any country where we cannot safely and reliably vet and screen,” Mr Trump said in a video posted on social media.\nThe decision comes after he ordered Secretary of State Marco Rubio to review “high-risk regions” that should have restrictions imposed. The list is subject to revision, Mr Trump added.\nThe list includes countries deemed to have inadequate screening and vetting processes as well as high rates of visa overstays. It also includes nations that have historically refused to accept back their deported citizens, as well as those that have high instances of terrorist activity.\nAfghanistan, Iran, Libya and Somali were flagged as being high-risk for the amount of extremist activity there, with Tehran accused of being a state sponsor of terrorism. Burma, Haiti and the Democratic Republic of the Congo were accused of having high visa overstay rates.\nThe countries facing the total ban were found “to be deficient with regards to screening and vetting and determined to pose a very high risk to the United States\", the White House said. Mr Trump said the travel ban from his first term was one of his most successful policies and “key” to preventing terrorist attacks on American soil.\nMr Trump enacted a so-called Muslim ban during his first term, barring citizens of several Muslim-majority countries and others from entering the US. Travellers from Cuba, Iran, Libya, North Korea, Somalia, Sudan, Syria, Venezuela and Yemen were barred from entry. The policy went through several iterations before it was upheld by the Supreme Court in 2018.\nMr Trump has blamed the immigration policies of former president Joe Biden for rising crime in the country, and he has been swift to issue executive orders cracking down on people entering the country illegally.\nDemocratic senator Adam Schiff said the administration's latest move will only further isolate the US on the world stage. \"Bigotry is not a national security strategy,\" he said in a post on X.\nAmnesty International said: \"President Trump’s new travel ban is discriminatory, racist and downright cruel. By targeting people based on their nationality, this ban only spreads disinformation and hate.\"",
  "word_count": 452,
  "scraped_at": "2026-02-14T01:49:39.541005",
  "_text_extracted": true
}