{
  "article_id": "fd35df31049e",
  "url": "https://metro.co.uk/2024/04/17/bayern-munich-plan-stop-arsenals-bukayo-saka-champions-league-clash-20662296/",
  "title": "How Bayern Munich plan to stop Arsenal Bukayo Saka in Champions League clash | Football",
  "date": "20240417T093000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Munich appear to planning to double team Bukayo Saka in tonight’s Champions League quarter final second leg against Arsenal.\nThe tie is evenly poised after last week’s pulsating 2-2 draw in north London, but the recently deposed German champions are without several key players this evening.\nWingers Serge Gnabry and Kingsley Coman are both due to miss tonight’s showdown, while Leroy Sane, who caused Arsenal no end of problems in the reverse fixture, is carrying a knock and was rested from the team which beat Koln last weekend.\nThomas Tuchel also has a major decision to make at left-back, where Alphonso Davies is suspended.\nThe Canada international, whose future at the Allianz Arena is uncertain, did an effective job on Saka seven days ago, aside from allowing him to escape for the opening goal of the contest.\nIn the absence of Davies, according to Bild, Tuchel is planning on fielding Noussair Mazraoui in place of the Real Madrid transfer target and Raphael Guerreiro, primarily a full-back, in a more advanced position to provide cover for the Morocco international who will be tasked with marking Saka.\nBoth players lined up in Bayern’s ‘A team’ in Tuesday’s training session with veteran forward Thomas Muller in the ‘B team’ suggesting Jamal Musiala will operate in the No.10 role.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBayern Munich predicted line-up vs Arsenal\nMikel Arteta, meanwhile, also has a big decision to make at left-back given the form of Oleksandr Zinchenko.\nThe former Manchester City star was jeered by his own fans on Sunday following another shaky performance against Aston Villa.\nArteta could call on the likes of Jakub Kiwior and Takehiro Tomiyasu but insists he retains full faith in Zinchenko ahead of a potentially season defining evening.\nSpeaking at his pre-match press conference he said: ‘We love Alex, he’s given us so much, he’s given us a lot and he’s up there with different qualities.\n‘He has an unbelievable courage to play football given the circumstances, and as well as the demands. Stay with our players and support them because, for sure, they’re going to perform better.’\nMore Trending\nOn helping his players block outside noise and criticism, he added: ‘I can’t control that. I can’t check their phones and put their TVs away and the people around them. We didn’t lose anything last year because we didn’t win anything.\n‘First of all, you have to win it and then maybe you can lose it. What we had is an unbelievable journey against the best team in the world here and in Europe in the last seven years. This is where we want to be and we are not satisfied.\n‘We want to be better and that is the level that we are competing, so we will try again our best until the last day trying to win those cups and to be successful.’\nMORE: The five big decisions Mikel Arteta must make as Arsenal’s season teeters on the brink of collapse\nMORE: Glenn Hoddle predicts Champions League finalist ahead of Arsenal and Man City games",
  "word_count": 560,
  "scraped_at": "2026-02-14T01:56:51.553422",
  "_text_extracted": true
}