{
  "article_id": "fd3de1d93c17",
  "url": "https://www.fourfourtwo.com/news/arsenal-have-completed-secret-deal-without-it-leaking-report",
  "title": "Arsenal have completed  secret  deal without it leaking : report",
  "date": "20251008T153000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have completed 'secret' deal without it leaking: report\nArsenal have triggered yet another move - and no one saw it coming\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nArsenal have completed yet another 'secret' deal that has slipped under the radar.\nThe Gunners have recently seen contract extensions for the likes of William Saliba and Gabriel Magalhaes, further proving their plans to remain competitive at the top level for years to come.\nAdd that to deals for up-and-coming youngsters Myles Lewis-Skelly and Ethan Nwaneri, Arsenal's prime and proper planning seems to be allowing Mikel Arteta the best chances of success again this season.\nArsenal complete yet another brilliant piece of business\nWith the ultimate aim of winning the Premier League, Arsenal also went well to reach the semi-finals of the UEFA Champions League last term, proving their might at the very top of European football.\nKeeping their squad happy remains the ultimate aim, with another one of Arteta's regulars having now reportedly been offered fresh terms to remain at the Emirates Stadium for the foreseeable future.\nAs relayed by BBC Sport, goalkeeper David Raya has signed fresh terms with the Gunners, with the Spaniard said to have been rewarded with an increase in his wages.\nThe former Brentford goalkeeper earned an estimated £100,000-a-week prior to signing his new deal, with it thought that figure has now increased, although by exactly how much is unknown.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nHis expiry has also remained at 2028, but the Spaniard has been rewarded for his stellar performances in the Premier League and beyond by sporting director Andrea Berta over the last few years.\nRaya won the Premier League's Golden Gloves award in the 2023/24 campaign and retained the accolade last season – sharing the trophy with Nottingham Forest keeper Mats Sels.\nAdditionally, the report also adds how Arsenal have opened talks with both Jurrien Timber and Bukayo Saka about extending their respective stays at the Emirates Stadium.\nIn FourFourTwo's view, Berta continues to draw praise for his ability to negotiate new terms with key members of Arsenal's squad, and doing so allows Arteta, as mentioned, the best chance at delivering future success for the Gunners in the years to come.\nGet Arsenal tickets from £199 at Seat Unique\nArsenal's premium Club Level tickets offer superb padded seating and access to the lounge two and half hours pre-match. The package includes four drinks, one food item, and a half-time complimentary drink. Guests also receive a £5 merchandise voucher and a complimentary Museum Tour, ensuring an elevated and comprehensive matchday experience for home supporters.\nMatthew Holt writes freelance for FourFourTwo, amongst others, and boasts previous experience at GOAL and SPORTBible. He now works with us alongside his time at Manchester United and Reach PLC, aiding with online content for the website. Career highs include working at the FA Cup final, as well as scoring at Old Trafford in front of the Stretford End. A long-term sufferer of his beloved Scunthorpe United, he is often seen on the padel court, as well as occasionally as a six-a-side call-up.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 652,
  "scraped_at": "2026-02-14T01:49:53.048045",
  "_text_extracted": true
}