{
  "article_id": "fd3efa6455b8",
  "url": "https://www.theghanareport.com/arsenal-beat-brighton-to-move-top-of-premier-league/",
  "title": "Arsenal beat Brighton to move top of Premier League",
  "date": "20240406T224500Z",
  "domain": "theghanareport.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal maintained their pursuit of a first Premier League title for 20 years as they moved top of the table with an impressive away victory over Brighton.\nMikel Arteta’s side edged one point ahead of title rivals Liverpool, who face Manchester United at Old Trafford on Sunday, and Manchester City after the reigning champions beat Crystal Palace 4-2 earlier on Saturday.\nThe returning Bukayo Saka, absent for Wednesday’s 2-0 victory over Luton with a minor injury, kept his composure under pressure to slam in a first-half penalty awarded for Tariq Lamptey’s foul on Gabriel Jesus.\nDavid Raya leapt across his goal to keep out Julio Enciso’s spectacular long-range effort after 43 minutes, which represented Brighton’s first attempt on target, to protect Arsenal’s advantage before the interval.\nIt was the in-form Kai Havertz who gave the Gunners breathing space, slotting in from Jorginho’s cut-back to settle nerves among the travelling Arsenal support after the hour mark.\nFormer Brighton player Leandro Trossard was denied by Bart Verbruggen, but the substitute made no mistake later when played through by Havertz, calmly lifting the ball over the Seagulls goalkeeper to put the result beyond doubt.\nBrighton dropped to 10th with defeat as their hopes of achieving European football for a second successive season were dealt a blow by wins for West Ham and Newcastle directly above them.\nArsenal show no signs of faltering\nArsenal supporters will not need reminding that it was at this stage last season their club’s hopeful grip on the Premier League trophy began to loosen. An eight-point advantage, which they held as late as 7 April, evaporated entirely.\nWith seven games to go this time, there remains no sign of Arteta’s side falling away as they seek redemption in a fascinating three-team title race.\nWith last year’s painful experience and another 12 months of progress behind them – as evidenced by the steely point achieved at champions Manchester City last week – the Gunners appear to be getting stronger as they chase the club’s first league title since 2004.\nThey have now won 10 of their past 11 league games, taking 31 points out of a possible 33 in 2024, with an aggregate score of 38-4.\nThough his team-mates won without him in midweek, Saka displayed his vital importance to Arsenal’s title ambitions, with the Gunners heavily favouring attacks down the right. The 22-year-old England international now has 30 goal involvements in 39 appearances this season.\nAfter Gabriel missed a chance to put the visitors ahead inside the opening two minutes when he headed Martin Odegaard’s superb free-kick wide of the target, Saka looked poised to score after cutting inside onto his left foot but curled wide.\nBut he has now matched the 14 league goals he managed last season, and his confident spot-kick hinted at Arsenal’s increased maturity.\nHavertz is also hitting form at the perfect time for the Gunners, with the former Chelsea player having nine goal involvements – including five goals – in the past seven league games.\nManager Arteta said: “We are older. We went through a lot of moments together and you build the chemistry within the team.\n“We signed some tremendous players as well, which helps. The squad is healthy and the momentum is good.\n“My energy is the same [as this stage last season], the enthusiasm is the same. I’m just enjoying the moment and embracing it, and let’s see how far we can go.”\nArsenal appear to face a tougher run-in than City and Liverpool, with the likes of Chelsea, Tottenham and Manchester United to come. But, with strong momentum, attention now turns to the first leg of a Champions League quarter-final against Bayern Munich at Emirates Stadium on Tuesday.\nBrighton stuttering in bid to repeat European feat\nBrighton have won only three of their past 12 league games following this defeat, which ended a club record 12-match unbeaten top-flight home run.\nThey have also scored just three times in their past eight fixtures across all competitions. As in their frustrating midweek goalless draw at Brentford, shortcomings in the final third were evident once again here.\nBoss Roberto de Zerbi, whose impact since last season has seen him linked with jobs at Liverpool and Bayern Munich, watched encouraging build-up play and effective pressing fail to translate into meaningful attempts on goal as Brighton managed just one shot on target in each half.\nThey now face an uphill battle to qualify for European football for a second successive season. Their bid to achieve that resumes at struggling Burnley next Saturday.",
  "word_count": 757,
  "scraped_at": "2026-02-14T02:20:27.917440",
  "_text_extracted": true
}