{
  "article_id": "fd4823918e4c",
  "url": "https://metro.co.uk/2025/05/31/chelsea-arsenal-target-rodrygo-makes-decision-xabi-alonso-message-23295476/",
  "title": "Chelsea and Arsenal target Rodrygo makes decision after Xabi Alonso message",
  "date": "20250531T163000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rodrygo has made a decision on his Real Madrid future following Xabi Alonso confirming he wants to keep the Arsenal and Chelsea transfer target at the Bernabeu.\nThe Brazil international had been a mainstay of the side that enjoyed such success under Carlo Ancelotti but endured a difficult end to the current campaign.\nAncelotti was forced to deny reports that the 24-year-old had decided to quit the club earlier this month before his own departure.\nUnsurprisingly, new Real manager, Alonso, was quizzed as to whether Rodrygo would be part of his plans at his unveiling earlier this week.\n‘Rodrygo is a Real Madrid player,’ said Alonso at a press conference. ‘He is a spectacular player and we will need him.’\nAccording to Marca, the former Santos youngster is in no doubt that he wants to remain at Real and be a key part of the club’s rebuilding operation.\nHaving surrendered La Liga to Barcelona and exited the Champions League prematurely, the Spanish giants are ready to invest heavily in their squad over the course of the transfer window.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nDean Huijsen has already joined from Bournemouth in a £50million transfer, while Trent Alexander-Arnold has arrived in time to feature at the upcoming FIFA Club World Cup after Real agreed to pay Liverpool a £50m fee.\nRodrygo’s potential availability had alerted the likes of Chelsea and Arsenal who are both intent on strengthening their attacks in the coming monnths.\nArsenal’s need is particularly pressing but the current focus appears to be on recruiting a centre forward.\nMore Trending\nThe Gunners were reported to be in talks to sign Sporting Lisbon’s prolific Viktor Gyokeres earlier this week, but their attention appears to now be centering on RB Leipzig’s Benjamin Sesko.\nChelsea, meanwhile, are already set to welcome exciting youngsters Estevao Willian and Kendry Paez into their first team squad even before they begin their latest recruitment drive.\nFresh from clinching Champions League qualification and winning the Conference League, the Blues are, however, on the verge of signing Liam Delap from Ipswich.\nThe England Under-21 international was available for just £30million and the former Manchester City youngster is set for Stamford Bridge after choosing Chelsea instead of Manchester United.\nMORE: Arsenal dealt transfer blow as Barcelona agree terms with £21m target\nMORE: Man Utd still eager to sign Arsenal’s £85m target after Liam Delap blow\nMORE: Barcelona considering shock move for key Arsenal star in summer transfer window",
  "word_count": 458,
  "scraped_at": "2026-02-14T02:26:38.626611",
  "_text_extracted": true
}