{
  "article_id": "fd4960bc6a70",
  "url": "https://www.in.gr/2025/04/03/english-edition/the-professors-smile/",
  "title": "The Professor Smile",
  "date": "20250403T093000Z",
  "domain": "in.gr",
  "source_country": "Greece",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With a glass of fine wine in his hand, which is how he likes to relax, he looks back at all the unforgettable moments he experienced with the team he will forever be associated with as a coach. Because he found in Olympiacos the club that would earn him a place at the very top of his profession, while the top Greek club found in Martins the coach who would lead it into a new era. Together, they would usher in a new era for Greek football as a whole. Over four years, he forged both his own personal myth and a team that will be remembered down the decades as one of the finest to ever wear the red and white stripes. And Martins will go down in Club history, of course, as one of the ‘golden’ coaches who had the most to offer the laurel-wreathed youth.\nFour years which, like fine wine, just kept on getting better. Four years which may not have ended in a blaze of glory in August 2022, when Olympiacos suffered a heavy loss and a heart-breaking knock-out, but neither can overshadow everything the Portuguese coach built in Piraeus. A relationship based on love, sincerity, mutual appreciation and friendship with everyone he worked with, and first and foremost with Vangelis Marinakis, who invested in him when times were hard and was proved right to have done so.\nSitting there in Qatar, the hero of our tale recalls his Piraeus years, which were the finest in his career to date. The Professor who bequeathed the Legend an entire era, and who knows he will always be able to call Piraeus home. Just as he knows there’ll always be a place for him and everything he achieved during his Greek adventure in the Club’s hundred-year history.\nHe created the «myth» of a team that will be remembered over the years. At the same time, he added his name to a «golden» list of coaches: The beloved «professor» who ruled out Milan and Arsenal\nSuccess!\nIt was Tuesday 10 April 2018 when he arrived in Athens for the first time to work with Olympiacos. Without fanfare, and in a year in which Olympiacos had changed coaches three times. The Club had already written the season off. Pedro Martins arrived at a time when Olympiacos had just left a glorious era behind in which it had won seven consecutive championships and was looking for a restart. He signed the contract on April 4, and Vangelis Marinakis gave him the keys to the team and the time he needed to envision the new Olympiacos.\nWhat must Pedro Martins have been thinking? Could he have foreseen that this first trip would be the start of an era he hadn’t even imagined? An era that would see Olympiacos win three consecutive championships and a Cup and blaze a trail through Europe with enormous wins along the way—like the double in London against Arsenal with El-Arabi’s eleventh-hour goal? Could he have already known he’d leave his mark on an entire era in Greek football?\nHe provides the answer himself in an interview published in «TA NEA» during his three years on the red-and-white bench. «I was proud, ambitious and full of hope. I knew I was going to take on a huge responsibility. My feelings were a little mixed. On the one hand, I was satisfied and happy that I was coming to such a great club. On the other, I was sad to be leaving my country for the first time. I remember daydreaming about what lay ahead on the flight to Athens. Today, I know that things would go even better than in the dreams I had back then.»\nMagical moments…\nFour years and (almost) four months later, with 221 official games on the Olympiacos bench, Martins retired with three championships and one Cup under his belt, two participations in Champions League groups and the same number in the Europa League (with him in his characteristic short sleeves for all of them). The Club’s performances had elevated Martins to the upper echelons of European football as a top-flight coach.\nWhen he left Olympiacos in August 2022, he had already served the Club longer than any other coach in a single stretch, and held two additional records: he had led the Club to more most participations in European competitions than any other, and had presided over the most games in total!\nHe was actually on the Olympiacos bench for 221 games, with 143 wins, 41 draws, and just 37 defeats. Olympiacos scored 417 goals in these games and conceded 177. In his 1,575 days on the Legend’s bench, he had equaled Bajević’s incredible 143 victories!\nTotal football\nThe first official Olympiacos match of the Martins era was against Lucerne at home in a Europa League qualifier. Olympiacos triumphed 4-0 before going on to knock out Burnley in the next round to earn a place in the group stage.\nAlthough Olympiacos is a young team, they’re playing wonderful football. But then, in the midst of everything, it has to deal with the corruption scandal that rocked Greek football as a whole and an incredible jinx that sees the Club lose 1-0 to PAOK at home—an unprecedented disaster.\nMartins’ first big moment arrives with Olympiacos’ 3-1 victory against AC Milan at the Karaiskakis stadium, which means the Reds qualify and the Italians don’t. It’s the first time the Professor puts on a mask, and the Olympiacos fans follow suit. The fans start chanting an old slogan again: «This is how we dream of Olympiacos»! But the season doesn’t go as planned from here on in: PAOK win the championship and Olympiacos are knocked out of the Cup following their shock defeat by humble Lamia. Still, the Karaiskakis stadium remains full every Sunday. Against all the odds, Vangelis Marinakis does something no one else in his position would have done. And the Olympiacos President’s vision will alter the Club’s future and of course of Greek football as a whole. Seeing something no one else does, Vangelis Marinakis offers Martins his full support—and is fully vindicated.\nThe season that follows is one of the best in Olympiacos’ 100-year history. Olympiacos ends up winning three championships in a row and experiencing some truly incredible moments, puts paid to any accusations of corruption by turning the play-offs into a mere formality, and slaughters «AEK 1-5 and Panathinaikos 1-4—Martins is now officially the «derby master». And in Europe? They make history at the Emirates ground with their impressive 1-2 victory over the Gunners, with El-Arabi scoring the winner in the 119th minute, qualifying in the best possible way for the Europa League’s round of 16. It’s a season in which Olympiacos truly seems capable of going all the way! But the coronavirus brings Olympiacos’ progress to a halt: having drawn 1-1 against Wolves in an empty Karaiskakis stadium, they lose the rematch—and with it the qualification—when the teams finally meet in the summer. The 1-0 score is anything but fair. If Martins could replay any one of the matched in his Olympiacos career, it would be this one. His Olympiacos played in the Champions League two seasons in a row, staring big clubs down, and bringing players to prominence who have either made a difference or shot into the stratosphere, like Tsimikas.\nWhen the time came to say goodbye, in August 2022 after a tough loss to Maccabi Haifa at home, Pedro Martins bid the club he adored an emotional farewell. He left fulfilled and as a friend. «I am leaving Karaiskakis proud of the legacy of recent seasons. It was a great pleasure to be part of the history of this great club,» he said.",
  "word_count": 1288,
  "scraped_at": "2026-02-14T02:11:32.322001",
  "_text_extracted": true
}