{
  "article_id": "fd572c49a0b5",
  "url": "https://www.caughtoffside.com/2024/06/06/manuel-neuer-warning-bayern-munich-germany-oliver-kahn/",
  "title": "Manuel Neuer sent warning by Bayern Munich and Germany legend",
  "date": "20240606T084500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manuel Neuer has been warned by fellow goalkeeping legend Oliver Kahn not to extend his career too long.\nNow 38 years old, Neuer saw his career almost ended less than two years ago as he suffered a double leg break during a post-2022 World Cup skiing holiday.\nHowever, the veteran recovered and was able to regain some of his best form, playing 33 games across all competitions for Bayern Munich last season and recently returning to the international picture in a friendly against Ukraine; his first cap since facing Costa Rica during the World Cup group stage.\nDespite turning in a host of impressive performances in 2023/24, Neuer did make a high-profile error in Bayern’s Champions League semi-final defeat to Real Madrid, spilling a routine effort from Vinicius Jr and allowing Joselu to score the rebound; a moment that, ultimately, turned the tide of the tie.\nKahn advises Neuer on when to call it quits\nHaving spent 14 years with Bayern Munich and picking up 86 caps for Germany during his playing days, Kahn will be very familiar with Neuer’s current predicament, turning 39 during the upcoming season.\nJust like Neuer, Kahn continued to play at a high level right up until retirement. However, he’s advised Bayern’s current No.1 firstly to become comfortable stepping aside for select games in order to preserve his body, and secondly to know when to call it quits altogether.\n“I gave up games here and there to Michael Rensing, so I could regenerate and concentrate fully on the decisive games. Only he can decide how long he wants to play,” Kahn told Bild (via Get Football News Germany) of Neuer.\n“At this age, it is no longer possible to play 50 to 60 games per season at the highest level. At some point, it’s about finding the right moment to leave. Getting the timing right here is just as demanding as delivering world-class performances over the years.”",
  "word_count": 322,
  "scraped_at": "2026-02-14T02:10:54.430609",
  "_text_extracted": true
}