{
  "article_id": "fd5ecc745344",
  "url": "https://www.nytimes.com/athletic/6552844/2025/08/15/diogo-jota-memories-liverpool-wolves/",
  "title": "Diogo Jota , by those who knew him :  He was an exceptional person  ",
  "date": "20250815T074500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Anfield will thrill at an array of attack-minded signings on Friday as Liverpool begin their Premier League title defence against Bournemouth, but it will be the man conspicuous by his absence who will be on everyone’s minds.\nDiogo Jota was a key member of Arne Slot’s squad. The Portuguese was a wonderful player and a popular figure inside and outside Liverpool Football Club, someone who is hugely missed after he and his brother, Andre Silva, died in a car accident in July.\nAdvertisement\nThere will be a moment’s silence held at all Premier League matches this weekend, with players also wearing black armbands. At Liverpool, the champions will wear a ‘Forever 20’ emblem on their shirts and stadium jackets for the duration of the 2025-26 season, a nod to Jota’s squad number, which has been permanently retired. He will not be forgotten.\nAhead of the season opener, The Athletic talked to people whose lives were touched by Jota during his time in England, both at Liverpool and his previous club, Wolverhampton Wanderers, to glean an insight into the character of the man.\nThese are their memories of a player taken cruelly at the age of only 28.\nJames Milner, former Liverpool team-mate\nWe were messaging each other the night before. Nothing major, just checking in and asking each other how things were going. He was about to head back from Portugal for pre-season training, having got married a few days earlier.\nI loved the guy, absolutely loved him. We were only together at Liverpool for three seasons and you might not have thought we had much in common — different nationalities, very different ages — but we hit it off immediately. Maybe it was because we were both so stubborn. Honestly, people say I’m stubborn, but Jots could give me a run for my money.\nHe was an unbelievable guy, one of my favourite team-mates I’ve had in all my time playing. He was one of those you could put in any corner of the dressing room, next to any other player, and he would click with them straight away. He was always up for a laugh, always winding people up.\nHe loved other sports. People know about his love of esports, but he was fascinated by snooker and horse racing, too. He went to the World Snooker Championship in Sheffield. He and a few of the lads went to Cheltenham for the racing and he was there in all the gear — flat cap and all that. That sums him up. He was up for anything.\nWell, not quite anything. I tried to get him into cricket, but he wasn’t having that.\nAs a player, I loved him as well. He was one of my favourite players to play with and to watch. I would sit next to Webbs (Adam Webster) on the bus here at Brighton and every time Liverpool were on, I would be saying to him, “Honestly, you don’t realise how good this guy is.”\nAdvertisement\nAnd Webbs would be, like, “Yes, I do, Milly, because you told me last week… and the week before… and the week before that.”\nWhat has happened is devastating. I was privileged to be able to go to the funeral and pay my respects with the other lads and to spend a small amount of time with his wife and his family, which was important. It’s horrible to see family go through that, but it’s the least we can do, to show them that we’re there for them.\nWhen Carlos (Baleba) wanted to change his number at Brighton this season, the No 20 became available and it felt like the right thing for me to take it. Every day when I put my kit on, I’ll think of Jots.\nOliver Kay\nThe EA SPORTS FC Team\nDiogo was a true trailblazer, seamlessly bridging the worlds of football and gaming.\nThe fact that he had “gamer” in his official Instagram bio speaks for itself. He loved it and we lost count of the amount of times he told us that he could be a professional FC (formerly known as FIFA) player. If you ever doubted what he was saying about his skills with the controller, he would become competitive. Not too competitive, of course, because that wasn’t his style, but enough to let us know.\nWe’ll never forget back in 2023 when he was with us for a four-hour shoot. It involved multiple outfit changes, multiple scenes, and plenty of time in front of the camera. He didn’t once complain and he even stayed longer after the shoot had finished to sign shirts and other items. Many people wanted a picture with him, including a taxi driver who spotted him by the front gates, but he just stopped and smiled.\nNothing was ever a problem.\nThe only time he actually wanted to get away was when we gifted him the FC 24 game early because he said that he would spend more time on our game than out on the pitch.\nThe relationship between EA and Diogo was always something special. He was open enough to share his phone number and talk to us directly. His authentic and genuine passion for our game, the brand and the community was always outstanding. Who can forget the “video game celebration” in 2022 and the “triangle logo” celebration in 2024? That was Diogo throwing his support behind us.\nHe was always extremely humble, kind and a genuine joy to be around. He knew all of us and treated us with incredible warmth. He wasn’t just another footballer. He wasn’t just another celebrity. He was a friend. A colleague. Someone as close as the person working next to us in our office.\nIt’s hard to put into words what an exceptional person he was.\nGregg Evans\nAdvertisement\nAndy Pearce, lettings agency owner who helped Wolves players move into the city\nI first met Diogo a day or so after he signed for Wolves. I took him to look at some properties and was telling him where to shop, where to get his hair done. He was a very nice young man and clearly had no airs and graces.\nHe didn’t know anything about the city, but he was a lovely lad and very humble. Rute, his girlfriend back then but later his wife, was really friendly, too; whenever we went out in a group or to a team-mate’s house, they would both always make a point of speaking in English so you didn’t feel left out, which I thought was very polite.\nHis English was brilliant, but occasionally he’d message me asking to help out with tweets and Instagram posts because he wanted them to sound right… so if there were any grammatical errors, they’re down to me, not him.\nGetting to know Diogo, you quickly worked out he was good at everything. He loved his computer games and was exceptional at those, but we even did Segway racing in my garden once — we set up an assault course — and he won easily despite having never done it before. Things were great for Diogo and Wolves for those three years and I never once saw the guy in a bad mood.\nThat hat-trick he scored against Leicester City and the exuberant smile he had afterwards when we got a picture together… unforgettable.\nI remember once I was in a hotel and all the (Wolves) players arrived. One of them had been dropped and didn’t say hello, but Diogo texted me to say he was coming, then he messaged me to say he was in the room and he’d come over. Little things like that just meant there was no distance between you and him, despite his status as a famous footballer.\nSome people can just be nice to your face, but for Diogo to consistently be like that as a person to everybody just speaks volumes.\nAdvertisement\nI spoke to a lady who did beauty treatments for his wife and they were saying he invited her and her son up to Jurgen Klopp’s last game. Tickets were going for thousands for that match, but he gave someone a memory that will last forever.\nWe stayed in touch after he left Wolves, which is rare in football as people just naturally move on. He invited me to a Champions League game against Milan and I was sat behind Paolo Maldini. Amazing.\nI’d messaged him the morning before he passed about his wedding, just saying what a great occasion it had looked like. He replied as he always did, saying thanks. He had so much life left to live. It’s so tragic to see all that life and happiness go in an instant.\nTim Spiers\nJack Walker, first-team communications manager at Liverpool and Wolves from 2017 to 2024\nWhen he first joined Wolves, none of us really knew who he was, but pretty quickly we could see he was the perfect fit for the Championship because he was quite a feisty young lad. We’d have little battles with him to get him to do stuff post-match at that time. He did it, but he had that anger and that fight needed in the Championship, and that carried on into the Premier League.\nI moved to Wolverhampton in November 2019 with my partner at the time, and not long after that came lockdown. My partner was a paramedic, so she was still working 12-hour shifts and I was stuck in Wolverhampton because there wasn’t an opportunity for me to go back home to Leek.\nI knew that Diogo was good at FIFA (now FC) just from little bits of filming we’d done with EA. You’d talk to other players and they’d say: “Oh, he’s good.” The Premier League started doing stuff with players being interviewed from home on Zoom, and then started the ePremier League, with all 20 clubs asked to find a player who would like to be involved.\nAdvertisement\nI just knew it was him straight away. He said he’d love to and then we started playing FIFA quite a bit.\nDuring the tournament, he’d test his tactics on me. He tried things like five at the back instead of four against me, to see if it worked. If it didn’t, we’d play again and he’d tweak the tactics. It was like that ahead of each round. He ended up playing something like five or six games to get to the final, all live on Sky because they had nothing else to put on!\nHe played Trent (Alexander-Arnold) in the final and beat him in the last minute of extra time. I remember being in my apartment and celebrating on the sofa because he’d won this trophy and it was live on the television. He never knew, but that was a big part of what got me through lockdown.\nWe’d chat through the headsets while we were playing and, sometimes, that felt like my main contact with the normal world. It was my first time living away from home and away from family, so it wasn’t an easy time, stuck in a different place on my own in an apartment with no garden, and that contact with him really helped me.\nIt was a massive thing and something I will never forget.\nHe left Wolves that September. When my own Liverpool opportunity came up, I went for an interview and was walking through the training ground with the person who is now my boss and bumped into Diogo in the players’ canteen. He came over and spoke to us and said: “He’s a good guy, he’d be a good person to have.” I’m not saying that what he said got me the job, but I’m sure it helped.\nWhen I started the job at Liverpool, working with all of these superstars, he was literally the only person at the club I knew. Straight away, I had the same little battles to get him to do interviews — but away from football, he was really friendly and helpful.\nTowards the end of last season, we chatted about his time at Wolves and how much he loved it there; about his favourite goals from that Championship season. It was clear how much he valued that period in his life and that summed him up really.\nAdvertisement\nHe was mad about snooker and darts. He was just the most British non-British football player you’d ever meet and he fitted perfectly into this country and the culture of football here.\nSteve Madeley\nMonica Ferreira, owner of Aromas De Portugal, a former coffee shop in Wolverhampton\nDiogo loved a Francesinha.\nIt’s the most famous sandwich in Porto — made up of meat, largely steak, with cheese and a thick sauce. Whenever he was eating in the evening at Aromas, he would order one.\nI’ll never forget the first time he came into the coffee shop. He was with Rute, and I couldn’t help but wonder what they were doing in Wolverhampton. They both looked so young. I presumed they must be studying, but then my husband told me it was Diogo Jota, a professional footballer for Portugal and Wolves.\nYou would never have known. He was so humble and polite. And just so nice to everyone and accommodating with his time.\nIt didn’t take long before people were queuing up to see him. He would visit with Ruben Neves and other members of the team, so the supporters wanted autographs and photos. Diogo was always the first person to say yes to a photograph; he never said no.\nAs I didn’t know anything about football, we never discussed his work. He liked to have a place in Wolverhampton where he could switch off. We laughed and joked together — sometimes because I was so busy. My father was a pastry chef, so when I moved to the UK in 2011, I wanted to run a coffee shop.\nSome weeks, we would make 30 to 60 cakes (pastel de nada) for the Wolves staff. I think it was Conor (Coady, the captain at the time) who would often come in to collect them.\nUsually, we closed the shop at 7pm, but occasionally Diogo asked us to stay open in private so the players and their families could eat together. Even then, he would finish his food and then sign autographs for those waiting outside.\nI have good memories of that time. Of seeing Diogo and Rute, so young but so close together… they were a lovely couple and clearly very passionate about each other. To me, he was just a normal, friendly customer.\nGregg Evans\n(Top photo: Robbie Jay Barratt – AMA/Getty Images)",
  "word_count": 2453,
  "scraped_at": "2026-02-14T01:55:17.421030",
  "_text_extracted": true
}