{
  "article_id": "fd7b9ce52550",
  "url": "https://allafrica.com/stories/202509190273.html",
  "title": "Liberia : Fassell Ready to Deliver for Liberia in CAF Champions League",
  "date": "20250919T120000Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Monrovia — The spotlight is firmly on FC Fassell as they prepare to represent Liberia on the grand stage of African Football\nOn Saturday, September 20, the Soccer Missionaries will take on Algerian Champions MC Alger in the first round, first leg of the CAF Champions League at the Samuel Kanyon Doe Sports Complex in Paynesville, outside Monrovia.\nThe mobilization has been extraordinary from radio promotions to street campaigns and community engagement, Fassell's leadership, headed by CEO Cassell Anthony Kuoh, has left no stone unturned in rallying support.\nFor Kush, this is more than just a match it's a mission to restore pride to Liberian football and prove that a club from Liberia can compete with Africa's elite.\nKeep up with the latest headlines on WhatsApp | LinkedIn\nPreparation has been equally deliberate. Fresh from a month-long training camp in Egypt, where they recorded three draws and one win, Fassell return home sharper, stronger, and unified.\nUnder the guidance of Bosnian Australian coach Amir Alagić, the Liberian champions are determined to convert months of planning, investment, and hard work into results on the pitch.\nThe squad is built for the occasion. Seasoned campaigners like Solomon Grimes and Zah Krangar bring valuable international experience, while the blend of homegrown talent and foreign reinforcements provides depth and balance.\nTogether, they represent not just Fassell, but the hope of an entire nation eager to see its football return to continental relevance.\nLiberia's history against North African clubs has been challenging just four wins and a draw in 16 attempts.\nYet the memory of Mighty Barrolle's famous 2-1 victory over Raja Casablanca in 1990 still lingers as proof that Liberian clubs can rise to the occasion.\nFassell now have the opportunity to script a new chapter.\nAt 3:30 PM on Saturday at the SKD, all eyes will be on the Soccer Missionaries.\nThe question is no longer whether they have mobilized or prepared it is whether they can deliver For Liberia, for their fans, and for their own dream of reaching the group stage, FC Fassell must now turn belief into history.",
  "word_count": 348,
  "scraped_at": "2026-02-14T02:12:04.364342",
  "_text_extracted": true
}