{
  "article_id": "fd90950567e1",
  "url": "https://www.fourfourtwo.com/competition/how-to-watch-brighton-vs-brentford-live-streams-tv-details-kick-off-time-for-premier-league-clash-of-the-birds-and-the-bees",
  "title": "How to watch Brighton vs Brentford : Live streams , TV details",
  "date": "20251122T140000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWatch Brighton vs Brentford in a battle for a top-half spot as Keith Andrews returns to Brighton, with FourFourTwo bringing you all the details on live streams and TV channels, wherever you are in the world.\n• Date: Saturday, 22 November 2025\n• Kick-off time: 3:00pm GMT / 10:00am ET\n• Venue: Amex Stadium, Falmer\n• TV & Streaming: Peacock (US), Stan Sport (Australia)\n• Watch from anywhere: Get NordVPN's Black Friday deal\nA little over a decade ago, Brentford head coach Keith Andrews spent a season on loan at Brighton & Hove Albion.\nThe Republic of Ireland midfielder had been deemed surplus to requirements at Bolton Wanderers and played one more season after his year with the Seagulls before jumping into a coaching career.\nTen years on, Andrews is in his first head coach role and overseeing a surprisingly smooth transition in a post-Thomas Frank world.\nRead on as FourFourTwo brings you all the information on how to watch Brighton vs Brentford online, on TV, and from anywhere.\nIs Brighton vs Brentford on TV in the UK?\nBrighton vs Brentford has fallen victim to the 3pm blackout in the UK, meaning no TV coverage or streaming at all.\nFor those not in the stadium, you'll have to tune into the radio, wait for highlights on Match of the Day or, if you're visiting the UK from abroad, use a VPN to access the coverage you usually enjoy back home.\nWatch Brighton vs Brentford in the US\nBrighton vs Brentford is one of this week's games available to stream live in the United States on Peacock.\nWatch the Premier League on Peacock\nPeacock had a price rise ahead of the new season, but with half of all Premier League games streaming live, it's still a decent investment for soccer fans, with plenty of content beyond that, too. $10.99 is the new monthly starting price.\nIs there a Brighton vs Brentford free live stream?\nThere are no dedicated free-to-air broadcasters showing the game but you may be able to watch Brighton vs Brentford by signing up for a free trial.\nAmazon Prime Video is currently offering a seven-day free trial of Peacock Premium Plus for users in the US. You can sign up, watch the game, and cancel if you don't think you'll get any lasting value from the offering.\nHow to watch Brighton vs Brentford in Australia\nPremier League fans in Australia can watch Brighton vs Brentford through Stan Sport.\nWatch the Premier League on Stan Sport\nWant every single Premier League live stream in one place, plus the Champions League? At AU$32 per month, Stan Sport is a steal for football fans down under. Just add the Stan Sport package to the base Stan plan and you'll be streaming the action within minutes.\nWatch Brighton vs Brentford from anywhere\nAway from home right now? You don't have to miss the game. The solution to your geo-restriction nightmares is a Virtual Private Network (VPN), a piece of software that can set your devices to appear to be in any country in the world.\nYou can use a VPN to unblock your usual streaming services while abroad, allowing you to connect and watch as if you were back home. You'll also get better playback quality and it will do wonders for your internet security – result!\nFourFourTwo’s tech-obsessed office-mates over at Tom's Guide know everything there is to know about VPNs, and they rate NordVPN as the best VPN you can buy.\n🥇 World's best VPN service\n✅ Fast, secure, huge location list\n➕ 3 months extra FREE\nSee also ► Premier League TV guide\nBrighton vs Brentford: Premier League preview\nThe Bees have won five and lost five in the Premier League this season, a record that looks all the more impressive after losing Frank in the summer along with Christian Norgaard, Mark Flekken, Bryan Mbeumo and Yoane Wissa.\nThere were doubts over Brentford's ability to replace each departee but they've achieved stability at the very least this season.\nBrentford being Brentford, most of that robustness is evident at home. Their only away win in the league this season was in mid-October, when goals from Igor Thiago and Mathias Jensen gave them a 2-0 victory at West Ham United.\nTheir opponents on Saturday are Brighton, one of five teams unbeaten at home in the Premier League.\nBrighton have won three and lost two of their five games at the Amex Stadium this season but have beaten Brentford only once in their last six meetings.\nBrentford won 4-2 last time they played the Seagulls. The scorers? Mbeumo, Wissa and Norgaard.\nThe visitors' first goal that day was scored by Danny Welbeck, his ninth of 10 last season. He has six already in 2025-26, putting himself in the conversation for a return to the England squad at the best possible time.\nAll of Welbeck's goals this season were scored in four of Brighton's last six matches and Brentford, who have conceded as freely this season as they've scored, will do well to keep him at bay.\nSee also ► These are the cheapest ways to watch the Premier League this season\nBrighton vs Brentford: Expected line-ups\nFourFourTwo's prediction\nBrighton 2-1 Brentford\nThis could be a close affair but FourFourTwo predicts a Welbeck goal, a Brighton win and a continuation of the Bees' struggle to replicate their home form away.\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1151,
  "scraped_at": "2026-02-14T02:28:55.396834",
  "_text_extracted": true
}