{
  "article_id": "fd93f9dc108c",
  "url": "https://theathletic.com/4777185/2023/08/18/rene-meulensteen-manchester-united/",
  "title": "Rene Meulensteen on United :  As soon as Sir Alex walked out of the door , it became a completely different animal  ",
  "date": "20230818T064500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“A friend of mine said to me: ‘Listen, Rene, it will take you two to three years before you come to terms with leaving.’ I didn’t believe him, to begin with. But he was right. It was so ingrained in me, such a big part of my life, so deep in my soul. At Barcelona, they say, ‘Mes que un club’ and it was exactly the same for me with Manchester United — it was more than a club.”\nAdvertisement\nIt doesn’t take long in Rene Meulensteen’s company to realise his affection remains undiminished for the club where he worked as one of Sir Alex Ferguson’s close allies.\nTen years after leaving Old Trafford, he is still living on the edges of the city. He has just written a book — United, Sir Alex and Me — that focuses largely on his time in the Premier League. His Dutch accent is beginning to fade. And it pains him that, in the decade since he and Ferguson left the club, the 20-time league champions have not contested a single title race while Manchester City, and one of two others, have had all the fun.\n“The analogy I use is, imagine living in a beautiful house for many years. You look after that house. You love living there. You spend every minute of the day there, because that’s your home. Then, one day, you leave. You can drive past your old house but it has been taken away from you. It has gone. You look through the window and, on the worst days, you can see how messy it is.”\nTo continue the analogy, Meulensteen is glad to see that Erik ten Hag has done a fair bit of tidying up since taking the job. No offence is meant to Ole Gunnar Solskjaer either, as an old friend and someone he regards highly.\nYet one of the more interesting revelations from Meulensteen’s book, published last week, is that he talked to David Gill, then United’s chief executive, four years before Ferguson’s retirement and told him the club’s “biggest challenge” was to put in place a fully coherent succession plan.\n“Unfortunately it didn’t work out straight away, bringing in David Moyes, and over the years the pressure has started to mount. That uncertainty rolls on to the next (manager), then the next, and the next and the next. Then, suddenly, it’s 10 years.”\nMeulensteen left the club in the embryonic stages of the Moyes era because it had quickly become apparent the new manager intended to take control of training rather than delegating it, as Ferguson had done, to the people who were already at the club.\nAdvertisement\n“I remember saying to him: ‘David, this is a great opportunity for you but it’s different here. With all respect for everything you have done at Everton, you’re going from a yacht to a cruise ship.’\n“I said: ‘Just go and sit in Fergie’s chair, let us get on with it, feel your way in and see how we do things.’ I’ve met David since, we’ve spoken and it has been fine. It was nothing more than him wanting to do it with his own people. David is very hands-on, very controlling. I was just gutted because the only thing I could envision was that it was not going to work.”\nSince then, Meulensteen has had a spell as Guus Hiddink’s assistant at Russian club Anzhi Makhachkala, as well as managerial roles with Fulham, then Maccabi Haifa of Israel and Kerala Blasters in the Indian Super League. In 2018, he was appointed as an assistant to Graham Arnold, Australia’s national team coach. He has had the role ever since and takes a lot of professional pride from helping the Socceroos navigate a way through the World Cup group stage in Qatar last year, winning two of their games for the first time in their history.\nBy his own admission, however, he found it hard to readjust after leaving the club where he was part of four Premier League titles, one European Cup, two League Cups and two other Champions League finals.\n“I worked in every department,” he says. “I started with the young nippers, when Danny Welbeck was 10 years old. I remember Marcus Rashford coming through the door when he was seven. Then I had a reserve-team slot, with players like Gerard Pique, Jonny Evans and Giuseppe Rossi, a fantastic team playing great football. And then there were six years with the first team.”\nMeulensteen’s role was to coach a group of serial champions and find ways to add even more to the performances of Cristiano Ronaldo, Wayne Rooney and all the other category-A footballers under Ferguson’s watch.\nAdvertisement\n“My mantra has always been: make players better,” he says. “Fergie used to say: ‘Listen Rene, everything you do in training will manifest itself in a game, good and bad.’ We expected world-class performances from those players three times a week. So we knew we had to give them world-class support. We put on thousands of training sessions and the biggest thing for me, something I am really proud of, is that I never had a player come to me and say: ‘That was rubbish’. The players always knew there was a purpose to our sessions.”\nWe will talk about the Glazer family’s ownership of the club, the years of drift since Ferguson’s retirement, some awkward background with Louis van Gaal and why Meulensteen thinks it is a shame that United do not involve more of the players who understand “the DNA, the culture and the identity” of what it means to represent this club.\nHe will also recall a conversation he had with Pep Guardiola, then Barcelona’s manager, in 2010 when he told the man who is now greedily accumulating trophies with Manchester City that, if he ever wanted to manage in England, he would be the perfect man to follow Ferguson.\nMeulensteen stands by that assessment, especially now City have done what many people once thought unthinkable and emulated United’s 1999 Treble. “The way he likes to play football, the way his mind works, his creativity, his tactical solutions, his attacking style of football, dominating opponents and creating chances, making things happen … put it this way, if he had been the one, I don’t think United would have gone 10 years without the league.”\nFirst, though, it is worth recapping Meulensteen’s input at Old Trafford and the training-ground qualities that made him one of Ferguson’s go-to men.\n“He knew the Premier League inside out, better than any of us,” says Meulensteen. “People compare him to Guardiola and Jurgen Klopp at Liverpool and, listen, I rate them both as great managers. But their starting position was completely different to Sir Alex in 1986 when he took over United and had to rebuild the club.”\nFerguson also knew the importance of delegating and entrusted Meulensteen and Mike Phelan to take charge of training once Carlos Queiroz, previously the assistant manager, had accepted the Portugal national team job. So, how did Meulensteen try to improve elite players?\nAdvertisement\n“The most important word in the coach’s vocabulary is ‘add’,” he explains. “I always used the word ‘add’, never ‘change’. I would never tell a player: ‘We need to change something in your game.’ Because the first thing that player would think is: ‘If you want to change me, what am I doing wrong?’ I’d always tell them I wanted to add something to their game. ‘Add’ is more.”\nCristiano Ronaldo, for one.\n“When I first talked to him, I asked him how many goals he had scored that season,” says Meulensteen. “The answer was 23. ‘So, how many next year?’ I asked. ‘Because I assume you want to do better.’ His target was 30. ‘I think you should score 40,’ I told him.\n“I wanted to change his mindset. For him, it was: ‘I want to score the winner and the most beautiful goal in the world’. I said to him, ‘Cristiano, you just have to score as many goals as you can, mate, those perfect goals will happen but the more variety you add to your game, the more you will keep that clicker going.’ Click, click, click. He had 30 goals by February and finished with 42 — amazing.”\nMeulensteen asks to borrow a pen and a sheet of paper and, for the next 10 minutes, he starts to recreate the plan that he devised with Ronaldo to set out in almost forensic detail every way possible they could help achieve his ultimate ambition of being a multiple Ballon d’Or winner.\nThey covered every facet of Ronaldo’s game, using colour-coded charts and a scale of one to 10, and Meulensteen also created a video, From Good to Great, as part of their work every day to study his performances and create a more rounded and phenomenal footballer.\nHis free-kick technique, for starters. “You might have noticed his run-up changed over time,” says Meulensteen. “I always felt his run-up was too straight. Anatomically, you cannot generate much power if you are lined up that way. So we talked over his technique. That’s where the two steps back, and one left, came in. If you look at the numbers, there are free-kick takers with a better success rate. But when they do fly in… perfecto!”\nAdvertisement\nOther players are also identified for special acclaim because of their dedication to improvement. Antonio Valencia, signed as Ronaldo’s replacement, is one. Nani and Diego Forlan are others. Javier Hernandez, too. “Chicharito improved a lot,” says Meulensteen. “He always played with his heart on his sleeve, but then he started to have a better understanding about when and where to pop up. He was brave as a lion. He was not the biggest but, bloody hell, he was strong.”\nMeulensteen’s book is filled with other stories about working with exquisitely gifted footballers such as Dimitar Berbatov — “one of the few people who could turn football into art” — and it puzzles him that United have not tapped into the knowledge of so many distinguished ex-players.\n“The only one who is involved is (technical director) Darren Fletcher,” he says. “We know what Gary Neville’s view is of the ownership, and that he will probably never do anything for Manchester United because of those views. But I have to say that someone like him, or Rio Ferdinand, could have played important parts. It’s a shame that has never been used or embraced, and never will be as long as this ownership is in place.”\nUnited’s shortcomings in the post-Ferguson era can be measured in all sorts of ways. Meulensteen recalls how the commercial obligations started to increase and the different demands that were put on the players.\n“Ed Woodward (then executive vice-chairman) and Richard Arnold (now chief executive) wanted to build United as a brand. When Fergie was there with David Gill, his attitude was: ‘Great, fantastic, as long as that (commercial) side is kept an arm’s length from us and doesn’t affect what we need to do.’ Then, as soon as Sir Alex walked out of the door, it became a completely different animal.”\nWhen United played Wolverhampton Wanderers at Old Trafford on Monday, there were protests against the owners before and during the game. For the next home game against Nottingham Forest, a sit-in is planned for the end of the match.\n“The biggest problem is there is no emotional connection between them (the Glazers) and the fans,” says Meulensteen. “Are they bad people? Are they criminals? No, absolutely not. After Fergie left, you can’t say they haven’t backed their managers, because they have spent over a billion pounds. But there’s no communication, no transparency. That is what annoys a lot of fans. Erik has established a connection with the fans but that needs to be backed up by the ownership.”\nAdvertisement\nPerhaps this comes back to the earlier point that the Glazers could have benefited from employing more of their former players who understand what works, and what doesn’t work, at a club with United’s size and traditions.\nOne passage in Meulensteen’s book explains why his impressions of Louis van Gaal are not particularly favourable. It was 2010. Van Gaal was the Bayern Munich manager and they had just eliminated United from the Champions League.\n“It was a bitter feeling and I wasn’t impressed by Van Gaal in the gaffer’s office afterwards,” Meulensteen writes. “I was pouring the wine as they both took a seat. ‘Do you know why we won the game?’ Van Gaal asked Sir Alex. ‘It’s because I gave a better team talk.’ I might have deliberately been a little energetic with my pouring of his wine – missing the glass and getting it over his trousers and shoes. ‘Sorry about that,’ I said, with much less polite words running through my head.”\nSo how did he feel when Van Gaal got the United job?\n“Straight away, I was concerned because he’s so rigid in his way of thinking. I don’t know whether he respected the Premier League enough. But more than anything, I knew his possession-based style was going to move away from what United stood for.\n“United is all about being gung-ho, tempo, speed, intensity, energy — not playing a chess game. I didn’t feel it was the right choice and when it panned out that way it wasn’t a surprise.”\nMeulensteen did wonder for a while whether Solskjaer might want to involve him when the Norwegian was given the job. The two men had got on well during their time together in Ferguson’s backroom staff. But nothing materialised. “It was a missed opportunity, I think, for both of us,” he says.\nAs for Ten Hag, it turns out that Meulensteen travelled to Germany in the period after leaving United to observe his fellow Dutchman coaching Bayern’s reserves. A few years later, Meulensteen took a call from Edwin van der Sar to sound him out about becoming Ten Hag’s assistant at Ajax.\nAdvertisement\nOne problem: Meulensteen had just accepted a role with Australia that involves preparing the team for matches and monitoring the form of their European-based players. “Edwin,” he replied, “you are the world champion of bad timing.”\nInstead, the man sitting here today, 60 on his next birthday, will continue following Ten Hag’s work from a distance and hoping, to use his analogy, that his beautiful old house will be fully refurbished soon. His affection for the club is obvious and, at some point, he will inevitably catch up with Ferguson for one of their occasional coffees in Wilmslow.\nIt was, says Meulensteen, the happiest of times. “I can remember vividly the hundreds of times I would sit next to him at a game. The full-time whistle went. Manchester United had won. He’d tap me on my knee. ‘Well done’. The satisfaction from that was all I needed.”\n(Photos: Daniel Taylor, Alex Livesey/Getty Images)",
  "word_count": 2493,
  "scraped_at": "2026-02-14T02:10:09.485648",
  "_text_extracted": true
}