{
  "article_id": "fd9cf1ca60ec",
  "url": "https://theathletic.com/4688057/2023/07/14/camp-nou-demolition-barcelona/",
  "title": "Camp Nou demolition : From Messi to U2 , our writer favourite memories of Barca iconic ground",
  "date": "20230714T051500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The partial demolition of the Camp Nou is well under way.\nThis week, dramatic images of Barcelona’s beloved stadium being knocked down were widely shared on social media — stirring strong memories for many football fans. The top level of the ground will be completely removed and replaced by a new upper tier as part of a €1.5billion-plus (£1.3bn; $1.6bn) redevelopment project known as Espai Barca, which is as controversial as it is spectacular.\nAdvertisement\nBarca will play their home games at the Estadi Olimpic Lluis Companys from this coming season while the revamp is taking place. President Joan Laporta previously said the club planned to be back at their iconic home for their 125th birthday in November next year, before revising his prediction to December 2024, but it is anyone’s guess when the project will be complete given the repeated setbacks it has suffered.\nGO DEEPER\nSpecial report: Inside the chaos and controversy of Barca's Camp Nou rebuild\nWhen Barca do return to the Camp Nou, it will look vastly different to before. With that in mind, The Athletic has asked its writers for their favourite moments from the old stadium…\nSpain 3-2 Poland, Olympic final, August 8 1992\nI was 11 and on holiday an hour away with my family when dad had the idea to go to the final at the Camp Nou. “Do you fancy it son?” I didn’t need asking twice.\nWe didn’t have tickets but an English tout spotted my Blackpool top and sorted us out — my old man was convinced they would be fakes.\nWhat a game followed. Poland gave as good as they got in a visceral atmosphere — taking the lead and then equalising with 15 minutes to go. Kiko then won it in injury time — and I’ve still not heard noise like it. Luis Enrique and Pep Guardiola played, and they’ve done OK since then. A night that will live with me forever.\nCraig Chisnall\nBarcelona 3-2 Real Madrid, Supercopa de Espana first leg, August 23 2012\nI’d love to tell the story my dad always told of Leeds United fans baiting Barcelona supporters by singing “Figo, Adios” while waving days after the Portugal winger’s transfer to Real Madrid. But I was not at the Camp Nou for that, given I was eight years old and had school the next day.\nMy only Camp Nou memory is one of my fondest in football. I was on holiday in Barcelona with my brother and mum. My brother and I realised the Supercopa de Espana first leg was on while we were there. We bought tickets wherever we could.\nAdvertisement\nIt was while visiting the facilities, a boiling hot concrete hellhole under the stand that stank of the urine of generations, that I heard the noise. Hatred was pouring out from the stands above me. I wanted to be out there to see it.\nGO DEEPER\nDerby days, Barcelona: El Clasico\nIt was the Real players running out. This was soon followed by complete love as Barcelona’s players followed. I’ve never heard anything like those two moments in a football stadium.\nThe game was great — a 3-2 thriller in which Barcelona took the advantage. The walk back to our hotel was incredible, a harrowing trip along Diagonal through a city that I didn’t know with my then-15-year-old brother.\nBut it was the sound of venom, heard while sweating from head to toe and being subjected to the stink of piss, that will stick with me forever.\nAmitai Winehouse\nBarcelona 2-1 Getafe, La Liga, March 19 2011\n“Don’t expect much from the atmosphere at the Camp Nou,” I was repeatedly told as I prepared to take my first trip to Barcelona in 2011. OK, fair enough. But I wasn’t really going for the atmosphere. I was going to see Guardiola’s Barcelona, perhaps the finest side of the modern era of the game, and Lionel Messi, perhaps the best player there has been.\nBut then something happened. Barcelona announced that left-back Eric Abidal had been diagnosed with liver cancer, and suddenly the tickets for the Getafe game — which seemed like they’d be easy to acquire — became like gold dust as Barca fans treated the game as an opportunity to show Abidal their support.\nAfter a mad goose chase around the city to get a couple, I arrived just about on time to experience what was, by all accounts, a wonderful occasion. Not for the football itself, which was largely flat aside from a brilliant Dani Alves goal, but for the tributes to Abidal.\nExperiencing a great atmosphere abroad is often about hostility, but this was about warmth and compassion, about genuine concern for a player who had been in great form that season, and about this being a family club that was also, at that point, the best in the world.\nMichael Cox\nAdvertisement\nBarcelona 3-0 Bayern Munich, Champions League semi-final first leg, May 6 2015\nGuardiola’s first return to Barcelona as an opposition coach was one of the great emotional struggles and tactical battles in European football history, as Pep’s Bayern Munich controlled Barca’s attacking triumvirate of Messi, Neymar and Luis Suarez for the first 77 minutes.\nMessi finally broke the deadlock with a low 20-yard effort past the previously unbeatable Bayern goalkeeper Manuel Neuer. But that was just the start — in Barca’s next attack, he almost cruelly twisted the defender Jerome Boateng inside out, then calmly lifted the ball over Neuer with his right foot.\nGO DEEPER\nHow Lionel Messi's body and brain help make him the world's best footballer\nIt was a phenomenal, unforgettable piece of individual skill from Messi, who at 27 was reaching the very peak of his powers. And it made total sense that the Argentinian had produced that kind of magic against Guardiola, who had done so much to mould him into the world’s greatest player.\nDermot Corrigan\nBarcelona 3-1 Leganes, La Liga, January 20 2019\nA few years ago, my girlfriend (and now wife) treated me to a trip to the Camp Nou. As we reached the stadium, team news dropped — Messi was on the bench.\nDisappointing as that was, it was almost surreal to see legends such as Gerard Pique and Sergio Busquets play, while Ousmane Dembele was near his electrifying best and opened the scoring. Luis Suarez, a fading force at the time, was his usual snarling self and riled up the Leganes goalkeeper Ivan Cuellar in the way only he can.\nBarcelona’s grip on the game didn’t look like loosening, leading me to think we would not see Messi at all. That was until another one of Barcelona’s favourite sons, Martin Braithwaite, equalised for Leganes before the hour mark. Messi was summoned moments after.\nHis 30-minute cameo probably doesn’t crack his top 250 career performances, but that didn’t make watching him any less mesmerising. He assisted Suarez to give Barcelona the lead before combining with Jordi Alba to score in injury time — a quintessential Messi goal that he had scored so many times before.\nAdvertisement\nThe joy of watching him made me spring to my feet almost involuntarily — a footnote to a footnote in Messi’s remarkable career, not a classic match or a glittering Barcelona display but without doubt one of my favourite football memories.*\n*Being an Everton season ticket holder means there isn’t much competition.\nRhodri Cannon\nBarcelona 2-2 Chelsea (Chelsea win 3-2 on aggregate), Champions League semi-final second leg, April 24 2012\nI was fortunate to attend the Camp Nou on many occasions thanks to Chelsea drawing them regularly in the Champions League — and nobody connected to the club will ever forget the second leg of the semi-final in 2012.\nWhile fans recall Fernando Torres sprinting clear with the freedom of the pitch to make it 2-2 on the night and 3-2 on aggregate a few minutes before the final whistle the most strong memory, for me, was the sight of Ramires chipping Barca goalkeeper Victor Valdes.\nChelsea were 2-0 down and down to 10 men when Ramires raced on to Frank Lampard’s pass. All hope for Roberto Di Matteo’s side was lost at that point. So for the Brazilian to have the audacity and confidence to produce such a finish under those circumstances was truly remarkable. Unforgettable. For a brief moment, it silenced the home crowd.\nIt was that goal, scored ahead of the interval, which gave Chelsea the belief to hang on in the second half to produce one of the greatest results in their history.\nSimon Johnson\nBarcelona 1-4 Salamanca, La Liga, May 15 1998\nNo school trip to Barcelona would have been complete without seeing a match at the Camp Nou.\nAlready crowned champions, Barcelona had an excellent side with the likes of Rivaldo, Luis Figo, Sonny Anderson, Guardiola, Miguel Angel Nadal… although only Anderson actually played given they’d already won La Liga weeks before.\nAdvertisement\nWith a vastly weakened team and nothing to play for, Barcelona were convincingly beaten 4-1 by a Salamanca team who finished 15th in La Liga.\nBeing naive — and daft — 15-year-olds, we thought it both sensible and fair to cheer for the away team given they were playing so well.\nWe hadn’t realised that the more ‘passionate’ Barcelona fans were on the tier above us. They made themselves known to us by jeering, then throwing rolls of toilet paper at us… and then throwing some rolls at us which were on fire.\nNo Rivaldo or Figo, but a very memorable game.\nSam Brown\nBarcelona 2-1 Atletico Madrid, Champions League quarter-final first leg, April 5 2016\nAs a Leicester City supporter, live Champions League games were not something I had experienced by the time I turned 16. So, when I realised Barcelona were playing Atletico Madrid in a quarter-final while I was there on a family holiday, I made sure to nag my dad for tickets.\nA tour of the Camp Nou would have more than sufficed but, when my dad told me and my brother that he’d managed to get three tickets, I couldn’t believe my luck. The game was probably the best I had seen at that point.\nI’ll never forget how I felt hearing the Champions League music in person for the first time or the match that followed: starting with a first-half goal and red card for Torres and finishing with a match-winning brace from Suarez. The sea of sunflower seed shells surrounding my feet at full-time was another first.\nAnd despite somehow watching Leicester face the same team at the same stage of the Champions League a year later, it didn’t make my first trip to the Camp Nou any less special.\nEd Mackey\nBarcelona 2-1 Getafe, La Liga, February 15 2020\nI had been lucky enough to see Messi play with Argentina on multiple occasions, but as the 2010s came to a close I had a distinct sense that time was running out to see him in full force, with Barcelona, at the Camp Nou.\nAdvertisement\nMy girlfriend (now my wife) Emily and I had a trip planned to Barcelona when she had a week off — I ensured a Barca home game was on the agenda. I’ll never forget entering what I, for decades from afar in the United States, had considered to be one of football’s most sacred grounds, and finding that in the concourse it was… fairly normal. Behind the times, even.\nI’ll also never forget when Emily, who isn’t a big football fan and has endured no small number of Major League Soccer games with me, turned to me five minutes in and said of Barca: “Uh… these guys are way better”.\nOur timing could hardly have been better: it was one of the last cool, fun things we did before Covid-19 shut down the world, and Messi only played two more home games with fans in attendance at the Camp Nou.\nAlexander Abnos\nBarcelona 3-2 Real Madrid (Barcelona win 5-4 on aggregate), Supercopa de Espana second leg, August 17 2011\nIt wasn’t the most spectacular match I’ve seen, but I remember this having an impact on me. Maybe because it was my first Clasico at the Camp Nou. 2011 was a year of pure adrenaline for Barca — especially in the clashes between Guardiola’s Barcelona and Jose Mourinho’s Real Madrid. Five were played that season alone.\nThe tension had reached a state of anxiety for the clubs, players and fans. That all came to a head in that year’s Supercopa and this second leg. In the 93rd minute, a strong challenge from Marcelo on Cesc Fabregas caused a touchline brawl. With players and coaches squaring up to each other, Mourinho poked Barca’s then-assistant coach Tito Vilanova in the eye.\nIt was a scarcely believable moment which was witnessed first-hand by Francesc Satorra, a club employee of 41 years who became known as ‘The Observer’ thanks to his role in the incident. He was captured between Mourinho and Vilanova and was the only person who noticed the eye poke in real time.\nAdvertisement\nAs Satorra told The Athletic, he had been preparing the winners’ medals in the tunnel when he heard shouting from the dugout and went to see what was happening pitch-side.\n“I saw Mourinho approaching,” Satorra said. “I let him pass and when he reached Tito, he stuck his finger in his eye and left. For a few milliseconds, it was not clear to me whether what I had seen was real.”\nEl Clasico has not reached those levels of intensity since then, for better or worse.\nLaia Cervelló Herrero\nU2 Vertigo tour, August 7 2005\nTruly spoilt for choice here. I have been there as a fan, way up in the gods, and I’ve sat in that press box so many times and reported on incredible, enthralling games in the Champions League — famous nights for Chelsea and Liverpool, midfield masterclasses from Xavi and Iniesta and, above all, mesmerising performances from Messi, whether it was his stunning four-goal display against Arsenal in 2010 or giving Boateng the slip and then dinking the ball over Neuer against Bayern Munich in 2015.\nBut this is a homage to the Camp Nou, rather than Messi, so I’ll venture into the personal and a sun-kissed evening in 2005 when my then-girlfriend and I went to see U2 on their Vertigo tour.\nQuite apart from being a brilliant gig — Bono’s voice was still holding up in those days — it was amazing to see the stadium from pitch level, looking up to those towering stands and imagining what it must be like to play for Barcelona. (Is there a better stage in world football? I don’t think there is.)\nPost-script: by the time we flew home, we were no longer boyfriend and girlfriend. Swept along by a blissful weekend, I had popped the question and Emma had said yes. And we all lived happily ever after.\nOliver Kay\nBarcelona 1-0 Inter Milan (Inter Milan win 3-2 on aggregate), Champions League semi-final second leg, April 28 2010\nA performance that defined an era. The “we didn’t want the ball” game. The ultimate Mourinho masterclass.\nAdvertisement\nFirst, let’s rewind a week. People forget how good Inter were in the first leg of this Champions League semi-final. Not enough credit is given to the boldness Mourinho showed in starting Samuel Eto’o, Diego Milito and Goran Pandev in a 3-1 win at San Siro; a trio of strikers and Wesley Sneijder as a No 10!\nInstead, Barcelona’s defeat in Milan is set in the context of a bus trip necessitated by a volcanic ash cloud. Excuses, excuses, excuses.\nThe established narrative made the tie out to be an ideological struggle between the purists and the anti-football crowd. But anyone who saw Busquets rolling around on the floor playing peekaboo to get Thiago Motta unjustly sent off after half an hour at the Camp Nou should be able to accept that the most lauded Barcelona team of all time was not above the gamesmanship and shithousery associated with Mourinho.\nGO DEEPER\nJose Mourinho exclusive: Inter’s treble-winning season 10 years on\nTo limit arguably the best team ever and a 22-year-old Messi to a single goal at home with 10 men for more than an hour was remarkable from Inter. “That goes further than tactics, further than the defensive organisation,” Mourinho told The Athletic in 2020. “That goes much more deep than that. It goes further than football. It goes to the human side of it.”\nWhen the full-time whistle blew, Mourinho pointed to the Inter fans up in the gods and ran onto the pitch. Barcelona, disgracefully, turned the sprinklers on (shithouses, again). “I didn’t even feel it,” Mourinho explained to us. Meanwhile in Madrid, Florentino Perez did feel something. The Real Madrid president felt Mourinho was his side’s best bet to stop Guardiola’s Barcelona. And that is how one of football’s great rivalries began.\nJames Horncastle\nBarcelona 3-1 Real Zaragoza, La Liga, November 17 2012\nMany people’s memories of Camp Nou will revolve around seeing Messi, perhaps for the first and only time. So apologies for adding to that list, but he and Barca and the Camp Nou remain inseparable in my mind.\nAdvertisement\nIt was over a decade ago now, for a La Liga game. The ground was full, the lights and weather were warm. People were drinking in bars outside the ground and it was everything I’d hoped the evening would be. Messi, for his part, stood still most of the time (as I now know is quite common and for good reason) with the eyes of the crowd on him. The only time he seemed to move was when he scored two goals.\nOne other, less celebrated memory of the stadium, is it being the background image of many games played on Championship Manager 99/00. The Camp Nou, Messi and CM 99/00: my perfect hat-trick.\nAlex Brodie\nBarcelona 1-2 Real Madrid, La Liga, April 21 2012\nYou can tell straight away sometimes when you walk into a room and the mood is just a bit… off.\nFor ‘room’ in this case read ‘stadium full of 90,000 people who, on some level, all knew that this was the end.’ It was the closing weeks of the 2011-12 season, which would turn out to be Guardiola’s last at Barcelona. He already had a little of that haunted, hollowed-out look, the look of a man who had been needled by Mourinho one too many times and had been generally battered by the experience of managing Barca.\nBut maybe they could reach deep down and pull something from somewhere, one last run for a once magnificent racehorse, to stop Real Madrid and Mourinho from becoming champions. As it turns out, they couldn’t: Messi was anonymous, Cristiano Ronaldo scored the winner and did that ‘calm down, I’m here’ celebration, and everyone around us was bereft but resigned to their fate. Like they knew all along that this was how the evening would pan out.\nIt was extremely strange, to be high up in the Camp Nou and watch this real ‘bucket list’ game, and for everyone around us to be so miserable. Throw in the realisation that this cathedral of football was actually a bit of a dump and even felt quite unsafe at times, and it all added up to a pretty surreal evening.\nNick Miller\nAdvertisement\nManchester United 2-1 Bayern Munich, Champions League final, May 26 1999\nWith Manchester United bidding for Treble immortality, there were scenes of near bedlam outside the Camp Nou before kick-off.\nA group of fans who had bought tickets through a travel agent, only to land and find out they were the victims of a scam, were being corralled by police on horseback. There was another jam of people at one of the gates around the stadium as security staff, eyes bulging, tore up tickets they claimed were forgeries.\nMy family and I didn’t fancy our chances of getting in, as our five tickets had been stolen by a pickpocket on the Metro not long after arriving. Our efforts to find replacements during the day had been futile and despair took hold. But then we saw a Manchester United executive who we’d spoken to about our plight that afternoon. He was selling tickets to others. My mum gave him a rollicking and, bashfully, he gave us his final three tickets.\nA United steward overheard what had happened and vowed to get all of us in. After a tour of the turnstiles with my dad, they found one operator willing to let us jump over. Bless those old-school entrances.\nOnce in, we hopped over a stairwell to the second tier and walked out to a breathtaking sight — the ground full with fans. Usually you only see a stadium fill up slowly. This was like suddenly coming across the Grand Canyon. Truly stunning.\nEveryone was standing up — probably 40,000 supporters, maybe more. It was chaotic joy. We were able to perch in front of a barrier. A Spanish steward tried to get us to sit down, but it was a thankless task.\nThe sun beat down on us and as darkness fell, magic happened. It was fitting that such a dramatic ending took place in a theatre of such epic proportions.\nLaurie Whitwell\n(Top photos, from left to right clockwise: Joan Valls/Urbanandsport /NurPhoto via Getty Images, Ben Radford/Corbis via Getty Images, Michael Regan/Getty Images, Vladimir Rys Photography/Getty Images)",
  "word_count": 3587,
  "scraped_at": "2026-02-14T01:53:51.862064",
  "_text_extracted": true
}