{
  "article_id": "fdc87723c5de",
  "url": "https://www.teamtalk.com/manchester-united/next-red-devils-manager-ratcliffe-leaning-towards-big-six-failure-former-chelsea-boss-revitalise",
  "title": "Next Man Utd manager : Ratcliffe  leaning toward big - six failure and former Chelsea boss to  revitalise  Red Devils",
  "date": "20240415T201500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nNext Man Utd manager: Ratcliffe ‘leaning towards’ big-six failure and former Chelsea boss to ‘revitalise’ Red Devils\nManchester United are reportedly ‘leaning towards’ experienced Premier League coaches such as Antonio Conte and Thomas Tuchel, as they look to ‘revitalise their technical direction’.\nWith every passing week, it seems more and more likely that Erik ten Hag will not be in charge at Old Trafford come the end of the season. Multiple reports have suggested the boss is on his last legs.\nTEAMtalk have exclusively revealed previously that several United players have lost faith in his methods and tactics.\nWhile the upcoming FA Cup semi-final gives cause for hope that there might be a somewhat positive end to the season, there will be disillusionment that of United’s last four league games, they have drawn three and lost the other.\nThat run was bookended by draws against Brentford and then Bournemouth – both sides that the might United should be turning over – and meant the Cherries received four points against Ten Hag’s side this season.\nIt’s also suggested that part-owner Sir Jim Ratcliffe is less than pleased with Ten Hag.\nHe has been unequivocal in his desire to return United to the heights of world football, and as such will not accept mediocrity in any area.\nAs such, he’s identified some big names to take over from Ten Hag, with reports suggesting the likes of Julian Nagelsmann, Tuchel and even Gareth Southgate having been identified as targets, and another big name has now joined that list.\nDON’T MISS: Ten Hag sack: Five left-field contenders to become next Man Utd manager analysed\nConte and Tuchel head United list\nAccording to reports in the Spanish media, United are ‘leaning towards more experienced coaches’ such as Tuchel and former Chelsea and Tottenham man Conte.\nThose men have of course both had decent spells with English clubs.\nTuchel was named the world’s best club coach in 2020/21, having guided Chelsea to Champions League glory, before winning the Club World Cup the following season.\nAlso with the Blues, Conte won the Premier League in 2016/17 and the FA Cup the following year.\nThat both men know how to win in England seems to be attracting Ratcliffe to them – that is something Ten Hag has not had other than last season’s League Cup.\nThe report also names Julen Lopetegui and Roberto De Zerbi on the list of coaches, with United looking to ‘revitalise their technical direction’.\nBut in the ‘crucial moment of transition’ it seems the more experienced pair of Tuchel and Conte are heading the list.\nBoth targets come with risks\nWhile that pair both know how to win both in England and in other countries – both have won at least eight trophies in their managerial careers – recent times have not been great for them.\nTuchel will be let go by Bayern Munich after failing to guide them to the Bundesliga this season – that allowed Bayer Leverkusen their first ever title, and ensured Bayern did not win the league for the first time since 2011/12.\nConte failed to build upon a fourth-placed finish with Tottenham in 2021/22, slipping way down the table the following season and being let go before they eventually came eighth.\nWhile both are seen as attractive options and both will be available – providing Conte is not snapped up by Napoli first – the risks that they do not return to dominance at United will be there after falling off somewhat.\nREAD MORE: Why Man Utd want to appoint Jason Wilcox as Ratcliffe revamp gathers pace",
  "word_count": 604,
  "scraped_at": "2026-02-14T01:54:34.170566",
  "_text_extracted": true
}