{
  "article_id": "fded6848bbba",
  "url": "https://metro.co.uk/2025/11/22/reece-james-update-chelsea-star-replaced-half-time-burnley-24778253/",
  "title": "Reece James update after Chelsea star is replaced at half - time against Burnley | Football",
  "date": "20251122T170000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca has explained why Reece James was replaced at half-time in Chelsea’s victory over Burnley.\nJames captained the side at Turf Moor in Saturday’s early kick-off but was replaced by Benoit Badilashile at the break with his side leading through Pedro Neto.\nThe 25-year-old was back out to watch the second-half from the dugout with Enzo Fernandez sealing a 2-0 victory that lifts the Blues to within three points of Premier League leaders Arsenal.\nJames has been left devastated by a series of major injury problems over the years but managed to stay injury-free for the second-half of last season with the club working hard to manage his fitness.\nThe skipper has remained fit this term, featuring in all 12 league matches and starting eight of them.\nChelsea have a huge game against Barcelona in the Champions League midweek before they host Arsenal at Stamford Bridge next Sunday.\nSpeaking after the win at Burnley, Maresca said his half-time change was pre-planned, made with one eye on those fixtures.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘The idea was especially to manage Reece (James), it was a plan for him to play 45 minutes,’ Maresca said in his post-match press conference.\nMoises Caicedo did not start for Chelsea on Saturday with Andrey Santos selected ahead of him, turning in an excellent midfield performance that won hm the man of the match award.\nMore Trending\nCaciedo played the full 90 minutes for Ecuador against New Zealand and Canada during the international break before making the long trip back to the capital on Thursday.\nSpeaking ahead of kick-off, Maresca explained: ‘The reason he is not in the first eleven is that came back Thursday night from Ecuador, from the national team, then just a light session with us yesterday, and the reason he is not playing is that it is impossible. To protect him a little bit.’\nWesley Fofana was also left out after a recent run in the team. Explaining his absence, Maresca said: “Just to manage him and protect him a little bit.\n‘He is playing, he is good and he is fit and we are very happy with that.’\nMORE: Birmingham City ‘want second team’ to play at new £1.2bn ‘Powerhouse’ stadium\nMORE: Viktor Gyokeres ‘will be fit’ but Tottenham star will ‘control’ Arsenal striker in derby\nMORE: Burnley 0-2 Chelsea: Neto and Fernandez fire Blues to second in the Premier League",
  "word_count": 450,
  "scraped_at": "2026-02-14T02:27:05.522367",
  "_text_extracted": true
}