{
  "article_id": "fe08bd32b840",
  "url": "https://www.caughtoffside.com/2025/08/27/premier-league-striker-newcastle-united-move/",
  "title": "Newcastle United receive boost in pursuit of Jorgen Strand Larsen",
  "date": "20250827T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to The Athletic, Wolverhampton Wanderers remain determined to keep hold of striker Jorgen Strand Larsen despite strong and persistent interest from Newcastle United.\nThe Magpies recently returned with an improved bid worth £55 million, but Wolves swiftly rejected the offer and maintain that the Norwegian international is not for sale.\nStrand Larsen, 25, has become one of Wolves’ most influential players since his arrival from Celta Vigo. The powerful forward has impressed with his goal scoring quality and physical presence.\nHe managed to score 14 Premier League goals for Wolves last season.\nWolves are not ready to sell Jorgen Strand Larsen\nWolves see him as central to their project and are reluctant to sanction a departure, particularly so late in the transfer window when finding a replacement would be difficult.\nWhile Strand Larsen himself is not actively agitating for a move away from Molineux, The Athletic reports that he is keen on the opportunity to join Newcastle.\nThe player is understood to be excited by the prospect of playing Champions League football and competing at the top end of the Premier League, something Newcastle can realistically offer in the future.\nNevertheless, he has not forced the issue, respecting Wolves’ stance and continuing to give his full commitment on the pitch.\nNewcastle United are desperate for a new striker\nThe pursuit of a striker remains one of the key priorities in the final days of the window for Eddie Howe and his team.\nAlexander Isak’s future is the subject of speculation on a constant basis since the striker has made it clear that he has no interest in playing for the Magpies again and is agitating for a move to Liverpool.\nStrand Larsen is being seen as a player who could potentially replace Isak at St. James’ Park.\nWolves, however, are digging their heels in. The rejection of £55m shows their resolve, and unless Newcastle return with an extraordinary offer, the Norwegian is expected to stay put.\nWhat Alexander Isak has told his Newcastle United teammates about his future",
  "word_count": 339,
  "scraped_at": "2026-02-14T01:52:36.766600",
  "_text_extracted": true
}