{
  "article_id": "fe22e0175fcc",
  "url": "https://www.barcablaugranes.com/cant-del-blog-barcelona-opinion/108916/what-to-look-forward-to-at-barcelona-in-2026",
  "title": "What to look forward to at Barcelona in 2026",
  "date": "20260101T161500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Happy New Year! Welcome to 2026, a year in which Barcelona will aim to add more trophies to their collection and continue to thrill us with Hansi Flick’s very own brilliant brand of football.\nWhat to look forward to at Barcelona in 2026\nWhat will the next 12 months bring for the Catalan giants?\nThere’s plenty coming our way to look forward to so let’s dive right in and have a look.\nMore trophies?\nBarcelona head into 2026 with a four-point lead at the top of the table, a place in the last 16 of the Copa del Rey and work to do in the Champions League. The Spanish Super Cup is also on the horizon and Flick’s side will be hoping at least some of those trophies are in their cabinet at the end of the season.\nLa Liga looks like being another interesting title race. Real Madrid endured a tough end to 2025 and question marks remain over manager Xabi Alonso. It would be no surprise at all if he didn’t last the season, and any managerial change could well affect the team’s form.\nOf course the Champions League is probably the one trophy Barca want the most of all. However, performances in the competition so far this season haven’t been completely convincing and a play-off may need to be negotiated before Barca can take their place in the next round.\nThe return of Gavi\nBarcelona have been without Gavi since August due to another knee injury that subsequently required surgery and ruled him out for five months. The news was a really devastating blow to the midfielder, particularly after he’d worked so hard to return after his ACL injury, but he is due back in February or March. After another long lay-off it’s not clear how much of Gavi we’ll see for the rest of the season, but he’s vowed to return at “100%” and is guaranteed a huge reception when he does make it back out onto the pitch.\nWorld Cup 2026\nWorld Cup 2026 will take place in the summer in North America, Canada and Mexico and will see a whole host of Barcelona stars in action. The Spain squad in particular will be packed full of Barcelona players and will be among the favourites for victory. Lionel Messi’s Argentina were crowned champions in 2022 but could Lamine Yamal guide Spain to victory this time around?\nYamal vs Messi in the Finalissima\nAnd while we’re at it, we will see Yamal come up against Messi for the first time on the pitch in March when La Finalissima takes place. European champions Spain will come up against the South American champs in Qatar in what promises to be a fascinating match-up between the two sides.\nLa Masia to deliver again\nLa Masia has proven again in recent years that it is the gift that keeps on giving and will surely deliver more talents to Barca’s first team in 2026. Jofre Torrents, Xavi Espart, Ibrahim Diarra and Dro Fernandez are the youngsters closest to the first team right now but there’s a host of other exciting talents behind them - such as Ebrima Tunkara and Sama Nomoko - who will be worth keeping an eye on throughout 2026.\nMore Marc Bernal\nMarc Bernal has been used sparingly in the first half of the season which is no real surprise given the amount of time he’s missed after undergoing surgery.\nYet the feeling is he’s likely to see more game time in the second half of the campaign which is an exciting thought for Barcelona fans.\nWe’ve all see Bernal’s potential and know just how good a player he can hopefully become at Barcelona. The next few months should hopefully offer the youngster more chances to show what he can do and stake a claim for a regular spot in Hansi Flick’s side.\nTransfers!\nBarcelona will undoubtedly be linked with hundreds of players yet again in 2026 but are expected to make some moves in the summer transfer market. There’s plenty of talk about a new center-back right now, while a new striker to take over from Robert Lewandowski may well be on the agenda. And Barcelona will also have to make a decision on Marcus Rashford. The Manchester United loanee has posted some good numbers so far this season, and Barca do have the option to make the transfer permanent, but it’s still not clear if he will continue past the end of the current campaign.\nWhat are you looking forward to seeing most at Barcelona in 2026? Share your thoughts in the comments below!",
  "word_count": 768,
  "scraped_at": "2026-02-14T01:59:31.500826",
  "_text_extracted": true
}