{
  "article_id": "fe31ae48f574",
  "url": "https://www.96fm.ie/news/entertainment/rte-announces-new-year-schedule-packed-with-fan-favourites-and-brand-new-series/",
  "title": "RTÉ announces New Year schedule packed with fan favourites and brand - new series",
  "date": "20251229T133000Z",
  "domain": "96fm.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "TÉ has unveiled its New Year schedule, featuring a wide mix of fan favourites and new programmes designed to entertain, inform and intrigue audiences.\nViewers can expect distinctly Irish entertainment, brand-new home-grown drama and gripping sporting moments.\nThe schedule also includes new documentaries and live specials across television and radio, ensuring there is something for everyone from the broadcaster this New Year.\n(RTE)\nTommy Tiernan | The Tommy Tiernan Show\nOn RTÉ One and RTÉ Player, the inimitable Tommy Tiernan returns with a brand-new series of The Tommy Tiernan Show, airing for sixteen Saturday nights from 3 January.\nNow in its tenth series, Tommy once again comes face-to-face with guests without any prior knowledge of who will appear on the show.\nAs ever, he delivers thoughtful, insightful and often surprising conversations with whoever takes a seat opposite him.\nDancing With The Stars\nFamily favourite Dancing with the Stars returns on Sunday 4 January for its ninth season, with brand-new Head Judge Oti Mabuse bringing extra sparkle to the ballroom.\nThis season’s line-up includes familiar faces such as Niamh Kavanagh, Paudie Moloney and Rose of Tralee Katelyn Cummins, all hoping to lift the coveted glitterball trophy.\nPatrick Kielty\nFollowing The Late Late New Year’s Eve Special on 31 December, Patrick Kielty returns with The Late Late Show on Friday 9 January 2026, with the very first Late Late Show Trad Special.\nThe programme marks the first full episode dedicated entirely to Irish traditional music, with what promises to be a session to end all sessions.\nPatrick will be joined by some of Ireland’s finest musicians, international guests and one legendary performer set to be inducted into the Late Late Show Trad Hall of Fame.\nDermot Bannon\nThis New Year, Room to Improve sees Dermot Bannon take on homes of every size and condition, helping families downsize, upsize or find the right fit for their next chapter.\nStarting on Sunday 4 January, Dermot’s bold architectural vision once again clashes with the practical realities laid out by quantity surveyor Claire Irwin.\nThe new series features untouched time capsules and inventive urban redesigns, including a 1990s three-bed semi-detached home in West Dublin, a “bungalow bliss” project in Co. Meath, a four-bed family home in Raheny in need of transformation, and a compact terraced house in Harmonstown with big ambitions.\nOn The Beat\nA new series of On the Beat arrives this January, offering unprecedented access to the work of An Garda Síochána across Ireland.\nFilmed over six months and airing on Monday 5 January, the docuseries goes behind the front desks, inside control centres and out on patrol with Gardaí in Limerick, Monaghan and Waterford, providing insight into policing in both urban and rural communities.\nAny Given Day: Cork University Hospital airs on Wednesday 7 January at 9:35pm on RTÉ One and RTÉ Player, delivering a powerful new six-part documentary series that goes beyond the headlines inside one of Ireland’s busiest hospitals.\nAny Given Day: Cork University Hospital\nThis landmark observational series offers rare access inside Cork University Hospital (CUH), capturing the round-the-clock work of thousands of professionals delivering vital care.\nThrough the stories of staff and patients alike, Any Given Day presents a compelling portrait of a health service in action.\nHigh Road, Low Road\nHigh Road, Low Road returns in January, taking viewers across Europe and beyond.\nFrom the snowy mountains of Austria to the sunny shores of Cape Town, Irish celebrities travel to unforgettable destinations.\nAcross nine episodes, mismatched celebrity pairings head off on two very different holidays.\nWhile one enjoys a luxury, first-class experience, the other explores the same destination on a tight budget.\nExpect memorable adventures, cultural discoveries and plenty of fun.\nFirst Dates\nAs spring approaches, romance returns as the First Dates restaurant reopens for another season on RTÉ2.\nWith smouldering attraction, secret passions, bold banter and jaw-dropping revelations, a new group of hopeful singletons arrive in search of love.\nOn hand as always are Maître D’ Mateo, table angels Alice and Pete, and Neil, the world’s friendliest barman, offering guidance, comfort and plenty of insight.\nSpring Highlights\nSpring 2026 will also see RTÉ Investigates examine mental health services in Ireland in a new two-part series airing in February.\nAlso coming soon is The Ryanair Story, a two-part documentary charting the airline’s rise from a single route to becoming a global aviation giant.\nMuseum of Me arrives in spring, with host Dermot Whelan inviting well-known Irish public figures to curate their own personal museum exhibitions using treasured possessions filled with memories.\nFeatured guests include Pat Shortt, Maia Dunphy, Bryan Dobson, Mary McEvoy, Emma Doran and Steve Garrigan.\nIrish Drama\nRTÉ continues its commitment to Irish drama, with nine drama productions filmed in 2025, delivering 142 hours of home-grown storytelling that will continue to air throughout 2026.\nNew comedy-drama These Sacred Vows makes its debut this spring. Starring Tom Vaughan-Lawlor, Justine Mitchell and Jason O’Mara, the six-part series opens the morning after an Irish wedding on a Spanish island, when a priest is found dead in a villa swimming pool.\nFilmed in Tenerife, the series revisits the events of the previous week through different character perspectives and is written and directed by award-winning Irish screenwriter John Butler.\nSisterS returns for a second series, picking up eighteen months after Sare abandoned her sister Suze.\nWhen an invitation to Sare’s wedding arrives, Suze travels to Canada, triggering chaotic drama, long-buried secrets and unexpected revelations.\n(RTE)\nFair City promises another action-packed year in 2026, with Paul facing the consequences of his wine theft, Mondo awaiting a court decision and Gwen uncovering a life-changing family secret.\nSeries 3 of The Dry arrives in spring, as the Sheridan family confronts a major secret that threatens to unravel already fragile relationships.\nSport\nThe sporting New Year begins with the return of the Champions League to RTÉ2 and RTÉ Player on Wednesday nights in January, including Liverpool’s clash with Marseille on 21 January.\nIn international football, the Republic of Ireland face Czechia in a World Cup play-off semi-final on 26 March, with a potential final on 31 March.\nThe Allianz Leagues in Football and Hurling also return in January, with Kerry and Cork aiming to defend their titles, including Tipperary versus Galway on Saturday 24 January.\nRTÉ Player\nRTÉ Player also offers a strong line-up this New Year, including The Affair, Ray Donovan, classic sitcom Frasier, The Hunting Wives, Traces, Devil in Disguise: John Wayne Gacy and Series 6 of Unforgotten.\nLooking ahead to spring, The Vampire Diaries joins the platform, bringing supernatural drama to RTÉ Player viewers.\nNew to RTÉ KIDS and RTÉ KIDSjr\nBeddybyes as Gaeilge\nBest friends MeMo and BaBa travel across the remarkable Planet Beddybyes, meeting new and familiar faces on their mindful and soothing journey to bedtime. Airing from 19 January, weekdays on RTÉ KIDSjr.\nMortina\nA young zombie detective, together with her delightfully quirky Mystery Squad – an elegant albino greyhound, a know-it-all cousin, and two alive-alive friends – takes on the strangest, spookiest, and most exciting mysteries inside the wonderfully eerie Crumbling Manor. Airing from 26 January, weekdays on RTÉ KIDS.\nGoat Girl as Gaeilge\nA quirky coming-of-age comedy about Gigi, who is raised by goats, tackling her biggest challenge: surviving school and making human friends. Airing in March, weekdays on RTÉ KIDS.\nAdam Loves Adventure\nLate Late Toy Show hero Adam King is back this February, starring as a problem-solving space-explorer whose prime-directive is to bring laughter and fun to the farthest reaches of space! The programme will also be airing as Gaeilge in March on RTÉ KIDSjr.",
  "word_count": 1260,
  "scraped_at": "2026-02-14T02:09:38.444910",
  "_text_extracted": true
}