{
  "article_id": "fe764db5d27a",
  "url": "https://impactnottingham.com/2023/02/champions-league-round-of-16-preview-how-may-the-english-teams-fair/",
  "title": "Champions League Round Of 16 Preview : How May The English Teams Fair ? ",
  "date": "20230215T201500Z",
  "domain": "impactnottingham.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Matthew Boyd\nBefore discussing the matchups for the four English teams in the competition, it is important to note that these are the first Champions League games for three months. During this hiatus from the competition, there has been an incredible amount of football, including the World Cup, of course. As a result, the forms and fortunes of managers, players, teams, and even clubs have changed dramatically since the end of the Champions League group stages. Matthew Boyd takes all this into account and preview Europe’s top ties.\nAC Milan vs Tottenham Hotspur\nDate: Tuesday 14th February, 8pm.\nLocation: San Siro, Milan.\nThough all four teams were in the mix going into the last two matchdays, Tottenham ended up winning their Champions League group, ending with an impressive away win at Marseille on Matchday 6. Following consecutive 4-0 victories against RB Salzburg and Dinamo Zagreb, Milan were relatively secure in their second-place finish.\nHowever, much has changed for both teams since November. Tottenham’s league form has been pretty average, with them currently sitting in fifth. Recent evidence of their inconsistency can be seen through the last two matches, with the first an impressive 1-0 victory against Manchester City, and then getting a 4-1 thrashing off of Leicester City.\nOne benefit for Tottenham is the form of Harry Kane. Kane is second in the race for the golden boot, with 17 in the league and 19 in all competitions. However, it has recently been confirmed that Hugo Lloris is set for a spell of at least six weeks on the sidelines, following a knee injury. The absence of their club-captain will surely be significant.\nFurther, it is worth remembering that despite his successful managerial career, Antonio Conte’s Champions League record is notoriously poor, having only got past the Round of 16 once.\nManager Pioli, who was hailed a hero less than nine months ago, could now lose his job\nAC Milan have really struggled since the World Cup. They have only won two games in 2023 and have lost their last four of their last five. This has seen last season’s Serie A champions slide down to fifth in the league, now 15 points off the top spot. Manager Pioli, who was hailed a hero less than nine months ago, could now lose his job. However, they won last time out against Torino, and the return of the Champions League may provide respite from their domestic woes.\nPrediction: 1-1 – despite Milan’s poor form, Tottenham would most likely settle for a draw in the away leg of the tie. This would put them in a strong position for the return leg at the Tottenham Hotspur Stadium.\nBorussia Dortmund vs Chelsea\nDate: Wednesday 15th February, 8pm.\nLocation: Signal Iduna Park, Dortmund.\nChelsea travel to Germany in what looks like an intriguing contest. Chelsea won their group, finishing with an impressive 13 points. Dortmund were fairly comfortable in second place, finishing behind only Manchester City. This will be the first time ever that the two face-off in the Champions League.\nDortmund are currently on a red hot-streak of six wins in a row, scoring 20 goals in the process. They currently sit third in the Bundesliga, but are only three points off the leaders, Bayern Munich. Edin Terzic has been impressive in his first full managerial role. Still at only 19 years of age, Jude Bellingham is now the talisman at Dortmund. With four goals in five Champions League games this season, Chelsea’s trip to Dortmund is another opportunity for Bellingham to attract a variety of Premier League suitors.\nThis extremely motivational and heart-warming story is one of many positives currently at Dortmund\nOn a brief side note, Sebastian Haller – the ex-West Ham forward – has recently made a scoring return to the first team squad, having won his battle with testicular cancer. This extremely motivational and heart-warming story is one of many positives currently at Dortmund.\nThere is a lot to say about Chelsea. Todd Boehly, the new billionaire owner of the club, has staggeringly spent over £500 million since taking over from Roman Abramovic. Most recently, Chelsea bought the promising Enzo Fernandez from Benfica for a Premier League record fee of £105 million on the deadline day of the January transfer window.\nHowever, sitting 10th in the Premier League, Chelsea are massively underperforming. They have only won one game in 2023 and have failed to score in four of the last seven in all competitions. While they have acquired exciting attacking players, such as Mykhailo Mudryk and Joao Felix, Chelsea still lack an out-and-out goalscorer.\nFurther questions surround Graham Potter’s ability and pedigree as a top-class manager, with the Chelsea job a major step up from his stations at Brighton, Swansea, and Östersunds FK. The knockout stages of the Champions League is very much new territory for Potter and may be too much of a challenge. However, this game offers another opportunity for Chelsea to gel, and could mark the beginning of an exciting new era if they are successful.\nPrediction: 2-1 – Home advantage and their extremely impressive form make it difficult to go against Dortmund in this one, particularly against a currently underwhelming Chelsea.\nLiverpool vs Real Madrid\nDate: Tuesday 21st February, 8pm.\nLocation: Anfield, Liverpool.\nWith 14 European Cup titles between them, Liverpool vs Real Madrid is a clash of true European heavyweights. In recent years, Liverpool and Real Madrid have faced off in the 2018 and 2022 finals, with Real Madrid coming out victorious on both occasions.\nIn fact, the two teams have met nine times in competitive fixtures, with Liverpool only coming out on top three times, and not since 2009. While Real Madrid won their group with 13 points, Liverpool accumulated 15 points, coming second only by goal-difference to Napoli.\nThis current team is unrecognisable from the team that reached the Champions League final last year\nIn spite of their recent Merseyside Derby victory, Liverpool are out of sorts. They have won only one of their last six in the league, and still sit in ninth. Having been plagued with injuries all over the pitch, notably to Luiz Diaz, Diogo Jota, and Virgil Van Dijk, this current team is unrecognisable from the team that reached the Champions League final last year.\nMohamed Salah’s form has dipped dramatically, and the big money signing of Darwin Núñez has failed to come to fruition yet. Klopp is looking increasingly devoid of answers, with some suggesting that now may be the natural time for him to move on.\nHowever, there is something special about Liverpool and this competition. Anfield on Champions League nights is famed for its remarkable atmosphere, and it’s clear the fans will play a momentous role if Liverpool are to get anything out of the game.\nReal Madrid share Liverpool’s domestic woes, to a certain extent. They have only won two out of five in the league in 2023 and were beaten in the Supercopa de España final by Barcelona. Madrid have slipped to 11 points behind the Blaugrana, an amount which looks insurmountable at this stage.\nReal Madrid have their own injury problems, with talisman and Ballon D’or winner Karim Benzema still struggling to put a run of games together. For all their success and brilliance in recent years, Madrid’s manager and main core of players look to be past their best.\nNevertheless, it is important to remember that they are current European champions for a reason, and on their day possess more than enough quality to beat a poor Liverpool side. Vinicius Junior continues to star for Madrid, and it is likely that he will play an important role in this fixture.\nPrediction: 1:2 – while Real Madrid may not be in the best of form, Liverpool are in a real mess. The task facing Liverpool is too great, even for Anfield’s undeniably special atmosphere.\nRB Leipzig vs Manchester City\nDate: 8pm, Wednesday 22nd February, 8pm.\nLocation: Red Bull Arena, Leipzig.\nWhat initially looked like a favourable tie for Man City had been made more complicated due to developments, both on and off the pitch, in recent weeks. RB Leipzig have had a very impressive Champions League campaign so far, narrowly finishing second in their group to current holders Real Madrid. Knockout qualification was routine for City, as they won their group by five points.\nLeipzig are no push-overs. Fourth in the Bundesliga and only four points behind Bayern Munich, Marco Rose’s side are in fine form. Remarkably, they recently lost for the first time since the 17th of September.\nWith Chelsea-bound Christopher Nkunku out injured, Dominic Szoboszlai has been one of many impressive players for Leipzig in recent weeks. The dangerous Hungarian attacking midfielder has got over 10 goal contributions in 18 Bundesliga games this season.\nLeipzig beat City at home in the group stages two seasons ago and will be hoping to do the same this time around\nWhile many of Leipzig’s star players in recent years have moved on to ‘bigger’ clubs, with Nkunku the latest, they are an impressive team, and will cause City serious problems, especially at home. Leipzig beat City at home in the group stages two seasons ago and will be hoping to do the same this time around.\nOn the pitch, City have not been their usual, imperious self in recent weeks. While they were very disappointing in a recent loss to Tottenham, they responded by beating Aston Villa on Sunday. Currently, they are three points off the top spot, having played a game more than Arsenal. The Champions League is the ‘holy grail’ for Pep Guardiola and City.\nCity have never won the competition, and Guardiola has not been victorious since 2011. One of the signings who was intended to change their fortune in this competition is Erling Haaland. He has scored a staggering 28 Champions League goals in only 23 games and has netted 25 times in the Premier League this season already. However, even he has struggled in recent weeks, with concerns raised over how he may negatively affect the fluidity of City’s attack.\nThe recent allegations made by the Premier League against City could prove disastrous for the club if legally confirmed to be true. In an investigation four years in the making, they face over 100 allegations of Financial Fair Play breaches and are also being charged with refusing to cooperate with the Premier League on these matters. This is less than ideal preparation for their long-awaited Champions League tie.\nHowever, Guardiola has confirmed his unwavering commitment to the club and the hierarchy, in what is sure to have boosted morale. City still have an incredibly strong squad and remain the favourites for the competition.\nPREDICTION: 1:2 – While this tie will be very complex for City to navigate, their quality means they should just pip Leipzig in this one.\nMatthew Boyd\nFeatured image courtesy of Janosch Diggelmann via Unsplash. Image use license found here. No changes were made to this image.\nIn article image 1 courtesy of @bvb09 via Instagram. No changes were made to this image.\nIn article image 2 courtesy of @liverpoolfc via Instagram. No changes were made to this image.\nFor more content including uni news, reviews, entertainment, lifestyle, features and so much more, follow us on Twitter and Instagram, and like our Facebook page for more articles and information on how to get involved.\nFor further sports content and ways to get involved, follow @ImpactSport on Twitter and Instagram, and like the Impact Sport Facebook page!",
  "word_count": 1921,
  "scraped_at": "2026-02-14T01:59:41.710751",
  "_text_extracted": true
}