{
  "article_id": "fe7ceae1d9d0",
  "url": "https://theathletic.com/5105028/2023/12/01/onana-ten-hag-man-utd-cameroon-afcon/",
  "title": "Erik ten Hag says Manchester United in talks over Andre Onana potential AFCON participation",
  "date": "20231203T000000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag has said that Manchester United are “in talks” to allow goalkeeper Andre Onana to play for Cameroon in the upcoming Africa Cup of Nations (AFCON).\nThe 27-year-old, who signed for United from Inter Milan in the summer, played in Cameroon’s 2026 World Cup qualifier against Mauritius last month. The Athletic have reported that he is yet to make a definitive decision regarding his participation in AFCON, scheduled from January 13 to February 11 next year.\nUnited’s manager Ten Hag said: “When they call him, he has to go. But we are in talks.”\nAdvertisement\nSources close to Onana have previously suggested that his hesitation in representing his country is linked to a strained relationship with Samuel Eto’o, the president of the Cameroon Football Federation (Fecafoot).\nOnana’s retirement from international football last year followed a disagreement with Eto’o during the World Cup, leading to disciplinary action and his subsequent exclusion from the squad. However, his recent recall to the national team has reignited discussions about his international commitments.\nWhile FIFA’s regulations on the status and transfer of players (RSTP) indicate that players are generally obliged to “respond affirmatively” to national team call-ups, Onana’s case presents a unique challenge. The rules do not appear to legislate for his specific situation where a player has informed their association they no longer want to be selected at international level but they get called up anyway.\nUnited say that although the choice to represent his country at AFCON rests with Onana, they will support him in whatever decision he takes. The club are actively engaged in discussions with Cameroon, as mentioned by Ten Hag, to guarantee alignment among all parties, ensuring a clear understanding of each other’s perspectives. There is a strong desire to avoid a conflict with Cameroon over the situation.\nGO DEEPER\nExplained: Onana's AFCON dilemma and what it means for United\nShould Onana decide to participate in AFCON, he is likely to be absent for a minimum of four Premier League matches, including home fixtures against Tottenham Hotspur and West Ham United, as well as away games against Wolverhampton Wanderers and Aston Villa. Additionally, his potential involvement for the FA Cup third round on the weekend of January 6-7 remains uncertain.\nThe AFCON commitment could also cast doubt on Onana’s availability in an FA Cup fourth-round tie on the weekend of January 27-28 and may impact his participation in the first Champions League last-16 ties scheduled for Tuesday, February 13 — just two days following the AFCON final. United, however, are on the cusp of exiting Europe’s elite competition.\nAdvertisement\nOnana has come under scrutiny following his performance in United’s Champions League draw against Galatasaray on Wednesday.\nTen Hag, who claimed that Onana is the second-best goalkeeper in the Premier League based on preventing expected goals, expressed confidence in his player but admitted that no one in his squad is “undroppable”.\n“Players always need trust. I just explained he is after Alisson the best stopper in the league from preventing expected goals. You deserve to play,” he added.\n“It won’t help him (taking him out of the squad). I have trust in Tom (Heaton) and Altay (Bayindir), clear. But Andre, you see after Alisson (Luton Town’s Thomas Kaminski is instead leading in this area, with 6.3 goals prevented compared to Onana’s 3.7) he prevented the most expected goals in the whole league. In the Champions League, he has so much experience with Ajax and last year with Inter Milan. Last year he was with (Manuel) Neuer and (Thibaut) Courtois as the best goalkeeper, so he is a great keeper.\n“He has the potential, so we have to work on him so that he does it consistently and we will work with him and we will support him. The manager, coaches and players all support him.\n“Nobody is undroppable, that is also clear. We have a strong belief that he will help us win trophies.”\nGO DEEPER\nOnana is a mix of the exceptional and the excruciating - much like Man Utd\n(Photo: Vasile Mihai-Antonio/Getty Images)",
  "word_count": 676,
  "scraped_at": "2026-02-14T02:20:16.282123",
  "_text_extracted": true
}