{
  "article_id": "fe8af7366e41",
  "url": "https://english.aawsat.com/sports/5056738-emiliano-mart%C3%ADnez-%E2%80%98show-i-just-want-win-game",
  "title": "Emiliano Martínez :  Show - off ? I Just Want to Win the Game  ",
  "date": "20240902T140000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Owing to superstition, before the season started Emiliano Martínez traded his No 1 shirt for the No 23. The number – a nod to the day his six-year-old son, Santi, was born – has proved a good omen, Martínez says, given he has won four trophies with Argentina, including a second Copa América this summer, wearing it.\nAnother superstition has been in play since his wife, Mandinha, gave him a pair of cuddly toy animals before the World Cup; Santi’s penguin and the giraffe of their three-year-old daughter, Ava, to carry as mascots in the dressing room, alongside a photo of his children. “I keep them with me everywhere I go,” says Martínez, whose shin pads are covered in images of his family and moments from his career. “It gives me a little bit of motivation before every game. She [Mandinha] said: ‘You are going to bring the golden cup home.’ I was 40 days away from the family, and I did it.”\nFor a split-second, the thought of Martínez checking he has a couple of cuddly toys in tow as part of his match-day ritual jars with his on-pitch persona, his image as – how else to say this? – the master of shithousery, often making himself public enemy No 1 in the process. At least that is the preconception many have of him. Martínez’s greatest moment was surely his sprawling save in the final seconds of extra time to deny Randal Kolo Muani and France victory in the 2022 World Cup final in Qatar. Then came his stop in the penalty shootout to thwart Kingsley Coman and the mind games to distract Aurélien Tchouaméni, who subsequently missed.\nMartínez insists any dark arts are not preordained. “I think it’s natural,” he says. “I don’t think about it, I just do it. It’s in the moment. It’s something that can happen, the adrenaline kicks in and sometimes you just can’t control it. I don’t look for it, it just comes. Sometimes when you see me from the outside, you think: ‘He looks a show-off.’ But no, I’m just a normal guy, a family man. But when it is about winning I try everything I can to win the game.”\nDoes Martínez feel misunderstood? “Yeah, exactly ... [people who think of me being] the show-off are probably the team who doesn’t know me. When you ask all of my teammates, those in the national team, I do everything for my team, I try to help everyone in the club. The only thing that I want is the best for my club and country. That is all that I care about.”\nIn other words, the 31-year‑old unapologetically wants to win at all costs, though it is hard to keep a straight face when he insists he never intends to irk supporters. Jamie Vardy, who goaded Tottenham fans on Monday by pointing to the Premier League crest on his shirt, certainly enjoys a little bit of give-and-take with those in the stands. “Everyone has their own things,” Martínez says. “I never try to wind up fans, I never do that. I just try to slow things down when the game is against us; I try to kick the ball as hard as I can to the other side.\n“But if you keep yourself steady and you don’t insult anyone, any religion ... I think you can do whatever you want. I don’t swear, I don’t insult anyone. I just try to help my team – that’s all. I always respect the players. I just want to win the game. I don’t cross a line, I never do.”\nAfter making two saves in a Copa América shootout win against Ecuador in July, Martínez again celebrated by exhibiting his snaking hips. It was a similar story in Lille, in Aston Villa’s Europa Conference League quarter-final, in which he was booked twice, the second for gamesmanship during a shootout win but survived a red card owing to the small print in the Uefa rulebook. “I thought I was off,” Martínez admits, raising a smile. “I think everyone in football thought that. I was actually asking the ballboy: ‘Can you please give me the ball?’ Then I was booked for that. I couldn’t believe what I was seeing. So I was lucky. Because of that I missed the semi-final at home [to Olympiakos] in front of the fans, so after all that it was disappointing.”\nAs Martínez talks, speaking after announcing his new contract until 2029 in front of his family and 400 season-ticket holders at Villa’s revamped club shop, his son, wearing a replica kit, arches his back into him and every now and then Ava taps him with a pair of goalie gloves. “Daddy, daddy,” she says, as Martínez discusses the merits of his longtime psychologist, David Priestley, whom he first worked with at Arsenal, Villa’s opponents on Saturday. “He brings me down when I’m too high, he lifts me when I’m too low, and I think that is someone every player needs,” says Martínez, who turns 32 next month. “It is an investment, time in the week that I have to work with him. If you see my performances, I’m never 10 [out of 10], but I’m never four. I’m trying to always be a seven.”\nVilla, whose supporters chant about Martínez being the world’s best goalkeeper, would dispute those ratings of his performances. A few minutes earlier, Ramón Rodríguez Verdejo, better known as Monchi, Villa’s highly regarded president of football operations who was a goalkeeper for Sevilla in his playing days, insisted Martínez should be spoken of in the same breath as legends such as Lev Yashin, Gianluigi Buffon, Dino Zoff and Ubaldo Fillol, a World Cup winner with Argentina in 1978. Martínez, who won his third golden glove with Argentina this summer, was awarded the Yashin Trophy at the Ballon d’Or ceremony in Paris last year.\nMartínez’s point-blank save to deny Leandro Trossard in a striking victory at Arsenal towards the end of last season sticks in the memory before the clubs meet again at Villa Park. Villa did the double over Arsenal last season, severely denting their opponents’ title hopes. Martínez feels “it is just another game” against his former club and “there is no way we can challenge for the title”, but is confident Villa can shock in Europe this season. “Especially with the manager we have got,” he says of Unai Emery. “He was in the semi‑final of the Champions League with Villarreal [in 2021-22]. He has won four Europa Leagues ... for Villa, it being our first time in the Champions League, it is going to be new for us, but when you have a manager and players like we have you can go all of the way.”\nMartínez exerts self-confidence but is also self-critical. “Last season I wasn’t happy with myself with nine clean sheets [in the league]. Javi [García, Villa’s goalkeeping coach] showed me the stats ... I prevented goals, did more sweeping, took more crosses, but I want to the win the golden glove at Villa.\n“I have changed a lot since Unai came here. Javi and Unai made me more like a centre‑back player, covering defence, sweeping. We conceded a lot of goals [last season]. If we can reduce the amount of goals we are conceding, I think we have got more chance of being in the top four and winning a trophy, something that has been missing.”\nMartínez worked with “mad man” García at Arsenal under Emery and could have reunited with the pair at Villarreal in the summer of 2020, but picked Villa. While at Arsenal he was loaned to Oxford in League Two and Sheffield Wednesday, Rotherham, Wolves and Reading in the Championship, as well as Getafe in La Liga. He impressed at Arsenal but was unable to establish himself as the first-choice goalkeeper under Mikel Arteta. “I play more games now, so I’m more experienced. I’m a dad,” he says. “When I was at Arsenal I was a young lad, learning the language, learning the English life. I am a completely different person now.”\nAs for those superstitions, they do not stop at one or two. “Aaah, I’ve got loads,” Martínez says. “I keep my same routine: I make sure I do pilates, yoga two days before, I pray before the games, have psychologist meetings.” His shirt‑number swap is already paying off, he says, alluding to Villa’s opening-day victory at West Ham, his first there since joining the club for £20m.\nMartínez’s final two appearances for Arsenal both came at Wembley, an FA Cup win over Chelsea followed by a Community Shield shootout triumph over Liverpool, and now he is targeting silverware with Villa. “I’m speaking loudly in training saying: ‘We need to win a trophy, we need to at least play a final,’” Martínez says. “This club and these fans deserve a cup run. I love it here, obviously, but I wouldn’t stay at a club where I don’t see progress. Because I want to achieve things, I want to win things, I want to keep trying to be the best goalie in the world if I can.”\n-The Guardian Sport",
  "word_count": 1532,
  "scraped_at": "2026-02-14T02:08:12.431127",
  "_text_extracted": true
}