{
  "article_id": "fea651e63f92",
  "url": "http://thepeninsulaqatar.com/article/19/02/2023/home-rivals-al-duhail-al-rayyan-face-off-in-acl-round-of-16",
  "title": "Home rivals Al Duhail , Al Rayyan face off in ACL Round of 16",
  "date": "20230219T093000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nAl Duhail players during a training session, yesterday.\nDoha: Al Duhail SC will respect Al Rayyan SC but it will not be at the expense of losing focus when the two teams face off in the AFC Champions League 2022 (West) Round of 16 today.\nAl Duhail will enter the-all Qatar clash at the Al Thumama Stadium a team in form while Al Rayyan are involved in a relegation scrap domestically.\nAl Duhail coach Hernan Crespo speaks during a pre-match press conference. RIGHT: Al Rayyan coach Nicolas Cordova.\nAl Duhail head coach Hernan Crespo, however, is fully aware that his side cannot afford to underestimate their Qatar Stars League counterparts despite Al Rayyan’s domestic form.\n“We respect Al Rayyan and the coach is my friend but we are focusing on ourselves. We have been working very hard and we want to continue winning,” Crespo said. “We want to maintain our identity, play our brand of football. We want to keep the ball and score goals.”\nAl Duhail will enter the tie in sizzling form and top of the Qatar Stars League and Argentinian legend Crespo said he will have a tough time deciding his starting 11.\n“More or less, all my players are ready. I have freedom to choose my first 11. It will be very difficult but it is my job. My players have given everything in every match and in every training session. All deserve to play in this match but I will have to choose.”\nAl Rayyan’s league form suggests they will start the tie on the backfoot but head coach Nicolás Córdova believes his players will rise to the occasion.\n“We may not be doing well in the league but we have been looking forward to this match for a very long time.\n“The players are excited and raring to play and I expect us to perform,” Córdova said.\nIt will be a historic tie for Al Rayyan as it will be their first Round of 16 appearance after falling to advance past the group stage in their 10 previous appearances.\n“Our main objective is to show what we have been trying on the pitch. The players have worked very hard and a win for us cannot be ruled out,” Córdova said. AFC\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 445,
  "scraped_at": "2026-02-14T02:24:32.673975",
  "_text_extracted": true
}