{
  "article_id": "feb48d0fa735",
  "url": "https://www.bbc.com/sport/football/articles/cly1g09p0wxo",
  "title": "Kevin de Bruyne : The questions around Man City star departure",
  "date": "20250404T183000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The questions around De Bruyne's Man City departure\n- Published\nKevin de Bruyne has announced he will leave Manchester City after 10 years when his contract expires at the end of the season.\nDe Bruyne, who turns 34 in June, has won 16 trophies since joining City from Wolfsburg in 2015, including six Premier League titles and the Champions League in 2023.\nThe Belgium international has been labelled \"one of the greatest midfielders to ever play in this country\" by his manager Pep Guardiola.\nBut his announcement on Friday does raise several questions, which BBC Sport attempts to address.\nWhose decision was it?\nIt came from Pep Guardiola and technical director Txiki Begiristain.\nWhen he talks about contracts, Guardiola usually says it is a 'club' decision and passes on responsibility to those above him. On this occasion, he is owning it.\n\"It was not easy for me to tell him it won't continue,\" Guardiola told the media at his scheduled pre-match news conference before Sunday's Manchester derby at Old Trafford.\nThat statement reinforces De Bruyne's own words in his social media post: \"Whether we like it or not, it's time to say goodbye.\"\nWhat is not absolutely clear is what the key factors were in the decision to sever ties.\nDe Bruyne is one of the Premier League's highest earners. It was impossible to imagine City would offer an extension on the same £400,000-a-week terms. They are also pretty good at playing hardball, as former captain Ilkay Gundogan found out in 2023 when City refused to buckle over the Germany midfielder's demands for a two-year deal.\nDe Bruyne has been a shadow of his usual self this season. By common consent, he has not had a game-changing influence since the victory at Newcastle in January 2024, when he came off the bench to score one and create another, turning a 2-1 deficit into a 3-2 victory.\nHis four goals and seven assists in all competitions this season is down on normal levels. He last scored against Championship side Plymouth in the FA Cup last month. The last two of his six Premier League assists came in a 6-0 win against relegation-threatened Ipswich in January.\nGuardiola has admitted this season he was probably wrong to remain loyal to his core squad last summer. Was that the deciding factor, or was it deemed demeaning to offer De Bruyne an extension on far less than he is earning now?\nWhere next?\nDe Bruyne's representatives have previously spoken with clubs from the Saudi Pro League, so contact in that direction is established.\nThere was also concrete interest from Major League Soccer's 2025 expansion club San Diego FC before the new season.\nSan Diego did hold discovery rights on De Bruyne, meaning no other club could negotiate with him.\nHowever, sources with an understanding of the situation says that has now been dropped and San Diego have no plans to return to the potential signing.\nIt cannot entirely be discounted he may move to another, less taxing, European league.\nDe Bruyne spoke at length about his situation in November, before the Champions League draw with Feyenoord.\n\"I can make a difference for this team,\" he said. \"And as long as I feel that, that's a good indicator I can still play at the top level. So that's the only assurance that I need.\"\nIn June 2024, De Bruyne said he was 'open' to moving to Saudi Arabia.\nHowever, he has three children, all under 10 - with eldest son Mason a player of promise - and it is not clear if he views Saudi Arabia as the right move at this stage in their lives.\nIs this the first of many summer departures?\nA week ago Guardiola admitted it had been a \"poor\" season and he had done a \"bad\" job.\n\"We don't deserve a bonus, not even a watch,\" he said before the FA Cup quarter-final win at Bournemouth.\nCity have already started to address the situation. In the winter transfer window, they spent a near-record £180m on four new players. And, with no Profit and Sustainability issues to hamper them because of the number of players sold for significant fees in recent years, further signings are certain this summer, with Bayer Leverkusen's Germany international Florian Wirtz high on the list of targets.\nBut there will be sales too. It is difficult to see Kyle Walker returning to City once his loan spell with AC Milan ends. Like De Bruyne, Gundogan's contract expires in June and while there is an option to extend by a year, it is not certain the clause will be activated.\nThere has been huge speculation about the future of Jack Grealish, who admitted this week he has been frustrated at his lack of Premier League starts. After being overlooked by Gareth Southgate for Euro 2024, Grealish will want to give himself the best chance of making it to the 2026 World Cup.\nGuardiola has spoken about the injury issues that have blighted John Stones and Nathan Ake this term, while it cannot be taken for granted that Bernardo Silva, Ederson or Matheus Nunes will still be at City when the summer window closes on 31 August.\nKalvin Phillips' time at the club should come to an end whether he returns from Ipswich or not. When the futures of James McAtee and Nico O'Reilly are taken into account, a dozen first-team squad members head into the summer with questions over them.\nIt is likely to be City's busiest summer of transfer activity since Guardiola arrived in 2016.\nWill he play for Man City at Club World Cup?\nThis is surely one of the easier elements of De Bruyne's exit to read. The Belgian's contract runs to 30 June. That means he is clear to play in the group phase of the expanded 32-team tournament in the United States. If City win their group, he could also play in the last-16 game.\nHowever, \"could\" is doing some heavy lifting here. To play any further part in the knockout phase, De Bruyne would have to sign a short-term extension, which Fifa has made possible under adjustments to their registration rules made specifically for the tournament.\nBut, if De Bruyne is intent on extending his career - and every indication so far is that is the case - why would he risk injury playing at a tournament which Guardiola has indicated he intends to use partly as preparation for the 2025-26 campaign? That would make little sense.\nShould he so wish, De Bruyne could sign a lucrative contract at one of the other 31 clubs purely to play in the tournament, and then leave when it is done, which is another avenue Fifa's amended rules have been created to allow.\nFar more likely, De Bruyne will play for Belgium in their World Cup qualifiers with North Macedonia and Wales at the beginning of June and then take a break before starting the next phase of his career somewhere else in July.\nThat would mean an Etihad Stadium send off in City's final home game against Bournemouth - scheduled for 18 May, but to be moved if Guardiola's side are in the FA Cup final that weekend.\nAs prestigious as Fifa president Gianni Infantino says the Club World Cup is, that would surely be a more fitting City farewell for De Bruyne - at least until he returns for the unveiling of the statue Guardiola believes is certain to be commissioned in his honour.\nRelated topics\n- Published26 July 2022",
  "word_count": 1256,
  "scraped_at": "2026-02-14T02:02:35.591035",
  "_text_extracted": true
}