{
  "article_id": "fec21830ebdf",
  "url": "https://www.90min.com/posts/raheem-sterling-is-leading-by-example-chelsea-senior-players",
  "title": "Raheem Sterling is leading by example as one of Chelsea senior players",
  "date": "20230826T010000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Raheem Sterling is leading by example as one of Chelsea's senior players\n- Sterling scored twice and registered an assist against Luton\n- The former Man City attacker was the first signing of the new Chelsea era\n- Chelsea register their first win under Mauricio Pochettino\nFROM STAMFORD BRIDGE - Chelsea have spent approaching a billion pounds in just over a year under the watch of everyone's favourite big spender, Todd Boehly.\nTheir strategy has pivoted over the three transfer windows the Blues have had to throw that cash around, and while they now seem settled on a plan to swallow up every single young player who is any good at football anywhere in the world, it's the first signing of the post-Abramovich era that has stepped up to the plate since the start of the new season.\nRaheem Sterling has won most things at club level, and while he may have cast an envious eye at his former Manchester City teammates as they finally won the Champions League after years of trying last season (you could forgive him for doing so considering his new team finished 12th) he's setting out for this campaign intent on making a statement.\nWhile he'd arguably been Chelsea's best player in the opening two weeks of the season, it was at home to Luton Town on Friday night in the Premier League where he stole the headlines and the points. A neat left-footed finish in the first half after a great run from the right side was followed up in the second with a stroke home from a Malo Gusto cutback. He even provided new Blues favourite Nicolas Jackson with an assist for his first goal for the club.\nHe even earned the hugely coveted 90min Player of the Match award.\nSterling and Chelsea will have more difficult matches throughout the course of the season but even on nights like this, against diligent teams with a point to prove, every team needs a spark.\nAnd that's particularly the case for a club coming off the back of their worst season in a generation, with exactly a trillion new faces in through the door, with 80% of that trillion under the age of 21. Sterling is one of the most decorated players in the Chelsea dressing room and is now at the stage of his career where he is a senior figure, looked toward to raise the levels of those around him.\nThere's no doubting the talent Mauricio Pochettino has to work with, but leaders and experienced heads will never not be important. You only need to look to Thiago Silva - turning 39 next month - for an example of a player who sets the standard.\nThe Brazilian will play a huge role in the development of academy product Levi Colwill, but it'll be on Sterling further up the pitch to make those around him look even better. Gusto came out with two assists from Sterling's two goals while you can imagine Jackson will be thrilled with a delivery which left him the simple job of tapping in from a couple of yards for his maiden Chelsea strike. It is a numbers game nowadays, more than ever, after all.\nBut Sterling's energy and determination - especially if he retains it throughout a kind run of fixtures to come in the Premier League - will help the Blues find their feet after a year of incredible turnover, challenges and miserable results.\nHe told Sky Sports he was \"obsessed with football again\" after the whistle, and it's showing. He'll be hopeful the years ahead will see him hit the same heights with Chelsea as he did at his former club.",
  "word_count": 614,
  "scraped_at": "2026-02-14T01:50:52.142047",
  "_text_extracted": true
}