{
  "article_id": "fec5b3cd3531",
  "url": "https://www.caughtoffside.com/2023/04/27/ryan-gravenberch-arsenal-transfer-interest-revealed/",
  "title": "Arsenal have shown interest in rivalling Liverpool for midfielder transfer",
  "date": "20230427T083000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have reportedly been among the clubs to show an interest in the potential transfer of Bayern Munich midfielder Ryan Gravenberch.\nAccording to Fabrizio Romano, speaking on his YouTube channel and quoted in his Daily Briefing for CaughtOffside’s Substack, Liverpool remain one of the most interested clubs and recently held talks with Gravenberch’s representatives.\nHowever, there is also interest from Arsenal, who were one of the clubs being kept informed on the Netherlands international’s situation in January.\nIt’s clear that Gravenberch wants to play more often next season, which looks like a potential problem for Bayern, who would supposedly prefer to keep him.\nArsenal look set to miss out on the Premier League title this season despite an impressive challenge to Manchester City, and they’ll surely be keen to strengthen their squad in the summer in order to cope with the demands of Champions League football and to help them do better in next year’s title race.\n“There is a lot of interest in Ryan Gravenberch – he is not playing for Bayern and he has confirmed he is not satisfied at all, he wants more minutes, and he says that next season it has to change,” Romano said.\n“There will be a meeting soon between Bayern and Gravenberch, but from the club’s perspective, they want to keep him, and have no intention to negotiate for him to leave.\n“There has been interest from the Premier League since January – Liverpool, Man United and Arsenal were all informed on his situation but it was not possible to proceed because of Bayern’s stance.\n“Liverpool especially remain interested and had a direct conversation with his agent a few days ago, so they are waiting to see if the situation could change.”",
  "word_count": 289,
  "scraped_at": "2026-02-14T01:55:54.930747",
  "_text_extracted": true
}