{
  "article_id": "fed9e83267fd",
  "url": "https://www.nytimes.com/athletic/5605621/2024/06/30/euro-2024-day-17-england-spain-mbappe/",
  "title": "Euro 2024 day 17 – England escape , Spain impress and what it like inside Mbappe mask ? ",
  "date": "20240630T230000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Potential upsets were the theme at Euro 2024 on Sunday. England trailed Slovakia 1-0 with seconds remaining, only to turn it around with a Jude Bellingham goal in injury time and a Harry Kane winner a minute into extra time. Gareth Southgate’s team will face Switzerland in the quarter-finals on Saturday.\nAdvertisement\nMeanwhile, Spain briefly fell behind to an exciting Georgia side in Cologne before coming back to win 4-1, with wingers Lamine Yamal and Nico Williams starring once again. They will face hosts Germany on Friday.\nHere, our writers explain the key moments from day 17.\nHow Gareth Southgate avoided his own personal Iceland moment\nFor so much of this game, England’s fate felt inevitable. They were destined to repeat Iceland. It would be the perfect narrative ending to the Southgate era, replicating the nadir that had led to him getting the job in the first place. The first time as tragedy, the second as farce. The last eight years would be bookended by two parallel disasters, last-16 Euros exits to unfancied opponents, both when we had our arrogant eyes on the open road ahead of us. The inescapable neatness of it was overwhelming, and the England players looked so transfixed by it that they had no option but to knowingly sail into the iceberg all over again.\nWhen Southgate came in for his post-match press conference it felt surreal that he could be sat there smiling, telling stories about his motivational presentation about the 1966 World Cup win, his pride in the way they held on in extra time, discussing Luke Shaw’s fitness and the tactical challenge of the Switzerland game. And yet for all the mingled glee and relief, for all the happy memories and the travel plans for Dusseldorf, we cannot take our eyes off the reality of the vast majority of what we all saw tonight.\nThis was, for the most part, a dismal England performance, regardless of the supernatural deliverance at the end. Right up until the point Bellingham leaped up into the air to meet Marc Guehi’s flick-on, it was as bad as they had played all tournament, even worse than Denmark and Slovenia.\nBellingham’s overhead, remember, was England’s first shot on target, despite dominating possession all game. And the badness of it cannot have been a surprise to anyone who was paying attention. Everything that was bad about today in Gelsenkirchen had been signposted by England over the course of the last few weeks. The red flags had all been there since England opened their campaign in this same city two weeks ago.\nAdvertisement\nAgain England were poor on the ball, struggling to break through the Slovakian pressure. The image that sticks in the mind is of an England player in possession, hunted by a blue shirt, seeing no options in front of him, angrily shrugging at his team-mates for not showing the ball. It was the look of a man who never wanted the ball in the first place and felt personally betrayed at having to look after it, if only for a few painful seconds. His only option is to then retreat, or just give the ball away, or shout at another white shirt, or perhaps all of the above.\nEngland had no out ball, no pace around or beyond Kane. Their only outlet was a 33-year-old right-back playing on the left wing, working as hard as he could at a job that does not play to his strengths. Again England struggled to get around the opposition as quick as they needed to.\nOne of the biggest differences between this game and the group stages was that England’s defensive solidity deserted them, as they routinely looked panicked when Slovakia hit them on the break. They were vulnerable from the start and when a long ball ended up with Ivan Schranz beating Jordan Pickford it looked as if England were panicking their way into disaster.\nBefore the game the big questions were whether England were merely underperforming or were fatally flawed, whether the good ship Gazball was indeed sunk beneath the waterline, and whether Southgate would make the necessary changes required to fix it.\nThe answers were that no, he would only make one change, bringing in Kobbie Mainoo (below), who did at least want the ball in midfield. And yes, England are desperately flawed, still unbalanced, still uncertain on the ball, still struggling to create chances even when they dominate possession. None of the lingering questions over this England team have been solved.\nAnd yet while every single bit of evidence tells us that the ship should be sunk, it is sailing on to Dusseldorf for Saturday’s quarter-final. They have at least avoided the iceberg of history.\nJack Pitt-Brooke\nAdvertisement\nYamal and Williams have supercharged Spain’s Euros campaign\nSpain’s second goal was scored by Fabian Ruiz, his second of the tournament, but it was really all about Lamine Yamal.\nFirst Yamal had won a free kick on the edge of the Georgia box, taken it himself, and forced an excellent save from Giorgi Mamardashvili. That would have been a disappointment, but as Spain recycled the ball the Barcelona winger got back into position to receive a pass out wide.\nWhen his team-mate got the ball, Fabian knew what to do, with the late run towards the back post. The delivery on his left foot was tremendous, whipped just high enough to take out the Georgian defenders, but without giving Mamardashvili any chance to come off his line to take it. The ball was placed right on Fabian’s head, with the Paris Saint-Germain midfielder just having to apply the final touch from point-blank range.\nIt was similar to Yamal’s assist for Dani Carvajal’s goal against Croatia in Spain’s opening game. We keep having to remind ourselves that he is just 16 years old — tonight he became the youngest player to appear in the knockout rounds of a Euros, taking the record by more than a year from Jude Bellingham at the last tournament.\nNothing seems to faze the Barcelona prodigy, whose technical quality, decision making and ability to impact games in key moments is already world-class. All that was missing was a goal himself — and he came very close, with a left-foot curler from the edge of the box.\nMeanwhile, Nico Williams goes unnoticed in the Spain team a lot purely because of Yamal’s presence. The game was fairly wrapped up at 2-1, with Georgia fatiguing and pushing without truly creating anything of note, but it gave space for Spain to exploit on the counter-attack — which is exactly what they had to defend from Georgia all game.\n1 – Nico Williams is the only player on record at the UEFA European Championship (since 1980) to score a goal, assist a goal, and complete 100% of his passes (46/46) in a game he started. Immaculate. #EURO2024 pic.twitter.com/XXXMuNWdm3\n— OptaJoe (@OptaJoe) June 30, 2024\nOn an individual level, the goal was important, only Williams’ third internationally, and his first goal since he scored in Spain’s 7-1 win away to Georgia in qualifying. The move for the goal, a counter-attack from deep after a misplaced Georgia pass, is an underrated side of Spain’s game and one often masked by their obsession for possession. Fabian’s pass was perfect, long and precise. He was left out of Spain’s World Cup 2022 squad by Luis Enrique, before becoming a key player under him at the base of midfield in Paris Saint-Germain’s Champions League run last season.\nPlenty of De La Fuente’s success has been adding verticality and directness, not that Fabian’s ball did all the work. Williams still had to get the one-on-one with a smart dribble, and finished high against the best goalkeeper in La Liga last season. Knowing how vulnerable Germany have looked in transition in their first four games, De La Fuente might well lean into those counter-attacking strengths in the quarter-finals.\nDermot Corrigan & Liam Tharme\nAdvertisement\nSpalletti decides to remain as Italy’s head coach and continue ‘project’\nLuciano Spalletti will remain in his role as Italy men’s head coach despite his side’s European Championship exit to Switzerland on Saturday.\nItaly were second-best throughout the last-16 clash and Switzerland emerged as 2-0 winners, thanks to goals either side of half-time from Remo Freuler and Ruben Vargas.\nThe defeat for the reigning European champions raised questions about Spalletti’s future as head coach, despite the fact he signed a three-year contract to replace Roberto Mancini fewer than 12 months ago.\nFollowing the Switzerland loss, though, Spalletti spoke as if he intended to carry on with the national team. “The results have said that we need to change things,” the 65-year-old said. “That’s been the footballing verdict and I’ll be forced to do so.”\nItalian Football Federation (FIGC) president Gabriele Gravina then confirmed in a press conference with Spalletti on Sunday that the former Napoli boss will remain in his position.\n“We had a long talk with the coach,” Gravina said. “I am pragmatic and I think it is unthinkable to solve problems in times of difficulty by abandoning a project that from the first moment we said was a three-year project.\n“You can’t think about abandoning a project after eight or nine months. Something has to be changed, something has to be revised in terms of approach. There will be deep reflections, last night we started to go through that with Spalletti. We all have to grow.”\nAsked what he would do if he could turn back time, Spalletti replied: “That’s not a game I play. Going over what might have happened. I can’t go back.\n“It’s clear from what we saw that I made some mistakes. I tried to rejuvenate the team. Given that I’m staying, I’ll try to rejuvenate the team even more in the future.”\nJames Horncastle\nAdvertisement\n‘Initially, I felt I was in 3D’ – Kylian Mbappe takes us inside his mask\nFrance play Belgium on Monday and captain Kylian Mbappe has revealed he feared his European Championship was over when he broke his nose in the opening game of the group stage.\nThe Real Madrid forward suffered the injury in an aerial collision with Austria defender Kevin Danso and was subsequently replaced in the closing stages of the 1-0 victory over Austria.\n“I didn’t think much about it at the time,” he said on the eve of their round-of-16 game against Belgium. “I didn’t really know what was happening to me, I didn’t feel like I’d broken my nose.\n“It was more looking at the opponent’s goalkeeper’s face that made me think there was something wrong. (He laughs). But afterwards it was a bit scary because I told myself I was going home. I saw myself in the mirror, that was a bad idea but I’m happy I’m here.”\nMbappe was then an unused substitute in France’s second group match against Netherlands four days later.\n“It was difficult because there was a lot of information, a lot of appointments, I spent almost two days not sleeping. It’s very difficult to sit on the bench knowing you can’t do anything to help. Thank God I was able to play again against Poland.”\nMbappe scored France’s only goal, and his first at a European Championship, from the penalty spot in their last group game but says it is “absolutely horrible” playing with a mask and has changed the contraption at least five times.\n“Each time there was something wrong,” said the new Real Madrid signing, who added he is yet to be added to their Whatsapp group chat. “It’s really difficult because it limits your vision and the sweat clogs up. Initially I felt I was in 3D and I’d been invited to the Euros as a VIP. I could see the people but I felt it wasn’t me playing.\nAdvertisement\n“As soon as I can take it off, I will. Right now I’ve got no choice, I can’t play without it. It’s really annoying. But it’s not going to be an excuse because that’s the only way I can play. I have to say thank you to the masks.”\nMbappe acknowledges, however, he may become a target given his injury.\n“I knew what I was signing up for when I decided I wasn’t going to go home,” he says. “If I get hit, my nose is already broken, what else can someone do?”\nDespite the grievances the mask is causing Mbappe feels well within himself. “I’m in good spirits, physically of course, the Euros didn’t start how I wanted it to. The Euros is the only thing that I’m missing with the national team so I really want to win.”\nCharlotte Harpur\nWhat’s next?\nThe round of 16 continues on Monday with a heavyweight clash between France and Belgium in Dusseldorf, followed by Portugal’s game with Slovenia in Frankfurt. Cristiano Ronaldo and Romelu Lukaku have had 22 shots between them at this European Championship without scoring — will either of them get off the mark tomorrow?\n- France v Belgium (5pm BST/12pm ET)\n- Portugal v Slovenia (8pm BST/3pm ET)\n(Top photo: Adam Davy/PA Images via Getty Images)",
  "word_count": 2190,
  "scraped_at": "2026-02-14T01:51:32.419359",
  "_text_extracted": true
}