{
  "article_id": "feecaedb366b",
  "url": "https://www.justarsenal.com/pundit-insists-mikel-arteta-must-take-the-blame-for-sakas-latest-injury/350470",
  "title": "Pundit insists Mikel Arteta must take the blame for Saka latest injury",
  "date": "20231006T113000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gabby Agbonlahor has placed the responsibility for Bukayo Saka’s recent injury on Arsenal manager Mikel Arteta. Saka sustained the injury during the Champions League match against Lens.\nSaka had been displaying signs of needing rest for several weeks, but he continued to receive playing time from his manager. Arteta’s approach has been to field his best team whenever possible, and the absence of a reliable backup for Saka has contributed to his regular inclusion in the starting lineup.\nWhile Saka’s scans may reveal that he hasn’t suffered a severe injury, the incident has prompted criticism from some fans and pundits who believe that rest could have been beneficial for the young player. Agbonlahor, among others, is suggesting that Arteta bears responsibility for not managing Saka’s workload more effectively to prevent such injuries.\nAfter his injury at Lens, Agbonlahor told Football Insider:\n“I think Arteta gets the blame, for me.\n“He should’ve been rested for the game against Bournemouth on the weekend.\n“No offence, but if you’re Arsenal and you can’t afford to rest him against Bournemouth – then what have you done with your squad?\n“This is a squad which includes Vieira, Nelson, Smith Rowe, and Nketiah.\n“You can’t play so many games and expect not to get an injury. Even when they’re 3-0 up in the game, he’s still on the pitch.\n“Just take him off when you get the second goal. He ended up playing 76 minutes when he was carrying a knock.”\nJust Arsenal Opinion\nSaka is one of our best players and has to be protected at all costs. The Englishman has shown signs of being overused for some time.\nEven if he has not suffered a serious injury, it would be smart to rest him for our next match before he suffers a significant injury.\n——————————-\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 325,
  "scraped_at": "2026-02-14T02:00:57.111899",
  "_text_extracted": true
}