{
  "article_id": "ff5b0aed15f0",
  "url": "https://www.bbc.com/news/articles/c20556ngeylo",
  "title": "Celtic v Rangers : Bitter Old Firm rivals united in chaos",
  "date": "20251031T234500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Celtic v Rangers: Bitter rivals united in chaos\nWhen Glasgow's two main football clubs meet at Hampden Park, winning means everything.\nBut rarely has there been such a curious build-up to a fixture that hardly needs a sideshow.\nIn Scotland, when chaos comes knocking at the doors of Celtic and Rangers, it's headline news.\nAnd, lately, neither Old Firm club has been short of turmoil.\nThat might sound overstated to the casual observer or those outside Scotland's central belt, but in few UK cities is football so deeply woven into the social fabric as it is in Glasgow.\nThis time, though, there's an unusual symmetry: both clubs are struggling, on and off the pitch, at the same time.\nIndeed both dugouts will feature different managers from when the rivals last met and played out a goalless draw at Ibrox on 31 August.\nIn Glasgow it is rare for both clubs to be in what some would describe as a state of \"crisis\" at the same time.\nFor over a decade, Rangers' turbulence has provided their rivals with a steady diet of schadenfreude, but ahead of Sunday's League Cup semi-final, both clubs have been fighting for the negative headlines.\nIn the east end, Celtic fans have spent weeks protesting against a board they see as out of touch.\nManager Brendan Rodgers seemed to validate their frustration when he publicly criticised the club's failure to strengthen the squad in the summer.\nMissing out on the lucrative Champions League only fuelled the unrest - and appeared to justify his complaints.\nAfter years of harmony, success and near-total domestic dominance, all was not well inside Parkhead - and something had to give.\nThat \"something\" was Rodgers' unexpected resignation, swiftly followed by a blistering attack from Celtic's major shareholder, Dermot Desmond.\nThe Irish businessman, usually a reserved figure, has quietly controlled the club for three decades.\nBut in a rare public statement, he accused Rodgers of being divisive, self-serving and of misleading fans.\nIn football language it was a two-footed challenge with studs showing.\nRodgers has yet to respond.\nThe ferocity of Desmond's comments pulled back the curtain on tensions that had been simmering for some time.\nAnd they may have signalled the end of the unity Celtic once prided itself on.\nRogers has been replaced in the dug out, for now, by former manager Martin O'Neill and ex-player Shaun Maloney.\nFor fans, the dismay wasn't just about the public fallout, but that it was usually Rangers who cornered the market in mayhem.\nAcross the Clyde, Rangers' troubles are nothing new.\nSince the club's financial collapse in 2012, supporters have lived through regime changes, court battles, managerial misfires and even liquidation.\nMany feel they've endured enough. But in Glasgow, football isn't a pastime. It's an inheritance.\nThat's something the club's new American owners are discovering fast.\nWhen he was appointed head coach in the summer fans warned that Russell Martin wasn't the right fit.\nBut the consortium stood firm, keen to project authority.\nSeven games and a torrent of venomous protests later, Martin was gone.\nThe owners admitted they had underestimated the intensity of Glasgow football.\nThey're not the first, and they won't be the last.\nUnlike O'Neill, who managed Celtic from 2000 to 2005, new Rangers head coach Danny Rohl will experience his first Old Firm match on Sunday.\nThe appointment of the former Sheffield Wednesday manager ended a protracted search for Martin's replacement.\nFor once, both sets of supporters share a common cause: a desire for change in the boardroom. History suggests they often get what they want.\nBut this isn't just a Celtic and Rangers story. Both clubs are now glancing along the M8 with unease, toward a challenger that dares to dream.\nHeart of Midlothian sit top of the table and have the backing of Brighton owner Tony Bloom, the data-driven investor who helped transform the Premier League club.\nWhen Bloom promised Hearts fans an end to Old Firm dominance within a decade, many dismissed it as hubris.\nGiven it hasn't happened in 40 years, you can understand why.\nYet Bloom's methods - and the unity around Tynecastle - are making people wonder if this could be the season the Glasgow duopoly is finally broken.\nWhatever happens come May, unity is something Celtic and Rangers would pay good money for right now as they prepare to do battle once again.",
  "word_count": 729,
  "scraped_at": "2026-02-14T02:09:24.903298",
  "_text_extracted": true
}