{
  "article_id": "ff83501cd675",
  "url": "https://www.90min.com/posts/three-reasons-why-chelsea-must-keep-ever-improving-conor-gallagher",
  "title": "3 reasons why Chelsea must keep ever - improving Conor Gallagher",
  "date": "20240213T203000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "3 reasons why Chelsea must keep ever-improving Conor Gallagher\n- Chelsea were open to offers for Gallagher in the January transfer window\n- The 24-year-old midfielder scored his first goals of the season against Crystal Palace\n- Mauricio Pochettino cherishes Gallagher's unrelenting work rate\nWhile referee Michael Oliver took a screwdriver to his audio equipment in the Selhurst Park tunnel before the second half, the Crystal Palace DJ filled the extended break with 'Three Little Birds' by Bob Marley and The Wailers.\nChelsea fans burst into an a cappella version of the chorus when Conor Gallagher fired the visitors level within two minutes of the delayed restart. After Gallagher blasted Chelsea to an unlikely victory in stoppage time, every little thing briefly felt like it would be alright for the west London outfit.\nHowever, Chelsea were willing to offload Gallagher for the right price during the January transfer window. With any fee for the academy graduate representing pure profit in the club's accounts, Chelsea may be tempted to part ways with Gallagher again this summer in a desperate bid to keep up with the division's financial regulations.\nHere's three not so little reasons why getting rid of Gallagher would be a bad move for the Blues.\nMauricio Pochettino's man\nMauricio Pochettino has made his deep admiration of Gallagher abundantly clear by handing him more Premier League starts (23 out of a possible 24) than any other teammate.\nAs the Argentine pointedly said during the height of transfer speculation in January: \"If Conor is playing for me it means he's performing; it means he's a player we count on.\"\nChelsea committed more than £300m on central midfielders alone throughout 2023, but the one that joined their academy as an eight-year-old has made himself far more integral to Pochettino's setup than the mercurial Enzo Fernandez or Moises Caicedo. To underscore the point, Pochettino has hailed Gallagher as \"priceless\".\nBlueCo, the consortium which purchased Chelsea in 2022, parted ways with three managers last season - more than the infamously trigger-happy Roman Abramovich ever went through during a single campaign. If they are to establish any whisper of continuity with Pochettino - which is a debate for another day - selling his favourite player is not an orthodox recipe for success.\nKey to unlock Chelsea's press\nThe match-high 13km which Gallagher covered against Palace on Monday night was hardly his first marathon display at Selhurst Park. While on loan with the Eagles during the 2021/22 campaign, Gallagher memorably came out of a hard-fought 0-0 draw with Manchester City panting: \"To be honest with you, I can't feel my legs! I'm struggling to talk.\" The industrious midfielder had almost singlehandedly closed off any available passing lane for the future champions.\nThe best football Pochettino's teams have played throughout his career have been underpinned by a well-coordinated and tireless press. Only three Premier League clubs have completed more high turnovers than the Blues this term and Gallagher's energy is utterly integral in this approach. Gallagher leads Chelsea for blocks, interceptions and tackles in every third of the pitch.\nChelsea haven't been too bad off the ball this season. Poor goalkeeping and a bit of bad luck distract from a side that boasts the fifth-best non-penalty xG record in the division.\nThe one outlier in Chelsea's campaign came in the 2-1 defeat to Manchester United in December when the Blues shipped chances worth a season-high 4.1 xG - a 40% increase compared to their next most porous performance. Incidentally, this is the only Premier League match which Gallagher has missed, sitting out through suspension.\nFan buy-in\nGallagher celebrated his stoppage-time winner against Palace by charging towards Chelsea's travelling support. Unfortunately, those in the crowd piled forward to meet their hero, knocking down the advertising hoardings along the Selhurst Park touchline.\nThe modern era of Chelsea may be dominated by imports - even before Abramovich arrived, the Blues were the first Premier League club to field an entire starting XI without a single English player. Yet, the best sides have often had an academy graduate, a fan in shinpads, on the pitch. For years, John Terry singlehandedly flew that flag but a swell of homegrown talents have littered recent iterations of Chelsea's team.\nThat is no longer the case. Chelsea, especially under owners keen on exploiting any loophole available, have cashed in on academy sales. Five graduates, headlined by Mason Mount, were all let go last summer. That follows on from the departures of Fikayo Tomori and Tammy Abraham.\nPochettino has highlighted Gallagher's intangible connection to the terraces. \"He is important because of his Chelsea values,\" the coach insisted. \"He came from the academy, he loves the club and he is very committed. You can see that on the pitch - he runs, he plays, he fights. He does everything to win. He is a really important player.\"\nThe remarkable feat of mangling a Champions League-winning squad into the most expensively assembled mid-table team of all time has not endeared Chelsea's owners to a demanding fanbase. Wacky publicity stunts have not helped. Selling one of the team's most highly regarded players would cement the wedge that already exists between the stands and the suits.",
  "word_count": 866,
  "scraped_at": "2026-02-14T01:56:44.632126",
  "_text_extracted": true
}