{
  "article_id": "ff8af9e2439b",
  "url": "https://www.theadvocate.com.au/story/8884990/around-the-grounds-strikers-aim-for-goal-scoring-improvements/",
  "title": "Around the grounds : Strikers aim for goal - scoring improvements | The Advocate",
  "date": "20250207T050000Z",
  "domain": "theadvocate.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to Around the Grounds, a new weekly column providing plenty of news, results and updates on everything Coastal sport. We're starting this week catching up with the new Strikers' recruits and recent basketball success on the national stage.\nSubscribe now for unlimited access.\nor signup to continue reading\nTurning shots into goals has been a key area of focus for the Devonport Strikers over the off season.\nAnd there are hopes that will be rectified with the inclusion of four \"goal threats\" when the NPL Tasmania season gets underway.\nCoach Tom Ballantyne said the recruits are set to \"add some more firepower\" to the side.\n\"If you look back at last year, we had the best defence in the league again. Where we let ourselves down was our conversion rate,\" Ballantyne said.\n\"We created plenty of opportunities but we came away from drawn games that we should have won.\n\"We drew at Kingborough after having 30 something shots, we even missed a penalty in that game.\n\"The players that we have brought in all have a goal threat and that's something we were conscious of recruiting this year.\"\nJoining the Valley Road-based club for the 2025 season is America's Colin Innes, who has played high-level football in the United States.\nInnes isn't the only import with Japan's Yuta Nomura also putting pen to paper after stints in the Asian Champions League.\nAdelaide attackers Dylan D'Agostino and Chante Mayol round out the Strikers' recruits, with Ballantyne having worked with the pair in the past.\nThe side will officially kick off their season when they host Riverside on March 15.\nSteamers show why they're the best\nDon has continued its dominance in the Mersey Valley Cricket Association.\nThe Steamers prevailed by five wickets against Turners Beach on Thursday, February 8 to claim their third Twenty20 flag in four years.\nThe Titans posted 118 after being sent in to bat before the home side chased down the total in the 18th over.\nSteamers' pair Samuel O'Mahony and Kurt Wheldon took three wickets each while Turners Beach's Karan Galani top scored with 50 off 46.\nDon will now face Burnie Cricket League Twenty20 champions Riana in Sunday's North West T20 Community Cup, with the winner to play Cricket North West premiers Devonport in the grand final.\nThe action will take place at West Park from 11am.\nCoasters success on national basketball stage\nA group of Coastal basketballers have returned from Ballarat with a new piece of silverware.\nTodd Adams, Deegan Campbell, Arnold House and Jeremiah Rickard were among the squad that recently claimed bronze at the Ivor Burge National Championships.\nThe side was coached by stalwart Odette Seabourne.\nWhile at the Under 20 National Championships - also held in Ballarat - the states men and women squads weren't as successful, finishing sixth.\nIt was a week to remember for Smithon product Jacob Furphy who was named defensive player of the tournament.\nNail-biter headlines NWBU season tip off\nA tight clash between Somerset and Wynyard provided one of the highlights from the opening round of NWBU action.\nThe Heat, who were runners-up last year, trailed at every break but overcame a seven-point three-quarter time deficit to prevail by five points.\nThe rounds other matches saw Burnie defeat Devonport 83 to 59, Latrobe victorious against Smithton 102 to 56 and Ulverstone 81 to 72 winners over Penguin.\nIn the women's competition, reigning premiers Latrobe produced a comprehensive 89 to 36 victory over Smithton.\nSomerset defeated Wynyard 70 to 52, Penguin won 65 to 56 against Ulverstone and Devonport were winners over Burnie 58 to 76.\nRound two on Tuesday will see Devonport host Smithton, Penguin face Latrobe, Ulverstone travel to Somserset and Wynyard play Burnie.",
  "word_count": 620,
  "scraped_at": "2026-02-14T01:52:15.345137",
  "_text_extracted": true
}