{
  "article_id": "ffc59ea24e7f",
  "url": "https://www.thisdaylive.com/2025/05/23/modric-to-leave-real-madrid-after-club-world-cup-campaign/",
  "title": "Modric to Leave Real Madrid after Club World Cup Campaign – THISDAYLIVE",
  "date": "20250523T064500Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nModric to Leave Real Madrid after Club World Cup Campaign\nReal Madrid captain Luka Modric has revealed he will leave the Spanish giants after the end of their Fifa Club World Cup campaign this summer.\nThe 39-year-old Croatia midfielder, the 2018 Ballon d’Or winner, will play his last match at Real’s Bernabeu home when they welcome Real Sociedad on Saturday in their final La Liga game of the season.\n“The moment has arrived. The moment I never wanted to come, but that’s football, and in life everything has a beginning and an end,” Modric said on Instagram.\nHe has won 28 trophies, including six Champions Leagues and four domestic titles, since joining Real from Spurs in 2012.\n“I arrived in 2012 with the hope of wearing the jersey of the best team in the world and the ambition to do great things, but I couldn’t have imagined what came next,” he said.\n“Playing for Real Madrid changed my life as a footballer and as a person.\n“I’m proud to have been part of one of the most successful eras of the best club in history.”\nReal will open their Club World Cup campaign against Saudi Arabia’s Al-Hilal on 18 June and will also face Mexico’s Pachuca and RB Salzburg of Austria in the group stage.\nModric bagged two goals and six assists in 34 appearances in the Spanish top flight this season as Real were pipped to the title by Barcelona.\nHe also featured in every game as Carlo Ancelotti’s side reached the quarter-finals of the Champions League, where they were beaten 5-1 on aggregate by Arsenal.\nModric signed a one-year contract extension last year, which expires at the end of this campaign.\nSaturday’s game will also be Ancelotti’s last in charge of Real, with Bayer Leverkusen boss Xabi Alonsoreportedly set to succeed the Italian.",
  "word_count": 307,
  "scraped_at": "2026-02-14T02:11:36.680358",
  "_text_extracted": true
}