{
  "article_id": "7ff9ddcaf8e6",
  "url": "https://www.skysports.com/football/news/11095/13501120/real-madrid-should-brace-for-what-comes-next-after-horrible-champions-league-disgrace",
  "title": "Real Madrid should brace for what comes next after 'horrible' Champions League 'disgrace'",
  "date": "",
  "domain": "skysports.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "web_scraped",
  "body_text": "Real Madrid should brace for what comes next after 'horrible' Champions League 'disgrace'\nReal Madrid failed to reach the Champions League round of 16 at the first time of asking with defeat to Benfica. The Athletic looks at what this means for the struggling Spanish giants.\nFriday 30 January 2026 16:11, UK\nBenfica's Estadio da Luz is where Real Madrid celebrated their illustrious and previously elusive 10th Champions League/European Cup in 2014. Last night, it hosted the latest entry in the Spanish giants' growing hall of shame.\nWednesday's 4-2 Champions League defeat was damaging and left signs of despair and disunity everywhere you looked after the final whistle. One such scene had Thibaut Courtois angrily reproaching his team-mates for not coming over to salute Madrid's travelling supporters, until five others eventually joined him.\nBy that time, head coach Alvaro Arbeloa had embraced his opposite number Jose Mourinho - a key mentor in his career - and was headed towards the urgent questions that awaited him in interviews, via a dressing room where the mood was more than downbeat.\nArbeloa was part of the Madrid squad that triumphed here in Lisbon 12 years ago, in another European epic defined by a late goal. Promoted to replace the sacked Xabi Alonso as head coach on January 12, this time he tasted bitter defeat - his second in these two and a half weeks and five games he has been in the job.\nCalling it a bumpy start would be an understatement. In his debut game, Madrid were knocked out of the Copa del Rey in an embarrassing reverse at Albacete, opponents battling relegation to Spain's third tier. In his first home game against Levante three days later, fans relentlessly jeered players and called for club president Florentino Perez to resign.\nFurthermore, nobody at Madrid has described Arbeloa's position as a long-term commitment. There has been speculation in the media about potential replacements from the outset.\nIt was not just Madrid throwing away their top-eight Champions League spot, and now having to contest an extra two matches in next month's play-offs if they are to make the round of 16. It was the nature of the defeat. The performance was terrible.\nArbeloa has not had much time to impose his vision on the team, but it is still striking how fragile Madrid are at the back, under a coach who enjoyed a great career as a defender.\nBenfica, third in the Portuguese top flight, managed 11 shots on target. Courtois, with seven key saves, was crucial to keeping the score down. Madrid were outplayed from start to finish, with Trubin sparking wild scenes of jubilation with his headed goal in the final play of the match.\nMadrid's situation at the back perfectly symbolises their shortcomings in many areas. Poor squad planning and recruitment, coupled with the club's much-criticised physical preparation, has forced first Alonso and now Arbeloa to field players at serious risk of injury, as they do not have enough strength in depth.\nArbeloa was unable to count on Trent Alexander-Arnold in Lisbon. Nor did he call on the other natural right-back, Dani Carvajal, who was an unused substitute despite having returned from injury on January 14.\nMadrid's two theoretical starting centre-backs, Eder Militao and Antonio Rudiger, are also injured, as is left-back Ferland Mendy. Last summer, €118million (£102m; $140m) was spent on Dean Huijsen, Alvaro Carreras and Alexander-Arnold, but they are not living up to the billing.\nFederico Valverde, who was again out of position at right-back, passed reporters on his way to the team bus, without stopping but saying \"We are to blame\".\nAsked for his reaction in his post-match press conference, the tension in Arbeloa's answer to one Spanish reporter's question was revealing.\n\"I just said it, I don't know if you heard me,\" he said. \"I am ultimately responsible. I also said it in Albacete, I don't know if you were at those press conferences, and I repeat: I am ultimately responsible.\"\nJude Bellingham, interviewed on Spain's Movistar TV, commented that he was \"running out of things to say\".\n\"It's horrible to lose in this manner,\" the England midfielder added. \"It's still a bit raw. I'm not really sure what to think.\"\nThe clearest analysis came from Kylian Mbappe, who scored Madrid's two goals (putting him two clear of Cristiano Ronaldo's record of 11 in a Champions League group stage) and did stop to speak with reporters.\n\"What we saw today is not normal,\" the France captain said. \"If we had been 5-1 down (at half-time), no one would have been surprised. The last goal is a disgrace for us.\n\"The game starts from the very first minute, not minute 45. It's a matter of wanting it more than your opponent. You could see that Benfica were playing for their lives, and we weren't.\"\nMadrid find out their Champions League play-off opponents in Friday's draw - it will either be Norwegian side Bodo/Glimt or Benfica again. Rodrygo and Raul Asencio will be suspended for the first leg, with both having been sent off late in Wednesday's game. Asencio picked up two yellow cards, while Rodrygo was shown a straight red.\nThen comes another key entry in this intriguing story around Arbeloa's side and the direction they take. The atmosphere at the Bernabeu against Rayo Vallecano on Sunday is expected to be very similar to what we saw against Levante on January 17.\nThat would be a clear message that fans' patience with this project has run out. Again, nobody should be surprised.\nThis article originally appeared in The Athletic.\n© 2026 The Athletic Media Company",
  "word_count": 937,
  "scraped_at": "2026-02-14T01:52:12.244180"
}